; ModuleID = 'src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"cat\00", align 1

!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !14, size: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!39 = !DIEnumerator(name: "_ISupper", value: 256)
!40 = !DIEnumerator(name: "_ISlower", value: 512)
!41 = !DIEnumerator(name: "_ISalpha", value: 1024)
!42 = !DIEnumerator(name: "_ISdigit", value: 2048)
!43 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!44 = !DIEnumerator(name: "_ISspace", value: 8192)
!45 = !DIEnumerator(name: "_ISprint", value: 16384)
!46 = !DIEnumerator(name: "_ISgraph", value: 32768)
!47 = !DIEnumerator(name: "_ISblank", value: 1)
!48 = !DIEnumerator(name: "_IScntrl", value: 2)
!49 = !DIEnumerator(name: "_ISpunct", value: 4)
!50 = !DIEnumerator(name: "_ISalnum", value: 8)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 79, baseType: !14, size: 32, elements: !53)
!52 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!53 = !{!54}
!54 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 36, baseType: !14, size: 32, elements: !57)
!56 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!57 = !{!58}
!58 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!59 = !{!8, !60, !61, !62, !63, !6, !64, !65, !67, !69}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!62 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!63 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 46, baseType: !63)
!66 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !{!0, !71, !73, !75, !160, !162, !164, !166, !168, !170}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "infile", scope: !10, file: !3, line: 50, type: !67, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "input_desc", scope: !10, file: !3, line: 53, type: !6, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !77, file: !78, line: 575, type: !6, isLocal: true, isDefinition: true)
!77 = distinct !DISubprogram(name: "oputs_", scope: !78, file: !78, line: 573, type: !79, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !81)
!78 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!79 = !DISubroutineType(types: !80)
!80 = !{null, !67, !67}
!81 = !{!82, !83, !84, !87, !88, !89, !90, !94, !95, !96, !97, !99, !154, !155, !156, !158, !159}
!82 = !DILocalVariable(name: "program", arg: 1, scope: !77, file: !78, line: 573, type: !67)
!83 = !DILocalVariable(name: "option", arg: 2, scope: !77, file: !78, line: 573, type: !67)
!84 = !DILocalVariable(name: "term", scope: !85, file: !78, line: 585, type: !67)
!85 = distinct !DILexicalBlock(scope: !86, file: !78, line: 582, column: 5)
!86 = distinct !DILexicalBlock(scope: !77, file: !78, line: 581, column: 7)
!87 = !DILocalVariable(name: "double_space", scope: !77, file: !78, line: 594, type: !61)
!88 = !DILocalVariable(name: "first_word", scope: !77, file: !78, line: 595, type: !67)
!89 = !DILocalVariable(name: "option_text", scope: !77, file: !78, line: 596, type: !67)
!90 = !DILocalVariable(name: "s", scope: !91, file: !78, line: 608, type: !67)
!91 = distinct !DILexicalBlock(scope: !92, file: !78, line: 605, column: 5)
!92 = distinct !DILexicalBlock(scope: !93, file: !78, line: 604, column: 12)
!93 = distinct !DILexicalBlock(scope: !77, file: !78, line: 597, column: 7)
!94 = !DILocalVariable(name: "spaces", scope: !91, file: !78, line: 609, type: !65)
!95 = !DILocalVariable(name: "anchor_len", scope: !77, file: !78, line: 620, type: !65)
!96 = !DILocalVariable(name: "desc_text", scope: !77, file: !78, line: 625, type: !67)
!97 = !DILocalVariable(name: "__ptr", scope: !98, file: !78, line: 644, type: !67)
!98 = distinct !DILexicalBlock(scope: !77, file: !78, line: 644, column: 3)
!99 = !DILocalVariable(name: "__stream", scope: !98, file: !78, line: 644, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !102, line: 7, baseType: !103)
!102 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !121, !123, !124, !125, !128, !129, !131, !135, !138, !140, !143, !146, !147, !148, !149, !150}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !103, file: !104, line: 51, baseType: !6, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !103, file: !104, line: 54, baseType: !8, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !103, file: !104, line: 55, baseType: !8, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !103, file: !104, line: 56, baseType: !8, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !103, file: !104, line: 57, baseType: !8, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !103, file: !104, line: 58, baseType: !8, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !103, file: !104, line: 59, baseType: !8, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !103, file: !104, line: 60, baseType: !8, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !103, file: !104, line: 61, baseType: !8, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !103, file: !104, line: 64, baseType: !8, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !103, file: !104, line: 65, baseType: !8, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !103, file: !104, line: 66, baseType: !8, size: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !103, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !104, line: 36, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !103, file: !104, line: 70, baseType: !122, size: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !103, file: !104, line: 72, baseType: !6, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !103, file: !104, line: 73, baseType: !6, size: 32, offset: 928)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !103, file: !104, line: 74, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !127, line: 152, baseType: !62)
!127 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !103, file: !104, line: 77, baseType: !64, size: 16, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !103, file: !104, line: 78, baseType: !130, size: 8, offset: 1040)
!130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !103, file: !104, line: 79, baseType: !132, size: 8, offset: 1048)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !103, file: !104, line: 81, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !104, line: 43, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !103, file: !104, line: 89, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !62)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !103, file: !104, line: 91, baseType: !141, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !104, line: 37, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !103, file: !104, line: 92, baseType: !144, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !104, line: 38, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !103, file: !104, line: 93, baseType: !122, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !103, file: !104, line: 94, baseType: !60, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !103, file: !104, line: 95, baseType: !65, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !103, file: !104, line: 96, baseType: !6, size: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !103, file: !104, line: 98, baseType: !151, size: 160, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !DILocalVariable(name: "__cnt", scope: !98, file: !78, line: 644, type: !65)
!155 = !DILocalVariable(name: "url_program", scope: !77, file: !78, line: 648, type: !67)
!156 = !DILocalVariable(name: "__ptr", scope: !157, file: !78, line: 686, type: !67)
!157 = distinct !DILexicalBlock(scope: !77, file: !78, line: 686, column: 3)
!158 = !DILocalVariable(name: "__stream", scope: !157, file: !78, line: 686, type: !100)
!159 = !DILocalVariable(name: "__cnt", scope: !157, file: !78, line: 686, type: !65)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "newlines2", scope: !10, file: !3, line: 77, type: !6, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "line_num_end", scope: !10, file: !3, line: 74, type: !8, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "line_num_start", scope: !10, file: !3, line: 71, type: !8, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "line_buf", scope: !10, file: !3, line: 59, type: !151, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "line_num_print", scope: !10, file: !3, line: 68, type: !8, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "pending_cr", scope: !10, file: !3, line: 80, type: !61, isLocal: true, isDefinition: true)
!172 = !{!173, !174, !175, !176, !214, !215, !216, !217, !218, !219, !220, !221, !222, !226, !227, !228, !229, !230, !231, !233, !234, !235, !240, !243, !244, !247, !249, !250}
!173 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 550, type: !6)
!174 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 550, type: !7)
!175 = !DILocalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 553, type: !61)
!176 = !DILocalVariable(name: "ostat_buf", scope: !2, file: !3, line: 555, type: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !178, line: 44, size: 1024, elements: !179)
!178 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!179 = !{!180, !182, !184, !186, !188, !190, !192, !193, !194, !195, !197, !198, !200, !208, !209, !210}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !177, file: !178, line: 46, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !127, line: 145, baseType: !63)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !177, file: !178, line: 47, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !127, line: 148, baseType: !63)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !177, file: !178, line: 48, baseType: !185, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !127, line: 150, baseType: !14)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !177, file: !178, line: 49, baseType: !187, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !127, line: 151, baseType: !14)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !177, file: !178, line: 50, baseType: !189, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !127, line: 146, baseType: !14)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !177, file: !178, line: 51, baseType: !191, size: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !127, line: 147, baseType: !14)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !177, file: !178, line: 52, baseType: !181, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !177, file: !178, line: 53, baseType: !181, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !177, file: !178, line: 54, baseType: !126, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !177, file: !178, line: 55, baseType: !196, size: 32, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !127, line: 175, baseType: !6)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !177, file: !178, line: 56, baseType: !6, size: 32, offset: 480)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !177, file: !178, line: 57, baseType: !199, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !127, line: 180, baseType: !62)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !177, file: !178, line: 65, baseType: !201, size: 128, offset: 576)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !202, line: 11, size: 128, elements: !203)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !201, file: !202, line: 16, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 160, baseType: !62)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !201, file: !202, line: 21, baseType: !207, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !127, line: 197, baseType: !62)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !177, file: !178, line: 66, baseType: !201, size: 128, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !177, file: !178, line: 67, baseType: !201, size: 128, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !177, file: !178, line: 79, baseType: !211, size: 64, offset: 960)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DILocalVariable(name: "number", scope: !2, file: !3, line: 558, type: !61)
!215 = !DILocalVariable(name: "number_nonblank", scope: !2, file: !3, line: 559, type: !61)
!216 = !DILocalVariable(name: "squeeze_blank", scope: !2, file: !3, line: 560, type: !61)
!217 = !DILocalVariable(name: "show_ends", scope: !2, file: !3, line: 561, type: !61)
!218 = !DILocalVariable(name: "show_nonprinting", scope: !2, file: !3, line: 562, type: !61)
!219 = !DILocalVariable(name: "show_tabs", scope: !2, file: !3, line: 563, type: !61)
!220 = !DILocalVariable(name: "file_open_mode", scope: !2, file: !3, line: 564, type: !6)
!221 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 594, type: !6)
!222 = !DILocalVariable(name: "outsize", scope: !2, file: !3, line: 660, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !224, line: 130, baseType: !225)
!224 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !66, line: 35, baseType: !62)
!226 = !DILocalVariable(name: "out_flags", scope: !2, file: !3, line: 663, type: !6)
!227 = !DILocalVariable(name: "out_isreg", scope: !2, file: !3, line: 666, type: !61)
!228 = !DILocalVariable(name: "argind", scope: !2, file: !3, line: 677, type: !6)
!229 = !DILocalVariable(name: "ok", scope: !2, file: !3, line: 678, type: !61)
!230 = !DILocalVariable(name: "page_size", scope: !2, file: !3, line: 679, type: !223)
!231 = !DILocalVariable(name: "reading_stdin", scope: !232, file: !3, line: 686, type: !61)
!232 = distinct !DILexicalBlock(scope: !2, file: !3, line: 682, column: 5)
!233 = !DILocalVariable(name: "istat_buf", scope: !232, file: !3, line: 705, type: !177)
!234 = !DILocalVariable(name: "insize", scope: !232, file: !3, line: 714, type: !223)
!235 = !DILocalVariable(name: "in_pos", scope: !236, file: !3, line: 727, type: !238)
!236 = distinct !DILexicalBlock(scope: !237, file: !3, line: 726, column: 9)
!237 = distinct !DILexicalBlock(scope: !232, file: !3, line: 722, column: 11)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !239, line: 63, baseType: !126)
!239 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!240 = !DILocalVariable(name: "whence", scope: !241, file: !3, line: 732, type: !6)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 729, column: 13)
!242 = distinct !DILexicalBlock(scope: !236, file: !3, line: 728, column: 15)
!243 = !DILocalVariable(name: "inbuf", scope: !232, file: !3, line: 745, type: !8)
!244 = !DILocalVariable(name: "copy_cat_status", scope: !245, file: !3, line: 754, type: !6)
!245 = distinct !DILexicalBlock(scope: !246, file: !3, line: 753, column: 9)
!246 = distinct !DILexicalBlock(scope: !232, file: !3, line: 751, column: 11)
!247 = !DILocalVariable(name: "bufsize", scope: !248, file: !3, line: 794, type: !223)
!248 = distinct !DILexicalBlock(scope: !246, file: !3, line: 769, column: 9)
!249 = !DILocalVariable(name: "outbuf", scope: !248, file: !3, line: 799, type: !8)
!250 = !DILabel(scope: !232, name: "contin", file: !3, line: 810)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 2560, elements: !261)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !254, line: 50, size: 256, elements: !255)
!254 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!255 = !{!256, !257, !258, !260}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 52, baseType: !67, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !253, file: !254, line: 55, baseType: !6, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !254, line: 56, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !253, file: !254, line: 57, baseType: !6, size: 32, offset: 192)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "Version", scope: !266, file: !267, line: 3, type: !67, isLocal: false, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !268, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!268 = !{!264}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "file_name", scope: !271, file: !272, line: 45, type: !67, isLocal: true, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !273, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!273 = !{!269, !274}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !271, file: !272, line: 55, type: !61, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !278, file: !279, line: 66, type: !313, isLocal: false, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !280, globals: !281, splitDebugInlining: false, nameTableKind: None)
!279 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!280 = !{!60, !69}
!281 = !{!282, !307, !276, !309, !311}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "old_file_name", scope: !284, file: !279, line: 304, type: !67, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "verror_at_line", scope: !279, file: !279, line: 298, type: !285, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !278, retainedNodes: !300)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !6, !6, !67, !14, !67, !287}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !239, line: 52, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !289, line: 32, baseType: !290)
!289 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !291, baseType: !292)
!291 = !DIFile(filename: "lib/error.c", directory: "/src")
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !293, size: 256, elements: !294)
!293 = !DINamespace(name: "std", scope: null)
!294 = !{!295, !296, !297, !298, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !292, file: !291, baseType: !60, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !292, file: !291, baseType: !60, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !292, file: !291, baseType: !60, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !292, file: !291, baseType: !6, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !292, file: !291, baseType: !6, size: 32, offset: 224)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DILocalVariable(name: "status", arg: 1, scope: !284, file: !279, line: 298, type: !6)
!302 = !DILocalVariable(name: "errnum", arg: 2, scope: !284, file: !279, line: 298, type: !6)
!303 = !DILocalVariable(name: "file_name", arg: 3, scope: !284, file: !279, line: 298, type: !67)
!304 = !DILocalVariable(name: "line_number", arg: 4, scope: !284, file: !279, line: 298, type: !14)
!305 = !DILocalVariable(name: "message", arg: 5, scope: !284, file: !279, line: 298, type: !67)
!306 = !DILocalVariable(name: "args", arg: 6, scope: !284, file: !279, line: 298, type: !287)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "old_line_number", scope: !284, file: !279, line: 305, type: !14, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "error_message_count", scope: !278, file: !279, line: 69, type: !14, isLocal: false, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !278, file: !279, line: 295, type: !6, isLocal: false, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !318, file: !319, line: 506, type: !6, isLocal: true, isDefinition: true)
!318 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !319, file: !319, line: 485, type: !320, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !322, retainedNodes: !324)
!319 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!320 = !DISubroutineType(types: !321)
!321 = !{!6, !6, !6}
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !323, splitDebugInlining: false, nameTableKind: None)
!323 = !{!316}
!324 = !{!325, !326, !327, !328, !331}
!325 = !DILocalVariable(name: "fd", arg: 1, scope: !318, file: !319, line: 485, type: !6)
!326 = !DILocalVariable(name: "target", arg: 2, scope: !318, file: !319, line: 485, type: !6)
!327 = !DILocalVariable(name: "result", scope: !318, file: !319, line: 487, type: !6)
!328 = !DILocalVariable(name: "flags", scope: !329, file: !319, line: 530, type: !6)
!329 = distinct !DILexicalBlock(scope: !330, file: !319, line: 529, column: 5)
!330 = distinct !DILexicalBlock(scope: !318, file: !319, line: 528, column: 7)
!331 = !DILocalVariable(name: "saved_errno", scope: !332, file: !319, line: 533, type: !6)
!332 = distinct !DILexicalBlock(scope: !333, file: !319, line: 532, column: 9)
!333 = distinct !DILexicalBlock(scope: !329, file: !319, line: 531, column: 11)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "program_name", scope: !336, file: !337, line: 31, type: !67, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !339, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!338 = !{!8}
!339 = !{!334}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "utf07FF", scope: !342, file: !343, line: 46, type: !373, isLocal: true, isDefinition: true)
!342 = distinct !DISubprogram(name: "proper_name_lite", scope: !343, file: !343, line: 38, type: !344, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !348)
!343 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!344 = !DISubroutineType(types: !345)
!345 = !{!67, !67, !67}
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !347, splitDebugInlining: false, nameTableKind: None)
!347 = !{!340}
!348 = !{!349, !350, !351, !352, !357}
!349 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !342, file: !343, line: 38, type: !67)
!350 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !342, file: !343, line: 38, type: !67)
!351 = !DILocalVariable(name: "translation", scope: !342, file: !343, line: 40, type: !67)
!352 = !DILocalVariable(name: "w", scope: !342, file: !343, line: 47, type: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !354, line: 37, baseType: !355)
!354 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !127, line: 57, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !127, line: 42, baseType: !14)
!357 = !DILocalVariable(name: "mbs", scope: !342, file: !343, line: 48, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !359, line: 6, baseType: !360)
!359 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !361, line: 21, baseType: !362)
!361 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 13, size: 64, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !362, file: !361, line: 15, baseType: !6, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !362, file: !361, line: 20, baseType: !366, size: 32, offset: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !362, file: !361, line: 16, size: 32, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !366, file: !361, line: 18, baseType: !14, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !366, file: !361, line: 19, baseType: !370, size: 32)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 4)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16, elements: !212)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !376, file: !377, line: 76, type: !443, isLocal: false, isDefinition: true)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !378, retainedTypes: !384, globals: !385, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!378 = !{!12, !379, !36}
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 254, baseType: !14, size: 32, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!382 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!383 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!384 = !{!6, !64, !65}
!385 = !{!374, !386, !390, !402, !404, !409, !432, !439, !441}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !376, file: !377, line: 92, type: !388, isLocal: false, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 320, elements: !261)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !376, file: !377, line: 1040, type: !392, isLocal: false, isDefinition: true)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !377, line: 56, size: 448, elements: !393)
!393 = !{!394, !395, !396, !400, !401}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !392, file: !377, line: 59, baseType: !12, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !377, line: 62, baseType: !6, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !392, file: !377, line: 66, baseType: !397, size: 256, offset: 64)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !392, file: !377, line: 69, baseType: !67, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !392, file: !377, line: 72, baseType: !67, size: 64, offset: 384)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !376, file: !377, line: 107, type: !392, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "slot0", scope: !376, file: !377, line: 831, type: !406, isLocal: true, isDefinition: true)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 256)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "quote", scope: !411, file: !377, line: 228, type: !430, isLocal: true, isDefinition: true)
!411 = distinct !DISubprogram(name: "gettext_quote", scope: !377, file: !377, line: 197, type: !412, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!67, !67, !12}
!414 = !{!415, !416, !417, !418, !419}
!415 = !DILocalVariable(name: "msgid", arg: 1, scope: !411, file: !377, line: 197, type: !67)
!416 = !DILocalVariable(name: "s", arg: 2, scope: !411, file: !377, line: 197, type: !12)
!417 = !DILocalVariable(name: "translation", scope: !411, file: !377, line: 199, type: !67)
!418 = !DILocalVariable(name: "w", scope: !411, file: !377, line: 229, type: !353)
!419 = !DILocalVariable(name: "mbs", scope: !411, file: !377, line: 230, type: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !359, line: 6, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !361, line: 21, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 13, size: 64, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !422, file: !361, line: 15, baseType: !6, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !422, file: !361, line: 20, baseType: !426, size: 32, offset: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !422, file: !361, line: 16, size: 32, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !426, file: !361, line: 18, baseType: !14, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !426, file: !361, line: 19, baseType: !370, size: 32)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !431)
!431 = !{!213, !372}
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "slotvec", scope: !376, file: !377, line: 834, type: !434, isLocal: true, isDefinition: true)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !377, line: 823, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !435, file: !377, line: 825, baseType: !65, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !435, file: !377, line: 826, baseType: !8, size: 64, offset: 64)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "nslots", scope: !376, file: !377, line: 832, type: !6, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "slotvec0", scope: !376, file: !377, line: 833, type: !435, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 704, elements: !445)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!445 = !{!446}
!446 = !DISubrange(count: 11)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !449, file: !450, line: 26, type: !452, isLocal: false, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !451, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!451 = !{!447}
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 376, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 47)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "exit_failure", scope: !457, file: !458, line: 24, type: !460, isLocal: false, isDefinition: true)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !459, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!459 = !{!455}
!460 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "internal_state", scope: !463, file: !464, line: 97, type: !467, isLocal: true, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !465, globals: !466, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!465 = !{!60, !65, !69}
!466 = !{!461}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !359, line: 6, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !361, line: 21, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !361, line: 13, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !469, file: !361, line: 15, baseType: !6, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !469, file: !361, line: 20, baseType: !473, size: 32, offset: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !361, line: 16, size: 32, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !473, file: !361, line: 18, baseType: !14, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !473, file: !361, line: 19, baseType: !370, size: 32)
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!479 = !{!55}
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !482, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!482 = !{!27}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !487, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!487 = !{!67}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !479, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!492 = !{!65}
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !495, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!495 = !{!496}
!496 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !494, line: 40, baseType: !14, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!499 = !{!60}
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !492, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, retainedTypes: !532, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!504 = !{!505, !517}
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !506, file: !503, line: 188, baseType: !14, size: 32, elements: !515)
!506 = distinct !DISubprogram(name: "x2nrealloc", scope: !503, file: !503, line: 176, type: !507, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !502, retainedNodes: !510)
!507 = !DISubroutineType(types: !508)
!508 = !{!60, !60, !509, !65}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!510 = !{!511, !512, !513, !514}
!511 = !DILocalVariable(name: "p", arg: 1, scope: !506, file: !503, line: 176, type: !60)
!512 = !DILocalVariable(name: "pn", arg: 2, scope: !506, file: !503, line: 176, type: !509)
!513 = !DILocalVariable(name: "s", arg: 3, scope: !506, file: !503, line: 176, type: !65)
!514 = !DILocalVariable(name: "n", scope: !506, file: !503, line: 178, type: !65)
!515 = !{!516}
!516 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !518, file: !503, line: 228, baseType: !14, size: 32, elements: !515)
!518 = distinct !DISubprogram(name: "xpalloc", scope: !503, file: !503, line: 223, type: !519, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !502, retainedNodes: !522)
!519 = !DISubroutineType(types: !520)
!520 = !{!60, !60, !521, !223, !225, !223}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531}
!523 = !DILocalVariable(name: "pa", arg: 1, scope: !518, file: !503, line: 223, type: !60)
!524 = !DILocalVariable(name: "pn", arg: 2, scope: !518, file: !503, line: 223, type: !521)
!525 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !518, file: !503, line: 223, type: !223)
!526 = !DILocalVariable(name: "n_max", arg: 4, scope: !518, file: !503, line: 223, type: !225)
!527 = !DILocalVariable(name: "s", arg: 5, scope: !518, file: !503, line: 223, type: !223)
!528 = !DILocalVariable(name: "n0", scope: !518, file: !503, line: 230, type: !223)
!529 = !DILocalVariable(name: "n", scope: !518, file: !503, line: 237, type: !223)
!530 = !DILocalVariable(name: "nbytes", scope: !518, file: !503, line: 248, type: !223)
!531 = !DILocalVariable(name: "adjusted_nbytes", scope: !518, file: !503, line: 252, type: !223)
!532 = !{!8, !60, !61, !62, !63}
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !545, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!545 = !{!61, !63, !60}
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!550 = distinct !DICompileUnit(language: DW_LANG_C99, file: !551, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!551 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!552 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!553 = !{i32 7, !"Dwarf Version", i32 5}
!554 = !{i32 2, !"Debug Info Version", i32 3}
!555 = !{i32 1, !"wchar_size", i32 4}
!556 = !{i32 1, !"branch-target-enforcement", i32 0}
!557 = !{i32 1, !"sign-return-address", i32 0}
!558 = !{i32 1, !"sign-return-address-all", i32 0}
!559 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!560 = !{i32 7, !"PIC Level", i32 2}
!561 = !{i32 7, !"PIE Level", i32 2}
!562 = !{i32 7, !"uwtable", i32 1}
!563 = !{i32 7, !"frame-pointer", i32 1}
!564 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 83, type: !565, scopeLine: 84, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !6}
!567 = !{!568}
!568 = !DILocalVariable(name: "status", arg: 1, scope: !564, file: !3, line: 83, type: !6)
!569 = !DILocation(line: 0, scope: !564)
!570 = !DILocation(line: 85, column: 14, scope: !571)
!571 = distinct !DILexicalBlock(scope: !564, file: !3, line: 85, column: 7)
!572 = !DILocation(line: 85, column: 7, scope: !564)
!573 = !DILocation(line: 86, column: 5, scope: !574)
!574 = distinct !DILexicalBlock(scope: !571, file: !3, line: 86, column: 5)
!575 = !{!576, !576, i64 0}
!576 = !{!"any pointer", !577, i64 0}
!577 = !{!"omnipotent char", !578, i64 0}
!578 = !{!"Simple C/C++ TBAA"}
!579 = !DILocation(line: 89, column: 7, scope: !580)
!580 = distinct !DILexicalBlock(scope: !571, file: !3, line: 88, column: 5)
!581 = !DILocation(line: 93, column: 7, scope: !580)
!582 = !DILocation(line: 729, column: 3, scope: !583, inlinedAt: !585)
!583 = distinct !DISubprogram(name: "emit_stdin_note", scope: !78, file: !78, line: 727, type: !314, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !584)
!584 = !{}
!585 = distinct !DILocation(line: 97, column: 7, scope: !580)
!586 = !DILocation(line: 99, column: 7, scope: !580)
!587 = !DILocation(line: 102, column: 7, scope: !580)
!588 = !DILocation(line: 105, column: 7, scope: !580)
!589 = !DILocation(line: 108, column: 7, scope: !580)
!590 = !DILocation(line: 111, column: 7, scope: !580)
!591 = !DILocation(line: 114, column: 7, scope: !580)
!592 = !DILocation(line: 117, column: 7, scope: !580)
!593 = !DILocation(line: 120, column: 7, scope: !580)
!594 = !DILocation(line: 123, column: 7, scope: !580)
!595 = !DILocation(line: 126, column: 7, scope: !580)
!596 = !DILocation(line: 129, column: 7, scope: !580)
!597 = !DILocation(line: 130, column: 7, scope: !580)
!598 = !DILocation(line: 131, column: 7, scope: !580)
!599 = !DILocalVariable(name: "program", arg: 1, scope: !600, file: !78, line: 836, type: !67)
!600 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !78, file: !78, line: 836, type: !601, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !603)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !67}
!603 = !{!599, !604, !613, !614, !616, !617}
!604 = !DILocalVariable(name: "infomap", scope: !600, file: !78, line: 838, type: !605)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 896, elements: !611)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !600, file: !78, line: 838, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !607, file: !78, line: 838, baseType: !67, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !607, file: !78, line: 838, baseType: !67, size: 64, offset: 64)
!611 = !{!612}
!612 = !DISubrange(count: 7)
!613 = !DILocalVariable(name: "node", scope: !600, file: !78, line: 848, type: !67)
!614 = !DILocalVariable(name: "map_prog", scope: !600, file: !78, line: 849, type: !615)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!616 = !DILocalVariable(name: "lc_messages", scope: !600, file: !78, line: 861, type: !67)
!617 = !DILocalVariable(name: "url_program", scope: !600, file: !78, line: 874, type: !67)
!618 = !DILocation(line: 0, scope: !600, inlinedAt: !619)
!619 = distinct !DILocation(line: 138, column: 7, scope: !580)
!620 = !DILocation(line: 838, column: 3, scope: !600, inlinedAt: !619)
!621 = !DILocation(line: 838, column: 67, scope: !600, inlinedAt: !619)
!622 = !DILocation(line: 849, column: 36, scope: !600, inlinedAt: !619)
!623 = !DILocation(line: 851, column: 3, scope: !600, inlinedAt: !619)
!624 = !DILocalVariable(name: "__s1", arg: 1, scope: !625, file: !626, line: 1359, type: !67)
!625 = distinct !DISubprogram(name: "streq", scope: !626, file: !626, line: 1359, type: !627, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !629)
!626 = !DIFile(filename: "./lib/string.h", directory: "/src")
!627 = !DISubroutineType(types: !628)
!628 = !{!61, !67, !67}
!629 = !{!624, !630}
!630 = !DILocalVariable(name: "__s2", arg: 2, scope: !625, file: !626, line: 1359, type: !67)
!631 = !DILocation(line: 0, scope: !625, inlinedAt: !632)
!632 = distinct !DILocation(line: 851, column: 33, scope: !600, inlinedAt: !619)
!633 = !DILocation(line: 1361, column: 11, scope: !625, inlinedAt: !632)
!634 = !DILocation(line: 1361, column: 10, scope: !625, inlinedAt: !632)
!635 = !DILocation(line: 852, column: 13, scope: !600, inlinedAt: !619)
!636 = !DILocation(line: 851, column: 20, scope: !600, inlinedAt: !619)
!637 = !{!638, !576, i64 0}
!638 = !{!"infomap", !576, i64 0, !576, i64 8}
!639 = !DILocation(line: 851, column: 10, scope: !600, inlinedAt: !619)
!640 = !DILocation(line: 851, column: 28, scope: !600, inlinedAt: !619)
!641 = distinct !{!641, !623, !635, !642}
!642 = !{!"llvm.loop.mustprogress"}
!643 = !DILocation(line: 854, column: 17, scope: !644, inlinedAt: !619)
!644 = distinct !DILexicalBlock(scope: !600, file: !78, line: 854, column: 7)
!645 = !{!638, !576, i64 8}
!646 = !DILocation(line: 854, column: 7, scope: !644, inlinedAt: !619)
!647 = !DILocation(line: 854, column: 7, scope: !600, inlinedAt: !619)
!648 = !DILocation(line: 857, column: 3, scope: !600, inlinedAt: !619)
!649 = !DILocation(line: 861, column: 29, scope: !600, inlinedAt: !619)
!650 = !DILocation(line: 862, column: 7, scope: !651, inlinedAt: !619)
!651 = distinct !DILexicalBlock(scope: !600, file: !78, line: 862, column: 7)
!652 = !DILocation(line: 862, column: 19, scope: !651, inlinedAt: !619)
!653 = !DILocation(line: 862, column: 22, scope: !651, inlinedAt: !619)
!654 = !DILocation(line: 862, column: 7, scope: !600, inlinedAt: !619)
!655 = !DILocation(line: 868, column: 7, scope: !656, inlinedAt: !619)
!656 = distinct !DILexicalBlock(scope: !651, file: !78, line: 863, column: 5)
!657 = !DILocation(line: 870, column: 5, scope: !656, inlinedAt: !619)
!658 = !DILocation(line: 0, scope: !625, inlinedAt: !659)
!659 = distinct !DILocation(line: 874, column: 29, scope: !600, inlinedAt: !619)
!660 = !DILocation(line: 875, column: 3, scope: !600, inlinedAt: !619)
!661 = !DILocation(line: 877, column: 3, scope: !600, inlinedAt: !619)
!662 = !DILocation(line: 879, column: 1, scope: !600, inlinedAt: !619)
!663 = !DILocation(line: 140, column: 3, scope: !564)
!664 = !DISubprogram(name: "dcgettext", scope: !665, file: !665, line: 51, type: !666, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !584)
!665 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!666 = !DISubroutineType(types: !667)
!667 = !{!8, !67, !67, !6}
!668 = !DISubprogram(name: "fputs_unlocked", scope: !239, file: !239, line: 691, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !584)
!669 = !DISubroutineType(types: !670)
!670 = !{!6, !671, !672}
!671 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !67)
!672 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!673 = !DILocation(line: 0, scope: !77)
!674 = !DILocation(line: 581, column: 7, scope: !86)
!675 = !{!676, !676, i64 0}
!676 = !{!"int", !577, i64 0}
!677 = !DILocation(line: 581, column: 19, scope: !86)
!678 = !DILocation(line: 581, column: 7, scope: !77)
!679 = !DILocation(line: 585, column: 26, scope: !85)
!680 = !DILocation(line: 0, scope: !85)
!681 = !DILocation(line: 586, column: 23, scope: !85)
!682 = !DILocation(line: 586, column: 28, scope: !85)
!683 = !DILocation(line: 586, column: 32, scope: !85)
!684 = !{!577, !577, i64 0}
!685 = !DILocation(line: 586, column: 38, scope: !85)
!686 = !DILocation(line: 0, scope: !625, inlinedAt: !687)
!687 = distinct !DILocation(line: 586, column: 41, scope: !85)
!688 = !DILocation(line: 1361, column: 11, scope: !625, inlinedAt: !687)
!689 = !DILocation(line: 1361, column: 10, scope: !625, inlinedAt: !687)
!690 = !DILocation(line: 586, column: 19, scope: !85)
!691 = !DILocation(line: 587, column: 5, scope: !85)
!692 = !DILocation(line: 588, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !77, file: !78, line: 588, column: 7)
!694 = !DILocation(line: 588, column: 7, scope: !77)
!695 = !DILocation(line: 590, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !78, line: 589, column: 5)
!697 = !DILocation(line: 591, column: 7, scope: !696)
!698 = !DILocation(line: 595, column: 37, scope: !77)
!699 = !DILocation(line: 595, column: 35, scope: !77)
!700 = !DILocation(line: 596, column: 29, scope: !77)
!701 = !DILocation(line: 597, column: 8, scope: !93)
!702 = !DILocation(line: 597, column: 7, scope: !77)
!703 = !DILocation(line: 604, column: 24, scope: !92)
!704 = !DILocation(line: 604, column: 12, scope: !93)
!705 = !DILocation(line: 0, scope: !91)
!706 = !DILocation(line: 610, column: 16, scope: !91)
!707 = !DILocation(line: 610, column: 7, scope: !91)
!708 = !DILocation(line: 611, column: 21, scope: !91)
!709 = !{!710, !710, i64 0}
!710 = !{!"short", !577, i64 0}
!711 = !DILocation(line: 611, column: 19, scope: !91)
!712 = !DILocation(line: 611, column: 16, scope: !91)
!713 = !DILocation(line: 610, column: 30, scope: !91)
!714 = distinct !{!714, !707, !708, !642}
!715 = !DILocation(line: 612, column: 18, scope: !716)
!716 = distinct !DILexicalBlock(scope: !91, file: !78, line: 612, column: 11)
!717 = !DILocation(line: 612, column: 11, scope: !91)
!718 = !DILocation(line: 620, column: 23, scope: !77)
!719 = !DILocation(line: 625, column: 39, scope: !77)
!720 = !DILocation(line: 626, column: 3, scope: !77)
!721 = !DILocation(line: 626, column: 10, scope: !77)
!722 = !DILocation(line: 626, column: 21, scope: !77)
!723 = !DILocation(line: 628, column: 44, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !78, line: 628, column: 11)
!725 = distinct !DILexicalBlock(scope: !77, file: !78, line: 627, column: 5)
!726 = !DILocation(line: 628, column: 32, scope: !724)
!727 = !DILocation(line: 628, column: 49, scope: !724)
!728 = !DILocation(line: 628, column: 11, scope: !725)
!729 = !DILocation(line: 630, column: 11, scope: !730)
!730 = distinct !DILexicalBlock(scope: !725, file: !78, line: 630, column: 11)
!731 = !DILocation(line: 630, column: 11, scope: !725)
!732 = !DILocation(line: 632, column: 26, scope: !733)
!733 = distinct !DILexicalBlock(scope: !734, file: !78, line: 632, column: 15)
!734 = distinct !DILexicalBlock(scope: !730, file: !78, line: 631, column: 9)
!735 = !DILocation(line: 632, column: 34, scope: !733)
!736 = !DILocation(line: 632, column: 37, scope: !733)
!737 = !DILocation(line: 632, column: 15, scope: !734)
!738 = !DILocation(line: 636, column: 29, scope: !739)
!739 = distinct !DILexicalBlock(scope: !734, file: !78, line: 636, column: 15)
!740 = !DILocation(line: 640, column: 16, scope: !725)
!741 = distinct !{!741, !720, !742, !642}
!742 = !DILocation(line: 641, column: 5, scope: !77)
!743 = !DILocation(line: 644, column: 3, scope: !77)
!744 = !DILocation(line: 0, scope: !625, inlinedAt: !745)
!745 = distinct !DILocation(line: 648, column: 31, scope: !77)
!746 = !DILocation(line: 0, scope: !625, inlinedAt: !747)
!747 = distinct !DILocation(line: 649, column: 31, scope: !77)
!748 = !DILocation(line: 0, scope: !625, inlinedAt: !749)
!749 = distinct !DILocation(line: 650, column: 31, scope: !77)
!750 = !DILocation(line: 0, scope: !625, inlinedAt: !751)
!751 = distinct !DILocation(line: 651, column: 31, scope: !77)
!752 = !DILocation(line: 0, scope: !625, inlinedAt: !753)
!753 = distinct !DILocation(line: 652, column: 31, scope: !77)
!754 = !DILocation(line: 0, scope: !625, inlinedAt: !755)
!755 = distinct !DILocation(line: 653, column: 31, scope: !77)
!756 = !DILocation(line: 0, scope: !625, inlinedAt: !757)
!757 = distinct !DILocation(line: 654, column: 31, scope: !77)
!758 = !DILocation(line: 0, scope: !625, inlinedAt: !759)
!759 = distinct !DILocation(line: 655, column: 31, scope: !77)
!760 = !DILocation(line: 0, scope: !625, inlinedAt: !761)
!761 = distinct !DILocation(line: 656, column: 31, scope: !77)
!762 = !DILocation(line: 0, scope: !625, inlinedAt: !763)
!763 = distinct !DILocation(line: 657, column: 31, scope: !77)
!764 = !DILocation(line: 663, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !77, file: !78, line: 663, column: 7)
!766 = !DILocation(line: 664, column: 7, scope: !765)
!767 = !DILocation(line: 664, column: 10, scope: !765)
!768 = !DILocation(line: 663, column: 7, scope: !77)
!769 = !DILocation(line: 669, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !765, file: !78, line: 665, column: 5)
!771 = !DILocation(line: 671, column: 5, scope: !770)
!772 = !DILocation(line: 676, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !765, file: !78, line: 673, column: 5)
!774 = !DILocation(line: 679, column: 3, scope: !77)
!775 = !DILocation(line: 683, column: 3, scope: !77)
!776 = !DILocation(line: 686, column: 3, scope: !77)
!777 = !DILocation(line: 688, column: 3, scope: !77)
!778 = !DILocation(line: 691, column: 3, scope: !77)
!779 = !DILocation(line: 695, column: 3, scope: !77)
!780 = !DILocation(line: 696, column: 1, scope: !77)
!781 = !DISubprogram(name: "setlocale", scope: !782, file: !782, line: 122, type: !783, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !584)
!782 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!783 = !DISubroutineType(types: !784)
!784 = !{!8, !6, !67}
!785 = !DISubprogram(name: "getenv", scope: !786, file: !786, line: 641, type: !787, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !584)
!786 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!787 = !DISubroutineType(types: !788)
!788 = !{!8, !67}
!789 = !DISubprogram(name: "fwrite_unlocked", scope: !239, file: !239, line: 704, type: !790, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !584)
!790 = !DISubroutineType(types: !791)
!791 = !{!65, !792, !65, !65, !672}
!792 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!795 = !DILocation(line: 0, scope: !2)
!796 = !DILocation(line: 555, column: 3, scope: !2)
!797 = !DILocation(line: 555, column: 15, scope: !2)
!798 = !DILocation(line: 581, column: 21, scope: !2)
!799 = !DILocation(line: 581, column: 3, scope: !2)
!800 = !DILocation(line: 582, column: 3, scope: !2)
!801 = !DILocation(line: 583, column: 3, scope: !2)
!802 = !DILocation(line: 584, column: 3, scope: !2)
!803 = !DILocation(line: 590, column: 3, scope: !2)
!804 = !DILocation(line: 595, column: 3, scope: !2)
!805 = !DILocation(line: 595, column: 15, scope: !2)
!806 = distinct !{!806, !804, !807, !642}
!807 = !DILocation(line: 652, column: 5, scope: !2)
!808 = !DILocation(line: 603, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !3, line: 599, column: 9)
!810 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 5)
!811 = !DILocation(line: 608, column: 11, scope: !809)
!812 = !DILocation(line: 612, column: 11, scope: !809)
!813 = !DILocation(line: 616, column: 11, scope: !809)
!814 = !DILocation(line: 621, column: 11, scope: !809)
!815 = !DILocation(line: 629, column: 11, scope: !809)
!816 = !DILocation(line: 635, column: 11, scope: !809)
!817 = !DILocation(line: 639, column: 11, scope: !809)
!818 = !DILocation(line: 643, column: 11, scope: !809)
!819 = !DILocation(line: 645, column: 9, scope: !809)
!820 = !DILocation(line: 647, column: 9, scope: !809)
!821 = !DILocation(line: 650, column: 11, scope: !809)
!822 = !DILocation(line: 656, column: 7, scope: !823)
!823 = distinct !DILexicalBlock(scope: !2, file: !3, line: 656, column: 7)
!824 = !DILocation(line: 656, column: 41, scope: !823)
!825 = !DILocation(line: 656, column: 7, scope: !2)
!826 = !DILocation(line: 657, column: 5, scope: !823)
!827 = !DILocalVariable(name: "st", arg: 1, scope: !828, file: !52, line: 81, type: !831)
!828 = distinct !DISubprogram(name: "io_blksize", scope: !52, file: !52, line: 81, type: !829, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !833)
!829 = !DISubroutineType(types: !830)
!830 = !{!223, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!833 = !{!827, !834, !835, !838}
!834 = !DILocalVariable(name: "blocksize", scope: !828, file: !52, line: 84, type: !223)
!835 = !DILocalVariable(name: "leading_zeros", scope: !836, file: !52, line: 98, type: !6)
!836 = distinct !DILexicalBlock(scope: !837, file: !52, line: 97, column: 5)
!837 = distinct !DILexicalBlock(scope: !828, file: !52, line: 96, column: 7)
!838 = !DILocalVariable(name: "power", scope: !839, file: !52, line: 101, type: !841)
!839 = distinct !DILexicalBlock(scope: !840, file: !52, line: 100, column: 9)
!840 = distinct !DILexicalBlock(scope: !836, file: !52, line: 99, column: 11)
!841 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!842 = !DILocation(line: 0, scope: !828, inlinedAt: !843)
!843 = distinct !DILocation(line: 660, column: 19, scope: !2)
!844 = !DILocation(line: 84, column: 21, scope: !828, inlinedAt: !843)
!845 = !{!846, !676, i64 56}
!846 = !{!"stat", !847, i64 0, !847, i64 8, !676, i64 16, !676, i64 20, !676, i64 24, !676, i64 28, !847, i64 32, !847, i64 40, !847, i64 48, !676, i64 56, !676, i64 60, !847, i64 64, !848, i64 72, !848, i64 88, !848, i64 104, !577, i64 120}
!847 = !{!"long", !577, i64 0}
!848 = !{!"timespec", !847, i64 0, !847, i64 8}
!849 = !DILocation(line: 84, column: 58, scope: !828, inlinedAt: !843)
!850 = !DILocation(line: 88, column: 52, scope: !828, inlinedAt: !843)
!851 = !DILocation(line: 88, column: 33, scope: !828, inlinedAt: !843)
!852 = !DILocation(line: 88, column: 13, scope: !828, inlinedAt: !843)
!853 = !DILocation(line: 96, column: 7, scope: !837, inlinedAt: !843)
!854 = !{!846, !676, i64 16}
!855 = !{i64 0, i64 65}
!856 = !DILocation(line: 96, column: 29, scope: !837, inlinedAt: !843)
!857 = !DILocalVariable(name: "n", arg: 1, scope: !858, file: !859, line: 436, type: !841)
!858 = distinct !DISubprogram(name: "stdc_leading_zeros_ull", scope: !859, file: !859, line: 436, type: !860, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !862)
!859 = !DIFile(filename: "./lib/stdbit.h", directory: "/src", checksumkind: CSK_MD5, checksum: "22a94c18744c4eadd69210db6ede4b9c")
!860 = !DISubroutineType(types: !861)
!861 = !{!14, !841}
!862 = !{!857}
!863 = !DILocation(line: 0, scope: !858, inlinedAt: !864)
!864 = distinct !DILocation(line: 98, column: 27, scope: !836, inlinedAt: !843)
!865 = !DILocalVariable(name: "n", arg: 1, scope: !866, file: !859, line: 149, type: !841)
!866 = distinct !DISubprogram(name: "_gl_stdbit_clzll", scope: !859, file: !859, line: 149, type: !867, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{!6, !841}
!869 = !{!865}
!870 = !DILocation(line: 0, scope: !866, inlinedAt: !871)
!871 = distinct !DILocation(line: 438, column: 10, scope: !858, inlinedAt: !864)
!872 = !DILocation(line: 151, column: 10, scope: !866, inlinedAt: !871)
!873 = !DILocation(line: 0, scope: !836, inlinedAt: !843)
!874 = !DILocation(line: 0, scope: !839, inlinedAt: !843)
!875 = !DILocation(line: 102, column: 21, scope: !876, inlinedAt: !843)
!876 = distinct !DILexicalBlock(scope: !839, file: !52, line: 102, column: 15)
!877 = !DILocation(line: 102, column: 15, scope: !839, inlinedAt: !843)
!878 = !DILocation(line: 105, column: 5, scope: !836, inlinedAt: !843)
!879 = !DILocation(line: 110, column: 10, scope: !828, inlinedAt: !843)
!880 = !DILocation(line: 666, column: 20, scope: !2)
!881 = !DILocation(line: 668, column: 17, scope: !882)
!882 = distinct !DILexicalBlock(scope: !2, file: !3, line: 668, column: 7)
!883 = !DILocation(line: 676, column: 10, scope: !2)
!884 = !DILocation(line: 677, column: 16, scope: !2)
!885 = !DILocation(line: 679, column: 21, scope: !2)
!886 = !DILocation(line: 681, column: 3, scope: !2)
!887 = !DILocation(line: 663, column: 7, scope: !2)
!888 = !DILocation(line: 683, column: 18, scope: !889)
!889 = distinct !DILexicalBlock(scope: !232, file: !3, line: 683, column: 11)
!890 = !DILocation(line: 683, column: 11, scope: !232)
!891 = !DILocation(line: 686, column: 35, scope: !232)
!892 = !DILocation(line: 684, column: 18, scope: !889)
!893 = !DILocation(line: 684, column: 16, scope: !889)
!894 = !DILocation(line: 684, column: 9, scope: !889)
!895 = !DILocation(line: 0, scope: !625, inlinedAt: !896)
!896 = distinct !DILocation(line: 686, column: 28, scope: !232)
!897 = !DILocation(line: 1361, column: 11, scope: !625, inlinedAt: !896)
!898 = !DILocation(line: 1361, column: 10, scope: !625, inlinedAt: !896)
!899 = !DILocation(line: 0, scope: !232)
!900 = !DILocation(line: 687, column: 11, scope: !232)
!901 = !DILocation(line: 690, column: 22, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 688, column: 9)
!903 = distinct !DILexicalBlock(scope: !232, file: !3, line: 687, column: 11)
!904 = !DILocation(line: 696, column: 24, scope: !905)
!905 = distinct !DILexicalBlock(scope: !903, file: !3, line: 695, column: 9)
!906 = !DILocation(line: 696, column: 22, scope: !905)
!907 = !DILocation(line: 697, column: 26, scope: !908)
!908 = distinct !DILexicalBlock(scope: !905, file: !3, line: 697, column: 15)
!909 = !DILocation(line: 697, column: 15, scope: !905)
!910 = !DILocation(line: 699, column: 15, scope: !911)
!911 = distinct !DILexicalBlock(scope: !908, file: !3, line: 698, column: 13)
!912 = !DILocation(line: 701, column: 15, scope: !911)
!913 = !DILocation(line: 706, column: 18, scope: !914)
!914 = distinct !DILexicalBlock(scope: !232, file: !3, line: 706, column: 11)
!915 = !DILocation(line: 705, column: 7, scope: !232)
!916 = !DILocation(line: 705, column: 19, scope: !232)
!917 = !DILocation(line: 706, column: 11, scope: !914)
!918 = !DILocation(line: 706, column: 42, scope: !914)
!919 = !DILocation(line: 706, column: 11, scope: !232)
!920 = !DILocation(line: 708, column: 11, scope: !921)
!921 = distinct !DILexicalBlock(scope: !914, file: !3, line: 707, column: 9)
!922 = !DILocation(line: 710, column: 11, scope: !921)
!923 = !DILocation(line: 0, scope: !828, inlinedAt: !924)
!924 = distinct !DILocation(line: 714, column: 22, scope: !232)
!925 = !DILocation(line: 84, column: 21, scope: !828, inlinedAt: !924)
!926 = !DILocation(line: 84, column: 58, scope: !828, inlinedAt: !924)
!927 = !DILocation(line: 88, column: 52, scope: !828, inlinedAt: !924)
!928 = !DILocation(line: 88, column: 33, scope: !828, inlinedAt: !924)
!929 = !DILocation(line: 88, column: 13, scope: !828, inlinedAt: !924)
!930 = !DILocation(line: 96, column: 7, scope: !837, inlinedAt: !924)
!931 = !DILocation(line: 96, column: 29, scope: !837, inlinedAt: !924)
!932 = !DILocation(line: 0, scope: !858, inlinedAt: !933)
!933 = distinct !DILocation(line: 98, column: 27, scope: !836, inlinedAt: !924)
!934 = !DILocation(line: 0, scope: !866, inlinedAt: !935)
!935 = distinct !DILocation(line: 438, column: 10, scope: !858, inlinedAt: !933)
!936 = !DILocation(line: 151, column: 10, scope: !866, inlinedAt: !935)
!937 = !DILocation(line: 0, scope: !836, inlinedAt: !924)
!938 = !DILocation(line: 0, scope: !839, inlinedAt: !924)
!939 = !DILocation(line: 102, column: 21, scope: !876, inlinedAt: !924)
!940 = !DILocation(line: 102, column: 15, scope: !839, inlinedAt: !924)
!941 = !DILocation(line: 110, column: 10, scope: !828, inlinedAt: !924)
!942 = !DILocation(line: 716, column: 17, scope: !232)
!943 = !DILocation(line: 716, column: 7, scope: !232)
!944 = !DILocation(line: 722, column: 43, scope: !237)
!945 = !DILocation(line: 725, column: 14, scope: !237)
!946 = !{!846, !847, i64 0}
!947 = !{!846, !847, i64 8}
!948 = !DILocation(line: 722, column: 11, scope: !232)
!949 = !DILocation(line: 727, column: 33, scope: !236)
!950 = !DILocation(line: 727, column: 26, scope: !236)
!951 = !DILocation(line: 0, scope: !236)
!952 = !DILocation(line: 728, column: 17, scope: !242)
!953 = !DILocation(line: 728, column: 15, scope: !236)
!954 = !DILocation(line: 730, column: 29, scope: !955)
!955 = distinct !DILexicalBlock(scope: !241, file: !3, line: 730, column: 19)
!956 = !DILocation(line: 730, column: 19, scope: !241)
!957 = !DILocation(line: 731, column: 29, scope: !955)
!958 = !DILocation(line: 731, column: 17, scope: !955)
!959 = !DILocation(line: 732, column: 44, scope: !241)
!960 = !DILocation(line: 732, column: 29, scope: !241)
!961 = !DILocation(line: 0, scope: !241)
!962 = !DILocation(line: 734, column: 28, scope: !963)
!963 = distinct !DILexicalBlock(scope: !241, file: !3, line: 734, column: 19)
!964 = !DILocation(line: 734, column: 26, scope: !963)
!965 = !DILocation(line: 734, column: 19, scope: !241)
!966 = !DILocation(line: 736, column: 19, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !3, line: 735, column: 17)
!968 = !DILocation(line: 751, column: 21, scope: !246)
!969 = !DILocation(line: 755, column: 23, scope: !245)
!970 = !DILocalVariable(name: "some_copied", scope: !971, file: !3, line: 531, type: !61)
!971 = distinct !DILexicalBlock(scope: !972, file: !3, line: 531, column: 3)
!972 = distinct !DISubprogram(name: "copy_cat", scope: !3, file: !3, line: 518, type: !973, scopeLine: 519, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{!6}
!975 = !{!976, !970}
!976 = !DILocalVariable(name: "copy_max", scope: !972, file: !3, line: 523, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !239, line: 77, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !127, line: 194, baseType: !62)
!979 = !DILocation(line: 0, scope: !971, inlinedAt: !980)
!980 = distinct !DILocation(line: 755, column: 56, scope: !245)
!981 = !DILocation(line: 532, column: 30, scope: !982, inlinedAt: !980)
!982 = distinct !DILexicalBlock(scope: !971, file: !3, line: 531, column: 3)
!983 = !DILocation(line: 532, column: 13, scope: !982, inlinedAt: !980)
!984 = !DILocation(line: 532, column: 5, scope: !982, inlinedAt: !980)
!985 = distinct !{!985, !986, !987}
!986 = !DILocation(line: 531, column: 3, scope: !971, inlinedAt: !980)
!987 = !DILocation(line: 545, column: 7, scope: !971, inlinedAt: !980)
!988 = !DILocation(line: 539, column: 13, scope: !989, inlinedAt: !980)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 539, column: 13)
!990 = distinct !DILexicalBlock(scope: !982, file: !3, line: 534, column: 7)
!991 = !DILocation(line: 539, column: 29, scope: !989, inlinedAt: !980)
!992 = !DILocation(line: 543, column: 9, scope: !990, inlinedAt: !980)
!993 = !DILocation(line: 0, scope: !245)
!994 = !DILocation(line: 756, column: 15, scope: !245)
!995 = !DILocation(line: 763, column: 24, scope: !996)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 762, column: 13)
!997 = distinct !DILexicalBlock(scope: !245, file: !3, line: 756, column: 15)
!998 = !DILocation(line: 764, column: 23, scope: !996)
!999 = !DILocalVariable(name: "buf", arg: 1, scope: !1000, file: !3, line: 170, type: !8)
!1000 = distinct !DISubprogram(name: "simple_cat", scope: !3, file: !3, line: 170, type: !1001, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!61, !8, !223}
!1003 = !{!999, !1004, !1005}
!1004 = !DILocalVariable(name: "bufsize", arg: 2, scope: !1000, file: !3, line: 170, type: !223)
!1005 = !DILocalVariable(name: "n_read", scope: !1006, file: !3, line: 178, type: !977)
!1006 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 175, column: 5)
!1007 = !DILocation(line: 0, scope: !1000, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 765, column: 21, scope: !996)
!1009 = !DILocation(line: 174, column: 3, scope: !1000, inlinedAt: !1008)
!1010 = !DILocation(line: 178, column: 30, scope: !1006, inlinedAt: !1008)
!1011 = !DILocation(line: 178, column: 24, scope: !1006, inlinedAt: !1008)
!1012 = !DILocation(line: 0, scope: !1006, inlinedAt: !1008)
!1013 = !DILocation(line: 179, column: 18, scope: !1014, inlinedAt: !1008)
!1014 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 179, column: 11)
!1015 = !DILocation(line: 179, column: 11, scope: !1006, inlinedAt: !1008)
!1016 = !DILocation(line: 181, column: 11, scope: !1017, inlinedAt: !1008)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 180, column: 9)
!1018 = !DILocation(line: 182, column: 11, scope: !1017, inlinedAt: !1008)
!1019 = !DILocation(line: 187, column: 18, scope: !1020, inlinedAt: !1008)
!1020 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 187, column: 11)
!1021 = !DILocation(line: 187, column: 11, scope: !1006, inlinedAt: !1008)
!1022 = !DILocation(line: 192, column: 11, scope: !1023, inlinedAt: !1008)
!1023 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 192, column: 11)
!1024 = !DILocation(line: 192, column: 51, scope: !1023, inlinedAt: !1008)
!1025 = !DILocation(line: 192, column: 11, scope: !1006, inlinedAt: !1008)
!1026 = !DILocation(line: 948, column: 21, scope: !1027, inlinedAt: !1030)
!1027 = distinct !DISubprogram(name: "write_error", scope: !78, file: !78, line: 946, type: !314, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1028)
!1028 = !{!1029}
!1029 = !DILocalVariable(name: "saved_errno", scope: !1027, file: !78, line: 948, type: !6)
!1030 = distinct !DILocation(line: 193, column: 9, scope: !1023, inlinedAt: !1008)
!1031 = !DILocation(line: 0, scope: !1027, inlinedAt: !1030)
!1032 = !DILocation(line: 949, column: 3, scope: !1027, inlinedAt: !1030)
!1033 = !DILocation(line: 950, column: 11, scope: !1027, inlinedAt: !1030)
!1034 = !DILocation(line: 950, column: 3, scope: !1027, inlinedAt: !1030)
!1035 = !DILocation(line: 951, column: 3, scope: !1027, inlinedAt: !1030)
!1036 = !DILocation(line: 952, column: 3, scope: !1027, inlinedAt: !1030)
!1037 = !DILocation(line: 195, column: 1, scope: !1000, inlinedAt: !1008)
!1038 = !DILocation(line: 771, column: 50, scope: !248)
!1039 = !DILocation(line: 771, column: 19, scope: !248)
!1040 = !DILocation(line: 0, scope: !248)
!1041 = !DILocation(line: 795, column: 15, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !248, file: !3, line: 795, column: 15)
!1043 = !DILocation(line: 796, column: 18, scope: !1042)
!1044 = !DILocation(line: 797, column: 15, scope: !1042)
!1045 = !DILocation(line: 797, column: 18, scope: !1042)
!1046 = !DILocation(line: 795, column: 15, scope: !248)
!1047 = !DILocation(line: 798, column: 13, scope: !1042)
!1048 = !DILocation(line: 799, column: 26, scope: !248)
!1049 = !DILocalVariable(name: "inbuf", arg: 1, scope: !1050, file: !3, line: 226, type: !8)
!1050 = distinct !DISubprogram(name: "cat", scope: !3, file: !3, line: 226, type: !1051, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!61, !8, !223, !8, !223, !61, !61, !61, !61, !61, !61}
!1053 = !{!1049, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1074, !1075, !1078, !1079}
!1054 = !DILocalVariable(name: "insize", arg: 2, scope: !1050, file: !3, line: 226, type: !223)
!1055 = !DILocalVariable(name: "outbuf", arg: 3, scope: !1050, file: !3, line: 226, type: !8)
!1056 = !DILocalVariable(name: "outsize", arg: 4, scope: !1050, file: !3, line: 226, type: !223)
!1057 = !DILocalVariable(name: "show_nonprinting", arg: 5, scope: !1050, file: !3, line: 227, type: !61)
!1058 = !DILocalVariable(name: "show_tabs", arg: 6, scope: !1050, file: !3, line: 227, type: !61)
!1059 = !DILocalVariable(name: "number", arg: 7, scope: !1050, file: !3, line: 227, type: !61)
!1060 = !DILocalVariable(name: "number_nonblank", arg: 8, scope: !1050, file: !3, line: 227, type: !61)
!1061 = !DILocalVariable(name: "show_ends", arg: 9, scope: !1050, file: !3, line: 228, type: !61)
!1062 = !DILocalVariable(name: "squeeze_blank", arg: 10, scope: !1050, file: !3, line: 228, type: !61)
!1063 = !DILocalVariable(name: "ch", scope: !1050, file: !3, line: 231, type: !69)
!1064 = !DILocalVariable(name: "newlines", scope: !1050, file: !3, line: 238, type: !6)
!1065 = !DILocalVariable(name: "use_fionread", scope: !1050, file: !3, line: 243, type: !61)
!1066 = !DILocalVariable(name: "eob", scope: !1050, file: !3, line: 251, type: !8)
!1067 = !DILocalVariable(name: "bpin", scope: !1050, file: !3, line: 254, type: !8)
!1068 = !DILocalVariable(name: "bpout", scope: !1050, file: !3, line: 257, type: !8)
!1069 = !DILocalVariable(name: "wp", scope: !1070, file: !3, line: 267, type: !8)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 266, column: 13)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 265, column: 15)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 262, column: 9)
!1073 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 260, column: 5)
!1074 = !DILocalVariable(name: "remaining_bytes", scope: !1070, file: !3, line: 268, type: !223)
!1075 = !DILocalVariable(name: "input_pending", scope: !1076, file: !3, line: 289, type: !61)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 288, column: 13)
!1077 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 287, column: 15)
!1078 = !DILocalVariable(name: "n_to_read", scope: !1076, file: !3, line: 291, type: !6)
!1079 = !DILocalVariable(name: "n_read", scope: !1076, file: !3, line: 327, type: !977)
!1080 = !DILocation(line: 0, scope: !1050, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 801, column: 17, scope: !248)
!1082 = !DILocation(line: 238, column: 18, scope: !1050, inlinedAt: !1081)
!1083 = !DILocation(line: 254, column: 20, scope: !1050, inlinedAt: !1081)
!1084 = !DILocation(line: 259, column: 3, scope: !1050, inlinedAt: !1081)
!1085 = !DILocation(line: 257, column: 9, scope: !1050, inlinedAt: !1081)
!1086 = !DILocation(line: 238, column: 7, scope: !1050, inlinedAt: !1081)
!1087 = !DILocation(line: 251, column: 9, scope: !1050, inlinedAt: !1081)
!1088 = !DILocation(line: 265, column: 32, scope: !1071, inlinedAt: !1081)
!1089 = !DILocation(line: 265, column: 15, scope: !1072, inlinedAt: !1081)
!1090 = !DILocation(line: 269, column: 15, scope: !1070, inlinedAt: !1081)
!1091 = !DILocation(line: 0, scope: !1070, inlinedAt: !1081)
!1092 = !DILocation(line: 271, column: 23, scope: !1093, inlinedAt: !1081)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 271, column: 23)
!1094 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 270, column: 17)
!1095 = !DILocation(line: 271, column: 63, scope: !1093, inlinedAt: !1081)
!1096 = !DILocation(line: 271, column: 23, scope: !1094, inlinedAt: !1081)
!1097 = !DILocation(line: 948, column: 21, scope: !1027, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 272, column: 21, scope: !1093, inlinedAt: !1081)
!1099 = !DILocation(line: 0, scope: !1027, inlinedAt: !1098)
!1100 = !DILocation(line: 949, column: 3, scope: !1027, inlinedAt: !1098)
!1101 = !DILocation(line: 950, column: 11, scope: !1027, inlinedAt: !1098)
!1102 = !DILocation(line: 950, column: 3, scope: !1027, inlinedAt: !1098)
!1103 = !DILocation(line: 951, column: 3, scope: !1027, inlinedAt: !1098)
!1104 = !DILocation(line: 952, column: 3, scope: !1027, inlinedAt: !1098)
!1105 = !DILocation(line: 273, column: 22, scope: !1094, inlinedAt: !1081)
!1106 = !DILocation(line: 274, column: 43, scope: !1094, inlinedAt: !1081)
!1107 = !DILocation(line: 276, column: 30, scope: !1070, inlinedAt: !1081)
!1108 = !DILocation(line: 275, column: 17, scope: !1094, inlinedAt: !1081)
!1109 = distinct !{!1109, !1090, !1110, !642}
!1110 = !DILocation(line: 276, column: 48, scope: !1070, inlinedAt: !1081)
!1111 = !DILocalVariable(name: "__dest", arg: 1, scope: !1112, file: !1113, line: 34, type: !60)
!1112 = distinct !DISubprogram(name: "memmove", scope: !1113, file: !1113, line: 34, type: !1114, scopeLine: 35, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1116)
!1113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!60, !60, !793, !65}
!1116 = !{!1111, !1117, !1118}
!1117 = !DILocalVariable(name: "__src", arg: 2, scope: !1112, file: !1113, line: 34, type: !793)
!1118 = !DILocalVariable(name: "__len", arg: 3, scope: !1112, file: !1113, line: 34, type: !65)
!1119 = !DILocation(line: 0, scope: !1112, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 281, column: 15, scope: !1070, inlinedAt: !1081)
!1121 = !DILocation(line: 36, column: 10, scope: !1112, inlinedAt: !1120)
!1122 = !DILocation(line: 282, column: 30, scope: !1070, inlinedAt: !1081)
!1123 = !DILocation(line: 283, column: 13, scope: !1070, inlinedAt: !1081)
!1124 = !DILocation(line: 287, column: 20, scope: !1077, inlinedAt: !1081)
!1125 = !DILocation(line: 287, column: 15, scope: !1072, inlinedAt: !1081)
!1126 = !DILocation(line: 0, scope: !1076, inlinedAt: !1081)
!1127 = !DILocation(line: 291, column: 15, scope: !1076, inlinedAt: !1081)
!1128 = !DILocation(line: 291, column: 19, scope: !1076, inlinedAt: !1081)
!1129 = !DILocation(line: 298, column: 19, scope: !1130, inlinedAt: !1081)
!1130 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 297, column: 19)
!1131 = !DILocation(line: 298, column: 29, scope: !1130, inlinedAt: !1081)
!1132 = !DILocation(line: 298, column: 22, scope: !1130, inlinedAt: !1081)
!1133 = !DILocation(line: 298, column: 63, scope: !1130, inlinedAt: !1081)
!1134 = !DILocation(line: 297, column: 19, scope: !1076, inlinedAt: !1081)
!1135 = !DILocation(line: 306, column: 23, scope: !1136, inlinedAt: !1081)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 306, column: 23)
!1137 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 299, column: 17)
!1138 = !DILocation(line: 306, column: 43, scope: !1136, inlinedAt: !1081)
!1139 = !DILocation(line: 312, column: 23, scope: !1140, inlinedAt: !1081)
!1140 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 311, column: 21)
!1141 = !DILocation(line: 315, column: 23, scope: !1140, inlinedAt: !1081)
!1142 = !DILocation(line: 318, column: 19, scope: !1143, inlinedAt: !1081)
!1143 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 318, column: 19)
!1144 = !DILocation(line: 318, column: 29, scope: !1143, inlinedAt: !1081)
!1145 = !DILocation(line: 322, column: 19, scope: !1076, inlinedAt: !1081)
!1146 = !DILocalVariable(name: "outbuf", arg: 1, scope: !1147, file: !3, line: 202, type: !8)
!1147 = distinct !DISubprogram(name: "write_pending", scope: !3, file: !3, line: 202, type: !1148, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1150)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !8, !7}
!1150 = !{!1146, !1151, !1152}
!1151 = !DILocalVariable(name: "bpout", arg: 2, scope: !1147, file: !3, line: 202, type: !7)
!1152 = !DILocalVariable(name: "n_write", scope: !1147, file: !3, line: 204, type: !223)
!1153 = !DILocation(line: 0, scope: !1147, inlinedAt: !1154)
!1154 = distinct !DILocation(line: 323, column: 17, scope: !1155, inlinedAt: !1081)
!1155 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 322, column: 19)
!1156 = !DILocation(line: 204, column: 26, scope: !1147, inlinedAt: !1154)
!1157 = !DILocation(line: 205, column: 9, scope: !1158, inlinedAt: !1154)
!1158 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 205, column: 7)
!1159 = !DILocation(line: 205, column: 7, scope: !1147, inlinedAt: !1154)
!1160 = !DILocation(line: 207, column: 11, scope: !1161, inlinedAt: !1154)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !3, line: 207, column: 11)
!1162 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 206, column: 5)
!1163 = !DILocation(line: 207, column: 55, scope: !1161, inlinedAt: !1154)
!1164 = !DILocation(line: 207, column: 11, scope: !1162, inlinedAt: !1154)
!1165 = !DILocation(line: 948, column: 21, scope: !1027, inlinedAt: !1166)
!1166 = distinct !DILocation(line: 208, column: 9, scope: !1161, inlinedAt: !1154)
!1167 = !DILocation(line: 0, scope: !1027, inlinedAt: !1166)
!1168 = !DILocation(line: 949, column: 3, scope: !1027, inlinedAt: !1166)
!1169 = !DILocation(line: 950, column: 11, scope: !1027, inlinedAt: !1166)
!1170 = !DILocation(line: 950, column: 3, scope: !1027, inlinedAt: !1166)
!1171 = !DILocation(line: 951, column: 3, scope: !1027, inlinedAt: !1166)
!1172 = !DILocation(line: 952, column: 3, scope: !1027, inlinedAt: !1166)
!1173 = !DILocation(line: 327, column: 38, scope: !1076, inlinedAt: !1081)
!1174 = !DILocation(line: 327, column: 32, scope: !1076, inlinedAt: !1081)
!1175 = !DILocation(line: 328, column: 26, scope: !1176, inlinedAt: !1081)
!1176 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 328, column: 19)
!1177 = !DILocation(line: 328, column: 19, scope: !1076, inlinedAt: !1081)
!1178 = !DILocation(line: 330, column: 19, scope: !1179, inlinedAt: !1081)
!1179 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 329, column: 17)
!1180 = !DILocation(line: 0, scope: !1147, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 331, column: 19, scope: !1179, inlinedAt: !1081)
!1182 = !DILocation(line: 204, column: 26, scope: !1147, inlinedAt: !1181)
!1183 = !DILocation(line: 205, column: 9, scope: !1158, inlinedAt: !1181)
!1184 = !DILocation(line: 205, column: 7, scope: !1147, inlinedAt: !1181)
!1185 = !DILocation(line: 207, column: 11, scope: !1161, inlinedAt: !1181)
!1186 = !DILocation(line: 207, column: 55, scope: !1161, inlinedAt: !1181)
!1187 = !DILocation(line: 207, column: 11, scope: !1162, inlinedAt: !1181)
!1188 = !DILocation(line: 948, column: 21, scope: !1027, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 208, column: 9, scope: !1161, inlinedAt: !1181)
!1190 = !DILocation(line: 0, scope: !1027, inlinedAt: !1189)
!1191 = !DILocation(line: 949, column: 3, scope: !1027, inlinedAt: !1189)
!1192 = !DILocation(line: 950, column: 11, scope: !1027, inlinedAt: !1189)
!1193 = !DILocation(line: 950, column: 3, scope: !1027, inlinedAt: !1189)
!1194 = !DILocation(line: 951, column: 3, scope: !1027, inlinedAt: !1189)
!1195 = !DILocation(line: 952, column: 3, scope: !1027, inlinedAt: !1189)
!1196 = !DILocation(line: 335, column: 26, scope: !1197, inlinedAt: !1081)
!1197 = distinct !DILexicalBlock(scope: !1076, file: !3, line: 335, column: 19)
!1198 = !DILocation(line: 335, column: 19, scope: !1076, inlinedAt: !1081)
!1199 = !DILocation(line: 0, scope: !1147, inlinedAt: !1200)
!1200 = distinct !DILocation(line: 337, column: 19, scope: !1201, inlinedAt: !1081)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 336, column: 17)
!1202 = !DILocation(line: 204, column: 26, scope: !1147, inlinedAt: !1200)
!1203 = !DILocation(line: 205, column: 9, scope: !1158, inlinedAt: !1200)
!1204 = !DILocation(line: 205, column: 7, scope: !1147, inlinedAt: !1200)
!1205 = !DILocation(line: 207, column: 11, scope: !1161, inlinedAt: !1200)
!1206 = !DILocation(line: 207, column: 55, scope: !1161, inlinedAt: !1200)
!1207 = !DILocation(line: 207, column: 11, scope: !1162, inlinedAt: !1200)
!1208 = !DILocation(line: 948, column: 21, scope: !1027, inlinedAt: !1209)
!1209 = distinct !DILocation(line: 208, column: 9, scope: !1161, inlinedAt: !1200)
!1210 = !DILocation(line: 0, scope: !1027, inlinedAt: !1209)
!1211 = !DILocation(line: 949, column: 3, scope: !1027, inlinedAt: !1209)
!1212 = !DILocation(line: 950, column: 11, scope: !1027, inlinedAt: !1209)
!1213 = !DILocation(line: 950, column: 3, scope: !1027, inlinedAt: !1209)
!1214 = !DILocation(line: 951, column: 3, scope: !1027, inlinedAt: !1209)
!1215 = !DILocation(line: 952, column: 3, scope: !1027, inlinedAt: !1209)
!1216 = !DILocation(line: 346, column: 26, scope: !1076, inlinedAt: !1081)
