; ModuleID = 'src/chmod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.30 }
%union.anon.30 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.FTS = type { %struct._ftsent*, %struct._ftsent*, %struct._ftsent**, i64, i8*, i32, i32, i64, i64, i32 (%struct._ftsent**, %struct._ftsent**)*, i32, %struct.hash_table*, %union.anon, %struct.I_ring }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 106, type: !211, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !56, globals: !68, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/chmod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cffc3b1363770fdb9ceed974090d466c")
!4 = !{!5, !11, !25, !40}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !3, line: 56, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "V_high", value: 0)
!9 = !DIEnumerator(name: "V_changes_only", value: 1)
!10 = !DIEnumerator(name: "V_off", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !12, line: 42, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!14 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!15 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!16 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!17 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!18 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!19 = !DIEnumerator(name: "c_quoting_style", value: 5)
!20 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!21 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!22 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!23 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!24 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 46, baseType: !6, size: 32, elements: !27)
!26 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "_ISupper", value: 256)
!29 = !DIEnumerator(name: "_ISlower", value: 512)
!30 = !DIEnumerator(name: "_ISalpha", value: 1024)
!31 = !DIEnumerator(name: "_ISdigit", value: 2048)
!32 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!33 = !DIEnumerator(name: "_ISspace", value: 8192)
!34 = !DIEnumerator(name: "_ISprint", value: 16384)
!35 = !DIEnumerator(name: "_ISgraph", value: 32768)
!36 = !DIEnumerator(name: "_ISblank", value: 1)
!37 = !DIEnumerator(name: "_IScntrl", value: 2)
!38 = !DIEnumerator(name: "_ISpunct", value: 4)
!39 = !DIEnumerator(name: "_ISalnum", value: 8)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !41, file: !3, line: 43, baseType: !6, size: 32, elements: !50)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "change_status", file: !3, line: 41, size: 96, elements: !42)
!42 = !{!43, !44, !49}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !41, file: !3, line: 51, baseType: !40, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "old_mode", scope: !41, file: !3, line: 52, baseType: !45, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !46, line: 69, baseType: !47)
!46 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !48, line: 150, baseType: !6)
!48 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "new_mode", scope: !41, file: !3, line: 53, baseType: !45, size: 32, offset: 64)
!50 = !{!51, !52, !53, !54, !55}
!51 = !DIEnumerator(name: "CH_NO_STAT", value: 0)
!52 = !DIEnumerator(name: "CH_FAILED", value: 1)
!53 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 2)
!54 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!55 = !DIEnumerator(name: "CH_SUCCEEDED", value: 4)
!56 = !{!57, !59, !60, !61, !62, !65, !67}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!64 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69, !107, !112, !114, !116, !118, !120, !123, !0, !207, !209}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !71, file: !3, line: 652, type: !98, isLocal: true, isDefinition: true)
!71 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 478, type: !72, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !75)
!72 = !DISubroutineType(types: !73)
!73 = !{!60, !60, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!75 = !{!76, !77, !78, !79, !84, !85, !87, !88, !89, !90, !91, !95, !96, !97}
!76 = !DILocalVariable(name: "argc", arg: 1, scope: !71, file: !3, line: 478, type: !60)
!77 = !DILocalVariable(name: "argv", arg: 2, scope: !71, file: !3, line: 478, type: !74)
!78 = !DILocalVariable(name: "mode", scope: !71, file: !3, line: 480, type: !57)
!79 = !DILocalVariable(name: "mode_len", scope: !71, file: !3, line: 481, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !81, line: 130, baseType: !82)
!81 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !63, line: 35, baseType: !83)
!83 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!84 = !DILocalVariable(name: "mode_alloc", scope: !71, file: !3, line: 482, type: !80)
!85 = !DILocalVariable(name: "ok", scope: !71, file: !3, line: 483, type: !86)
!86 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!87 = !DILocalVariable(name: "preserve_root", scope: !71, file: !3, line: 484, type: !86)
!88 = !DILocalVariable(name: "reference_file", scope: !71, file: !3, line: 485, type: !65)
!89 = !DILocalVariable(name: "c", scope: !71, file: !3, line: 486, type: !60)
!90 = !DILocalVariable(name: "bit_flags", scope: !71, file: !3, line: 487, type: !60)
!91 = !DILocalVariable(name: "arg", scope: !92, file: !3, line: 552, type: !65)
!92 = distinct !DILexicalBlock(scope: !93, file: !3, line: 546, column: 11)
!93 = distinct !DILexicalBlock(scope: !94, file: !3, line: 504, column: 9)
!94 = distinct !DILexicalBlock(scope: !71, file: !3, line: 502, column: 5)
!95 = !DILocalVariable(name: "arg_len", scope: !92, file: !3, line: 553, type: !80)
!96 = !DILocalVariable(name: "mode_comma_len", scope: !92, file: !3, line: 554, type: !80)
!97 = !DILocalVariable(name: "new_mode_len", scope: !92, file: !3, line: 555, type: !80)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !99, line: 30, size: 128, elements: !100)
!99 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!100 = !{!101, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !98, file: !99, line: 32, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !46, line: 47, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !48, line: 148, baseType: !64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !98, file: !99, line: 33, baseType: !105, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !46, line: 59, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !48, line: 145, baseType: !64)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "change", scope: !2, file: !3, line: 69, type: !109, isLocal: true, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !111, line: 35, flags: DIFlagFwdDecl)
!111 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "umask_value", scope: !2, file: !3, line: 72, type: !45, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "recurse", scope: !2, file: !3, line: 75, type: !86, isLocal: true, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "force_silent", scope: !2, file: !3, line: 82, type: !86, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !2, file: !3, line: 87, type: !86, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !2, file: !3, line: 94, type: !122, isLocal: true, isDefinition: true)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !125, file: !126, line: 575, type: !60, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "oputs_", scope: !126, file: !126, line: 573, type: !127, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !129)
!126 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!127 = !DISubroutineType(types: !128)
!128 = !{null, !65, !65}
!129 = !{!130, !131, !132, !135, !136, !137, !138, !142, !143, !144, !145, !147, !201, !202, !203, !205, !206}
!130 = !DILocalVariable(name: "program", arg: 1, scope: !125, file: !126, line: 573, type: !65)
!131 = !DILocalVariable(name: "option", arg: 2, scope: !125, file: !126, line: 573, type: !65)
!132 = !DILocalVariable(name: "term", scope: !133, file: !126, line: 585, type: !65)
!133 = distinct !DILexicalBlock(scope: !134, file: !126, line: 582, column: 5)
!134 = distinct !DILexicalBlock(scope: !125, file: !126, line: 581, column: 7)
!135 = !DILocalVariable(name: "double_space", scope: !125, file: !126, line: 594, type: !86)
!136 = !DILocalVariable(name: "first_word", scope: !125, file: !126, line: 595, type: !65)
!137 = !DILocalVariable(name: "option_text", scope: !125, file: !126, line: 596, type: !65)
!138 = !DILocalVariable(name: "s", scope: !139, file: !126, line: 608, type: !65)
!139 = distinct !DILexicalBlock(scope: !140, file: !126, line: 605, column: 5)
!140 = distinct !DILexicalBlock(scope: !141, file: !126, line: 604, column: 12)
!141 = distinct !DILexicalBlock(scope: !125, file: !126, line: 597, column: 7)
!142 = !DILocalVariable(name: "spaces", scope: !139, file: !126, line: 609, type: !62)
!143 = !DILocalVariable(name: "anchor_len", scope: !125, file: !126, line: 620, type: !62)
!144 = !DILocalVariable(name: "desc_text", scope: !125, file: !126, line: 625, type: !65)
!145 = !DILocalVariable(name: "__ptr", scope: !146, file: !126, line: 644, type: !65)
!146 = distinct !DILexicalBlock(scope: !125, file: !126, line: 644, column: 3)
!147 = !DILocalVariable(name: "__stream", scope: !146, file: !126, line: 644, type: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !150, line: 7, baseType: !151)
!150 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !152, line: 49, size: 1728, elements: !153)
!152 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !169, !171, !172, !173, !175, !176, !178, !182, !185, !187, !190, !193, !194, !195, !196, !197}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !151, file: !152, line: 51, baseType: !60, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !151, file: !152, line: 54, baseType: !57, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !151, file: !152, line: 55, baseType: !57, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !151, file: !152, line: 56, baseType: !57, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !151, file: !152, line: 57, baseType: !57, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !151, file: !152, line: 58, baseType: !57, size: 64, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !151, file: !152, line: 59, baseType: !57, size: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !151, file: !152, line: 60, baseType: !57, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !151, file: !152, line: 61, baseType: !57, size: 64, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !151, file: !152, line: 64, baseType: !57, size: 64, offset: 576)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !151, file: !152, line: 65, baseType: !57, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !151, file: !152, line: 66, baseType: !57, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !151, file: !152, line: 68, baseType: !167, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !152, line: 36, flags: DIFlagFwdDecl)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !151, file: !152, line: 70, baseType: !170, size: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !151, file: !152, line: 72, baseType: !60, size: 32, offset: 896)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !151, file: !152, line: 73, baseType: !60, size: 32, offset: 928)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !151, file: !152, line: 74, baseType: !174, size: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !48, line: 152, baseType: !83)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !151, file: !152, line: 77, baseType: !61, size: 16, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !151, file: !152, line: 78, baseType: !177, size: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !151, file: !152, line: 79, baseType: !179, size: 8, offset: 1048)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !151, file: !152, line: 81, baseType: !183, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !152, line: 43, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !151, file: !152, line: 89, baseType: !186, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !48, line: 153, baseType: !83)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !151, file: !152, line: 91, baseType: !188, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !152, line: 37, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !151, file: !152, line: 92, baseType: !191, size: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !152, line: 38, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !151, file: !152, line: 93, baseType: !170, size: 64, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !151, file: !152, line: 94, baseType: !59, size: 64, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !151, file: !152, line: 95, baseType: !62, size: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !151, file: !152, line: 96, baseType: !60, size: 32, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !151, file: !152, line: 98, baseType: !198, size: 160, offset: 1568)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 20)
!201 = !DILocalVariable(name: "__cnt", scope: !146, file: !126, line: 644, type: !62)
!202 = !DILocalVariable(name: "url_program", scope: !125, file: !126, line: 648, type: !65)
!203 = !DILocalVariable(name: "__ptr", scope: !204, file: !126, line: 686, type: !65)
!204 = distinct !DILexicalBlock(scope: !125, file: !126, line: 686, column: 3)
!205 = !DILocalVariable(name: "__stream", scope: !204, file: !126, line: 686, type: !148)
!206 = !DILocalVariable(name: "__cnt", scope: !204, file: !126, line: 686, type: !62)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 79, type: !60, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "verbosity", scope: !2, file: !3, line: 90, type: !5, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !212, size: 3328, elements: !221)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !214, line: 50, size: 256, elements: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!215 = !{!216, !217, !218, !220}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 52, baseType: !65, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !213, file: !214, line: 55, baseType: !60, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !214, line: 56, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !213, file: !214, line: 57, baseType: !60, size: 32, offset: 192)
!221 = !{!222}
!222 = !DISubrange(count: 13)
!223 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!224 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!225 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "Version", scope: !228, file: !229, line: 3, type: !65, isLocal: false, isDefinition: true)
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !230, splitDebugInlining: false, nameTableKind: None)
!229 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!230 = !{!226}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "file_name", scope: !233, file: !234, line: 45, type: !65, isLocal: true, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !235, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!235 = !{!231, !236}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !233, file: !234, line: 55, type: !86, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !240, file: !241, line: 66, type: !276, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !242, globals: !243, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!242 = !{!59, !67}
!243 = !{!244, !270, !238, !272, !274}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "old_file_name", scope: !246, file: !241, line: 304, type: !65, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "verror_at_line", scope: !241, file: !241, line: 298, type: !247, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !240, retainedNodes: !263)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !60, !60, !65, !6, !65, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !250, line: 52, baseType: !251)
!250 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !252, line: 32, baseType: !253)
!252 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !254, baseType: !255)
!254 = !DIFile(filename: "lib/error.c", directory: "/src")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !256, size: 256, elements: !257)
!256 = !DINamespace(name: "std", scope: null)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !255, file: !254, baseType: !59, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !255, file: !254, baseType: !59, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !255, file: !254, baseType: !59, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !255, file: !254, baseType: !60, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !255, file: !254, baseType: !60, size: 32, offset: 224)
!263 = !{!264, !265, !266, !267, !268, !269}
!264 = !DILocalVariable(name: "status", arg: 1, scope: !246, file: !241, line: 298, type: !60)
!265 = !DILocalVariable(name: "errnum", arg: 2, scope: !246, file: !241, line: 298, type: !60)
!266 = !DILocalVariable(name: "file_name", arg: 3, scope: !246, file: !241, line: 298, type: !65)
!267 = !DILocalVariable(name: "line_number", arg: 4, scope: !246, file: !241, line: 298, type: !6)
!268 = !DILocalVariable(name: "message", arg: 5, scope: !246, file: !241, line: 298, type: !65)
!269 = !DILocalVariable(name: "args", arg: 6, scope: !246, file: !241, line: 298, type: !249)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "old_line_number", scope: !246, file: !241, line: 305, type: !6, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "error_message_count", scope: !240, file: !241, line: 69, type: !6, isLocal: false, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !240, file: !241, line: 295, type: !60, isLocal: false, isDefinition: true)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "default_tuning", scope: !281, file: !282, line: 134, type: !286, isLocal: true, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !283, globals: !285, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!283 = !{!64, !59, !284, !62}
!284 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!285 = !{!279}
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !288, line: 52, baseType: !289)
!288 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !288, line: 40, size: 160, elements: !290)
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !289, file: !288, line: 45, baseType: !284, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !289, file: !288, line: 46, baseType: !284, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !289, file: !288, line: 47, baseType: !284, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !289, file: !288, line: 48, baseType: !284, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !289, file: !288, line: 49, baseType: !86, size: 8, offset: 128)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "program_name", scope: !298, file: !299, line: 31, type: !65, isLocal: false, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C99, file: !299, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!300 = !{!57}
!301 = !{!296}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "utf07FF", scope: !304, file: !305, line: 46, type: !335, isLocal: true, isDefinition: true)
!304 = distinct !DISubprogram(name: "proper_name_lite", scope: !305, file: !305, line: 38, type: !306, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !308, retainedNodes: !310)
!305 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!306 = !DISubroutineType(types: !307)
!307 = !{!65, !65, !65}
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !309, splitDebugInlining: false, nameTableKind: None)
!309 = !{!302}
!310 = !{!311, !312, !313, !314, !319}
!311 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !304, file: !305, line: 38, type: !65)
!312 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !304, file: !305, line: 38, type: !65)
!313 = !DILocalVariable(name: "translation", scope: !304, file: !305, line: 40, type: !65)
!314 = !DILocalVariable(name: "w", scope: !304, file: !305, line: 47, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !316, line: 37, baseType: !317)
!316 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !48, line: 57, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !48, line: 42, baseType: !6)
!319 = !DILocalVariable(name: "mbs", scope: !304, file: !305, line: 48, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !321, line: 6, baseType: !322)
!321 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !323, line: 21, baseType: !324)
!323 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !324, file: !323, line: 15, baseType: !60, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !324, file: !323, line: 20, baseType: !328, size: 32, offset: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 16, size: 32, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !328, file: !323, line: 18, baseType: !6, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !328, file: !323, line: 19, baseType: !332, size: 32)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 4)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 16, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 2)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !340, file: !341, line: 76, type: !409, isLocal: false, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !348, globals: !349, splitDebugInlining: false, nameTableKind: None)
!341 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!342 = !{!11, !343, !25}
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 254, baseType: !6, size: 32, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!346 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!347 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!348 = !{!60, !61, !62}
!349 = !{!338, !350, !356, !368, !370, !375, !398, !405, !407}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !340, file: !341, line: 92, type: !352, isLocal: false, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 320, elements: !354)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!354 = !{!355}
!355 = !DISubrange(count: 10)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !340, file: !341, line: 1040, type: !358, isLocal: false, isDefinition: true)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !341, line: 56, size: 448, elements: !359)
!359 = !{!360, !361, !362, !366, !367}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !358, file: !341, line: 59, baseType: !11, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !358, file: !341, line: 62, baseType: !60, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !358, file: !341, line: 66, baseType: !363, size: 256, offset: 64)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !358, file: !341, line: 69, baseType: !65, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !358, file: !341, line: 72, baseType: !65, size: 64, offset: 384)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !340, file: !341, line: 107, type: !358, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "slot0", scope: !340, file: !341, line: 831, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 256)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "quote", scope: !377, file: !341, line: 228, type: !396, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "gettext_quote", scope: !341, file: !341, line: 197, type: !378, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !340, retainedNodes: !380)
!378 = !DISubroutineType(types: !379)
!379 = !{!65, !65, !11}
!380 = !{!381, !382, !383, !384, !385}
!381 = !DILocalVariable(name: "msgid", arg: 1, scope: !377, file: !341, line: 197, type: !65)
!382 = !DILocalVariable(name: "s", arg: 2, scope: !377, file: !341, line: 197, type: !11)
!383 = !DILocalVariable(name: "translation", scope: !377, file: !341, line: 199, type: !65)
!384 = !DILocalVariable(name: "w", scope: !377, file: !341, line: 229, type: !315)
!385 = !DILocalVariable(name: "mbs", scope: !377, file: !341, line: 230, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !321, line: 6, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !323, line: 21, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !388, file: !323, line: 15, baseType: !60, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !388, file: !323, line: 20, baseType: !392, size: 32, offset: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !388, file: !323, line: 16, size: 32, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !392, file: !323, line: 18, baseType: !6, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !392, file: !323, line: 19, baseType: !332, size: 32)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !397)
!397 = !{!337, !334}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "slotvec", scope: !340, file: !341, line: 834, type: !400, isLocal: true, isDefinition: true)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !341, line: 823, size: 128, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !341, line: 825, baseType: !62, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !401, file: !341, line: 826, baseType: !57, size: 64, offset: 64)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "nslots", scope: !340, file: !341, line: 832, type: !60, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "slotvec0", scope: !340, file: !341, line: 833, type: !401, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 704, elements: !411)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!411 = !{!412}
!412 = !DISubrange(count: 11)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !415, file: !416, line: 26, type: !418, isLocal: false, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !417, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!417 = !{!413}
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 47)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "exit_failure", scope: !423, file: !424, line: 24, type: !426, isLocal: false, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !425, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!425 = !{!421}
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !429, file: !430, line: 506, type: !60, isLocal: true, isDefinition: true)
!429 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !430, file: !430, line: 485, type: !431, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !433, retainedNodes: !435)
!430 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!431 = !DISubroutineType(types: !432)
!432 = !{!60, !60, !60}
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !434, splitDebugInlining: false, nameTableKind: None)
!434 = !{!427}
!435 = !{!436, !437, !438, !439, !442}
!436 = !DILocalVariable(name: "fd", arg: 1, scope: !429, file: !430, line: 485, type: !60)
!437 = !DILocalVariable(name: "target", arg: 2, scope: !429, file: !430, line: 485, type: !60)
!438 = !DILocalVariable(name: "result", scope: !429, file: !430, line: 487, type: !60)
!439 = !DILocalVariable(name: "flags", scope: !440, file: !430, line: 530, type: !60)
!440 = distinct !DILexicalBlock(scope: !441, file: !430, line: 529, column: 5)
!441 = distinct !DILexicalBlock(scope: !429, file: !430, line: 528, column: 7)
!442 = !DILocalVariable(name: "saved_errno", scope: !443, file: !430, line: 533, type: !60)
!443 = distinct !DILexicalBlock(scope: !444, file: !430, line: 532, column: 9)
!444 = distinct !DILexicalBlock(scope: !440, file: !430, line: 531, column: 11)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "internal_state", scope: !447, file: !448, line: 97, type: !451, isLocal: true, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !449, globals: !450, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!449 = !{!59, !62, !67}
!450 = !{!445}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !321, line: 6, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !323, line: 21, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 13, size: 64, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !453, file: !323, line: 15, baseType: !60, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !453, file: !323, line: 20, baseType: !457, size: 32, offset: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !323, line: 16, size: 32, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !457, file: !323, line: 18, baseType: !6, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !457, file: !323, line: 19, baseType: !332, size: 32)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !465, retainedTypes: !621, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!465 = !{!466, !470, !597, !600, !604, !615, !618}
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !464, line: 159, baseType: !6, size: 32, elements: !467)
!467 = !{!468, !469}
!468 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!469 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !472, file: !471, line: 54, baseType: !6, size: 32, elements: !595)
!471 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!472 = distinct !DISubprogram(name: "setup_dir", scope: !471, file: !471, line: 50, type: !473, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !463, retainedNodes: !593)
!473 = !DISubroutineType(types: !474)
!474 = !{!86, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !477, line: 233, baseType: !478)
!477 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 115, size: 1024, elements: !479)
!479 = !{!480, !543, !544, !546, !547, !548, !549, !550, !551, !552, !559, !560, !563, !582}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !478, file: !477, line: 116, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !477, line: 235, size: 1920, elements: !483)
!483 = !{!484, !485, !486, !487, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !539}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !482, file: !477, line: 236, baseType: !481, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !482, file: !477, line: 237, baseType: !481, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !482, file: !477, line: 238, baseType: !481, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !482, file: !477, line: 239, baseType: !488, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !490, line: 127, baseType: !491)
!490 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !490, line: 127, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !482, file: !477, line: 242, baseType: !83, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !482, file: !477, line: 243, baseType: !59, size: 64, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !482, file: !477, line: 244, baseType: !57, size: 64, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !482, file: !477, line: 245, baseType: !57, size: 64, offset: 448)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !482, file: !477, line: 246, baseType: !60, size: 32, offset: 512)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !482, file: !477, line: 247, baseType: !60, size: 32, offset: 544)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !482, file: !477, line: 248, baseType: !62, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !482, file: !477, line: 250, baseType: !475, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !482, file: !477, line: 254, baseType: !82, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !482, file: !477, line: 256, baseType: !62, size: 64, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !482, file: !477, line: 272, baseType: !61, size: 16, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !482, file: !477, line: 276, baseType: !61, size: 16, offset: 848)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !482, file: !477, line: 282, baseType: !61, size: 16, offset: 864)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !482, file: !477, line: 284, baseType: !506, size: 1024, offset: 896)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 1024, elements: !180)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !508, line: 44, size: 1024, elements: !509)
!508 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!509 = !{!510, !511, !512, !513, !515, !517, !519, !520, !521, !522, !524, !525, !527, !535, !536, !537}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !507, file: !508, line: 46, baseType: !106, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !507, file: !508, line: 47, baseType: !103, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !507, file: !508, line: 48, baseType: !47, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !507, file: !508, line: 49, baseType: !514, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !48, line: 151, baseType: !6)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !507, file: !508, line: 50, baseType: !516, size: 32, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !48, line: 146, baseType: !6)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !507, file: !508, line: 51, baseType: !518, size: 32, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !48, line: 147, baseType: !6)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !507, file: !508, line: 52, baseType: !106, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !507, file: !508, line: 53, baseType: !106, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !507, file: !508, line: 54, baseType: !174, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !507, file: !508, line: 55, baseType: !523, size: 32, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !48, line: 175, baseType: !60)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !507, file: !508, line: 56, baseType: !60, size: 32, offset: 480)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !507, file: !508, line: 57, baseType: !526, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !48, line: 180, baseType: !83)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !507, file: !508, line: 65, baseType: !528, size: 128, offset: 576)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !529, line: 11, size: 128, elements: !530)
!529 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!530 = !{!531, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !528, file: !529, line: 16, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !48, line: 160, baseType: !83)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !528, file: !529, line: 21, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !48, line: 197, baseType: !83)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !507, file: !508, line: 66, baseType: !528, size: 128, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !507, file: !508, line: 67, baseType: !528, size: 128, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !507, file: !508, line: 79, baseType: !538, size: 64, offset: 960)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !336)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !482, file: !477, line: 285, baseType: !540, offset: 1920)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: -1)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !478, file: !477, line: 117, baseType: !481, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !478, file: !477, line: 118, baseType: !545, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !478, file: !477, line: 119, baseType: !105, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !478, file: !477, line: 120, baseType: !57, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !478, file: !477, line: 121, baseType: !60, size: 32, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !478, file: !477, line: 122, baseType: !60, size: 32, offset: 352)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !478, file: !477, line: 124, baseType: !62, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !478, file: !477, line: 125, baseType: !62, size: 64, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !478, file: !477, line: 126, baseType: !553, size: 64, offset: 512)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!60, !556, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !478, file: !477, line: 196, baseType: !60, size: 32, offset: 576)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !478, file: !477, line: 205, baseType: !561, size: 64, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !477, line: 205, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !478, file: !477, line: 227, baseType: !564, size: 64, offset: 704)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !478, file: !477, line: 207, size: 64, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !564, file: !477, line: 220, baseType: !561, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !564, file: !477, line: 226, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !570, line: 32, size: 256, elements: !571)
!570 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!571 = !{!572, !577, !581}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !569, file: !570, line: 34, baseType: !573, size: 128)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !99, line: 30, size: 128, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !573, file: !99, line: 32, baseType: !102, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !573, file: !99, line: 33, baseType: !105, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !569, file: !570, line: 35, baseType: !578, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !579, line: 102, baseType: !580)
!579 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !48, line: 73, baseType: !64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !569, file: !570, line: 36, baseType: !60, size: 32, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !478, file: !477, line: 232, baseType: !583, size: 256, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !584, line: 47, baseType: !585)
!584 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !584, line: 39, size: 256, elements: !586)
!586 = !{!587, !589, !590, !591, !592}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !585, file: !584, line: 41, baseType: !588, size: 128)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !333)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !585, file: !584, line: 42, baseType: !60, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !585, file: !584, line: 43, baseType: !6, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !585, file: !584, line: 44, baseType: !6, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !585, file: !584, line: 45, baseType: !86, size: 8, offset: 224)
!593 = !{!594}
!594 = !DILocalVariable(name: "fts", arg: 1, scope: !472, file: !471, line: 50, type: !475)
!595 = !{!596}
!596 = !DIEnumerator(name: "HT_INITIAL_SIZE", value: 31)
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 635, baseType: !6, size: 32, elements: !598)
!598 = !{!599}
!599 = !DIEnumerator(name: "MIN_DIR_NLINK", value: 2)
!600 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "leaf_optimization", file: !464, line: 638, baseType: !6, size: 32, elements: !601)
!601 = !{!602, !603}
!602 = !DIEnumerator(name: "NO_LEAF_OPTIMIZATION", value: 0)
!603 = !DIEnumerator(name: "OK_LEAF_OPTIMIZATION", value: 1)
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !490, line: 97, baseType: !6, size: 32, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614}
!606 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!607 = !DIEnumerator(name: "DT_FIFO", value: 1)
!608 = !DIEnumerator(name: "DT_CHR", value: 2)
!609 = !DIEnumerator(name: "DT_DIR", value: 4)
!610 = !DIEnumerator(name: "DT_BLK", value: 6)
!611 = !DIEnumerator(name: "DT_REG", value: 8)
!612 = !DIEnumerator(name: "DT_LNK", value: 10)
!613 = !DIEnumerator(name: "DT_SOCK", value: 12)
!614 = !DIEnumerator(name: "DT_WHT", value: 14)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 154, baseType: !6, size: 32, elements: !616)
!616 = !{!617}
!617 = !DIEnumerator(name: "_FTS_INODE_SORT_DIR_ENTRIES_THRESHOLD", value: 10000)
!618 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !464, line: 676, baseType: !6, size: 32, elements: !619)
!619 = !{!620}
!620 = !DIEnumerator(name: "DEV_TYPE_HT_INITIAL_SIZE", value: 13)
!621 = !{!59, !578, !622, !623, !628}
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !579, line: 90, baseType: !64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!60, !626, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !477, line: 286, baseType: !482)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !636, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "lib/i-ring.c", directory: "/src", checksumkind: CSK_MD5, checksum: "581251246a0cdfeb716d0893ef103e1d")
!636 = !{!637}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !584, line: 28, baseType: !6, size: 32, elements: !638)
!638 = !{!639}
!639 = !DIEnumerator(name: "I_RING_SIZE", value: 4)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !642, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!642 = !{!643}
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !641, line: 78, baseType: !6, size: 32, elements: !644)
!644 = !{!645, !646, !647, !648}
!645 = !DIEnumerator(name: "MODE_DONE", value: 0)
!646 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!647 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!648 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !657, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!657 = !{!86, !64, !59}
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !664, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!663 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!664 = !{!665}
!665 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !663, line: 40, baseType: !6, size: 32, elements: !666)
!666 = !{!667}
!667 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!668 = !{!59}
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !671, retainedTypes: !699, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!671 = !{!672, !684}
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !673, file: !670, line: 188, baseType: !6, size: 32, elements: !682)
!673 = distinct !DISubprogram(name: "x2nrealloc", scope: !670, file: !670, line: 176, type: !674, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !669, retainedNodes: !677)
!674 = !DISubroutineType(types: !675)
!675 = !{!59, !59, !676, !62}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!677 = !{!678, !679, !680, !681}
!678 = !DILocalVariable(name: "p", arg: 1, scope: !673, file: !670, line: 176, type: !59)
!679 = !DILocalVariable(name: "pn", arg: 2, scope: !673, file: !670, line: 176, type: !676)
!680 = !DILocalVariable(name: "s", arg: 3, scope: !673, file: !670, line: 176, type: !62)
!681 = !DILocalVariable(name: "n", scope: !673, file: !670, line: 178, type: !62)
!682 = !{!683}
!683 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !685, file: !670, line: 228, baseType: !6, size: 32, elements: !682)
!685 = distinct !DISubprogram(name: "xpalloc", scope: !670, file: !670, line: 223, type: !686, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !669, retainedNodes: !689)
!686 = !DISubroutineType(types: !687)
!687 = !{!59, !59, !688, !80, !82, !80}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698}
!690 = !DILocalVariable(name: "pa", arg: 1, scope: !685, file: !670, line: 223, type: !59)
!691 = !DILocalVariable(name: "pn", arg: 2, scope: !685, file: !670, line: 223, type: !688)
!692 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !685, file: !670, line: 223, type: !80)
!693 = !DILocalVariable(name: "n_max", arg: 4, scope: !685, file: !670, line: 223, type: !82)
!694 = !DILocalVariable(name: "s", arg: 5, scope: !685, file: !670, line: 223, type: !80)
!695 = !DILocalVariable(name: "n0", scope: !685, file: !670, line: 230, type: !80)
!696 = !DILocalVariable(name: "n", scope: !685, file: !670, line: 237, type: !80)
!697 = !DILocalVariable(name: "nbytes", scope: !685, file: !670, line: 248, type: !80)
!698 = !DILocalVariable(name: "adjusted_nbytes", scope: !685, file: !670, line: 252, type: !80)
!699 = !{!57, !59, !86, !83, !64}
!700 = distinct !DICompileUnit(language: DW_LANG_C99, file: !701, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!706 = distinct !DICompileUnit(language: DW_LANG_C99, file: !707, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !713, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!724 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!725 = !{i32 7, !"Dwarf Version", i32 5}
!726 = !{i32 2, !"Debug Info Version", i32 3}
!727 = !{i32 1, !"wchar_size", i32 4}
!728 = !{i32 1, !"branch-target-enforcement", i32 0}
!729 = !{i32 1, !"sign-return-address", i32 0}
!730 = !{i32 1, !"sign-return-address-all", i32 0}
!731 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!732 = !{i32 7, !"PIC Level", i32 2}
!733 = !{i32 7, !"PIE Level", i32 2}
!734 = !{i32 7, !"uwtable", i32 1}
!735 = !{i32 7, !"frame-pointer", i32 1}
!736 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 407, type: !737, scopeLine: 408, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !739)
!737 = !DISubroutineType(types: !738)
!738 = !{null, !60}
!739 = !{!740}
!740 = !DILocalVariable(name: "status", arg: 1, scope: !736, file: !3, line: 407, type: !60)
!741 = !DILocation(line: 0, scope: !736)
!742 = !DILocation(line: 409, column: 14, scope: !743)
!743 = distinct !DILexicalBlock(scope: !736, file: !3, line: 409, column: 7)
!744 = !DILocation(line: 409, column: 7, scope: !736)
!745 = !DILocation(line: 410, column: 5, scope: !746)
!746 = distinct !DILexicalBlock(scope: !743, file: !3, line: 410, column: 5)
!747 = !{!748, !748, i64 0}
!748 = !{!"any pointer", !749, i64 0}
!749 = !{!"omnipotent char", !750, i64 0}
!750 = !{!"Simple C/C++ TBAA"}
!751 = !DILocation(line: 413, column: 7, scope: !752)
!752 = distinct !DILexicalBlock(scope: !743, file: !3, line: 412, column: 5)
!753 = !DILocation(line: 419, column: 7, scope: !752)
!754 = !DILocation(line: 424, column: 7, scope: !752)
!755 = !DILocation(line: 428, column: 7, scope: !752)
!756 = !DILocation(line: 432, column: 7, scope: !752)
!757 = !DILocation(line: 436, column: 7, scope: !752)
!758 = !DILocation(line: 441, column: 7, scope: !752)
!759 = !DILocation(line: 445, column: 7, scope: !752)
!760 = !DILocation(line: 449, column: 7, scope: !752)
!761 = !DILocation(line: 453, column: 7, scope: !752)
!762 = !DILocation(line: 458, column: 7, scope: !752)
!763 = !DILocalVariable(name: "program", arg: 1, scope: !764, file: !126, line: 799, type: !65)
!764 = distinct !DISubprogram(name: "emit_symlink_recurse_options_", scope: !126, file: !126, line: 799, type: !127, scopeLine: 800, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !765)
!765 = !{!763, !766}
!766 = !DILocalVariable(name: "default_opt", arg: 2, scope: !764, file: !126, line: 799, type: !65)
!767 = !DILocation(line: 0, scope: !764, inlinedAt: !768)
!768 = distinct !DILocation(line: 462, column: 7, scope: !752)
!769 = !DILocation(line: 801, column: 7, scope: !764, inlinedAt: !768)
!770 = !DILocation(line: 808, column: 24, scope: !764, inlinedAt: !768)
!771 = !DILocation(line: 808, column: 7, scope: !764, inlinedAt: !768)
!772 = !DILocation(line: 812, column: 24, scope: !764, inlinedAt: !768)
!773 = !DILocation(line: 812, column: 7, scope: !764, inlinedAt: !768)
!774 = !DILocation(line: 816, column: 24, scope: !764, inlinedAt: !768)
!775 = !DILocation(line: 816, column: 7, scope: !764, inlinedAt: !768)
!776 = !DILocation(line: 463, column: 7, scope: !752)
!777 = !DILocation(line: 464, column: 7, scope: !752)
!778 = !DILocation(line: 465, column: 7, scope: !752)
!779 = !DILocalVariable(name: "program", arg: 1, scope: !780, file: !126, line: 836, type: !65)
!780 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !126, file: !126, line: 836, type: !781, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !65}
!783 = !{!779, !784, !793, !794, !796, !797}
!784 = !DILocalVariable(name: "infomap", scope: !780, file: !126, line: 838, type: !785)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 896, elements: !791)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !780, file: !126, line: 838, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !787, file: !126, line: 838, baseType: !65, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !787, file: !126, line: 838, baseType: !65, size: 64, offset: 64)
!791 = !{!792}
!792 = !DISubrange(count: 7)
!793 = !DILocalVariable(name: "node", scope: !780, file: !126, line: 848, type: !65)
!794 = !DILocalVariable(name: "map_prog", scope: !780, file: !126, line: 849, type: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!796 = !DILocalVariable(name: "lc_messages", scope: !780, file: !126, line: 861, type: !65)
!797 = !DILocalVariable(name: "url_program", scope: !780, file: !126, line: 874, type: !65)
!798 = !DILocation(line: 0, scope: !780, inlinedAt: !799)
!799 = distinct !DILocation(line: 469, column: 7, scope: !752)
!800 = !DILocation(line: 838, column: 3, scope: !780, inlinedAt: !799)
!801 = !DILocation(line: 838, column: 67, scope: !780, inlinedAt: !799)
!802 = !DILocation(line: 849, column: 36, scope: !780, inlinedAt: !799)
!803 = !DILocation(line: 851, column: 3, scope: !780, inlinedAt: !799)
!804 = !DILocalVariable(name: "__s1", arg: 1, scope: !805, file: !806, line: 1359, type: !65)
!805 = distinct !DISubprogram(name: "streq", scope: !806, file: !806, line: 1359, type: !807, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!806 = !DIFile(filename: "./lib/string.h", directory: "/src")
!807 = !DISubroutineType(types: !808)
!808 = !{!86, !65, !65}
!809 = !{!804, !810}
!810 = !DILocalVariable(name: "__s2", arg: 2, scope: !805, file: !806, line: 1359, type: !65)
!811 = !DILocation(line: 0, scope: !805, inlinedAt: !812)
!812 = distinct !DILocation(line: 851, column: 33, scope: !780, inlinedAt: !799)
!813 = !DILocation(line: 1361, column: 11, scope: !805, inlinedAt: !812)
!814 = !DILocation(line: 1361, column: 10, scope: !805, inlinedAt: !812)
!815 = !DILocation(line: 852, column: 13, scope: !780, inlinedAt: !799)
!816 = !DILocation(line: 851, column: 20, scope: !780, inlinedAt: !799)
!817 = !{!818, !748, i64 0}
!818 = !{!"infomap", !748, i64 0, !748, i64 8}
!819 = !DILocation(line: 851, column: 10, scope: !780, inlinedAt: !799)
!820 = !DILocation(line: 851, column: 28, scope: !780, inlinedAt: !799)
!821 = distinct !{!821, !803, !815, !822}
!822 = !{!"llvm.loop.mustprogress"}
!823 = !DILocation(line: 854, column: 17, scope: !824, inlinedAt: !799)
!824 = distinct !DILexicalBlock(scope: !780, file: !126, line: 854, column: 7)
!825 = !{!818, !748, i64 8}
!826 = !DILocation(line: 854, column: 7, scope: !824, inlinedAt: !799)
!827 = !DILocation(line: 854, column: 7, scope: !780, inlinedAt: !799)
!828 = !DILocation(line: 857, column: 3, scope: !780, inlinedAt: !799)
!829 = !DILocation(line: 861, column: 29, scope: !780, inlinedAt: !799)
!830 = !DILocation(line: 862, column: 7, scope: !831, inlinedAt: !799)
!831 = distinct !DILexicalBlock(scope: !780, file: !126, line: 862, column: 7)
!832 = !DILocation(line: 862, column: 19, scope: !831, inlinedAt: !799)
!833 = !DILocation(line: 862, column: 22, scope: !831, inlinedAt: !799)
!834 = !DILocation(line: 862, column: 7, scope: !780, inlinedAt: !799)
!835 = !DILocation(line: 868, column: 7, scope: !836, inlinedAt: !799)
!836 = distinct !DILexicalBlock(scope: !831, file: !126, line: 863, column: 5)
!837 = !DILocation(line: 870, column: 5, scope: !836, inlinedAt: !799)
!838 = !DILocation(line: 0, scope: !805, inlinedAt: !839)
!839 = distinct !DILocation(line: 874, column: 29, scope: !780, inlinedAt: !799)
!840 = !DILocation(line: 875, column: 3, scope: !780, inlinedAt: !799)
!841 = !DILocation(line: 877, column: 3, scope: !780, inlinedAt: !799)
!842 = !DILocation(line: 879, column: 1, scope: !780, inlinedAt: !799)
!843 = !DILocation(line: 471, column: 3, scope: !736)
!844 = !DISubprogram(name: "dcgettext", scope: !845, file: !845, line: 51, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !848)
!845 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!846 = !DISubroutineType(types: !847)
!847 = !{!57, !65, !65, !60}
!848 = !{}
!849 = !DISubprogram(name: "fputs_unlocked", scope: !250, file: !250, line: 691, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !848)
!850 = !DISubroutineType(types: !851)
!851 = !{!60, !852, !853}
!852 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!853 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !148)
!854 = !DILocation(line: 0, scope: !125)
!855 = !DILocation(line: 581, column: 7, scope: !134)
!856 = !{!857, !857, i64 0}
!857 = !{!"int", !749, i64 0}
!858 = !DILocation(line: 581, column: 19, scope: !134)
!859 = !DILocation(line: 581, column: 7, scope: !125)
!860 = !DILocation(line: 585, column: 26, scope: !133)
!861 = !DILocation(line: 0, scope: !133)
!862 = !DILocation(line: 586, column: 23, scope: !133)
!863 = !DILocation(line: 586, column: 28, scope: !133)
!864 = !DILocation(line: 586, column: 32, scope: !133)
!865 = !{!749, !749, i64 0}
!866 = !DILocation(line: 586, column: 38, scope: !133)
!867 = !DILocation(line: 0, scope: !805, inlinedAt: !868)
!868 = distinct !DILocation(line: 586, column: 41, scope: !133)
!869 = !DILocation(line: 1361, column: 11, scope: !805, inlinedAt: !868)
!870 = !DILocation(line: 1361, column: 10, scope: !805, inlinedAt: !868)
!871 = !DILocation(line: 586, column: 19, scope: !133)
!872 = !DILocation(line: 587, column: 5, scope: !133)
!873 = !DILocation(line: 588, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !125, file: !126, line: 588, column: 7)
!875 = !DILocation(line: 588, column: 7, scope: !125)
!876 = !DILocation(line: 590, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !126, line: 589, column: 5)
!878 = !DILocation(line: 591, column: 7, scope: !877)
!879 = !DILocation(line: 595, column: 37, scope: !125)
!880 = !DILocation(line: 595, column: 35, scope: !125)
!881 = !DILocation(line: 596, column: 29, scope: !125)
!882 = !DILocation(line: 597, column: 8, scope: !141)
!883 = !DILocation(line: 597, column: 7, scope: !125)
!884 = !DILocation(line: 604, column: 24, scope: !140)
!885 = !DILocation(line: 604, column: 12, scope: !141)
!886 = !DILocation(line: 0, scope: !139)
!887 = !DILocation(line: 610, column: 16, scope: !139)
!888 = !DILocation(line: 610, column: 7, scope: !139)
!889 = !DILocation(line: 611, column: 21, scope: !139)
!890 = !{!891, !891, i64 0}
!891 = !{!"short", !749, i64 0}
!892 = !DILocation(line: 611, column: 19, scope: !139)
!893 = !DILocation(line: 611, column: 16, scope: !139)
!894 = !DILocation(line: 610, column: 30, scope: !139)
!895 = distinct !{!895, !888, !889, !822}
!896 = !DILocation(line: 612, column: 18, scope: !897)
!897 = distinct !DILexicalBlock(scope: !139, file: !126, line: 612, column: 11)
!898 = !DILocation(line: 612, column: 11, scope: !139)
!899 = !DILocation(line: 620, column: 23, scope: !125)
!900 = !DILocation(line: 625, column: 39, scope: !125)
!901 = !DILocation(line: 626, column: 3, scope: !125)
!902 = !DILocation(line: 626, column: 10, scope: !125)
!903 = !DILocation(line: 626, column: 21, scope: !125)
!904 = !DILocation(line: 628, column: 44, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !126, line: 628, column: 11)
!906 = distinct !DILexicalBlock(scope: !125, file: !126, line: 627, column: 5)
!907 = !DILocation(line: 628, column: 32, scope: !905)
!908 = !DILocation(line: 628, column: 49, scope: !905)
!909 = !DILocation(line: 628, column: 11, scope: !906)
!910 = !DILocation(line: 630, column: 11, scope: !911)
!911 = distinct !DILexicalBlock(scope: !906, file: !126, line: 630, column: 11)
!912 = !DILocation(line: 630, column: 11, scope: !906)
!913 = !DILocation(line: 632, column: 26, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !126, line: 632, column: 15)
!915 = distinct !DILexicalBlock(scope: !911, file: !126, line: 631, column: 9)
!916 = !DILocation(line: 632, column: 34, scope: !914)
!917 = !DILocation(line: 632, column: 37, scope: !914)
!918 = !DILocation(line: 632, column: 15, scope: !915)
!919 = !DILocation(line: 636, column: 29, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !126, line: 636, column: 15)
!921 = !DILocation(line: 640, column: 16, scope: !906)
!922 = distinct !{!922, !901, !923, !822}
!923 = !DILocation(line: 641, column: 5, scope: !125)
!924 = !DILocation(line: 644, column: 3, scope: !125)
!925 = !DILocation(line: 0, scope: !805, inlinedAt: !926)
!926 = distinct !DILocation(line: 648, column: 31, scope: !125)
!927 = !DILocation(line: 0, scope: !805, inlinedAt: !928)
!928 = distinct !DILocation(line: 649, column: 31, scope: !125)
!929 = !DILocation(line: 0, scope: !805, inlinedAt: !930)
!930 = distinct !DILocation(line: 650, column: 31, scope: !125)
!931 = !DILocation(line: 0, scope: !805, inlinedAt: !932)
!932 = distinct !DILocation(line: 651, column: 31, scope: !125)
!933 = !DILocation(line: 0, scope: !805, inlinedAt: !934)
!934 = distinct !DILocation(line: 652, column: 31, scope: !125)
!935 = !DILocation(line: 0, scope: !805, inlinedAt: !936)
!936 = distinct !DILocation(line: 653, column: 31, scope: !125)
!937 = !DILocation(line: 0, scope: !805, inlinedAt: !938)
!938 = distinct !DILocation(line: 654, column: 31, scope: !125)
!939 = !DILocation(line: 0, scope: !805, inlinedAt: !940)
!940 = distinct !DILocation(line: 655, column: 31, scope: !125)
!941 = !DILocation(line: 0, scope: !805, inlinedAt: !942)
!942 = distinct !DILocation(line: 656, column: 31, scope: !125)
!943 = !DILocation(line: 0, scope: !805, inlinedAt: !944)
!944 = distinct !DILocation(line: 657, column: 31, scope: !125)
!945 = !DILocation(line: 663, column: 7, scope: !946)
!946 = distinct !DILexicalBlock(scope: !125, file: !126, line: 663, column: 7)
!947 = !DILocation(line: 664, column: 7, scope: !946)
!948 = !DILocation(line: 664, column: 10, scope: !946)
!949 = !DILocation(line: 663, column: 7, scope: !125)
!950 = !DILocation(line: 669, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !946, file: !126, line: 665, column: 5)
!952 = !DILocation(line: 671, column: 5, scope: !951)
!953 = !DILocation(line: 676, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !946, file: !126, line: 673, column: 5)
!955 = !DILocation(line: 679, column: 3, scope: !125)
!956 = !DILocation(line: 683, column: 3, scope: !125)
!957 = !DILocation(line: 686, column: 3, scope: !125)
!958 = !DILocation(line: 688, column: 3, scope: !125)
!959 = !DILocation(line: 691, column: 3, scope: !125)
!960 = !DILocation(line: 695, column: 3, scope: !125)
!961 = !DILocation(line: 696, column: 1, scope: !125)
!962 = !DISubprogram(name: "setlocale", scope: !963, file: !963, line: 122, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !848)
!963 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!964 = !DISubroutineType(types: !965)
!965 = !{!57, !60, !65}
!966 = !DISubprogram(name: "getenv", scope: !967, file: !967, line: 641, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !848)
!967 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!968 = !DISubroutineType(types: !969)
!969 = !{!57, !65}
!970 = !DISubprogram(name: "fwrite_unlocked", scope: !250, file: !250, line: 704, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !848)
!971 = !DISubroutineType(types: !972)
!972 = !{!62, !973, !62, !62, !853}
!973 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !626)
!974 = !DILocation(line: 0, scope: !71)
!975 = !DILocation(line: 482, column: 3, scope: !71)
!976 = !DILocation(line: 482, column: 9, scope: !71)
!977 = !{!978, !978, i64 0}
!978 = !{!"long", !749, i64 0}
!979 = !DILocation(line: 490, column: 21, scope: !71)
!980 = !DILocation(line: 490, column: 3, scope: !71)
!981 = !DILocation(line: 491, column: 3, scope: !71)
!982 = !DILocation(line: 492, column: 3, scope: !71)
!983 = !DILocation(line: 493, column: 3, scope: !71)
!984 = !DILocation(line: 495, column: 3, scope: !71)
!985 = !DILocation(line: 497, column: 3, scope: !71)
!986 = !DILocation(line: 485, column: 15, scope: !71)
!987 = !DILocation(line: 487, column: 7, scope: !71)
!988 = !DILocation(line: 481, column: 9, scope: !71)
!989 = !DILocation(line: 480, column: 9, scope: !71)
!990 = !DILocation(line: 497, column: 15, scope: !71)
!991 = distinct !{!991, !985, !992, !822}
!992 = !DILocation(line: 593, column: 5, scope: !71)
!993 = !DILocation(line: 512, column: 11, scope: !93)
!994 = !DILocation(line: 516, column: 11, scope: !93)
!995 = !DILocation(line: 519, column: 23, scope: !93)
!996 = !DILocation(line: 520, column: 11, scope: !93)
!997 = !DILocation(line: 524, column: 23, scope: !93)
!998 = !DILocation(line: 525, column: 11, scope: !93)
!999 = !DILocation(line: 552, column: 36, scope: !92)
!1000 = !DILocation(line: 552, column: 43, scope: !92)
!1001 = !DILocation(line: 552, column: 31, scope: !92)
!1002 = !DILocation(line: 0, scope: !92)
!1003 = !DILocation(line: 553, column: 29, scope: !92)
!1004 = !DILocation(line: 554, column: 48, scope: !92)
!1005 = !DILocation(line: 554, column: 45, scope: !92)
!1006 = !DILocation(line: 555, column: 49, scope: !92)
!1007 = !DILocation(line: 556, column: 13, scope: !92)
!1008 = !DILocation(line: 557, column: 17, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !92, file: !3, line: 557, column: 17)
!1010 = !DILocation(line: 557, column: 28, scope: !1009)
!1011 = !DILocation(line: 557, column: 17, scope: !92)
!1012 = !DILocation(line: 559, column: 44, scope: !1009)
!1013 = !DILocation(line: 559, column: 48, scope: !1009)
!1014 = !DILocation(line: 558, column: 22, scope: !1009)
!1015 = !DILocation(line: 558, column: 15, scope: !1009)
!1016 = !DILocation(line: 560, column: 13, scope: !92)
!1017 = !DILocation(line: 560, column: 28, scope: !92)
!1018 = !DILocation(line: 561, column: 26, scope: !92)
!1019 = !DILocation(line: 561, column: 57, scope: !92)
!1020 = !DILocalVariable(name: "__dest", arg: 1, scope: !1021, file: !1022, line: 26, type: !1025)
!1021 = distinct !DISubprogram(name: "memcpy", scope: !1022, file: !1022, line: 26, type: !1023, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1026)
!1022 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!59, !1025, !973, !62}
!1025 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!1026 = !{!1020, !1027, !1028}
!1027 = !DILocalVariable(name: "__src", arg: 2, scope: !1021, file: !1022, line: 26, type: !973)
!1028 = !DILocalVariable(name: "__len", arg: 3, scope: !1021, file: !1022, line: 26, type: !62)
!1029 = !DILocation(line: 0, scope: !1021, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 561, column: 13, scope: !92)
!1031 = !DILocation(line: 29, column: 10, scope: !1021, inlinedAt: !1030)
!1032 = !DILocation(line: 564, column: 32, scope: !92)
!1033 = !DILocation(line: 566, column: 11, scope: !93)
!1034 = !DILocation(line: 569, column: 11, scope: !93)
!1035 = !DILocation(line: 572, column: 11, scope: !93)
!1036 = !DILocation(line: 574, column: 28, scope: !93)
!1037 = !DILocation(line: 575, column: 11, scope: !93)
!1038 = !DILocation(line: 577, column: 19, scope: !93)
!1039 = !DILocation(line: 578, column: 11, scope: !93)
!1040 = !DILocation(line: 580, column: 21, scope: !93)
!1041 = !DILocation(line: 581, column: 11, scope: !93)
!1042 = !DILocation(line: 583, column: 24, scope: !93)
!1043 = !DILocation(line: 584, column: 11, scope: !93)
!1044 = !DILocation(line: 586, column: 21, scope: !93)
!1045 = !DILocation(line: 587, column: 11, scope: !93)
!1046 = !DILocation(line: 588, column: 9, scope: !93)
!1047 = !DILocation(line: 589, column: 9, scope: !93)
!1048 = !DILocation(line: 591, column: 11, scope: !93)
!1049 = !DILocation(line: 595, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !71, file: !3, line: 595, column: 7)
!1051 = !DILocation(line: 595, column: 7, scope: !71)
!1052 = !DILocation(line: 599, column: 27, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 599, column: 15)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 598, column: 9)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 597, column: 11)
!1056 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 596, column: 5)
!1057 = !DILocation(line: 599, column: 15, scope: !1054)
!1058 = !DILocation(line: 600, column: 13, scope: !1053)
!1059 = !DILocation(line: 606, column: 19, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !71, file: !3, line: 606, column: 7)
!1061 = !DILocation(line: 606, column: 25, scope: !1060)
!1062 = !DILocation(line: 609, column: 7, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !71, file: !3, line: 609, column: 7)
!1064 = !DILocation(line: 0, scope: !1063)
!1065 = !DILocation(line: 609, column: 7, scope: !71)
!1066 = !DILocation(line: 611, column: 11, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 610, column: 5)
!1068 = !DILocation(line: 613, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 612, column: 9)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 611, column: 11)
!1071 = !DILocation(line: 614, column: 11, scope: !1069)
!1072 = !DILocation(line: 619, column: 11, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 618, column: 5)
!1074 = !DILocation(line: 620, column: 27, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 619, column: 11)
!1076 = !DILocation(line: 620, column: 16, scope: !1075)
!1077 = !DILocation(line: 620, column: 9, scope: !1075)
!1078 = !DILocation(line: 623, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !71, file: !3, line: 623, column: 7)
!1080 = !DILocation(line: 623, column: 14, scope: !1079)
!1081 = !DILocation(line: 623, column: 7, scope: !71)
!1082 = !DILocation(line: 625, column: 12, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 625, column: 11)
!1084 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 624, column: 5)
!1085 = !DILocation(line: 625, column: 17, scope: !1083)
!1086 = !DILocation(line: 625, column: 40, scope: !1083)
!1087 = !DILocation(line: 625, column: 28, scope: !1083)
!1088 = !DILocation(line: 625, column: 25, scope: !1083)
!1089 = !DILocation(line: 625, column: 11, scope: !1084)
!1090 = !DILocation(line: 626, column: 9, scope: !1083)
!1091 = !DILocation(line: 628, column: 9, scope: !1083)
!1092 = !DILocation(line: 629, column: 7, scope: !1084)
!1093 = !DILocation(line: 634, column: 16, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 633, column: 5)
!1095 = distinct !DILexicalBlock(scope: !71, file: !3, line: 632, column: 7)
!1096 = !DILocation(line: 634, column: 14, scope: !1094)
!1097 = !DILocation(line: 635, column: 12, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 635, column: 11)
!1099 = !DILocation(line: 635, column: 11, scope: !1094)
!1100 = !DILocation(line: 636, column: 9, scope: !1098)
!1101 = !DILocation(line: 641, column: 16, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 640, column: 5)
!1103 = !DILocation(line: 641, column: 14, scope: !1102)
!1104 = !DILocation(line: 642, column: 12, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 642, column: 11)
!1106 = !DILocation(line: 642, column: 11, scope: !1102)
!1107 = !DILocation(line: 644, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 643, column: 9)
!1109 = !DILocation(line: 645, column: 11, scope: !1108)
!1110 = !DILocation(line: 647, column: 21, scope: !1102)
!1111 = !DILocation(line: 647, column: 19, scope: !1102)
!1112 = !DILocation(line: 650, column: 7, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !71, file: !3, line: 650, column: 7)
!1114 = !DILocation(line: 650, column: 15, scope: !1113)
!1115 = !DILocation(line: 653, column: 22, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 651, column: 5)
!1117 = !DILocation(line: 653, column: 20, scope: !1116)
!1118 = !DILocation(line: 654, column: 24, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 654, column: 11)
!1120 = !DILocation(line: 654, column: 11, scope: !1116)
!1121 = !DILocation(line: 655, column: 9, scope: !1119)
!1122 = !DILocation(line: 660, column: 20, scope: !1123)
