; ModuleID = 'src/cksum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.blake2b_param__ = type { i8, i8, i8, i8, i32, i32, i32, i8, i8, [14 x i8], [16 x i8], [16 x i8] }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.sha3_ctx = type { [25 x i64], [144 x i8], i64, i64, i64 }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

!111 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 46, baseType: !86)
!113 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!118 = !{!0, !119, !122, !128, !130, !132, !134, !136, !142, !225, !239, !241, !246, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !274, !290, !292, !307, !318}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 194, type: !121, isLocal: true, isDefinition: true)
!121 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 197, type: !124, isLocal: true, isDefinition: true)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !125, line: 130, baseType: !126)
!125 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !113, line: 35, baseType: !127)
!127 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 200, type: !124, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "digest_length", scope: !2, file: !3, line: 241, type: !124, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "cksum_debug", scope: !2, file: !3, line: 413, type: !121, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "legacy_mode", scope: !2, file: !3, line: 376, type: !121, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "algorithm_tags", scope: !2, file: !3, line: 360, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 960, elements: !140)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!140 = !{!141}
!141 = !DISubrange(count: 15)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !144, file: !82, line: 575, type: !110, isLocal: true, isDefinition: true)
!144 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !145, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !114, !114}
!147 = !{!148, !149, !150, !153, !154, !155, !156, !160, !161, !162, !163, !165, !219, !220, !221, !223, !224}
!148 = !DILocalVariable(name: "program", arg: 1, scope: !144, file: !82, line: 573, type: !114)
!149 = !DILocalVariable(name: "option", arg: 2, scope: !144, file: !82, line: 573, type: !114)
!150 = !DILocalVariable(name: "term", scope: !151, file: !82, line: 585, type: !114)
!151 = distinct !DILexicalBlock(scope: !152, file: !82, line: 582, column: 5)
!152 = distinct !DILexicalBlock(scope: !144, file: !82, line: 581, column: 7)
!153 = !DILocalVariable(name: "double_space", scope: !144, file: !82, line: 594, type: !121)
!154 = !DILocalVariable(name: "first_word", scope: !144, file: !82, line: 595, type: !114)
!155 = !DILocalVariable(name: "option_text", scope: !144, file: !82, line: 596, type: !114)
!156 = !DILocalVariable(name: "s", scope: !157, file: !82, line: 608, type: !114)
!157 = distinct !DILexicalBlock(scope: !158, file: !82, line: 605, column: 5)
!158 = distinct !DILexicalBlock(scope: !159, file: !82, line: 604, column: 12)
!159 = distinct !DILexicalBlock(scope: !144, file: !82, line: 597, column: 7)
!160 = !DILocalVariable(name: "spaces", scope: !157, file: !82, line: 609, type: !112)
!161 = !DILocalVariable(name: "anchor_len", scope: !144, file: !82, line: 620, type: !112)
!162 = !DILocalVariable(name: "desc_text", scope: !144, file: !82, line: 625, type: !114)
!163 = !DILocalVariable(name: "__ptr", scope: !164, file: !82, line: 644, type: !114)
!164 = distinct !DILexicalBlock(scope: !144, file: !82, line: 644, column: 3)
!165 = !DILocalVariable(name: "__stream", scope: !164, file: !82, line: 644, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !169)
!168 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !171)
!170 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !187, !189, !190, !191, !193, !194, !196, !200, !203, !205, !208, !211, !212, !213, !214, !215}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !169, file: !170, line: 51, baseType: !110, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !169, file: !170, line: 54, baseType: !107, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !169, file: !170, line: 55, baseType: !107, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !169, file: !170, line: 56, baseType: !107, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !169, file: !170, line: 57, baseType: !107, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !169, file: !170, line: 58, baseType: !107, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !169, file: !170, line: 59, baseType: !107, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !169, file: !170, line: 60, baseType: !107, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !169, file: !170, line: 61, baseType: !107, size: 64, offset: 512)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !169, file: !170, line: 64, baseType: !107, size: 64, offset: 576)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !169, file: !170, line: 65, baseType: !107, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !169, file: !170, line: 66, baseType: !107, size: 64, offset: 704)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !169, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !170, line: 36, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !169, file: !170, line: 70, baseType: !188, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !169, file: !170, line: 72, baseType: !110, size: 32, offset: 896)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !169, file: !170, line: 73, baseType: !110, size: 32, offset: 928)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !169, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !127)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !169, file: !170, line: 77, baseType: !111, size: 16, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !169, file: !170, line: 78, baseType: !195, size: 8, offset: 1040)
!195 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !169, file: !170, line: 79, baseType: !197, size: 8, offset: 1048)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 8, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 1)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !169, file: !170, line: 81, baseType: !201, size: 64, offset: 1088)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !170, line: 43, baseType: null)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !169, file: !170, line: 89, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !127)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !169, file: !170, line: 91, baseType: !206, size: 64, offset: 1216)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !170, line: 37, flags: DIFlagFwdDecl)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !169, file: !170, line: 92, baseType: !209, size: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !170, line: 38, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !169, file: !170, line: 93, baseType: !188, size: 64, offset: 1344)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !169, file: !170, line: 94, baseType: !109, size: 64, offset: 1408)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !169, file: !170, line: 95, baseType: !112, size: 64, offset: 1472)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !169, file: !170, line: 96, baseType: !110, size: 32, offset: 1536)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !169, file: !170, line: 98, baseType: !216, size: 160, offset: 1568)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 160, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 20)
!219 = !DILocalVariable(name: "__cnt", scope: !164, file: !82, line: 644, type: !112)
!220 = !DILocalVariable(name: "url_program", scope: !144, file: !82, line: 648, type: !114)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !82, line: 686, type: !114)
!222 = distinct !DILexicalBlock(scope: !144, file: !82, line: 686, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !82, line: 686, type: !166)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !82, line: 686, type: !112)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 453, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 4864, elements: !237)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !230, line: 50, size: 256, elements: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!231 = !{!232, !233, !234, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !229, file: !230, line: 52, baseType: !114, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !229, file: !230, line: 55, baseType: !110, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !229, file: !230, line: 56, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !229, file: !230, line: 57, baseType: !110, size: 32, offset: 192)
!237 = !{!238}
!238 = !DISubrange(count: 19)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "algorithm_specified", scope: !2, file: !3, line: 375, type: !121, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "legacy_long_options", scope: !2, file: !3, line: 433, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 3328, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 13)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "algorithm_types", scope: !2, file: !3, line: 352, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 448, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!250 = !{!251}
!251 = !DISubrange(count: 14)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "algorithm_args", scope: !2, file: !3, line: 346, type: !138, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 204, type: !121, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 208, type: !121, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 214, type: !121, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 211, type: !121, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 218, type: !121, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "base64_digest", scope: !2, file: !3, line: 228, type: !121, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "raw_digest", scope: !2, file: !3, line: 232, type: !121, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 224, type: !116, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "algorithm_bits", scope: !2, file: !3, line: 366, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 480, elements: !140)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "max_tag_len", scope: !276, file: !3, line: 872, type: !124, isLocal: true, isDefinition: true)
!276 = distinct !DISubprogram(name: "algorithm_from_tag", scope: !3, file: !3, line: 869, type: !277, scopeLine: 870, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !279)
!277 = !DISubroutineType(types: !278)
!278 = !{!126, !107}
!279 = !{!280, !281, !285, !287, !288, !289}
!280 = !DILocalVariable(name: "s", arg: 1, scope: !276, file: !3, line: 869, type: !107)
!281 = !DILocalVariable(name: "tag", scope: !282, file: !3, line: 875, type: !284)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 874, column: 5)
!283 = distinct !DILexicalBlock(scope: !276, file: !3, line: 873, column: 7)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!285 = !DILocalVariable(name: "tag_len", scope: !286, file: !3, line: 878, type: !124)
!286 = distinct !DILexicalBlock(scope: !282, file: !3, line: 877, column: 9)
!287 = !DILocalVariable(name: "i", scope: !276, file: !3, line: 883, type: !124)
!288 = !DILocalVariable(name: "sep", scope: !276, file: !3, line: 894, type: !108)
!289 = !DILocalVariable(name: "algo", scope: !276, file: !3, line: 896, type: !126)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 221, type: !110, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "bin2hex", scope: !294, file: !3, line: 1345, type: !304, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "hex_equal", scope: !3, file: !3, line: 1343, type: !295, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !299)
!295 = !DISubroutineType(types: !296)
!296 = !{!121, !297, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!299 = !{!300, !301, !302, !303}
!300 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !294, file: !3, line: 1343, type: !297)
!301 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !294, file: !3, line: 1343, type: !297)
!302 = !DILocalVariable(name: "digest_bin_bytes", scope: !294, file: !3, line: 1349, type: !124)
!303 = !DILocalVariable(name: "cnt", scope: !294, file: !3, line: 1353, type: !124)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 16)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "cksumfns", scope: !2, file: !3, line: 379, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 896, elements: !250)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !311, line: 7, baseType: !312)
!311 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!110, !166, !109, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !88, line: 101, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !90, line: 72, baseType: !127)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "cksum_output_fns", scope: !2, file: !3, line: 396, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 896, elements: !250)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 244, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !114, !110, !105, !121, !121, !116, !121, !316}
!325 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!326 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!327 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!328 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!329 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!330 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!331 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!332 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!333 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!334 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!335 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 3, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!336 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!337 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 7, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !340, file: !341, line: 27, type: !379, isLocal: true, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !342, retainedTypes: !351, globals: !359, splitDebugInlining: false, nameTableKind: None)
!341 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!342 = !{!343}
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !344, line: 42, baseType: !7, size: 32, elements: !345)
!344 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!345 = !{!346, !347, !348, !349, !350}
!346 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!347 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!348 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!349 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!350 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!351 = !{!352, !354, !297, !109, !357}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !355, line: 24, baseType: !356)
!355 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !90, line: 38, baseType: !116)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !355, line: 27, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !90, line: 45, baseType: !86)
!359 = !{!338, !360, !374}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "memset_v", scope: !362, file: !363, line: 161, type: !369, isLocal: true, isDefinition: true)
!362 = distinct !DISubprogram(name: "secure_zero_memory", scope: !363, file: !363, line: 159, type: !364, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !340, retainedNodes: !366)
!363 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!364 = !DISubroutineType(types: !365)
!365 = !{null, !109, !112}
!366 = !{!367, !368}
!367 = !DILocalVariable(name: "v", arg: 1, scope: !362, file: !363, line: 159, type: !109)
!368 = !DILocalVariable(name: "n", arg: 2, scope: !362, file: !363, line: 159, type: !112)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!109, !109, !110, !112}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !340, file: !341, line: 35, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 1536, elements: !377)
!377 = !{!378, !306}
!378 = !DISubrange(count: 12)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 512, elements: !381)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!381 = !{!382}
!382 = !DISubrange(count: 8)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "cksum_fp", scope: !385, file: !386, line: 287, type: !438, isLocal: true, isDefinition: true)
!385 = distinct !DISubprogram(name: "crc_sum_stream", scope: !386, file: !386, line: 282, type: !387, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !430)
!386 = !DIFile(filename: "src/cksum_crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6cd2e7250e6ce2490cff53f0738655c9")
!387 = !DISubroutineType(types: !388)
!388 = !{!110, !389, !109, !315}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !391, file: !170, line: 51, baseType: !110, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !391, file: !170, line: 54, baseType: !107, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !391, file: !170, line: 55, baseType: !107, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !391, file: !170, line: 56, baseType: !107, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !391, file: !170, line: 57, baseType: !107, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !391, file: !170, line: 58, baseType: !107, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !391, file: !170, line: 59, baseType: !107, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !391, file: !170, line: 60, baseType: !107, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !391, file: !170, line: 61, baseType: !107, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !391, file: !170, line: 64, baseType: !107, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !391, file: !170, line: 65, baseType: !107, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !391, file: !170, line: 66, baseType: !107, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !391, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !391, file: !170, line: 70, baseType: !407, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !391, file: !170, line: 72, baseType: !110, size: 32, offset: 896)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !391, file: !170, line: 73, baseType: !110, size: 32, offset: 928)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !391, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !391, file: !170, line: 77, baseType: !111, size: 16, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !391, file: !170, line: 78, baseType: !195, size: 8, offset: 1040)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !391, file: !170, line: 79, baseType: !197, size: 8, offset: 1048)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !391, file: !170, line: 81, baseType: !201, size: 64, offset: 1088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !391, file: !170, line: 89, baseType: !204, size: 64, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !391, file: !170, line: 91, baseType: !206, size: 64, offset: 1216)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !391, file: !170, line: 92, baseType: !209, size: 64, offset: 1280)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !391, file: !170, line: 93, baseType: !407, size: 64, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !391, file: !170, line: 94, baseType: !109, size: 64, offset: 1408)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !391, file: !170, line: 95, baseType: !112, size: 64, offset: 1472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !391, file: !170, line: 96, baseType: !110, size: 32, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !391, file: !170, line: 98, baseType: !216, size: 160, offset: 1568)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !424, globals: !429, splitDebugInlining: false, nameTableKind: None)
!424 = !{!121, !114, !425, !112, !428, !117, !116}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !355, line: 26, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !90, line: 42, baseType: !7)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!429 = !{!383}
!430 = !{!431, !432, !433, !434, !435, !437}
!431 = !DILocalVariable(name: "stream", arg: 1, scope: !385, file: !386, line: 282, type: !389)
!432 = !DILocalVariable(name: "resstream", arg: 2, scope: !385, file: !386, line: 282, type: !109)
!433 = !DILocalVariable(name: "length", arg: 3, scope: !385, file: !386, line: 282, type: !315)
!434 = !DILocalVariable(name: "total_bytes", scope: !385, file: !386, line: 284, type: !316)
!435 = !DILocalVariable(name: "crc", scope: !385, file: !386, line: 285, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !88, line: 74, baseType: !86)
!437 = !DILocalVariable(name: "crc_out", scope: !385, file: !386, line: 308, type: !7)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "cksum_fp_t", file: !386, line: 140, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!121, !389, !442, !315}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "Version", scope: !445, file: !446, line: 3, type: !114, isLocal: false, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !447, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!447 = !{!443}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !450, file: !451, line: 65, type: !455, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !452, retainedTypes: !453, globals: !454, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!452 = !{!59}
!453 = !{!109, !114, !116}
!454 = !{!448}
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !456, line: 69, baseType: !457)
!456 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !462, file: !463, line: 243, type: !471, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !464, globals: !465, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!464 = !{!121, !127, !86, !109, !107}
!465 = !{!460, !466}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "b64c", scope: !462, file: !463, line: 62, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 2048, elements: !473)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!473 = !{!474}
!474 = !DISubrange(count: 256)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "file_name", scope: !477, file: !478, line: 45, type: !114, isLocal: true, isDefinition: true)
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !479, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!479 = !{!475, !480}
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !477, file: !478, line: 55, type: !121, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !484, file: !485, line: 25, type: !121, isLocal: false, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !486, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!486 = !{!482, !487}
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "hwcaps", scope: !489, file: !485, line: 45, type: !114, isLocal: true, isDefinition: true)
!489 = distinct !DISubprogram(name: "hwcap_allowed", scope: !485, file: !485, line: 28, type: !490, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !484, retainedNodes: !492)
!490 = !DISubroutineType(types: !491)
!491 = !{!121, !114}
!492 = !{!493, !494, !499, !500, !501}
!493 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !489, file: !485, line: 28, type: !114)
!494 = !DILocalVariable(name: "tunables_start", scope: !495, file: !485, line: 50, type: !114)
!495 = distinct !DILexicalBlock(scope: !496, file: !485, line: 49, column: 9)
!496 = distinct !DILexicalBlock(scope: !497, file: !485, line: 48, column: 11)
!497 = distinct !DILexicalBlock(scope: !498, file: !485, line: 47, column: 5)
!498 = distinct !DILexicalBlock(scope: !489, file: !485, line: 46, column: 7)
!499 = !DILocalVariable(name: "last_hwcaps", scope: !495, file: !485, line: 51, type: !114)
!500 = !DILocalVariable(name: "sentinel", scope: !489, file: !485, line: 67, type: !114)
!501 = !DILocalVariable(name: "cap", scope: !489, file: !485, line: 70, type: !114)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "crc32_sliceby8_table", scope: !504, file: !507, line: 19, type: !508, isLocal: true, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b660508727a09332fc61bae8755ce0d9")
!506 = !{!502}
!507 = !DIFile(filename: "./lib/crc-sliceby8.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75ea92a6339c8e06d620d2f884dd622b")
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 65536, elements: !510)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!510 = !{!382, !474}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "fillbuf", scope: !513, file: !514, line: 60, type: !518, isLocal: true, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !515, globals: !517, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "lib/md5.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9a1fce7e7c2db2e106b191e5deaa23a2")
!515 = !{!107, !114, !516}
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !88, line: 90, baseType: !86)
!517 = !{!511}
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 512, elements: !469)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "fillbuf", scope: !521, file: !522, line: 46, type: !518, isLocal: true, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !523, globals: !524, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "lib/sha1.c", directory: "/src", checksumkind: CSK_MD5, checksum: "15f6407463c5c629a55eef1090757600")
!523 = !{!107, !114, !516, !426}
!524 = !{!519}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "fillbuf", scope: !527, file: !528, line: 45, type: !518, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !515, globals: !529, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/sha256.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bf00364acac5809a530ebfdf8076fa4")
!529 = !{!525, !530}
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !527, file: !528, line: 268, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 2048, elements: !469)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "rc", scope: !535, file: !536, line: 37, type: !565, isLocal: true, isDefinition: true)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, retainedTypes: !563, globals: !564, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/sha3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1fc4d6dcd92fa883821ca1644332995f")
!537 = !{!538, !542, !545, !548, !551, !554, !557, !560}
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 39, baseType: !7, size: 32, elements: !540)
!539 = !DIFile(filename: "./lib/sha3.h", directory: "/src", checksumkind: CSK_MD5, checksum: "16b15d0ed2c56a8b956136fe6252f1e9")
!540 = !{!541}
!541 = !DIEnumerator(name: "SHA3_224_DIGEST_SIZE", value: 28)
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 45, baseType: !7, size: 32, elements: !543)
!543 = !{!544}
!544 = !DIEnumerator(name: "SHA3_224_BLOCK_SIZE", value: 144)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 40, baseType: !7, size: 32, elements: !546)
!546 = !{!547}
!547 = !DIEnumerator(name: "SHA3_256_DIGEST_SIZE", value: 32)
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 46, baseType: !7, size: 32, elements: !549)
!549 = !{!550}
!550 = !DIEnumerator(name: "SHA3_256_BLOCK_SIZE", value: 136)
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 41, baseType: !7, size: 32, elements: !552)
!552 = !{!553}
!553 = !DIEnumerator(name: "SHA3_384_DIGEST_SIZE", value: 48)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 47, baseType: !7, size: 32, elements: !555)
!555 = !{!556}
!556 = !DIEnumerator(name: "SHA3_384_BLOCK_SIZE", value: 104)
!557 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 42, baseType: !7, size: 32, elements: !558)
!558 = !{!559}
!559 = !DIEnumerator(name: "SHA3_512_DIGEST_SIZE", value: 64)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 48, baseType: !7, size: 32, elements: !561)
!561 = !{!562}
!562 = !DIEnumerator(name: "SHA3_512_BLOCK_SIZE", value: 72)
!563 = !{!426}
!564 = !{!533}
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 1536, elements: !569)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !568, line: 48, baseType: !357)
!568 = !DIFile(filename: "./lib/u64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "748affdcb7c6d173090c334d88398f00")
!569 = !{!570}
!570 = !DISubrange(count: 24)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "fillbuf", scope: !573, file: !574, line: 45, type: !582, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !575, globals: !576, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/sha512.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b40e2f4ee4a922821a4d571a1e99a94")
!575 = !{!567, !107, !114, !516}
!576 = !{!571, !577}
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !573, file: !574, line: 269, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 5120, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 80)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 1024, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 128)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "fillbuf", scope: !587, file: !588, line: 58, type: !518, isLocal: true, isDefinition: true)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !515, globals: !589, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/sm3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1f78229a09b95249964fab4e8aefe8f9")
!589 = !{!585, !590}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "sm3_round_constants", scope: !587, file: !588, line: 232, type: !532, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !594, file: !595, line: 66, type: !457, isLocal: false, isDefinition: true)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !596, globals: !597, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!596 = !{!109, !116}
!597 = !{!598, !624, !592, !626, !628}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "old_file_name", scope: !600, file: !595, line: 304, type: !114, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "verror_at_line", scope: !595, file: !595, line: 298, type: !601, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !617)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !110, !110, !114, !7, !114, !603}
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !604, line: 52, baseType: !605)
!604 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !606, line: 32, baseType: !607)
!606 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !608, baseType: !609)
!608 = !DIFile(filename: "lib/error.c", directory: "/src")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !610, size: 256, elements: !611)
!610 = !DINamespace(name: "std", scope: null)
!611 = !{!612, !613, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !609, file: !608, baseType: !109, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !609, file: !608, baseType: !109, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !609, file: !608, baseType: !109, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !609, file: !608, baseType: !110, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !609, file: !608, baseType: !110, size: 32, offset: 224)
!617 = !{!618, !619, !620, !621, !622, !623}
!618 = !DILocalVariable(name: "status", arg: 1, scope: !600, file: !595, line: 298, type: !110)
!619 = !DILocalVariable(name: "errnum", arg: 2, scope: !600, file: !595, line: 298, type: !110)
!620 = !DILocalVariable(name: "file_name", arg: 3, scope: !600, file: !595, line: 298, type: !114)
!621 = !DILocalVariable(name: "line_number", arg: 4, scope: !600, file: !595, line: 298, type: !7)
!622 = !DILocalVariable(name: "message", arg: 5, scope: !600, file: !595, line: 298, type: !114)
!623 = !DILocalVariable(name: "args", arg: 6, scope: !600, file: !595, line: 298, type: !603)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "old_line_number", scope: !600, file: !595, line: 305, type: !7, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "error_message_count", scope: !594, file: !595, line: 69, type: !7, isLocal: false, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !594, file: !595, line: 295, type: !110, isLocal: false, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "power_letter", scope: !632, file: !633, line: 36, type: !660, isLocal: true, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !648, globals: !649, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!634 = !{!635, !73}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !636, line: 47, baseType: !7, size: 32, elements: !637)
!636 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!638 = !DIEnumerator(name: "human_ceiling", value: 0)
!639 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!640 = !DIEnumerator(name: "human_floor", value: 2)
!641 = !DIEnumerator(name: "human_group_digits", value: 4)
!642 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!643 = !DIEnumerator(name: "human_autoscale", value: 16)
!644 = !DIEnumerator(name: "human_base_1024", value: 32)
!645 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!646 = !DIEnumerator(name: "human_SI", value: 128)
!647 = !DIEnumerator(name: "human_B", value: 256)
!648 = !{!105}
!649 = !{!630, !650, !655}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "block_size_args", scope: !632, file: !633, line: 398, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 3)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !632, file: !633, line: 399, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 64, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 2)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 88, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 11)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "program_name", scope: !665, file: !666, line: 31, type: !114, isLocal: false, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !667, globals: !668, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!667 = !{!107}
!668 = !{!663}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "utf07FF", scope: !671, file: !672, line: 46, type: !701, isLocal: true, isDefinition: true)
!671 = distinct !DISubprogram(name: "proper_name_lite", scope: !672, file: !672, line: 38, type: !673, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !675, retainedNodes: !677)
!672 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!673 = !DISubroutineType(types: !674)
!674 = !{!114, !114, !114}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !676, splitDebugInlining: false, nameTableKind: None)
!676 = !{!669}
!677 = !{!678, !679, !680, !681, !685}
!678 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !671, file: !672, line: 38, type: !114)
!679 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !671, file: !672, line: 38, type: !114)
!680 = !DILocalVariable(name: "translation", scope: !671, file: !672, line: 40, type: !114)
!681 = !DILocalVariable(name: "w", scope: !671, file: !672, line: 47, type: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !683, line: 37, baseType: !684)
!683 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !90, line: 57, baseType: !427)
!685 = !DILocalVariable(name: "mbs", scope: !671, file: !672, line: 48, type: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !687, line: 6, baseType: !688)
!687 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !689, line: 21, baseType: !690)
!689 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 13, size: 64, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !690, file: !689, line: 15, baseType: !110, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !690, file: !689, line: 20, baseType: !694, size: 32, offset: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !690, file: !689, line: 16, size: 32, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !694, file: !689, line: 18, baseType: !7, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !694, file: !689, line: 19, baseType: !698, size: 32)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 32, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 4)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 16, elements: !658)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !704, file: !705, line: 76, type: !769, isLocal: false, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !706, retainedTypes: !712, globals: !713, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!706 = !{!59, !707, !44}
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !60, line: 254, baseType: !7, size: 32, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!710 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!711 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!712 = !{!110, !111, !112}
!713 = !{!702, !714, !720, !730, !732, !735, !758, !765, !767}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !704, file: !705, line: 92, type: !716, isLocal: false, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 320, elements: !718)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!718 = !{!719}
!719 = !DISubrange(count: 10)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !704, file: !705, line: 1040, type: !722, isLocal: false, isDefinition: true)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !705, line: 56, size: 448, elements: !723)
!723 = !{!724, !725, !726, !728, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !722, file: !705, line: 59, baseType: !59, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !722, file: !705, line: 62, baseType: !110, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !722, file: !705, line: 66, baseType: !727, size: 256, offset: 64)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !381)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !722, file: !705, line: 69, baseType: !114, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !722, file: !705, line: 72, baseType: !114, size: 64, offset: 384)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !704, file: !705, line: 107, type: !722, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "slot0", scope: !704, file: !705, line: 831, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 2048, elements: !473)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "quote", scope: !737, file: !705, line: 228, type: !756, isLocal: true, isDefinition: true)
!737 = distinct !DISubprogram(name: "gettext_quote", scope: !705, file: !705, line: 197, type: !738, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !704, retainedNodes: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!114, !114, !59}
!740 = !{!741, !742, !743, !744, !745}
!741 = !DILocalVariable(name: "msgid", arg: 1, scope: !737, file: !705, line: 197, type: !114)
!742 = !DILocalVariable(name: "s", arg: 2, scope: !737, file: !705, line: 197, type: !59)
!743 = !DILocalVariable(name: "translation", scope: !737, file: !705, line: 199, type: !114)
!744 = !DILocalVariable(name: "w", scope: !737, file: !705, line: 229, type: !682)
!745 = !DILocalVariable(name: "mbs", scope: !737, file: !705, line: 230, type: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !687, line: 6, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !689, line: 21, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 13, size: 64, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !748, file: !689, line: 15, baseType: !110, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !748, file: !689, line: 20, baseType: !752, size: 32, offset: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !748, file: !689, line: 16, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !752, file: !689, line: 18, baseType: !7, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !752, file: !689, line: 19, baseType: !698, size: 32)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 64, elements: !757)
!757 = !{!659, !700}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "slotvec", scope: !704, file: !705, line: 834, type: !760, isLocal: true, isDefinition: true)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !705, line: 823, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !761, file: !705, line: 825, baseType: !112, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !761, file: !705, line: 826, baseType: !107, size: 64, offset: 64)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "nslots", scope: !704, file: !705, line: 832, type: !110, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "slotvec0", scope: !704, file: !705, line: 833, type: !761, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 704, elements: !661)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !772, file: !773, line: 26, type: !775, isLocal: false, isDefinition: true)
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !774, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!774 = !{!770}
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 376, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 47)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "exit_failure", scope: !780, file: !781, line: 24, type: !783, isLocal: false, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !782, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!782 = !{!778}
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !786, file: !787, line: 506, type: !110, isLocal: true, isDefinition: true)
!786 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !787, file: !787, line: 485, type: !788, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !790, retainedNodes: !792)
!787 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!788 = !DISubroutineType(types: !789)
!789 = !{!110, !110, !110}
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !791, splitDebugInlining: false, nameTableKind: None)
!791 = !{!784}
!792 = !{!793, !794, !795, !796, !799}
!793 = !DILocalVariable(name: "fd", arg: 1, scope: !786, file: !787, line: 485, type: !110)
!794 = !DILocalVariable(name: "target", arg: 2, scope: !786, file: !787, line: 485, type: !110)
!795 = !DILocalVariable(name: "result", scope: !786, file: !787, line: 487, type: !110)
!796 = !DILocalVariable(name: "flags", scope: !797, file: !787, line: 530, type: !110)
!797 = distinct !DILexicalBlock(scope: !798, file: !787, line: 529, column: 5)
!798 = distinct !DILexicalBlock(scope: !786, file: !787, line: 528, column: 7)
!799 = !DILocalVariable(name: "saved_errno", scope: !800, file: !787, line: 533, type: !110)
!800 = distinct !DILexicalBlock(scope: !801, file: !787, line: 532, column: 9)
!801 = distinct !DILexicalBlock(scope: !797, file: !787, line: 531, column: 11)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "internal_state", scope: !804, file: !805, line: 97, type: !808, isLocal: true, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !806, globals: !807, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!806 = !{!109, !112, !116}
!807 = !{!802}
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !687, line: 6, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !689, line: 21, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 13, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !810, file: !689, line: 15, baseType: !110, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !810, file: !689, line: 20, baseType: !814, size: 32, offset: 32)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !810, file: !689, line: 16, size: 32, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !814, file: !689, line: 18, baseType: !7, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !814, file: !689, line: 19, baseType: !698, size: 32)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "crctab", scope: !820, file: !821, line: 4, type: !823, isLocal: false, isDefinition: true)
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !822, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "src/crctab.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5621cf9731349ea89e5672d56b01bc53")
!822 = !{!818}
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !824, size: 131072, elements: !510)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !827, globals: !829, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0871d6b54d956be5985a128a1aa50d97")
!827 = !{!828, !86}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!829 = !{!830}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "buffer_length", scope: !832, file: !826, line: 83, type: !894, isLocal: true, isDefinition: true)
!832 = distinct !DISubprogram(name: "blake2b_stream", scope: !826, file: !826, line: 78, type: !833, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !825, retainedNodes: !869)
!833 = !DISubroutineType(types: !834)
!834 = !{!110, !835, !109, !112}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !837, file: !170, line: 51, baseType: !110, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !837, file: !170, line: 54, baseType: !107, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !837, file: !170, line: 55, baseType: !107, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !837, file: !170, line: 56, baseType: !107, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !837, file: !170, line: 57, baseType: !107, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !837, file: !170, line: 58, baseType: !107, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !837, file: !170, line: 59, baseType: !107, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !837, file: !170, line: 60, baseType: !107, size: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !837, file: !170, line: 61, baseType: !107, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !837, file: !170, line: 64, baseType: !107, size: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !837, file: !170, line: 65, baseType: !107, size: 64, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !837, file: !170, line: 66, baseType: !107, size: 64, offset: 704)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !837, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !837, file: !170, line: 70, baseType: !853, size: 64, offset: 832)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !837, file: !170, line: 72, baseType: !110, size: 32, offset: 896)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !837, file: !170, line: 73, baseType: !110, size: 32, offset: 928)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !837, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !837, file: !170, line: 77, baseType: !111, size: 16, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !837, file: !170, line: 78, baseType: !195, size: 8, offset: 1040)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !837, file: !170, line: 79, baseType: !197, size: 8, offset: 1048)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !837, file: !170, line: 81, baseType: !201, size: 64, offset: 1088)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !837, file: !170, line: 89, baseType: !204, size: 64, offset: 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !837, file: !170, line: 91, baseType: !206, size: 64, offset: 1216)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !837, file: !170, line: 92, baseType: !209, size: 64, offset: 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !837, file: !170, line: 93, baseType: !853, size: 64, offset: 1344)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !837, file: !170, line: 94, baseType: !109, size: 64, offset: 1408)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !837, file: !170, line: 95, baseType: !112, size: 64, offset: 1472)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !837, file: !170, line: 96, baseType: !110, size: 32, offset: 1536)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !837, file: !170, line: 98, baseType: !216, size: 160, offset: 1568)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !891, !892, !893}
!870 = !DILocalVariable(name: "stream", arg: 1, scope: !832, file: !826, line: 78, type: !835)
!871 = !DILocalVariable(name: "resstream", arg: 2, scope: !832, file: !826, line: 78, type: !109)
!872 = !DILocalVariable(name: "outbytes", arg: 3, scope: !832, file: !826, line: 78, type: !112)
!873 = !DILocalVariable(name: "ret", scope: !832, file: !826, line: 80, type: !110)
!874 = !DILocalVariable(name: "sum", scope: !832, file: !826, line: 81, type: !112)
!875 = !DILocalVariable(name: "n", scope: !832, file: !826, line: 81, type: !112)
!876 = !DILocalVariable(name: "S", scope: !832, file: !826, line: 82, type: !877)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !878, size: 1984, elements: !198)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !344, line: 71, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !344, line: 62, size: 1984, elements: !880)
!880 = !{!881, !883, !885, !886, !888, !889, !890}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !879, file: !344, line: 64, baseType: !882, size: 512)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 512, elements: !381)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !879, file: !344, line: 65, baseType: !884, size: 128, offset: 512)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 128, elements: !658)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !879, file: !344, line: 66, baseType: !884, size: 128, offset: 640)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !879, file: !344, line: 67, baseType: !887, size: 1024, offset: 768)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 1024, elements: !583)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !879, file: !344, line: 68, baseType: !112, size: 64, offset: 1792)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !879, file: !344, line: 69, baseType: !112, size: 64, offset: 1856)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !879, file: !344, line: 70, baseType: !354, size: 8, offset: 1920)
!891 = !DILocalVariable(name: "buffer", scope: !832, file: !826, line: 84, type: !828)
!892 = !DILabel(scope: !832, name: "final_process", file: !826, line: 117)
!893 = !DILabel(scope: !832, name: "cleanup_buffer", file: !826, line: 123)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !897, retainedTypes: !978, splitDebugInlining: false, nameTableKind: None)
!896 = !DIFile(filename: "src/sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "984061a05cf8100a66387ffa345dea00")
!897 = !{!898, !956, !635}
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !899, file: !896, line: 40, baseType: !7, size: 32, elements: !954)
!899 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !896, file: !896, line: 34, type: !900, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !895, retainedNodes: !936)
!900 = !DISubroutineType(types: !901)
!901 = !{!110, !902, !109, !315}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !168, line: 7, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !170, line: 49, size: 1728, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !904, file: !170, line: 51, baseType: !110, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !904, file: !170, line: 54, baseType: !107, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !904, file: !170, line: 55, baseType: !107, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !904, file: !170, line: 56, baseType: !107, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !904, file: !170, line: 57, baseType: !107, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !904, file: !170, line: 58, baseType: !107, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !904, file: !170, line: 59, baseType: !107, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !904, file: !170, line: 60, baseType: !107, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !904, file: !170, line: 61, baseType: !107, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !904, file: !170, line: 64, baseType: !107, size: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !904, file: !170, line: 65, baseType: !107, size: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !904, file: !170, line: 66, baseType: !107, size: 64, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !904, file: !170, line: 68, baseType: !185, size: 64, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !904, file: !170, line: 70, baseType: !920, size: 64, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !904, file: !170, line: 72, baseType: !110, size: 32, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !904, file: !170, line: 73, baseType: !110, size: 32, offset: 928)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !904, file: !170, line: 74, baseType: !192, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !904, file: !170, line: 77, baseType: !111, size: 16, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !904, file: !170, line: 78, baseType: !195, size: 8, offset: 1040)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !904, file: !170, line: 79, baseType: !197, size: 8, offset: 1048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !904, file: !170, line: 81, baseType: !201, size: 64, offset: 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !904, file: !170, line: 89, baseType: !204, size: 64, offset: 1152)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !904, file: !170, line: 91, baseType: !206, size: 64, offset: 1216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !904, file: !170, line: 92, baseType: !209, size: 64, offset: 1280)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !904, file: !170, line: 93, baseType: !920, size: 64, offset: 1344)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !904, file: !170, line: 94, baseType: !109, size: 64, offset: 1408)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !904, file: !170, line: 95, baseType: !112, size: 64, offset: 1472)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !904, file: !170, line: 96, baseType: !110, size: 32, offset: 1536)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !904, file: !170, line: 98, baseType: !216, size: 160, offset: 1568)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !948, !950, !952, !953}
!937 = !DILocalVariable(name: "stream", arg: 1, scope: !899, file: !896, line: 34, type: !902)
!938 = !DILocalVariable(name: "resstream", arg: 2, scope: !899, file: !896, line: 34, type: !109)
!939 = !DILocalVariable(name: "length", arg: 3, scope: !899, file: !896, line: 34, type: !315)
!940 = !DILocalVariable(name: "ret", scope: !899, file: !896, line: 36, type: !110)
!941 = !DILocalVariable(name: "sum", scope: !899, file: !896, line: 37, type: !124)
!942 = !DILocalVariable(name: "checksum", scope: !899, file: !896, line: 38, type: !110)
!943 = !DILocalVariable(name: "total_bytes", scope: !899, file: !896, line: 39, type: !316)
!944 = !DILocalVariable(name: "buffer", scope: !899, file: !896, line: 41, type: !828)
!945 = !DILocalVariable(name: "n", scope: !946, file: !896, line: 54, type: !112)
!946 = distinct !DILexicalBlock(scope: !947, file: !896, line: 53, column: 5)
!947 = distinct !DILexicalBlock(scope: !899, file: !896, line: 48, column: 3)
!948 = !DILocalVariable(name: "i", scope: !949, file: !896, line: 71, type: !112)
!949 = distinct !DILexicalBlock(scope: !947, file: !896, line: 71, column: 5)
!950 = !DILocalVariable(name: "i", scope: !951, file: !896, line: 86, type: !124)
!951 = distinct !DILexicalBlock(scope: !899, file: !896, line: 86, column: 3)
!952 = !DILabel(scope: !899, name: "final_process", file: !896, line: 84)
!953 = !DILabel(scope: !899, name: "cleanup_buffer", file: !896, line: 101)
!954 = !{!955}
!955 = !DIEnumerator(name: "buffer_length", value: 32768)
!956 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !957, file: !896, line: 115, baseType: !7, size: 32, elements: !954)
!957 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !896, file: !896, line: 110, type: !900, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !895, retainedNodes: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !970, !972, !974, !975, !976, !977}
!959 = !DILocalVariable(name: "stream", arg: 1, scope: !957, file: !896, line: 110, type: !902)
!960 = !DILocalVariable(name: "resstream", arg: 2, scope: !957, file: !896, line: 110, type: !109)
!961 = !DILocalVariable(name: "length", arg: 3, scope: !957, file: !896, line: 110, type: !315)
!962 = !DILocalVariable(name: "ret", scope: !957, file: !896, line: 112, type: !110)
!963 = !DILocalVariable(name: "sum", scope: !957, file: !896, line: 113, type: !124)
!964 = !DILocalVariable(name: "total_bytes", scope: !957, file: !896, line: 114, type: !316)
!965 = !DILocalVariable(name: "buffer", scope: !957, file: !896, line: 116, type: !828)
!966 = !DILocalVariable(name: "s", scope: !957, file: !896, line: 122, type: !7)
!967 = !DILocalVariable(name: "n", scope: !968, file: !896, line: 132, type: !112)
!968 = distinct !DILexicalBlock(scope: !969, file: !896, line: 131, column: 5)
!969 = distinct !DILexicalBlock(scope: !957, file: !896, line: 126, column: 3)
!970 = !DILocalVariable(name: "i", scope: !971, file: !896, line: 149, type: !112)
!971 = distinct !DILexicalBlock(scope: !969, file: !896, line: 149, column: 5)
!972 = !DILocalVariable(name: "i", scope: !973, file: !896, line: 161, type: !112)
!973 = distinct !DILexicalBlock(scope: !957, file: !896, line: 161, column: 3)
!974 = !DILocalVariable(name: "r", scope: !957, file: !896, line: 170, type: !110)
!975 = !DILocalVariable(name: "checksum", scope: !957, file: !896, line: 171, type: !110)
!976 = !DILabel(scope: !957, name: "final_process", file: !896, line: 159)
!977 = !DILabel(scope: !957, name: "cleanup_buffer", file: !896, line: 176)
!978 = !{!121, !235, !114, !112, !979, !116}
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !90, line: 40, baseType: !111)
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/md5-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8416fa6e67524990f2e793bffca7b2da")
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!983 = !DIFile(filename: "lib/sha1-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b59d1245a1dffd6d873634efd3e585e")
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !986, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "lib/sha256-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "29c8665bc112b40c2afe6a5ccbcf2c4a")
!986 = !{!34, !30}
!987 = distinct !DICompileUnit(language: DW_LANG_C99, file: !988, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !989, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!988 = !DIFile(filename: "lib/sha3-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1d2f2aee489c826266c291ab87a724e4")
!989 = !{!538, !545, !551, !557}
!990 = !{!109}
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !993, splitDebugInlining: false, nameTableKind: None)
!992 = !DIFile(filename: "lib/sha512-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a5787845dcc8c0bb8d2e48bd7b0a792")
!993 = !{!41, !37}
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "lib/sm3-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9db2826a252078c69300bac192997adf")
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !998, splitDebugInlining: false, nameTableKind: None)
!997 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!998 = !{!95}
!999 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1000, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1001 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1002, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!1002 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1004, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1004 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1005 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1006, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1006 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1015, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1015 = !{!1016}
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1014, line: 40, baseType: !7, size: 32, elements: !1017)
!1017 = !{!1018}
!1018 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1020, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1021, retainedTypes: !1049, splitDebugInlining: false, nameTableKind: None)
!1020 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1021 = !{!1022, !1034}
!1022 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1023, file: !1020, line: 188, baseType: !7, size: 32, elements: !1032)
!1023 = distinct !DISubprogram(name: "x2nrealloc", scope: !1020, file: !1020, line: 176, type: !1024, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1019, retainedNodes: !1027)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!109, !109, !1026, !112}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DILocalVariable(name: "p", arg: 1, scope: !1023, file: !1020, line: 176, type: !109)
!1029 = !DILocalVariable(name: "pn", arg: 2, scope: !1023, file: !1020, line: 176, type: !1026)
!1030 = !DILocalVariable(name: "s", arg: 3, scope: !1023, file: !1020, line: 176, type: !112)
!1031 = !DILocalVariable(name: "n", scope: !1023, file: !1020, line: 178, type: !112)
!1032 = !{!1033}
!1033 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1034 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1035, file: !1020, line: 228, baseType: !7, size: 32, elements: !1032)
!1035 = distinct !DISubprogram(name: "xpalloc", scope: !1020, file: !1020, line: 223, type: !1036, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1019, retainedNodes: !1039)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!109, !109, !1038, !124, !126, !124}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1040 = !DILocalVariable(name: "pa", arg: 1, scope: !1035, file: !1020, line: 223, type: !109)
!1041 = !DILocalVariable(name: "pn", arg: 2, scope: !1035, file: !1020, line: 223, type: !1038)
!1042 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1035, file: !1020, line: 223, type: !124)
!1043 = !DILocalVariable(name: "n_max", arg: 4, scope: !1035, file: !1020, line: 223, type: !126)
!1044 = !DILocalVariable(name: "s", arg: 5, scope: !1035, file: !1020, line: 223, type: !124)
!1045 = !DILocalVariable(name: "n0", scope: !1035, file: !1020, line: 230, type: !124)
!1046 = !DILocalVariable(name: "n", scope: !1035, file: !1020, line: 237, type: !124)
!1047 = !DILocalVariable(name: "nbytes", scope: !1035, file: !1020, line: 248, type: !124)
!1048 = !DILocalVariable(name: "adjusted_nbytes", scope: !1035, file: !1020, line: 252, type: !124)
!1049 = !{!107, !109, !121, !127, !86}
!1050 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1051, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1052 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1053, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1054, splitDebugInlining: false, nameTableKind: None)
!1053 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!1054 = !{!73, !23}
!1055 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1056, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1057, retainedTypes: !1058, splitDebugInlining: false, nameTableKind: None)
!1056 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1057 = !{!73}
!1058 = !{!121, !127, !86, !316}
!1059 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1060, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1061 = !{!73, !44}
!1062 = !{!110, !111, !107, !121, !86, !87}
!1063 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1064, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !990, splitDebugInlining: false, nameTableKind: None)
!1064 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1065 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1066, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1066 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1067 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1068, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, splitDebugInlining: false, nameTableKind: None)
!1068 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1069 = !{!121, !86, !109}
!1070 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1071, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1071 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
