; ModuleID = 'src/cp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.selabel_handle*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.selabel_handle = type opaque
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.copy_debug = type { i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_opts", scope: !2, file: !3, line: 115, type: !400, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !156, globals: !165, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/cp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "314d95df6ad9040aa2f44bc3ec20334a")
!4 = !{!5, !13, !20, !26, !32, !38, !43, !58, !142}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 38, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0)
!10 = !DIEnumerator(name: "simple_backups", value: 1)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!12 = !DIEnumerator(name: "numbered_backups", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 86, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4854856c8f3aacad20824070737d83b1")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 77, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_UNSPECIFIED", value: 0)
!23 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!24 = !DIEnumerator(name: "I_ALWAYS_SKIP", value: 2)
!25 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 27, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Update_type", file: !14, line: 61, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "UPDATE_ALL", value: 0)
!35 = !DIEnumerator(name: "UPDATE_OLDER", value: 1)
!36 = !DIEnumerator(name: "UPDATE_NONE", value: 2)
!37 = !DIEnumerator(name: "UPDATE_NONE_FAIL", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 48, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!41 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!42 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !44, line: 46, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!46 = !DIEnumerator(name: "_ISupper", value: 256)
!47 = !DIEnumerator(name: "_ISlower", value: 512)
!48 = !DIEnumerator(name: "_ISalpha", value: 1024)
!49 = !DIEnumerator(name: "_ISdigit", value: 2048)
!50 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!51 = !DIEnumerator(name: "_ISspace", value: 8192)
!52 = !DIEnumerator(name: "_ISprint", value: 16384)
!53 = !DIEnumerator(name: "_ISgraph", value: 32768)
!54 = !DIEnumerator(name: "_ISblank", value: 1)
!55 = !DIEnumerator(name: "_IScntrl", value: 2)
!56 = !DIEnumerator(name: "_ISpunct", value: 4)
!57 = !DIEnumerator(name: "_ISalnum", value: 8)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !59, file: !3, line: 939, baseType: !7, size: 32, elements: !134)
!59 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !3, file: !3, line: 937, type: !60, scopeLine: 938, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !124)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !65, !78}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 115, size: 768, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !117, !118, !123}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !66, file: !14, line: 117, baseType: !5, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !66, file: !14, line: 120, baseType: !13, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !66, file: !14, line: 125, baseType: !20, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !66, file: !14, line: 128, baseType: !26, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !66, file: !14, line: 132, baseType: !73, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !74, line: 69, baseType: !75)
!74 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !76, line: 150, baseType: !7)
!76 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !66, file: !14, line: 136, baseType: !78, size: 8, offset: 160)
!78 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !66, file: !14, line: 140, baseType: !78, size: 8, offset: 168)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !66, file: !14, line: 147, baseType: !78, size: 8, offset: 176)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !66, file: !14, line: 151, baseType: !78, size: 8, offset: 184)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !66, file: !14, line: 155, baseType: !78, size: 8, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "no_copy", scope: !66, file: !14, line: 155, baseType: !78, size: 8, offset: 200)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "exchange", scope: !66, file: !14, line: 159, baseType: !78, size: 8, offset: 208)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !66, file: !14, line: 162, baseType: !78, size: 8, offset: 216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !66, file: !14, line: 166, baseType: !78, size: 8, offset: 224)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !66, file: !14, line: 173, baseType: !78, size: 8, offset: 232)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !66, file: !14, line: 177, baseType: !78, size: 8, offset: 240)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !66, file: !14, line: 181, baseType: !78, size: 8, offset: 248)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !66, file: !14, line: 182, baseType: !78, size: 8, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !66, file: !14, line: 183, baseType: !78, size: 8, offset: 264)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !66, file: !14, line: 184, baseType: !78, size: 8, offset: 272)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !66, file: !14, line: 187, baseType: !94, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !96, line: 53, flags: DIFlagFwdDecl)
!96 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !66, file: !14, line: 199, baseType: !78, size: 8, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !66, file: !14, line: 203, baseType: !78, size: 8, offset: 392)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !66, file: !14, line: 209, baseType: !78, size: 8, offset: 400)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !66, file: !14, line: 213, baseType: !78, size: 8, offset: 408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !66, file: !14, line: 222, baseType: !78, size: 8, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !66, file: !14, line: 226, baseType: !78, size: 8, offset: 424)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !66, file: !14, line: 235, baseType: !78, size: 8, offset: 432)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !66, file: !14, line: 244, baseType: !78, size: 8, offset: 440)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !66, file: !14, line: 248, baseType: !78, size: 8, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !66, file: !14, line: 252, baseType: !78, size: 8, offset: 456)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !66, file: !14, line: 256, baseType: !78, size: 8, offset: 464)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !66, file: !14, line: 259, baseType: !32, size: 32, offset: 480)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !66, file: !14, line: 262, baseType: !78, size: 8, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "keep_directory_symlink", scope: !66, file: !14, line: 265, baseType: !78, size: 8, offset: 520)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !66, file: !14, line: 268, baseType: !78, size: 8, offset: 528)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !66, file: !14, line: 271, baseType: !78, size: 8, offset: 536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !66, file: !14, line: 276, baseType: !78, size: 8, offset: 544)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !66, file: !14, line: 280, baseType: !78, size: 8, offset: 552)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !66, file: !14, line: 285, baseType: !116, size: 32, offset: 576)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !66, file: !14, line: 288, baseType: !38, size: 32, offset: 608)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !66, file: !14, line: 299, baseType: !119, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !121, line: 56, baseType: !122)
!121 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !121, line: 54, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !66, file: !14, line: 302, baseType: !119, size: 64, offset: 704)
!124 = !{!125, !126, !127, !128, !130, !131, !133}
!125 = !DILocalVariable(name: "arg", arg: 1, scope: !59, file: !3, line: 937, type: !62)
!126 = !DILocalVariable(name: "x", arg: 2, scope: !59, file: !3, line: 937, type: !65)
!127 = !DILocalVariable(name: "on_off", arg: 3, scope: !59, file: !3, line: 937, type: !78)
!128 = !DILocalVariable(name: "arg_writable", scope: !59, file: !3, line: 963, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!130 = !DILocalVariable(name: "s", scope: !59, file: !3, line: 964, type: !129)
!131 = !DILocalVariable(name: "comma", scope: !132, file: !3, line: 968, type: !129)
!132 = distinct !DILexicalBlock(scope: !59, file: !3, line: 966, column: 5)
!133 = !DILocalVariable(name: "val", scope: !132, file: !3, line: 969, type: !58)
!134 = !{!135, !136, !137, !138, !139, !140, !141}
!135 = !DIEnumerator(name: "PRESERVE_MODE", value: 0)
!136 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1)
!137 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2)
!138 = !DIEnumerator(name: "PRESERVE_LINK", value: 3)
!139 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4)
!140 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5)
!141 = !DIEnumerator(name: "PRESERVE_ALL", value: 6)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !143, line: 42, baseType: !7, size: 32, elements: !144)
!143 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!145 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!146 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!147 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!148 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!149 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!150 = !DIEnumerator(name: "c_quoting_style", value: 5)
!151 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!152 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!153 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!154 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!155 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!156 = !{!157, !159, !129, !116, !160, !161, !62, !164, !94}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!160 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !162, line: 46, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!163 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!164 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!165 = !{!166, !168, !170, !0, !255, !261, !267, !271, !273, !279, !284, !286, !290, !295}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 76, type: !78, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !2, file: !3, line: 83, type: !78, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !172, file: !173, line: 575, type: !116, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "oputs_", scope: !173, file: !173, line: 573, type: !174, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!173 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!174 = !DISubroutineType(types: !175)
!175 = !{null, !62, !62}
!176 = !{!177, !178, !179, !182, !183, !184, !185, !189, !190, !191, !192, !194, !249, !250, !251, !253, !254}
!177 = !DILocalVariable(name: "program", arg: 1, scope: !172, file: !173, line: 573, type: !62)
!178 = !DILocalVariable(name: "option", arg: 2, scope: !172, file: !173, line: 573, type: !62)
!179 = !DILocalVariable(name: "term", scope: !180, file: !173, line: 585, type: !62)
!180 = distinct !DILexicalBlock(scope: !181, file: !173, line: 582, column: 5)
!181 = distinct !DILexicalBlock(scope: !172, file: !173, line: 581, column: 7)
!182 = !DILocalVariable(name: "double_space", scope: !172, file: !173, line: 594, type: !78)
!183 = !DILocalVariable(name: "first_word", scope: !172, file: !173, line: 595, type: !62)
!184 = !DILocalVariable(name: "option_text", scope: !172, file: !173, line: 596, type: !62)
!185 = !DILocalVariable(name: "s", scope: !186, file: !173, line: 608, type: !62)
!186 = distinct !DILexicalBlock(scope: !187, file: !173, line: 605, column: 5)
!187 = distinct !DILexicalBlock(scope: !188, file: !173, line: 604, column: 12)
!188 = distinct !DILexicalBlock(scope: !172, file: !173, line: 597, column: 7)
!189 = !DILocalVariable(name: "spaces", scope: !186, file: !173, line: 609, type: !161)
!190 = !DILocalVariable(name: "anchor_len", scope: !172, file: !173, line: 620, type: !161)
!191 = !DILocalVariable(name: "desc_text", scope: !172, file: !173, line: 625, type: !62)
!192 = !DILocalVariable(name: "__ptr", scope: !193, file: !173, line: 644, type: !62)
!193 = distinct !DILexicalBlock(scope: !172, file: !173, line: 644, column: 3)
!194 = !DILocalVariable(name: "__stream", scope: !193, file: !173, line: 644, type: !195)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !197, line: 7, baseType: !198)
!197 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !199, line: 49, size: 1728, elements: !200)
!199 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!200 = !{!201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !216, !218, !219, !220, !223, !224, !226, !230, !233, !235, !238, !241, !242, !243, !244, !245}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !198, file: !199, line: 51, baseType: !116, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !198, file: !199, line: 54, baseType: !129, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !198, file: !199, line: 55, baseType: !129, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !198, file: !199, line: 56, baseType: !129, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !198, file: !199, line: 57, baseType: !129, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !198, file: !199, line: 58, baseType: !129, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !198, file: !199, line: 59, baseType: !129, size: 64, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !198, file: !199, line: 60, baseType: !129, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !198, file: !199, line: 61, baseType: !129, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !198, file: !199, line: 64, baseType: !129, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !198, file: !199, line: 65, baseType: !129, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !198, file: !199, line: 66, baseType: !129, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !198, file: !199, line: 68, baseType: !214, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !199, line: 36, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !198, file: !199, line: 70, baseType: !217, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !198, file: !199, line: 72, baseType: !116, size: 32, offset: 896)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !198, file: !199, line: 73, baseType: !116, size: 32, offset: 928)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !198, file: !199, line: 74, baseType: !221, size: 64, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !76, line: 152, baseType: !222)
!222 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !198, file: !199, line: 77, baseType: !160, size: 16, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !198, file: !199, line: 78, baseType: !225, size: 8, offset: 1040)
!225 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !198, file: !199, line: 79, baseType: !227, size: 8, offset: 1048)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 1)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !198, file: !199, line: 81, baseType: !231, size: 64, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !199, line: 43, baseType: null)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !198, file: !199, line: 89, baseType: !234, size: 64, offset: 1152)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !76, line: 153, baseType: !222)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !198, file: !199, line: 91, baseType: !236, size: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !199, line: 37, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !198, file: !199, line: 92, baseType: !239, size: 64, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !199, line: 38, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !198, file: !199, line: 93, baseType: !217, size: 64, offset: 1344)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !198, file: !199, line: 94, baseType: !159, size: 64, offset: 1408)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !198, file: !199, line: 95, baseType: !161, size: 64, offset: 1472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !198, file: !199, line: 96, baseType: !116, size: 32, offset: 1536)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !198, file: !199, line: 98, baseType: !246, size: 160, offset: 1568)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 20)
!249 = !DILocalVariable(name: "__cnt", scope: !193, file: !173, line: 644, type: !161)
!250 = !DILocalVariable(name: "url_program", scope: !172, file: !173, line: 648, type: !62)
!251 = !DILocalVariable(name: "__ptr", scope: !252, file: !173, line: 686, type: !62)
!252 = distinct !DILexicalBlock(scope: !172, file: !173, line: 686, column: 3)
!253 = !DILocalVariable(name: "__stream", scope: !252, file: !173, line: 686, type: !195)
!254 = !DILocalVariable(name: "__cnt", scope: !252, file: !173, line: 686, type: !161)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "sparse_type", scope: !2, file: !3, line: 89, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 96, elements: !259)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!259 = !{!260}
!260 = !DISubrange(count: 3)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !2, file: !3, line: 85, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 256, elements: !265)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!265 = !{!266}
!266 = !DISubrange(count: 4)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "reflink_type", scope: !2, file: !3, line: 99, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 96, elements: !259)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !2, file: !3, line: 95, type: !263, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !59, file: !3, line: 949, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 224, elements: !277)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!277 = !{!278}
!278 = !DISubrange(count: 7)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "preserve_args", scope: !59, file: !3, line: 956, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 512, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 8)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "parents_option", scope: !2, file: !3, line: 80, type: !78, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "update_type", scope: !2, file: !3, line: 109, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 128, elements: !265)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "update_type_string", scope: !2, file: !3, line: 105, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 320, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 5)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "x_tmp", scope: !297, file: !3, line: 862, type: !66, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "do_copy", scope: !3, file: !3, line: 670, type: !298, scopeLine: 672, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !301)
!298 = !DISubroutineType(types: !299)
!299 = !{!78, !116, !300, !62, !78, !65}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!301 = !{!302, !303, !304, !305, !306, !307, !344, !345, !346, !347, !351, !352, !355, !359, !362, !363, !371, !372, !373, !376, !379, !380, !381, !383, !386, !387, !388, !391, !392, !396, !398, !399}
!302 = !DILocalVariable(name: "n_files", arg: 1, scope: !297, file: !3, line: 670, type: !116)
!303 = !DILocalVariable(name: "file", arg: 2, scope: !297, file: !3, line: 670, type: !300)
!304 = !DILocalVariable(name: "target_directory", arg: 3, scope: !297, file: !3, line: 670, type: !62)
!305 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !297, file: !3, line: 671, type: !78)
!306 = !DILocalVariable(name: "x", arg: 5, scope: !297, file: !3, line: 671, type: !65)
!307 = !DILocalVariable(name: "sb", scope: !297, file: !3, line: 683, type: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !309, line: 44, size: 1024, elements: !310)
!309 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!310 = !{!311, !313, !315, !316, !318, !320, !322, !323, !324, !325, !327, !328, !330, !338, !339, !340}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !308, file: !309, line: 46, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !76, line: 145, baseType: !163)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !308, file: !309, line: 47, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !76, line: 148, baseType: !163)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !308, file: !309, line: 48, baseType: !75, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !308, file: !309, line: 49, baseType: !317, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !76, line: 151, baseType: !7)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !308, file: !309, line: 50, baseType: !319, size: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !76, line: 146, baseType: !7)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !308, file: !309, line: 51, baseType: !321, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !76, line: 147, baseType: !7)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !308, file: !309, line: 52, baseType: !312, size: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !308, file: !309, line: 53, baseType: !312, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !308, file: !309, line: 54, baseType: !221, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !308, file: !309, line: 55, baseType: !326, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !76, line: 175, baseType: !116)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !308, file: !309, line: 56, baseType: !116, size: 32, offset: 480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !308, file: !309, line: 57, baseType: !329, size: 64, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !76, line: 180, baseType: !222)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !308, file: !309, line: 65, baseType: !331, size: 128, offset: 576)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !332, line: 11, size: 128, elements: !333)
!332 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !331, file: !332, line: 16, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !76, line: 160, baseType: !222)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !331, file: !332, line: 21, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !76, line: 197, baseType: !222)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !308, file: !309, line: 66, baseType: !331, size: 128, offset: 704)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !308, file: !309, line: 67, baseType: !331, size: 128, offset: 832)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !308, file: !309, line: 79, baseType: !341, size: 64, offset: 960)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 2)
!344 = !DILocalVariable(name: "target_dirfd", scope: !297, file: !3, line: 685, type: !116)
!345 = !DILocalVariable(name: "new_dst", scope: !297, file: !3, line: 686, type: !78)
!346 = !DILocalVariable(name: "ok", scope: !297, file: !3, line: 687, type: !78)
!347 = !DILocalVariable(name: "lastfile", scope: !348, file: !3, line: 709, type: !62)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 708, column: 5)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 700, column: 12)
!350 = distinct !DILexicalBlock(scope: !297, file: !3, line: 688, column: 7)
!351 = !DILocalVariable(name: "fd", scope: !348, file: !3, line: 710, type: !116)
!352 = !DILocalVariable(name: "err", scope: !353, file: !3, line: 719, type: !116)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 718, column: 9)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 711, column: 11)
!355 = !DILocalVariable(name: "i", scope: !356, file: !3, line: 755, type: !116)
!356 = distinct !DILexicalBlock(scope: !357, file: !3, line: 755, column: 7)
!357 = distinct !DILexicalBlock(scope: !358, file: !3, line: 741, column: 5)
!358 = distinct !DILexicalBlock(scope: !297, file: !3, line: 740, column: 7)
!359 = !DILocalVariable(name: "dst_name", scope: !360, file: !3, line: 757, type: !129)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 756, column: 9)
!361 = distinct !DILexicalBlock(scope: !356, file: !3, line: 755, column: 7)
!362 = !DILocalVariable(name: "parent_exists", scope: !360, file: !3, line: 758, type: !78)
!363 = !DILocalVariable(name: "attr_list", scope: !360, file: !3, line: 759, type: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !3, line: 50, size: 1216, elements: !366)
!366 = !{!367, !368, !369, !370}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !365, file: !3, line: 52, baseType: !308, size: 1024)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !365, file: !3, line: 53, baseType: !78, size: 8, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !365, file: !3, line: 54, baseType: !161, size: 64, offset: 1088)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !3, line: 55, baseType: !364, size: 64, offset: 1152)
!371 = !DILocalVariable(name: "arg_in_concat", scope: !360, file: !3, line: 760, type: !129)
!372 = !DILocalVariable(name: "arg", scope: !360, file: !3, line: 761, type: !129)
!373 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !374, file: !3, line: 770, type: !129)
!374 = distinct !DILexicalBlock(scope: !375, file: !3, line: 769, column: 13)
!375 = distinct !DILexicalBlock(scope: !360, file: !3, line: 768, column: 15)
!376 = !DILocalVariable(name: "__old", scope: !377, file: !3, line: 776, type: !62)
!377 = distinct !DILexicalBlock(scope: !378, file: !3, line: 776, column: 15)
!378 = distinct !DILexicalBlock(scope: !374, file: !3, line: 776, column: 15)
!379 = !DILocalVariable(name: "__len", scope: !377, file: !3, line: 776, type: !161)
!380 = !DILocalVariable(name: "__new", scope: !377, file: !3, line: 776, type: !129)
!381 = !DILocalVariable(name: "arg_base", scope: !382, file: !3, line: 795, type: !129)
!382 = distinct !DILexicalBlock(scope: !375, file: !3, line: 794, column: 13)
!383 = !DILocalVariable(name: "__old", scope: !384, file: !3, line: 797, type: !62)
!384 = distinct !DILexicalBlock(scope: !385, file: !3, line: 797, column: 15)
!385 = distinct !DILexicalBlock(scope: !382, file: !3, line: 797, column: 15)
!386 = !DILocalVariable(name: "__len", scope: !384, file: !3, line: 797, type: !161)
!387 = !DILocalVariable(name: "__new", scope: !384, file: !3, line: 797, type: !129)
!388 = !DILocalVariable(name: "dst_relname", scope: !389, file: !3, line: 813, type: !62)
!389 = distinct !DILexicalBlock(scope: !390, file: !3, line: 812, column: 13)
!390 = distinct !DILexicalBlock(scope: !360, file: !3, line: 805, column: 15)
!391 = !DILocalVariable(name: "copy_into_self", scope: !389, file: !3, line: 817, type: !78)
!392 = !DILocalVariable(name: "p", scope: !393, file: !3, line: 830, type: !364)
!393 = distinct !DILexicalBlock(scope: !394, file: !3, line: 829, column: 17)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 827, column: 13)
!395 = distinct !DILexicalBlock(scope: !360, file: !3, line: 826, column: 15)
!396 = !DILocalVariable(name: "source", scope: !397, file: !3, line: 854, type: !62)
!397 = distinct !DILexicalBlock(scope: !358, file: !3, line: 840, column: 5)
!398 = !DILocalVariable(name: "dest", scope: !397, file: !3, line: 855, type: !62)
!399 = !DILocalVariable(name: "unused", scope: !397, file: !3, line: 875, type: !78)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 8192, elements: !410)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !403, line: 50, size: 256, elements: !404)
!403 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!404 = !{!405, !406, !407, !409}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !402, file: !403, line: 52, baseType: !62, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !402, file: !403, line: 55, baseType: !116, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !402, file: !403, line: 56, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !402, file: !403, line: 57, baseType: !116, size: 32, offset: 192)
!410 = !{!411}
!411 = !DISubrange(count: 32)
!412 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!413 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !416, file: !417, line: 128, type: !62, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !439, globals: !440, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!418 = !{!5, !13, !20, !26, !32, !38, !142, !419, !423, !430}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 32, baseType: !7, size: 32, elements: !421)
!420 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!421 = !{!422}
!422 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !424, line: 37, baseType: !7, size: 32, elements: !425)
!424 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!425 = !{!426, !427, !428, !429}
!426 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!427 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!428 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!429 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !14, line: 305, baseType: !7, size: 32, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438}
!432 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!433 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!434 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!435 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!436 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!437 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!438 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!439 = !{!7, !159, !163, !164}
!440 = !{!441, !447, !414, !449, !451}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "mask", scope: !443, file: !417, line: 2890, type: !73, isLocal: true, isDefinition: true)
!443 = distinct !DISubprogram(name: "cached_umask", scope: !417, file: !417, line: 2888, type: !444, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !446)
!444 = !DISubroutineType(types: !445)
!445 = !{!73}
!446 = !{}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "cached", scope: !443, file: !417, line: 2891, type: !78, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !416, file: !417, line: 129, type: !62, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "copy_debug", scope: !416, file: !417, line: 132, type: !453, isLocal: true, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !14, line: 317, size: 96, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !453, file: !14, line: 319, baseType: !430, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !453, file: !14, line: 320, baseType: !430, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !453, file: !14, line: 321, baseType: !430, size: 32, offset: 64)
!458 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !461, file: !462, line: 45, type: !119, isLocal: true, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !463, globals: !467, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!463 = !{!159, !129, !464}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !465, line: 102, baseType: !466)
!465 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !76, line: 73, baseType: !163)
!467 = !{!459}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !470, file: !471, line: 38, type: !480, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, globals: !479, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!472 = !{!473, !476}
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !471, line: 39, baseType: !7, size: 32, elements: !474)
!474 = !{!475}
!475 = !DIEnumerator(name: "x_suffix_len", value: 6)
!476 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !471, line: 44, baseType: !7, size: 32, elements: !477)
!477 = !{!478}
!478 = !DIEnumerator(name: "smallsize", value: 256)
!479 = !{!468}
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 72, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 9)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "Version", scope: !485, file: !486, line: 3, type: !62, isLocal: false, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !487, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!487 = !{!483}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !490, file: !491, line: 77, type: !62, isLocal: false, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, retainedTypes: !555, globals: !556, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!492 = !{!5, !493, !525, !531}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !494, file: !491, line: 325, baseType: !7, size: 32, elements: !523)
!494 = distinct !DISubprogram(name: "backupfile_internal", scope: !491, file: !491, line: 312, type: !495, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !490, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{!129, !116, !62, !5, !78}
!497 = !{!498, !499, !500, !501, !502, !506, !507, !508, !509, !510, !511, !516, !517, !518, !520, !521, !522}
!498 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !494, file: !491, line: 312, type: !116)
!499 = !DILocalVariable(name: "file", arg: 2, scope: !494, file: !491, line: 312, type: !62)
!500 = !DILocalVariable(name: "backup_type", arg: 3, scope: !494, file: !491, line: 313, type: !5)
!501 = !DILocalVariable(name: "rename", arg: 4, scope: !494, file: !491, line: 313, type: !78)
!502 = !DILocalVariable(name: "base_offset", scope: !494, file: !491, line: 315, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !504, line: 130, baseType: !505)
!504 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !162, line: 35, baseType: !222)
!506 = !DILocalVariable(name: "filelen", scope: !494, file: !491, line: 316, type: !503)
!507 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !494, file: !491, line: 323, type: !503)
!508 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !494, file: !491, line: 324, type: !503)
!509 = !DILocalVariable(name: "ssize", scope: !494, file: !491, line: 329, type: !503)
!510 = !DILocalVariable(name: "s", scope: !494, file: !491, line: 330, type: !129)
!511 = !DILocalVariable(name: "dirp", scope: !494, file: !491, line: 334, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !514, line: 127, baseType: !515)
!514 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !514, line: 127, flags: DIFlagFwdDecl)
!516 = !DILocalVariable(name: "sdir", scope: !494, file: !491, line: 335, type: !116)
!517 = !DILocalVariable(name: "base_max", scope: !494, file: !491, line: 336, type: !503)
!518 = !DILocalVariable(name: "extended", scope: !519, file: !491, line: 339, type: !78)
!519 = distinct !DILexicalBlock(scope: !494, file: !491, line: 338, column: 5)
!520 = !DILocalVariable(name: "offset", scope: !519, file: !491, line: 375, type: !503)
!521 = !DILocalVariable(name: "flags", scope: !519, file: !491, line: 376, type: !7)
!522 = !DILocalVariable(name: "saved_errno", scope: !519, file: !491, line: 379, type: !116)
!523 = !{!524}
!524 = !DIEnumerator(name: "GUESS", value: 9)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !491, line: 171, baseType: !7, size: 32, elements: !526)
!526 = !{!527, !528, !529, !530}
!527 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!528 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!529 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!530 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !532, line: 24, baseType: !7, size: 32, elements: !533)
!532 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!534 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!535 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!536 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!537 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!538 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!539 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!540 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!541 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!542 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!543 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!544 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!545 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!546 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!547 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!548 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!549 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!550 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!551 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!552 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!553 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!554 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!555 = !{!159, !7, !78}
!556 = !{!488}
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "backup_types", scope: !559, file: !560, line: 53, type: !567, isLocal: true, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !561, retainedTypes: !562, globals: !563, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!561 = !{!5}
!562 = !{!159, !157}
!563 = !{!557, !564}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "backup_args", scope: !559, file: !560, line: 42, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 576, elements: !481)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 256, elements: !282)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !571, file: !572, line: 65, type: !576, isLocal: false, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !573, retainedTypes: !574, globals: !575, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!573 = !{!142}
!574 = !{!159, !62, !164}
!575 = !{!569}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !577, line: 69, baseType: !578)
!577 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "file_name", scope: !583, file: !584, line: 36, type: !62, isLocal: true, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !585, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!585 = !{!581}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "file_name", scope: !588, file: !589, line: 45, type: !62, isLocal: true, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !590, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!590 = !{!586, !591}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !588, file: !589, line: 55, type: !78, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !595, file: !596, line: 66, type: !578, isLocal: false, isDefinition: true)
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !597, globals: !598, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!597 = !{!159, !164}
!598 = !{!599, !625, !593, !627, !629}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "old_file_name", scope: !601, file: !596, line: 304, type: !62, isLocal: true, isDefinition: true)
!601 = distinct !DISubprogram(name: "verror_at_line", scope: !596, file: !596, line: 298, type: !602, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !595, retainedNodes: !618)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !116, !116, !62, !7, !62, !604}
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !605, line: 52, baseType: !606)
!605 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !607, line: 32, baseType: !608)
!607 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !609, baseType: !610)
!609 = !DIFile(filename: "lib/error.c", directory: "/src")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !611, size: 256, elements: !612)
!611 = !DINamespace(name: "std", scope: null)
!612 = !{!613, !614, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !610, file: !609, baseType: !159, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !610, file: !609, baseType: !159, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !610, file: !609, baseType: !159, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !610, file: !609, baseType: !116, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !610, file: !609, baseType: !116, size: 32, offset: 224)
!618 = !{!619, !620, !621, !622, !623, !624}
!619 = !DILocalVariable(name: "status", arg: 1, scope: !601, file: !596, line: 298, type: !116)
!620 = !DILocalVariable(name: "errnum", arg: 2, scope: !601, file: !596, line: 298, type: !116)
!621 = !DILocalVariable(name: "file_name", arg: 3, scope: !601, file: !596, line: 298, type: !62)
!622 = !DILocalVariable(name: "line_number", arg: 4, scope: !601, file: !596, line: 298, type: !7)
!623 = !DILocalVariable(name: "message", arg: 5, scope: !601, file: !596, line: 298, type: !62)
!624 = !DILocalVariable(name: "args", arg: 6, scope: !601, file: !596, line: 298, type: !604)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "old_line_number", scope: !601, file: !596, line: 305, type: !7, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "error_message_count", scope: !595, file: !596, line: 69, type: !7, isLocal: false, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !595, file: !596, line: 295, type: !116, isLocal: false, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "default_tuning", scope: !633, file: !634, line: 134, type: !638, isLocal: true, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, globals: !637, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!635 = !{!163, !159, !636, !161}
!636 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!637 = !{!631}
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !121, line: 52, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !121, line: 40, size: 160, elements: !641)
!641 = !{!642, !643, !644, !645, !646}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !640, file: !121, line: 45, baseType: !636, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !640, file: !121, line: 46, baseType: !636, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !640, file: !121, line: 47, baseType: !636, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !640, file: !121, line: 48, baseType: !636, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !640, file: !121, line: 49, baseType: !78, size: 8, offset: 128)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "program_name", scope: !649, file: !650, line: 31, type: !62, isLocal: false, isDefinition: true)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !651, globals: !652, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!651 = !{!129}
!652 = !{!647}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "utf07FF", scope: !655, file: !656, line: 46, type: !684, isLocal: true, isDefinition: true)
!655 = distinct !DISubprogram(name: "proper_name_lite", scope: !656, file: !656, line: 38, type: !657, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !659, retainedNodes: !661)
!656 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!657 = !DISubroutineType(types: !658)
!658 = !{!62, !62, !62}
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !660, splitDebugInlining: false, nameTableKind: None)
!660 = !{!653}
!661 = !{!662, !663, !664, !665, !670}
!662 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !655, file: !656, line: 38, type: !62)
!663 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !655, file: !656, line: 38, type: !62)
!664 = !DILocalVariable(name: "translation", scope: !655, file: !656, line: 40, type: !62)
!665 = !DILocalVariable(name: "w", scope: !655, file: !656, line: 47, type: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !667, line: 37, baseType: !668)
!667 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !76, line: 57, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 42, baseType: !7)
!670 = !DILocalVariable(name: "mbs", scope: !655, file: !656, line: 48, type: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !672, line: 6, baseType: !673)
!672 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !674, line: 21, baseType: !675)
!674 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 13, size: 64, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !675, file: !674, line: 15, baseType: !116, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !675, file: !674, line: 20, baseType: !679, size: 32, offset: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !675, file: !674, line: 16, size: 32, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !679, file: !674, line: 18, baseType: !7, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !679, file: !674, line: 19, baseType: !683, size: 32)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !265)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 16, elements: !342)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !687, file: !688, line: 76, type: !754, isLocal: false, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C99, file: !688, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !689, retainedTypes: !695, globals: !696, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!689 = !{!142, !690, !43}
!690 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !143, line: 254, baseType: !7, size: 32, elements: !691)
!691 = !{!692, !693, !694}
!692 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!693 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!694 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!695 = !{!116, !160, !161}
!696 = !{!685, !697, !703, !713, !715, !720, !743, !750, !752}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !687, file: !688, line: 92, type: !699, isLocal: false, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 320, elements: !701)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!701 = !{!702}
!702 = !DISubrange(count: 10)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !687, file: !688, line: 1040, type: !705, isLocal: false, isDefinition: true)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !688, line: 56, size: 448, elements: !706)
!706 = !{!707, !708, !709, !711, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !705, file: !688, line: 59, baseType: !142, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !688, line: 62, baseType: !116, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !705, file: !688, line: 66, baseType: !710, size: 256, offset: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !282)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !705, file: !688, line: 69, baseType: !62, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !705, file: !688, line: 72, baseType: !62, size: 64, offset: 384)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !687, file: !688, line: 107, type: !705, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "slot0", scope: !687, file: !688, line: 831, type: !717, isLocal: true, isDefinition: true)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 256)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "quote", scope: !722, file: !688, line: 228, type: !741, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "gettext_quote", scope: !688, file: !688, line: 197, type: !723, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !687, retainedNodes: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!62, !62, !142}
!725 = !{!726, !727, !728, !729, !730}
!726 = !DILocalVariable(name: "msgid", arg: 1, scope: !722, file: !688, line: 197, type: !62)
!727 = !DILocalVariable(name: "s", arg: 2, scope: !722, file: !688, line: 197, type: !142)
!728 = !DILocalVariable(name: "translation", scope: !722, file: !688, line: 199, type: !62)
!729 = !DILocalVariable(name: "w", scope: !722, file: !688, line: 229, type: !666)
!730 = !DILocalVariable(name: "mbs", scope: !722, file: !688, line: 230, type: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !672, line: 6, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !674, line: 21, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 13, size: 64, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !733, file: !674, line: 15, baseType: !116, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !733, file: !674, line: 20, baseType: !737, size: 32, offset: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !733, file: !674, line: 16, size: 32, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !737, file: !674, line: 18, baseType: !7, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !737, file: !674, line: 19, baseType: !683, size: 32)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !742)
!742 = !{!343, !266}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "slotvec", scope: !687, file: !688, line: 834, type: !745, isLocal: true, isDefinition: true)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !688, line: 823, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !746, file: !688, line: 825, baseType: !161, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !746, file: !688, line: 826, baseType: !129, size: 64, offset: 64)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "nslots", scope: !687, file: !688, line: 832, type: !116, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "slotvec0", scope: !687, file: !688, line: 833, type: !746, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 704, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 11)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !759, file: !760, line: 88, type: !764, isLocal: true, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, retainedTypes: !762, globals: !763, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/savedir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02eab3775a03291323b0c9a53bf5293b")
!761 = !{!423}
!762 = !{!159}
!763 = !{!757}
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 192, elements: !259)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !760, line: 86, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DISubroutineType(types: !769)
!769 = !{!116, !157, !157, !159}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "tryfunc", scope: !772, file: !773, line: 175, type: !789, isLocal: true, isDefinition: true)
!772 = distinct !DISubprogram(name: "gen_tempname_len", scope: !773, file: !773, line: 172, type: !774, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !783)
!773 = !DIFile(filename: "lib/tempname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "89467f8095ceec51ae791cc96ec80d48")
!774 = !DISubroutineType(types: !775)
!775 = !{!116, !129, !116, !116, !116, !161}
!776 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !777, splitDebugInlining: false, nameTableKind: None)
!777 = !{!770, !778}
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "letters", scope: !776, file: !773, line: 151, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 504, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 63)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DILocalVariable(name: "tmpl", arg: 1, scope: !772, file: !773, line: 172, type: !129)
!785 = !DILocalVariable(name: "suffixlen", arg: 2, scope: !772, file: !773, line: 172, type: !116)
!786 = !DILocalVariable(name: "flags", arg: 3, scope: !772, file: !773, line: 172, type: !116)
!787 = !DILocalVariable(name: "kind", arg: 4, scope: !772, file: !773, line: 172, type: !116)
!788 = !DILocalVariable(name: "x_suffix_len", arg: 5, scope: !772, file: !773, line: 173, type: !161)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 192, elements: !259)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!116, !129, !159}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "ht", scope: !796, file: !797, line: 171, type: !119, isLocal: true, isDefinition: true)
!796 = distinct !DISubprogram(name: "utimecmpat", scope: !797, file: !797, line: 129, type: !798, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !824, retainedNodes: !839)
!797 = !DIFile(filename: "lib/utimecmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b33c342642dbf94e8e18e40dfff270d9")
!798 = !DISubroutineType(types: !799)
!799 = !{!116, !116, !62, !800, !800, !116}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !309, line: 44, size: 1024, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !821, !822, !823}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !802, file: !309, line: 46, baseType: !312, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !802, file: !309, line: 47, baseType: !314, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !802, file: !309, line: 48, baseType: !75, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !802, file: !309, line: 49, baseType: !317, size: 32, offset: 160)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !802, file: !309, line: 50, baseType: !319, size: 32, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !802, file: !309, line: 51, baseType: !321, size: 32, offset: 224)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !802, file: !309, line: 52, baseType: !312, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !802, file: !309, line: 53, baseType: !312, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !802, file: !309, line: 54, baseType: !221, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !802, file: !309, line: 55, baseType: !326, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !802, file: !309, line: 56, baseType: !116, size: 32, offset: 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !802, file: !309, line: 57, baseType: !329, size: 64, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !802, file: !309, line: 65, baseType: !817, size: 128, offset: 576)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !332, line: 11, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !817, file: !332, line: 16, baseType: !335, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !817, file: !332, line: 21, baseType: !337, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !802, file: !309, line: 66, baseType: !817, size: 128, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !802, file: !309, line: 67, baseType: !817, size: 128, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !802, file: !309, line: 79, baseType: !341, size: 64, offset: 960)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !825, globals: !829, splitDebugInlining: false, nameTableKind: None)
!825 = !{!419, !826}
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !797, line: 47, baseType: !7, size: 32, elements: !827)
!827 = !{!828}
!828 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!829 = !{!794, !830}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !796, file: !797, line: 174, type: !832, isLocal: true, isDefinition: true)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !797, line: 63, size: 128, elements: !834)
!834 = !{!835, !837, !838}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !833, file: !797, line: 66, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !74, line: 59, baseType: !312)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !833, file: !797, line: 73, baseType: !116, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !833, file: !797, line: 77, baseType: !78, size: 8, offset: 96)
!839 = !{!840, !841, !842, !843, !844, !845, !848, !849, !850, !851, !854, !855, !856, !859, !860, !861, !862, !863, !864, !866, !869, !870, !871, !872, !876, !878, !879, !881, !883, !884}
!840 = !DILocalVariable(name: "dfd", arg: 1, scope: !796, file: !797, line: 129, type: !116)
!841 = !DILocalVariable(name: "dst_name", arg: 2, scope: !796, file: !797, line: 129, type: !62)
!842 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !796, file: !797, line: 130, type: !800)
!843 = !DILocalVariable(name: "src_stat", arg: 4, scope: !796, file: !797, line: 131, type: !800)
!844 = !DILocalVariable(name: "options", arg: 5, scope: !796, file: !797, line: 132, type: !116)
!845 = !DILocalVariable(name: "dst_s", scope: !796, file: !797, line: 150, type: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !847, line: 10, baseType: !335)
!847 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!848 = !DILocalVariable(name: "src_s", scope: !796, file: !797, line: 151, type: !846)
!849 = !DILocalVariable(name: "dst_ns", scope: !796, file: !797, line: 152, type: !116)
!850 = !DILocalVariable(name: "src_ns", scope: !796, file: !797, line: 153, type: !116)
!851 = !DILocalVariable(name: "dst_res", scope: !852, file: !797, line: 175, type: !832)
!852 = distinct !DILexicalBlock(scope: !853, file: !797, line: 156, column: 5)
!853 = distinct !DILexicalBlock(scope: !796, file: !797, line: 155, column: 7)
!854 = !DILocalVariable(name: "res", scope: !852, file: !797, line: 178, type: !116)
!855 = !DILocalVariable(name: "tmp_dst_res", scope: !852, file: !797, line: 192, type: !833)
!856 = !DILocalVariable(name: "dst_a_s", scope: !857, file: !797, line: 270, type: !846)
!857 = distinct !DILexicalBlock(scope: !858, file: !797, line: 266, column: 9)
!858 = distinct !DILexicalBlock(scope: !852, file: !797, line: 265, column: 11)
!859 = !DILocalVariable(name: "dst_c_s", scope: !857, file: !797, line: 271, type: !846)
!860 = !DILocalVariable(name: "dst_m_s", scope: !857, file: !797, line: 272, type: !846)
!861 = !DILocalVariable(name: "dst_a_ns", scope: !857, file: !797, line: 273, type: !116)
!862 = !DILocalVariable(name: "dst_c_ns", scope: !857, file: !797, line: 274, type: !116)
!863 = !DILocalVariable(name: "dst_m_ns", scope: !857, file: !797, line: 275, type: !116)
!864 = !DILocalVariable(name: "odd_second", scope: !865, file: !797, line: 284, type: !78)
!865 = distinct !DILexicalBlock(scope: !857, file: !797, line: 283, column: 11)
!866 = !DILocalVariable(name: "a", scope: !867, file: !797, line: 293, type: !116)
!867 = distinct !DILexicalBlock(scope: !868, file: !797, line: 292, column: 15)
!868 = distinct !DILexicalBlock(scope: !865, file: !797, line: 286, column: 17)
!869 = !DILocalVariable(name: "c", scope: !867, file: !797, line: 294, type: !116)
!870 = !DILocalVariable(name: "m", scope: !867, file: !797, line: 295, type: !116)
!871 = !DILocalVariable(name: "SR10", scope: !867, file: !797, line: 299, type: !116)
!872 = !DILocalVariable(name: "s", scope: !873, file: !797, line: 329, type: !846)
!873 = distinct !DILexicalBlock(scope: !874, file: !797, line: 328, column: 15)
!874 = distinct !DILexicalBlock(scope: !875, file: !797, line: 320, column: 13)
!875 = distinct !DILexicalBlock(scope: !857, file: !797, line: 319, column: 15)
!876 = !DILocalVariable(name: "timespec", scope: !874, file: !797, line: 343, type: !877)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 256, elements: !342)
!878 = !DILocalVariable(name: "dst_status", scope: !874, file: !797, line: 353, type: !802)
!879 = !DILocalVariable(name: "stat_result", scope: !880, file: !797, line: 357, type: !116)
!880 = distinct !DILexicalBlock(scope: !874, file: !797, line: 356, column: 15)
!881 = !DILocalVariable(name: "old_res", scope: !882, file: !797, line: 378, type: !116)
!882 = distinct !DILexicalBlock(scope: !874, file: !797, line: 377, column: 15)
!883 = !DILocalVariable(name: "a", scope: !882, file: !797, line: 379, type: !116)
!884 = !DILabel(scope: !885, name: "low_memory", file: !797, line: 219)
!885 = distinct !DILexicalBlock(scope: !886, file: !797, line: 218, column: 9)
!886 = distinct !DILexicalBlock(scope: !852, file: !797, line: 195, column: 11)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !889, file: !890, line: 26, type: !892, isLocal: false, isDefinition: true)
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !891, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!891 = !{!887}
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 376, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 47)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!896 = distinct !DIGlobalVariable(name: "initialized", scope: !897, file: !898, line: 41, type: !78, isLocal: true, isDefinition: true)
!897 = distinct !DISubprogram(name: "can_write_any_file", scope: !898, file: !898, line: 39, type: !899, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !901, retainedNodes: !906)
!898 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!899 = !DISubroutineType(types: !900)
!900 = !{!78}
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !902, splitDebugInlining: false, nameTableKind: None)
!902 = !{!903, !904}
!903 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "can_write", scope: !897, file: !898, line: 42, type: !78, isLocal: true, isDefinition: true)
!906 = !{!907}
!907 = !DILocalVariable(name: "can", scope: !908, file: !898, line: 46, type: !78)
!908 = distinct !DILexicalBlock(scope: !909, file: !898, line: 45, column: 5)
!909 = distinct !DILexicalBlock(scope: !897, file: !898, line: 44, column: 7)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "exit_failure", scope: !912, file: !913, line: 24, type: !915, isLocal: false, isDefinition: true)
!912 = distinct !DICompileUnit(language: DW_LANG_C99, file: !913, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !914, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!914 = !{!910}
!915 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "internal_state", scope: !918, file: !919, line: 97, type: !922, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !920, globals: !921, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!920 = !{!159, !161, !164}
!921 = !{!916}
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !672, line: 6, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !674, line: 21, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 13, size: 64, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !924, file: !674, line: 15, baseType: !116, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !924, file: !674, line: 20, baseType: !928, size: 32, offset: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !924, file: !674, line: 16, size: 32, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !928, file: !674, line: 18, baseType: !7, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !928, file: !674, line: 19, baseType: !683, size: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !934, file: !935, line: 506, type: !116, isLocal: true, isDefinition: true)
!934 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !935, file: !935, line: 485, type: !936, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !938, retainedNodes: !940)
!935 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!936 = !DISubroutineType(types: !937)
!937 = !{!116, !116, !116}
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !939, splitDebugInlining: false, nameTableKind: None)
!939 = !{!932}
!940 = !{!941, !942, !943, !944, !947}
!941 = !DILocalVariable(name: "fd", arg: 1, scope: !934, file: !935, line: 485, type: !116)
!942 = !DILocalVariable(name: "target", arg: 2, scope: !934, file: !935, line: 485, type: !116)
!943 = !DILocalVariable(name: "result", scope: !934, file: !935, line: 487, type: !116)
!944 = !DILocalVariable(name: "flags", scope: !945, file: !935, line: 530, type: !116)
!945 = distinct !DILexicalBlock(scope: !946, file: !935, line: 529, column: 5)
!946 = distinct !DILexicalBlock(scope: !934, file: !935, line: 528, column: 7)
!947 = !DILocalVariable(name: "saved_errno", scope: !948, file: !935, line: 533, type: !116)
!948 = distinct !DILexicalBlock(scope: !949, file: !935, line: 532, column: 9)
!949 = distinct !DILexicalBlock(scope: !945, file: !935, line: 531, column: 11)
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !952, retainedTypes: !976, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!952 = !{!5, !13, !20, !26, !32, !38, !430, !953, !142, !959, !968, !972}
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "scantype", file: !951, line: 459, baseType: !7, size: 32, elements: !954)
!954 = !{!955, !956, !957, !958}
!955 = !DIEnumerator(name: "ERROR_SCANTYPE", value: 0)
!956 = !DIEnumerator(name: "PLAIN_SCANTYPE", value: 1)
!957 = !DIEnumerator(name: "ZERO_SCANTYPE", value: 2)
!958 = !DIEnumerator(name: "LSEEK_SCANTYPE", value: 3)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !960, line: 44, baseType: !7, size: 32, elements: !961)
!960 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!961 = !{!962, !963, !964, !965, !966, !967}
!962 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!963 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!964 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!965 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!966 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!967 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!968 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !969, line: 79, baseType: !7, size: 32, elements: !970)
!969 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!970 = !{!971}
!971 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 36, baseType: !7, size: 32, elements: !974)
!973 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!974 = !{!975}
!975 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!976 = !{!78, !161, !977}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !74, line: 85, baseType: !221)
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!983 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !986, retainedTypes: !762, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aaac2d7e2e4691c3c7dfceec011d70d1")
!986 = !{!987}
!987 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !988, file: !985, line: 60, baseType: !7, size: 32, elements: !1015)
!988 = distinct !DISubprogram(name: "areadlink_with_size", scope: !985, file: !985, line: 49, type: !989, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !984, retainedNodes: !991)
!989 = !DISubroutineType(types: !990)
!990 = !{!129, !62, !161}
!991 = !{!992, !993, !994, !995, !996, !997, !998, !1003, !1004, !1005, !1008, !1009}
!992 = !DILocalVariable(name: "file", arg: 1, scope: !988, file: !985, line: 49, type: !62)
!993 = !DILocalVariable(name: "size", arg: 2, scope: !988, file: !985, line: 49, type: !161)
!994 = !DILocalVariable(name: "symlink_max", scope: !988, file: !985, line: 54, type: !161)
!995 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !988, file: !985, line: 55, type: !161)
!996 = !DILocalVariable(name: "initial_limit", scope: !988, file: !985, line: 56, type: !161)
!997 = !DILocalVariable(name: "buf_size", scope: !988, file: !985, line: 63, type: !161)
!998 = !DILocalVariable(name: "stackbuf", scope: !999, file: !985, line: 68, type: !1000)
!999 = distinct !DILexicalBlock(scope: !988, file: !985, line: 67, column: 5)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 128)
!1003 = !DILocalVariable(name: "buf", scope: !999, file: !985, line: 69, type: !129)
!1004 = !DILocalVariable(name: "buffer", scope: !999, file: !985, line: 70, type: !129)
!1005 = !DILocalVariable(name: "r", scope: !999, file: !985, line: 82, type: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !74, line: 108, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !76, line: 194, baseType: !222)
!1008 = !DILocalVariable(name: "link_length", scope: !999, file: !985, line: 89, type: !161)
!1009 = !DILocalVariable(name: "shrinked_buffer", scope: !1010, file: !985, line: 102, type: !129)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !985, line: 100, column: 13)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !985, line: 99, column: 20)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !985, line: 93, column: 15)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !985, line: 91, column: 9)
!1014 = distinct !DILexicalBlock(scope: !999, file: !985, line: 90, column: 11)
!1015 = !{!1016}
!1016 = !DIEnumerator(name: "stackbuf_size", value: 128)
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1018, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1019, retainedTypes: !762, splitDebugInlining: false, nameTableKind: None)
!1018 = !DIFile(filename: "lib/areadlinkat-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "326d53ebd4d51818fba309db538ba252")
!1019 = !{!1020}
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1021, file: !1018, line: 65, baseType: !7, size: 32, elements: !1015)
!1021 = distinct !DISubprogram(name: "areadlinkat_with_size", scope: !1018, file: !1018, line: 54, type: !1022, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1017, retainedNodes: !1024)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!129, !116, !62, !161}
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1034, !1035, !1036, !1037, !1038}
!1025 = !DILocalVariable(name: "fd", arg: 1, scope: !1021, file: !1018, line: 54, type: !116)
!1026 = !DILocalVariable(name: "file", arg: 2, scope: !1021, file: !1018, line: 54, type: !62)
!1027 = !DILocalVariable(name: "size", arg: 3, scope: !1021, file: !1018, line: 54, type: !161)
!1028 = !DILocalVariable(name: "symlink_max", scope: !1021, file: !1018, line: 59, type: !161)
!1029 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !1021, file: !1018, line: 60, type: !161)
