; ModuleID = 'src/csplit.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.__sigset_t = type { [16 x i64] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.control = type { i64, i64, i64, i32, i8, i8, i8, %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.buffer_record = type { i64, i64, i64, i64, i64, i8*, %struct.line*, %struct.line*, %struct.buffer_record* }
%struct.line = type { i64, i64, i64, [80 x %struct.cstring], %struct.line* }
%struct.cstring = type { i64, i8* }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon.24 }
%union.anon.24 = type { i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.re_registers = type { i32, i32*, i32* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "global_argv", scope: !2, file: !3, line: 156, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !185, globals: !192, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/csplit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d68c9f4e775d1bd8eaff70a866c964f2")
!4 = !{!5, !144, !158, !162, !177}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !6, file: !3, line: 1362, baseType: !67, size: 32, elements: !142)
!6 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1282, type: !7, scopeLine: 1283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !13)
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !{!14, !15, !16, !17, !23, !24, !25, !138, !140}
!14 = !DILocalVariable(name: "argc", arg: 1, scope: !6, file: !3, line: 1282, type: !9)
!15 = !DILocalVariable(name: "argv", arg: 2, scope: !6, file: !3, line: 1282, type: !10)
!16 = !DILocalVariable(name: "optc", scope: !6, file: !3, line: 1284, type: !9)
!17 = !DILocalVariable(name: "prefix_len", scope: !6, file: !3, line: 1347, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !19, line: 130, baseType: !20)
!19 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !21, line: 35, baseType: !22)
!21 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!22 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!23 = !DILocalVariable(name: "max_digit_string_len", scope: !6, file: !3, line: 1348, type: !18)
!24 = !DILocalVariable(name: "filename_size", scope: !6, file: !3, line: 1352, type: !18)
!25 = !DILocalVariable(name: "act", scope: !26, file: !3, line: 1364, type: !27)
!26 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1361, column: 3)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !28, line: 27, size: 1216, elements: !29)
!28 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!29 = !{!30, !123, !133, !134}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !27, file: !28, line: 38, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !27, file: !28, line: 31, size: 64, elements: !32)
!32 = !{!33, !39}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !31, file: !28, line: 34, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !35, line: 72, baseType: !36)
!35 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !9}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !31, file: !28, line: 36, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{null, !9, !43, !80}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !45, line: 124, baseType: !46)
!45 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 36, size: 1024, elements: !47)
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !46, file: !45, line: 38, baseType: !9, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !46, file: !45, line: 40, baseType: !9, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !46, file: !45, line: 42, baseType: !9, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !46, file: !45, line: 48, baseType: !9, size: 32, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !46, file: !45, line: 123, baseType: !53, size: 896, offset: 128)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !46, file: !45, line: 51, size: 896, elements: !54)
!54 = !{!55, !59, !68, !81, !87, !96, !112, !117}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !53, file: !45, line: 53, baseType: !56, size: 896)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 896, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 28)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !53, file: !45, line: 60, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 56, size: 64, elements: !61)
!61 = !{!62, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !60, file: !45, line: 58, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !64, line: 154, baseType: !9)
!64 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !60, file: !45, line: 59, baseType: !66, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !64, line: 146, baseType: !67)
!67 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !53, file: !45, line: 68, baseType: !69, size: 128)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 63, size: 128, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !69, file: !45, line: 65, baseType: !9, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !69, file: !45, line: 66, baseType: !9, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !69, file: !45, line: 67, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !75, line: 30, baseType: !76)
!75 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !75, line: 24, size: 64, elements: !77)
!77 = !{!78, !79}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !76, file: !75, line: 26, baseType: !9, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !76, file: !75, line: 27, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !53, file: !45, line: 76, baseType: !82, size: 128)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 71, size: 128, elements: !83)
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !82, file: !45, line: 73, baseType: !63, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !82, file: !45, line: 74, baseType: !66, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !82, file: !45, line: 75, baseType: !74, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !53, file: !45, line: 86, baseType: !88, size: 256)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 79, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93, !95}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !88, file: !45, line: 81, baseType: !63, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !88, file: !45, line: 82, baseType: !66, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !88, file: !45, line: 83, baseType: !9, size: 32, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !88, file: !45, line: 84, baseType: !94, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !64, line: 156, baseType: !22)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !88, file: !45, line: 85, baseType: !94, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !53, file: !45, line: 105, baseType: !97, size: 256)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 89, size: 256, elements: !98)
!98 = !{!99, !100, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !97, file: !45, line: 91, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !97, file: !45, line: 93, baseType: !101, size: 16, offset: 64)
!101 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !97, file: !45, line: 104, baseType: !103, size: 128, offset: 128)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !97, file: !45, line: 94, size: 128, elements: !104)
!104 = !{!105, !110}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !103, file: !45, line: 101, baseType: !106, size: 128)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !103, file: !45, line: 97, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !106, file: !45, line: 99, baseType: !80, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !106, file: !45, line: 100, baseType: !80, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !103, file: !45, line: 103, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !64, line: 42, baseType: !67)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !53, file: !45, line: 112, baseType: !113, size: 128)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 108, size: 128, elements: !114)
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !113, file: !45, line: 110, baseType: !22, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !113, file: !45, line: 111, baseType: !9, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !53, file: !45, line: 121, baseType: !118, size: 128)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !53, file: !45, line: 116, size: 128, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !118, file: !45, line: 118, baseType: !80, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !118, file: !45, line: 119, baseType: !9, size: 32, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !118, file: !45, line: 120, baseType: !67, size: 32, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !27, file: !28, line: 46, baseType: !124, size: 1024, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !125, line: 8, baseType: !126)
!125 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 5, size: 1024, elements: !127)
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !126, file: !125, line: 7, baseType: !129, size: 1024)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 1024, elements: !131)
!130 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!131 = !{!132}
!132 = !DISubrange(count: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !27, file: !28, line: 49, baseType: !9, size: 32, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !27, file: !28, line: 52, baseType: !135, size: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null}
!138 = !DILocalVariable(name: "i", scope: !139, file: !3, line: 1367, type: !9)
!139 = distinct !DILexicalBlock(scope: !26, file: !3, line: 1367, column: 5)
!140 = !DILocalVariable(name: "i", scope: !141, file: !3, line: 1378, type: !9)
!141 = distinct !DILexicalBlock(scope: !26, file: !3, line: 1378, column: 5)
!142 = !{!143}
!143 = !DIEnumerator(name: "nsigs", value: 22)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !145, line: 42, baseType: !67, size: 32, elements: !146)
!145 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!147 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!148 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!149 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!150 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!151 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!152 = !DIEnumerator(name: "c_quoting_style", value: 5)
!153 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!154 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!155 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!156 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!157 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1171, baseType: !67, size: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DIEnumerator(name: "FLAG_THOUSANDS", value: 1)
!161 = !DIEnumerator(name: "FLAG_ALTERNATIVE", value: 2)
!162 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !163, line: 46, baseType: !67, size: 32, elements: !164)
!163 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!165 = !DIEnumerator(name: "_ISupper", value: 256)
!166 = !DIEnumerator(name: "_ISlower", value: 512)
!167 = !DIEnumerator(name: "_ISalpha", value: 1024)
!168 = !DIEnumerator(name: "_ISdigit", value: 2048)
!169 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!170 = !DIEnumerator(name: "_ISspace", value: 8192)
!171 = !DIEnumerator(name: "_ISprint", value: 16384)
!172 = !DIEnumerator(name: "_ISgraph", value: 32768)
!173 = !DIEnumerator(name: "_ISblank", value: 1)
!174 = !DIEnumerator(name: "_IScntrl", value: 2)
!175 = !DIEnumerator(name: "_ISpunct", value: 4)
!176 = !DIEnumerator(name: "_ISalnum", value: 8)
!177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !178, line: 30, baseType: !67, size: 32, elements: !179)
!178 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!179 = !{!180, !181, !182, !183, !184}
!180 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!181 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!182 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!183 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!184 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!185 = !{!11, !80, !9, !186, !34, !187, !188, !189, !191}
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 46, baseType: !130)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !{!0, !193, !195, !197, !199, !203, !258, !260, !265, !268, !282, !285, !288, !291, !293, !295, !347, !354, !356, !358, !365, !394, !396, !398, !400, !402, !404, !413}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "suppress_count", scope: !2, file: !3, line: 159, type: !186, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !2, file: !3, line: 165, type: !186, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "suppress_matched", scope: !2, file: !3, line: 168, type: !186, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 178, type: !201, isLocal: true, isDefinition: true)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !202, line: 7, baseType: !124)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "output_stream", scope: !2, file: !3, line: 150, type: !205, isLocal: true, isDefinition: true)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !207, line: 7, baseType: !208)
!207 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !209, line: 49, size: 1728, elements: !210)
!209 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !226, !228, !229, !230, !232, !233, !235, !239, !242, !244, !247, !250, !251, !252, !253, !254}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !208, file: !209, line: 51, baseType: !9, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !208, file: !209, line: 54, baseType: !11, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !208, file: !209, line: 55, baseType: !11, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !208, file: !209, line: 56, baseType: !11, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !208, file: !209, line: 57, baseType: !11, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !208, file: !209, line: 58, baseType: !11, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !208, file: !209, line: 59, baseType: !11, size: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !208, file: !209, line: 60, baseType: !11, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !208, file: !209, line: 61, baseType: !11, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !208, file: !209, line: 64, baseType: !11, size: 64, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !208, file: !209, line: 65, baseType: !11, size: 64, offset: 640)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !208, file: !209, line: 66, baseType: !11, size: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !208, file: !209, line: 68, baseType: !224, size: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !209, line: 36, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !208, file: !209, line: 70, baseType: !227, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !208, file: !209, line: 72, baseType: !9, size: 32, offset: 896)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !208, file: !209, line: 73, baseType: !9, size: 32, offset: 928)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !208, file: !209, line: 74, baseType: !231, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 152, baseType: !22)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !208, file: !209, line: 77, baseType: !187, size: 16, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !208, file: !209, line: 78, baseType: !234, size: 8, offset: 1040)
!234 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !208, file: !209, line: 79, baseType: !236, size: 8, offset: 1048)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 1)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !208, file: !209, line: 81, baseType: !240, size: 64, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !209, line: 43, baseType: null)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !208, file: !209, line: 89, baseType: !243, size: 64, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !64, line: 153, baseType: !22)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !208, file: !209, line: 91, baseType: !245, size: 64, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !209, line: 37, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !208, file: !209, line: 92, baseType: !248, size: 64, offset: 1280)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !209, line: 38, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !208, file: !209, line: 93, baseType: !227, size: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !208, file: !209, line: 94, baseType: !80, size: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !208, file: !209, line: 95, baseType: !188, size: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !208, file: !209, line: 96, baseType: !9, size: 32, offset: 1536)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !208, file: !209, line: 98, baseType: !255, size: 160, offset: 1568)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 20)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "output_filename", scope: !2, file: !3, line: 153, type: !11, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "bytes_written", scope: !2, file: !3, line: 147, type: !262, isLocal: true, isDefinition: true)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !263, line: 101, baseType: !264)
!263 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !64, line: 72, baseType: !22)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "files_created", scope: !2, file: !3, line: 144, type: !267, isLocal: true, isDefinition: true)
!267 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !9)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 187, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 2816, elements: !280)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !273, line: 50, size: 256, elements: !274)
!273 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!274 = !{!275, !276, !277, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !273, line: 52, baseType: !189, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !272, file: !273, line: 55, baseType: !9, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !273, line: 56, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !272, file: !273, line: 57, baseType: !9, size: 32, offset: 192)
!280 = !{!281}
!281 = !DISubrange(count: 11)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 135, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !189)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "suffix", scope: !2, file: !3, line: 138, type: !287, isLocal: true, isDefinition: true)
!287 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "remove_files", scope: !2, file: !3, line: 162, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !186)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 141, type: !267, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "filename_space", scope: !2, file: !3, line: 132, type: !287, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "last_val", scope: !297, file: !3, line: 1124, type: !262, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "parse_patterns", scope: !3, file: !3, line: 1121, type: !298, scopeLine: 1122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !300)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !9, !9, !10}
!300 = !{!301, !302, !303, !304, !338, !340}
!301 = !DILocalVariable(name: "argc", arg: 1, scope: !297, file: !3, line: 1121, type: !9)
!302 = !DILocalVariable(name: "start", arg: 2, scope: !297, file: !3, line: 1121, type: !9)
!303 = !DILocalVariable(name: "argv", arg: 3, scope: !297, file: !3, line: 1121, type: !10)
!304 = !DILocalVariable(name: "p", scope: !297, file: !3, line: 1123, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control", file: !3, line: 50, size: 768, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !3, line: 52, baseType: !262, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "lines_required", scope: !306, file: !3, line: 53, baseType: !262, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !306, file: !3, line: 54, baseType: !262, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "argnum", scope: !306, file: !3, line: 55, baseType: !9, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_forever", scope: !306, file: !3, line: 56, baseType: !186, size: 8, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !306, file: !3, line: 57, baseType: !186, size: 8, offset: 232)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "regexpr", scope: !306, file: !3, line: 58, baseType: !186, size: 8, offset: 240)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "re_compiled", scope: !306, file: !3, line: 59, baseType: !316, size: 512, offset: 256)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !317, line: 413, size: 512, elements: !318)
!317 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!318 = !{!319, !322, !324, !325, !327, !328, !330, !331, !332, !333, !334, !335, !336, !337}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !316, file: !317, line: 417, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !317, line: 417, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !316, file: !317, line: 420, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !317, line: 56, baseType: !130)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !316, file: !317, line: 423, baseType: !323, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !316, file: !317, line: 426, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !317, line: 71, baseType: !130)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !316, file: !317, line: 431, baseType: !11, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !316, file: !317, line: 437, baseType: !329, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !316, file: !317, line: 440, baseType: !188, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !316, file: !317, line: 446, baseType: !67, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !316, file: !317, line: 457, baseType: !67, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !316, file: !317, line: 461, baseType: !67, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !316, file: !317, line: 465, baseType: !67, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !316, file: !317, line: 469, baseType: !67, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !316, file: !317, line: 472, baseType: !67, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !316, file: !317, line: 475, baseType: !67, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!338 = !DILocalVariable(name: "i", scope: !339, file: !3, line: 1126, type: !9)
!339 = distinct !DILexicalBlock(scope: !297, file: !3, line: 1126, column: 3)
!340 = !DILocalVariable(name: "val", scope: !341, file: !3, line: 1137, type: !345)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 1133, column: 9)
!342 = distinct !DILexicalBlock(scope: !343, file: !3, line: 1128, column: 11)
!343 = distinct !DILexicalBlock(scope: !344, file: !3, line: 1127, column: 5)
!344 = distinct !DILexicalBlock(scope: !339, file: !3, line: 1126, column: 3)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !263, line: 102, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !64, line: 73, baseType: !130)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "control_allocated", scope: !349, file: !3, line: 1012, type: !18, isLocal: true, isDefinition: true)
!349 = distinct !DISubprogram(name: "new_control_record", scope: !3, file: !3, line: 1010, type: !350, scopeLine: 1011, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !352)
!350 = !DISubroutineType(types: !351)
!351 = !{!305}
!352 = !{!353}
!353 = !DILocalVariable(name: "p", scope: !349, file: !3, line: 1013, type: !305)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "control_used", scope: !2, file: !3, line: 175, type: !18, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "controls", scope: !2, file: !3, line: 172, type: !305, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "term_sig", scope: !2, file: !360, line: 6, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 704, elements: !363)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!363 = !{!364}
!364 = !DISubrange(count: 22)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 114, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "buffer_record", file: !3, line: 95, size: 576, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !392, !393}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_alloc", scope: !368, file: !3, line: 97, baseType: !18, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_used", scope: !368, file: !3, line: 98, baseType: !18, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start_line", scope: !368, file: !3, line: 99, baseType: !262, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "first_available", scope: !368, file: !3, line: 100, baseType: !262, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "num_lines", scope: !368, file: !3, line: 101, baseType: !18, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !368, file: !3, line: 102, baseType: !11, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "line_start", scope: !368, file: !3, line: 103, baseType: !377, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "line", file: !3, line: 83, size: 10496, elements: !379)
!379 = !{!380, !381, !382, !383, !391}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !378, file: !3, line: 85, baseType: !18, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "insert_index", scope: !378, file: !3, line: 86, baseType: !18, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "retrieve_index", scope: !378, file: !3, line: 87, baseType: !18, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "starts", scope: !378, file: !3, line: 88, baseType: !384, size: 10240, offset: 192)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 10240, elements: !389)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cstring", file: !3, line: 75, size: 128, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !385, file: !3, line: 77, baseType: !18, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !385, file: !3, line: 78, baseType: !11, size: 64, offset: 64)
!389 = !{!390}
!390 = !DISubrange(count: 80)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !3, line: 89, baseType: !377, size: 64, offset: 10432)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "curr_line", scope: !368, file: !3, line: 104, baseType: !377, size: 64, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !3, line: 105, baseType: !367, size: 64, offset: 512)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "have_read_eof", scope: !2, file: !3, line: 129, type: !186, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "hold_count", scope: !2, file: !3, line: 120, type: !18, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "last_line_number", scope: !2, file: !3, line: 123, type: !262, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "hold_area", scope: !2, file: !3, line: 117, type: !11, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "current_line", scope: !2, file: !3, line: 126, type: !262, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "prev_buf", scope: !406, file: !3, line: 518, type: !367, isLocal: true, isDefinition: true)
!406 = distinct !DISubprogram(name: "remove_line", scope: !3, file: !3, line: 513, type: !407, scopeLine: 514, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!407 = !DISubroutineType(types: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!410 = !{!411, !412}
!411 = !DILocalVariable(name: "line", scope: !406, file: !3, line: 520, type: !409)
!412 = !DILocalVariable(name: "l", scope: !406, file: !3, line: 521, type: !377)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !415, file: !416, line: 575, type: !9, isLocal: true, isDefinition: true)
!415 = distinct !DISubprogram(name: "oputs_", scope: !416, file: !416, line: 573, type: !417, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!416 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!417 = !DISubroutineType(types: !418)
!418 = !{null, !189, !189}
!419 = !{!420, !421, !422, !425, !426, !427, !428, !432, !433, !434, !435, !437, !438, !439, !440, !442, !443}
!420 = !DILocalVariable(name: "program", arg: 1, scope: !415, file: !416, line: 573, type: !189)
!421 = !DILocalVariable(name: "option", arg: 2, scope: !415, file: !416, line: 573, type: !189)
!422 = !DILocalVariable(name: "term", scope: !423, file: !416, line: 585, type: !189)
!423 = distinct !DILexicalBlock(scope: !424, file: !416, line: 582, column: 5)
!424 = distinct !DILexicalBlock(scope: !415, file: !416, line: 581, column: 7)
!425 = !DILocalVariable(name: "double_space", scope: !415, file: !416, line: 594, type: !186)
!426 = !DILocalVariable(name: "first_word", scope: !415, file: !416, line: 595, type: !189)
!427 = !DILocalVariable(name: "option_text", scope: !415, file: !416, line: 596, type: !189)
!428 = !DILocalVariable(name: "s", scope: !429, file: !416, line: 608, type: !189)
!429 = distinct !DILexicalBlock(scope: !430, file: !416, line: 605, column: 5)
!430 = distinct !DILexicalBlock(scope: !431, file: !416, line: 604, column: 12)
!431 = distinct !DILexicalBlock(scope: !415, file: !416, line: 597, column: 7)
!432 = !DILocalVariable(name: "spaces", scope: !429, file: !416, line: 609, type: !188)
!433 = !DILocalVariable(name: "anchor_len", scope: !415, file: !416, line: 620, type: !188)
!434 = !DILocalVariable(name: "desc_text", scope: !415, file: !416, line: 625, type: !189)
!435 = !DILocalVariable(name: "__ptr", scope: !436, file: !416, line: 644, type: !189)
!436 = distinct !DILexicalBlock(scope: !415, file: !416, line: 644, column: 3)
!437 = !DILocalVariable(name: "__stream", scope: !436, file: !416, line: 644, type: !205)
!438 = !DILocalVariable(name: "__cnt", scope: !436, file: !416, line: 644, type: !188)
!439 = !DILocalVariable(name: "url_program", scope: !415, file: !416, line: 648, type: !189)
!440 = !DILocalVariable(name: "__ptr", scope: !441, file: !416, line: 686, type: !189)
!441 = distinct !DILexicalBlock(scope: !415, file: !416, line: 686, column: 3)
!442 = !DILocalVariable(name: "__stream", scope: !441, file: !416, line: 686, type: !205)
!443 = !DILocalVariable(name: "__cnt", scope: !441, file: !416, line: 686, type: !188)
!444 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!445 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!446 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!447 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "Version", scope: !450, file: !451, line: 3, type: !189, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !452, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!452 = !{!448}
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "file_name", scope: !455, file: !456, line: 45, type: !189, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !457, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!457 = !{!453, !458}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !455, file: !456, line: 55, type: !186, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !462, file: !463, line: 66, type: !135, isLocal: false, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !464, globals: !465, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!464 = !{!80, !191}
!465 = !{!466, !492, !460, !494, !496}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "old_file_name", scope: !468, file: !463, line: 304, type: !189, isLocal: true, isDefinition: true)
!468 = distinct !DISubprogram(name: "verror_at_line", scope: !463, file: !463, line: 298, type: !469, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !462, retainedNodes: !485)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !9, !9, !189, !67, !189, !471}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !472, line: 52, baseType: !473)
!472 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !474, line: 32, baseType: !475)
!474 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !476, baseType: !477)
!476 = !DIFile(filename: "lib/error.c", directory: "/src")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !478, size: 256, elements: !479)
!478 = !DINamespace(name: "std", scope: null)
!479 = !{!480, !481, !482, !483, !484}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !477, file: !476, baseType: !80, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !477, file: !476, baseType: !80, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !477, file: !476, baseType: !80, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !477, file: !476, baseType: !9, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !477, file: !476, baseType: !9, size: 32, offset: 224)
!485 = !{!486, !487, !488, !489, !490, !491}
!486 = !DILocalVariable(name: "status", arg: 1, scope: !468, file: !463, line: 298, type: !9)
!487 = !DILocalVariable(name: "errnum", arg: 2, scope: !468, file: !463, line: 298, type: !9)
!488 = !DILocalVariable(name: "file_name", arg: 3, scope: !468, file: !463, line: 298, type: !189)
!489 = !DILocalVariable(name: "line_number", arg: 4, scope: !468, file: !463, line: 298, type: !67)
!490 = !DILocalVariable(name: "message", arg: 5, scope: !468, file: !463, line: 298, type: !189)
!491 = !DILocalVariable(name: "args", arg: 6, scope: !468, file: !463, line: 298, type: !471)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "old_line_number", scope: !468, file: !463, line: 305, type: !67, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "error_message_count", scope: !462, file: !463, line: 69, type: !67, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !462, file: !463, line: 295, type: !9, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "exit_failure", scope: !500, file: !501, line: 24, type: !267, isLocal: false, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !502, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!502 = !{!498}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "program_name", scope: !505, file: !506, line: 31, type: !189, isLocal: false, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !507, globals: !508, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!507 = !{!11}
!508 = !{!503}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "utf07FF", scope: !511, file: !512, line: 46, type: !541, isLocal: true, isDefinition: true)
!511 = distinct !DISubprogram(name: "proper_name_lite", scope: !512, file: !512, line: 38, type: !513, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !515, retainedNodes: !517)
!512 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!513 = !DISubroutineType(types: !514)
!514 = !{!189, !189, !189}
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !516, splitDebugInlining: false, nameTableKind: None)
!516 = !{!509}
!517 = !{!518, !519, !520, !521, !525}
!518 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !511, file: !512, line: 38, type: !189)
!519 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !511, file: !512, line: 38, type: !189)
!520 = !DILocalVariable(name: "translation", scope: !511, file: !512, line: 40, type: !189)
!521 = !DILocalVariable(name: "w", scope: !511, file: !512, line: 47, type: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !523, line: 37, baseType: !524)
!523 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !64, line: 57, baseType: !111)
!525 = !DILocalVariable(name: "mbs", scope: !511, file: !512, line: 48, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !527, line: 6, baseType: !528)
!527 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !529, line: 21, baseType: !530)
!529 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 13, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !530, file: !529, line: 15, baseType: !9, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !530, file: !529, line: 20, baseType: !534, size: 32, offset: 32)
!534 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !529, line: 16, size: 32, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !534, file: !529, line: 18, baseType: !67, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !534, file: !529, line: 19, baseType: !538, size: 32)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 4)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 16, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 2)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !546, file: !547, line: 76, type: !615, isLocal: false, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !554, globals: !555, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!548 = !{!144, !549, !162}
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !145, line: 254, baseType: !67, size: 32, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!552 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!553 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!554 = !{!9, !187, !188}
!555 = !{!544, !556, !562, !574, !576, !581, !604, !611, !613}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !546, file: !547, line: 92, type: !558, isLocal: false, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 320, elements: !560)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!560 = !{!561}
!561 = !DISubrange(count: 10)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !546, file: !547, line: 1040, type: !564, isLocal: false, isDefinition: true)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !547, line: 56, size: 448, elements: !565)
!565 = !{!566, !567, !568, !572, !573}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !564, file: !547, line: 59, baseType: !144, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !547, line: 62, baseType: !9, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !564, file: !547, line: 66, baseType: !569, size: 256, offset: 64)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 256, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !564, file: !547, line: 69, baseType: !189, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !564, file: !547, line: 72, baseType: !189, size: 64, offset: 384)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !546, file: !547, line: 107, type: !564, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "slot0", scope: !546, file: !547, line: 831, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 256)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "quote", scope: !583, file: !547, line: 228, type: !602, isLocal: true, isDefinition: true)
!583 = distinct !DISubprogram(name: "gettext_quote", scope: !547, file: !547, line: 197, type: !584, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !546, retainedNodes: !586)
!584 = !DISubroutineType(types: !585)
!585 = !{!189, !189, !144}
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(name: "msgid", arg: 1, scope: !583, file: !547, line: 197, type: !189)
!588 = !DILocalVariable(name: "s", arg: 2, scope: !583, file: !547, line: 197, type: !144)
!589 = !DILocalVariable(name: "translation", scope: !583, file: !547, line: 199, type: !189)
!590 = !DILocalVariable(name: "w", scope: !583, file: !547, line: 229, type: !522)
!591 = !DILocalVariable(name: "mbs", scope: !583, file: !547, line: 230, type: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !527, line: 6, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !529, line: 21, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 13, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !594, file: !529, line: 15, baseType: !9, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !594, file: !529, line: 20, baseType: !598, size: 32, offset: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !594, file: !529, line: 16, size: 32, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !598, file: !529, line: 18, baseType: !67, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !598, file: !529, line: 19, baseType: !538, size: 32)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !603)
!603 = !{!543, !540}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "slotvec", scope: !546, file: !547, line: 834, type: !606, isLocal: true, isDefinition: true)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !547, line: 823, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !607, file: !547, line: 825, baseType: !188, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !607, file: !547, line: 826, baseType: !11, size: 64, offset: 64)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "nslots", scope: !546, file: !547, line: 832, type: !9, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "slotvec0", scope: !546, file: !547, line: 833, type: !607, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 704, elements: !280)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !619, file: !620, line: 26, type: !622, isLocal: false, isDefinition: true)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !621, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!621 = !{!617}
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 376, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 47)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !627, file: !628, line: 506, type: !9, isLocal: true, isDefinition: true)
!627 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !628, file: !628, line: 485, type: !629, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !631, retainedNodes: !633)
!628 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!629 = !DISubroutineType(types: !630)
!630 = !{!9, !9, !9}
!631 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !632, splitDebugInlining: false, nameTableKind: None)
!632 = !{!625}
!633 = !{!634, !635, !636, !637, !640}
!634 = !DILocalVariable(name: "fd", arg: 1, scope: !627, file: !628, line: 485, type: !9)
!635 = !DILocalVariable(name: "target", arg: 2, scope: !627, file: !628, line: 485, type: !9)
!636 = !DILocalVariable(name: "result", scope: !627, file: !628, line: 487, type: !9)
!637 = !DILocalVariable(name: "flags", scope: !638, file: !628, line: 530, type: !9)
!638 = distinct !DILexicalBlock(scope: !639, file: !628, line: 529, column: 5)
!639 = distinct !DILexicalBlock(scope: !627, file: !628, line: 528, column: 7)
!640 = !DILocalVariable(name: "saved_errno", scope: !641, file: !628, line: 533, type: !9)
!641 = distinct !DILexicalBlock(scope: !642, file: !628, line: 532, column: 9)
!642 = distinct !DILexicalBlock(scope: !638, file: !628, line: 531, column: 11)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "internal_state", scope: !645, file: !646, line: 97, type: !649, isLocal: true, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, globals: !648, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!647 = !{!80, !188, !191}
!648 = !{!643}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !527, line: 6, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !529, line: 21, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 13, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !651, file: !529, line: 15, baseType: !9, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !651, file: !529, line: 20, baseType: !655, size: 32, offset: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !529, line: 16, size: 32, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !655, file: !529, line: 18, baseType: !67, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !655, file: !529, line: 19, baseType: !538, size: 32)
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!665 = !{!80}
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!674 = !{!262}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !677, retainedTypes: !682, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/safe-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "434e548fbeff241cc07e1dbcc7b4611f")
!677 = !{!678}
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !679, line: 36, baseType: !67, size: 32, elements: !680)
!679 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!680 = !{!681}
!681 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!682 = !{!188}
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !687, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!687 = !{!688}
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !686, line: 40, baseType: !67, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !693, retainedTypes: !721, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!693 = !{!694, !706}
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !695, file: !692, line: 188, baseType: !67, size: 32, elements: !704)
!695 = distinct !DISubprogram(name: "x2nrealloc", scope: !692, file: !692, line: 176, type: !696, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !691, retainedNodes: !699)
!696 = !DISubroutineType(types: !697)
!697 = !{!80, !80, !698, !188}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!699 = !{!700, !701, !702, !703}
!700 = !DILocalVariable(name: "p", arg: 1, scope: !695, file: !692, line: 176, type: !80)
!701 = !DILocalVariable(name: "pn", arg: 2, scope: !695, file: !692, line: 176, type: !698)
!702 = !DILocalVariable(name: "s", arg: 3, scope: !695, file: !692, line: 176, type: !188)
!703 = !DILocalVariable(name: "n", scope: !695, file: !692, line: 178, type: !188)
!704 = !{!705}
!705 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !707, file: !692, line: 228, baseType: !67, size: 32, elements: !704)
!707 = distinct !DISubprogram(name: "xpalloc", scope: !692, file: !692, line: 223, type: !708, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !691, retainedNodes: !711)
!708 = !DISubroutineType(types: !709)
!709 = !{!80, !80, !710, !18, !20, !18}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720}
!712 = !DILocalVariable(name: "pa", arg: 1, scope: !707, file: !692, line: 223, type: !80)
!713 = !DILocalVariable(name: "pn", arg: 2, scope: !707, file: !692, line: 223, type: !710)
!714 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !707, file: !692, line: 223, type: !18)
!715 = !DILocalVariable(name: "n_max", arg: 4, scope: !707, file: !692, line: 223, type: !20)
!716 = !DILocalVariable(name: "s", arg: 5, scope: !707, file: !692, line: 223, type: !18)
!717 = !DILocalVariable(name: "n0", scope: !707, file: !692, line: 230, type: !18)
!718 = !DILocalVariable(name: "n", scope: !707, file: !692, line: 237, type: !18)
!719 = !DILocalVariable(name: "nbytes", scope: !707, file: !692, line: 248, type: !18)
!720 = !DILocalVariable(name: "adjusted_nbytes", scope: !707, file: !692, line: 252, type: !18)
!721 = !{!11, !80, !186, !22, !130}
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!724 = !{!177, !725}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !726, line: 24, baseType: !67, size: 32, elements: !727)
!726 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!727 = !{!728, !729, !730, !731}
!728 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!729 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!730 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!731 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !734, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!734 = !{!177}
!735 = !{!186, !22, !130, !262}
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !738, retainedTypes: !739, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!738 = !{!177, !162}
!739 = !{!9, !187, !11, !186, !130, !345}
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !746, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!746 = !{!186, !130, !80}
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!749 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !665, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!753 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!754 = !{i32 7, !"Dwarf Version", i32 5}
!755 = !{i32 2, !"Debug Info Version", i32 3}
!756 = !{i32 1, !"wchar_size", i32 4}
!757 = !{i32 1, !"branch-target-enforcement", i32 0}
!758 = !{i32 1, !"sign-return-address", i32 0}
!759 = !{i32 1, !"sign-return-address-all", i32 0}
!760 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!761 = !{i32 7, !"PIC Level", i32 2}
!762 = !{i32 7, !"PIE Level", i32 2}
!763 = !{i32 7, !"uwtable", i32 1}
!764 = !{i32 7, !"frame-pointer", i32 1}
!765 = distinct !DISubprogram(name: "xalloc_die", scope: !3, file: !3, line: 225, type: !136, scopeLine: 226, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!766 = !{}
!767 = !DILocation(line: 227, column: 3, scope: !765)
!768 = !DILocation(line: 228, column: 3, scope: !765)
!769 = !DISubprogram(name: "dcgettext", scope: !770, file: !770, line: 51, type: !771, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !766)
!770 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!771 = !DISubroutineType(types: !772)
!772 = !{!11, !189, !189, !9}
!773 = distinct !DISubprogram(name: "cleanup_fatal", scope: !3, file: !3, line: 218, type: !136, scopeLine: 219, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!774 = !DILocation(line: 220, column: 3, scope: !773)
!775 = !DILocation(line: 221, column: 3, scope: !773)
!776 = distinct !DISubprogram(name: "cleanup", scope: !3, file: !3, line: 206, type: !136, scopeLine: 207, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !777)
!777 = !{!778}
!778 = !DILocalVariable(name: "oldset", scope: !776, file: !3, line: 208, type: !201)
!779 = !DILocation(line: 208, column: 3, scope: !776)
!780 = !DILocation(line: 208, column: 12, scope: !776)
!781 = !DILocation(line: 210, column: 3, scope: !776)
!782 = !DILocation(line: 212, column: 3, scope: !776)
!783 = !DILocation(line: 213, column: 3, scope: !776)
!784 = !DILocation(line: 214, column: 3, scope: !776)
!785 = !DILocation(line: 215, column: 1, scope: !776)
!786 = distinct !DISubprogram(name: "close_output_file", scope: !3, file: !3, line: 950, type: !136, scopeLine: 951, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !787)
!787 = !{!788, !793, !794}
!788 = !DILocalVariable(name: "oldset", scope: !789, file: !3, line: 968, type: !201)
!789 = distinct !DILexicalBlock(scope: !790, file: !3, line: 967, column: 9)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 966, column: 11)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 953, column: 5)
!792 = distinct !DILexicalBlock(scope: !786, file: !3, line: 952, column: 7)
!793 = !DILocalVariable(name: "unlink_ok", scope: !789, file: !3, line: 969, type: !186)
!794 = !DILocalVariable(name: "unlink_errno", scope: !789, file: !3, line: 970, type: !9)
!795 = !DILocation(line: 952, column: 7, scope: !792)
!796 = !{!797, !797, i64 0}
!797 = !{!"any pointer", !798, i64 0}
!798 = !{!"omnipotent char", !799, i64 0}
!799 = !{!"Simple C/C++ TBAA"}
!800 = !DILocation(line: 952, column: 7, scope: !786)
!801 = !DILocalVariable(name: "__stream", arg: 1, scope: !802, file: !803, line: 135, type: !205)
!802 = distinct !DISubprogram(name: "ferror_unlocked", scope: !803, file: !803, line: 135, type: !804, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !806)
!803 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!804 = !DISubroutineType(types: !805)
!805 = !{!9, !205}
!806 = !{!801}
!807 = !DILocation(line: 0, scope: !802, inlinedAt: !808)
!808 = distinct !DILocation(line: 954, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !791, file: !3, line: 954, column: 11)
!810 = !DILocation(line: 137, column: 10, scope: !802, inlinedAt: !808)
!811 = !{!812, !813, i64 0}
!812 = !{!"_IO_FILE", !813, i64 0, !797, i64 8, !797, i64 16, !797, i64 24, !797, i64 32, !797, i64 40, !797, i64 48, !797, i64 56, !797, i64 64, !797, i64 72, !797, i64 80, !797, i64 88, !797, i64 96, !797, i64 104, !813, i64 112, !813, i64 116, !814, i64 120, !815, i64 128, !798, i64 130, !798, i64 131, !797, i64 136, !814, i64 144, !797, i64 152, !797, i64 160, !797, i64 168, !797, i64 176, !814, i64 184, !813, i64 192, !798, i64 196}
!813 = !{!"int", !798, i64 0}
!814 = !{!"long", !798, i64 0}
!815 = !{!"short", !798, i64 0}
!816 = !DILocation(line: 954, column: 11, scope: !809)
!817 = !DILocation(line: 954, column: 11, scope: !791)
!818 = !DILocation(line: 956, column: 11, scope: !819)
!819 = distinct !DILexicalBlock(scope: !809, file: !3, line: 955, column: 9)
!820 = !DILocation(line: 957, column: 25, scope: !819)
!821 = !DILocation(line: 958, column: 11, scope: !819)
!822 = !DILocation(line: 960, column: 11, scope: !823)
!823 = distinct !DILexicalBlock(scope: !791, file: !3, line: 960, column: 11)
!824 = !DILocation(line: 960, column: 34, scope: !823)
!825 = !DILocation(line: 960, column: 11, scope: !791)
!826 = !DILocation(line: 962, column: 11, scope: !827)
!827 = distinct !DILexicalBlock(scope: !823, file: !3, line: 961, column: 9)
!828 = !{!813, !813, i64 0}
!829 = !DILocation(line: 963, column: 25, scope: !827)
!830 = !DILocation(line: 964, column: 11, scope: !827)
!831 = !DILocation(line: 966, column: 11, scope: !790)
!832 = !{!814, !814, i64 0}
!833 = !DILocation(line: 966, column: 25, scope: !790)
!834 = !DILocation(line: 966, column: 30, scope: !790)
!835 = !DILocation(line: 966, column: 33, scope: !790)
!836 = !DILocation(line: 966, column: 11, scope: !791)
!837 = !DILocation(line: 968, column: 11, scope: !789)
!838 = !DILocation(line: 968, column: 20, scope: !789)
!839 = !DILocation(line: 973, column: 11, scope: !789)
!840 = !DILocation(line: 974, column: 32, scope: !789)
!841 = !DILocation(line: 974, column: 24, scope: !789)
!842 = !DILocation(line: 974, column: 49, scope: !789)
!843 = !DILocation(line: 0, scope: !789)
!844 = !DILocation(line: 975, column: 26, scope: !789)
!845 = !DILocation(line: 976, column: 24, scope: !789)
!846 = !DILocation(line: 977, column: 11, scope: !789)
!847 = !DILocation(line: 979, column: 27, scope: !848)
!848 = distinct !DILexicalBlock(scope: !789, file: !3, line: 979, column: 15)
!849 = !DILocation(line: 980, column: 13, scope: !848)
!850 = !DILocation(line: 981, column: 9, scope: !790)
!851 = !DILocation(line: 981, column: 9, scope: !789)
!852 = !DILocation(line: 984, column: 16, scope: !853)
!853 = distinct !DILexicalBlock(scope: !854, file: !3, line: 984, column: 15)
!854 = distinct !DILexicalBlock(scope: !790, file: !3, line: 983, column: 9)
!855 = !DILocation(line: 984, column: 15, scope: !854)
!856 = !DILocation(line: 985, column: 13, scope: !853)
!857 = !DILocation(line: 987, column: 21, scope: !791)
!858 = !DILocation(line: 988, column: 5, scope: !791)
!859 = !DILocation(line: 989, column: 1, scope: !786)
!860 = !DISubprogram(name: "sigprocmask", scope: !35, file: !35, line: 232, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !766)
!861 = !DISubroutineType(types: !862)
!862 = !{!9, !9, !863, !866}
!863 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!866 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!868 = distinct !DISubprogram(name: "delete_all_files", scope: !3, file: !3, line: 931, type: !869, scopeLine: 932, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !186}
!871 = !{!872, !873, !875}
!872 = !DILocalVariable(name: "in_signal_handler", arg: 1, scope: !868, file: !3, line: 931, type: !186)
!873 = !DILocalVariable(name: "i", scope: !874, file: !3, line: 936, type: !9)
!874 = distinct !DILexicalBlock(scope: !868, file: !3, line: 936, column: 3)
!875 = !DILocalVariable(name: "name", scope: !876, file: !3, line: 938, type: !189)
!876 = distinct !DILexicalBlock(scope: !877, file: !3, line: 937, column: 5)
!877 = distinct !DILexicalBlock(scope: !874, file: !3, line: 936, column: 3)
!878 = !DILocation(line: 0, scope: !868)
!879 = !DILocation(line: 933, column: 9, scope: !880)
!880 = distinct !DILexicalBlock(scope: !868, file: !3, line: 933, column: 7)
!881 = !{!882, !882, i64 0}
!882 = !{!"_Bool", !798, i64 0}
!883 = !{i8 0, i8 2}
!884 = !DILocation(line: 933, column: 7, scope: !868)
!885 = !DILocation(line: 936, column: 16, scope: !874)
!886 = !DILocation(line: 0, scope: !874)
!887 = !DILocation(line: 936, column: 33, scope: !877)
!888 = !DILocation(line: 936, column: 3, scope: !874)
!889 = !DILocation(line: 943, column: 17, scope: !868)
!890 = !DILocation(line: 944, column: 1, scope: !868)
!891 = !DILocation(line: 936, column: 36, scope: !877)
!892 = !DILocalVariable(name: "num", arg: 1, scope: !893, file: !3, line: 881, type: !9)
!893 = distinct !DISubprogram(name: "make_filename", scope: !3, file: !3, line: 881, type: !894, scopeLine: 882, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{!11, !9}
!896 = !{!892}
!897 = !DILocation(line: 0, scope: !893, inlinedAt: !898)
!898 = distinct !DILocation(line: 938, column: 26, scope: !876)
!899 = !DILocation(line: 883, column: 11, scope: !893, inlinedAt: !898)
!900 = !DILocation(line: 883, column: 27, scope: !893, inlinedAt: !898)
!901 = !DILocalVariable(name: "__dest", arg: 1, scope: !902, file: !903, line: 77, type: !906)
!902 = distinct !DISubprogram(name: "strcpy", scope: !903, file: !903, line: 77, type: !904, scopeLine: 78, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !908)
!903 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!904 = !DISubroutineType(types: !905)
!905 = !{!11, !906, !907}
!906 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!907 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !189)
!908 = !{!901, !909}
!909 = !DILocalVariable(name: "__src", arg: 2, scope: !902, file: !903, line: 77, type: !907)
!910 = !DILocation(line: 0, scope: !902, inlinedAt: !911)
!911 = distinct !DILocation(line: 883, column: 3, scope: !893, inlinedAt: !898)
!912 = !DILocation(line: 79, column: 10, scope: !902, inlinedAt: !911)
!913 = !DILocation(line: 884, column: 7, scope: !914, inlinedAt: !898)
!914 = distinct !DILexicalBlock(scope: !893, file: !3, line: 884, column: 7)
!915 = !DILocation(line: 0, scope: !914, inlinedAt: !898)
!916 = !DILocation(line: 884, column: 7, scope: !893, inlinedAt: !898)
!917 = !DILocation(line: 885, column: 5, scope: !914, inlinedAt: !898)
!918 = !DILocation(line: 887, column: 5, scope: !914, inlinedAt: !898)
!919 = !DILocation(line: 888, column: 10, scope: !893, inlinedAt: !898)
!920 = !DILocation(line: 0, scope: !876)
!921 = !DILocation(line: 939, column: 11, scope: !922)
!922 = distinct !DILexicalBlock(scope: !876, file: !3, line: 939, column: 11)
!923 = !DILocation(line: 939, column: 25, scope: !922)
!924 = !DILocation(line: 939, column: 30, scope: !922)
!925 = !DILocation(line: 939, column: 33, scope: !922)
!926 = !DILocation(line: 939, column: 39, scope: !922)
!927 = !DILocation(line: 939, column: 49, scope: !922)
!928 = !DILocation(line: 940, column: 9, scope: !922)
!929 = distinct !{!929, !888, !930, !931}
!930 = !DILocation(line: 941, column: 5, scope: !874)
!931 = !{!"llvm.loop.mustprogress"}
!932 = !DISubprogram(name: "unlink", scope: !933, file: !933, line: 858, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !766)
!933 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!934 = !DISubroutineType(types: !935)
!935 = !{!9, !189}
!936 = !DILocation(line: 0, scope: !6)
!937 = !DILocation(line: 1287, column: 21, scope: !6)
!938 = !DILocation(line: 1287, column: 3, scope: !6)
!939 = !DILocation(line: 1288, column: 3, scope: !6)
!940 = !DILocation(line: 1289, column: 3, scope: !6)
!941 = !DILocation(line: 1290, column: 3, scope: !6)
!942 = !DILocation(line: 1292, column: 3, scope: !6)
!943 = !DILocation(line: 1294, column: 15, scope: !6)
!944 = !DILocation(line: 1296, column: 3, scope: !6)
!945 = !DILocation(line: 1296, column: 18, scope: !6)
!946 = !DILocation(line: 1301, column: 18, scope: !947)
!947 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1299, column: 7)
!948 = !DILocation(line: 1301, column: 16, scope: !947)
!949 = !DILocation(line: 1302, column: 9, scope: !947)
!950 = !DILocation(line: 1305, column: 18, scope: !947)
!951 = !DILocation(line: 1305, column: 16, scope: !947)
!952 = !DILocation(line: 1306, column: 9, scope: !947)
!953 = !DILocation(line: 1309, column: 22, scope: !947)
!954 = !DILocation(line: 1310, column: 9, scope: !947)
!955 = !DILocation(line: 1313, column: 30, scope: !947)
!956 = !DILocation(line: 1314, column: 30, scope: !947)
!957 = !DILocation(line: 1313, column: 18, scope: !947)
!958 = !DILocation(line: 1313, column: 16, scope: !947)
!959 = !DILocation(line: 1315, column: 9, scope: !947)
!960 = !DILocation(line: 1319, column: 24, scope: !947)
!961 = !DILocation(line: 1320, column: 9, scope: !947)
!962 = !DILocation(line: 1323, column: 27, scope: !947)
!963 = !DILocation(line: 1324, column: 9, scope: !947)
!964 = !DILocation(line: 1327, column: 26, scope: !947)
!965 = !DILocation(line: 1328, column: 9, scope: !947)
!966 = distinct !{!966, !944, !967, !931}
!967 = !DILocation(line: 1336, column: 7, scope: !6)
!968 = !DILocation(line: 1330, column: 7, scope: !947)
!969 = !DILocation(line: 1332, column: 7, scope: !947)
!970 = !DILocation(line: 1335, column: 9, scope: !947)
!971 = !DILocation(line: 1338, column: 14, scope: !972)
!972 = distinct !DILexicalBlock(scope: !6, file: !3, line: 1338, column: 7)
!973 = !DILocation(line: 1338, column: 12, scope: !972)
!974 = !DILocation(line: 1338, column: 21, scope: !972)
!975 = !DILocation(line: 1338, column: 7, scope: !6)
!976 = !DILocation(line: 1340, column: 16, scope: !977)
!977 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1340, column: 11)
!978 = distinct !DILexicalBlock(scope: !972, file: !3, line: 1339, column: 5)
!979 = !DILocation(line: 1340, column: 11, scope: !978)
!980 = !DILocation(line: 1341, column: 9, scope: !977)
!981 = !DILocation(line: 1343, column: 9, scope: !977)
!982 = !DILocation(line: 1344, column: 7, scope: !978)
!983 = !DILocation(line: 1347, column: 30, scope: !6)
!984 = !DILocation(line: 1347, column: 22, scope: !6)
!985 = !DILocation(line: 1349, column: 8, scope: !6)
!986 = !DILocation(line: 1350, column: 19, scope: !6)
!987 = !DILocalVariable(name: "format", arg: 1, scope: !988, file: !3, line: 1250, type: !11)
!988 = distinct !DISubprogram(name: "max_out", scope: !3, file: !3, line: 1250, type: !989, scopeLine: 1251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !991)
!989 = !DISubroutineType(types: !990)
!990 = !{!18, !11}
!991 = !{!987, !992, !993, !995, !999}
!992 = !DILocalVariable(name: "percent", scope: !988, file: !3, line: 1252, type: !186)
!993 = !DILocalVariable(name: "f", scope: !994, file: !3, line: 1254, type: !11)
!994 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1254, column: 3)
!995 = !DILocalVariable(name: "flags", scope: !996, file: !3, line: 1261, type: !9)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 1256, column: 7)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 1255, column: 9)
!998 = distinct !DILexicalBlock(scope: !994, file: !3, line: 1254, column: 3)
!999 = !DILocalVariable(name: "maxlen", scope: !988, file: !3, line: 1275, type: !9)
!1000 = !DILocation(line: 0, scope: !988, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 1350, column: 10, scope: !6)
!1002 = !DILocation(line: 0, scope: !994, inlinedAt: !1001)
!1003 = !DILocation(line: 1254, column: 8, scope: !994, inlinedAt: !1001)
!1004 = !DILocation(line: 1254, column: 26, scope: !998, inlinedAt: !1001)
!1005 = !{!798, !798, i64 0}
!1006 = !DILocation(line: 1254, column: 3, scope: !994, inlinedAt: !1001)
!1007 = !DILocation(line: 1271, column: 7, scope: !988, inlinedAt: !1001)
!1008 = !DILocation(line: 1255, column: 23, scope: !997, inlinedAt: !1001)
!1009 = !DILocation(line: 1255, column: 22, scope: !997, inlinedAt: !1001)
!1010 = !DILocation(line: 1255, column: 27, scope: !997, inlinedAt: !1001)
!1011 = !DILocation(line: 1255, column: 9, scope: !998, inlinedAt: !1001)
!1012 = !DILocation(line: 1257, column: 13, scope: !996, inlinedAt: !1001)
!1013 = !DILocation(line: 1258, column: 11, scope: !1014, inlinedAt: !1001)
!1014 = distinct !DILexicalBlock(scope: !996, file: !3, line: 1257, column: 13)
!1015 = !DILocation(line: 1182, column: 15, scope: !1016, inlinedAt: !1027)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 1181, column: 5)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 1180, column: 3)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1180, column: 3)
!1019 = distinct !DISubprogram(name: "get_format_flags", scope: !3, file: !3, line: 1176, type: !1020, scopeLine: 1177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!18, !189, !278}
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DILocalVariable(name: "format", arg: 1, scope: !1019, file: !3, line: 1176, type: !189)
!1024 = !DILocalVariable(name: "flags_ptr", arg: 2, scope: !1019, file: !3, line: 1176, type: !278)
!1025 = !DILocalVariable(name: "flags", scope: !1019, file: !3, line: 1178, type: !9)
!1026 = !DILocalVariable(name: "count", scope: !1018, file: !3, line: 1180, type: !18)
!1027 = distinct !DILocation(line: 1262, column: 14, scope: !996, inlinedAt: !1001)
!1028 = !DILocation(line: 0, scope: !1019, inlinedAt: !1027)
!1029 = !DILocation(line: 0, scope: !1018, inlinedAt: !1027)
!1030 = !DILocation(line: 1182, column: 7, scope: !1016, inlinedAt: !1027)
!1031 = !DILocation(line: 1263, column: 27, scope: !996, inlinedAt: !1001)
!1032 = !DILocalVariable(name: "c", arg: 1, scope: !1033, file: !1034, line: 233, type: !9)
!1033 = distinct !DISubprogram(name: "c_isdigit", scope: !1034, file: !1034, line: 233, type: !1035, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1034 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!186, !9}
!1037 = !{!1032}
!1038 = !DILocation(line: 0, scope: !1033, inlinedAt: !1039)
!1039 = distinct !DILocation(line: 1263, column: 16, scope: !996, inlinedAt: !1001)
!1040 = !DILocation(line: 235, column: 3, scope: !1033, inlinedAt: !1039)
!1041 = !DILocation(line: 1263, column: 9, scope: !996, inlinedAt: !1001)
!1042 = !DILocation(line: 1189, column: 17, scope: !1043, inlinedAt: !1027)
!1043 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 1183, column: 9)
!1044 = !DILocation(line: 1190, column: 11, scope: !1043, inlinedAt: !1027)
!1045 = !DILocation(line: 1193, column: 17, scope: !1043, inlinedAt: !1027)
!1046 = !DILocation(line: 1194, column: 11, scope: !1043, inlinedAt: !1027)
!1047 = !DILocation(line: 1180, column: 32, scope: !1017, inlinedAt: !1027)
!1048 = !DILocation(line: 1180, column: 3, scope: !1017, inlinedAt: !1027)
!1049 = distinct !{!1049, !1050, !1051}
!1050 = !DILocation(line: 1180, column: 3, scope: !1018, inlinedAt: !1027)
!1051 = !DILocation(line: 1200, column: 5, scope: !1018, inlinedAt: !1027)
!1052 = !DILocation(line: 1264, column: 12, scope: !996, inlinedAt: !1001)
!1053 = distinct !{!1053, !1041, !1052, !931}
!1054 = !DILocation(line: 0, scope: !996, inlinedAt: !1001)
!1055 = !DILocation(line: 1265, column: 16, scope: !1056, inlinedAt: !1001)
!1056 = distinct !DILexicalBlock(scope: !996, file: !3, line: 1265, column: 13)
!1057 = !DILocation(line: 1265, column: 13, scope: !996, inlinedAt: !1001)
!1058 = !DILocation(line: 1266, column: 30, scope: !1056, inlinedAt: !1001)
!1059 = !DILocation(line: 1266, column: 29, scope: !1056, inlinedAt: !1001)
!1060 = !DILocation(line: 0, scope: !1033, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 1266, column: 18, scope: !1056, inlinedAt: !1001)
!1062 = !DILocation(line: 235, column: 3, scope: !1033, inlinedAt: !1061)
!1063 = !DILocation(line: 1266, column: 11, scope: !1056, inlinedAt: !1001)
!1064 = distinct !{!1064, !1063, !1065, !931}
!1065 = !DILocation(line: 1267, column: 13, scope: !1056, inlinedAt: !1001)
!1066 = !DILocation(line: 1209, column: 22, scope: !1067, inlinedAt: !1075)
!1067 = distinct !DISubprogram(name: "check_format_conv_type", scope: !3, file: !3, line: 1207, type: !1068, scopeLine: 1208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !11, !9}
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DILocalVariable(name: "format", arg: 1, scope: !1067, file: !3, line: 1207, type: !11)
!1072 = !DILocalVariable(name: "flags", arg: 2, scope: !1067, file: !3, line: 1207, type: !9)
!1073 = !DILocalVariable(name: "ch", scope: !1067, file: !3, line: 1209, type: !191)
!1074 = !DILocalVariable(name: "compatible_flags", scope: !1067, file: !3, line: 1210, type: !9)
!1075 = distinct !DILocation(line: 1268, column: 9, scope: !996, inlinedAt: !1001)
