; ModuleID = 'src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.calendar = type { i32 (%struct.calendar_date*, i32, i32, i32)*, i8*, i32 }
%struct.calendar_date = type { i32, i32, i32, %struct.infomap* }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { i8*, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

!425 = !DIEnumerator(name: "_ISspace", value: 8192)
!426 = !DIEnumerator(name: "_ISprint", value: 16384)
!427 = !DIEnumerator(name: "_ISgraph", value: 32768)
!428 = !DIEnumerator(name: "_ISblank", value: 1)
!429 = !DIEnumerator(name: "_IScntrl", value: 2)
!430 = !DIEnumerator(name: "_ISpunct", value: 4)
!431 = !DIEnumerator(name: "_ISalnum", value: 8)
!432 = !{!433, !435, !437, !438, !439, !440, !443, !445}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!438 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!439 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !441, line: 46, baseType: !442)
!441 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!442 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!445 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!446 = !{!447, !540, !545, !547, !0, !630, !644, !649, !655}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !449, file: !3, line: 517, type: !536, isLocal: true, isDefinition: true)
!449 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 474, type: !450, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !453)
!450 = !DISubroutineType(types: !451)
!451 = !{!438, !438, !452}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!453 = !{!454, !455, !456, !457, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !474, !475, !476, !477, !478, !483, !484, !487, !497, !533}
!454 = !DILocalVariable(name: "argc", arg: 1, scope: !449, file: !3, line: 474, type: !438)
!455 = !DILocalVariable(name: "argv", arg: 2, scope: !449, file: !3, line: 474, type: !452)
!456 = !DILocalVariable(name: "datestr", scope: !449, file: !3, line: 476, type: !443)
!457 = !DILocalVariable(name: "set_datestr", scope: !449, file: !3, line: 477, type: !443)
!458 = !DILocalVariable(name: "set_date", scope: !449, file: !3, line: 478, type: !459)
!459 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!460 = !DILocalVariable(name: "format", scope: !449, file: !3, line: 479, type: !443)
!461 = !DILocalVariable(name: "format_in_c_locale", scope: !449, file: !3, line: 480, type: !459)
!462 = !DILocalVariable(name: "get_resolution", scope: !449, file: !3, line: 481, type: !459)
!463 = !DILocalVariable(name: "batch_file", scope: !449, file: !3, line: 482, type: !435)
!464 = !DILocalVariable(name: "reference", scope: !449, file: !3, line: 483, type: !435)
!465 = !DILocalVariable(name: "discarded_datestr", scope: !449, file: !3, line: 484, type: !459)
!466 = !DILocalVariable(name: "discarded_set_datestr", scope: !449, file: !3, line: 485, type: !459)
!467 = !DILocalVariable(name: "optc", scope: !449, file: !3, line: 495, type: !438)
!468 = !DILocalVariable(name: "i", scope: !469, file: !3, line: 523, type: !5)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 516, column: 11)
!470 = distinct !DILexicalBlock(scope: !471, file: !3, line: 500, column: 9)
!471 = distinct !DILexicalBlock(scope: !449, file: !3, line: 498, column: 5)
!472 = !DILocalVariable(name: "i", scope: !473, file: !3, line: 540, type: !5)
!473 = distinct !DILexicalBlock(scope: !470, file: !3, line: 531, column: 11)
!474 = !DILocalVariable(name: "option_specified_date", scope: !449, file: !3, line: 576, type: !438)
!475 = !DILocalVariable(name: "format_copy", scope: !449, file: !3, line: 644, type: !435)
!476 = !DILocalVariable(name: "format_res", scope: !449, file: !3, line: 645, type: !443)
!477 = !DILocalVariable(name: "tzstring", scope: !449, file: !3, line: 646, type: !443)
!478 = !DILocalVariable(name: "tz", scope: !449, file: !3, line: 647, type: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !480, line: 1039, baseType: !481)
!480 = !DIFile(filename: "./lib/time.h", directory: "/src")
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !480, line: 1039, flags: DIFlagFwdDecl)
!483 = !DILocalVariable(name: "ok", scope: !449, file: !3, line: 649, type: !459)
!484 = !DILocalVariable(name: "valid_date", scope: !485, file: !3, line: 655, type: !459)
!485 = distinct !DILexicalBlock(scope: !486, file: !3, line: 654, column: 5)
!486 = distinct !DILexicalBlock(scope: !449, file: !3, line: 650, column: 7)
!487 = !DILocalVariable(name: "when", scope: !485, file: !3, line: 656, type: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !489, line: 11, size: 128, elements: !490)
!489 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!490 = !{!491, !495}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !488, file: !489, line: 16, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !493, line: 160, baseType: !494)
!493 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!494 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !488, file: !489, line: 21, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !493, line: 197, baseType: !494)
!497 = !DILocalVariable(name: "refstats", scope: !498, file: !3, line: 683, type: !502)
!498 = distinct !DILexicalBlock(scope: !499, file: !3, line: 682, column: 13)
!499 = distinct !DILexicalBlock(scope: !500, file: !3, line: 681, column: 15)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 679, column: 9)
!501 = distinct !DILexicalBlock(scope: !485, file: !3, line: 658, column: 11)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !503, line: 44, size: 1024, elements: !504)
!503 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!504 = !{!505, !507, !509, !511, !513, !515, !517, !518, !519, !521, !523, !524, !526, !527, !528, !529}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !502, file: !503, line: 46, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !493, line: 145, baseType: !442)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !502, file: !503, line: 47, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !493, line: 148, baseType: !442)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !502, file: !503, line: 48, baseType: !510, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !493, line: 150, baseType: !6)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !502, file: !503, line: 49, baseType: !512, size: 32, offset: 160)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !493, line: 151, baseType: !6)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !502, file: !503, line: 50, baseType: !514, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !493, line: 146, baseType: !6)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !502, file: !503, line: 51, baseType: !516, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !493, line: 147, baseType: !6)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !502, file: !503, line: 52, baseType: !506, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !502, file: !503, line: 53, baseType: !506, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !502, file: !503, line: 54, baseType: !520, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !493, line: 152, baseType: !494)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !502, file: !503, line: 55, baseType: !522, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !493, line: 175, baseType: !438)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !502, file: !503, line: 56, baseType: !438, size: 32, offset: 480)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !502, file: !503, line: 57, baseType: !525, size: 64, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !493, line: 180, baseType: !494)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !502, file: !503, line: 65, baseType: !488, size: 128, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !502, file: !503, line: 66, baseType: !488, size: 128, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !502, file: !503, line: 67, baseType: !488, size: 128, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !502, file: !503, line: 79, baseType: !530, size: 64, offset: 960)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 64, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 2)
!533 = !DILocalVariable(name: "res", scope: !534, file: !3, line: 690, type: !494)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 689, column: 13)
!535 = distinct !DILexicalBlock(scope: !499, file: !3, line: 688, column: 20)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 768, elements: !537)
!537 = !{!538, !539}
!538 = !DISubrange(count: 3)
!539 = !DISubrange(count: 32)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !449, file: !3, line: 532, type: !542, isLocal: true, isDefinition: true)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1280, elements: !543)
!543 = !{!544, !539}
!544 = !DISubrange(count: 5)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 108, type: !6, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !549, file: !550, line: 575, type: !438, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "oputs_", scope: !550, file: !550, line: 573, type: !551, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!550 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!551 = !DISubroutineType(types: !552)
!552 = !{null, !443, !443}
!553 = !{!554, !555, !556, !559, !560, !561, !562, !566, !567, !568, !569, !571, !624, !625, !626, !628, !629}
!554 = !DILocalVariable(name: "program", arg: 1, scope: !549, file: !550, line: 573, type: !443)
!555 = !DILocalVariable(name: "option", arg: 2, scope: !549, file: !550, line: 573, type: !443)
!556 = !DILocalVariable(name: "term", scope: !557, file: !550, line: 585, type: !443)
!557 = distinct !DILexicalBlock(scope: !558, file: !550, line: 582, column: 5)
!558 = distinct !DILexicalBlock(scope: !549, file: !550, line: 581, column: 7)
!559 = !DILocalVariable(name: "double_space", scope: !549, file: !550, line: 594, type: !459)
!560 = !DILocalVariable(name: "first_word", scope: !549, file: !550, line: 595, type: !443)
!561 = !DILocalVariable(name: "option_text", scope: !549, file: !550, line: 596, type: !443)
!562 = !DILocalVariable(name: "s", scope: !563, file: !550, line: 608, type: !443)
!563 = distinct !DILexicalBlock(scope: !564, file: !550, line: 605, column: 5)
!564 = distinct !DILexicalBlock(scope: !565, file: !550, line: 604, column: 12)
!565 = distinct !DILexicalBlock(scope: !549, file: !550, line: 597, column: 7)
!566 = !DILocalVariable(name: "spaces", scope: !563, file: !550, line: 609, type: !440)
!567 = !DILocalVariable(name: "anchor_len", scope: !549, file: !550, line: 620, type: !440)
!568 = !DILocalVariable(name: "desc_text", scope: !549, file: !550, line: 625, type: !443)
!569 = !DILocalVariable(name: "__ptr", scope: !570, file: !550, line: 644, type: !443)
!570 = distinct !DILexicalBlock(scope: !549, file: !550, line: 644, column: 3)
!571 = !DILocalVariable(name: "__stream", scope: !570, file: !550, line: 644, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !574, line: 7, baseType: !575)
!574 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !576, line: 49, size: 1728, elements: !577)
!576 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !593, !595, !596, !597, !598, !599, !601, !605, !608, !610, !613, !616, !617, !618, !619, !620}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !575, file: !576, line: 51, baseType: !438, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !575, file: !576, line: 54, baseType: !435, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !575, file: !576, line: 55, baseType: !435, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !575, file: !576, line: 56, baseType: !435, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !575, file: !576, line: 57, baseType: !435, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !575, file: !576, line: 58, baseType: !435, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !575, file: !576, line: 59, baseType: !435, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !575, file: !576, line: 60, baseType: !435, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !575, file: !576, line: 61, baseType: !435, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !575, file: !576, line: 64, baseType: !435, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !575, file: !576, line: 65, baseType: !435, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !575, file: !576, line: 66, baseType: !435, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !575, file: !576, line: 68, baseType: !591, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !576, line: 36, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !575, file: !576, line: 70, baseType: !594, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !575, file: !576, line: 72, baseType: !438, size: 32, offset: 896)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !575, file: !576, line: 73, baseType: !438, size: 32, offset: 928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !575, file: !576, line: 74, baseType: !520, size: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !575, file: !576, line: 77, baseType: !439, size: 16, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !575, file: !576, line: 78, baseType: !600, size: 8, offset: 1040)
!600 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !575, file: !576, line: 79, baseType: !602, size: 8, offset: 1048)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 8, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 1)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !575, file: !576, line: 81, baseType: !606, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !576, line: 43, baseType: null)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !575, file: !576, line: 89, baseType: !609, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !493, line: 153, baseType: !494)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !575, file: !576, line: 91, baseType: !611, size: 64, offset: 1216)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !576, line: 37, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !575, file: !576, line: 92, baseType: !614, size: 64, offset: 1280)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !576, line: 38, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !575, file: !576, line: 93, baseType: !594, size: 64, offset: 1344)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !575, file: !576, line: 94, baseType: !437, size: 64, offset: 1408)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !575, file: !576, line: 95, baseType: !440, size: 64, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !575, file: !576, line: 96, baseType: !438, size: 32, offset: 1536)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !575, file: !576, line: 98, baseType: !621, size: 160, offset: 1568)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 160, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 20)
!624 = !DILocalVariable(name: "__cnt", scope: !570, file: !550, line: 644, type: !440)
!625 = !DILocalVariable(name: "url_program", scope: !549, file: !550, line: 648, type: !443)
!626 = !DILocalVariable(name: "__ptr", scope: !627, file: !550, line: 686, type: !443)
!627 = distinct !DILexicalBlock(scope: !549, file: !550, line: 686, column: 3)
!628 = !DILocalVariable(name: "__stream", scope: !627, file: !550, line: 686, type: !572)
!629 = !DILocalVariable(name: "__cnt", scope: !627, file: !550, line: 686, type: !440)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 86, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 4352, elements: !642)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !635, line: 50, size: 256, elements: !636)
!635 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!636 = !{!637, !638, !639, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !634, file: !635, line: 52, baseType: !443, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !634, file: !635, line: 55, baseType: !438, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !634, file: !635, line: 56, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !634, file: !635, line: 57, baseType: !438, size: 32, offset: 192)
!642 = !{!643}
!643 = !DISubrange(count: 17)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 65, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 160, elements: !648)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!648 = !{!544}
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 58, type: !651, isLocal: true, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 384, elements: !653)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!653 = !{!654}
!654 = !DISubrange(count: 6)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 73, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 200, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 25)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 112, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 14)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "Version", scope: !665, file: !666, line: 3, type: !443, isLocal: false, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !667, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!667 = !{!663}
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !670, file: !671, line: 65, type: !675, isLocal: false, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !672, retainedTypes: !673, globals: !674, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!672 = !{!399}
!673 = !{!437, !443, !445}
!674 = !{!668}
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !676, line: 69, baseType: !677)
!676 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{null}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "file_name", scope: !682, file: !683, line: 45, type: !443, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !684, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!684 = !{!680, !685}
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !682, file: !683, line: 55, type: !459, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !689, file: !690, line: 66, type: !677, isLocal: false, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, globals: !692, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!691 = !{!437, !445}
!692 = !{!693, !719, !687, !721, !723}
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "old_file_name", scope: !695, file: !690, line: 304, type: !443, isLocal: true, isDefinition: true)
!695 = distinct !DISubprogram(name: "verror_at_line", scope: !690, file: !690, line: 298, type: !696, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !689, retainedNodes: !712)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !438, !438, !443, !6, !443, !698}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !699, line: 52, baseType: !700)
!699 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !701, line: 32, baseType: !702)
!701 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !703, baseType: !704)
!703 = !DIFile(filename: "lib/error.c", directory: "/src")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !705, size: 256, elements: !706)
!705 = !DINamespace(name: "std", scope: null)
!706 = !{!707, !708, !709, !710, !711}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !704, file: !703, baseType: !437, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !704, file: !703, baseType: !437, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !704, file: !703, baseType: !437, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !704, file: !703, baseType: !438, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !704, file: !703, baseType: !438, size: 32, offset: 224)
!712 = !{!713, !714, !715, !716, !717, !718}
!713 = !DILocalVariable(name: "status", arg: 1, scope: !695, file: !690, line: 298, type: !438)
!714 = !DILocalVariable(name: "errnum", arg: 2, scope: !695, file: !690, line: 298, type: !438)
!715 = !DILocalVariable(name: "file_name", arg: 3, scope: !695, file: !690, line: 298, type: !443)
!716 = !DILocalVariable(name: "line_number", arg: 4, scope: !695, file: !690, line: 298, type: !6)
!717 = !DILocalVariable(name: "message", arg: 5, scope: !695, file: !690, line: 298, type: !443)
!718 = !DILocalVariable(name: "args", arg: 6, scope: !695, file: !690, line: 298, type: !698)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "old_line_number", scope: !695, file: !690, line: 305, type: !6, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "error_message_count", scope: !689, file: !690, line: 69, type: !6, isLocal: false, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !689, file: !690, line: 295, type: !438, isLocal: false, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !727, file: !753, line: 75, type: !766, isLocal: true, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !729, retainedTypes: !738, globals: !750, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!729 = !{!730}
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !731, line: 163, baseType: !6, size: 32, elements: !732)
!731 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!732 = !{!733, !734, !735, !736, !737}
!733 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!734 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!735 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!736 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!737 = !DIEnumerator(name: "NO_PAD", value: 4)
!738 = !{!437, !459, !6, !494, !442, !438, !445, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !480, line: 1039, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !742, line: 24, size: 128, elements: !743)
!742 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !742, line: 28, baseType: !740, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !741, file: !742, line: 33, baseType: !436, size: 8, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !741, file: !742, line: 45, baseType: !747, offset: 72)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: -1)
!750 = !{!725, !751, !763, !783, !788, !791}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !727, file: !753, line: 21, type: !754, isLocal: true, isDefinition: true)
!753 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 1920, elements: !761)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !757, line: 19, size: 128, elements: !758)
!757 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !756, file: !757, line: 21, baseType: !443, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !756, file: !757, line: 22, baseType: !443, size: 64, offset: 64)
!761 = !{!762}
!762 = !DISubrange(count: 15)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !727, file: !765, line: 131, type: !766, isLocal: true, isDefinition: true)
!765 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !757, line: 33, size: 192, elements: !768)
!768 = !{!769, !781, !782}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !767, file: !757, line: 39, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!438, !773, !438, !438, !438}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !757, line: 25, size: 192, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !774, file: !757, line: 27, baseType: !438, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !774, file: !757, line: 28, baseType: !438, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !774, file: !757, line: 29, baseType: !438, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !774, file: !757, line: 30, baseType: !780, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !767, file: !757, line: 42, baseType: !443, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !767, file: !757, line: 44, baseType: !6, size: 32, offset: 128)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !727, file: !765, line: 37, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 1536, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 12)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !727, file: !790, line: 76, type: !766, isLocal: true, isDefinition: true)
!790 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !727, file: !790, line: 21, type: !793, isLocal: true, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 1664, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 13)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "yyval_default", scope: !798, file: !799, line: 1600, type: !1128, isLocal: true, isDefinition: true)
!798 = distinct !DISubprogram(name: "yyparse", scope: !799, file: !799, line: 1591, type: !800, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !1220)
!799 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!800 = !DISubroutineType(types: !801)
!801 = !{!438, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !804, line: 252, baseType: !805)
!804 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 184, size: 2304, elements: !806)
!806 = !{!807, !808, !812, !813, !814, !815, !816, !826, !827, !828, !829, !830, !835, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !805, file: !804, line: 187, baseType: !443, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !805, file: !804, line: 190, baseType: !809, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !810, line: 101, baseType: !811)
!810 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !493, line: 72, baseType: !494)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !805, file: !804, line: 193, baseType: !438, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !805, file: !804, line: 196, baseType: !438, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !805, file: !804, line: 199, baseType: !438, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !805, file: !804, line: 202, baseType: !438, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !805, file: !804, line: 205, baseType: !817, size: 192, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !804, line: 143, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 138, size: 192, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !818, file: !804, line: 140, baseType: !459, size: 8)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !818, file: !804, line: 141, baseType: !809, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !818, file: !804, line: 142, baseType: !823, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !824, line: 130, baseType: !825)
!824 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !441, line: 35, baseType: !494)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !805, file: !804, line: 206, baseType: !809, size: 64, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !805, file: !804, line: 207, baseType: !809, size: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !805, file: !804, line: 208, baseType: !809, size: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !805, file: !804, line: 209, baseType: !809, size: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !805, file: !804, line: 210, baseType: !831, size: 128, offset: 704)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !489, line: 11, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !831, file: !489, line: 16, baseType: !492, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !831, file: !489, line: 21, baseType: !496, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !805, file: !804, line: 213, baseType: !836, size: 448, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !804, line: 175, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 165, size: 448, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !837, file: !804, line: 168, baseType: !809, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !837, file: !804, line: 169, baseType: !809, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !837, file: !804, line: 170, baseType: !809, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !837, file: !804, line: 171, baseType: !809, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !837, file: !804, line: 172, baseType: !809, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !837, file: !804, line: 173, baseType: !809, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !837, file: !804, line: 174, baseType: !438, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !805, file: !804, line: 216, baseType: !459, size: 8, offset: 1280)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !805, file: !804, line: 217, baseType: !459, size: 8, offset: 1288)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !805, file: !804, line: 218, baseType: !823, size: 64, offset: 1344)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !805, file: !804, line: 219, baseType: !823, size: 64, offset: 1408)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !805, file: !804, line: 220, baseType: !823, size: 64, offset: 1472)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !805, file: !804, line: 221, baseType: !823, size: 64, offset: 1536)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !805, file: !804, line: 222, baseType: !823, size: 64, offset: 1600)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !805, file: !804, line: 223, baseType: !823, size: 64, offset: 1664)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !805, file: !804, line: 224, baseType: !823, size: 64, offset: 1728)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !805, file: !804, line: 225, baseType: !459, size: 8, offset: 1792)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !805, file: !804, line: 227, baseType: !459, size: 8, offset: 1800)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !805, file: !804, line: 231, baseType: !459, size: 8, offset: 1808)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !805, file: !804, line: 235, baseType: !459, size: 8, offset: 1816)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !805, file: !804, line: 236, baseType: !459, size: 8, offset: 1824)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !805, file: !804, line: 237, baseType: !459, size: 8, offset: 1832)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !805, file: !804, line: 238, baseType: !459, size: 8, offset: 1840)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !805, file: !804, line: 239, baseType: !459, size: 8, offset: 1848)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !805, file: !804, line: 240, baseType: !459, size: 8, offset: 1856)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !805, file: !804, line: 243, baseType: !459, size: 8, offset: 1864)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !805, file: !804, line: 246, baseType: !866, size: 384, offset: 1920)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 384, elements: !873)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !804, line: 151, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 146, size: 128, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !804, line: 148, baseType: !443, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !804, line: 149, baseType: !438, size: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !868, file: !804, line: 150, baseType: !438, size: 32, offset: 96)
!873 = !{!538}
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !876, retainedTypes: !1120, globals: !1136, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!876 = !{!877, !937, !964, !969, !973, !1117}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !799, line: 734, baseType: !438, size: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!879 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!880 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!881 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!882 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!883 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!884 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!885 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!886 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!887 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!888 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!889 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!890 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!891 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!892 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!893 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!894 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!895 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!896 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!897 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!898 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!899 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!900 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!901 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!902 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!903 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!904 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!905 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!906 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!907 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!908 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!909 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!910 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!911 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!912 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!913 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!914 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!915 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!916 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!917 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!918 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!919 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!920 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!921 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!922 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!923 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!924 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!925 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!926 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!927 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!928 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!929 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!930 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!931 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!932 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!933 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!934 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!935 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!936 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !799, line: 676, baseType: !438, size: 32, elements: !938)
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!939 = !DIEnumerator(name: "YYEMPTY", value: -2)
!940 = !DIEnumerator(name: "YYEOF", value: 0)
!941 = !DIEnumerator(name: "YYerror", value: 256)
!942 = !DIEnumerator(name: "YYUNDEF", value: 257)
!943 = !DIEnumerator(name: "tAGO", value: 258)
!944 = !DIEnumerator(name: "tDST", value: 259)
!945 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!946 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!947 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!948 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!949 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!950 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!951 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!952 = !DIEnumerator(name: "tDAY", value: 267)
!953 = !DIEnumerator(name: "tDAYZONE", value: 268)
!954 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!955 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!956 = !DIEnumerator(name: "tMONTH", value: 271)
!957 = !DIEnumerator(name: "tORDINAL", value: 272)
!958 = !DIEnumerator(name: "tZONE", value: 273)
!959 = !DIEnumerator(name: "tSNUMBER", value: 274)
!960 = !DIEnumerator(name: "tUNUMBER", value: 275)
!961 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!962 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!963 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 154, baseType: !6, size: 32, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIEnumerator(name: "MERam", value: 0)
!967 = !DIEnumerator(name: "MERpm", value: 1)
!968 = !DIEnumerator(name: "MER24", value: 2)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 162, baseType: !6, size: 32, elements: !970)
!970 = !{!971, !972}
!971 = !DIEnumerator(name: "BILLION", value: 1000000000)
!972 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !974, file: !804, line: 1781, baseType: !6, size: 32, elements: !1115)
!974 = distinct !DISubprogram(name: "parse_datetime_body", scope: !804, file: !804, line: 1767, type: !975, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !980)
!975 = !DISubroutineType(types: !976)
!976 = !{!459, !977, !443, !978, !6, !479, !443}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !1002, !1003, !1007, !1011, !1012, !1013, !1014, !1015, !1016, !1019, !1020, !1021, !1022, !1024, !1027, !1028, !1029, !1035, !1036, !1037, !1038, !1039, !1041, !1044, !1045, !1052, !1055, !1056, !1062, !1063, !1064, !1067, !1068, !1071, !1072, !1073, !1079, !1082, !1083, !1084, !1085, !1088, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1102, !1103, !1106, !1107, !1108, !1109, !1110, !1113, !1114}
!981 = !DILocalVariable(name: "result", arg: 1, scope: !974, file: !804, line: 1767, type: !977)
!982 = !DILocalVariable(name: "p", arg: 2, scope: !974, file: !804, line: 1767, type: !443)
!983 = !DILocalVariable(name: "now", arg: 3, scope: !974, file: !804, line: 1768, type: !978)
!984 = !DILocalVariable(name: "flags", arg: 4, scope: !974, file: !804, line: 1768, type: !6)
!985 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !974, file: !804, line: 1769, type: !479)
!986 = !DILocalVariable(name: "tzstring", arg: 6, scope: !974, file: !804, line: 1769, type: !443)
!987 = !DILocalVariable(name: "tm", scope: !974, file: !804, line: 1771, type: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !989, line: 7, size: 448, elements: !990)
!989 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !988, file: !989, line: 9, baseType: !438, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !988, file: !989, line: 10, baseType: !438, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !988, file: !989, line: 11, baseType: !438, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !988, file: !989, line: 12, baseType: !438, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !988, file: !989, line: 13, baseType: !438, size: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !988, file: !989, line: 14, baseType: !438, size: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !988, file: !989, line: 15, baseType: !438, size: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !988, file: !989, line: 16, baseType: !438, size: 32, offset: 224)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !988, file: !989, line: 17, baseType: !438, size: 32, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !988, file: !989, line: 20, baseType: !494, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !988, file: !989, line: 21, baseType: !443, size: 64, offset: 384)
!1002 = !DILocalVariable(name: "tm0", scope: !974, file: !804, line: 1772, type: !988)
!1003 = !DILocalVariable(name: "time_zone_buf", scope: !974, file: !804, line: 1773, type: !1004)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 216, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 27)
!1007 = !DILocalVariable(name: "dbg_tm", scope: !974, file: !804, line: 1774, type: !1008)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 800, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 100)
!1011 = !DILocalVariable(name: "ok", scope: !974, file: !804, line: 1775, type: !459)
!1012 = !DILocalVariable(name: "input_sentinel", scope: !974, file: !804, line: 1776, type: !443)
!1013 = !DILocalVariable(name: "tz1alloc", scope: !974, file: !804, line: 1777, type: !435)
!1014 = !DILocalVariable(name: "tz1buf", scope: !974, file: !804, line: 1782, type: !1008)
!1015 = !DILocalVariable(name: "gettime_buffer", scope: !974, file: !804, line: 1784, type: !831)
!1016 = !DILocalVariable(name: "Start", scope: !974, file: !804, line: 1791, type: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1018, line: 10, baseType: !492)
!1018 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!1019 = !DILocalVariable(name: "Start_ns", scope: !974, file: !804, line: 1792, type: !438)
!1020 = !DILocalVariable(name: "c", scope: !974, file: !804, line: 1794, type: !445)
!1021 = !DILocalVariable(name: "tz", scope: !974, file: !804, line: 1798, type: !479)
!1022 = !DILocalVariable(name: "rel_time_0", scope: !974, file: !804, line: 1803, type: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!1024 = !DILocalVariable(name: "tzbase", scope: !1025, file: !804, line: 1807, type: !443)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !804, line: 1806, column: 5)
!1026 = distinct !DILexicalBlock(scope: !974, file: !804, line: 1805, column: 7)
!1027 = !DILocalVariable(name: "tzsize", scope: !1025, file: !804, line: 1808, type: !823)
!1028 = !DILocalVariable(name: "s", scope: !1025, file: !804, line: 1809, type: !443)
!1029 = !DILocalVariable(name: "tz1", scope: !1030, file: !804, line: 1820, type: !479)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !804, line: 1819, column: 11)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !804, line: 1818, column: 18)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !804, line: 1812, column: 13)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !804, line: 1811, column: 7)
!1034 = distinct !DILexicalBlock(scope: !1025, file: !804, line: 1811, column: 7)
!1035 = !DILocalVariable(name: "tz1string", scope: !1030, file: !804, line: 1821, type: !435)
!1036 = !DILocalVariable(name: "z", scope: !1030, file: !804, line: 1822, type: !435)
!1037 = !DILocalVariable(name: "tmp", scope: !974, file: !804, line: 1848, type: !988)
!1038 = !DILocalVariable(name: "pc", scope: !974, file: !804, line: 1858, type: !803)
!1039 = !DILocalVariable(name: "quarter", scope: !1040, file: !804, line: 1903, type: !438)
!1040 = distinct !DILexicalBlock(scope: !974, file: !804, line: 1903, column: 3)
!1041 = !DILocalVariable(name: "probe", scope: !1042, file: !804, line: 1905, type: !1017)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !804, line: 1904, column: 5)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !804, line: 1903, column: 3)
!1044 = !DILocalVariable(name: "probe_tm", scope: !1042, file: !804, line: 1908, type: !988)
!1045 = !DILocalVariable(name: "mrd", scope: !1046, file: !804, line: 2015, type: !443)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !804, line: 2014, column: 13)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !804, line: 2013, column: 15)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !804, line: 2011, column: 9)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2010, column: 11)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !804, line: 1982, column: 5)
!1051 = distinct !DILexicalBlock(scope: !974, file: !804, line: 1979, column: 7)
!1052 = !DILocalVariable(name: "repaired", scope: !1053, file: !804, line: 2061, type: !459)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !804, line: 2060, column: 9)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2059, column: 11)
!1055 = !DILocalVariable(name: "time_zone_seen", scope: !1053, file: !804, line: 2062, type: !459)
!1056 = !DILocalVariable(name: "tz2buf", scope: !1057, file: !804, line: 2075, type: !1059)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !804, line: 2064, column: 13)
!1058 = distinct !DILexicalBlock(scope: !1053, file: !804, line: 2063, column: 15)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 240, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 30)
!1062 = !DILocalVariable(name: "tz2", scope: !1057, file: !804, line: 2078, type: !479)
!1063 = !DILocalVariable(name: "dbg_ord", scope: !1050, file: !804, line: 2105, type: !1008)
!1064 = !DILocalVariable(name: "dayincr", scope: !1065, file: !804, line: 2109, type: !809)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !804, line: 2108, column: 9)
!1066 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2107, column: 11)
!1067 = !DILocalVariable(name: "day_ordinal", scope: !1065, file: !804, line: 2111, type: !809)
!1068 = !DILocalVariable(name: "year", scope: !1069, file: !804, line: 2173, type: !438)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !804, line: 2160, column: 9)
!1070 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2159, column: 11)
!1071 = !DILocalVariable(name: "month", scope: !1069, file: !804, line: 2173, type: !438)
!1072 = !DILocalVariable(name: "day", scope: !1069, file: !804, line: 2173, type: !438)
!1073 = !DILocalVariable(name: "tm_year_buf", scope: !1074, file: !804, line: 2247, type: !1078)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !804, line: 2244, column: 17)
!1075 = distinct !DILexicalBlock(scope: !1076, file: !804, line: 2241, column: 19)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !804, line: 2202, column: 13)
!1077 = distinct !DILexicalBlock(scope: !1069, file: !804, line: 2201, column: 15)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 104, elements: !794)
!1079 = !DILocalVariable(name: "overflow", scope: !1080, file: !804, line: 2262, type: !459)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !804, line: 2261, column: 9)
!1081 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2260, column: 11)
!1082 = !DILocalVariable(name: "utcoff", scope: !1080, file: !804, line: 2264, type: !494)
!1083 = !DILocalVariable(name: "delta", scope: !1080, file: !804, line: 2272, type: !809)
!1084 = !DILocalVariable(name: "t1", scope: !1080, file: !804, line: 2274, type: !1017)
!1085 = !DILocalVariable(name: "Starti", scope: !1086, file: !804, line: 2288, type: !809)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !804, line: 2287, column: 9)
!1087 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2286, column: 11)
!1088 = !DILocalVariable(name: "orig_ns", scope: !1089, file: !804, line: 2303, type: !809)
!1089 = distinct !DILexicalBlock(scope: !1050, file: !804, line: 2302, column: 7)
!1090 = !DILocalVariable(name: "sum_ns", scope: !1089, file: !804, line: 2304, type: !809)
!1091 = !DILocalVariable(name: "normalized_ns", scope: !1089, file: !804, line: 2305, type: !438)
!1092 = !DILocalVariable(name: "d4", scope: !1089, file: !804, line: 2306, type: !438)
!1093 = !DILocalVariable(name: "d1", scope: !1089, file: !804, line: 2307, type: !809)
!1094 = !DILocalVariable(name: "t1", scope: !1089, file: !804, line: 2307, type: !809)
!1095 = !DILocalVariable(name: "d2", scope: !1089, file: !804, line: 2307, type: !809)
!1096 = !DILocalVariable(name: "t2", scope: !1089, file: !804, line: 2307, type: !809)
!1097 = !DILocalVariable(name: "t3", scope: !1089, file: !804, line: 2307, type: !809)
!1098 = !DILocalVariable(name: "t4", scope: !1089, file: !804, line: 2308, type: !1017)
!1099 = !DILocalVariable(name: "t4i", scope: !1100, file: !804, line: 2333, type: !809)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !804, line: 2327, column: 11)
!1101 = distinct !DILexicalBlock(scope: !1089, file: !804, line: 2325, column: 13)
!1102 = !DILocalVariable(name: "lmt", scope: !1100, file: !804, line: 2347, type: !988)
!1103 = !DILocalVariable(name: "sec", scope: !1104, file: !804, line: 2366, type: !809)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !804, line: 2357, column: 5)
!1105 = distinct !DILexicalBlock(scope: !974, file: !804, line: 2356, column: 7)
!1106 = !DILocalVariable(name: "nsec", scope: !1104, file: !804, line: 2367, type: !438)
!1107 = !DILocalVariable(name: "gmt", scope: !1104, file: !804, line: 2371, type: !988)
!1108 = !DILocalVariable(name: "lmt", scope: !1104, file: !804, line: 2371, type: !988)
!1109 = !DILocalVariable(name: "got_utc", scope: !1104, file: !804, line: 2372, type: !459)
!1110 = !DILocalVariable(name: "got_utcoff", scope: !1111, file: !804, line: 2380, type: !459)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !804, line: 2378, column: 9)
!1112 = distinct !DILexicalBlock(scope: !1104, file: !804, line: 2377, column: 11)
!1113 = !DILocalVariable(name: "utcoff", scope: !1111, file: !804, line: 2381, type: !494)
!1114 = !DILabel(scope: !974, name: "fail", file: !804, line: 2400)
!1115 = !{!1116}
!1116 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!1117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 1275, baseType: !6, size: 32, elements: !1118)
!1118 = !{!1119}
!1119 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900)
!1120 = !{!1121, !1123, !442, !494, !1135, !459}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_t", file: !799, line: 910, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !799, line: 822, baseType: !600)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !799, line: 1063, size: 448, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !1124, file: !799, line: 1065, baseType: !1121, size: 8)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !1124, file: !799, line: 1066, baseType: !1128, size: 448)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !799, line: 721, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !799, line: 709, size: 448, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !1129, file: !804, line: 583, baseType: !809, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !1129, file: !804, line: 584, baseType: !817, size: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !1129, file: !804, line: 585, baseType: !831, size: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !1129, file: !804, line: 586, baseType: !836, size: 448)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "yysymbol_kind_t", file: !799, line: 795, baseType: !877)
!1136 = !{!796, !1137, !1143, !1148, !1150, !1152, !1154, !1159, !1172, !1178, !1180, !1185, !1187, !1189, !1193, !1196, !1200, !1205, !1208, !1212, !1217}
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(name: "yypact", scope: !874, file: !799, line: 1238, type: !1139, isLocal: true, isDefinition: true)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 968, elements: !1141)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1141 = !{!1142}
!1142 = !DISubrange(count: 121)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(name: "yytranslate", scope: !874, file: !799, line: 1145, type: !1145, isLocal: true, isDefinition: true)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 2232, elements: !1146)
!1146 = !{!1147}
!1147 = !DISubrange(count: 279)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "yycheck", scope: !874, file: !799, line: 1311, type: !1139, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "yytable", scope: !874, file: !799, line: 1294, type: !1139, isLocal: true, isDefinition: true)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(name: "yydefact", scope: !874, file: !799, line: 1258, type: !1139, isLocal: true, isDefinition: true)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(name: "yyr2", scope: !874, file: !799, line: 1363, type: !1156, isLocal: true, isDefinition: true)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 760, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 95)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !1161, file: !804, line: 351, type: !1169, isLocal: true, isDefinition: true)
!1161 = distinct !DISubprogram(name: "str_days", scope: !804, file: !804, line: 348, type: !1162, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!443, !802, !435, !438}
!1164 = !{!1165, !1166, !1167, !1168}
!1165 = !DILocalVariable(name: "pc", arg: 1, scope: !1161, file: !804, line: 348, type: !802)
!1166 = !DILocalVariable(name: "buffer", arg: 2, scope: !1161, file: !804, line: 348, type: !435)
!1167 = !DILocalVariable(name: "n", arg: 3, scope: !1161, file: !804, line: 348, type: !438)
!1168 = !DILocalVariable(name: "len", scope: !1161, file: !804, line: 378, type: !438)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 1232, elements: !1170)
!1170 = !{!662, !1171}
!1171 = !DISubrange(count: 11)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(name: "days_values", scope: !1161, file: !804, line: 368, type: !1174, isLocal: true, isDefinition: true)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 224, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DISubrange(count: 7)
!1177 = !DISubrange(count: 4)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(name: "yyr1", scope: !874, file: !799, line: 1348, type: !1156, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(name: "yypgoto", scope: !874, file: !799, line: 1276, type: !1182, isLocal: true, isDefinition: true)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 208, elements: !1183)
!1183 = !{!1184}
!1184 = !DISubrange(count: 26)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !874, file: !799, line: 1284, type: !1182, isLocal: true, isDefinition: true)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(name: "yystos", scope: !874, file: !799, line: 1330, type: !1139, isLocal: true, isDefinition: true)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(name: "meridian_table", scope: !874, file: !804, line: 1032, type: !1191, isLocal: true, isDefinition: true)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 640, elements: !648)
!1192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!1193 = !DIGlobalVariableExpression(var: !1194, expr: !DIExpression())
!1194 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !874, file: !804, line: 1046, type: !1195, isLocal: true, isDefinition: true)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 3200, elements: !658)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !874, file: !804, line: 1120, type: !1198, isLocal: true, isDefinition: true)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 512, elements: !1199)
!1199 = !{!1177}
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !874, file: !804, line: 1133, type: !1202, isLocal: true, isDefinition: true)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 6144, elements: !1203)
!1203 = !{!1204}
!1204 = !DISubrange(count: 48)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(name: "dst_table", scope: !874, file: !804, line: 1041, type: !1207, isLocal: true, isDefinition: true)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 128, elements: !603)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(name: "time_units_table", scope: !874, file: !804, line: 1075, type: !1210, isLocal: true, isDefinition: true)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 1408, elements: !1211)
!1211 = !{!1171}
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !874, file: !804, line: 1091, type: !1214, isLocal: true, isDefinition: true)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 2688, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 21)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "military_table", scope: !874, file: !804, line: 1193, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1192, size: 3456, elements: !1005)
!1220 = !{!1221, !1222, !1223, !1224, !1225, !1227, !1228, !1229, !1231, !1233, !1234, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1247, !1249, !1250, !1252, !1254, !1262, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1221 = !DILocalVariable(name: "pc", arg: 1, scope: !798, file: !799, line: 1591, type: !802)
!1222 = !DILocalVariable(name: "yychar", scope: !798, file: !799, line: 1594, type: !438)
!1223 = !DILocalVariable(name: "yylval", scope: !798, file: !799, line: 1601, type: !1128)
!1224 = !DILocalVariable(name: "yynerrs", scope: !798, file: !799, line: 1604, type: !438)
!1225 = !DILocalVariable(name: "yystate", scope: !798, file: !799, line: 1606, type: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_fast_t", file: !799, line: 913, baseType: !438)
!1227 = !DILocalVariable(name: "yyerrstatus", scope: !798, file: !799, line: 1608, type: !438)
!1228 = !DILocalVariable(name: "yystacksize", scope: !798, file: !799, line: 1614, type: !494)
!1229 = !DILocalVariable(name: "yyssa", scope: !798, file: !799, line: 1617, type: !1230)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 160, elements: !622)
!1231 = !DILocalVariable(name: "yyss", scope: !798, file: !799, line: 1618, type: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1233 = !DILocalVariable(name: "yyssp", scope: !798, file: !799, line: 1619, type: !1232)
!1234 = !DILocalVariable(name: "yyvsa", scope: !798, file: !799, line: 1622, type: !1235)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 8960, elements: !622)
!1236 = !DILocalVariable(name: "yyvs", scope: !798, file: !799, line: 1623, type: !1237)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1238 = !DILocalVariable(name: "yyvsp", scope: !798, file: !799, line: 1624, type: !1237)
!1239 = !DILocalVariable(name: "yyn", scope: !798, file: !799, line: 1626, type: !438)
!1240 = !DILocalVariable(name: "yyresult", scope: !798, file: !799, line: 1628, type: !438)
!1241 = !DILocalVariable(name: "yytoken", scope: !798, file: !799, line: 1630, type: !1135)
!1242 = !DILocalVariable(name: "yyval", scope: !798, file: !799, line: 1633, type: !1128)
!1243 = !DILocalVariable(name: "yylen", scope: !798, file: !799, line: 1641, type: !438)
!1244 = !DILocalVariable(name: "yysize", scope: !1245, file: !799, line: 1676, type: !494)
!1245 = distinct !DILexicalBlock(scope: !1246, file: !799, line: 1674, column: 5)
!1246 = distinct !DILexicalBlock(scope: !798, file: !799, line: 1670, column: 7)
!1247 = !DILocalVariable(name: "yyss1", scope: !1248, file: !799, line: 1706, type: !1232)
!1248 = distinct !DILexicalBlock(scope: !1245, file: !799, line: 1705, column: 7)
!1249 = !DILocalVariable(name: "yyptr", scope: !1248, file: !799, line: 1707, type: !1123)
!1250 = !DILocalVariable(name: "yynewbytes", scope: !1251, file: !799, line: 1712, type: !494)
!1251 = distinct !DILexicalBlock(scope: !1248, file: !799, line: 1712, column: 9)
!1252 = !DILocalVariable(name: "yynewbytes", scope: !1253, file: !799, line: 1713, type: !494)
!1253 = distinct !DILexicalBlock(scope: !1248, file: !799, line: 1713, column: 9)
!1254 = !DILocalVariable(name: "digits", scope: !1255, file: !804, line: 830, type: !809)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !804, line: 829, column: 15)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !804, line: 828, column: 17)
!1257 = distinct !DILexicalBlock(scope: !1258, file: !804, line: 827, column: 11)
!1258 = distinct !DILexicalBlock(scope: !1259, file: !804, line: 826, column: 13)
!1259 = distinct !DILexicalBlock(scope: !1260, file: !804, line: 820, column: 7)
!1260 = !DILexicalBlockFile(scope: !1261, file: !804, discriminator: 0)
!1261 = distinct !DILexicalBlock(scope: !798, file: !799, line: 1844, column: 5)
!1262 = !DILocalVariable(name: "yylhs", scope: !1263, file: !799, line: 2500, type: !1264)
!1263 = distinct !DILexicalBlock(scope: !798, file: !799, line: 2499, column: 3)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!1265 = !DILocalVariable(name: "yyi", scope: !1263, file: !799, line: 2501, type: !1264)
!1266 = !DILabel(scope: !798, name: "yynewstate", file: !799, line: 1653)
!1267 = !DILabel(scope: !798, name: "yysetstate", file: !799, line: 1662)
!1268 = !DILabel(scope: !798, name: "yybackup", file: !799, line: 1743)
!1269 = !DILabel(scope: !798, name: "yydefault", file: !799, line: 1817)
!1270 = !DILabel(scope: !798, name: "yyreduce", file: !799, line: 1827)
!1271 = !DILabel(scope: !798, name: "yyerrlab", file: !799, line: 2513)
!1272 = !DILabel(scope: !798, name: "yyerrorlab", file: !799, line: 2551)
!1273 = !DILabel(scope: !798, name: "yyerrlab1", file: !799, line: 2570)
!1274 = !DILabel(scope: !798, name: "yyacceptlab", file: !799, line: 2615)
!1275 = !DILabel(scope: !798, name: "yyabortlab", file: !799, line: 2623)
!1276 = !DILabel(scope: !798, name: "yyexhaustedlab", file: !799, line: 2631)
!1277 = !DILabel(scope: !798, name: "yyreturnlab", file: !799, line: 2640)
!1278 = !DIGlobalVariableExpression(var: !1279, expr: !DIExpression())
!1279 = distinct !DIGlobalVariable(name: "program_name", scope: !1280, file: !1281, line: 31, type: !443, isLocal: false, isDefinition: true)
!1280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1281, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1282, globals: !1283, splitDebugInlining: false, nameTableKind: None)
!1281 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1282 = !{!435}
!1283 = !{!1278}
!1284 = !DIGlobalVariableExpression(var: !1285, expr: !DIExpression())
!1285 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1286, file: !1287, line: 46, type: !1315, isLocal: true, isDefinition: true)
!1286 = distinct !DISubprogram(name: "proper_name_lite", scope: !1287, file: !1287, line: 38, type: !1288, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1290, retainedNodes: !1292)
!1287 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!443, !443, !443}
!1290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1287, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1291, splitDebugInlining: false, nameTableKind: None)
!1291 = !{!1284}
!1292 = !{!1293, !1294, !1295, !1296, !1301}
!1293 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1286, file: !1287, line: 38, type: !443)
!1294 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1286, file: !1287, line: 38, type: !443)
!1295 = !DILocalVariable(name: "translation", scope: !1286, file: !1287, line: 40, type: !443)
!1296 = !DILocalVariable(name: "w", scope: !1286, file: !1287, line: 47, type: !1297)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1298, line: 37, baseType: !1299)
!1298 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !493, line: 57, baseType: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !493, line: 42, baseType: !6)
!1301 = !DILocalVariable(name: "mbs", scope: !1286, file: !1287, line: 48, type: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1303, line: 6, baseType: !1304)
!1303 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1305, line: 21, baseType: !1306)
!1305 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1305, line: 13, size: 64, elements: !1307)
!1307 = !{!1308, !1309}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1306, file: !1305, line: 15, baseType: !438, size: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1306, file: !1305, line: 20, baseType: !1310, size: 32, offset: 32)
!1310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1306, file: !1305, line: 16, size: 32, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1310, file: !1305, line: 18, baseType: !6, size: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1310, file: !1305, line: 19, baseType: !1314, size: 32)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 32, elements: !1199)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 16, elements: !531)
!1316 = !DIGlobalVariableExpression(var: !1317, expr: !DIExpression())
!1317 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1318, file: !1319, line: 76, type: !1387, isLocal: false, isDefinition: true)
!1318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1319, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1320, retainedTypes: !1326, globals: !1327, splitDebugInlining: false, nameTableKind: None)
!1319 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1320 = !{!399, !1321, !417}
!1321 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !400, line: 254, baseType: !6, size: 32, elements: !1322)
!1322 = !{!1323, !1324, !1325}
!1323 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1324 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1325 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1326 = !{!438, !439, !440}
!1327 = !{!1316, !1328, !1334, !1346, !1348, !1353, !1376, !1383, !1385}
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1318, file: !1319, line: 92, type: !1330, isLocal: false, isDefinition: true)
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1331, size: 320, elements: !1332)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!1332 = !{!1333}
!1333 = !DISubrange(count: 10)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1318, file: !1319, line: 1040, type: !1336, isLocal: false, isDefinition: true)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1319, line: 56, size: 448, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1344, !1345}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1336, file: !1319, line: 59, baseType: !399, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1336, file: !1319, line: 62, baseType: !438, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1336, file: !1319, line: 66, baseType: !1341, size: 256, offset: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 8)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1336, file: !1319, line: 69, baseType: !443, size: 64, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1336, file: !1319, line: 72, baseType: !443, size: 64, offset: 384)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1318, file: !1319, line: 107, type: !1336, isLocal: true, isDefinition: true)
!1348 = !DIGlobalVariableExpression(var: !1349, expr: !DIExpression())
!1349 = distinct !DIGlobalVariable(name: "slot0", scope: !1318, file: !1319, line: 831, type: !1350, isLocal: true, isDefinition: true)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 2048, elements: !1351)
!1351 = !{!1352}
!1352 = !DISubrange(count: 256)
!1353 = !DIGlobalVariableExpression(var: !1354, expr: !DIExpression())
!1354 = distinct !DIGlobalVariable(name: "quote", scope: !1355, file: !1319, line: 228, type: !1374, isLocal: true, isDefinition: true)
!1355 = distinct !DISubprogram(name: "gettext_quote", scope: !1319, file: !1319, line: 197, type: !1356, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1318, retainedNodes: !1358)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!443, !443, !399}
!1358 = !{!1359, !1360, !1361, !1362, !1363}
!1359 = !DILocalVariable(name: "msgid", arg: 1, scope: !1355, file: !1319, line: 197, type: !443)
!1360 = !DILocalVariable(name: "s", arg: 2, scope: !1355, file: !1319, line: 197, type: !399)
!1361 = !DILocalVariable(name: "translation", scope: !1355, file: !1319, line: 199, type: !443)
!1362 = !DILocalVariable(name: "w", scope: !1355, file: !1319, line: 229, type: !1297)
!1363 = !DILocalVariable(name: "mbs", scope: !1355, file: !1319, line: 230, type: !1364)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1303, line: 6, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1305, line: 21, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1305, line: 13, size: 64, elements: !1367)
!1367 = !{!1368, !1369}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1366, file: !1305, line: 15, baseType: !438, size: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1366, file: !1305, line: 20, baseType: !1370, size: 32, offset: 32)
!1370 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1366, file: !1305, line: 16, size: 32, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1370, file: !1305, line: 18, baseType: !6, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1370, file: !1305, line: 19, baseType: !1314, size: 32)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 64, elements: !1375)
!1375 = !{!532, !1177}
!1376 = !DIGlobalVariableExpression(var: !1377, expr: !DIExpression())
!1377 = distinct !DIGlobalVariable(name: "slotvec", scope: !1318, file: !1319, line: 834, type: !1378, isLocal: true, isDefinition: true)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1319, line: 823, size: 128, elements: !1380)
!1380 = !{!1381, !1382}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1379, file: !1319, line: 825, baseType: !440, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1379, file: !1319, line: 826, baseType: !435, size: 64, offset: 64)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(name: "nslots", scope: !1318, file: !1319, line: 832, type: !438, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1318, file: !1319, line: 833, type: !1379, isLocal: true, isDefinition: true)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 704, elements: !1211)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1390, file: !1391, line: 26, type: !1393, isLocal: false, isDefinition: true)
!1390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1392, splitDebugInlining: false, nameTableKind: None)
!1391 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1392 = !{!1388}
!1393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 376, elements: !1394)
!1394 = !{!1395}
!1395 = !DISubrange(count: 47)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1398, file: !1399, line: 24, type: !1401, isLocal: false, isDefinition: true)
!1398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1400, splitDebugInlining: false, nameTableKind: None)
!1399 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1400 = !{!1396}
!1401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !438)
!1402 = !DIGlobalVariableExpression(var: !1403, expr: !DIExpression())
!1403 = distinct !DIGlobalVariable(name: "internal_state", scope: !1404, file: !1405, line: 97, type: !1408, isLocal: true, isDefinition: true)
!1404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1406, globals: !1407, splitDebugInlining: false, nameTableKind: None)
!1405 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1406 = !{!437, !440, !445}
!1407 = !{!1402}
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1303, line: 6, baseType: !1409)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1305, line: 21, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1305, line: 13, size: 64, elements: !1411)
!1411 = !{!1412, !1413}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1410, file: !1305, line: 15, baseType: !438, size: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1410, file: !1305, line: 20, baseType: !1414, size: 32, offset: 32)
!1414 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1410, file: !1305, line: 16, size: 32, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1414, file: !1305, line: 18, baseType: !6, size: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1414, file: !1305, line: 19, baseType: !1314, size: 32)
!1418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1419, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1419 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1421 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1423, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1424, splitDebugInlining: false, nameTableKind: None)
!1423 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1424 = !{!437}
!1425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1426 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1424, splitDebugInlining: false, nameTableKind: None)
!1428 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1430 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1432 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!1433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1435, splitDebugInlining: false, nameTableKind: None)
!1434 = !DIFile(filename: "lib/gettime-res.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ff9de4b77620c435613ce6eb2688d9")
!1435 = !{!413}
!1436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1437, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1438, splitDebugInlining: false, nameTableKind: None)
!1437 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!1438 = !{!809}
!1439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1440, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1441, retainedTypes: !1424, splitDebugInlining: false, nameTableKind: None)
!1440 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!1441 = !{!13}
!1442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1444, retainedTypes: !1452, splitDebugInlining: false, nameTableKind: None)
!1443 = !DIFile(filename: "lib/localename-unsafe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "45a37c67528fdbd78dc60a7c85e31bd5")
!1444 = !{!1445}
!1445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "storage", file: !1446, line: 32, baseType: !6, size: 32, elements: !1447)
!1446 = !DIFile(filename: "./lib/getlocalename_l-unsafe.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3acc7f938bbe17299c21ec435f12f28d")
!1447 = !{!1448, !1449, !1450, !1451}
!1448 = !DIEnumerator(name: "STORAGE_INDEFINITE", value: 0)
!1449 = !DIEnumerator(name: "STORAGE_GLOBAL", value: 1)
!1450 = !DIEnumerator(name: "STORAGE_THREAD", value: 2)
!1451 = !DIEnumerator(name: "STORAGE_OBJECT", value: 3)
!1452 = !{!1453, !437}
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !1454, line: 24, baseType: !1455)
!1454 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !1456, line: 41, baseType: !1457)
!1456 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !1456, line: 27, size: 1856, elements: !1459)
!1459 = !{!1460, !1464, !1467, !1469, !1470}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !1458, file: !1456, line: 30, baseType: !1461, size: 832)
!1461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1462, size: 832, elements: !794)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !1456, line: 30, flags: DIFlagFwdDecl)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !1458, file: !1456, line: 33, baseType: !1465, size: 64, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
