; ModuleID = 'src/dd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct.__sigset_t = type { [16 x i64] }
%struct.symbol_value = type { [12 x i8], i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.33 }
%union.anon.33 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!133 = !{!0, !134, !139, !141, !143, !145, !150, !152, !154, !156, !158, !163, !246, !258, !264, !266, !268, !281, !286, !291, !293, !313, !318, !320, !322, !324, !326, !343, !345, !347, !349, !351, !353, !355, !386, !388, !390, !393, !396, !398, !400, !402, !404, !406, !408, !410, !412, !414, !416, !418, !420, !422, !424, !426, !439, !441, !443, !445, !447, !449, !462, !475}
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "start_time", scope: !2, file: !3, line: 185, type: !136, isLocal: true, isDefinition: true)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "xtime_t", file: !137, line: 35, baseType: !138)
!137 = !DIFile(filename: "./lib/xtime.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4a79fefeeaf3a0d8da24abcf9d1ed5d8")
!138 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "next_time", scope: !2, file: !3, line: 188, type: !136, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "input_seekable", scope: !2, file: !3, line: 194, type: !120, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "input_seek_errno", scope: !2, file: !3, line: 198, type: !63, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "input_offset", scope: !2, file: !3, line: 201, type: !147, isLocal: true, isDefinition: true)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !148, line: 85, baseType: !149)
!148 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !121)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "i_nocache", scope: !2, file: !3, line: 234, type: !120, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "o_nocache", scope: !2, file: !3, line: 234, type: !120, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "i_nocache_eof", scope: !2, file: !3, line: 237, type: !120, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "o_nocache_eof", scope: !2, file: !3, line: 237, type: !120, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "trans_table", scope: !2, file: !3, line: 362, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2048, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 256)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !165, file: !98, line: 575, type: !63, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "oputs_", scope: !98, file: !98, line: 573, type: !166, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !168)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !116, !116}
!168 = !{!169, !170, !171, !174, !175, !176, !177, !181, !182, !183, !184, !186, !240, !241, !242, !244, !245}
!169 = !DILocalVariable(name: "program", arg: 1, scope: !165, file: !98, line: 573, type: !116)
!170 = !DILocalVariable(name: "option", arg: 2, scope: !165, file: !98, line: 573, type: !116)
!171 = !DILocalVariable(name: "term", scope: !172, file: !98, line: 585, type: !116)
!172 = distinct !DILexicalBlock(scope: !173, file: !98, line: 582, column: 5)
!173 = distinct !DILexicalBlock(scope: !165, file: !98, line: 581, column: 7)
!174 = !DILocalVariable(name: "double_space", scope: !165, file: !98, line: 594, type: !120)
!175 = !DILocalVariable(name: "first_word", scope: !165, file: !98, line: 595, type: !116)
!176 = !DILocalVariable(name: "option_text", scope: !165, file: !98, line: 596, type: !116)
!177 = !DILocalVariable(name: "s", scope: !178, file: !98, line: 608, type: !116)
!178 = distinct !DILexicalBlock(scope: !179, file: !98, line: 605, column: 5)
!179 = distinct !DILexicalBlock(scope: !180, file: !98, line: 604, column: 12)
!180 = distinct !DILexicalBlock(scope: !165, file: !98, line: 597, column: 7)
!181 = !DILocalVariable(name: "spaces", scope: !178, file: !98, line: 609, type: !123)
!182 = !DILocalVariable(name: "anchor_len", scope: !165, file: !98, line: 620, type: !123)
!183 = !DILocalVariable(name: "desc_text", scope: !165, file: !98, line: 625, type: !116)
!184 = !DILocalVariable(name: "__ptr", scope: !185, file: !98, line: 644, type: !116)
!185 = distinct !DILexicalBlock(scope: !165, file: !98, line: 644, column: 3)
!186 = !DILocalVariable(name: "__stream", scope: !185, file: !98, line: 644, type: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !189, line: 7, baseType: !190)
!189 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !191, line: 49, size: 1728, elements: !192)
!191 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!192 = !{!193, !194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !209, !211, !212, !213, !214, !215, !217, !221, !224, !226, !229, !232, !233, !234, !235, !236}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !190, file: !191, line: 51, baseType: !63, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !190, file: !191, line: 54, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !190, file: !191, line: 55, baseType: !195, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !190, file: !191, line: 56, baseType: !195, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !190, file: !191, line: 57, baseType: !195, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !190, file: !191, line: 58, baseType: !195, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !190, file: !191, line: 59, baseType: !195, size: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !190, file: !191, line: 60, baseType: !195, size: 64, offset: 448)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !190, file: !191, line: 61, baseType: !195, size: 64, offset: 512)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !190, file: !191, line: 64, baseType: !195, size: 64, offset: 576)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !190, file: !191, line: 65, baseType: !195, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !190, file: !191, line: 66, baseType: !195, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !190, file: !191, line: 68, baseType: !207, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !191, line: 36, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !190, file: !191, line: 70, baseType: !210, size: 64, offset: 832)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !190, file: !191, line: 72, baseType: !63, size: 32, offset: 896)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !190, file: !191, line: 73, baseType: !63, size: 32, offset: 928)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !190, file: !191, line: 74, baseType: !149, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !190, file: !191, line: 77, baseType: !122, size: 16, offset: 1024)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !190, file: !191, line: 78, baseType: !216, size: 8, offset: 1040)
!216 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !190, file: !191, line: 79, baseType: !218, size: 8, offset: 1048)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 1)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !190, file: !191, line: 81, baseType: !222, size: 64, offset: 1088)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !191, line: 43, baseType: null)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !190, file: !191, line: 89, baseType: !225, size: 64, offset: 1152)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !121)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !190, file: !191, line: 91, baseType: !227, size: 64, offset: 1216)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !191, line: 37, flags: DIFlagFwdDecl)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !190, file: !191, line: 92, baseType: !230, size: 64, offset: 1280)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !191, line: 38, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !190, file: !191, line: 93, baseType: !210, size: 64, offset: 1344)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !190, file: !191, line: 94, baseType: !119, size: 64, offset: 1408)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !190, file: !191, line: 95, baseType: !123, size: 64, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !190, file: !191, line: 96, baseType: !63, size: 32, offset: 1536)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !190, file: !191, line: 98, baseType: !237, size: 160, offset: 1568)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 160, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 20)
!240 = !DILocalVariable(name: "__cnt", scope: !185, file: !98, line: 644, type: !123)
!241 = !DILocalVariable(name: "url_program", scope: !165, file: !98, line: 648, type: !116)
!242 = !DILocalVariable(name: "__ptr", scope: !243, file: !98, line: 686, type: !116)
!243 = distinct !DILexicalBlock(scope: !165, file: !98, line: 686, column: 3)
!244 = !DILocalVariable(name: "__stream", scope: !243, file: !98, line: 686, type: !187)
!245 = !DILocalVariable(name: "__cnt", scope: !243, file: !98, line: 686, type: !123)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 225, type: !248, isLocal: true, isDefinition: true)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !249, line: 7, baseType: !250)
!249 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !251, line: 8, baseType: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 5, size: 1024, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !252, file: !251, line: 7, baseType: !255, size: 1024)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 1024, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 16)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "info_signal_count", scope: !2, file: !3, line: 231, type: !260, isLocal: true, isDefinition: true)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !262, line: 8, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !106, line: 215, baseType: !63)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 228, type: !260, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "close_stdout_required", scope: !2, file: !3, line: 478, type: !120, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "conversions", scope: !2, file: !3, line: 253, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 2176, elements: !279)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "symbol_value", file: !3, line: 246, size: 128, elements: !273)
!273 = !{!274, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "symbol", scope: !272, file: !3, line: 248, baseType: !275, size: 96)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 96, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 12)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !3, line: 249, baseType: !63, size: 32, offset: 96)
!279 = !{!280}
!280 = !DISubrange(count: 17)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !3, line: 329, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 2432, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 19)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "statuses", scope: !2, file: !3, line: 353, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 512, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 4)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "status_level", scope: !2, file: !3, line: 161, type: !63, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "suffixes", scope: !295, file: !3, line: 1418, type: !312, isLocal: true, isDefinition: true)
!295 = distinct !DISubprogram(name: "parse_integer", scope: !3, file: !3, line: 1409, type: !296, scopeLine: 1410, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !300)
!296 = !DISubroutineType(types: !297)
!297 = !{!131, !116, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !55, line: 43, baseType: !54)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !311}
!301 = !DILocalVariable(name: "str", arg: 1, scope: !295, file: !3, line: 1409, type: !116)
!302 = !DILocalVariable(name: "invalid", arg: 2, scope: !295, file: !3, line: 1409, type: !298)
!303 = !DILocalVariable(name: "indeterminate", scope: !295, file: !3, line: 1415, type: !63)
!304 = !DILocalVariable(name: "n", scope: !295, file: !3, line: 1416, type: !103)
!305 = !DILocalVariable(name: "suffix", scope: !295, file: !3, line: 1417, type: !195)
!306 = !DILocalVariable(name: "e", scope: !295, file: !3, line: 1419, type: !299)
!307 = !DILocalVariable(name: "result", scope: !295, file: !3, line: 1420, type: !131)
!308 = !DILocalVariable(name: "f", scope: !309, file: !3, line: 1433, type: !299)
!309 = distinct !DILexicalBlock(scope: !310, file: !3, line: 1432, column: 5)
!310 = distinct !DILexicalBlock(scope: !295, file: !3, line: 1430, column: 7)
!311 = !DILocalVariable(name: "o", scope: !309, file: !3, line: 1434, type: !131)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, elements: !256)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "input_blocksize", scope: !2, file: !3, line: 122, type: !315, isLocal: true, isDefinition: true)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !316, line: 130, baseType: !317)
!316 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !124, line: 35, baseType: !121)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "conversion_blocksize", scope: !2, file: !3, line: 128, type: !315, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "skip_records", scope: !2, file: !3, line: 131, type: !131, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "skip_bytes", scope: !2, file: !3, line: 135, type: !315, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "warn_partial_read", scope: !2, file: !3, line: 204, type: !120, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "prev_nread", scope: !328, file: !3, line: 1102, type: !331, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "iread", scope: !3, file: !3, line: 1099, type: !329, scopeLine: 1100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !63, !195, !315}
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !148, line: 108, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !106, line: 194, baseType: !121)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DILocalVariable(name: "fd", arg: 1, scope: !328, file: !3, line: 1099, type: !63)
!335 = !DILocalVariable(name: "buf", arg: 2, scope: !328, file: !3, line: 1099, type: !195)
!336 = !DILocalVariable(name: "size", arg: 3, scope: !328, file: !3, line: 1099, type: !315)
!337 = !DILocalVariable(name: "nread", scope: !328, file: !3, line: 1101, type: !331)
!338 = !DILocalVariable(name: "prev", scope: !339, file: !3, line: 1128, type: !315)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 1127, column: 9)
!340 = distinct !DILexicalBlock(scope: !341, file: !3, line: 1126, column: 11)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 1125, column: 5)
!342 = distinct !DILexicalBlock(scope: !328, file: !3, line: 1124, column: 7)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "progress_len", scope: !2, file: !3, line: 191, type: !63, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "r_full", scope: !2, file: !3, line: 176, type: !131, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "r_partial", scope: !2, file: !3, line: 173, type: !131, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "w_full", scope: !2, file: !3, line: 170, type: !131, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "w_partial", scope: !2, file: !3, line: 167, type: !131, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "r_truncate", scope: !2, file: !3, line: 207, type: !131, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "slash_s", scope: !357, file: !3, line: 749, type: !384, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "print_xfer_stats", scope: !3, file: !3, line: 746, type: !358, scopeLine: 747, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !360)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !136}
!360 = !{!361, !362, !363, !368, !370, !371, !372, !373, !374, !375, !378, !379, !383}
!361 = !DILocalVariable(name: "progress_time", arg: 1, scope: !357, file: !3, line: 746, type: !136)
!362 = !DILocalVariable(name: "now", scope: !357, file: !3, line: 748, type: !136)
!363 = !DILocalVariable(name: "hbuf", scope: !357, file: !3, line: 750, type: !364)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 15696, elements: !365)
!365 = !{!366, !367}
!366 = !DISubrange(count: 3)
!367 = !DISubrange(count: 654)
!368 = !DILocalVariable(name: "delta_s", scope: !357, file: !3, line: 751, type: !369)
!369 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!370 = !DILocalVariable(name: "bytes_per_second", scope: !357, file: !3, line: 752, type: !116)
!371 = !DILocalVariable(name: "si", scope: !357, file: !3, line: 753, type: !116)
!372 = !DILocalVariable(name: "iec", scope: !357, file: !3, line: 754, type: !116)
!373 = !DILocalVariable(name: "bpsbuf", scope: !357, file: !3, line: 759, type: !195)
!374 = !DILocalVariable(name: "bpsbufsize", scope: !357, file: !3, line: 760, type: !63)
!375 = !DILocalVariable(name: "XTIME_PRECISIONe0", scope: !376, file: !3, line: 763, type: !369)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 762, column: 5)
!377 = distinct !DILexicalBlock(scope: !357, file: !3, line: 761, column: 7)
!378 = !DILocalVariable(name: "delta_xtime", scope: !376, file: !3, line: 764, type: !136)
!379 = !DILocalVariable(name: "delta_s_buf", scope: !357, file: !3, line: 785, type: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 192, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 24)
!383 = !DILocalVariable(name: "stats_len", scope: !357, file: !3, line: 789, type: !63)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 24, elements: !385)
!385 = !{!366}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "w_bytes", scope: !2, file: !3, line: 179, type: !131, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "reported_w_bytes", scope: !2, file: !3, line: 182, type: !131, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "iread_fnc", scope: !2, file: !3, line: 240, type: !392, isLocal: true, isDefinition: true)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "ebcdic_to_ascii", scope: !2, file: !3, line: 441, type: !395, isLocal: true, isDefinition: true)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 2048, elements: !161)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "translation_needed", scope: !2, file: !3, line: 164, type: !120, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "ascii_to_ebcdic", scope: !2, file: !3, line: 369, type: !395, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "newline_character", scope: !2, file: !3, line: 211, type: !118, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "space_character", scope: !2, file: !3, line: 212, type: !118, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "ascii_to_ibm", scope: !2, file: !3, line: 405, type: !395, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "input_file", scope: !2, file: !3, line: 113, type: !116, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "input_flags", scope: !2, file: !3, line: 157, type: !63, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "output_file", scope: !2, file: !3, line: 116, type: !116, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "output_flags", scope: !2, file: !3, line: 158, type: !63, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "conversions_mask", scope: !2, file: !3, line: 154, type: !63, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "seek_records", scope: !2, file: !3, line: 138, type: !131, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "output_blocksize", scope: !2, file: !3, line: 125, type: !315, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "seek_bytes", scope: !2, file: !3, line: 142, type: !131, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "obuf", scope: !2, file: !3, line: 216, type: !195, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "ibuf", scope: !2, file: !3, line: 215, type: !195, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "pending_spaces", scope: !428, file: !3, line: 2007, type: !315, isLocal: true, isDefinition: true)
!428 = distinct !DISubprogram(name: "copy_with_unblock", scope: !3, file: !3, line: 2005, type: !429, scopeLine: 2006, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !116, !315}
!431 = !{!432, !433, !434, !436}
!432 = !DILocalVariable(name: "buf", arg: 1, scope: !428, file: !3, line: 2005, type: !116)
!433 = !DILocalVariable(name: "nread", arg: 2, scope: !428, file: !3, line: 2005, type: !315)
!434 = !DILocalVariable(name: "i", scope: !435, file: !3, line: 2009, type: !315)
!435 = distinct !DILexicalBlock(scope: !428, file: !3, line: 2009, column: 3)
!436 = !DILocalVariable(name: "c", scope: !437, file: !3, line: 2011, type: !118)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 2010, column: 5)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 2009, column: 3)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "oc", scope: !2, file: !3, line: 219, type: !315, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "col", scope: !2, file: !3, line: 222, type: !315, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "final_op_was_seek", scope: !2, file: !3, line: 145, type: !120, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "max_records", scope: !2, file: !3, line: 148, type: !131, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "max_bytes", scope: !2, file: !3, line: 151, type: !315, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "output_offset", scope: !451, file: !3, line: 1054, type: !147, isLocal: true, isDefinition: true)
!451 = distinct !DISubprogram(name: "invalidate_cache", scope: !3, file: !3, line: 1028, type: !452, scopeLine: 1029, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !454)
!452 = !DISubroutineType(types: !453)
!453 = !{!120, !63, !147}
!454 = !{!455, !456, !457, !458, !459, !460, !461}
!455 = !DILocalVariable(name: "fd", arg: 1, scope: !451, file: !3, line: 1028, type: !63)
!456 = !DILocalVariable(name: "len", arg: 2, scope: !451, file: !3, line: 1028, type: !147)
!457 = !DILocalVariable(name: "adv_ret", scope: !451, file: !3, line: 1030, type: !63)
!458 = !DILocalVariable(name: "offset", scope: !451, file: !3, line: 1031, type: !147)
!459 = !DILocalVariable(name: "nocache_eof", scope: !451, file: !3, line: 1032, type: !120)
!460 = !DILocalVariable(name: "clen", scope: !451, file: !3, line: 1035, type: !147)
!461 = !DILocalVariable(name: "pending", scope: !451, file: !3, line: 1040, type: !147)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "i_pending", scope: !464, file: !3, line: 1002, type: !147, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "cache_round", scope: !3, file: !3, line: 1000, type: !465, scopeLine: 1001, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!147, !63, !147}
!467 = !{!468, !469, !470, !472}
!468 = !DILocalVariable(name: "fd", arg: 1, scope: !464, file: !3, line: 1000, type: !63)
!469 = !DILocalVariable(name: "len", arg: 2, scope: !464, file: !3, line: 1000, type: !147)
!470 = !DILocalVariable(name: "pending", scope: !464, file: !3, line: 1003, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!472 = !DILocalVariable(name: "c_pending", scope: !473, file: !3, line: 1007, type: !131)
!473 = distinct !DILexicalBlock(scope: !474, file: !3, line: 1006, column: 5)
!474 = distinct !DILexicalBlock(scope: !464, file: !3, line: 1005, column: 7)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "o_pending", scope: !464, file: !3, line: 1002, type: !147, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!478 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!479 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!480 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!481 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 27, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!482 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 32, DW_OP_mul, DW_OP_constu, 32, DW_OP_plus, DW_OP_stack_value))
!483 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "Version", scope: !486, file: !487, line: 3, type: !116, isLocal: false, isDefinition: true)
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !488, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!488 = !{!484}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "file_name", scope: !491, file: !492, line: 45, type: !116, isLocal: true, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !493, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!493 = !{!489, !494}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !491, file: !492, line: 55, type: !120, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !498, file: !499, line: 66, type: !534, isLocal: false, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !500, globals: !501, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!500 = !{!119, !125}
!501 = !{!502, !528, !496, !530, !532}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "old_file_name", scope: !504, file: !499, line: 304, type: !116, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "verror_at_line", scope: !499, file: !499, line: 298, type: !505, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !498, retainedNodes: !521)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !63, !63, !116, !7, !116, !507}
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !508, line: 52, baseType: !509)
!508 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !510, line: 32, baseType: !511)
!510 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !512, baseType: !513)
!512 = !DIFile(filename: "lib/error.c", directory: "/src")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !514, size: 256, elements: !515)
!514 = !DINamespace(name: "std", scope: null)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !513, file: !512, baseType: !119, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !513, file: !512, baseType: !119, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !513, file: !512, baseType: !119, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !513, file: !512, baseType: !63, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !513, file: !512, baseType: !63, size: 32, offset: 224)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DILocalVariable(name: "status", arg: 1, scope: !504, file: !499, line: 298, type: !63)
!523 = !DILocalVariable(name: "errnum", arg: 2, scope: !504, file: !499, line: 298, type: !63)
!524 = !DILocalVariable(name: "file_name", arg: 3, scope: !504, file: !499, line: 298, type: !116)
!525 = !DILocalVariable(name: "line_number", arg: 4, scope: !504, file: !499, line: 298, type: !7)
!526 = !DILocalVariable(name: "message", arg: 5, scope: !504, file: !499, line: 298, type: !116)
!527 = !DILocalVariable(name: "args", arg: 6, scope: !504, file: !499, line: 298, type: !507)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "old_line_number", scope: !504, file: !499, line: 305, type: !7, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "error_message_count", scope: !498, file: !499, line: 69, type: !7, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !498, file: !499, line: 295, type: !63, isLocal: false, isDefinition: true)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{null}
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !539, file: !540, line: 506, type: !63, isLocal: true, isDefinition: true)
!539 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !540, file: !540, line: 485, type: !541, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !543, retainedNodes: !545)
!540 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!541 = !DISubroutineType(types: !542)
!542 = !{!63, !63, !63}
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !544, splitDebugInlining: false, nameTableKind: None)
!544 = !{!537}
!545 = !{!546, !547, !548, !549, !552}
!546 = !DILocalVariable(name: "fd", arg: 1, scope: !539, file: !540, line: 485, type: !63)
!547 = !DILocalVariable(name: "target", arg: 2, scope: !539, file: !540, line: 485, type: !63)
!548 = !DILocalVariable(name: "result", scope: !539, file: !540, line: 487, type: !63)
!549 = !DILocalVariable(name: "flags", scope: !550, file: !540, line: 530, type: !63)
!550 = distinct !DILexicalBlock(scope: !551, file: !540, line: 529, column: 5)
!551 = distinct !DILexicalBlock(scope: !539, file: !540, line: 528, column: 7)
!552 = !DILocalVariable(name: "saved_errno", scope: !553, file: !540, line: 533, type: !63)
!553 = distinct !DILexicalBlock(scope: !554, file: !540, line: 532, column: 9)
!554 = distinct !DILexicalBlock(scope: !550, file: !540, line: 531, column: 11)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "power_letter", scope: !557, file: !558, line: 36, type: !574, isLocal: true, isDefinition: true)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !559, retainedTypes: !560, globals: !563, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!559 = !{!84, !54}
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!563 = !{!555, !564, !568}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "block_size_args", scope: !557, file: !558, line: 398, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 192, elements: !385)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !557, file: !558, line: 399, type: !570, isLocal: true, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !572)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!572 = !{!573}
!573 = !DISubrange(count: 2)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 88, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 11)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "long_options", scope: !579, file: !580, line: 34, type: !582, isLocal: true, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !581, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!581 = !{!577}
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 768, elements: !385)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !585, line: 50, size: 256, elements: !586)
!585 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!586 = !{!587, !588, !589, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !584, file: !585, line: 52, baseType: !116, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !584, file: !585, line: 55, baseType: !63, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !585, line: 56, baseType: !590, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !584, file: !585, line: 57, baseType: !63, size: 32, offset: 192)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "program_name", scope: !594, file: !595, line: 31, type: !116, isLocal: false, isDefinition: true)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !596, globals: !597, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!596 = !{!195}
!597 = !{!592}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "utf07FF", scope: !600, file: !601, line: 46, type: !629, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "proper_name_lite", scope: !601, file: !601, line: 38, type: !602, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !604, retainedNodes: !606)
!601 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!602 = !DISubroutineType(types: !603)
!603 = !{!116, !116, !116}
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !605, splitDebugInlining: false, nameTableKind: None)
!605 = !{!598}
!606 = !{!607, !608, !609, !610, !615}
!607 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !600, file: !601, line: 38, type: !116)
!608 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !600, file: !601, line: 38, type: !116)
!609 = !DILocalVariable(name: "translation", scope: !600, file: !601, line: 40, type: !116)
!610 = !DILocalVariable(name: "w", scope: !600, file: !601, line: 47, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !612, line: 37, baseType: !613)
!612 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !106, line: 57, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!615 = !DILocalVariable(name: "mbs", scope: !600, file: !601, line: 48, type: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !617, line: 6, baseType: !618)
!617 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !619, line: 21, baseType: !620)
!619 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 13, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !620, file: !619, line: 15, baseType: !63, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !620, file: !619, line: 20, baseType: !624, size: 32, offset: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !620, file: !619, line: 16, size: 32, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !624, file: !619, line: 18, baseType: !7, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !624, file: !619, line: 19, baseType: !628, size: 32)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !289)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 16, elements: !572)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !632, file: !633, line: 76, type: !699, isLocal: false, isDefinition: true)
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !640, globals: !641, splitDebugInlining: false, nameTableKind: None)
!633 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!634 = !{!5, !635, !39}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!638 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!639 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!640 = !{!63, !122, !123}
!641 = !{!630, !642, !648, !660, !662, !665, !688, !695, !697}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !632, file: !633, line: 92, type: !644, isLocal: false, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 320, elements: !646)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!646 = !{!647}
!647 = !DISubrange(count: 10)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !632, file: !633, line: 1040, type: !650, isLocal: false, isDefinition: true)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !633, line: 56, size: 448, elements: !651)
!651 = !{!652, !653, !654, !658, !659}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !650, file: !633, line: 59, baseType: !5, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !633, line: 62, baseType: !63, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !650, file: !633, line: 66, baseType: !655, size: 256, offset: 64)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 8)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !650, file: !633, line: 69, baseType: !116, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !650, file: !633, line: 72, baseType: !116, size: 64, offset: 384)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !632, file: !633, line: 107, type: !650, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "slot0", scope: !632, file: !633, line: 831, type: !664, isLocal: true, isDefinition: true)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 2048, elements: !161)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "quote", scope: !667, file: !633, line: 228, type: !686, isLocal: true, isDefinition: true)
!667 = distinct !DISubprogram(name: "gettext_quote", scope: !633, file: !633, line: 197, type: !668, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !632, retainedNodes: !670)
!668 = !DISubroutineType(types: !669)
!669 = !{!116, !116, !5}
!670 = !{!671, !672, !673, !674, !675}
!671 = !DILocalVariable(name: "msgid", arg: 1, scope: !667, file: !633, line: 197, type: !116)
!672 = !DILocalVariable(name: "s", arg: 2, scope: !667, file: !633, line: 197, type: !5)
!673 = !DILocalVariable(name: "translation", scope: !667, file: !633, line: 199, type: !116)
!674 = !DILocalVariable(name: "w", scope: !667, file: !633, line: 229, type: !611)
!675 = !DILocalVariable(name: "mbs", scope: !667, file: !633, line: 230, type: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !617, line: 6, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !619, line: 21, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 13, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !678, file: !619, line: 15, baseType: !63, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !678, file: !619, line: 20, baseType: !682, size: 32, offset: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !619, line: 16, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !682, file: !619, line: 18, baseType: !7, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !682, file: !619, line: 19, baseType: !628, size: 32)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, elements: !687)
!687 = !{!573, !290}
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "slotvec", scope: !632, file: !633, line: 834, type: !690, isLocal: true, isDefinition: true)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !633, line: 823, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !691, file: !633, line: 825, baseType: !123, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !691, file: !633, line: 826, baseType: !195, size: 64, offset: 64)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "nslots", scope: !632, file: !633, line: 832, type: !63, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "slotvec0", scope: !632, file: !633, line: 833, type: !691, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 704, elements: !575)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !702, file: !703, line: 26, type: !705, isLocal: false, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!704 = !{!700}
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 376, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 47)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "exit_failure", scope: !710, file: !711, line: 24, type: !713, isLocal: false, isDefinition: true)
!710 = distinct !DICompileUnit(language: DW_LANG_C99, file: !711, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !712, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!712 = !{!708}
!713 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !716, file: !717, line: 65, type: !721, isLocal: false, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !719, globals: !720, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!718 = !{!5}
!719 = !{!119, !116, !125}
!720 = !{!714}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !722, line: 69, baseType: !534)
!722 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "internal_state", scope: !725, file: !726, line: 97, type: !729, isLocal: true, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !727, globals: !728, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!727 = !{!119, !123, !125}
!728 = !{!723}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !617, line: 6, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !619, line: 21, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !619, line: 13, size: 64, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !731, file: !619, line: 15, baseType: !63, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !731, file: !619, line: 20, baseType: !735, size: 32, offset: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !731, file: !619, line: 16, size: 32, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !735, file: !619, line: 18, baseType: !7, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !735, file: !619, line: 19, baseType: !628, size: 32)
!739 = distinct !DICompileUnit(language: DW_LANG_C99, file: !740, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!745 = distinct !DICompileUnit(language: DW_LANG_C99, file: !746, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!747 = !{!119}
!748 = distinct !DICompileUnit(language: DW_LANG_C99, file: !749, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!749 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/gethrxtime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2abae07bd356ebe51c13e20c33e0c4bf")
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !758, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!758 = !{!759}
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !757, line: 40, baseType: !7, size: 32, elements: !760)
!760 = !{!761}
!761 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !764, retainedTypes: !792, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!764 = !{!765, !777}
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !766, file: !763, line: 188, baseType: !7, size: 32, elements: !775)
!766 = distinct !DISubprogram(name: "x2nrealloc", scope: !763, file: !763, line: 176, type: !767, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !762, retainedNodes: !770)
!767 = !DISubroutineType(types: !768)
!768 = !{!119, !119, !769, !123}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!770 = !{!771, !772, !773, !774}
!771 = !DILocalVariable(name: "p", arg: 1, scope: !766, file: !763, line: 176, type: !119)
!772 = !DILocalVariable(name: "pn", arg: 2, scope: !766, file: !763, line: 176, type: !769)
!773 = !DILocalVariable(name: "s", arg: 3, scope: !766, file: !763, line: 176, type: !123)
!774 = !DILocalVariable(name: "n", scope: !766, file: !763, line: 178, type: !123)
!775 = !{!776}
!776 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !778, file: !763, line: 228, baseType: !7, size: 32, elements: !775)
!778 = distinct !DISubprogram(name: "xpalloc", scope: !763, file: !763, line: 223, type: !779, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !762, retainedNodes: !782)
!779 = !DISubroutineType(types: !780)
!780 = !{!119, !119, !781, !315, !317, !315}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791}
!783 = !DILocalVariable(name: "pa", arg: 1, scope: !778, file: !763, line: 223, type: !119)
!784 = !DILocalVariable(name: "pn", arg: 2, scope: !778, file: !763, line: 223, type: !781)
!785 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !778, file: !763, line: 223, type: !315)
!786 = !DILocalVariable(name: "n_max", arg: 4, scope: !778, file: !763, line: 223, type: !317)
!787 = !DILocalVariable(name: "s", arg: 5, scope: !778, file: !763, line: 223, type: !315)
!788 = !DILocalVariable(name: "n0", scope: !778, file: !763, line: 230, type: !315)
!789 = !DILocalVariable(name: "n", scope: !778, file: !763, line: 237, type: !315)
!790 = !DILocalVariable(name: "nbytes", scope: !778, file: !763, line: 248, type: !315)
!791 = !DILocalVariable(name: "adjusted_nbytes", scope: !778, file: !763, line: 252, type: !315)
!792 = !{!195, !119, !120, !121, !102}
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !798, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!797 = !{!54, !39}
!798 = !{!63, !122, !195, !120, !102, !103}
!799 = distinct !DICompileUnit(language: DW_LANG_C99, file: !800, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !801, splitDebugInlining: false, nameTableKind: None)
!800 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!801 = !{!120, !102, !119}
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!806 = distinct !DICompileUnit(language: DW_LANG_C99, file: !807, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !747, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!808 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!809 = !{i32 7, !"Dwarf Version", i32 5}
!810 = !{i32 2, !"Debug Info Version", i32 3}
!811 = !{i32 1, !"wchar_size", i32 4}
!812 = !{i32 1, !"branch-target-enforcement", i32 0}
!813 = !{i32 1, !"sign-return-address", i32 0}
!814 = !{i32 1, !"sign-return-address-all", i32 0}
!815 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!816 = !{i32 7, !"PIC Level", i32 2}
!817 = !{i32 7, !"PIE Level", i32 2}
!818 = !{i32 7, !"uwtable", i32 1}
!819 = !{i32 7, !"frame-pointer", i32 1}
!820 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 520, type: !129, scopeLine: 521, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !821)
!821 = !{!822}
!822 = !DILocalVariable(name: "status", arg: 1, scope: !820, file: !3, line: 520, type: !63)
!823 = !DILocation(line: 0, scope: !820)
!824 = !DILocation(line: 522, column: 14, scope: !825)
!825 = distinct !DILexicalBlock(scope: !820, file: !3, line: 522, column: 7)
!826 = !DILocation(line: 522, column: 7, scope: !820)
!827 = !DILocation(line: 523, column: 5, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !3, line: 523, column: 5)
!829 = !{!830, !830, i64 0}
!830 = !{!"any pointer", !831, i64 0}
!831 = !{!"omnipotent char", !832, i64 0}
!832 = !{!"Simple C/C++ TBAA"}
!833 = !DILocation(line: 526, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !3, line: 525, column: 5)
!835 = !DILocation(line: 531, column: 7, scope: !834)
!836 = !DILocation(line: 535, column: 7, scope: !834)
!837 = !DILocation(line: 539, column: 7, scope: !834)
!838 = !DILocation(line: 542, column: 7, scope: !834)
!839 = !DILocation(line: 545, column: 7, scope: !834)
!840 = !DILocation(line: 548, column: 7, scope: !834)
!841 = !DILocation(line: 551, column: 7, scope: !834)
!842 = !DILocation(line: 554, column: 7, scope: !834)
!843 = !DILocation(line: 557, column: 7, scope: !834)
!844 = !DILocation(line: 560, column: 7, scope: !834)
!845 = !DILocation(line: 563, column: 7, scope: !834)
!846 = !DILocation(line: 566, column: 7, scope: !834)
!847 = !DILocation(line: 569, column: 7, scope: !834)
!848 = !DILocation(line: 572, column: 7, scope: !834)
!849 = !DILocation(line: 578, column: 7, scope: !834)
!850 = !DILocation(line: 589, column: 7, scope: !834)
!851 = !DILocation(line: 602, column: 7, scope: !834)
!852 = !DILocation(line: 610, column: 7, scope: !834)
!853 = !DILocation(line: 619, column: 9, scope: !854)
!854 = distinct !DILexicalBlock(scope: !834, file: !3, line: 618, column: 11)
!855 = !DILocation(line: 620, column: 7, scope: !834)
!856 = !DILocation(line: 622, column: 9, scope: !857)
!857 = distinct !DILexicalBlock(scope: !834, file: !3, line: 621, column: 11)
!858 = !DILocation(line: 624, column: 9, scope: !859)
!859 = distinct !DILexicalBlock(scope: !834, file: !3, line: 623, column: 11)
!860 = !DILocation(line: 625, column: 7, scope: !834)
!861 = !DILocation(line: 628, column: 9, scope: !862)
!862 = distinct !DILexicalBlock(scope: !834, file: !3, line: 627, column: 11)
!863 = !DILocation(line: 630, column: 9, scope: !864)
!864 = distinct !DILexicalBlock(scope: !834, file: !3, line: 629, column: 11)
!865 = !DILocation(line: 633, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !834, file: !3, line: 632, column: 11)
!867 = !DILocation(line: 637, column: 9, scope: !868)
!868 = distinct !DILexicalBlock(scope: !834, file: !3, line: 636, column: 11)
!869 = !DILocation(line: 640, column: 9, scope: !870)
!870 = distinct !DILexicalBlock(scope: !834, file: !3, line: 639, column: 11)
!871 = !DILocation(line: 649, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !834, file: !3, line: 648, column: 7)
!873 = !DILocation(line: 659, column: 7, scope: !834)
!874 = !DILocation(line: 660, column: 7, scope: !834)
!875 = !DILocalVariable(name: "program", arg: 1, scope: !876, file: !98, line: 836, type: !116)
!876 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !98, file: !98, line: 836, type: !877, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !116}
!879 = !{!875, !880, !889, !890, !892, !893}
!880 = !DILocalVariable(name: "infomap", scope: !876, file: !98, line: 838, type: !881)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 896, elements: !887)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !876, file: !98, line: 838, size: 128, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !883, file: !98, line: 838, baseType: !116, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !883, file: !98, line: 838, baseType: !116, size: 64, offset: 64)
!887 = !{!888}
!888 = !DISubrange(count: 7)
!889 = !DILocalVariable(name: "node", scope: !876, file: !98, line: 848, type: !116)
!890 = !DILocalVariable(name: "map_prog", scope: !876, file: !98, line: 849, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!892 = !DILocalVariable(name: "lc_messages", scope: !876, file: !98, line: 861, type: !116)
!893 = !DILocalVariable(name: "url_program", scope: !876, file: !98, line: 874, type: !116)
!894 = !DILocation(line: 0, scope: !876, inlinedAt: !895)
!895 = distinct !DILocation(line: 661, column: 7, scope: !834)
!896 = !DILocation(line: 838, column: 3, scope: !876, inlinedAt: !895)
!897 = !DILocation(line: 838, column: 67, scope: !876, inlinedAt: !895)
!898 = !DILocation(line: 849, column: 36, scope: !876, inlinedAt: !895)
!899 = !DILocation(line: 851, column: 3, scope: !876, inlinedAt: !895)
!900 = !DILocalVariable(name: "__s1", arg: 1, scope: !901, file: !902, line: 1359, type: !116)
!901 = distinct !DISubprogram(name: "streq", scope: !902, file: !902, line: 1359, type: !903, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!902 = !DIFile(filename: "./lib/string.h", directory: "/src")
!903 = !DISubroutineType(types: !904)
!904 = !{!120, !116, !116}
!905 = !{!900, !906}
!906 = !DILocalVariable(name: "__s2", arg: 2, scope: !901, file: !902, line: 1359, type: !116)
!907 = !DILocation(line: 0, scope: !901, inlinedAt: !908)
!908 = distinct !DILocation(line: 851, column: 33, scope: !876, inlinedAt: !895)
!909 = !DILocation(line: 1361, column: 11, scope: !901, inlinedAt: !908)
!910 = !DILocation(line: 1361, column: 10, scope: !901, inlinedAt: !908)
!911 = !DILocation(line: 852, column: 13, scope: !876, inlinedAt: !895)
!912 = !DILocation(line: 851, column: 20, scope: !876, inlinedAt: !895)
!913 = !{!914, !830, i64 0}
!914 = !{!"infomap", !830, i64 0, !830, i64 8}
!915 = !DILocation(line: 851, column: 10, scope: !876, inlinedAt: !895)
!916 = !DILocation(line: 851, column: 28, scope: !876, inlinedAt: !895)
!917 = distinct !{!917, !899, !911, !918}
!918 = !{!"llvm.loop.mustprogress"}
!919 = !DILocation(line: 854, column: 17, scope: !920, inlinedAt: !895)
!920 = distinct !DILexicalBlock(scope: !876, file: !98, line: 854, column: 7)
!921 = !{!914, !830, i64 8}
!922 = !DILocation(line: 854, column: 7, scope: !920, inlinedAt: !895)
!923 = !DILocation(line: 854, column: 7, scope: !876, inlinedAt: !895)
!924 = !DILocation(line: 857, column: 3, scope: !876, inlinedAt: !895)
!925 = !DILocation(line: 861, column: 29, scope: !876, inlinedAt: !895)
!926 = !DILocation(line: 862, column: 7, scope: !927, inlinedAt: !895)
!927 = distinct !DILexicalBlock(scope: !876, file: !98, line: 862, column: 7)
!928 = !DILocation(line: 862, column: 19, scope: !927, inlinedAt: !895)
!929 = !DILocation(line: 862, column: 22, scope: !927, inlinedAt: !895)
!930 = !DILocation(line: 862, column: 7, scope: !876, inlinedAt: !895)
!931 = !DILocation(line: 868, column: 7, scope: !932, inlinedAt: !895)
!932 = distinct !DILexicalBlock(scope: !927, file: !98, line: 863, column: 5)
!933 = !DILocation(line: 870, column: 5, scope: !932, inlinedAt: !895)
!934 = !DILocation(line: 0, scope: !901, inlinedAt: !935)
!935 = distinct !DILocation(line: 874, column: 29, scope: !876, inlinedAt: !895)
!936 = !DILocation(line: 875, column: 3, scope: !876, inlinedAt: !895)
!937 = !DILocation(line: 877, column: 3, scope: !876, inlinedAt: !895)
!938 = !DILocation(line: 879, column: 1, scope: !876, inlinedAt: !895)
!939 = !DILocation(line: 663, column: 3, scope: !820)
!940 = !DISubprogram(name: "dcgettext", scope: !941, file: !941, line: 51, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !944)
!941 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!942 = !DISubroutineType(types: !943)
!943 = !{!195, !116, !116, !63}
!944 = !{}
!945 = !DISubprogram(name: "fputs_unlocked", scope: !508, file: !508, line: 691, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !944)
!946 = !DISubroutineType(types: !947)
!947 = !{!63, !948, !949}
!948 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!949 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !187)
!950 = !DILocation(line: 0, scope: !165)
!951 = !DILocation(line: 581, column: 7, scope: !173)
!952 = !{!953, !953, i64 0}
!953 = !{!"int", !831, i64 0}
!954 = !DILocation(line: 581, column: 19, scope: !173)
!955 = !DILocation(line: 581, column: 7, scope: !165)
!956 = !DILocation(line: 585, column: 26, scope: !172)
!957 = !DILocation(line: 0, scope: !172)
!958 = !DILocation(line: 586, column: 23, scope: !172)
!959 = !DILocation(line: 586, column: 28, scope: !172)
!960 = !DILocation(line: 586, column: 32, scope: !172)
!961 = !{!831, !831, i64 0}
!962 = !DILocation(line: 586, column: 38, scope: !172)
!963 = !DILocation(line: 0, scope: !901, inlinedAt: !964)
!964 = distinct !DILocation(line: 586, column: 41, scope: !172)
!965 = !DILocation(line: 1361, column: 11, scope: !901, inlinedAt: !964)
!966 = !DILocation(line: 1361, column: 10, scope: !901, inlinedAt: !964)
!967 = !DILocation(line: 586, column: 19, scope: !172)
!968 = !DILocation(line: 587, column: 5, scope: !172)
!969 = !DILocation(line: 588, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !165, file: !98, line: 588, column: 7)
!971 = !DILocation(line: 588, column: 7, scope: !165)
!972 = !DILocation(line: 590, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !970, file: !98, line: 589, column: 5)
!974 = !DILocation(line: 591, column: 7, scope: !973)
!975 = !DILocation(line: 595, column: 37, scope: !165)
!976 = !DILocation(line: 595, column: 35, scope: !165)
!977 = !DILocation(line: 596, column: 29, scope: !165)
!978 = !DILocation(line: 597, column: 8, scope: !180)
!979 = !DILocation(line: 597, column: 7, scope: !165)
!980 = !DILocation(line: 604, column: 24, scope: !179)
!981 = !DILocation(line: 604, column: 12, scope: !180)
!982 = !DILocation(line: 0, scope: !178)
!983 = !DILocation(line: 610, column: 16, scope: !178)
!984 = !DILocation(line: 610, column: 7, scope: !178)
!985 = !DILocation(line: 611, column: 21, scope: !178)
!986 = !{!987, !987, i64 0}
!987 = !{!"short", !831, i64 0}
!988 = !DILocation(line: 611, column: 19, scope: !178)
!989 = !DILocation(line: 611, column: 16, scope: !178)
!990 = !DILocation(line: 610, column: 30, scope: !178)
!991 = distinct !{!991, !984, !985, !918}
!992 = !DILocation(line: 612, column: 18, scope: !993)
!993 = distinct !DILexicalBlock(scope: !178, file: !98, line: 612, column: 11)
!994 = !DILocation(line: 612, column: 11, scope: !178)
!995 = !DILocation(line: 620, column: 23, scope: !165)
!996 = !DILocation(line: 625, column: 39, scope: !165)
!997 = !DILocation(line: 626, column: 3, scope: !165)
!998 = !DILocation(line: 626, column: 10, scope: !165)
!999 = !DILocation(line: 626, column: 21, scope: !165)
!1000 = !DILocation(line: 628, column: 44, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !98, line: 628, column: 11)
!1002 = distinct !DILexicalBlock(scope: !165, file: !98, line: 627, column: 5)
!1003 = !DILocation(line: 628, column: 32, scope: !1001)
!1004 = !DILocation(line: 628, column: 49, scope: !1001)
!1005 = !DILocation(line: 628, column: 11, scope: !1002)
!1006 = !DILocation(line: 630, column: 11, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1002, file: !98, line: 630, column: 11)
!1008 = !DILocation(line: 630, column: 11, scope: !1002)
!1009 = !DILocation(line: 632, column: 26, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !98, line: 632, column: 15)
!1011 = distinct !DILexicalBlock(scope: !1007, file: !98, line: 631, column: 9)
!1012 = !DILocation(line: 632, column: 34, scope: !1010)
!1013 = !DILocation(line: 632, column: 37, scope: !1010)
!1014 = !DILocation(line: 632, column: 15, scope: !1011)
!1015 = !DILocation(line: 636, column: 29, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !98, line: 636, column: 15)
!1017 = !DILocation(line: 640, column: 16, scope: !1002)
!1018 = distinct !{!1018, !997, !1019, !918}
!1019 = !DILocation(line: 641, column: 5, scope: !165)
!1020 = !DILocation(line: 644, column: 3, scope: !165)
!1021 = !DILocation(line: 0, scope: !901, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 648, column: 31, scope: !165)
!1023 = !DILocation(line: 0, scope: !901, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 649, column: 31, scope: !165)
!1025 = !DILocation(line: 0, scope: !901, inlinedAt: !1026)
!1026 = distinct !DILocation(line: 650, column: 31, scope: !165)
!1027 = !DILocation(line: 0, scope: !901, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 651, column: 31, scope: !165)
!1029 = !DILocation(line: 0, scope: !901, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 652, column: 31, scope: !165)
!1031 = !DILocation(line: 0, scope: !901, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 653, column: 31, scope: !165)
!1033 = !DILocation(line: 0, scope: !901, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 654, column: 31, scope: !165)
!1035 = !DILocation(line: 0, scope: !901, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 655, column: 31, scope: !165)
!1037 = !DILocation(line: 0, scope: !901, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 656, column: 31, scope: !165)
!1039 = !DILocation(line: 0, scope: !901, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 657, column: 31, scope: !165)
!1041 = !DILocation(line: 663, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !165, file: !98, line: 663, column: 7)
!1043 = !DILocation(line: 664, column: 7, scope: !1042)
!1044 = !DILocation(line: 664, column: 10, scope: !1042)
!1045 = !DILocation(line: 663, column: 7, scope: !165)
!1046 = !DILocation(line: 669, column: 7, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !98, line: 665, column: 5)
!1048 = !DILocation(line: 671, column: 5, scope: !1047)
!1049 = !DILocation(line: 676, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1042, file: !98, line: 673, column: 5)
!1051 = !DILocation(line: 679, column: 3, scope: !165)
!1052 = !DILocation(line: 683, column: 3, scope: !165)
!1053 = !DILocation(line: 686, column: 3, scope: !165)
!1054 = !DILocation(line: 688, column: 3, scope: !165)
!1055 = !DILocation(line: 691, column: 3, scope: !165)
!1056 = !DILocation(line: 695, column: 3, scope: !165)
!1057 = !DILocation(line: 696, column: 1, scope: !165)
!1058 = !DISubprogram(name: "setlocale", scope: !1059, file: !1059, line: 122, type: !1060, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !944)
!1059 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!195, !63, !116}
!1062 = !DISubprogram(name: "getenv", scope: !1063, file: !1063, line: 641, type: !1064, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !944)
!1063 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!195, !116}
!1066 = !DISubprogram(name: "fwrite_unlocked", scope: !508, file: !508, line: 704, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !944)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!123, !1069, !123, !123, !949}
!1069 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !561)
!1070 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2405, type: !1071, scopeLine: 2406, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1074)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!63, !63, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!1074 = !{!1075, !1076, !1077, !1078, !1080, !1085, !1086, !1087, !1092, !1127, !1131, !1132, !1133}
!1075 = !DILocalVariable(name: "argc", arg: 1, scope: !1070, file: !3, line: 2405, type: !63)
!1076 = !DILocalVariable(name: "argv", arg: 2, scope: !1070, file: !3, line: 2405, type: !1073)
!1077 = !DILocalVariable(name: "offset", scope: !1070, file: !3, line: 2407, type: !147)
!1078 = !DILocalVariable(name: "i", scope: !1079, file: !3, line: 2428, type: !63)
!1079 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 2428, column: 3)
!1080 = !DILocalVariable(name: "perms", scope: !1081, file: !3, line: 2460, type: !1083)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 2459, column: 5)
!1082 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 2453, column: 7)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !148, line: 69, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !106, line: 150, baseType: !7)
!1085 = !DILocalVariable(name: "opts", scope: !1081, file: !3, line: 2461, type: !63)
!1086 = !DILocalVariable(name: "size", scope: !1081, file: !3, line: 2467, type: !147)
!1087 = !DILocalVariable(name: "ftruncate_errno", scope: !1088, file: !3, line: 2496, type: !63)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 2490, column: 13)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 2489, column: 15)
!1090 = distinct !DILexicalBlock(scope: !1091, file: !3, line: 2488, column: 9)
!1091 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 2487, column: 11)
!1092 = !DILocalVariable(name: "stdout_stat", scope: !1088, file: !3, line: 2497, type: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1094, line: 44, size: 1024, elements: !1095)
!1094 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1095 = !{!1096, !1098, !1100, !1101, !1103, !1105, !1107, !1108, !1109, !1110, !1112, !1113, !1115, !1123, !1124, !1125}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1093, file: !1094, line: 46, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !106, line: 145, baseType: !102)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1093, file: !1094, line: 47, baseType: !1099, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !106, line: 148, baseType: !102)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1093, file: !1094, line: 48, baseType: !1084, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1093, file: !1094, line: 49, baseType: !1102, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !106, line: 151, baseType: !7)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1093, file: !1094, line: 50, baseType: !1104, size: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !106, line: 146, baseType: !7)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1093, file: !1094, line: 51, baseType: !1106, size: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !106, line: 147, baseType: !7)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1093, file: !1094, line: 52, baseType: !1097, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1093, file: !1094, line: 53, baseType: !1097, size: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1093, file: !1094, line: 54, baseType: !149, size: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1093, file: !1094, line: 55, baseType: !1111, size: 32, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !106, line: 175, baseType: !63)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1093, file: !1094, line: 56, baseType: !63, size: 32, offset: 480)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1093, file: !1094, line: 57, baseType: !1114, size: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !106, line: 180, baseType: !121)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1093, file: !1094, line: 65, baseType: !1116, size: 128, offset: 576)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1117, line: 11, size: 128, elements: !1118)
!1117 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1118 = !{!1119, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1116, file: !1117, line: 16, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !106, line: 160, baseType: !121)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1116, file: !1117, line: 21, baseType: !1122, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !106, line: 197, baseType: !121)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1093, file: !1094, line: 66, baseType: !1116, size: 128, offset: 704)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1093, file: !1094, line: 67, baseType: !1116, size: 128, offset: 832)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1093, file: !1094, line: 79, baseType: !1126, size: 64, offset: 960)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !572)
!1127 = !DILocalVariable(name: "isize", scope: !1128, file: !3, line: 2505, type: !131)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 2504, column: 17)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 2501, column: 24)
!1130 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 2498, column: 19)
!1131 = !DILocalVariable(name: "copy_status", scope: !1070, file: !3, line: 2518, type: !63)
!1132 = !DILocalVariable(name: "sync_status", scope: !1070, file: !3, line: 2519, type: !63)
!1133 = !DILocalVariable(name: "exit_status", scope: !1070, file: !3, line: 2520, type: !63)
!1134 = !DILocation(line: 0, scope: !1070)
!1135 = !DILocation(line: 875, column: 49, scope: !1136, inlinedAt: !1229)
!1136 = distinct !DISubprogram(name: "install_signal_handlers", scope: !3, file: !3, line: 873, type: !535, scopeLine: 874, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1137)
!1137 = !{!1138, !1139}
!1138 = !DILocalVariable(name: "catch_siginfo", scope: !1136, file: !3, line: 875, type: !120)
!1139 = !DILocalVariable(name: "act", scope: !1136, file: !3, line: 877, type: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1141, line: 27, size: 1216, elements: !1142)
!1141 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!1142 = !{!1143, !1226, !1227, !1228}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1140, file: !1141, line: 38, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1140, file: !1141, line: 31, size: 64, elements: !1145)
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1144, file: !1141, line: 34, baseType: !126, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1144, file: !1141, line: 36, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !63, !1151, !119}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1153, line: 124, baseType: !1154)
!1153 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1153, line: 36, size: 1024, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1154, file: !1153, line: 38, baseType: !63, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1154, file: !1153, line: 40, baseType: !63, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1154, file: !1153, line: 42, baseType: !63, size: 32, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1154, file: !1153, line: 48, baseType: !63, size: 32, offset: 96)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1154, file: !1153, line: 123, baseType: !1161, size: 896, offset: 128)
!1161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1154, file: !1153, line: 51, size: 896, elements: !1162)
!1162 = !{!1163, !1167, !1173, !1185, !1191, !1200, !1215, !1220}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1161, file: !1153, line: 53, baseType: !1164, size: 896)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 896, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 28)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1161, file: !1153, line: 60, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1161, file: !1153, line: 56, size: 64, elements: !1169)
!1169 = !{!1170, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1168, file: !1153, line: 58, baseType: !1171, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !106, line: 154, baseType: !63)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1168, file: !1153, line: 59, baseType: !1104, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1161, file: !1153, line: 68, baseType: !1174, size: 128)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1161, file: !1153, line: 63, size: 128, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1174, file: !1153, line: 65, baseType: !63, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1174, file: !1153, line: 66, baseType: !63, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1174, file: !1153, line: 67, baseType: !1179, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !1180, line: 30, baseType: !1181)
!1180 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!1181 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1180, line: 24, size: 64, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1181, file: !1180, line: 26, baseType: !63, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1181, file: !1180, line: 27, baseType: !119, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1161, file: !1153, line: 76, baseType: !1186, size: 128)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1161, file: !1153, line: 71, size: 128, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1186, file: !1153, line: 73, baseType: !1171, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1186, file: !1153, line: 74, baseType: !1104, size: 32, offset: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1186, file: !1153, line: 75, baseType: !1179, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1161, file: !1153, line: 86, baseType: !1192, size: 256)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1161, file: !1153, line: 79, size: 256, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1199}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1192, file: !1153, line: 81, baseType: !1171, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1192, file: !1153, line: 82, baseType: !1104, size: 32, offset: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1192, file: !1153, line: 83, baseType: !63, size: 32, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1192, file: !1153, line: 84, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !106, line: 156, baseType: !121)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1192, file: !1153, line: 85, baseType: !1198, size: 64, offset: 192)
