; ModuleID = 'src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.fs_type_list = type { i8*, %struct.fs_type_list* }
%struct.field_data_t = type { i32, i8*, i32, i8*, i32, i8, i8 }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.devlist = type { i64, %struct.mount_entry*, %struct.devlist*, %struct.devlist* }

!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 46, baseType: !7, size: 32, elements: !65)
!64 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!66 = !DIEnumerator(name: "_ISupper", value: 256)
!67 = !DIEnumerator(name: "_ISlower", value: 512)
!68 = !DIEnumerator(name: "_ISalpha", value: 1024)
!69 = !DIEnumerator(name: "_ISdigit", value: 2048)
!70 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!71 = !DIEnumerator(name: "_ISspace", value: 8192)
!72 = !DIEnumerator(name: "_ISprint", value: 16384)
!73 = !DIEnumerator(name: "_ISgraph", value: 32768)
!74 = !DIEnumerator(name: "_ISblank", value: 1)
!75 = !DIEnumerator(name: "_IScntrl", value: 2)
!76 = !DIEnumerator(name: "_ISpunct", value: 4)
!77 = !DIEnumerator(name: "_ISalnum", value: 8)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 156, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81, !82}
!80 = !DIEnumerator(name: "BLOCK_FLD", value: 0)
!81 = !DIEnumerator(name: "INODE_FLD", value: 1)
!82 = !DIEnumerator(name: "OTHER_FLD", value: 2)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 297, baseType: !7, size: 32, elements: !84)
!84 = !{!85}
!85 = !DIEnumerator(name: "MBSWIDTH_FLAGS", value: 3)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !87, line: 33, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./lib/canonicalize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e78d7e061e2ee7b61b12ad7654b500f8")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!90 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!91 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!92 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!93 = !{!94, !96, !97, !98, !99, !102, !104, !105, !109, !112}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!101 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!104 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !106, line: 59, baseType: !107)
!106 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !108, line: 145, baseType: !101)
!108 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !110, line: 102, baseType: !111)
!110 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !108, line: 73, baseType: !101)
!112 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!113 = !{!114, !117, !119, !121, !123, !125, !127, !129, !136, !138, !153, !155, !157, !0, !242, !244, !246, !251, !253, !268, !273, !275, !277, !284, !288, !290, !296}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !2, file: !3, line: 62, type: !116, isLocal: true, isDefinition: true)
!116 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !2, file: !3, line: 65, type: !116, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !2, file: !3, line: 69, type: !116, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 75, type: !109, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !2, file: !3, line: 78, type: !116, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "require_sync", scope: !2, file: !3, line: 84, type: !116, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 87, type: !97, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "fs_select_list", scope: !2, file: !3, line: 108, type: !131, isLocal: true, isDefinition: true)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !3, line: 91, size: 128, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !132, file: !3, line: 93, baseType: !94, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !132, file: !3, line: 94, baseType: !131, size: 64, offset: 64)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !2, file: !3, line: 113, type: !131, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "mount_list", scope: !2, file: !3, line: 116, type: !140, isLocal: true, isDefinition: true)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !142, line: 35, size: 448, elements: !143)
!142 = !DIFile(filename: "./lib/mountlist.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0b721ac4f5b5eea4f8f1c70f7145ac5d")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !141, file: !142, line: 37, baseType: !94, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !141, file: !142, line: 38, baseType: !94, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !141, file: !142, line: 39, baseType: !94, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !141, file: !142, line: 41, baseType: !94, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !141, file: !142, line: 42, baseType: !105, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !141, file: !142, line: 43, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !141, file: !142, line: 44, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !141, file: !142, line: 45, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !141, file: !142, line: 46, baseType: !140, size: 64, offset: 384)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "print_type", scope: !2, file: !3, line: 119, type: !116, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 122, type: !116, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !159, file: !160, line: 575, type: !97, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "oputs_", scope: !160, file: !160, line: 573, type: !161, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !163)
!160 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!161 = !DISubroutineType(types: !162)
!162 = !{null, !102, !102}
!163 = !{!164, !165, !166, !169, !170, !171, !172, !176, !177, !178, !179, !181, !236, !237, !238, !240, !241}
!164 = !DILocalVariable(name: "program", arg: 1, scope: !159, file: !160, line: 573, type: !102)
!165 = !DILocalVariable(name: "option", arg: 2, scope: !159, file: !160, line: 573, type: !102)
!166 = !DILocalVariable(name: "term", scope: !167, file: !160, line: 585, type: !102)
!167 = distinct !DILexicalBlock(scope: !168, file: !160, line: 582, column: 5)
!168 = distinct !DILexicalBlock(scope: !159, file: !160, line: 581, column: 7)
!169 = !DILocalVariable(name: "double_space", scope: !159, file: !160, line: 594, type: !116)
!170 = !DILocalVariable(name: "first_word", scope: !159, file: !160, line: 595, type: !102)
!171 = !DILocalVariable(name: "option_text", scope: !159, file: !160, line: 596, type: !102)
!172 = !DILocalVariable(name: "s", scope: !173, file: !160, line: 608, type: !102)
!173 = distinct !DILexicalBlock(scope: !174, file: !160, line: 605, column: 5)
!174 = distinct !DILexicalBlock(scope: !175, file: !160, line: 604, column: 12)
!175 = distinct !DILexicalBlock(scope: !159, file: !160, line: 597, column: 7)
!176 = !DILocalVariable(name: "spaces", scope: !173, file: !160, line: 609, type: !99)
!177 = !DILocalVariable(name: "anchor_len", scope: !159, file: !160, line: 620, type: !99)
!178 = !DILocalVariable(name: "desc_text", scope: !159, file: !160, line: 625, type: !102)
!179 = !DILocalVariable(name: "__ptr", scope: !180, file: !160, line: 644, type: !102)
!180 = distinct !DILexicalBlock(scope: !159, file: !160, line: 644, column: 3)
!181 = !DILocalVariable(name: "__stream", scope: !180, file: !160, line: 644, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !184, line: 7, baseType: !185)
!184 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !186, line: 49, size: 1728, elements: !187)
!186 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !203, !205, !206, !207, !210, !211, !213, !217, !220, !222, !225, !228, !229, !230, !231, !232}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !185, file: !186, line: 51, baseType: !97, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !185, file: !186, line: 54, baseType: !94, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !185, file: !186, line: 55, baseType: !94, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !185, file: !186, line: 56, baseType: !94, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !185, file: !186, line: 57, baseType: !94, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !185, file: !186, line: 58, baseType: !94, size: 64, offset: 320)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !185, file: !186, line: 59, baseType: !94, size: 64, offset: 384)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !185, file: !186, line: 60, baseType: !94, size: 64, offset: 448)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !185, file: !186, line: 61, baseType: !94, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !185, file: !186, line: 64, baseType: !94, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !185, file: !186, line: 65, baseType: !94, size: 64, offset: 640)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !185, file: !186, line: 66, baseType: !94, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !185, file: !186, line: 68, baseType: !201, size: 64, offset: 768)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !186, line: 36, flags: DIFlagFwdDecl)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !185, file: !186, line: 70, baseType: !204, size: 64, offset: 832)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !185, file: !186, line: 72, baseType: !97, size: 32, offset: 896)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !185, file: !186, line: 73, baseType: !97, size: 32, offset: 928)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !185, file: !186, line: 74, baseType: !208, size: 64, offset: 960)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 152, baseType: !209)
!209 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !185, file: !186, line: 77, baseType: !98, size: 16, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !185, file: !186, line: 78, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !185, file: !186, line: 79, baseType: !214, size: 8, offset: 1048)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 8, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 1)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !185, file: !186, line: 81, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !186, line: 43, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !185, file: !186, line: 89, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 153, baseType: !209)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !185, file: !186, line: 91, baseType: !223, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !186, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !185, file: !186, line: 92, baseType: !226, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !186, line: 38, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !185, file: !186, line: 93, baseType: !204, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !185, file: !186, line: 94, baseType: !96, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !185, file: !186, line: 95, baseType: !99, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !185, file: !186, line: 96, baseType: !97, size: 32, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !185, file: !186, line: 98, baseType: !233, size: 160, offset: 1568)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 20)
!236 = !DILocalVariable(name: "__cnt", scope: !180, file: !160, line: 644, type: !99)
!237 = !DILocalVariable(name: "url_program", scope: !159, file: !160, line: 648, type: !102)
!238 = !DILocalVariable(name: "__ptr", scope: !239, file: !160, line: 686, type: !102)
!239 = distinct !DILexicalBlock(scope: !159, file: !160, line: 686, column: 3)
!240 = !DILocalVariable(name: "__stream", scope: !239, file: !160, line: 686, type: !182)
!241 = !DILocalVariable(name: "__cnt", scope: !239, file: !160, line: 686, type: !99)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 72, type: !97, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "header_mode", scope: !2, file: !3, line: 135, type: !14, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "ncolumns", scope: !2, file: !3, line: 222, type: !248, isLocal: true, isDefinition: true)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !249, line: 130, baseType: !250)
!249 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !100, line: 35, baseType: !209)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "ncolumns_alloc", scope: !2, file: !3, line: 222, type: !248, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 219, type: !255, isLocal: true, isDefinition: true)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !3, line: 164, size: 320, elements: !258)
!258 = !{!259, !261, !262, !264, !265, !266, !267}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !257, file: !3, line: 166, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !3, line: 153, baseType: !48)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !257, file: !3, line: 167, baseType: !102, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !257, file: !3, line: 168, baseType: !263, size: 32, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !3, line: 161, baseType: !78)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !257, file: !3, line: 169, baseType: !102, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !257, file: !3, line: 170, baseType: !97, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "align_right", scope: !257, file: !3, line: 171, baseType: !116, size: 8, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !257, file: !3, line: 172, baseType: !116, size: 8, offset: 296)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "field_data", scope: !2, file: !3, line: 176, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 3840, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 12)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "all_args_string", scope: !2, file: !3, line: 214, type: !102, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "nrows_alloc", scope: !2, file: !3, line: 242, type: !248, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "tty_out", scope: !279, file: !3, line: 355, type: !97, isLocal: true, isDefinition: true)
!279 = distinct !DISubprogram(name: "replace_problematic_chars", scope: !3, file: !3, line: 353, type: !280, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !282)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !94}
!282 = !{!283}
!283 = !DILocalVariable(name: "cell", arg: 1, scope: !279, file: !3, line: 353, type: !94)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "table", scope: !2, file: !3, line: 238, type: !286, isLocal: true, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "nrows", scope: !2, file: !3, line: 242, type: !248, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "devlist_table", scope: !2, file: !3, line: 58, type: !292, isLocal: true, isDefinition: true)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !294, line: 56, baseType: !295)
!294 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !294, line: 54, flags: DIFlagFwdDecl)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !2, file: !3, line: 125, type: !298, isLocal: true, isDefinition: true)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !299, line: 31, size: 448, elements: !300)
!299 = !DIFile(filename: "./lib/fsusage.h", directory: "/src", checksumkind: CSK_MD5, checksum: "85913791ba5e4e0263095d6c86df621e")
!300 = !{!301, !302, !303, !304, !305, !306, !307}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !298, file: !299, line: 33, baseType: !109, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !298, file: !299, line: 34, baseType: !109, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !298, file: !299, line: 35, baseType: !109, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !298, file: !299, line: 36, baseType: !109, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !298, file: !299, line: 37, baseType: !116, size: 8, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !298, file: !299, line: 38, baseType: !109, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !298, file: !299, line: 39, baseType: !109, size: 64, offset: 384)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 4352, elements: !318)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !311, line: 50, size: 256, elements: !312)
!311 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!312 = !{!313, !314, !315, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !311, line: 52, baseType: !102, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !310, file: !311, line: 55, baseType: !97, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 56, baseType: !316, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !310, file: !311, line: 57, baseType: !97, size: 32, offset: 192)
!318 = !{!319}
!319 = !DISubrange(count: 17)
!320 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!321 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!322 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!323 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!324 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!325 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!326 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!327 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "Version", scope: !330, file: !331, line: 3, type: !102, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!332 = !{!328}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "file_name", scope: !335, file: !336, line: 45, type: !102, isLocal: true, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !337, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!337 = !{!333, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !335, file: !336, line: 55, type: !116, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !342, file: !343, line: 66, type: !378, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!344 = !{!96, !104}
!345 = !{!346, !372, !340, !374, !376}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "old_file_name", scope: !348, file: !343, line: 304, type: !102, isLocal: true, isDefinition: true)
!348 = distinct !DISubprogram(name: "verror_at_line", scope: !343, file: !343, line: 298, type: !349, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !365)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !97, !97, !102, !7, !102, !351}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !352, line: 52, baseType: !353)
!352 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !354, line: 32, baseType: !355)
!354 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !356, baseType: !357)
!356 = !DIFile(filename: "lib/error.c", directory: "/src")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !358, size: 256, elements: !359)
!358 = !DINamespace(name: "std", scope: null)
!359 = !{!360, !361, !362, !363, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !357, file: !356, baseType: !96, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !357, file: !356, baseType: !96, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !357, file: !356, baseType: !96, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !357, file: !356, baseType: !97, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !357, file: !356, baseType: !97, size: 32, offset: 224)
!365 = !{!366, !367, !368, !369, !370, !371}
!366 = !DILocalVariable(name: "status", arg: 1, scope: !348, file: !343, line: 298, type: !97)
!367 = !DILocalVariable(name: "errnum", arg: 2, scope: !348, file: !343, line: 298, type: !97)
!368 = !DILocalVariable(name: "file_name", arg: 3, scope: !348, file: !343, line: 298, type: !102)
!369 = !DILocalVariable(name: "line_number", arg: 4, scope: !348, file: !343, line: 298, type: !7)
!370 = !DILocalVariable(name: "message", arg: 5, scope: !348, file: !343, line: 298, type: !102)
!371 = !DILocalVariable(name: "args", arg: 6, scope: !348, file: !343, line: 298, type: !351)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "old_line_number", scope: !348, file: !343, line: 305, type: !7, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "error_message_count", scope: !342, file: !343, line: 69, type: !7, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !342, file: !343, line: 295, type: !97, isLocal: false, isDefinition: true)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !383, file: !384, line: 93, type: !97, isLocal: true, isDefinition: true)
!383 = distinct !DISubprogram(name: "statvfs_works", scope: !384, file: !384, line: 91, type: !385, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !387, retainedNodes: !390)
!384 = !DIFile(filename: "lib/fsusage.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fab138654d25fc15b75ea3e349807dd1")
!385 = !DISubroutineType(types: !386)
!386 = !{!97}
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !388, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !{!109}
!389 = !{!381}
!390 = !{!391}
!391 = !DILocalVariable(name: "name", scope: !392, file: !384, line: 96, type: !394)
!392 = distinct !DILexicalBlock(scope: !393, file: !384, line: 95, column: 5)
!393 = distinct !DILexicalBlock(scope: !383, file: !384, line: 94, column: 7)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !395, line: 48, size: 3120, elements: !396)
!395 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/utsname.h", directory: "", checksumkind: CSK_MD5, checksum: "025e6c1b1c47580289242d1d03561cee")
!396 = !{!397, !401, !402, !403, !404, !405}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !394, file: !395, line: 51, baseType: !398, size: 520)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 520, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 65)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !394, file: !395, line: 54, baseType: !398, size: 520, offset: 520)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !394, file: !395, line: 57, baseType: !398, size: 520, offset: 1040)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !394, file: !395, line: 59, baseType: !398, size: 520, offset: 1560)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !394, file: !395, line: 62, baseType: !398, size: 520, offset: 2080)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !394, file: !395, line: 67, baseType: !398, size: 520, offset: 2600)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "default_tuning", scope: !408, file: !409, line: 134, type: !413, isLocal: true, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !412, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!410 = !{!101, !96, !411, !99}
!411 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!412 = !{!406}
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !294, line: 52, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !294, line: 40, size: 160, elements: !416)
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !415, file: !294, line: 45, baseType: !411, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !415, file: !294, line: 46, baseType: !411, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !415, file: !294, line: 47, baseType: !411, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !415, file: !294, line: 48, baseType: !411, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !415, file: !294, line: 49, baseType: !116, size: 8, offset: 128)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "power_letter", scope: !424, file: !425, line: 36, type: !443, isLocal: true, isDefinition: true)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !426, retainedTypes: !427, globals: !430, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!426 = !{!21, !5}
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!430 = !{!422, !431, !437}
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "block_size_args", scope: !424, file: !425, line: 398, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !435)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!435 = !{!436}
!436 = !DISubrange(count: 3)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !424, file: !425, line: 399, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 64, elements: !441)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!441 = !{!442}
!442 = !DISubrange(count: 2)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 88, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 11)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "internal_state", scope: !448, file: !449, line: 97, type: !452, isLocal: true, isDefinition: true)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !450, globals: !451, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!450 = !{!96, !99, !104}
!451 = !{!446}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !453, line: 6, baseType: !454)
!453 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !455, line: 21, baseType: !456)
!455 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 13, size: 64, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !456, file: !455, line: 15, baseType: !97, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !456, file: !455, line: 20, baseType: !460, size: 32, offset: 32)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !456, file: !455, line: 16, size: 32, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !460, file: !455, line: 18, baseType: !7, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !460, file: !455, line: 19, baseType: !464, size: 32)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 32, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 4)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "program_name", scope: !469, file: !470, line: 31, type: !102, isLocal: false, isDefinition: true)
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !471, globals: !472, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!471 = !{!94}
!472 = !{!467}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "utf07FF", scope: !475, file: !476, line: 46, type: !501, isLocal: true, isDefinition: true)
!475 = distinct !DISubprogram(name: "proper_name_lite", scope: !476, file: !476, line: 38, type: !477, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !481)
!476 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!477 = !DISubroutineType(types: !478)
!478 = !{!102, !102, !102}
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !480, splitDebugInlining: false, nameTableKind: None)
!480 = !{!473}
!481 = !{!482, !483, !484, !485, !490}
!482 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !475, file: !476, line: 38, type: !102)
!483 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !475, file: !476, line: 38, type: !102)
!484 = !DILocalVariable(name: "translation", scope: !475, file: !476, line: 40, type: !102)
!485 = !DILocalVariable(name: "w", scope: !475, file: !476, line: 47, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !487, line: 37, baseType: !488)
!487 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !108, line: 57, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !108, line: 42, baseType: !7)
!490 = !DILocalVariable(name: "mbs", scope: !475, file: !476, line: 48, type: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !453, line: 6, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !455, line: 21, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 13, size: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !493, file: !455, line: 15, baseType: !97, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !493, file: !455, line: 20, baseType: !497, size: 32, offset: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !493, file: !455, line: 16, size: 32, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !497, file: !455, line: 18, baseType: !7, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !497, file: !455, line: 19, baseType: !464, size: 32)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 16, elements: !441)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !504, file: !505, line: 76, type: !573, isLocal: false, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !506, retainedTypes: !512, globals: !513, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!506 = !{!34, !507, !63}
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !35, line: 254, baseType: !7, size: 32, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!510 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!511 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!512 = !{!97, !98, !99}
!513 = !{!502, !514, !520, !532, !534, !539, !562, !569, !571}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !504, file: !505, line: 92, type: !516, isLocal: false, isDefinition: true)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 320, elements: !518)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!518 = !{!519}
!519 = !DISubrange(count: 10)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !504, file: !505, line: 1040, type: !522, isLocal: false, isDefinition: true)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !505, line: 56, size: 448, elements: !523)
!523 = !{!524, !525, !526, !530, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !522, file: !505, line: 59, baseType: !34, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !522, file: !505, line: 62, baseType: !97, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !522, file: !505, line: 66, baseType: !527, size: 256, offset: 64)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !522, file: !505, line: 69, baseType: !102, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !522, file: !505, line: 72, baseType: !102, size: 64, offset: 384)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !504, file: !505, line: 107, type: !522, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "slot0", scope: !504, file: !505, line: 831, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 2048, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 256)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quote", scope: !541, file: !505, line: 228, type: !560, isLocal: true, isDefinition: true)
!541 = distinct !DISubprogram(name: "gettext_quote", scope: !505, file: !505, line: 197, type: !542, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!102, !102, !34}
!544 = !{!545, !546, !547, !548, !549}
!545 = !DILocalVariable(name: "msgid", arg: 1, scope: !541, file: !505, line: 197, type: !102)
!546 = !DILocalVariable(name: "s", arg: 2, scope: !541, file: !505, line: 197, type: !34)
!547 = !DILocalVariable(name: "translation", scope: !541, file: !505, line: 199, type: !102)
!548 = !DILocalVariable(name: "w", scope: !541, file: !505, line: 229, type: !486)
!549 = !DILocalVariable(name: "mbs", scope: !541, file: !505, line: 230, type: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !453, line: 6, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !455, line: 21, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 13, size: 64, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !552, file: !455, line: 15, baseType: !97, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !552, file: !455, line: 20, baseType: !556, size: 32, offset: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !552, file: !455, line: 16, size: 32, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !556, file: !455, line: 18, baseType: !7, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !556, file: !455, line: 19, baseType: !464, size: 32)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 64, elements: !561)
!561 = !{!442, !466}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "slotvec", scope: !504, file: !505, line: 834, type: !564, isLocal: true, isDefinition: true)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !505, line: 823, size: 128, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !565, file: !505, line: 825, baseType: !99, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !565, file: !505, line: 826, baseType: !94, size: 64, offset: 64)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "nslots", scope: !504, file: !505, line: 832, type: !97, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "slotvec0", scope: !504, file: !505, line: 833, type: !565, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 704, elements: !444)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !576, file: !577, line: 26, type: !579, isLocal: false, isDefinition: true)
!576 = distinct !DICompileUnit(language: DW_LANG_C99, file: !577, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !578, splitDebugInlining: false, nameTableKind: None)
!577 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!578 = !{!574}
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 376, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 47)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "exit_failure", scope: !584, file: !585, line: 24, type: !587, isLocal: false, isDefinition: true)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!586 = !{!582}
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !97)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !590, file: !591, line: 65, type: !595, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !592, retainedTypes: !593, globals: !594, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!592 = !{!34}
!593 = !{!96, !102, !104}
!594 = !{!588}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !596, line: 69, baseType: !378)
!596 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !599, file: !600, line: 506, type: !97, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !600, file: !600, line: 485, type: !601, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !603, retainedNodes: !605)
!600 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!601 = !DISubroutineType(types: !602)
!602 = !{!97, !97, !97}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !604, splitDebugInlining: false, nameTableKind: None)
!604 = !{!597}
!605 = !{!606, !607, !608, !609, !612}
!606 = !DILocalVariable(name: "fd", arg: 1, scope: !599, file: !600, line: 485, type: !97)
!607 = !DILocalVariable(name: "target", arg: 2, scope: !599, file: !600, line: 485, type: !97)
!608 = !DILocalVariable(name: "result", scope: !599, file: !600, line: 487, type: !97)
!609 = !DILocalVariable(name: "flags", scope: !610, file: !600, line: 530, type: !97)
!610 = distinct !DILexicalBlock(scope: !611, file: !600, line: 529, column: 5)
!611 = distinct !DILexicalBlock(scope: !599, file: !600, line: 528, column: 7)
!612 = !DILocalVariable(name: "saved_errno", scope: !613, file: !600, line: 533, type: !97)
!613 = distinct !DILexicalBlock(scope: !614, file: !600, line: 532, column: 9)
!614 = distinct !DILexicalBlock(scope: !610, file: !600, line: 531, column: 11)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !617, file: !618, line: 211, type: !802, isLocal: true, isDefinition: true)
!617 = distinct !DISubprogram(name: "printf_fetchargs", scope: !618, file: !618, line: 42, type: !619, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !797)
!618 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!619 = !DISubroutineType(types: !620)
!620 = !{!97, !621, !631}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !354, line: 14, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !623, baseType: !624)
!623 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !358, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !624, file: !623, baseType: !96, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !624, file: !623, baseType: !96, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !624, file: !623, baseType: !96, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !624, file: !623, baseType: !97, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !624, file: !623, baseType: !97, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !633, line: 185, baseType: !634)
!633 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 179, size: 1920, elements: !635)
!635 = !{!636, !637, !789}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !634, file: !633, line: 181, baseType: !99, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !634, file: !633, line: 182, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !633, line: 174, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 111, size: 256, elements: !641)
!641 = !{!642, !693}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !640, file: !633, line: 113, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !633, line: 108, baseType: !644)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !633, line: 47, baseType: !7, size: 32, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!646 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!647 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!648 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!649 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!650 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!651 = !DIEnumerator(name: "TYPE_INT", value: 5)
!652 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!653 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!654 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!655 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!656 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!657 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!658 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!659 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!660 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!661 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!662 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!663 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!664 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!665 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!666 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!667 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!668 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!669 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!670 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!671 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!672 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!673 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!674 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!675 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!676 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!677 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!678 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!679 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!680 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!681 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!682 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!683 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!684 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!685 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!686 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!687 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!688 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!689 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!690 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!691 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!692 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !640, file: !633, line: 172, baseType: !694, size: 128, offset: 128)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !633, line: 114, size: 128, elements: !695)
!695 = !{!696, !697, !698, !700, !701, !702, !703, !704, !705, !707, !709, !713, !717, !720, !723, !726, !728, !731, !734, !736, !738, !740, !742, !744, !746, !748, !750, !751, !752, !754, !755, !758, !759, !763, !764, !766, !768, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !694, file: !633, line: 116, baseType: !212, size: 8)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !694, file: !633, line: 117, baseType: !104, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !694, file: !633, line: 118, baseType: !699, size: 16)
!699 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !694, file: !633, line: 119, baseType: !98, size: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !694, file: !633, line: 120, baseType: !97, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !694, file: !633, line: 121, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !694, file: !633, line: 122, baseType: !209, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !694, file: !633, line: 123, baseType: !101, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !694, file: !633, line: 124, baseType: !706, size: 64)
!706 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !694, file: !633, line: 125, baseType: !708, size: 64)
!708 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !694, file: !633, line: 126, baseType: !710, size: 8)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !711, line: 24, baseType: !712)
!711 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !108, line: 37, baseType: !212)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !694, file: !633, line: 127, baseType: !714, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !715, line: 24, baseType: !716)
!715 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !108, line: 38, baseType: !104)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !694, file: !633, line: 128, baseType: !718, size: 16)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !711, line: 25, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !108, line: 39, baseType: !699)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !694, file: !633, line: 129, baseType: !721, size: 16)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !715, line: 25, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !108, line: 40, baseType: !98)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !694, file: !633, line: 130, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !711, line: 26, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !108, line: 41, baseType: !97)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !694, file: !633, line: 131, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !715, line: 26, baseType: !489)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !694, file: !633, line: 132, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !711, line: 27, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !108, line: 44, baseType: !209)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !694, file: !633, line: 133, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !715, line: 27, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !108, line: 45, baseType: !101)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !694, file: !633, line: 134, baseType: !735, size: 8)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !110, line: 58, baseType: !212)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !694, file: !633, line: 135, baseType: !737, size: 8)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !110, line: 71, baseType: !104)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !694, file: !633, line: 136, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !110, line: 60, baseType: !209)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !694, file: !633, line: 137, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !110, line: 73, baseType: !101)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !694, file: !633, line: 138, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !110, line: 61, baseType: !209)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !694, file: !633, line: 139, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !110, line: 74, baseType: !101)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !694, file: !633, line: 140, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !110, line: 62, baseType: !209)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !694, file: !633, line: 141, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !110, line: 75, baseType: !101)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !694, file: !633, line: 142, baseType: !411, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !694, file: !633, line: 143, baseType: !112, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !694, file: !633, line: 144, baseType: !753, size: 128)
!753 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !694, file: !633, line: 145, baseType: !97, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !694, file: !633, line: 147, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !757, line: 20, baseType: !7)
!757 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!758 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !694, file: !633, line: 149, baseType: !102, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !694, file: !633, line: 150, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !100, line: 74, baseType: !7)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !694, file: !633, line: 151, baseType: !96, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !694, file: !633, line: 152, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !694, file: !633, line: 153, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !694, file: !633, line: 154, baseType: !316, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !694, file: !633, line: 155, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !694, file: !633, line: 156, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !694, file: !633, line: 157, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !694, file: !633, line: 158, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !694, file: !633, line: 159, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !694, file: !633, line: 160, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !694, file: !633, line: 161, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !694, file: !633, line: 162, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !694, file: !633, line: 163, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !694, file: !633, line: 164, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !634, file: !633, line: 183, baseType: !790, size: 1792, offset: 128)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 1792, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 7)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !795, globals: !796, splitDebugInlining: false, nameTableKind: None)
!794 = !{!644}
!795 = !{!96}
!796 = !{!615}
!797 = !{!798, !799, !800, !801}
!798 = !DILocalVariable(name: "args", arg: 1, scope: !617, file: !618, line: 42, type: !621)
!799 = !DILocalVariable(name: "a", arg: 2, scope: !617, file: !618, line: 42, type: !631)
!800 = !DILocalVariable(name: "i", scope: !617, file: !618, line: 44, type: !99)
!801 = !DILocalVariable(name: "ap", scope: !617, file: !618, line: 45, type: !638)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 224, elements: !791)
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !592, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "src/find-mount-point.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02c11bacc56618f441de1ed8fb506d8b")
!805 = distinct !DICompileUnit(language: DW_LANG_C99, file: !806, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!806 = !DIFile(filename: "lib/c-ctype.c", directory: "/src", checksumkind: CSK_MD5, checksum: "245df19f202f37bba31cfa46647ceb93")
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !809, retainedTypes: !795, globals: !810, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!809 = !{!86}
!810 = !{!811}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !807, file: !808, line: 110, type: !501, isLocal: true, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!819 = !{!96, !94}
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!827 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !832, retainedTypes: !833, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "lib/mbswidth.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5547599ee8935b5c6a098eaefb8b2ab0")
!832 = !{!63}
!833 = !{!99, !104, !97, !98}
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !836, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "lib/mountlist.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9c45539f6f3902bf91fbce80e7cbadbc")
!836 = !{!96, !107}
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "lib/save-cwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50106651149ed8104fc2255edd6d8bae")
!841 = distinct !DICompileUnit(language: DW_LANG_C99, file: !842, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !843, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!842 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!843 = !{!844}
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !842, line: 40, baseType: !7, size: 32, elements: !845)
!845 = !{!846}
!846 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !849, retainedTypes: !877, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!849 = !{!850, !862}
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !851, file: !848, line: 188, baseType: !7, size: 32, elements: !860)
!851 = distinct !DISubprogram(name: "x2nrealloc", scope: !848, file: !848, line: 176, type: !852, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !855)
!852 = !DISubroutineType(types: !853)
!853 = !{!96, !96, !854, !99}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!855 = !{!856, !857, !858, !859}
!856 = !DILocalVariable(name: "p", arg: 1, scope: !851, file: !848, line: 176, type: !96)
!857 = !DILocalVariable(name: "pn", arg: 2, scope: !851, file: !848, line: 176, type: !854)
!858 = !DILocalVariable(name: "s", arg: 3, scope: !851, file: !848, line: 176, type: !99)
!859 = !DILocalVariable(name: "n", scope: !851, file: !848, line: 178, type: !99)
!860 = !{!861}
!861 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !863, file: !848, line: 228, baseType: !7, size: 32, elements: !860)
!863 = distinct !DISubprogram(name: "xpalloc", scope: !848, file: !848, line: 223, type: !864, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !867)
!864 = !DISubroutineType(types: !865)
!865 = !{!96, !96, !866, !248, !250, !248}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876}
!868 = !DILocalVariable(name: "pa", arg: 1, scope: !863, file: !848, line: 223, type: !96)
!869 = !DILocalVariable(name: "pn", arg: 2, scope: !863, file: !848, line: 223, type: !866)
!870 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !863, file: !848, line: 223, type: !248)
!871 = !DILocalVariable(name: "n_max", arg: 4, scope: !863, file: !848, line: 223, type: !250)
!872 = !DILocalVariable(name: "s", arg: 5, scope: !863, file: !848, line: 223, type: !248)
!873 = !DILocalVariable(name: "n0", scope: !863, file: !848, line: 230, type: !248)
!874 = !DILocalVariable(name: "n", scope: !863, file: !848, line: 237, type: !248)
!875 = !DILocalVariable(name: "nbytes", scope: !863, file: !848, line: 248, type: !248)
!876 = !DILocalVariable(name: "adjusted_nbytes", scope: !863, file: !848, line: 252, type: !248)
!877 = !{!94, !96, !116, !209, !101}
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "lib/xgetcwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3727157833d2e1ec9b24b353bc14eccb")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!884 = !{!5}
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !887, retainedTypes: !888, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!887 = !{!5, !63}
!888 = !{!97, !98, !94, !116, !101, !109}
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "lib/xasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "284d06af3d9f59048744c48dba404142")
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !471, splitDebugInlining: false, nameTableKind: None)
!894 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!895 = distinct !DICompileUnit(language: DW_LANG_C99, file: !896, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, splitDebugInlining: false, nameTableKind: None)
!896 = !DIFile(filename: "lib/chdir-long.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a14f8c4b948b101710631b0c38063252")
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!899 = distinct !DICompileUnit(language: DW_LANG_C99, file: !900, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!900 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !902, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!902 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!903 = distinct !DICompileUnit(language: DW_LANG_C99, file: !904, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "lib/filesystem-remote.c", directory: "/src", checksumkind: CSK_MD5, checksum: "73e09e483ee00f1c821ec6c55b60f815")
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !913, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!913 = !{!116, !101, !96}
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!915 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!916 = distinct !DICompileUnit(language: DW_LANG_C99, file: !917, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !819, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!922 = distinct !DICompileUnit(language: DW_LANG_C99, file: !923, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!923 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !795, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "lib/vaszprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "69851cb8a605f8ae9d51cb31a58ffe0c")
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !928, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!928 = !{!94, !99, !96, !102, !7}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !794, retainedTypes: !931, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!931 = !{!99, !932, !96, !987}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !633, line: 174, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 111, size: 256, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !934, file: !633, line: 113, baseType: !643, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !934, file: !633, line: 172, baseType: !938, size: 128, offset: 128)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !934, file: !633, line: 114, size: 128, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !938, file: !633, line: 116, baseType: !212, size: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !938, file: !633, line: 117, baseType: !104, size: 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !938, file: !633, line: 118, baseType: !699, size: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !938, file: !633, line: 119, baseType: !98, size: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !938, file: !633, line: 120, baseType: !97, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !938, file: !633, line: 121, baseType: !7, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !938, file: !633, line: 122, baseType: !209, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !938, file: !633, line: 123, baseType: !101, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !938, file: !633, line: 124, baseType: !706, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !938, file: !633, line: 125, baseType: !708, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !938, file: !633, line: 126, baseType: !710, size: 8)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !938, file: !633, line: 127, baseType: !714, size: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !938, file: !633, line: 128, baseType: !718, size: 16)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !938, file: !633, line: 129, baseType: !721, size: 16)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !938, file: !633, line: 130, baseType: !724, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !938, file: !633, line: 131, baseType: !727, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !938, file: !633, line: 132, baseType: !729, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !938, file: !633, line: 133, baseType: !732, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !938, file: !633, line: 134, baseType: !735, size: 8)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !938, file: !633, line: 135, baseType: !737, size: 8)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !938, file: !633, line: 136, baseType: !739, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !938, file: !633, line: 137, baseType: !741, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !938, file: !633, line: 138, baseType: !743, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !938, file: !633, line: 139, baseType: !745, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !938, file: !633, line: 140, baseType: !747, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !938, file: !633, line: 141, baseType: !749, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !938, file: !633, line: 142, baseType: !411, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !938, file: !633, line: 143, baseType: !112, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !938, file: !633, line: 144, baseType: !753, size: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !938, file: !633, line: 145, baseType: !97, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !938, file: !633, line: 147, baseType: !756, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !938, file: !633, line: 149, baseType: !102, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !938, file: !633, line: 150, baseType: !760, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !938, file: !633, line: 151, baseType: !96, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !938, file: !633, line: 152, baseType: !765, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !938, file: !633, line: 153, baseType: !767, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !938, file: !633, line: 154, baseType: !316, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !938, file: !633, line: 155, baseType: !770, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !938, file: !633, line: 156, baseType: !772, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !938, file: !633, line: 157, baseType: !774, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !938, file: !633, line: 158, baseType: !776, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !938, file: !633, line: 159, baseType: !778, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !938, file: !633, line: 160, baseType: !780, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !938, file: !633, line: 161, baseType: !782, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !938, file: !633, line: 162, baseType: !784, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !938, file: !633, line: 163, baseType: !786, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !938, file: !633, line: 164, baseType: !788, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !989, line: 67, baseType: !990)
!989 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 53, size: 704, elements: !991)
