; ModuleID = 'src/dir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.pending = type { i8*, i8*, i8, %struct.pending* }
%struct.timespec = type { i64, i64 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.fileinfo = type { i8*, i8*, i8*, %struct.stat, i32, i32, i8*, i8, i8, i32, i8, i32, i64 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.bin_str = type { i64, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.ignore_pattern = type { i8*, %struct.ignore_pattern* }

!65 = !DIEnumerator(name: "sort_version", value: 4)
!66 = !DIEnumerator(name: "sort_time", value: 5)
!67 = !DIEnumerator(name: "sort_none", value: 6)
!68 = !DIEnumerator(name: "sort_numtypes", value: 7)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "filetype", file: !3, line: 157, baseType: !6, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!71 = !DIEnumerator(name: "unknown", value: 0)
!72 = !DIEnumerator(name: "fifo", value: 1)
!73 = !DIEnumerator(name: "chardev", value: 2)
!74 = !DIEnumerator(name: "directory", value: 3)
!75 = !DIEnumerator(name: "blockdev", value: 4)
!76 = !DIEnumerator(name: "normal", value: 5)
!77 = !DIEnumerator(name: "symbolic_link", value: 6)
!78 = !DIEnumerator(name: "sock", value: 7)
!79 = !DIEnumerator(name: "whiteout", value: 8)
!80 = !DIEnumerator(name: "arg_directory", value: 9)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 120, baseType: !6, size: 32, elements: !83)
!82 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!83 = !{!84}
!84 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !86, line: 42, baseType: !6, size: 32, elements: !87)
!86 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!88 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!89 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!90 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!91 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!92 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!93 = !DIEnumerator(name: "c_quoting_style", value: 5)
!94 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!95 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!96 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!97 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!98 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ls_modes", file: !100, line: 1, baseType: !6, size: 32, elements: !101)
!100 = !DIFile(filename: "src/ls.h", directory: "/src", checksumkind: CSK_MD5, checksum: "27cd4a1e8b13d28b26c3d722b22eff4d")
!101 = !{!102, !103, !104}
!102 = !DIEnumerator(name: "LS_LS", value: 0)
!103 = !DIEnumerator(name: "LS_MULTI_COL", value: 1)
!104 = !DIEnumerator(name: "LS_LONG_FORMAT", value: 2)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acl_type", file: !3, line: 194, baseType: !6, size: 32, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIEnumerator(name: "ACL_T_NONE", value: 0)
!108 = !DIEnumerator(name: "ACL_T_UNKNOWN", value: 1)
!109 = !DIEnumerator(name: "ACL_T_LSM_CONTEXT_ONLY", value: 2)
!110 = !DIEnumerator(name: "ACL_T_YES", value: 3)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !112, file: !3, line: 1596, baseType: !6, size: 32, elements: !249)
!112 = distinct !DISubprogram(name: "signal_setup", scope: !3, file: !3, line: 1587, type: !113, scopeLine: 1588, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !116)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115}
!115 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!116 = !{!117, !118, !233, !235, !238, !240, !243, !246}
!117 = !DILocalVariable(name: "init", arg: 1, scope: !112, file: !3, line: 1587, type: !115)
!118 = !DILocalVariable(name: "act", scope: !119, file: !3, line: 1600, type: !121)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1599, column: 5)
!120 = distinct !DILexicalBlock(scope: !112, file: !3, line: 1598, column: 7)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !122, line: 27, size: 1216, elements: !123)
!122 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!123 = !{!124, !218, !228, !229}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !121, file: !122, line: 38, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !122, line: 31, size: 64, elements: !126)
!126 = !{!127, !134}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !125, file: !122, line: 34, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !129, line: 72, baseType: !130)
!129 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133}
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !125, file: !122, line: 36, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !133, !138, !174}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !140, line: 124, baseType: !141)
!140 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 36, size: 1024, elements: !142)
!142 = !{!143, !144, !145, !146, !147}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !141, file: !140, line: 38, baseType: !133, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !141, file: !140, line: 40, baseType: !133, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !141, file: !140, line: 42, baseType: !133, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !141, file: !140, line: 48, baseType: !133, size: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !141, file: !140, line: 123, baseType: !148, size: 896, offset: 128)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !140, line: 51, size: 896, elements: !149)
!149 = !{!150, !154, !162, !175, !181, !191, !207, !212}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !148, file: !140, line: 53, baseType: !151, size: 896)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 28)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !148, file: !140, line: 60, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 56, size: 64, elements: !156)
!156 = !{!157, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !155, file: !140, line: 58, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !159, line: 154, baseType: !133)
!159 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!160 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !155, file: !140, line: 59, baseType: !161, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !159, line: 146, baseType: !6)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !148, file: !140, line: 68, baseType: !163, size: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 63, size: 128, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !163, file: !140, line: 65, baseType: !133, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !163, file: !140, line: 66, baseType: !133, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !163, file: !140, line: 67, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !169, line: 30, baseType: !170)
!169 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !169, line: 24, size: 64, elements: !171)
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !170, file: !169, line: 26, baseType: !133, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !170, file: !169, line: 27, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !148, file: !140, line: 76, baseType: !176, size: 128)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 71, size: 128, elements: !177)
!177 = !{!178, !179, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !176, file: !140, line: 73, baseType: !158, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !176, file: !140, line: 74, baseType: !161, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !176, file: !140, line: 75, baseType: !168, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !148, file: !140, line: 86, baseType: !182, size: 256)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 79, size: 256, elements: !183)
!183 = !{!184, !185, !186, !187, !190}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !182, file: !140, line: 81, baseType: !158, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !182, file: !140, line: 82, baseType: !161, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !182, file: !140, line: 83, baseType: !133, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !182, file: !140, line: 84, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !159, line: 156, baseType: !189)
!189 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !182, file: !140, line: 85, baseType: !188, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !148, file: !140, line: 105, baseType: !192, size: 256)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 89, size: 256, elements: !193)
!193 = !{!194, !195, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !192, file: !140, line: 91, baseType: !174, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !192, file: !140, line: 93, baseType: !196, size: 16, offset: 64)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !192, file: !140, line: 104, baseType: !198, size: 128, offset: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !140, line: 94, size: 128, elements: !199)
!199 = !{!200, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !198, file: !140, line: 101, baseType: !201, size: 128)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !198, file: !140, line: 97, size: 128, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !201, file: !140, line: 99, baseType: !174, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !201, file: !140, line: 100, baseType: !174, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !198, file: !140, line: 103, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !159, line: 42, baseType: !6)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !148, file: !140, line: 112, baseType: !208, size: 128)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 108, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !208, file: !140, line: 110, baseType: !189, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !208, file: !140, line: 111, baseType: !133, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !148, file: !140, line: 121, baseType: !213, size: 128)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !140, line: 116, size: 128, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !213, file: !140, line: 118, baseType: !174, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !213, file: !140, line: 119, baseType: !133, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !213, file: !140, line: 120, baseType: !6, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !121, file: !122, line: 46, baseType: !219, size: 1024, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !220, line: 8, baseType: !221)
!220 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 5, size: 1024, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !221, file: !220, line: 7, baseType: !224, size: 1024)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 1024, elements: !226)
!225 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!226 = !{!227}
!227 = !DISubrange(count: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !121, file: !122, line: 49, baseType: !133, size: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !121, file: !122, line: 52, baseType: !230, size: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null}
!233 = !DILocalVariable(name: "j", scope: !234, file: !3, line: 1603, type: !133)
!234 = distinct !DILexicalBlock(scope: !119, file: !3, line: 1603, column: 7)
!235 = !DILocalVariable(name: "sig", scope: !236, file: !3, line: 1605, type: !133)
!236 = distinct !DILexicalBlock(scope: !237, file: !3, line: 1604, column: 9)
!237 = distinct !DILexicalBlock(scope: !234, file: !3, line: 1603, column: 7)
!238 = !DILocalVariable(name: "j", scope: !239, file: !3, line: 1614, type: !133)
!239 = distinct !DILexicalBlock(scope: !119, file: !3, line: 1614, column: 7)
!240 = !DILocalVariable(name: "sig", scope: !241, file: !3, line: 1616, type: !133)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 1615, column: 9)
!242 = distinct !DILexicalBlock(scope: !239, file: !3, line: 1614, column: 7)
!243 = !DILocalVariable(name: "j", scope: !244, file: !3, line: 1626, type: !133)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 1626, column: 7)
!245 = distinct !DILexicalBlock(scope: !120, file: !3, line: 1625, column: 5)
!246 = !DILocalVariable(name: "sig", scope: !247, file: !3, line: 1628, type: !133)
!247 = distinct !DILexicalBlock(scope: !248, file: !3, line: 1627, column: 9)
!248 = distinct !DILexicalBlock(scope: !244, file: !3, line: 1626, column: 7)
!249 = !{!250, !251}
!250 = !DIEnumerator(name: "nsigs", value: 22)
!251 = !DIEnumerator(name: "nstop", value: 1)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 703, baseType: !6, size: 32, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIEnumerator(name: "IGNORE_DEFAULT", value: 0)
!255 = !DIEnumerator(name: "IGNORE_DOT_AND_DOTDOT", value: 1)
!256 = !DIEnumerator(name: "IGNORE_MINIMAL", value: 2)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_type", file: !3, line: 466, baseType: !6, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIEnumerator(name: "time_mtime", value: 0)
!260 = !DIEnumerator(name: "time_ctime", value: 1)
!261 = !DIEnumerator(name: "time_atime", value: 2)
!262 = !DIEnumerator(name: "time_btime", value: 3)
!263 = !DIEnumerator(name: "time_numtypes", value: 4)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 47, baseType: !6, size: 32, elements: !266)
!265 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!267 = !DIEnumerator(name: "human_ceiling", value: 0)
!268 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!269 = !DIEnumerator(name: "human_floor", value: 2)
!270 = !DIEnumerator(name: "human_group_digits", value: 4)
!271 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!272 = !DIEnumerator(name: "human_autoscale", value: 16)
!273 = !DIEnumerator(name: "human_base_1024", value: 32)
!274 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!275 = !DIEnumerator(name: "human_SI", value: 128)
!276 = !DIEnumerator(name: "human_B", value: 256)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "when_type", file: !3, line: 582, baseType: !6, size: 32, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIEnumerator(name: "when_never", value: 0)
!280 = !DIEnumerator(name: "when_always", value: 1)
!281 = !DIEnumerator(name: "when_if_tty", value: 2)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !283, line: 30, baseType: !6, size: 32, elements: !284)
!283 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!284 = !{!285, !286, !287, !288, !289}
!285 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!286 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!287 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!288 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!289 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 998, baseType: !6, size: 32, elements: !291)
!291 = !{!292}
!292 = !DIEnumerator(name: "MIN_COLUMN_WIDTH", value: 3)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "time_style", file: !3, line: 443, baseType: !6, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298}
!295 = !DIEnumerator(name: "full_iso_time_style", value: 0)
!296 = !DIEnumerator(name: "long_iso_time_style", value: 1)
!297 = !DIEnumerator(name: "iso_time_style", value: 2)
!298 = !DIEnumerator(name: "locale_time_style", value: 3)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1326, baseType: !6, size: 32, elements: !300)
!300 = !{!301}
!301 = !DIEnumerator(name: "ABFORMAT_SIZE", value: 128)
!302 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !303, line: 41, baseType: !6, size: 32, elements: !304)
!303 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!305 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!306 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!307 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!308 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!309 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!310 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!311 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!312 = !DIEnumerator(name: "DAY_1", value: 131079)
!313 = !DIEnumerator(name: "DAY_2", value: 131080)
!314 = !DIEnumerator(name: "DAY_3", value: 131081)
!315 = !DIEnumerator(name: "DAY_4", value: 131082)
!316 = !DIEnumerator(name: "DAY_5", value: 131083)
!317 = !DIEnumerator(name: "DAY_6", value: 131084)
!318 = !DIEnumerator(name: "DAY_7", value: 131085)
!319 = !DIEnumerator(name: "ABMON_1", value: 131086)
!320 = !DIEnumerator(name: "ABMON_2", value: 131087)
!321 = !DIEnumerator(name: "ABMON_3", value: 131088)
!322 = !DIEnumerator(name: "ABMON_4", value: 131089)
!323 = !DIEnumerator(name: "ABMON_5", value: 131090)
!324 = !DIEnumerator(name: "ABMON_6", value: 131091)
!325 = !DIEnumerator(name: "ABMON_7", value: 131092)
!326 = !DIEnumerator(name: "ABMON_8", value: 131093)
!327 = !DIEnumerator(name: "ABMON_9", value: 131094)
!328 = !DIEnumerator(name: "ABMON_10", value: 131095)
!329 = !DIEnumerator(name: "ABMON_11", value: 131096)
!330 = !DIEnumerator(name: "ABMON_12", value: 131097)
!331 = !DIEnumerator(name: "MON_1", value: 131098)
!332 = !DIEnumerator(name: "MON_2", value: 131099)
!333 = !DIEnumerator(name: "MON_3", value: 131100)
!334 = !DIEnumerator(name: "MON_4", value: 131101)
!335 = !DIEnumerator(name: "MON_5", value: 131102)
!336 = !DIEnumerator(name: "MON_6", value: 131103)
!337 = !DIEnumerator(name: "MON_7", value: 131104)
!338 = !DIEnumerator(name: "MON_8", value: 131105)
!339 = !DIEnumerator(name: "MON_9", value: 131106)
!340 = !DIEnumerator(name: "MON_10", value: 131107)
!341 = !DIEnumerator(name: "MON_11", value: 131108)
!342 = !DIEnumerator(name: "MON_12", value: 131109)
!343 = !DIEnumerator(name: "AM_STR", value: 131110)
!344 = !DIEnumerator(name: "PM_STR", value: 131111)
!345 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!346 = !DIEnumerator(name: "D_FMT", value: 131113)
!347 = !DIEnumerator(name: "T_FMT", value: 131114)
!348 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!349 = !DIEnumerator(name: "ERA", value: 131116)
!350 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!351 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!352 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!353 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!354 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!355 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!356 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!357 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!358 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!359 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!360 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!361 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!362 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!363 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!364 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!365 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!366 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!367 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!368 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!369 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!370 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!371 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!372 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!373 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!374 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!375 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!376 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!377 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!378 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!379 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!380 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!381 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!382 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!383 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!384 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!385 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!386 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!387 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!388 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!389 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!390 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!391 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!392 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!393 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!394 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!395 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!396 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!397 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!398 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!399 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!400 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!401 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!402 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!403 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!404 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!405 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!406 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!407 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!408 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!409 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!410 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!411 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!412 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!413 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!414 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!415 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!416 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!417 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!418 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!419 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!420 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!421 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!422 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!423 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!424 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!425 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!426 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!427 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!428 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!429 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!430 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!431 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!432 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!433 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!434 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!435 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!436 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!437 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!438 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!439 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!440 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!441 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!442 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!443 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!444 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!445 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!446 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!447 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!448 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!449 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!450 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!451 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!452 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!453 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!454 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!455 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!456 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!457 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!458 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!459 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!460 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!461 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!462 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!463 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!464 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!465 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!466 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!467 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!468 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!469 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!470 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!471 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!472 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!473 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!474 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!475 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!476 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!477 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!478 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!479 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!480 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!481 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!482 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!483 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!484 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!485 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!486 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!487 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!488 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!489 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!490 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!491 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!492 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!493 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!494 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!495 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!496 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!497 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!498 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!499 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!500 = !DIEnumerator(name: "CODESET", value: 14)
!501 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!502 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!503 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!504 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!505 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!506 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!507 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!508 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!509 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!510 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!511 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!512 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!513 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!514 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!515 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!516 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!517 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!518 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!519 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!520 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!521 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!522 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!523 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!524 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!525 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!526 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!527 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!528 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!529 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!530 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!531 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!532 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!533 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!534 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!535 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!536 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!537 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!538 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!539 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!540 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!541 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!542 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!543 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!544 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!545 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!546 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!547 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!548 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!549 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!550 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!551 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!552 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!553 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!554 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!555 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!556 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!557 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!558 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!559 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!560 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!561 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!562 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!563 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!564 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!565 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!566 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!567 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!568 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!569 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!570 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!571 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!572 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!573 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!574 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!575 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!576 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!577 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!578 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!579 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!580 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!581 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!582 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!583 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!584 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!585 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!586 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!587 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!588 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!589 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!590 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!591 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!592 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!593 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!594 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!595 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!596 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!597 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!598 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!599 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!600 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!601 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!602 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!603 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!604 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!605 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!606 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!607 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!608 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!609 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!610 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!611 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!612 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!613 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!614 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!615 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!616 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!617 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!618 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!619 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!620 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!621 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!622 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!623 = !DIEnumerator(name: "THOUSEP", value: 65537)
!624 = !DIEnumerator(name: "__GROUPING", value: 65538)
!625 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!626 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!627 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!628 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!629 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!630 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!631 = !DIEnumerator(name: "__YESSTR", value: 327682)
!632 = !DIEnumerator(name: "__NOSTR", value: 327683)
!633 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!634 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!635 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!636 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!637 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!638 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!639 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!640 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!641 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!642 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!643 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!644 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!645 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!646 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!647 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!648 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!649 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!650 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!651 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!652 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!653 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!654 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!655 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!656 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!657 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!658 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!659 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!660 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!661 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!662 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!663 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!664 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!665 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!666 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!667 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!668 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!669 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!670 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!671 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!672 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!673 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!674 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!675 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!676 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!677 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!678 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!679 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!680 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!681 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!682 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!683 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!684 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!685 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!686 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!687 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1314, baseType: !6, size: 32, elements: !689)
!689 = !{!690}
!690 = !DIEnumerator(name: "MBSWIDTH_FLAGS", value: 3)
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "parse_state", file: !3, line: 2665, baseType: !6, size: 32, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698}
!693 = !DIEnumerator(name: "PS_START", value: 1)
!694 = !DIEnumerator(name: "PS_2", value: 2)
!695 = !DIEnumerator(name: "PS_3", value: 3)
!696 = !DIEnumerator(name: "PS_4", value: 4)
!697 = !DIEnumerator(name: "PS_DONE", value: 5)
!698 = !DIEnumerator(name: "PS_FAIL", value: 6)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !700, file: !3, line: 2476, baseType: !6, size: 32, elements: !722)
!700 = distinct !DISubprogram(name: "get_funky_string", scope: !3, file: !3, line: 2471, type: !701, scopeLine: 2473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !712)
!701 = !DISubroutineType(types: !702)
!702 = !{!115, !703, !706, !115, !709}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !711, line: 46, baseType: !225)
!711 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721}
!713 = !DILocalVariable(name: "dest", arg: 1, scope: !700, file: !3, line: 2471, type: !703)
!714 = !DILocalVariable(name: "src", arg: 2, scope: !700, file: !3, line: 2471, type: !706)
!715 = !DILocalVariable(name: "equals_end", arg: 3, scope: !700, file: !3, line: 2471, type: !115)
!716 = !DILocalVariable(name: "output_count", arg: 4, scope: !700, file: !3, line: 2472, type: !709)
!717 = !DILocalVariable(name: "num", scope: !700, file: !3, line: 2474, type: !705)
!718 = !DILocalVariable(name: "count", scope: !700, file: !3, line: 2475, type: !710)
!719 = !DILocalVariable(name: "state", scope: !700, file: !3, line: 2478, type: !699)
!720 = !DILocalVariable(name: "p", scope: !700, file: !3, line: 2479, type: !707)
!721 = !DILocalVariable(name: "q", scope: !700, file: !3, line: 2480, type: !704)
!722 = !{!723, !724, !725, !726, !727, !728, !729}
!723 = !DIEnumerator(name: "ST_GND", value: 0)
!724 = !DIEnumerator(name: "ST_BACKSLASH", value: 1)
!725 = !DIEnumerator(name: "ST_OCTAL", value: 2)
!726 = !DIEnumerator(name: "ST_HEX", value: 3)
!727 = !DIEnumerator(name: "ST_CARET", value: 4)
!728 = !DIEnumerator(name: "ST_END", value: 5)
!729 = !DIEnumerator(name: "ST_ERROR", value: 6)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "canonicalize_mode_t", file: !731, line: 33, baseType: !6, size: 32, elements: !732)
!731 = !DIFile(filename: "./lib/canonicalize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e78d7e061e2ee7b61b12ad7654b500f8")
!732 = !{!733, !734, !735, !736}
!733 = !DIEnumerator(name: "CAN_EXISTING", value: 0)
!734 = !DIEnumerator(name: "CAN_ALL_BUT_LAST", value: 1)
!735 = !DIEnumerator(name: "CAN_MISSING", value: 2)
!736 = !DIEnumerator(name: "CAN_NOLINKS", value: 4)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !738, line: 46, baseType: !6, size: 32, elements: !739)
!738 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!740 = !DIEnumerator(name: "_ISupper", value: 256)
!741 = !DIEnumerator(name: "_ISlower", value: 512)
!742 = !DIEnumerator(name: "_ISalpha", value: 1024)
!743 = !DIEnumerator(name: "_ISdigit", value: 2048)
!744 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!745 = !DIEnumerator(name: "_ISspace", value: 8192)
!746 = !DIEnumerator(name: "_ISprint", value: 16384)
!747 = !DIEnumerator(name: "_ISgraph", value: 32768)
!748 = !DIEnumerator(name: "_ISblank", value: 1)
!749 = !DIEnumerator(name: "_IScntrl", value: 2)
!750 = !DIEnumerator(name: "_ISpunct", value: 4)
!751 = !DIEnumerator(name: "_ISalnum", value: 8)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !753, line: 37, baseType: !6, size: 32, elements: !754)
!753 = !DIFile(filename: "./lib/acl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54678fc5d4a46d3d69a5a47343d33a9d")
!754 = !{!755, !756}
!755 = !DIEnumerator(name: "ACL_GET_SCONTEXT", value: 65536)
!756 = !DIEnumerator(name: "ACL_SYMLINK_FOLLOW", value: 131072)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 786, baseType: !6, size: 32, elements: !758)
!758 = !{!759}
!759 = !DIEnumerator(name: "TIME_STAMP_LEN_MAXIMUM", value: 1000)
!760 = !{!761, !174, !764, !767, !710, !707, !128, !225, !768, !704, !770, !133, !771, !772, !775, !115, !189}
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !762, line: 10, baseType: !763)
!762 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !159, line: 160, baseType: !189)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !765, line: 102, baseType: !766)
!765 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !159, line: 73, baseType: !225)
!767 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !159, line: 145, baseType: !225)
!771 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !773, line: 85, baseType: !774)
!773 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !159, line: 152, baseType: !189)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!776 = !{!777, !783, !836, !841, !843, !845, !847, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !876, !878, !880, !882, !884, !889, !891, !893, !899, !901, !903, !905, !911, !0, !913, !964, !966, !968, !973, !975, !977, !986, !992, !996, !1002, !1087, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !1133, !1139, !1146, !1148, !1150, !1154, !1159, !1163, !1165, !1169, !1171, !1177, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1197, !1199, !1203, !1209, !1211, !1217, !1219, !1228, !1232, !1280, !1282, !1285, !1288, !1291, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1317, !1346, !1348, !1350, !1353, !1362, !1364, !1366, !1381, !1391, !1413, !1434, !1442, !1445, !1476}
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "active_dir_set", scope: !2, file: !3, line: 326, type: !779, isLocal: true, isDefinition: true)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !781, line: 56, baseType: !782)
!781 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !781, line: 54, flags: DIFlagFwdDecl)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "cwd_file", scope: !2, file: !3, line: 337, type: !785, isLocal: true, isDefinition: true)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fileinfo", file: !3, line: 202, size: 1536, elements: !787)
!787 = !{!788, !789, !790, !791, !826, !827, !829, !830, !831, !832, !833, !834, !835}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !3, line: 205, baseType: !704, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !786, file: !3, line: 208, baseType: !704, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_name", scope: !786, file: !3, line: 211, baseType: !704, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !786, file: !3, line: 213, baseType: !792, size: 1024, offset: 192)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !793, line: 44, size: 1024, elements: !794)
!793 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!794 = !{!795, !796, !798, !800, !802, !803, !805, !806, !807, !808, !810, !811, !813, !820, !821, !822}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !792, file: !793, line: 46, baseType: !770, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !792, file: !793, line: 47, baseType: !797, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !159, line: 148, baseType: !225)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !792, file: !793, line: 48, baseType: !799, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !159, line: 150, baseType: !6)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !792, file: !793, line: 49, baseType: !801, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !159, line: 151, baseType: !6)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !792, file: !793, line: 50, baseType: !161, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !792, file: !793, line: 51, baseType: !804, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !159, line: 147, baseType: !6)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !792, file: !793, line: 52, baseType: !770, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !792, file: !793, line: 53, baseType: !770, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !792, file: !793, line: 54, baseType: !774, size: 64, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !792, file: !793, line: 55, baseType: !809, size: 32, offset: 448)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !159, line: 175, baseType: !133)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !792, file: !793, line: 56, baseType: !133, size: 32, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !792, file: !793, line: 57, baseType: !812, size: 64, offset: 512)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !159, line: 180, baseType: !189)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !792, file: !793, line: 65, baseType: !814, size: 128, offset: 576)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !815, line: 11, size: 128, elements: !816)
!815 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !814, file: !815, line: 16, baseType: !763, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !814, file: !815, line: 21, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !159, line: 197, baseType: !189)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !792, file: !793, line: 66, baseType: !814, size: 128, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !792, file: !793, line: 67, baseType: !814, size: 128, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !792, file: !793, line: 79, baseType: !823, size: 64, offset: 960)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 64, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 2)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !786, file: !3, line: 215, baseType: !69, size: 32, offset: 1216)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "linkmode", scope: !786, file: !3, line: 219, baseType: !828, size: 32, offset: 1248)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !773, line: 69, baseType: !799)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "scontext", scope: !786, file: !3, line: 222, baseType: !704, size: 64, offset: 1280)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stat_ok", scope: !786, file: !3, line: 224, baseType: !115, size: 8, offset: 1344)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "linkok", scope: !786, file: !3, line: 228, baseType: !115, size: 8, offset: 1352)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "acl_type", scope: !786, file: !3, line: 232, baseType: !105, size: 32, offset: 1376)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "has_capability", scope: !786, file: !3, line: 235, baseType: !115, size: 8, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "quoted", scope: !786, file: !3, line: 238, baseType: !133, size: 32, offset: 1440)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !786, file: !3, line: 241, baseType: !710, size: 64, offset: 1472)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "cwd_n_alloc", scope: !2, file: !3, line: 340, type: !838, isLocal: true, isDefinition: true)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !839, line: 130, baseType: !840)
!839 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !711, line: 35, baseType: !189)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "cwd_n_used", scope: !2, file: !3, line: 343, type: !838, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "color_symlink_as_referent", scope: !2, file: !3, line: 362, type: !115, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "hostname", scope: !2, file: !3, line: 364, type: !707, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "pending_dirs", scope: !2, file: !3, line: 388, type: !849, isLocal: true, isDefinition: true)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pending", file: !3, line: 377, size: 256, elements: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !3, line: 379, baseType: !704, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "realname", scope: !850, file: !3, line: 383, baseType: !704, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "command_line_arg", scope: !850, file: !3, line: 384, baseType: !115, size: 8, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !3, line: 385, baseType: !849, size: 64, offset: 192)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "current_time", scope: !2, file: !3, line: 393, type: !814, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "print_scontext", scope: !2, file: !3, line: 395, type: !115, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "format", scope: !2, file: !3, line: 438, type: !36, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "sort_type", scope: !2, file: !3, line: 494, type: !59, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "print_block_size", scope: !2, file: !3, line: 523, type: !115, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "dired", scope: !2, file: !3, line: 538, type: !115, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "indicator_style", scope: !2, file: !3, line: 555, type: !50, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "print_with_color", scope: !2, file: !3, line: 572, type: !115, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "print_hyperlink", scope: !2, file: !3, line: 574, type: !115, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "check_symlink_mode", scope: !2, file: !3, line: 676, type: !115, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "dereference", scope: !2, file: !3, line: 685, type: !43, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !3, line: 690, type: !115, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "immediate_dirs", scope: !2, file: !3, line: 695, type: !115, isLocal: true, isDefinition: true)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "directories_first", scope: !2, file: !3, line: 699, type: !115, isLocal: true, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "filename_quoting_options", scope: !2, file: !3, line: 746, type: !886, isLocal: true, isDefinition: true)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !888, line: 30, flags: DIFlagFwdDecl)
!888 = !DIFile(filename: "./lib/quote.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4a0796caa167d9859d28846ccf7a0d92")
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "tabsize", scope: !2, file: !3, line: 751, type: !710, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "print_dir_name", scope: !2, file: !3, line: 755, type: !115, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 764, type: !895, isLocal: true, isDefinition: true)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !896, line: 1039, baseType: !897)
!896 = !DIFile(filename: "./lib/time.h", directory: "/src")
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !896, line: 1039, flags: DIFlagFwdDecl)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "format_needs_stat", scope: !2, file: !3, line: 769, type: !115, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "format_needs_type", scope: !2, file: !3, line: 774, type: !115, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "format_needs_capability", scope: !2, file: !3, line: 778, type: !115, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "interrupt_signal", scope: !2, file: !3, line: 827, type: !907, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "sig_atomic_t", file: !909, line: 8, baseType: !910)
!909 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sig_atomic_t.h", directory: "", checksumkind: CSK_MD5, checksum: "d9236f7e3e7f10f53aa9d4cd97f503cf")
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sig_atomic_t", file: !159, line: 215, baseType: !133)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "stop_signal_count", scope: !2, file: !3, line: 831, type: !907, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "dired_obstack", scope: !2, file: !3, line: 1037, type: !915, isLocal: true, isDefinition: true)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !916, line: 210, size: 704, elements: !917)
!916 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!917 = !{!918, !919, !929, !930, !931, !932, !937, !938, !949, !960, !961, !962, !963}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !915, file: !916, line: 212, baseType: !710, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !915, file: !916, line: 213, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !916, line: 203, size: 128, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !921, file: !916, line: 205, baseType: !704, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !921, file: !916, line: 206, baseType: !920, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !921, file: !916, line: 207, baseType: !926, offset: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: -1)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !915, file: !916, line: 214, baseType: !704, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !915, file: !916, line: 215, baseType: !704, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !915, file: !916, line: 216, baseType: !704, size: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !915, file: !916, line: 221, baseType: !933, size: 64, offset: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !915, file: !916, line: 217, size: 64, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !933, file: !916, line: 219, baseType: !710, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !933, file: !916, line: 220, baseType: !174, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !915, file: !916, line: 222, baseType: !710, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !915, file: !916, line: 229, baseType: !939, size: 64, offset: 448)
!939 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !915, file: !916, line: 225, size: 64, elements: !940)
!940 = !{!941, !945}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !939, file: !916, line: 227, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!174, !710}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !939, file: !916, line: 228, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!174, !174, !710}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !915, file: !916, line: 234, baseType: !950, size: 64, offset: 512)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !915, file: !916, line: 230, size: 64, elements: !951)
!951 = !{!952, !956}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !950, file: !916, line: 232, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !174}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !950, file: !916, line: 233, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !174, !174}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !915, file: !916, line: 236, baseType: !174, size: 64, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !915, file: !916, line: 237, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !915, file: !916, line: 238, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !915, file: !916, line: 242, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "subdired_obstack", scope: !2, file: !3, line: 1044, type: !915, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "dev_ino_obstack", scope: !2, file: !3, line: 1057, type: !915, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "RFC3986", scope: !2, file: !3, line: 1306, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 2048, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 256)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "dired_pos", scope: !2, file: !3, line: 1005, type: !772, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "used_color", scope: !2, file: !3, line: 580, type: !115, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "color_indicator", scope: !2, file: !3, line: 626, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 3072, elements: !984)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_str", file: !3, line: 248, size: 128, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !980, file: !3, line: 250, baseType: !710, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !980, file: !3, line: 251, baseType: !707, size: 64, offset: 64)
!984 = !{!985}
!985 = !DISubrange(count: 24)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "stop_sig", scope: !112, file: !3, line: 1590, type: !988, isLocal: true, isDefinition: true)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 32, elements: !990)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!990 = !{!991}
!991 = !DISubrange(count: 1)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 823, type: !994, isLocal: true, isDefinition: true)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !995, line: 7, baseType: !219)
!995 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "term_sig", scope: !2, file: !998, line: 6, type: !999, isLocal: true, isDefinition: true)
!998 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 704, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 22)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "posix_prefix", scope: !1004, file: !3, line: 2392, type: !1084, isLocal: true, isDefinition: true)
!1004 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 1908, type: !1005, scopeLine: 1909, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1007)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!133, !133, !703}
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1020, !1021, !1024, !1031, !1033, !1035, !1037, !1040, !1041, !1053, !1056, !1061, !1064, !1065, !1069, !1072, !1073, !1076, !1077, !1078}
!1008 = !DILocalVariable(name: "argc", arg: 1, scope: !1004, file: !3, line: 1908, type: !133)
!1009 = !DILocalVariable(name: "argv", arg: 2, scope: !1004, file: !3, line: 1908, type: !703)
!1010 = !DILocalVariable(name: "time_style_option", scope: !1004, file: !3, line: 1910, type: !704)
!1011 = !DILocalVariable(name: "kibibytes_specified", scope: !1004, file: !3, line: 1913, type: !115)
!1012 = !DILocalVariable(name: "format_opt", scope: !1004, file: !3, line: 1914, type: !133)
!1013 = !DILocalVariable(name: "hide_control_chars_opt", scope: !1004, file: !3, line: 1915, type: !133)
!1014 = !DILocalVariable(name: "quoting_style_opt", scope: !1004, file: !3, line: 1916, type: !133)
!1015 = !DILocalVariable(name: "sort_opt", scope: !1004, file: !3, line: 1917, type: !133)
!1016 = !DILocalVariable(name: "tabsize_opt", scope: !1004, file: !3, line: 1918, type: !840)
!1017 = !DILocalVariable(name: "width_opt", scope: !1004, file: !3, line: 1919, type: !840)
!1018 = !DILocalVariable(name: "oi", scope: !1019, file: !3, line: 1923, type: !133)
!1019 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 1922, column: 5)
!1020 = !DILocalVariable(name: "c", scope: !1019, file: !3, line: 1924, type: !133)
!1021 = !DILocalVariable(name: "i", scope: !1022, file: !3, line: 2056, type: !133)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2055, column: 11)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1931, column: 9)
!1024 = !DILocalVariable(name: "hide", scope: !1025, file: !3, line: 2130, type: !1026)
!1025 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2129, column: 11)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ignore_pattern", file: !3, line: 721, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !1027, file: !3, line: 723, baseType: !707, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !3, line: 724, baseType: !1026, size: 64, offset: 64)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !3, line: 2162, type: !133)
!1032 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2161, column: 11)
!1033 = !DILocalVariable(name: "i", scope: !1034, file: !3, line: 2177, type: !133)
!1034 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2176, column: 11)
!1035 = !DILocalVariable(name: "e", scope: !1036, file: !3, line: 2212, type: !282)
!1036 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 2211, column: 11)
!1037 = !DILocalVariable(name: "ls_block_size", scope: !1038, file: !3, line: 2251, type: !707)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 2250, column: 5)
!1039 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2249, column: 7)
!1040 = !DILocalVariable(name: "linelen", scope: !1004, file: !3, line: 2274, type: !840)
!1041 = !DILocalVariable(name: "ws", scope: !1042, file: !3, line: 2281, type: !1046)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 2280, column: 9)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 2279, column: 11)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 2277, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2275, column: 7)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !1047, line: 27, size: 64, elements: !1048)
!1047 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/ioctl-types.h", directory: "", checksumkind: CSK_MD5, checksum: "9c5f7d5180137ced2d76aeb981aa912b")
!1048 = !{!1049, !1050, !1051, !1052}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !1046, file: !1047, line: 29, baseType: !771, size: 16)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !1046, file: !1047, line: 30, baseType: !771, size: 16, offset: 16)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !1046, file: !1047, line: 31, baseType: !771, size: 16, offset: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !1046, file: !1047, line: 32, baseType: !771, size: 16, offset: 48)
!1053 = !DILocalVariable(name: "p", scope: !1054, file: !3, line: 2290, type: !707)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 2289, column: 9)
!1055 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 2288, column: 11)
!1056 = !DILocalVariable(name: "p", scope: !1057, file: !3, line: 2318, type: !707)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !3, line: 2316, column: 9)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 2313, column: 11)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 2312, column: 5)
!1060 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2311, column: 7)
!1061 = !DILocalVariable(name: "tmp", scope: !1062, file: !3, line: 2321, type: !764)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 2320, column: 13)
!1063 = distinct !DILexicalBlock(scope: !1057, file: !3, line: 2319, column: 15)
!1064 = !DILocalVariable(name: "qs", scope: !1004, file: !3, line: 2338, type: !133)
!1065 = !DILocalVariable(name: "p", scope: !1066, file: !3, line: 2359, type: !707)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !3, line: 2359, column: 7)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 2358, column: 5)
!1068 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2357, column: 7)
!1069 = !DILocalVariable(name: "envstyle", scope: !1070, file: !3, line: 2383, type: !704)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 2382, column: 5)
!1071 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 2381, column: 7)
!1072 = !DILocalVariable(name: "style", scope: !1070, file: !3, line: 2384, type: !704)
!1073 = !DILocalVariable(name: "p0", scope: !1074, file: !3, line: 2403, type: !704)
!1074 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 2402, column: 9)
!1075 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 2401, column: 11)
!1076 = !DILocalVariable(name: "p0nl", scope: !1074, file: !3, line: 2404, type: !704)
!1077 = !DILocalVariable(name: "p1", scope: !1074, file: !3, line: 2405, type: !707)
!1078 = !DILocalVariable(name: "i", scope: !1079, file: !3, line: 2444, type: !133)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 2444, column: 19)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 2443, column: 17)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 2442, column: 19)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 2426, column: 13)
!1083 = distinct !DILexicalBlock(scope: !1075, file: !3, line: 2421, column: 9)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 56, elements: !1085)
!1085 = !{!1086}
!1086 = !DISubrange(count: 7)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 875, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 11520, elements: !1099)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1092, line: 50, size: 256, elements: !1093)
!1092 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!1093 = !{!1094, !1095, !1096, !1098}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !1092, line: 52, baseType: !707, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1091, file: !1092, line: 55, baseType: !133, size: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1091, file: !1092, line: 56, baseType: !1097, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1091, file: !1092, line: 57, baseType: !133, size: 32, offset: 192)
!1099 = !{!1100}
!1100 = !DISubrange(count: 45)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "ignore_mode", scope: !2, file: !3, line: 714, type: !252, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 475, type: !257, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "explicit_time", scope: !2, file: !3, line: 476, type: !115, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "print_owner", scope: !2, file: !3, line: 506, type: !115, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 526, type: !133, isLocal: true, isDefinition: true)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "file_human_output_opts", scope: !2, file: !3, line: 532, type: !133, isLocal: true, isDefinition: true)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 529, type: !764, isLocal: true, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(name: "file_output_block_size", scope: !2, file: !3, line: 533, type: !764, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "print_inode", scope: !2, file: !3, line: 680, type: !115, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "numeric_ids", scope: !2, file: !3, line: 519, type: !115, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "print_group", scope: !2, file: !3, line: 514, type: !115, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "sort_reverse", scope: !2, file: !3, line: 502, type: !115, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "ignore_patterns", scope: !2, file: !3, line: 727, type: !1026, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "when_types", scope: !2, file: !3, line: 974, type: !1129, isLocal: true, isDefinition: true)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 288, elements: !1131)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!1131 = !{!1132}
!1132 = !DISubrange(count: 9)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "when_args", scope: !2, file: !3, line: 967, type: !1135, isLocal: true, isDefinition: true)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 640, elements: !1137)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!1137 = !{!1138}
!1138 = !DISubrange(count: 10)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(name: "out_tty", scope: !1141, file: !3, line: 1897, type: !1145, isLocal: true, isDefinition: true)
!1141 = distinct !DISubprogram(name: "stdout_isatty", scope: !3, file: !3, line: 1895, type: !1142, scopeLine: 1896, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1144)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!115}
!1144 = !{}
!1145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(name: "print_author", scope: !2, file: !3, line: 510, type: !115, isLocal: true, isDefinition: true)
!1148 = !DIGlobalVariableExpression(var: !1149, expr: !DIExpression())
!1149 = distinct !DIGlobalVariable(name: "hide_patterns", scope: !2, file: !3, line: 731, type: !1026, isLocal: true, isDefinition: true)
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 943, type: !1152, isLocal: true, isDefinition: true)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1153, size: 224, elements: !1085)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 938, type: !1156, isLocal: true, isDefinition: true)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 8)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 958, type: !1161, isLocal: true, isDefinition: true)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 288, elements: !1131)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 950, type: !1135, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(name: "format_types", scope: !2, file: !3, line: 931, type: !1167, isLocal: true, isDefinition: true)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1168, size: 224, elements: !1085)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 926, type: !1156, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(name: "indicator_style_types", scope: !2, file: !3, line: 562, type: !1173, isLocal: true, isDefinition: true)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 128, elements: !1175)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!1175 = !{!1176}
!1176 = !DISubrange(count: 4)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(name: "indicator_style_args", scope: !2, file: !3, line: 558, type: !1179, isLocal: true, isDefinition: true)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 320, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 5)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(name: "eolbyte", scope: !2, file: !3, line: 1098, type: !705, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(name: "line_length", scope: !2, file: !3, line: 760, type: !710, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(name: "max_idx", scope: !2, file: !3, line: 994, type: !710, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(name: "qmark_funny_chars", scope: !2, file: !3, line: 742, type: !115, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(name: "align_variable_outer_quotes", scope: !2, file: !3, line: 350, type: !115, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "dirname_quoting_options", scope: !2, file: !3, line: 747, type: !886, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(name: "long_time_format", scope: !2, file: !3, line: 791, type: !1196, isLocal: true, isDefinition: true)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !824)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 451, type: !1179, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 455, type: !1201, isLocal: true, isDefinition: true)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 128, elements: !1175)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "abformat", scope: !2, file: !3, line: 1327, type: !1205, isLocal: true, isDefinition: true)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 24576, elements: !1206)
!1206 = !{!825, !1207, !1208}
!1207 = !DISubrange(count: 12)
!1208 = !DISubrange(count: 128)
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(name: "use_abformat", scope: !2, file: !3, line: 1331, type: !115, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !1213, line: 1, type: !1214, isLocal: true, isDefinition: true)
!1213 = !DIFile(filename: "src/dircolors.h", directory: "/src", checksumkind: CSK_MD5, checksum: "78932583f5d466470594a9a0cc5465b7")
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 44928, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 5616)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "color_buf", scope: !2, file: !3, line: 671, type: !704, isLocal: true, isDefinition: true)
!1219 = !DIGlobalVariableExpression(var: !1220, expr: !DIExpression())
!1220 = distinct !DIGlobalVariable(name: "color_ext_list", scope: !2, file: !3, line: 668, type: !1221, isLocal: true, isDefinition: true)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "color_ext_type", file: !3, line: 618, size: 384, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1222, file: !3, line: 620, baseType: !980, size: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1222, file: !3, line: 621, baseType: !980, size: 128, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !1222, file: !3, line: 622, baseType: !115, size: 8, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1222, file: !3, line: 623, baseType: !1221, size: 64, offset: 320)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(name: "indicator_name", scope: !2, file: !3, line: 607, type: !1230, isLocal: true, isDefinition: true)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 384, elements: !1231)
!1231 = !{!985, !825}
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "first", scope: !1234, file: !3, line: 2958, type: !115, isLocal: true, isDefinition: true)
!1234 = distinct !DISubprogram(name: "print_dir", scope: !3, file: !3, line: 2953, type: !1235, scopeLine: 2954, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1237)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !707, !707, !115}
!1237 = !{!1238, !1239, !1240, !1241, !1246, !1256, !1257, !1260, !1261, !1264, !1270, !1272, !1278, !1279}
!1238 = !DILocalVariable(name: "name", arg: 1, scope: !1234, file: !3, line: 2953, type: !707)
!1239 = !DILocalVariable(name: "realname", arg: 2, scope: !1234, file: !3, line: 2953, type: !707)
!1240 = !DILocalVariable(name: "command_line_arg", arg: 3, scope: !1234, file: !3, line: 2953, type: !115)
