; ModuleID = 'src/dircolors.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.33 }
%union.anon.33 = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 82, type: !245, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !144, globals: !146, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/dircolors.c", directory: "/src", checksumkind: CSK_MD5, checksum: "670b95ccf0215cde2984ed04e905f87d")
!4 = !{!5, !11, !26, !130}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shell_syntax", file: !3, line: 40, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10}
!8 = !DIEnumerator(name: "SHELL_SYNTAX_BOURNE", value: 0)
!9 = !DIEnumerator(name: "SHELL_SYNTAX_C", value: 1)
!10 = !DIEnumerator(name: "SHELL_SYNTAX_UNKNOWN", value: 2)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 46, baseType: !6, size: 32, elements: !13)
!12 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!14 = !DIEnumerator(name: "_ISupper", value: 256)
!15 = !DIEnumerator(name: "_ISlower", value: 512)
!16 = !DIEnumerator(name: "_ISalpha", value: 1024)
!17 = !DIEnumerator(name: "_ISdigit", value: 2048)
!18 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!19 = !DIEnumerator(name: "_ISspace", value: 8192)
!20 = !DIEnumerator(name: "_ISprint", value: 16384)
!21 = !DIEnumerator(name: "_ISgraph", value: 32768)
!22 = !DIEnumerator(name: "_ISblank", value: 1)
!23 = !DIEnumerator(name: "_IScntrl", value: 2)
!24 = !DIEnumerator(name: "_ISpunct", value: 4)
!25 = !DIEnumerator(name: "_ISalnum", value: 8)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !27, file: !3, line: 290, baseType: !6, size: 32, elements: !125)
!27 = distinct !DISubprogram(name: "dc_parse_stream", scope: !3, file: !3, line: 278, type: !28, scopeLine: 279, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !96)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !31, !94}
!30 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 7, baseType: !34)
!33 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 49, size: 1728, elements: !36)
!35 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!36 = !{!37, !39, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !57, !58, !59, !63, !65, !67, !71, !74, !76, !79, !82, !83, !85, !89, !90}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 51, baseType: !38, size: 32)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 54, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 55, baseType: !40, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 56, baseType: !40, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 57, baseType: !40, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 58, baseType: !40, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 59, baseType: !40, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 60, baseType: !40, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 61, baseType: !40, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 64, baseType: !40, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 65, baseType: !40, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 66, baseType: !40, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 70, baseType: !56, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 72, baseType: !38, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 73, baseType: !38, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 74, baseType: !60, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 152, baseType: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!62 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 77, baseType: !64, size: 16, offset: 1024)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 78, baseType: !66, size: 8, offset: 1040)
!66 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 79, baseType: !68, size: 8, offset: 1048)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 81, baseType: !72, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 43, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 89, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 153, baseType: !62)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !34, file: !35, line: 91, baseType: !77, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !35, line: 37, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !34, file: !35, line: 92, baseType: !80, size: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !35, line: 38, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !34, file: !35, line: 93, baseType: !56, size: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !34, file: !35, line: 94, baseType: !84, size: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 95, baseType: !86, size: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 46, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!88 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 96, baseType: !38, size: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 98, baseType: !91, size: 160, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!96 = !{!97, !98, !99, !103, !104, !105, !106, !107, !108, !109, !110, !111, !113, !114, !115}
!97 = !DILocalVariable(name: "fp", arg: 1, scope: !27, file: !3, line: 278, type: !31)
!98 = !DILocalVariable(name: "filename", arg: 2, scope: !27, file: !3, line: 278, type: !94)
!99 = !DILocalVariable(name: "line_number", scope: !27, file: !3, line: 280, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !101, line: 130, baseType: !102)
!101 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !87, line: 35, baseType: !62)
!103 = !DILocalVariable(name: "next_G_line", scope: !27, file: !3, line: 281, type: !94)
!104 = !DILocalVariable(name: "input_line", scope: !27, file: !3, line: 282, type: !40)
!105 = !DILocalVariable(name: "input_line_size", scope: !27, file: !3, line: 283, type: !86)
!106 = !DILocalVariable(name: "line", scope: !27, file: !3, line: 284, type: !94)
!107 = !DILocalVariable(name: "term", scope: !27, file: !3, line: 285, type: !94)
!108 = !DILocalVariable(name: "colorterm", scope: !27, file: !3, line: 286, type: !94)
!109 = !DILocalVariable(name: "ok", scope: !27, file: !3, line: 287, type: !30)
!110 = !DILocalVariable(name: "state", scope: !27, file: !3, line: 290, type: !26)
!111 = !DILocalVariable(name: "keywd", scope: !112, file: !3, line: 304, type: !40)
!112 = distinct !DILexicalBlock(scope: !27, file: !3, line: 303, column: 5)
!113 = !DILocalVariable(name: "arg", scope: !112, file: !3, line: 304, type: !40)
!114 = !DILocalVariable(name: "unrecognized", scope: !112, file: !3, line: 305, type: !30)
!115 = !DILocalVariable(name: "i", scope: !116, file: !3, line: 375, type: !38)
!116 = distinct !DILexicalBlock(scope: !117, file: !3, line: 374, column: 17)
!117 = distinct !DILexicalBlock(scope: !118, file: !3, line: 367, column: 24)
!118 = distinct !DILexicalBlock(scope: !119, file: !3, line: 365, column: 24)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 363, column: 19)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 362, column: 13)
!121 = distinct !DILexicalBlock(scope: !122, file: !3, line: 361, column: 15)
!122 = distinct !DILexicalBlock(scope: !123, file: !3, line: 357, column: 9)
!123 = distinct !DILexicalBlock(scope: !124, file: !3, line: 351, column: 16)
!124 = distinct !DILexicalBlock(scope: !112, file: !3, line: 346, column: 11)
!125 = !{!126, !127, !128, !129}
!126 = !DIEnumerator(name: "ST_TERMNO", value: 0)
!127 = !DIEnumerator(name: "ST_TERMYES", value: 1)
!128 = !DIEnumerator(name: "ST_TERMSURE", value: 2)
!129 = !DIEnumerator(name: "ST_GLOBAL", value: 3)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !131, line: 42, baseType: !6, size: 32, elements: !132)
!131 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!133 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!134 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!135 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!136 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!137 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!138 = !DIEnumerator(name: "c_quoting_style", value: 5)
!139 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!140 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!141 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!142 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!143 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!144 = !{!40, !84, !86, !88, !94, !38, !64, !145}
!145 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!146 = !{!147, !198, !200, !0, !231, !237, !243}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "lsc_obstack", scope: !2, file: !3, line: 51, type: !149, isLocal: true, isDefinition: true)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !150, line: 210, size: 704, elements: !151)
!150 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!151 = !{!152, !153, !163, !164, !165, !166, !171, !172, !183, !194, !195, !196, !197}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !149, file: !150, line: 212, baseType: !86, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !149, file: !150, line: 213, baseType: !154, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !150, line: 203, size: 128, elements: !156)
!156 = !{!157, !158, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !155, file: !150, line: 205, baseType: !40, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !150, line: 206, baseType: !154, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !155, file: !150, line: 207, baseType: !160, offset: 128)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: -1)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !149, file: !150, line: 214, baseType: !40, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !149, file: !150, line: 215, baseType: !40, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !149, file: !150, line: 216, baseType: !40, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !149, file: !150, line: 221, baseType: !167, size: 64, offset: 320)
!167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !150, line: 217, size: 64, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !167, file: !150, line: 219, baseType: !86, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !167, file: !150, line: 220, baseType: !84, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !149, file: !150, line: 222, baseType: !86, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !149, file: !150, line: 229, baseType: !173, size: 64, offset: 448)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !150, line: 225, size: 64, elements: !174)
!174 = !{!175, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !173, file: !150, line: 227, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!84, !86}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !173, file: !150, line: 228, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!84, !84, !86}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !149, file: !150, line: 234, baseType: !184, size: 64, offset: 512)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !149, file: !150, line: 230, size: 64, elements: !185)
!185 = !{!186, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !184, file: !150, line: 232, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !84}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !184, file: !150, line: 233, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !84, !84}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !149, file: !150, line: 236, baseType: !84, size: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !149, file: !150, line: 237, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !149, file: !150, line: 238, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !149, file: !150, line: 242, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "print_ls_colors", scope: !2, file: !3, line: 73, type: !30, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !202, file: !203, line: 575, type: !38, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "oputs_", scope: !203, file: !203, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !206)
!203 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!204 = !DISubroutineType(types: !205)
!205 = !{null, !94, !94}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !225, !226, !227, !229, !230}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !202, file: !203, line: 573, type: !94)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !202, file: !203, line: 573, type: !94)
!209 = !DILocalVariable(name: "term", scope: !210, file: !203, line: 585, type: !94)
!210 = distinct !DILexicalBlock(scope: !211, file: !203, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !202, file: !203, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !202, file: !203, line: 594, type: !30)
!213 = !DILocalVariable(name: "first_word", scope: !202, file: !203, line: 595, type: !94)
!214 = !DILocalVariable(name: "option_text", scope: !202, file: !203, line: 596, type: !94)
!215 = !DILocalVariable(name: "s", scope: !216, file: !203, line: 608, type: !94)
!216 = distinct !DILexicalBlock(scope: !217, file: !203, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !203, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !202, file: !203, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !203, line: 609, type: !86)
!220 = !DILocalVariable(name: "anchor_len", scope: !202, file: !203, line: 620, type: !86)
!221 = !DILocalVariable(name: "desc_text", scope: !202, file: !203, line: 625, type: !94)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !203, line: 644, type: !94)
!223 = distinct !DILexicalBlock(scope: !202, file: !203, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !203, line: 644, type: !31)
!225 = !DILocalVariable(name: "__cnt", scope: !223, file: !203, line: 644, type: !86)
!226 = !DILocalVariable(name: "url_program", scope: !202, file: !203, line: 648, type: !94)
!227 = !DILocalVariable(name: "__ptr", scope: !228, file: !203, line: 686, type: !94)
!228 = distinct !DILexicalBlock(scope: !202, file: !203, line: 686, column: 3)
!229 = !DILocalVariable(name: "__stream", scope: !228, file: !203, line: 686, type: !31)
!230 = !DILocalVariable(name: "__cnt", scope: !228, file: !203, line: 686, type: !86)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "G_line", scope: !2, file: !233, line: 1, type: !234, isLocal: true, isDefinition: true)
!233 = !DIFile(filename: "src/dircolors.h", directory: "/src", checksumkind: CSK_MD5, checksum: "78932583f5d466470594a9a0cc5465b7")
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 44928, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 5616)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "slack_codes", scope: !2, file: !3, line: 53, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 2432, elements: !241)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!241 = !{!242}
!242 = !DISubrange(count: 38)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "ls_codes", scope: !2, file: !3, line: 63, type: !239, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 2304, elements: !255)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !248, line: 50, size: 256, elements: !249)
!248 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!249 = !{!250, !251, !252, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !248, line: 52, baseType: !94, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !247, file: !248, line: 55, baseType: !38, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !248, line: 56, baseType: !253, size: 64, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !247, file: !248, line: 57, baseType: !38, size: 32, offset: 192)
!255 = !{!256}
!256 = !DISubrange(count: 9)
!257 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "Version", scope: !260, file: !261, line: 3, type: !94, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !262, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!262 = !{!258}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "file_name", scope: !265, file: !266, line: 45, type: !94, isLocal: true, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !267, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!267 = !{!263, !268}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !265, file: !266, line: 55, type: !30, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !272, file: !273, line: 66, type: !308, isLocal: false, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!274 = !{!84, !145}
!275 = !{!276, !302, !270, !304, !306}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "old_file_name", scope: !278, file: !273, line: 304, type: !94, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "verror_at_line", scope: !273, file: !273, line: 298, type: !279, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !295)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !38, !38, !94, !6, !94, !281}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !282, line: 52, baseType: !283)
!282 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !284, line: 32, baseType: !285)
!284 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !286, baseType: !287)
!286 = !DIFile(filename: "lib/error.c", directory: "/src")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !288, size: 256, elements: !289)
!288 = !DINamespace(name: "std", scope: null)
!289 = !{!290, !291, !292, !293, !294}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !287, file: !286, baseType: !84, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !287, file: !286, baseType: !84, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !287, file: !286, baseType: !84, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !287, file: !286, baseType: !38, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !287, file: !286, baseType: !38, size: 32, offset: 224)
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DILocalVariable(name: "status", arg: 1, scope: !278, file: !273, line: 298, type: !38)
!297 = !DILocalVariable(name: "errnum", arg: 2, scope: !278, file: !273, line: 298, type: !38)
!298 = !DILocalVariable(name: "file_name", arg: 3, scope: !278, file: !273, line: 298, type: !94)
!299 = !DILocalVariable(name: "line_number", arg: 4, scope: !278, file: !273, line: 298, type: !6)
!300 = !DILocalVariable(name: "message", arg: 5, scope: !278, file: !273, line: 298, type: !94)
!301 = !DILocalVariable(name: "args", arg: 6, scope: !278, file: !273, line: 298, type: !281)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "old_line_number", scope: !278, file: !273, line: 305, type: !6, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "error_message_count", scope: !272, file: !273, line: 69, type: !6, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !272, file: !273, line: 295, type: !38, isLocal: false, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !313, file: !314, line: 53, type: !308, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/obstack.c", directory: "/src", checksumkind: CSK_MD5, checksum: "47f5bbc27e7c2d5a5cc3aab9403d8d27")
!315 = !{!30, !84, !40, !88}
!316 = !{!311}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "program_name", scope: !319, file: !320, line: 31, type: !94, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!321 = !{!40}
!322 = !{!317}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "utf07FF", scope: !325, file: !326, line: 46, type: !356, isLocal: true, isDefinition: true)
!325 = distinct !DISubprogram(name: "proper_name_lite", scope: !326, file: !326, line: 38, type: !327, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !329, retainedNodes: !331)
!326 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!327 = !DISubroutineType(types: !328)
!328 = !{!94, !94, !94}
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !330, splitDebugInlining: false, nameTableKind: None)
!330 = !{!323}
!331 = !{!332, !333, !334, !335, !340}
!332 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !325, file: !326, line: 38, type: !94)
!333 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !325, file: !326, line: 38, type: !94)
!334 = !DILocalVariable(name: "translation", scope: !325, file: !326, line: 40, type: !94)
!335 = !DILocalVariable(name: "w", scope: !325, file: !326, line: 47, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !337, line: 37, baseType: !338)
!337 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !61, line: 57, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !61, line: 42, baseType: !6)
!340 = !DILocalVariable(name: "mbs", scope: !325, file: !326, line: 48, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !343)
!342 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !345)
!344 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !345, file: !344, line: 15, baseType: !38, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !345, file: !344, line: 20, baseType: !349, size: 32, offset: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !344, line: 16, size: 32, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !349, file: !344, line: 18, baseType: !6, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !349, file: !344, line: 19, baseType: !353, size: 32)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 4)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 16, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 2)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !361, file: !362, line: 76, type: !430, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, retainedTypes: !369, globals: !370, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!363 = !{!130, !364, !11}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !131, line: 254, baseType: !6, size: 32, elements: !365)
!365 = !{!366, !367, !368}
!366 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!367 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!368 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!369 = !{!38, !64, !86}
!370 = !{!359, !371, !377, !389, !391, !396, !419, !426, !428}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !361, file: !362, line: 92, type: !373, isLocal: false, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 320, elements: !375)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!375 = !{!376}
!376 = !DISubrange(count: 10)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !361, file: !362, line: 1040, type: !379, isLocal: false, isDefinition: true)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !362, line: 56, size: 448, elements: !380)
!380 = !{!381, !382, !383, !387, !388}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !379, file: !362, line: 59, baseType: !130, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !362, line: 62, baseType: !38, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !379, file: !362, line: 66, baseType: !384, size: 256, offset: 64)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !379, file: !362, line: 69, baseType: !94, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !379, file: !362, line: 72, baseType: !94, size: 64, offset: 384)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !361, file: !362, line: 107, type: !379, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "slot0", scope: !361, file: !362, line: 831, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 256)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "quote", scope: !398, file: !362, line: 228, type: !417, isLocal: true, isDefinition: true)
!398 = distinct !DISubprogram(name: "gettext_quote", scope: !362, file: !362, line: 197, type: !399, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!94, !94, !130}
!401 = !{!402, !403, !404, !405, !406}
!402 = !DILocalVariable(name: "msgid", arg: 1, scope: !398, file: !362, line: 197, type: !94)
!403 = !DILocalVariable(name: "s", arg: 2, scope: !398, file: !362, line: 197, type: !130)
!404 = !DILocalVariable(name: "translation", scope: !398, file: !362, line: 199, type: !94)
!405 = !DILocalVariable(name: "w", scope: !398, file: !362, line: 229, type: !336)
!406 = !DILocalVariable(name: "mbs", scope: !398, file: !362, line: 230, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !409, file: !344, line: 15, baseType: !38, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !409, file: !344, line: 20, baseType: !413, size: 32, offset: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !409, file: !344, line: 16, size: 32, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !413, file: !344, line: 18, baseType: !6, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !413, file: !344, line: 19, baseType: !353, size: 32)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !418)
!418 = !{!358, !355}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "slotvec", scope: !361, file: !362, line: 834, type: !421, isLocal: true, isDefinition: true)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !362, line: 823, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !422, file: !362, line: 825, baseType: !86, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !422, file: !362, line: 826, baseType: !40, size: 64, offset: 64)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "nslots", scope: !361, file: !362, line: 832, type: !38, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "slotvec0", scope: !361, file: !362, line: 833, type: !422, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 704, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 11)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !435, file: !436, line: 26, type: !438, isLocal: false, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !437, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!437 = !{!433}
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 376, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 47)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "exit_failure", scope: !443, file: !444, line: 24, type: !446, isLocal: false, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!445 = !{!441}
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "internal_state", scope: !449, file: !450, line: 97, type: !453, isLocal: true, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !451, globals: !452, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!451 = !{!84, !86, !145}
!452 = !{!447}
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !342, line: 6, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !344, line: 21, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 64, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !455, file: !344, line: 15, baseType: !38, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !455, file: !344, line: 20, baseType: !459, size: 32, offset: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !455, file: !344, line: 16, size: 32, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !459, file: !344, line: 18, baseType: !6, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !459, file: !344, line: 19, baseType: !353, size: 32)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/c-strcasecmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7d8203371740f321f2a78256f94ab3b7")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!474 = !{!84}
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!476 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !474, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!483 = !{!484}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 40, baseType: !6, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !489, retainedTypes: !517, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!489 = !{!490, !502}
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !491, file: !488, line: 188, baseType: !6, size: 32, elements: !500)
!491 = distinct !DISubprogram(name: "x2nrealloc", scope: !488, file: !488, line: 176, type: !492, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !487, retainedNodes: !495)
!492 = !DISubroutineType(types: !493)
!493 = !{!84, !84, !494, !86}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!495 = !{!496, !497, !498, !499}
!496 = !DILocalVariable(name: "p", arg: 1, scope: !491, file: !488, line: 176, type: !84)
!497 = !DILocalVariable(name: "pn", arg: 2, scope: !491, file: !488, line: 176, type: !494)
!498 = !DILocalVariable(name: "s", arg: 3, scope: !491, file: !488, line: 176, type: !86)
!499 = !DILocalVariable(name: "n", scope: !491, file: !488, line: 178, type: !86)
!500 = !{!501}
!501 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!502 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !503, file: !488, line: 228, baseType: !6, size: 32, elements: !500)
!503 = distinct !DISubprogram(name: "xpalloc", scope: !488, file: !488, line: 223, type: !504, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !487, retainedNodes: !507)
!504 = !DISubroutineType(types: !505)
!505 = !{!84, !84, !506, !100, !102, !100}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516}
!508 = !DILocalVariable(name: "pa", arg: 1, scope: !503, file: !488, line: 223, type: !84)
!509 = !DILocalVariable(name: "pn", arg: 2, scope: !503, file: !488, line: 223, type: !506)
!510 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !503, file: !488, line: 223, type: !100)
!511 = !DILocalVariable(name: "n_max", arg: 4, scope: !503, file: !488, line: 223, type: !102)
!512 = !DILocalVariable(name: "s", arg: 5, scope: !503, file: !488, line: 223, type: !100)
!513 = !DILocalVariable(name: "n0", scope: !503, file: !488, line: 230, type: !100)
!514 = !DILocalVariable(name: "n", scope: !503, file: !488, line: 237, type: !100)
!515 = !DILocalVariable(name: "nbytes", scope: !503, file: !488, line: 248, type: !100)
!516 = !DILocalVariable(name: "adjusted_nbytes", scope: !503, file: !488, line: 252, type: !100)
!517 = !{!40, !84, !30, !62, !88}
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !524, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!524 = !{!30, !88, !84}
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!531 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!532 = !{i32 7, !"Dwarf Version", i32 5}
!533 = !{i32 2, !"Debug Info Version", i32 3}
!534 = !{i32 1, !"wchar_size", i32 4}
!535 = !{i32 1, !"branch-target-enforcement", i32 0}
!536 = !{i32 1, !"sign-return-address", i32 0}
!537 = !{i32 1, !"sign-return-address-all", i32 0}
!538 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!539 = !{i32 7, !"PIC Level", i32 2}
!540 = !{i32 7, !"PIE Level", i32 2}
!541 = !{i32 7, !"uwtable", i32 1}
!542 = !{i32 7, !"frame-pointer", i32 1}
!543 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 96, type: !544, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !38}
!546 = !{!547}
!547 = !DILocalVariable(name: "status", arg: 1, scope: !543, file: !3, line: 96, type: !38)
!548 = !DILocation(line: 0, scope: !543)
!549 = !DILocation(line: 98, column: 14, scope: !550)
!550 = distinct !DILexicalBlock(scope: !543, file: !3, line: 98, column: 7)
!551 = !DILocation(line: 98, column: 7, scope: !543)
!552 = !DILocation(line: 99, column: 5, scope: !553)
!553 = distinct !DILexicalBlock(scope: !550, file: !3, line: 99, column: 5)
!554 = !{!555, !555, i64 0}
!555 = !{!"any pointer", !556, i64 0}
!556 = !{!"omnipotent char", !557, i64 0}
!557 = !{!"Simple C/C++ TBAA"}
!558 = !DILocation(line: 102, column: 7, scope: !559)
!559 = distinct !DILexicalBlock(scope: !550, file: !3, line: 101, column: 5)
!560 = !DILocation(line: 103, column: 7, scope: !559)
!561 = !DILocation(line: 108, column: 7, scope: !559)
!562 = !DILocation(line: 112, column: 7, scope: !559)
!563 = !DILocation(line: 116, column: 7, scope: !559)
!564 = !DILocation(line: 120, column: 7, scope: !559)
!565 = !DILocation(line: 124, column: 7, scope: !559)
!566 = !DILocation(line: 125, column: 7, scope: !559)
!567 = !DILocation(line: 126, column: 7, scope: !559)
!568 = !DILocalVariable(name: "program", arg: 1, scope: !569, file: !203, line: 836, type: !94)
!569 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !203, file: !203, line: 836, type: !570, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !94}
!572 = !{!568, !573, !582, !583, !585, !586}
!573 = !DILocalVariable(name: "infomap", scope: !569, file: !203, line: 838, type: !574)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 896, elements: !580)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !569, file: !203, line: 838, size: 128, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !576, file: !203, line: 838, baseType: !94, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !576, file: !203, line: 838, baseType: !94, size: 64, offset: 64)
!580 = !{!581}
!581 = !DISubrange(count: 7)
!582 = !DILocalVariable(name: "node", scope: !569, file: !203, line: 848, type: !94)
!583 = !DILocalVariable(name: "map_prog", scope: !569, file: !203, line: 849, type: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!585 = !DILocalVariable(name: "lc_messages", scope: !569, file: !203, line: 861, type: !94)
!586 = !DILocalVariable(name: "url_program", scope: !569, file: !203, line: 874, type: !94)
!587 = !DILocation(line: 0, scope: !569, inlinedAt: !588)
!588 = distinct !DILocation(line: 132, column: 7, scope: !559)
!589 = !DILocation(line: 838, column: 3, scope: !569, inlinedAt: !588)
!590 = !DILocation(line: 838, column: 67, scope: !569, inlinedAt: !588)
!591 = !DILocation(line: 849, column: 36, scope: !569, inlinedAt: !588)
!592 = !DILocation(line: 851, column: 3, scope: !569, inlinedAt: !588)
!593 = !DILocalVariable(name: "__s1", arg: 1, scope: !594, file: !595, line: 1359, type: !94)
!594 = distinct !DISubprogram(name: "streq", scope: !595, file: !595, line: 1359, type: !596, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !598)
!595 = !DIFile(filename: "./lib/string.h", directory: "/src")
!596 = !DISubroutineType(types: !597)
!597 = !{!30, !94, !94}
!598 = !{!593, !599}
!599 = !DILocalVariable(name: "__s2", arg: 2, scope: !594, file: !595, line: 1359, type: !94)
!600 = !DILocation(line: 0, scope: !594, inlinedAt: !601)
!601 = distinct !DILocation(line: 851, column: 33, scope: !569, inlinedAt: !588)
!602 = !DILocation(line: 1361, column: 11, scope: !594, inlinedAt: !601)
!603 = !DILocation(line: 1361, column: 10, scope: !594, inlinedAt: !601)
!604 = !DILocation(line: 852, column: 13, scope: !569, inlinedAt: !588)
!605 = !DILocation(line: 851, column: 20, scope: !569, inlinedAt: !588)
!606 = !{!607, !555, i64 0}
!607 = !{!"infomap", !555, i64 0, !555, i64 8}
!608 = !DILocation(line: 851, column: 10, scope: !569, inlinedAt: !588)
!609 = !DILocation(line: 851, column: 28, scope: !569, inlinedAt: !588)
!610 = distinct !{!610, !592, !604, !611}
!611 = !{!"llvm.loop.mustprogress"}
!612 = !DILocation(line: 854, column: 17, scope: !613, inlinedAt: !588)
!613 = distinct !DILexicalBlock(scope: !569, file: !203, line: 854, column: 7)
!614 = !{!607, !555, i64 8}
!615 = !DILocation(line: 854, column: 7, scope: !613, inlinedAt: !588)
!616 = !DILocation(line: 854, column: 7, scope: !569, inlinedAt: !588)
!617 = !DILocation(line: 857, column: 3, scope: !569, inlinedAt: !588)
!618 = !DILocation(line: 861, column: 29, scope: !569, inlinedAt: !588)
!619 = !DILocation(line: 862, column: 7, scope: !620, inlinedAt: !588)
!620 = distinct !DILexicalBlock(scope: !569, file: !203, line: 862, column: 7)
!621 = !DILocation(line: 862, column: 19, scope: !620, inlinedAt: !588)
!622 = !DILocation(line: 862, column: 22, scope: !620, inlinedAt: !588)
!623 = !DILocation(line: 862, column: 7, scope: !569, inlinedAt: !588)
!624 = !DILocation(line: 868, column: 7, scope: !625, inlinedAt: !588)
!625 = distinct !DILexicalBlock(scope: !620, file: !203, line: 863, column: 5)
!626 = !DILocation(line: 870, column: 5, scope: !625, inlinedAt: !588)
!627 = !DILocation(line: 0, scope: !594, inlinedAt: !628)
!628 = distinct !DILocation(line: 874, column: 29, scope: !569, inlinedAt: !588)
!629 = !DILocation(line: 875, column: 3, scope: !569, inlinedAt: !588)
!630 = !DILocation(line: 877, column: 3, scope: !569, inlinedAt: !588)
!631 = !DILocation(line: 879, column: 1, scope: !569, inlinedAt: !588)
!632 = !DILocation(line: 135, column: 3, scope: !543)
!633 = !DISubprogram(name: "dcgettext", scope: !634, file: !634, line: 51, type: !635, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!634 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!635 = !DISubroutineType(types: !636)
!636 = !{!40, !94, !94, !38}
!637 = !{}
!638 = !DISubprogram(name: "fputs_unlocked", scope: !282, file: !282, line: 691, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!639 = !DISubroutineType(types: !640)
!640 = !{!38, !641, !642}
!641 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !94)
!642 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !31)
!643 = !DILocation(line: 0, scope: !202)
!644 = !DILocation(line: 581, column: 7, scope: !211)
!645 = !{!646, !646, i64 0}
!646 = !{!"int", !556, i64 0}
!647 = !DILocation(line: 581, column: 19, scope: !211)
!648 = !DILocation(line: 581, column: 7, scope: !202)
!649 = !DILocation(line: 585, column: 26, scope: !210)
!650 = !DILocation(line: 0, scope: !210)
!651 = !DILocation(line: 586, column: 23, scope: !210)
!652 = !DILocation(line: 586, column: 28, scope: !210)
!653 = !DILocation(line: 586, column: 32, scope: !210)
!654 = !{!556, !556, i64 0}
!655 = !DILocation(line: 586, column: 38, scope: !210)
!656 = !DILocation(line: 0, scope: !594, inlinedAt: !657)
!657 = distinct !DILocation(line: 586, column: 41, scope: !210)
!658 = !DILocation(line: 1361, column: 11, scope: !594, inlinedAt: !657)
!659 = !DILocation(line: 1361, column: 10, scope: !594, inlinedAt: !657)
!660 = !DILocation(line: 586, column: 19, scope: !210)
!661 = !DILocation(line: 587, column: 5, scope: !210)
!662 = !DILocation(line: 588, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !202, file: !203, line: 588, column: 7)
!664 = !DILocation(line: 588, column: 7, scope: !202)
!665 = !DILocation(line: 590, column: 7, scope: !666)
!666 = distinct !DILexicalBlock(scope: !663, file: !203, line: 589, column: 5)
!667 = !DILocation(line: 591, column: 7, scope: !666)
!668 = !DILocation(line: 595, column: 37, scope: !202)
!669 = !DILocation(line: 595, column: 35, scope: !202)
!670 = !DILocation(line: 596, column: 29, scope: !202)
!671 = !DILocation(line: 597, column: 8, scope: !218)
!672 = !DILocation(line: 597, column: 7, scope: !202)
!673 = !DILocation(line: 604, column: 24, scope: !217)
!674 = !DILocation(line: 604, column: 12, scope: !218)
!675 = !DILocation(line: 0, scope: !216)
!676 = !DILocation(line: 610, column: 16, scope: !216)
!677 = !DILocation(line: 610, column: 7, scope: !216)
!678 = !DILocation(line: 611, column: 21, scope: !216)
!679 = !{!680, !680, i64 0}
!680 = !{!"short", !556, i64 0}
!681 = !DILocation(line: 611, column: 19, scope: !216)
!682 = !DILocation(line: 611, column: 16, scope: !216)
!683 = !DILocation(line: 610, column: 30, scope: !216)
!684 = distinct !{!684, !677, !678, !611}
!685 = !DILocation(line: 612, column: 18, scope: !686)
!686 = distinct !DILexicalBlock(scope: !216, file: !203, line: 612, column: 11)
!687 = !DILocation(line: 612, column: 11, scope: !216)
!688 = !DILocation(line: 620, column: 23, scope: !202)
!689 = !DILocation(line: 625, column: 39, scope: !202)
!690 = !DILocation(line: 626, column: 3, scope: !202)
!691 = !DILocation(line: 626, column: 10, scope: !202)
!692 = !DILocation(line: 626, column: 21, scope: !202)
!693 = !DILocation(line: 628, column: 44, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !203, line: 628, column: 11)
!695 = distinct !DILexicalBlock(scope: !202, file: !203, line: 627, column: 5)
!696 = !DILocation(line: 628, column: 32, scope: !694)
!697 = !DILocation(line: 628, column: 49, scope: !694)
!698 = !DILocation(line: 628, column: 11, scope: !695)
!699 = !DILocation(line: 630, column: 11, scope: !700)
!700 = distinct !DILexicalBlock(scope: !695, file: !203, line: 630, column: 11)
!701 = !DILocation(line: 630, column: 11, scope: !695)
!702 = !DILocation(line: 632, column: 26, scope: !703)
!703 = distinct !DILexicalBlock(scope: !704, file: !203, line: 632, column: 15)
!704 = distinct !DILexicalBlock(scope: !700, file: !203, line: 631, column: 9)
!705 = !DILocation(line: 632, column: 34, scope: !703)
!706 = !DILocation(line: 632, column: 37, scope: !703)
!707 = !DILocation(line: 632, column: 15, scope: !704)
!708 = !DILocation(line: 636, column: 29, scope: !709)
!709 = distinct !DILexicalBlock(scope: !704, file: !203, line: 636, column: 15)
!710 = !DILocation(line: 640, column: 16, scope: !695)
!711 = distinct !{!711, !690, !712, !611}
!712 = !DILocation(line: 641, column: 5, scope: !202)
!713 = !DILocation(line: 644, column: 3, scope: !202)
!714 = !DILocation(line: 0, scope: !594, inlinedAt: !715)
!715 = distinct !DILocation(line: 648, column: 31, scope: !202)
!716 = !DILocation(line: 0, scope: !594, inlinedAt: !717)
!717 = distinct !DILocation(line: 649, column: 31, scope: !202)
!718 = !DILocation(line: 0, scope: !594, inlinedAt: !719)
!719 = distinct !DILocation(line: 650, column: 31, scope: !202)
!720 = !DILocation(line: 0, scope: !594, inlinedAt: !721)
!721 = distinct !DILocation(line: 651, column: 31, scope: !202)
!722 = !DILocation(line: 0, scope: !594, inlinedAt: !723)
!723 = distinct !DILocation(line: 652, column: 31, scope: !202)
!724 = !DILocation(line: 0, scope: !594, inlinedAt: !725)
!725 = distinct !DILocation(line: 653, column: 31, scope: !202)
!726 = !DILocation(line: 0, scope: !594, inlinedAt: !727)
!727 = distinct !DILocation(line: 654, column: 31, scope: !202)
!728 = !DILocation(line: 0, scope: !594, inlinedAt: !729)
!729 = distinct !DILocation(line: 655, column: 31, scope: !202)
!730 = !DILocation(line: 0, scope: !594, inlinedAt: !731)
!731 = distinct !DILocation(line: 656, column: 31, scope: !202)
!732 = !DILocation(line: 0, scope: !594, inlinedAt: !733)
!733 = distinct !DILocation(line: 657, column: 31, scope: !202)
!734 = !DILocation(line: 663, column: 7, scope: !735)
!735 = distinct !DILexicalBlock(scope: !202, file: !203, line: 663, column: 7)
!736 = !DILocation(line: 664, column: 7, scope: !735)
!737 = !DILocation(line: 664, column: 10, scope: !735)
!738 = !DILocation(line: 663, column: 7, scope: !202)
!739 = !DILocation(line: 669, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !735, file: !203, line: 665, column: 5)
!741 = !DILocation(line: 671, column: 5, scope: !740)
!742 = !DILocation(line: 676, column: 7, scope: !743)
!743 = distinct !DILexicalBlock(scope: !735, file: !203, line: 673, column: 5)
!744 = !DILocation(line: 679, column: 3, scope: !202)
!745 = !DILocation(line: 683, column: 3, scope: !202)
!746 = !DILocation(line: 686, column: 3, scope: !202)
!747 = !DILocation(line: 688, column: 3, scope: !202)
!748 = !DILocation(line: 691, column: 3, scope: !202)
!749 = !DILocation(line: 695, column: 3, scope: !202)
!750 = !DILocation(line: 696, column: 1, scope: !202)
!751 = !DISubprogram(name: "setlocale", scope: !752, file: !752, line: 122, type: !753, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!752 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!753 = !DISubroutineType(types: !754)
!754 = !{!40, !38, !94}
!755 = !DISubprogram(name: "getenv", scope: !756, file: !756, line: 641, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!756 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!757 = !DISubroutineType(types: !758)
!758 = !{!40, !94}
!759 = !DISubprogram(name: "fwrite_unlocked", scope: !282, file: !282, line: 704, type: !760, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!760 = !DISubroutineType(types: !761)
!761 = !{!86, !762, !86, !86, !642}
!762 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!765 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 429, type: !766, scopeLine: 430, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !769)
!766 = !DISubroutineType(types: !767)
!767 = !{!38, !38, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !779, !783, !787, !788, !791, !792, !793, !794, !796, !797}
!770 = !DILocalVariable(name: "argc", arg: 1, scope: !765, file: !3, line: 429, type: !38)
!771 = !DILocalVariable(name: "argv", arg: 2, scope: !765, file: !3, line: 429, type: !768)
!772 = !DILocalVariable(name: "ok", scope: !765, file: !3, line: 431, type: !30)
!773 = !DILocalVariable(name: "optc", scope: !765, file: !3, line: 432, type: !38)
!774 = !DILocalVariable(name: "syntax", scope: !765, file: !3, line: 433, type: !5)
!775 = !DILocalVariable(name: "print_database", scope: !765, file: !3, line: 434, type: !30)
!776 = !DILocalVariable(name: "p", scope: !777, file: !3, line: 505, type: !94)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 504, column: 5)
!778 = distinct !DILexicalBlock(scope: !765, file: !3, line: 503, column: 7)
!779 = !DILocalVariable(name: "len", scope: !780, file: !3, line: 532, type: !86)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 531, column: 9)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 530, column: 11)
!782 = distinct !DILexicalBlock(scope: !778, file: !3, line: 513, column: 5)
!783 = !DILocalVariable(name: "__o", scope: !784, file: !3, line: 532, type: !785)
!784 = distinct !DILexicalBlock(scope: !780, file: !3, line: 532, column: 24)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!787 = !DILocalVariable(name: "s", scope: !780, file: !3, line: 533, type: !40)
!788 = !DILocalVariable(name: "__o1", scope: !789, file: !3, line: 533, type: !790)
!789 = distinct !DILexicalBlock(scope: !780, file: !3, line: 533, column: 21)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!791 = !DILocalVariable(name: "__value", scope: !789, file: !3, line: 533, type: !84)
!792 = !DILocalVariable(name: "prefix", scope: !780, file: !3, line: 534, type: !94)
!793 = !DILocalVariable(name: "suffix", scope: !780, file: !3, line: 535, type: !94)
!794 = !DILocalVariable(name: "__ptr", scope: !795, file: !3, line: 549, type: !94)
!795 = distinct !DILexicalBlock(scope: !780, file: !3, line: 549, column: 11)
!796 = !DILocalVariable(name: "__stream", scope: !795, file: !3, line: 549, type: !31)
!797 = !DILocalVariable(name: "__cnt", scope: !795, file: !3, line: 549, type: !86)
!798 = !DILocation(line: 0, scope: !765)
!799 = !DILocation(line: 437, column: 21, scope: !765)
!800 = !DILocation(line: 437, column: 3, scope: !765)
!801 = !DILocation(line: 438, column: 3, scope: !765)
!802 = !DILocation(line: 439, column: 3, scope: !765)
!803 = !DILocation(line: 440, column: 3, scope: !765)
!804 = !DILocation(line: 442, column: 3, scope: !765)
!805 = !DILocation(line: 444, column: 3, scope: !765)
!806 = !DILocation(line: 444, column: 18, scope: !765)
!807 = distinct !{!807, !805, !808, !611}
!808 = !DILocation(line: 469, column: 7, scope: !765)
!809 = !DILocation(line: 453, column: 9, scope: !810)
!810 = distinct !DILexicalBlock(scope: !765, file: !3, line: 446, column: 7)
!811 = !DILocation(line: 460, column: 25, scope: !810)
!812 = !DILocation(line: 461, column: 9, scope: !810)
!813 = !DILocation(line: 463, column: 7, scope: !810)
!814 = !DILocation(line: 465, column: 7, scope: !810)
!815 = !DILocation(line: 468, column: 9, scope: !810)
!816 = !DILocation(line: 471, column: 11, scope: !765)
!817 = !DILocation(line: 471, column: 8, scope: !765)
!818 = !DILocation(line: 472, column: 8, scope: !765)
!819 = !DILocation(line: 476, column: 25, scope: !820)
!820 = distinct !DILexicalBlock(scope: !765, file: !3, line: 476, column: 7)
!821 = !DILocation(line: 476, column: 23, scope: !820)
!822 = !DILocation(line: 476, column: 42, scope: !820)
!823 = !DILocation(line: 478, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !820, file: !3, line: 477, column: 5)
!825 = !DILocation(line: 481, column: 7, scope: !824)
!826 = !DILocation(line: 484, column: 22, scope: !827)
!827 = distinct !DILexicalBlock(scope: !765, file: !3, line: 484, column: 7)
!828 = !DILocation(line: 486, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !827, file: !3, line: 485, column: 5)
!830 = !DILocation(line: 489, column: 7, scope: !829)
!831 = !DILocation(line: 492, column: 8, scope: !832)
!832 = distinct !DILexicalBlock(scope: !765, file: !3, line: 492, column: 7)
!833 = !DILocation(line: 492, column: 25, scope: !832)
!834 = !DILocation(line: 492, column: 7, scope: !765)
!835 = !DILocation(line: 494, column: 7, scope: !836)
!836 = distinct !DILexicalBlock(scope: !832, file: !3, line: 493, column: 5)
!837 = !DILocation(line: 496, column: 11, scope: !836)
!838 = !DILocation(line: 497, column: 9, scope: !839)
!839 = distinct !DILexicalBlock(scope: !836, file: !3, line: 496, column: 11)
!840 = !DILocation(line: 500, column: 7, scope: !836)
!841 = !DILocation(line: 503, column: 7, scope: !765)
!842 = !DILocation(line: 0, scope: !777)
!843 = !DILocation(line: 508, column: 11, scope: !844)
!844 = distinct !DILexicalBlock(scope: !777, file: !3, line: 507, column: 9)
!845 = !DILocation(line: 509, column: 16, scope: !844)
!846 = !DILocation(line: 509, column: 27, scope: !844)
!847 = !DILocation(line: 509, column: 13, scope: !844)
!848 = !DILocation(line: 506, column: 16, scope: !777)
!849 = !DILocation(line: 506, column: 25, scope: !777)
!850 = !DILocation(line: 506, column: 7, scope: !777)
!851 = distinct !{!851, !850, !852, !611}
!852 = !DILocation(line: 510, column: 9, scope: !777)
!853 = !DILocation(line: 515, column: 42, scope: !854)
!854 = distinct !DILexicalBlock(scope: !782, file: !3, line: 515, column: 11)
!855 = !DILocation(line: 146, column: 11, scope: !856, inlinedAt: !861)
!856 = distinct !DISubprogram(name: "guess_shell_syntax", scope: !3, file: !3, line: 142, type: !857, scopeLine: 143, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{!5}
!859 = !{!860}
!860 = !DILocalVariable(name: "shell", scope: !856, file: !3, line: 144, type: !40)
!861 = distinct !DILocation(line: 517, column: 20, scope: !862)
!862 = distinct !DILexicalBlock(scope: !854, file: !3, line: 516, column: 9)
!863 = !DILocation(line: 0, scope: !856, inlinedAt: !861)
!864 = !DILocation(line: 147, column: 13, scope: !865, inlinedAt: !861)
!865 = distinct !DILexicalBlock(scope: !856, file: !3, line: 147, column: 7)
!866 = !DILocation(line: 147, column: 21, scope: !865, inlinedAt: !861)
!867 = !DILocation(line: 147, column: 24, scope: !865, inlinedAt: !861)
!868 = !DILocation(line: 147, column: 31, scope: !865, inlinedAt: !861)
!869 = !DILocation(line: 147, column: 7, scope: !856, inlinedAt: !861)
!870 = !DILocation(line: 150, column: 11, scope: !856, inlinedAt: !861)
!871 = !DILocation(line: 0, scope: !594, inlinedAt: !872)
!872 = distinct !DILocation(line: 152, column: 7, scope: !873, inlinedAt: !861)
!873 = distinct !DILexicalBlock(scope: !856, file: !3, line: 152, column: 7)
!874 = !DILocation(line: 1361, column: 11, scope: !594, inlinedAt: !872)
!875 = !DILocation(line: 1361, column: 10, scope: !594, inlinedAt: !872)
!876 = !DILocation(line: 152, column: 28, scope: !873, inlinedAt: !861)
!877 = !DILocation(line: 0, scope: !594, inlinedAt: !878)
!878 = distinct !DILocation(line: 152, column: 31, scope: !873, inlinedAt: !861)
!879 = !DILocation(line: 1361, column: 11, scope: !594, inlinedAt: !878)
!880 = !DILocation(line: 1361, column: 10, scope: !594, inlinedAt: !878)
!881 = !DILocation(line: 152, column: 7, scope: !856, inlinedAt: !861)
!882 = !DILocation(line: 519, column: 13, scope: !883)
!883 = distinct !DILexicalBlock(scope: !862, file: !3, line: 518, column: 15)
!884 = !DILocation(line: 524, column: 7, scope: !782)
!885 = !DILocation(line: 525, column: 16, scope: !886)
!886 = distinct !DILexicalBlock(scope: !782, file: !3, line: 525, column: 11)
!887 = !DILocation(line: 525, column: 11, scope: !782)
!888 = !DILocation(line: 526, column: 14, scope: !886)
!889 = !DILocation(line: 530, column: 11, scope: !782)
!890 = !DILocation(line: 528, column: 29, scope: !886)
!891 = !DILocalVariable(name: "filename", arg: 1, scope: !892, file: !3, line: 407, type: !94)
!892 = distinct !DISubprogram(name: "dc_parse_file", scope: !3, file: !3, line: 407, type: !893, scopeLine: 408, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !895)
!893 = !DISubroutineType(types: !894)
!894 = !{!30, !94}
!895 = !{!891, !896}
!896 = !DILocalVariable(name: "ok", scope: !892, file: !3, line: 409, type: !30)
!897 = !DILocation(line: 0, scope: !892, inlinedAt: !898)
!898 = distinct !DILocation(line: 528, column: 14, scope: !886)
!899 = !DILocation(line: 0, scope: !594, inlinedAt: !900)
!900 = distinct !DILocation(line: 411, column: 9, scope: !901, inlinedAt: !898)
!901 = distinct !DILexicalBlock(scope: !892, file: !3, line: 411, column: 7)
!902 = !DILocation(line: 1361, column: 11, scope: !594, inlinedAt: !900)
!903 = !DILocation(line: 1361, column: 10, scope: !594, inlinedAt: !900)
!904 = !DILocation(line: 411, column: 31, scope: !901, inlinedAt: !898)
!905 = !DILocation(line: 411, column: 58, scope: !901, inlinedAt: !898)
!906 = !DILocation(line: 411, column: 34, scope: !901, inlinedAt: !898)
!907 = !DILocation(line: 411, column: 65, scope: !901, inlinedAt: !898)
!908 = !DILocation(line: 411, column: 7, scope: !892, inlinedAt: !898)
!909 = !DILocation(line: 417, column: 25, scope: !892, inlinedAt: !898)
!910 = !DILocation(line: 417, column: 8, scope: !892, inlinedAt: !898)
!911 = !DILocation(line: 419, column: 15, scope: !912, inlinedAt: !898)
!912 = distinct !DILexicalBlock(scope: !892, file: !3, line: 419, column: 7)
!913 = !DILocation(line: 419, column: 7, scope: !912, inlinedAt: !898)
!914 = !DILocation(line: 419, column: 22, scope: !912, inlinedAt: !898)
!915 = !DILocation(line: 419, column: 7, scope: !892, inlinedAt: !898)
!916 = !DILocation(line: 0, scope: !784)
!917 = !DILocation(line: 532, column: 24, scope: !784)
!918 = !{!919, !555, i64 24}
!919 = !{!"obstack", !920, i64 0, !555, i64 8, !555, i64 16, !555, i64 24, !555, i64 32, !556, i64 40, !920, i64 48, !556, i64 56, !556, i64 64, !555, i64 72, !646, i64 80, !646, i64 80, !646, i64 80}
!920 = !{!"long", !556, i64 0}
!921 = !{!919, !555, i64 16}
!922 = !DILocation(line: 0, scope: !780)
!923 = !DILocation(line: 0, scope: !789)
!924 = !DILocation(line: 533, column: 21, scope: !925)
!925 = distinct !DILexicalBlock(scope: !789, file: !3, line: 533, column: 21)
!926 = !DILocation(line: 533, column: 21, scope: !789)
!927 = !{!919, !920, i64 48}
!928 = !DILocation(line: 537, column: 22, scope: !929)
!929 = distinct !DILexicalBlock(scope: !780, file: !3, line: 537, column: 15)
!930 = !DILocation(line: 547, column: 17, scope: !931)
!931 = distinct !DILexicalBlock(scope: !780, file: !3, line: 547, column: 15)
!932 = !DILocation(line: 547, column: 15, scope: !780)
!933 = !DILocation(line: 548, column: 13, scope: !931)
!934 = !DILocation(line: 549, column: 11, scope: !780)
!935 = !DILocation(line: 550, column: 17, scope: !936)
!936 = distinct !DILexicalBlock(scope: !780, file: !3, line: 550, column: 15)
!937 = !DILocation(line: 550, column: 15, scope: !780)
!938 = !DILocation(line: 551, column: 13, scope: !936)
!939 = !DILocation(line: 556, column: 1, scope: !765)
!940 = !DISubprogram(name: "bindtextdomain", scope: !634, file: !634, line: 86, type: !941, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!941 = !DISubroutineType(types: !942)
!942 = !{!40, !94, !94}
!943 = !DISubprogram(name: "textdomain", scope: !634, file: !634, line: 82, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!944 = !DISubprogram(name: "atexit", scope: !756, file: !756, line: 602, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!945 = !DISubroutineType(types: !946)
!946 = !{!38, !308}
!947 = !DISubprogram(name: "getopt_long", scope: !248, file: !248, line: 66, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!948 = !DISubroutineType(types: !949)
!949 = !{!38, !38, !950, !94, !952, !253}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!953 = !DISubprogram(name: "puts", scope: !282, file: !282, line: 661, type: !954, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!954 = !DISubroutineType(types: !955)
!955 = !{!38, !94}
!956 = !DILocation(line: 0, scope: !27)
!957 = !DILocation(line: 282, column: 3, scope: !27)
!958 = !DILocation(line: 282, column: 9, scope: !27)
!959 = !DILocation(line: 283, column: 3, scope: !27)
!960 = !DILocation(line: 283, column: 10, scope: !27)
!961 = !{!920, !920, i64 0}
!962 = !DILocation(line: 293, column: 10, scope: !27)
!963 = !DILocation(line: 294, column: 12, scope: !964)
!964 = distinct !DILexicalBlock(scope: !27, file: !3, line: 294, column: 7)
!965 = !DILocation(line: 294, column: 20, scope: !964)
!966 = !DILocation(line: 294, column: 23, scope: !964)
!967 = !DILocation(line: 294, column: 29, scope: !964)
!968 = !DILocation(line: 294, column: 7, scope: !27)
!969 = !DILocation(line: 295, column: 5, scope: !964)
!970 = !DILocation(line: 298, column: 15, scope: !27)
!971 = !DILocation(line: 299, column: 17, scope: !972)
!972 = distinct !DILexicalBlock(scope: !27, file: !3, line: 299, column: 7)
!973 = !DILocation(line: 299, column: 7, scope: !27)
!974 = !DILocation(line: 302, column: 3, scope: !27)
!975 = !DILocation(line: 309, column: 11, scope: !112)
!976 = !DILocation(line: 281, column: 15, scope: !27)
!977 = !DILocation(line: 307, column: 7, scope: !112)
!978 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !979, file: !980, line: 118, type: !768)
!979 = distinct !DISubprogram(name: "getline", scope: !980, file: !980, line: 118, type: !981, scopeLine: 119, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !984)
!980 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!981 = !DISubroutineType(types: !982)
!982 = !{!983, !768, !494, !31}
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !61, line: 194, baseType: !62)
!984 = !{!978, !985, !986}
!985 = !DILocalVariable(name: "__n", arg: 2, scope: !979, file: !980, line: 118, type: !494)
!986 = !DILocalVariable(name: "__stream", arg: 3, scope: !979, file: !980, line: 118, type: !31)
!987 = !DILocation(line: 0, scope: !979, inlinedAt: !988)
!988 = distinct !DILocation(line: 311, column: 15, scope: !989)
!989 = distinct !DILexicalBlock(scope: !990, file: !3, line: 311, column: 15)
!990 = distinct !DILexicalBlock(scope: !991, file: !3, line: 310, column: 9)
!991 = distinct !DILexicalBlock(scope: !112, file: !3, line: 309, column: 11)
!992 = !DILocation(line: 120, column: 10, scope: !979, inlinedAt: !988)
!993 = !DILocation(line: 311, column: 59, scope: !989)
!994 = !DILocation(line: 311, column: 15, scope: !990)
!995 = !DILocalVariable(name: "__stream", arg: 1, scope: !996, file: !980, line: 135, type: !31)
!996 = distinct !DISubprogram(name: "ferror_unlocked", scope: !980, file: !980, line: 135, type: !997, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!38, !31}
!999 = !{!995}
!1000 = !DILocation(line: 0, scope: !996, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 313, column: 19, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 313, column: 19)
!1003 = distinct !DILexicalBlock(scope: !989, file: !3, line: 312, column: 13)
!1004 = !DILocation(line: 137, column: 10, scope: !996, inlinedAt: !1001)
!1005 = !{!1006, !646, i64 0}
!1006 = !{!"_IO_FILE", !646, i64 0, !555, i64 8, !555, i64 16, !555, i64 24, !555, i64 32, !555, i64 40, !555, i64 48, !555, i64 56, !555, i64 64, !555, i64 72, !555, i64 80, !555, i64 88, !555, i64 96, !555, i64 104, !646, i64 112, !646, i64 116, !920, i64 120, !680, i64 128, !556, i64 130, !556, i64 131, !555, i64 136, !920, i64 144, !555, i64 152, !555, i64 160, !555, i64 168, !555, i64 176, !920, i64 184, !646, i64 192, !556, i64 196}
!1007 = !DILocation(line: 313, column: 19, scope: !1002)
!1008 = !DILocation(line: 313, column: 19, scope: !1003)
!1009 = !DILocation(line: 315, column: 19, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 314, column: 17)
!1011 = !DILocation(line: 317, column: 17, scope: !1010)
!1012 = !DILocation(line: 318, column: 21, scope: !1003)
!1013 = !DILocation(line: 318, column: 15, scope: !1003)
!1014 = !DILocation(line: 319, column: 15, scope: !1003)
!1015 = !DILocation(line: 321, column: 18, scope: !990)
!1016 = !DILocation(line: 322, column: 9, scope: !990)
!1017 = !DILocation(line: 325, column: 27, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 325, column: 15)
!1019 = distinct !DILexicalBlock(scope: !991, file: !3, line: 324, column: 9)
!1020 = !DILocation(line: 325, column: 15, scope: !1019)
!1021 = !DILocation(line: 328, column: 26, scope: !1019)
!1022 = !DILocation(line: 328, column: 47, scope: !1019)
!1023 = !DILocation(line: 328, column: 23, scope: !1019)
!1024 = !DILocation(line: 0, scope: !991)
!1025 = !DILocalVariable(name: "line", arg: 1, scope: !1026, file: !3, line: 159, type: !94)
!1026 = distinct !DISubprogram(name: "parse_line", scope: !3, file: !3, line: 159, type: !1027, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1029)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, !94, !768, !768}
!1029 = !{!1025, !1030, !1031, !1032, !1033, !1034}
!1030 = !DILocalVariable(name: "keyword", arg: 2, scope: !1026, file: !3, line: 159, type: !768)
!1031 = !DILocalVariable(name: "arg", arg: 3, scope: !1026, file: !3, line: 159, type: !768)
!1032 = !DILocalVariable(name: "p", scope: !1026, file: !3, line: 161, type: !94)
!1033 = !DILocalVariable(name: "keyword_start", scope: !1026, file: !3, line: 162, type: !94)
!1034 = !DILocalVariable(name: "arg_start", scope: !1026, file: !3, line: 163, type: !94)
!1035 = !DILocation(line: 0, scope: !1026, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 331, column: 7, scope: !112)
!1037 = !DILocation(line: 168, column: 8, scope: !1038, inlinedAt: !1036)
!1038 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 168, column: 3)
!1039 = !DILocation(line: 0, scope: !1038, inlinedAt: !1036)
!1040 = !DILocation(line: 168, column: 29, scope: !1041, inlinedAt: !1036)
!1041 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 168, column: 3)
!1042 = !DILocalVariable(name: "c", arg: 1, scope: !1043, file: !1044, line: 300, type: !38)
!1043 = distinct !DISubprogram(name: "c_isspace", scope: !1044, file: !1044, line: 300, type: !1045, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1047)
!1044 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!30, !38}
!1047 = !{!1042}
!1048 = !DILocation(line: 0, scope: !1043, inlinedAt: !1049)
!1049 = distinct !DILocation(line: 168, column: 18, scope: !1041, inlinedAt: !1036)
!1050 = !DILocation(line: 302, column: 3, scope: !1043, inlinedAt: !1049)
!1051 = !DILocation(line: 168, column: 34, scope: !1041, inlinedAt: !1036)
!1052 = !DILocation(line: 168, column: 3, scope: !1041, inlinedAt: !1036)
!1053 = distinct !{!1053, !1054, !1055, !611}
!1054 = !DILocation(line: 168, column: 3, scope: !1038, inlinedAt: !1036)
!1055 = !DILocation(line: 169, column: 5, scope: !1038, inlinedAt: !1036)
!1056 = !DILocation(line: 177, column: 22, scope: !1026, inlinedAt: !1036)
!1057 = !DILocation(line: 0, scope: !1043, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 177, column: 11, scope: !1026, inlinedAt: !1036)
!1059 = !DILocation(line: 302, column: 3, scope: !1043, inlinedAt: !1058)
!1060 = !DILocation(line: 179, column: 7, scope: !1061, inlinedAt: !1036)
!1061 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 178, column: 5)
!1062 = !DILocation(line: 177, column: 3, scope: !1026, inlinedAt: !1036)
!1063 = distinct !{!1063, !1062, !1064, !611}
!1064 = !DILocation(line: 180, column: 5, scope: !1026, inlinedAt: !1036)
!1065 = !DILocation(line: 182, column: 42, scope: !1026, inlinedAt: !1036)
!1066 = !DILocation(line: 182, column: 14, scope: !1026, inlinedAt: !1036)
!1067 = !DILocation(line: 183, column: 7, scope: !1068, inlinedAt: !1036)
!1068 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 183, column: 7)
!1069 = !DILocation(line: 183, column: 11, scope: !1068, inlinedAt: !1036)
!1070 = !DILocation(line: 183, column: 7, scope: !1026, inlinedAt: !1036)
!1071 = !DILocation(line: 188, column: 7, scope: !1072, inlinedAt: !1036)
!1072 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 187, column: 5)
!1073 = !DILocation(line: 190, column: 21, scope: !1026, inlinedAt: !1036)
!1074 = !DILocation(line: 0, scope: !1043, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 190, column: 10, scope: !1026, inlinedAt: !1036)
!1076 = !DILocation(line: 302, column: 3, scope: !1043, inlinedAt: !1075)
!1077 = distinct !{!1077, !1078, !1079, !611}
!1078 = !DILocation(line: 186, column: 3, scope: !1026, inlinedAt: !1036)
!1079 = !DILocation(line: 190, column: 24, scope: !1026, inlinedAt: !1036)
!1080 = !DILocation(line: 197, column: 10, scope: !1026, inlinedAt: !1036)
!1081 = !DILocation(line: 197, column: 21, scope: !1026, inlinedAt: !1036)
!1082 = !DILocation(line: 200, column: 3, scope: !1083, inlinedAt: !1036)
!1083 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 200, column: 3)
!1084 = !DILocation(line: 198, column: 5, scope: !1026, inlinedAt: !1036)
!1085 = !DILocation(line: 197, column: 3, scope: !1026, inlinedAt: !1036)
!1086 = distinct !{!1086, !1085, !1087, !611}
!1087 = !DILocation(line: 198, column: 7, scope: !1026, inlinedAt: !1036)
!1088 = !DILocation(line: 0, scope: !1083, inlinedAt: !1036)
!1089 = !DILocation(line: 200, column: 24, scope: !1090, inlinedAt: !1036)
!1090 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 200, column: 3)
!1091 = !DILocation(line: 0, scope: !1043, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 200, column: 13, scope: !1090, inlinedAt: !1036)
!1093 = !DILocation(line: 302, column: 3, scope: !1043, inlinedAt: !1092)
!1094 = distinct !{!1094, !1082, !1095, !611}
!1095 = !DILocation(line: 201, column: 5, scope: !1083, inlinedAt: !1036)
!1096 = !DILocation(line: 0, scope: !112)
!1097 = !DILocation(line: 338, column: 11, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 337, column: 9)
!1099 = distinct !DILexicalBlock(scope: !112, file: !3, line: 336, column: 11)
!1100 = !DILocation(line: 342, column: 11, scope: !1098)
!1101 = distinct !{!1101, !974, !1102}
!1102 = !DILocation(line: 401, column: 5, scope: !27)
!1103 = !DILocation(line: 204, column: 34, scope: !1026, inlinedAt: !1036)
!1104 = !DILocation(line: 204, column: 10, scope: !1026, inlinedAt: !1036)
!1105 = !DILocation(line: 346, column: 11, scope: !124)
!1106 = !DILocation(line: 346, column: 40, scope: !124)
!1107 = !DILocation(line: 346, column: 11, scope: !112)
!1108 = !DILocation(line: 348, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 348, column: 15)
!1110 = distinct !DILexicalBlock(scope: !124, file: !3, line: 347, column: 9)
!1111 = !DILocation(line: 348, column: 15, scope: !1110)
!1112 = !DILocation(line: 349, column: 21, scope: !1109)
!1113 = !DILocation(line: 349, column: 44, scope: !1109)
!1114 = !DILocation(line: 349, column: 13, scope: !1109)
!1115 = !DILocation(line: 351, column: 16, scope: !123)
!1116 = !DILocation(line: 351, column: 50, scope: !123)
!1117 = !DILocation(line: 0, scope: !123)
!1118 = !DILocation(line: 351, column: 16, scope: !124)
!1119 = !DILocation(line: 353, column: 15, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !123, file: !3, line: 352, column: 9)
!1121 = !DILocation(line: 354, column: 21, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 353, column: 15)
!1123 = !DILocation(line: 354, column: 49, scope: !1122)
!1124 = !DILocation(line: 354, column: 13, scope: !1122)
!1125 = !DILocation(line: 358, column: 15, scope: !122)
!1126 = !DILocation(line: 361, column: 21, scope: !121)
!1127 = !DILocation(line: 361, column: 15, scope: !122)
!1128 = !DILocation(line: 363, column: 19, scope: !119)
!1129 = !DILocation(line: 363, column: 19, scope: !120)
!1130 = !DILocation(line: 364, column: 17, scope: !119)
!1131 = !DILocation(line: 366, column: 17, scope: !118)
!1132 = !DILocation(line: 367, column: 24, scope: !117)
!1133 = !DILocation(line: 367, column: 56, scope: !117)
!1134 = !DILocation(line: 368, column: 24, scope: !117)
!1135 = !DILocation(line: 368, column: 27, scope: !117)
!1136 = !DILocation(line: 368, column: 57, scope: !117)
!1137 = !DILocation(line: 369, column: 24, scope: !117)
!1138 = !DILocation(line: 369, column: 27, scope: !117)
!1139 = !DILocation(line: 369, column: 60, scope: !117)
!1140 = !DILocation(line: 367, column: 24, scope: !118)
!1141 = !DILocation(line: 0, scope: !116)
!1142 = !DILocation(line: 377, column: 31, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 377, column: 19)
!1144 = distinct !DILexicalBlock(scope: !116, file: !3, line: 377, column: 19)
!1145 = !DILocation(line: 378, column: 25, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 378, column: 25)
!1147 = !DILocation(line: 378, column: 62, scope: !1146)
!1148 = !DILocation(line: 378, column: 25, scope: !1143)
!1149 = !DILocation(line: 377, column: 55, scope: !1143)
!1150 = !DILocation(line: 377, column: 46, scope: !1143)
!1151 = !DILocation(line: 377, column: 19, scope: !1144)
!1152 = distinct !{!1152, !1151, !1153, !611}
!1153 = !DILocation(line: 379, column: 23, scope: !1144)
!1154 = !DILocation(line: 382, column: 38, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !116, file: !3, line: 381, column: 23)
!1156 = !DILocation(line: 382, column: 21, scope: !1155)
!1157 = !DILocation(line: 391, column: 24, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !112, file: !3, line: 391, column: 11)
!1159 = !DILocation(line: 393, column: 11, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1158, file: !3, line: 392, column: 9)
!1161 = !DILocation(line: 397, column: 9, scope: !1160)
!1162 = !DILocation(line: 399, column: 7, scope: !112)
!1163 = !DILocation(line: 404, column: 1, scope: !27)
!1164 = !DILocation(line: 403, column: 3, scope: !27)
!1165 = !DISubprogram(name: "fnmatch", scope: !1166, file: !1166, line: 56, type: !1167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !637)
!1166 = !DIFile(filename: "/usr/include/fnmatch.h", directory: "", checksumkind: CSK_MD5, checksum: "78cf7a81a1368221bdf9e99a720bc0a5")
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!38, !94, !94, !38}
!1169 = distinct !DISubprogram(name: "append_entry", scope: !3, file: !3, line: 252, type: !1170, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1172)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !41, !94, !94}
!1172 = !{!1173, !1174, !1175, !1176, !1180, !1183, !1186, !1189, !1191, !1194, !1196}
!1173 = !DILocalVariable(name: "prefix", arg: 1, scope: !1169, file: !3, line: 252, type: !41)
!1174 = !DILocalVariable(name: "item", arg: 2, scope: !1169, file: !3, line: 252, type: !94)
!1175 = !DILocalVariable(name: "arg", arg: 3, scope: !1169, file: !3, line: 252, type: !94)
!1176 = !DILocalVariable(name: "__o", scope: !1177, file: !3, line: 258, type: !790)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 258, column: 7)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 255, column: 5)
!1179 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 254, column: 7)
!1180 = !DILocalVariable(name: "__o1", scope: !1181, file: !3, line: 258, type: !785)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 258, column: 7)
!1182 = distinct !DILexicalBlock(scope: !1177, file: !3, line: 258, column: 7)
!1183 = !DILocalVariable(name: "__o", scope: !1184, file: !3, line: 261, type: !790)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 261, column: 5)
!1185 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 260, column: 7)
!1186 = !DILocalVariable(name: "__o1", scope: !1187, file: !3, line: 261, type: !785)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !3, line: 261, column: 5)
!1188 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 261, column: 5)
!1189 = !DILocalVariable(name: "__o", scope: !1190, file: !3, line: 263, type: !790)
!1190 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 263, column: 3)
!1191 = !DILocalVariable(name: "__o1", scope: !1192, file: !3, line: 263, type: !785)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 263, column: 3)
!1193 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 263, column: 3)
!1194 = !DILocalVariable(name: "__o", scope: !1195, file: !3, line: 267, type: !790)
!1195 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 267, column: 3)
!1196 = !DILocalVariable(name: "__o1", scope: !1197, file: !3, line: 267, type: !785)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 267, column: 3)
!1198 = distinct !DILexicalBlock(scope: !1195, file: !3, line: 267, column: 3)
!1199 = !DILocation(line: 0, scope: !1169)
!1200 = !DILocation(line: 254, column: 7, scope: !1179)
!1201 = !DILocation(line: 254, column: 7, scope: !1169)
!1202 = !DILocation(line: 256, column: 7, scope: !1178)
!1203 = !DILocation(line: 257, column: 7, scope: !1178)
!1204 = !DILocation(line: 0, scope: !1177)
!1205 = !DILocation(line: 0, scope: !1181)
!1206 = !DILocation(line: 258, column: 7, scope: !1181)
!1207 = !{!919, !555, i64 32}
!1208 = !DILocation(line: 258, column: 7, scope: !1182)
!1209 = !DILocation(line: 258, column: 7, scope: !1177)
!1210 = !DILocation(line: 259, column: 5, scope: !1178)
!1211 = !DILocation(line: 260, column: 7, scope: !1185)
!1212 = !DILocation(line: 260, column: 7, scope: !1169)
!1213 = !DILocation(line: 0, scope: !1184)
!1214 = !DILocation(line: 0, scope: !1187)
!1215 = !DILocation(line: 261, column: 5, scope: !1187)
!1216 = !DILocation(line: 261, column: 5, scope: !1188)
!1217 = !DILocation(line: 261, column: 5, scope: !1184)
!1218 = !DILocation(line: 261, column: 5, scope: !1185)
!1219 = !DILocation(line: 262, column: 3, scope: !1169)
!1220 = !DILocation(line: 0, scope: !1190)
!1221 = !DILocation(line: 0, scope: !1192)
!1222 = !DILocation(line: 263, column: 3, scope: !1192)
!1223 = !DILocation(line: 263, column: 3, scope: !1193)
!1224 = !DILocation(line: 263, column: 3, scope: !1190)
!1225 = !DILocation(line: 264, column: 3, scope: !1169)
!1226 = !DILocation(line: 265, column: 7, scope: !1227)
