; ModuleID = 'src/dirname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [28 x i8] c"Usage: %s [OPTION] NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [152 x i8] c"Output each NAME with its last non-slash component and trailing slashes\0Aremoved; if NAME contains no /'s, output '.' (meaning the current directory).\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"dirname\00", align 1
@.str.4 = private unnamed_addr constant [66 x i8] c"  -z, --zero\0A         end each output line with NUL, not newline\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 34, type: !145, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a60dd6e6d60eda028b732002e611b3c7")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !28, !30, !31, !32}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 46, baseType: !27)
!26 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!27 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34, !114, !0}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "dot", scope: !36, file: !3, line: 124, type: !29, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 78, type: !37, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !40)
!37 = !DISubroutineType(types: !38)
!38 = !{!30, !30, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!40 = !{!41, !42, !43, !45, !47, !51, !56, !58, !113}
!41 = !DILocalVariable(name: "argc", arg: 1, scope: !36, file: !3, line: 78, type: !30)
!42 = !DILocalVariable(name: "argv", arg: 2, scope: !36, file: !3, line: 78, type: !39)
!43 = !DILocalVariable(name: "use_nuls", scope: !36, file: !3, line: 80, type: !44)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DILocalVariable(name: "c", scope: !46, file: !3, line: 92, type: !30)
!46 = distinct !DILexicalBlock(scope: !36, file: !3, line: 91, column: 5)
!47 = !DILocalVariable(name: "result", scope: !48, file: !3, line: 119, type: !28)
!48 = distinct !DILexicalBlock(scope: !49, file: !3, line: 118, column: 5)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 117, column: 3)
!50 = distinct !DILexicalBlock(scope: !36, file: !3, line: 117, column: 3)
!51 = !DILocalVariable(name: "len", scope: !48, file: !3, line: 120, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !53, line: 130, baseType: !54)
!53 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !26, line: 35, baseType: !55)
!55 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!56 = !DILocalVariable(name: "__ptr", scope: !57, file: !3, line: 129, type: !28)
!57 = distinct !DILexicalBlock(scope: !48, file: !3, line: 129, column: 7)
!58 = !DILocalVariable(name: "__stream", scope: !57, file: !3, line: 129, type: !59)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !61, line: 7, baseType: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 49, size: 1728, elements: !64)
!63 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!64 = !{!65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !80, !82, !83, !84, !87, !88, !90, !94, !97, !99, !102, !105, !106, !107, !108, !109}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !62, file: !63, line: 51, baseType: !30, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !62, file: !63, line: 54, baseType: !22, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !62, file: !63, line: 55, baseType: !22, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !62, file: !63, line: 56, baseType: !22, size: 64, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !62, file: !63, line: 57, baseType: !22, size: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !62, file: !63, line: 58, baseType: !22, size: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !62, file: !63, line: 59, baseType: !22, size: 64, offset: 384)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !62, file: !63, line: 60, baseType: !22, size: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !62, file: !63, line: 61, baseType: !22, size: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !62, file: !63, line: 64, baseType: !22, size: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !62, file: !63, line: 65, baseType: !22, size: 64, offset: 640)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !62, file: !63, line: 66, baseType: !22, size: 64, offset: 704)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !62, file: !63, line: 68, baseType: !78, size: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !63, line: 36, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !62, file: !63, line: 70, baseType: !81, size: 64, offset: 832)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !62, file: !63, line: 72, baseType: !30, size: 32, offset: 896)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !62, file: !63, line: 73, baseType: !30, size: 32, offset: 928)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !62, file: !63, line: 74, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !86, line: 152, baseType: !55)
!86 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !62, file: !63, line: 77, baseType: !31, size: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !62, file: !63, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !62, file: !63, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !62, file: !63, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !63, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !62, file: !63, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !86, line: 153, baseType: !55)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !62, file: !63, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !63, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !62, file: !63, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !63, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !62, file: !63, line: 93, baseType: !81, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !62, file: !63, line: 94, baseType: !24, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !62, file: !63, line: 95, baseType: !25, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !62, file: !63, line: 96, baseType: !30, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !62, file: !63, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocalVariable(name: "__cnt", scope: !57, file: !3, line: 129, type: !25)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !116, file: !117, line: 575, type: !30, isLocal: true, isDefinition: true)
!116 = distinct !DISubprogram(name: "oputs_", scope: !117, file: !117, line: 573, type: !118, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !120)
!117 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!118 = !DISubroutineType(types: !119)
!119 = !{null, !28, !28}
!120 = !{!121, !122, !123, !126, !127, !128, !129, !133, !134, !135, !136, !138, !139, !140, !141, !143, !144}
!121 = !DILocalVariable(name: "program", arg: 1, scope: !116, file: !117, line: 573, type: !28)
!122 = !DILocalVariable(name: "option", arg: 2, scope: !116, file: !117, line: 573, type: !28)
!123 = !DILocalVariable(name: "term", scope: !124, file: !117, line: 585, type: !28)
!124 = distinct !DILexicalBlock(scope: !125, file: !117, line: 582, column: 5)
!125 = distinct !DILexicalBlock(scope: !116, file: !117, line: 581, column: 7)
!126 = !DILocalVariable(name: "double_space", scope: !116, file: !117, line: 594, type: !44)
!127 = !DILocalVariable(name: "first_word", scope: !116, file: !117, line: 595, type: !28)
!128 = !DILocalVariable(name: "option_text", scope: !116, file: !117, line: 596, type: !28)
!129 = !DILocalVariable(name: "s", scope: !130, file: !117, line: 608, type: !28)
!130 = distinct !DILexicalBlock(scope: !131, file: !117, line: 605, column: 5)
!131 = distinct !DILexicalBlock(scope: !132, file: !117, line: 604, column: 12)
!132 = distinct !DILexicalBlock(scope: !116, file: !117, line: 597, column: 7)
!133 = !DILocalVariable(name: "spaces", scope: !130, file: !117, line: 609, type: !25)
!134 = !DILocalVariable(name: "anchor_len", scope: !116, file: !117, line: 620, type: !25)
!135 = !DILocalVariable(name: "desc_text", scope: !116, file: !117, line: 625, type: !28)
!136 = !DILocalVariable(name: "__ptr", scope: !137, file: !117, line: 644, type: !28)
!137 = distinct !DILexicalBlock(scope: !116, file: !117, line: 644, column: 3)
!138 = !DILocalVariable(name: "__stream", scope: !137, file: !117, line: 644, type: !59)
!139 = !DILocalVariable(name: "__cnt", scope: !137, file: !117, line: 644, type: !25)
!140 = !DILocalVariable(name: "url_program", scope: !116, file: !117, line: 648, type: !28)
!141 = !DILocalVariable(name: "__ptr", scope: !142, file: !117, line: 686, type: !28)
!142 = distinct !DILexicalBlock(scope: !116, file: !117, line: 686, column: 3)
!143 = !DILocalVariable(name: "__stream", scope: !142, file: !117, line: 686, type: !59)
!144 = !DILocalVariable(name: "__cnt", scope: !142, file: !117, line: 686, type: !25)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 1024, elements: !155)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !148, line: 50, size: 256, elements: !149)
!148 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!149 = !{!150, !151, !152, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 52, baseType: !28, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !147, file: !148, line: 55, baseType: !30, size: 32, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !147, file: !148, line: 56, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !147, file: !148, line: 57, baseType: !30, size: 32, offset: 192)
!155 = !{!156}
!156 = !DISubrange(count: 4)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "Version", scope: !159, file: !160, line: 3, type: !28, isLocal: false, isDefinition: true)
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !161, splitDebugInlining: false, nameTableKind: None)
!160 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!161 = !{!157}
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "file_name", scope: !164, file: !165, line: 45, type: !28, isLocal: true, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !166, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!166 = !{!162, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !164, file: !165, line: 55, type: !44, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !171, file: !172, line: 66, type: !207, isLocal: false, isDefinition: true)
!171 = distinct !DICompileUnit(language: DW_LANG_C99, file: !172, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !173, globals: !174, splitDebugInlining: false, nameTableKind: None)
!172 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!173 = !{!24, !32}
!174 = !{!175, !201, !169, !203, !205}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "old_file_name", scope: !177, file: !172, line: 304, type: !28, isLocal: true, isDefinition: true)
!177 = distinct !DISubprogram(name: "verror_at_line", scope: !172, file: !172, line: 298, type: !178, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !194)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !30, !30, !28, !7, !28, !180}
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !181, line: 52, baseType: !182)
!181 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !183, line: 32, baseType: !184)
!183 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !185, baseType: !186)
!185 = !DIFile(filename: "lib/error.c", directory: "/src")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !187, size: 256, elements: !188)
!187 = !DINamespace(name: "std", scope: null)
!188 = !{!189, !190, !191, !192, !193}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !186, file: !185, baseType: !24, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !186, file: !185, baseType: !24, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !186, file: !185, baseType: !24, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !186, file: !185, baseType: !30, size: 32, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !186, file: !185, baseType: !30, size: 32, offset: 224)
!194 = !{!195, !196, !197, !198, !199, !200}
!195 = !DILocalVariable(name: "status", arg: 1, scope: !177, file: !172, line: 298, type: !30)
!196 = !DILocalVariable(name: "errnum", arg: 2, scope: !177, file: !172, line: 298, type: !30)
!197 = !DILocalVariable(name: "file_name", arg: 3, scope: !177, file: !172, line: 298, type: !28)
!198 = !DILocalVariable(name: "line_number", arg: 4, scope: !177, file: !172, line: 298, type: !7)
!199 = !DILocalVariable(name: "message", arg: 5, scope: !177, file: !172, line: 298, type: !28)
!200 = !DILocalVariable(name: "args", arg: 6, scope: !177, file: !172, line: 298, type: !180)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "old_line_number", scope: !177, file: !172, line: 305, type: !7, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "error_message_count", scope: !171, file: !172, line: 69, type: !7, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !171, file: !172, line: 295, type: !30, isLocal: false, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null}
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "program_name", scope: !212, file: !213, line: 31, type: !28, isLocal: false, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !214, globals: !215, splitDebugInlining: false, nameTableKind: None)
!213 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!214 = !{!22}
!215 = !{!210}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "utf07FF", scope: !218, file: !219, line: 46, type: !247, isLocal: true, isDefinition: true)
!218 = distinct !DISubprogram(name: "proper_name_lite", scope: !219, file: !219, line: 38, type: !220, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !222, retainedNodes: !224)
!219 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!220 = !DISubroutineType(types: !221)
!221 = !{!28, !28, !28}
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !223, splitDebugInlining: false, nameTableKind: None)
!223 = !{!216}
!224 = !{!225, !226, !227, !228, !233}
!225 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !218, file: !219, line: 38, type: !28)
!226 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !218, file: !219, line: 38, type: !28)
!227 = !DILocalVariable(name: "translation", scope: !218, file: !219, line: 40, type: !28)
!228 = !DILocalVariable(name: "w", scope: !218, file: !219, line: 47, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !230, line: 37, baseType: !231)
!230 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !86, line: 57, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !86, line: 42, baseType: !7)
!233 = !DILocalVariable(name: "mbs", scope: !218, file: !219, line: 48, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !236)
!235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !238)
!237 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !238, file: !237, line: 15, baseType: !30, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !238, file: !237, line: 20, baseType: !242, size: 32, offset: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !237, line: 16, size: 32, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !242, file: !237, line: 18, baseType: !7, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !242, file: !237, line: 19, baseType: !246, size: 32)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !155)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 16, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 2)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !252, file: !253, line: 76, type: !335, isLocal: false, isDefinition: true)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !254, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!254 = !{!255, !269, !5}
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !256, line: 42, baseType: !7, size: 32, elements: !257)
!256 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!258 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!259 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!260 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!261 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!262 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!263 = !DIEnumerator(name: "c_quoting_style", value: 5)
!264 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!265 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!266 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!267 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!268 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !256, line: 254, baseType: !7, size: 32, elements: !270)
!270 = !{!271, !272, !273}
!271 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!272 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!273 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!274 = !{!30, !31, !25}
!275 = !{!250, !276, !282, !294, !296, !301, !324, !331, !333}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !252, file: !253, line: 92, type: !278, isLocal: false, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 320, elements: !280)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!280 = !{!281}
!281 = !DISubrange(count: 10)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !252, file: !253, line: 1040, type: !284, isLocal: false, isDefinition: true)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !253, line: 56, size: 448, elements: !285)
!285 = !{!286, !287, !288, !292, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !284, file: !253, line: 59, baseType: !255, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !284, file: !253, line: 62, baseType: !30, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !284, file: !253, line: 66, baseType: !289, size: 256, offset: 64)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 8)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !284, file: !253, line: 69, baseType: !28, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !284, file: !253, line: 72, baseType: !28, size: 64, offset: 384)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !252, file: !253, line: 107, type: !284, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "slot0", scope: !252, file: !253, line: 831, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 256)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "quote", scope: !303, file: !253, line: 228, type: !322, isLocal: true, isDefinition: true)
!303 = distinct !DISubprogram(name: "gettext_quote", scope: !253, file: !253, line: 197, type: !304, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !306)
!304 = !DISubroutineType(types: !305)
!305 = !{!28, !28, !255}
!306 = !{!307, !308, !309, !310, !311}
!307 = !DILocalVariable(name: "msgid", arg: 1, scope: !303, file: !253, line: 197, type: !28)
!308 = !DILocalVariable(name: "s", arg: 2, scope: !303, file: !253, line: 197, type: !255)
!309 = !DILocalVariable(name: "translation", scope: !303, file: !253, line: 199, type: !28)
!310 = !DILocalVariable(name: "w", scope: !303, file: !253, line: 229, type: !229)
!311 = !DILocalVariable(name: "mbs", scope: !303, file: !253, line: 230, type: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !314, file: !237, line: 15, baseType: !30, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !314, file: !237, line: 20, baseType: !318, size: 32, offset: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !237, line: 16, size: 32, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !318, file: !237, line: 18, baseType: !7, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !318, file: !237, line: 19, baseType: !246, size: 32)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 64, elements: !323)
!323 = !{!249, !156}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "slotvec", scope: !252, file: !253, line: 834, type: !326, isLocal: true, isDefinition: true)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !253, line: 823, size: 128, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !327, file: !253, line: 825, baseType: !25, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !327, file: !253, line: 826, baseType: !22, size: 64, offset: 64)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "nslots", scope: !252, file: !253, line: 832, type: !30, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "slotvec0", scope: !252, file: !253, line: 833, type: !327, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 704, elements: !337)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!337 = !{!338}
!338 = !DISubrange(count: 11)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !341, file: !342, line: 26, type: !344, isLocal: false, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!343 = !{!339}
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 47)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "exit_failure", scope: !349, file: !350, line: 24, type: !352, isLocal: false, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !351, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!351 = !{!347}
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "internal_state", scope: !355, file: !356, line: 97, type: !359, isLocal: true, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !357, globals: !358, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!357 = !{!24, !25, !32}
!358 = !{!353}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !361, file: !237, line: 15, baseType: !30, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !361, file: !237, line: 20, baseType: !365, size: 32, offset: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !361, file: !237, line: 16, size: 32, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !365, file: !237, line: 18, baseType: !7, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !365, file: !237, line: 19, baseType: !246, size: 32)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!375 = !{!376}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 40, baseType: !7, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!379 = !{!24}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !410, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!382 = !{!383, !395}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !384, file: !381, line: 188, baseType: !7, size: 32, elements: !393)
!384 = distinct !DISubprogram(name: "x2nrealloc", scope: !381, file: !381, line: 176, type: !385, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !388)
!385 = !DISubroutineType(types: !386)
!386 = !{!24, !24, !387, !25}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!388 = !{!389, !390, !391, !392}
!389 = !DILocalVariable(name: "p", arg: 1, scope: !384, file: !381, line: 176, type: !24)
!390 = !DILocalVariable(name: "pn", arg: 2, scope: !384, file: !381, line: 176, type: !387)
!391 = !DILocalVariable(name: "s", arg: 3, scope: !384, file: !381, line: 176, type: !25)
!392 = !DILocalVariable(name: "n", scope: !384, file: !381, line: 178, type: !25)
!393 = !{!394}
!394 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !396, file: !381, line: 228, baseType: !7, size: 32, elements: !393)
!396 = distinct !DISubprogram(name: "xpalloc", scope: !381, file: !381, line: 223, type: !397, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !400)
!397 = !DISubroutineType(types: !398)
!398 = !{!24, !24, !399, !52, !54, !52}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409}
!401 = !DILocalVariable(name: "pa", arg: 1, scope: !396, file: !381, line: 223, type: !24)
!402 = !DILocalVariable(name: "pn", arg: 2, scope: !396, file: !381, line: 223, type: !399)
!403 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !396, file: !381, line: 223, type: !52)
!404 = !DILocalVariable(name: "n_max", arg: 4, scope: !396, file: !381, line: 223, type: !54)
!405 = !DILocalVariable(name: "s", arg: 5, scope: !396, file: !381, line: 223, type: !52)
!406 = !DILocalVariable(name: "n0", scope: !396, file: !381, line: 230, type: !52)
!407 = !DILocalVariable(name: "n", scope: !396, file: !381, line: 237, type: !52)
!408 = !DILocalVariable(name: "nbytes", scope: !396, file: !381, line: 248, type: !52)
!409 = !DILocalVariable(name: "adjusted_nbytes", scope: !396, file: !381, line: 252, type: !52)
!410 = !{!22, !24, !44, !55, !27}
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !214, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !425, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!425 = !{!44, !27, !24}
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!432 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!433 = !{i32 7, !"Dwarf Version", i32 5}
!434 = !{i32 2, !"Debug Info Version", i32 3}
!435 = !{i32 1, !"wchar_size", i32 4}
!436 = !{i32 1, !"branch-target-enforcement", i32 0}
!437 = !{i32 1, !"sign-return-address", i32 0}
!438 = !{i32 1, !"sign-return-address-all", i32 0}
!439 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!440 = !{i32 7, !"PIC Level", i32 2}
!441 = !{i32 7, !"PIE Level", i32 2}
!442 = !{i32 7, !"uwtable", i32 1}
!443 = !{i32 7, !"frame-pointer", i32 1}
!444 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 43, type: !445, scopeLine: 44, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !30}
!447 = !{!448}
!448 = !DILocalVariable(name: "status", arg: 1, scope: !444, file: !3, line: 43, type: !30)
!449 = !DILocation(line: 0, scope: !444)
!450 = !DILocation(line: 45, column: 14, scope: !451)
!451 = distinct !DILexicalBlock(scope: !444, file: !3, line: 45, column: 7)
!452 = !DILocation(line: 45, column: 7, scope: !444)
!453 = !DILocation(line: 46, column: 5, scope: !454)
!454 = distinct !DILexicalBlock(scope: !451, file: !3, line: 46, column: 5)
!455 = !{!456, !456, i64 0}
!456 = !{!"any pointer", !457, i64 0}
!457 = !{!"omnipotent char", !458, i64 0}
!458 = !{!"Simple C/C++ TBAA"}
!459 = !DILocation(line: 49, column: 7, scope: !460)
!460 = distinct !DILexicalBlock(scope: !451, file: !3, line: 48, column: 5)
!461 = !DILocation(line: 53, column: 7, scope: !460)
!462 = !DILocation(line: 58, column: 7, scope: !460)
!463 = !DILocation(line: 62, column: 7, scope: !460)
!464 = !DILocation(line: 63, column: 7, scope: !460)
!465 = !DILocation(line: 64, column: 7, scope: !460)
!466 = !DILocalVariable(name: "program", arg: 1, scope: !467, file: !117, line: 836, type: !28)
!467 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !117, file: !117, line: 836, type: !468, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !28}
!470 = !{!466, !471, !480, !481, !483, !484}
!471 = !DILocalVariable(name: "infomap", scope: !467, file: !117, line: 838, type: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 896, elements: !478)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !467, file: !117, line: 838, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !474, file: !117, line: 838, baseType: !28, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !117, line: 838, baseType: !28, size: 64, offset: 64)
!478 = !{!479}
!479 = !DISubrange(count: 7)
!480 = !DILocalVariable(name: "node", scope: !467, file: !117, line: 848, type: !28)
!481 = !DILocalVariable(name: "map_prog", scope: !467, file: !117, line: 849, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!483 = !DILocalVariable(name: "lc_messages", scope: !467, file: !117, line: 861, type: !28)
!484 = !DILocalVariable(name: "url_program", scope: !467, file: !117, line: 874, type: !28)
!485 = !DILocation(line: 0, scope: !467, inlinedAt: !486)
!486 = distinct !DILocation(line: 72, column: 7, scope: !460)
!487 = !DILocation(line: 838, column: 3, scope: !467, inlinedAt: !486)
!488 = !DILocation(line: 838, column: 67, scope: !467, inlinedAt: !486)
!489 = !DILocation(line: 849, column: 36, scope: !467, inlinedAt: !486)
!490 = !DILocation(line: 851, column: 3, scope: !467, inlinedAt: !486)
!491 = !DILocalVariable(name: "__s1", arg: 1, scope: !492, file: !493, line: 1359, type: !28)
!492 = distinct !DISubprogram(name: "streq", scope: !493, file: !493, line: 1359, type: !494, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !496)
!493 = !DIFile(filename: "./lib/string.h", directory: "/src")
!494 = !DISubroutineType(types: !495)
!495 = !{!44, !28, !28}
!496 = !{!491, !497}
!497 = !DILocalVariable(name: "__s2", arg: 2, scope: !492, file: !493, line: 1359, type: !28)
!498 = !DILocation(line: 0, scope: !492, inlinedAt: !499)
!499 = distinct !DILocation(line: 851, column: 33, scope: !467, inlinedAt: !486)
!500 = !DILocation(line: 1361, column: 11, scope: !492, inlinedAt: !499)
!501 = !DILocation(line: 1361, column: 10, scope: !492, inlinedAt: !499)
!502 = !DILocation(line: 852, column: 13, scope: !467, inlinedAt: !486)
!503 = !DILocation(line: 851, column: 20, scope: !467, inlinedAt: !486)
!504 = !{!505, !456, i64 0}
!505 = !{!"infomap", !456, i64 0, !456, i64 8}
!506 = !DILocation(line: 851, column: 10, scope: !467, inlinedAt: !486)
!507 = !DILocation(line: 851, column: 28, scope: !467, inlinedAt: !486)
!508 = distinct !{!508, !490, !502, !509}
!509 = !{!"llvm.loop.mustprogress"}
!510 = !DILocation(line: 854, column: 17, scope: !511, inlinedAt: !486)
!511 = distinct !DILexicalBlock(scope: !467, file: !117, line: 854, column: 7)
!512 = !{!505, !456, i64 8}
!513 = !DILocation(line: 854, column: 7, scope: !511, inlinedAt: !486)
!514 = !DILocation(line: 854, column: 7, scope: !467, inlinedAt: !486)
!515 = !DILocation(line: 857, column: 3, scope: !467, inlinedAt: !486)
!516 = !DILocation(line: 861, column: 29, scope: !467, inlinedAt: !486)
!517 = !DILocation(line: 862, column: 7, scope: !518, inlinedAt: !486)
!518 = distinct !DILexicalBlock(scope: !467, file: !117, line: 862, column: 7)
!519 = !DILocation(line: 862, column: 19, scope: !518, inlinedAt: !486)
!520 = !DILocation(line: 862, column: 22, scope: !518, inlinedAt: !486)
!521 = !DILocation(line: 862, column: 7, scope: !467, inlinedAt: !486)
!522 = !DILocation(line: 868, column: 7, scope: !523, inlinedAt: !486)
!523 = distinct !DILexicalBlock(scope: !518, file: !117, line: 863, column: 5)
!524 = !DILocation(line: 870, column: 5, scope: !523, inlinedAt: !486)
!525 = !DILocation(line: 0, scope: !492, inlinedAt: !526)
!526 = distinct !DILocation(line: 874, column: 29, scope: !467, inlinedAt: !486)
!527 = !DILocation(line: 875, column: 3, scope: !467, inlinedAt: !486)
!528 = !DILocation(line: 877, column: 3, scope: !467, inlinedAt: !486)
!529 = !DILocation(line: 879, column: 1, scope: !467, inlinedAt: !486)
!530 = !DILocation(line: 74, column: 3, scope: !444)
!531 = !DISubprogram(name: "dcgettext", scope: !532, file: !532, line: 51, type: !533, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!532 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!533 = !DISubroutineType(types: !534)
!534 = !{!22, !28, !28, !30}
!535 = !{}
!536 = !DISubprogram(name: "fputs_unlocked", scope: !181, file: !181, line: 691, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!537 = !DISubroutineType(types: !538)
!538 = !{!30, !539, !540}
!539 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !28)
!540 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!541 = !DILocation(line: 0, scope: !116)
!542 = !DILocation(line: 581, column: 7, scope: !125)
!543 = !{!544, !544, i64 0}
!544 = !{!"int", !457, i64 0}
!545 = !DILocation(line: 581, column: 19, scope: !125)
!546 = !DILocation(line: 581, column: 7, scope: !116)
!547 = !DILocation(line: 585, column: 26, scope: !124)
!548 = !DILocation(line: 0, scope: !124)
!549 = !DILocation(line: 586, column: 23, scope: !124)
!550 = !DILocation(line: 586, column: 28, scope: !124)
!551 = !DILocation(line: 586, column: 32, scope: !124)
!552 = !{!457, !457, i64 0}
!553 = !DILocation(line: 586, column: 38, scope: !124)
!554 = !DILocation(line: 0, scope: !492, inlinedAt: !555)
!555 = distinct !DILocation(line: 586, column: 41, scope: !124)
!556 = !DILocation(line: 1361, column: 11, scope: !492, inlinedAt: !555)
!557 = !DILocation(line: 1361, column: 10, scope: !492, inlinedAt: !555)
!558 = !DILocation(line: 586, column: 19, scope: !124)
!559 = !DILocation(line: 587, column: 5, scope: !124)
!560 = !DILocation(line: 588, column: 7, scope: !561)
!561 = distinct !DILexicalBlock(scope: !116, file: !117, line: 588, column: 7)
!562 = !DILocation(line: 588, column: 7, scope: !116)
!563 = !DILocation(line: 590, column: 7, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !117, line: 589, column: 5)
!565 = !DILocation(line: 591, column: 7, scope: !564)
!566 = !DILocation(line: 595, column: 37, scope: !116)
!567 = !DILocation(line: 595, column: 35, scope: !116)
!568 = !DILocation(line: 596, column: 29, scope: !116)
!569 = !DILocation(line: 597, column: 8, scope: !132)
!570 = !DILocation(line: 597, column: 7, scope: !116)
!571 = !DILocation(line: 604, column: 24, scope: !131)
!572 = !DILocation(line: 604, column: 12, scope: !132)
!573 = !DILocation(line: 0, scope: !130)
!574 = !DILocation(line: 610, column: 16, scope: !130)
!575 = !DILocation(line: 610, column: 7, scope: !130)
!576 = !DILocation(line: 611, column: 21, scope: !130)
!577 = !{!578, !578, i64 0}
!578 = !{!"short", !457, i64 0}
!579 = !DILocation(line: 611, column: 19, scope: !130)
!580 = !DILocation(line: 611, column: 16, scope: !130)
!581 = !DILocation(line: 610, column: 30, scope: !130)
!582 = distinct !{!582, !575, !576, !509}
!583 = !DILocation(line: 612, column: 18, scope: !584)
!584 = distinct !DILexicalBlock(scope: !130, file: !117, line: 612, column: 11)
!585 = !DILocation(line: 612, column: 11, scope: !130)
!586 = !DILocation(line: 620, column: 23, scope: !116)
!587 = !DILocation(line: 625, column: 39, scope: !116)
!588 = !DILocation(line: 626, column: 3, scope: !116)
!589 = !DILocation(line: 626, column: 10, scope: !116)
!590 = !DILocation(line: 626, column: 21, scope: !116)
!591 = !DILocation(line: 628, column: 44, scope: !592)
!592 = distinct !DILexicalBlock(scope: !593, file: !117, line: 628, column: 11)
!593 = distinct !DILexicalBlock(scope: !116, file: !117, line: 627, column: 5)
!594 = !DILocation(line: 628, column: 32, scope: !592)
!595 = !DILocation(line: 628, column: 49, scope: !592)
!596 = !DILocation(line: 628, column: 11, scope: !593)
!597 = !DILocation(line: 630, column: 11, scope: !598)
!598 = distinct !DILexicalBlock(scope: !593, file: !117, line: 630, column: 11)
!599 = !DILocation(line: 630, column: 11, scope: !593)
!600 = !DILocation(line: 632, column: 26, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !117, line: 632, column: 15)
!602 = distinct !DILexicalBlock(scope: !598, file: !117, line: 631, column: 9)
!603 = !DILocation(line: 632, column: 34, scope: !601)
!604 = !DILocation(line: 632, column: 37, scope: !601)
!605 = !DILocation(line: 632, column: 15, scope: !602)
!606 = !DILocation(line: 636, column: 29, scope: !607)
!607 = distinct !DILexicalBlock(scope: !602, file: !117, line: 636, column: 15)
!608 = !DILocation(line: 640, column: 16, scope: !593)
!609 = distinct !{!609, !588, !610, !509}
!610 = !DILocation(line: 641, column: 5, scope: !116)
!611 = !DILocation(line: 644, column: 3, scope: !116)
!612 = !DILocation(line: 0, scope: !492, inlinedAt: !613)
!613 = distinct !DILocation(line: 648, column: 31, scope: !116)
!614 = !DILocation(line: 0, scope: !492, inlinedAt: !615)
!615 = distinct !DILocation(line: 649, column: 31, scope: !116)
!616 = !DILocation(line: 0, scope: !492, inlinedAt: !617)
!617 = distinct !DILocation(line: 650, column: 31, scope: !116)
!618 = !DILocation(line: 0, scope: !492, inlinedAt: !619)
!619 = distinct !DILocation(line: 651, column: 31, scope: !116)
!620 = !DILocation(line: 0, scope: !492, inlinedAt: !621)
!621 = distinct !DILocation(line: 652, column: 31, scope: !116)
!622 = !DILocation(line: 0, scope: !492, inlinedAt: !623)
!623 = distinct !DILocation(line: 653, column: 31, scope: !116)
!624 = !DILocation(line: 0, scope: !492, inlinedAt: !625)
!625 = distinct !DILocation(line: 654, column: 31, scope: !116)
!626 = !DILocation(line: 0, scope: !492, inlinedAt: !627)
!627 = distinct !DILocation(line: 655, column: 31, scope: !116)
!628 = !DILocation(line: 0, scope: !492, inlinedAt: !629)
!629 = distinct !DILocation(line: 656, column: 31, scope: !116)
!630 = !DILocation(line: 0, scope: !492, inlinedAt: !631)
!631 = distinct !DILocation(line: 657, column: 31, scope: !116)
!632 = !DILocation(line: 663, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !116, file: !117, line: 663, column: 7)
!634 = !DILocation(line: 664, column: 7, scope: !633)
!635 = !DILocation(line: 664, column: 10, scope: !633)
!636 = !DILocation(line: 663, column: 7, scope: !116)
!637 = !DILocation(line: 669, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !633, file: !117, line: 665, column: 5)
!639 = !DILocation(line: 671, column: 5, scope: !638)
!640 = !DILocation(line: 676, column: 7, scope: !641)
!641 = distinct !DILexicalBlock(scope: !633, file: !117, line: 673, column: 5)
!642 = !DILocation(line: 679, column: 3, scope: !116)
!643 = !DILocation(line: 683, column: 3, scope: !116)
!644 = !DILocation(line: 686, column: 3, scope: !116)
!645 = !DILocation(line: 688, column: 3, scope: !116)
!646 = !DILocation(line: 691, column: 3, scope: !116)
!647 = !DILocation(line: 695, column: 3, scope: !116)
!648 = !DILocation(line: 696, column: 1, scope: !116)
!649 = !DISubprogram(name: "setlocale", scope: !650, file: !650, line: 122, type: !651, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!650 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!651 = !DISubroutineType(types: !652)
!652 = !{!22, !30, !28}
!653 = !DISubprogram(name: "getenv", scope: !654, file: !654, line: 641, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!654 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!655 = !DISubroutineType(types: !656)
!656 = !{!22, !28}
!657 = !DISubprogram(name: "fwrite_unlocked", scope: !181, file: !181, line: 704, type: !658, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!658 = !DISubroutineType(types: !659)
!659 = !{!25, !660, !25, !25, !540}
!660 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!663 = !DILocation(line: 0, scope: !36)
!664 = !DILocation(line: 83, column: 21, scope: !36)
!665 = !DILocation(line: 83, column: 3, scope: !36)
!666 = !DILocation(line: 84, column: 3, scope: !36)
!667 = !DILocation(line: 85, column: 3, scope: !36)
!668 = !DILocation(line: 86, column: 3, scope: !36)
!669 = !DILocation(line: 88, column: 3, scope: !36)
!670 = !DILocation(line: 90, column: 3, scope: !36)
!671 = !DILocation(line: 92, column: 15, scope: !46)
!672 = !DILocation(line: 0, scope: !46)
!673 = !DILocation(line: 94, column: 11, scope: !46)
!674 = !DILocation(line: 103, column: 9, scope: !675)
!675 = distinct !DILexicalBlock(scope: !46, file: !3, line: 98, column: 9)
!676 = !DILocation(line: 104, column: 9, scope: !675)
!677 = !DILocation(line: 107, column: 11, scope: !675)
!678 = !DILocation(line: 111, column: 14, scope: !679)
!679 = distinct !DILexicalBlock(scope: !36, file: !3, line: 111, column: 7)
!680 = !DILocation(line: 111, column: 12, scope: !679)
!681 = !DILocation(line: 111, column: 7, scope: !36)
!682 = !DILocation(line: 117, column: 3, scope: !50)
!683 = !DILocation(line: 113, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !679, file: !3, line: 112, column: 5)
!685 = !DILocation(line: 114, column: 7, scope: !684)
!686 = !DILocation(line: 119, column: 28, scope: !48)
!687 = !DILocation(line: 0, scope: !48)
!688 = !DILocation(line: 120, column: 19, scope: !48)
!689 = !DILocation(line: 122, column: 13, scope: !690)
!690 = distinct !DILexicalBlock(scope: !48, file: !3, line: 122, column: 11)
!691 = !DILocation(line: 122, column: 11, scope: !48)
!692 = !DILocation(line: 129, column: 7, scope: !48)
!693 = !DILocalVariable(name: "__c", arg: 1, scope: !694, file: !695, line: 108, type: !30)
!694 = distinct !DISubprogram(name: "putchar_unlocked", scope: !695, file: !695, line: 108, type: !696, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!695 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!696 = !DISubroutineType(types: !697)
!697 = !{!30, !30}
!698 = !{!693}
!699 = !DILocation(line: 0, scope: !694, inlinedAt: !700)
!700 = distinct !DILocation(line: 130, column: 7, scope: !48)
!701 = !DILocation(line: 110, column: 10, scope: !694, inlinedAt: !700)
!702 = !{!703, !456, i64 40}
!703 = !{!"_IO_FILE", !544, i64 0, !456, i64 8, !456, i64 16, !456, i64 24, !456, i64 32, !456, i64 40, !456, i64 48, !456, i64 56, !456, i64 64, !456, i64 72, !456, i64 80, !456, i64 88, !456, i64 96, !456, i64 104, !544, i64 112, !544, i64 116, !704, i64 120, !578, i64 128, !457, i64 130, !457, i64 131, !456, i64 136, !704, i64 144, !456, i64 152, !456, i64 160, !456, i64 168, !456, i64 176, !704, i64 184, !544, i64 192, !457, i64 196}
!704 = !{!"long", !457, i64 0}
!705 = !{!703, !456, i64 48}
!706 = !{!"branch_weights", i32 2000, i32 1}
!707 = !DILocation(line: 117, column: 31, scope: !49)
!708 = !DILocation(line: 117, column: 17, scope: !49)
!709 = distinct !{!709, !682, !710, !509}
!710 = !DILocation(line: 131, column: 5, scope: !50)
!711 = !DILocation(line: 134, column: 1, scope: !36)
!712 = !DISubprogram(name: "bindtextdomain", scope: !532, file: !532, line: 86, type: !713, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!713 = !DISubroutineType(types: !714)
!714 = !{!22, !28, !28}
!715 = !DISubprogram(name: "textdomain", scope: !532, file: !532, line: 82, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!716 = !DISubprogram(name: "atexit", scope: !654, file: !654, line: 602, type: !717, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!717 = !DISubroutineType(types: !718)
!718 = !{!30, !207}
!719 = !DISubprogram(name: "getopt_long", scope: !148, file: !148, line: 66, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!720 = !DISubroutineType(types: !721)
!721 = !{!30, !30, !722, !28, !724, !153}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!725 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !165, file: !165, line: 50, type: !468, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !726)
!726 = !{!727}
!727 = !DILocalVariable(name: "file", arg: 1, scope: !725, file: !165, line: 50, type: !28)
!728 = !DILocation(line: 0, scope: !725)
!729 = !DILocation(line: 52, column: 13, scope: !725)
!730 = !DILocation(line: 53, column: 1, scope: !725)
!731 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !165, file: !165, line: 87, type: !732, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !734)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !44}
!734 = !{!735}
!735 = !DILocalVariable(name: "ignore", arg: 1, scope: !731, file: !165, line: 87, type: !44)
!736 = !DILocation(line: 0, scope: !731)
!737 = !DILocation(line: 89, column: 16, scope: !731)
!738 = !{!739, !739, i64 0}
!739 = !{!"_Bool", !457, i64 0}
!740 = !DILocation(line: 90, column: 1, scope: !731)
!741 = distinct !DISubprogram(name: "close_stdout", scope: !165, file: !165, line: 116, type: !208, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !164, retainedNodes: !742)
!742 = !{!743}
!743 = !DILocalVariable(name: "write_error", scope: !744, file: !165, line: 121, type: !28)
!744 = distinct !DILexicalBlock(scope: !745, file: !165, line: 120, column: 5)
!745 = distinct !DILexicalBlock(scope: !741, file: !165, line: 118, column: 7)
!746 = !DILocation(line: 118, column: 21, scope: !745)
!747 = !DILocation(line: 118, column: 7, scope: !745)
!748 = !DILocation(line: 118, column: 29, scope: !745)
!749 = !DILocation(line: 119, column: 7, scope: !745)
!750 = !DILocation(line: 119, column: 12, scope: !745)
!751 = !{i8 0, i8 2}
!752 = !DILocation(line: 119, column: 25, scope: !745)
!753 = !DILocation(line: 119, column: 28, scope: !745)
!754 = !DILocation(line: 119, column: 34, scope: !745)
!755 = !DILocation(line: 118, column: 7, scope: !741)
!756 = !DILocation(line: 121, column: 33, scope: !744)
!757 = !DILocation(line: 0, scope: !744)
!758 = !DILocation(line: 122, column: 11, scope: !759)
!759 = distinct !DILexicalBlock(scope: !744, file: !165, line: 122, column: 11)
!760 = !DILocation(line: 0, scope: !759)
!761 = !DILocation(line: 122, column: 11, scope: !744)
!762 = !DILocation(line: 123, column: 9, scope: !759)
!763 = !DILocation(line: 126, column: 9, scope: !759)
!764 = !DILocation(line: 128, column: 14, scope: !744)
!765 = !DILocation(line: 128, column: 7, scope: !744)
!766 = !DILocation(line: 133, column: 42, scope: !767)
!767 = distinct !DILexicalBlock(scope: !741, file: !165, line: 133, column: 7)
!768 = !DILocation(line: 133, column: 28, scope: !767)
!769 = !DILocation(line: 133, column: 50, scope: !767)
!770 = !DILocation(line: 133, column: 7, scope: !741)
!771 = !DILocation(line: 134, column: 12, scope: !767)
!772 = !DILocation(line: 134, column: 5, scope: !767)
!773 = !DILocation(line: 135, column: 1, scope: !741)
!774 = distinct !DISubprogram(name: "dir_len", scope: !370, file: !370, line: 32, type: !775, scopeLine: 33, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !777)
!775 = !DISubroutineType(types: !776)
!776 = !{!25, !28}
!777 = !{!778, !779, !780}
!778 = !DILocalVariable(name: "file", arg: 1, scope: !774, file: !370, line: 32, type: !28)
!779 = !DILocalVariable(name: "prefix_length", scope: !774, file: !370, line: 34, type: !25)
!780 = !DILocalVariable(name: "length", scope: !774, file: !370, line: 47, type: !25)
!781 = !DILocation(line: 0, scope: !774)
!782 = !DILocation(line: 40, column: 24, scope: !774)
!783 = !DILocation(line: 48, column: 17, scope: !784)
!784 = distinct !DILexicalBlock(scope: !774, file: !370, line: 48, column: 3)
!785 = !DILocation(line: 48, column: 39, scope: !784)
!786 = !DILocation(line: 48, column: 8, scope: !784)
!787 = !DILocation(line: 0, scope: !784)
!788 = !DILocation(line: 49, column: 22, scope: !789)
!789 = distinct !DILexicalBlock(scope: !784, file: !370, line: 48, column: 3)
!790 = !DILocation(line: 48, column: 3, scope: !784)
!791 = !DILocation(line: 51, column: 11, scope: !792)
!792 = distinct !DILexicalBlock(scope: !789, file: !370, line: 51, column: 9)
!793 = !DILocation(line: 51, column: 9, scope: !789)
!794 = distinct !{!794, !790, !795, !509}
!795 = !DILocation(line: 52, column: 7, scope: !784)
!796 = !DILocation(line: 53, column: 3, scope: !774)
!797 = distinct !DISubprogram(name: "mdir_name", scope: !370, file: !370, line: 72, type: !655, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DILocalVariable(name: "file", arg: 1, scope: !797, file: !370, line: 72, type: !28)
!800 = !DILocalVariable(name: "length", scope: !797, file: !370, line: 74, type: !25)
!801 = !DILocalVariable(name: "append_dot", scope: !797, file: !370, line: 75, type: !44)
!802 = !DILocalVariable(name: "dir", scope: !797, file: !370, line: 79, type: !22)
!803 = !DILocation(line: 0, scope: !797)
!804 = !DILocation(line: 0, scope: !774, inlinedAt: !805)
!805 = distinct !DILocation(line: 74, column: 19, scope: !797)
!806 = !DILocation(line: 40, column: 24, scope: !774, inlinedAt: !805)
!807 = !DILocation(line: 48, column: 17, scope: !784, inlinedAt: !805)
!808 = !DILocation(line: 48, column: 39, scope: !784, inlinedAt: !805)
!809 = !DILocation(line: 48, column: 8, scope: !784, inlinedAt: !805)
!810 = !DILocation(line: 0, scope: !784, inlinedAt: !805)
!811 = !DILocation(line: 49, column: 22, scope: !789, inlinedAt: !805)
!812 = !DILocation(line: 48, column: 3, scope: !784, inlinedAt: !805)
!813 = !DILocation(line: 51, column: 11, scope: !792, inlinedAt: !805)
!814 = !DILocation(line: 51, column: 9, scope: !789, inlinedAt: !805)
!815 = distinct !{!815, !812, !816, !509}
!816 = !DILocation(line: 52, column: 7, scope: !784, inlinedAt: !805)
!817 = !DILocation(line: 75, column: 29, scope: !797)
!818 = !DILocation(line: 79, column: 32, scope: !797)
!819 = !DILocation(line: 79, column: 30, scope: !797)
!820 = !DILocation(line: 79, column: 43, scope: !797)
!821 = !DILocation(line: 79, column: 15, scope: !797)
!822 = !DILocation(line: 80, column: 8, scope: !823)
!823 = distinct !DILexicalBlock(scope: !797, file: !370, line: 80, column: 7)
!824 = !DILocation(line: 80, column: 7, scope: !797)
!825 = !DILocalVariable(name: "__dest", arg: 1, scope: !826, file: !827, line: 26, type: !830)
!826 = distinct !DISubprogram(name: "memcpy", scope: !827, file: !827, line: 26, type: !828, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !831)
!827 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!828 = !DISubroutineType(types: !829)
!829 = !{!24, !830, !660, !25}
!830 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !24)
!831 = !{!825, !832, !833}
!832 = !DILocalVariable(name: "__src", arg: 2, scope: !826, file: !827, line: 26, type: !660)
!833 = !DILocalVariable(name: "__len", arg: 3, scope: !826, file: !827, line: 26, type: !25)
!834 = !DILocation(line: 0, scope: !826, inlinedAt: !835)
!835 = distinct !DILocation(line: 82, column: 3, scope: !797)
!836 = !DILocation(line: 29, column: 10, scope: !826, inlinedAt: !835)
!837 = !DILocation(line: 83, column: 7, scope: !797)
!838 = !DILocation(line: 84, column: 19, scope: !839)
!839 = distinct !DILexicalBlock(scope: !797, file: !370, line: 83, column: 7)
!840 = !DILocation(line: 84, column: 5, scope: !839)
!841 = !DILocation(line: 85, column: 3, scope: !797)
!842 = !DILocation(line: 85, column: 15, scope: !797)
!843 = !DILocation(line: 86, column: 3, scope: !797)
!844 = !DILocation(line: 87, column: 1, scope: !797)
!845 = distinct !DISubprogram(name: "verror", scope: !172, file: !172, line: 251, type: !846, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !848)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !30, !30, !28, !180}
!848 = !{!849, !850, !851, !852}
!849 = !DILocalVariable(name: "status", arg: 1, scope: !845, file: !172, line: 251, type: !30)
!850 = !DILocalVariable(name: "errnum", arg: 2, scope: !845, file: !172, line: 251, type: !30)
!851 = !DILocalVariable(name: "message", arg: 3, scope: !845, file: !172, line: 251, type: !28)
!852 = !DILocalVariable(name: "args", arg: 4, scope: !845, file: !172, line: 251, type: !180)
!853 = !DILocation(line: 0, scope: !845)
!854 = !DILocation(line: 251, column: 1, scope: !845)
!855 = !DILocation(line: 261, column: 3, scope: !845)
!856 = !DILocation(line: 265, column: 7, scope: !857)
!857 = distinct !DILexicalBlock(scope: !845, file: !172, line: 265, column: 7)
!858 = !DILocation(line: 265, column: 7, scope: !845)
!859 = !DILocation(line: 266, column: 5, scope: !857)
!860 = !DILocation(line: 272, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !857, file: !172, line: 268, column: 5)
!862 = !DILocation(line: 276, column: 3, scope: !845)
!863 = !{i64 0, i64 8, !455, i64 8, i64 8, !455, i64 16, i64 8, !455, i64 24, i64 4, !543, i64 28, i64 4, !543}
!864 = !DILocation(line: 282, column: 1, scope: !845)
!865 = distinct !DISubprogram(name: "flush_stdout", scope: !172, file: !172, line: 163, type: !208, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !866)
!866 = !{!867}
!867 = !DILocalVariable(name: "stdout_fd", scope: !865, file: !172, line: 166, type: !30)
!868 = !DILocation(line: 0, scope: !865)
!869 = !DILocalVariable(name: "fd", arg: 1, scope: !870, file: !172, line: 145, type: !30)
!870 = distinct !DISubprogram(name: "is_open", scope: !172, file: !172, line: 145, type: !696, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !871)
!871 = !{!869}
!872 = !DILocation(line: 0, scope: !870, inlinedAt: !873)
!873 = distinct !DILocation(line: 182, column: 25, scope: !874)
!874 = distinct !DILexicalBlock(scope: !865, file: !172, line: 182, column: 7)
!875 = !DILocation(line: 157, column: 15, scope: !870, inlinedAt: !873)
!876 = !DILocation(line: 182, column: 25, scope: !874)
!877 = !DILocation(line: 182, column: 7, scope: !865)
!878 = !DILocation(line: 184, column: 5, scope: !874)
!879 = !DILocation(line: 185, column: 1, scope: !865)
!880 = distinct !DISubprogram(name: "error_tail", scope: !172, file: !172, line: 219, type: !846, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DILocalVariable(name: "status", arg: 1, scope: !880, file: !172, line: 219, type: !30)
!883 = !DILocalVariable(name: "errnum", arg: 2, scope: !880, file: !172, line: 219, type: !30)
!884 = !DILocalVariable(name: "message", arg: 3, scope: !880, file: !172, line: 219, type: !28)
!885 = !DILocalVariable(name: "args", arg: 4, scope: !880, file: !172, line: 219, type: !180)
!886 = !DILocation(line: 0, scope: !880)
!887 = !DILocation(line: 219, column: 1, scope: !880)
!888 = !DILocation(line: 229, column: 13, scope: !880)
!889 = !DILocation(line: 229, column: 3, scope: !880)
!890 = !DILocalVariable(name: "__stream", arg: 1, scope: !891, file: !892, line: 132, type: !895)
!891 = distinct !DISubprogram(name: "vfprintf", scope: !892, file: !892, line: 132, type: !893, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !930)
!892 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!893 = !DISubroutineType(types: !894)
!894 = !{!30, !895, !539, !182}
!895 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !61, line: 7, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !63, line: 49, size: 1728, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !898, file: !63, line: 51, baseType: !30, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !898, file: !63, line: 54, baseType: !22, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !898, file: !63, line: 55, baseType: !22, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !898, file: !63, line: 56, baseType: !22, size: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !898, file: !63, line: 57, baseType: !22, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !898, file: !63, line: 58, baseType: !22, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !898, file: !63, line: 59, baseType: !22, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !898, file: !63, line: 60, baseType: !22, size: 64, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !898, file: !63, line: 61, baseType: !22, size: 64, offset: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !898, file: !63, line: 64, baseType: !22, size: 64, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !898, file: !63, line: 65, baseType: !22, size: 64, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !898, file: !63, line: 66, baseType: !22, size: 64, offset: 704)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !898, file: !63, line: 68, baseType: !78, size: 64, offset: 768)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !898, file: !63, line: 70, baseType: !914, size: 64, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !898, file: !63, line: 72, baseType: !30, size: 32, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !898, file: !63, line: 73, baseType: !30, size: 32, offset: 928)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !898, file: !63, line: 74, baseType: !85, size: 64, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !898, file: !63, line: 77, baseType: !31, size: 16, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !898, file: !63, line: 78, baseType: !89, size: 8, offset: 1040)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !898, file: !63, line: 79, baseType: !91, size: 8, offset: 1048)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !898, file: !63, line: 81, baseType: !95, size: 64, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !898, file: !63, line: 89, baseType: !98, size: 64, offset: 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !898, file: !63, line: 91, baseType: !100, size: 64, offset: 1216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !898, file: !63, line: 92, baseType: !103, size: 64, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !898, file: !63, line: 93, baseType: !914, size: 64, offset: 1344)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !898, file: !63, line: 94, baseType: !24, size: 64, offset: 1408)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !898, file: !63, line: 95, baseType: !25, size: 64, offset: 1472)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !898, file: !63, line: 96, baseType: !30, size: 32, offset: 1536)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !898, file: !63, line: 98, baseType: !110, size: 160, offset: 1568)
!930 = !{!890, !931, !932}
!931 = !DILocalVariable(name: "__fmt", arg: 2, scope: !891, file: !892, line: 133, type: !539)
!932 = !DILocalVariable(name: "__ap", arg: 3, scope: !891, file: !892, line: 133, type: !182)
!933 = !DILocation(line: 0, scope: !891, inlinedAt: !934)
!934 = distinct !DILocation(line: 229, column: 3, scope: !880)
!935 = !DILocation(line: 135, column: 10, scope: !891, inlinedAt: !934)
!936 = !{!937, !939}
!937 = distinct !{!937, !938, !"vfprintf.inline: argument 0"}
!938 = distinct !{!938, !"vfprintf.inline"}
!939 = distinct !{!939, !938, !"vfprintf.inline: argument 1"}
!940 = !DILocation(line: 232, column: 3, scope: !880)
!941 = !DILocation(line: 233, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !880, file: !172, line: 233, column: 7)
!943 = !DILocation(line: 233, column: 7, scope: !880)
!944 = !DILocalVariable(name: "errnum", arg: 1, scope: !945, file: !172, line: 188, type: !30)
!945 = distinct !DISubprogram(name: "print_errno_message", scope: !172, file: !172, line: 188, type: !445, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !946)
!946 = !{!944, !947, !948}
!947 = !DILocalVariable(name: "s", scope: !945, file: !172, line: 190, type: !28)
!948 = !DILocalVariable(name: "errbuf", scope: !945, file: !172, line: 193, type: !949)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 1024)
!952 = !DILocation(line: 0, scope: !945, inlinedAt: !953)
!953 = distinct !DILocation(line: 234, column: 5, scope: !942)
!954 = !DILocation(line: 193, column: 3, scope: !945, inlinedAt: !953)
!955 = !DILocation(line: 193, column: 8, scope: !945, inlinedAt: !953)
!956 = !DILocation(line: 195, column: 7, scope: !945, inlinedAt: !953)
!957 = !DILocation(line: 207, column: 9, scope: !958, inlinedAt: !953)
!958 = distinct !DILexicalBlock(scope: !945, file: !172, line: 207, column: 7)
!959 = !DILocation(line: 207, column: 7, scope: !945, inlinedAt: !953)
!960 = !DILocation(line: 208, column: 9, scope: !958, inlinedAt: !953)
!961 = !DILocation(line: 208, column: 5, scope: !958, inlinedAt: !953)
!962 = !DILocation(line: 214, column: 3, scope: !945, inlinedAt: !953)
!963 = !DILocation(line: 216, column: 1, scope: !945, inlinedAt: !953)
!964 = !DILocation(line: 234, column: 5, scope: !942)
!965 = !DILocation(line: 238, column: 3, scope: !880)
!966 = !DILocalVariable(name: "__c", arg: 1, scope: !967, file: !695, line: 101, type: !30)
!967 = distinct !DISubprogram(name: "putc_unlocked", scope: !695, file: !695, line: 101, type: !968, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!30, !30, !896}
!970 = !{!966, !971}
!971 = !DILocalVariable(name: "__stream", arg: 2, scope: !967, file: !695, line: 101, type: !896)
!972 = !DILocation(line: 0, scope: !967, inlinedAt: !973)
!973 = distinct !DILocation(line: 238, column: 3, scope: !880)
!974 = !DILocation(line: 103, column: 10, scope: !967, inlinedAt: !973)
!975 = !DILocation(line: 240, column: 3, scope: !880)
!976 = !DILocation(line: 241, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !880, file: !172, line: 241, column: 7)
!978 = !DILocation(line: 241, column: 7, scope: !880)
!979 = !DILocation(line: 242, column: 5, scope: !977)
!980 = !DILocation(line: 243, column: 1, scope: !880)
!981 = !DISubprogram(name: "strerror_r", scope: !982, file: !982, line: 444, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!982 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!983 = !DISubroutineType(types: !984)
!984 = !{!22, !30, !22, !25}
!985 = !DISubprogram(name: "fflush_unlocked", scope: !181, file: !181, line: 239, type: !986, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!986 = !DISubroutineType(types: !987)
!987 = !{!30, !896}
!988 = !DISubprogram(name: "fcntl", scope: !989, file: !989, line: 149, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!989 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!990 = !DISubroutineType(types: !991)
!991 = !{!30, !30, !30, null}
!992 = distinct !DISubprogram(name: "error", scope: !172, file: !172, line: 285, type: !993, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !30, !30, !28, null}
!995 = !{!996, !997, !998, !999}
!996 = !DILocalVariable(name: "status", arg: 1, scope: !992, file: !172, line: 285, type: !30)
!997 = !DILocalVariable(name: "errnum", arg: 2, scope: !992, file: !172, line: 285, type: !30)
!998 = !DILocalVariable(name: "message", arg: 3, scope: !992, file: !172, line: 285, type: !28)
!999 = !DILocalVariable(name: "ap", scope: !992, file: !172, line: 287, type: !180)
!1000 = !DILocation(line: 0, scope: !992)
!1001 = !DILocation(line: 287, column: 3, scope: !992)
!1002 = !DILocation(line: 287, column: 11, scope: !992)
!1003 = !DILocation(line: 288, column: 3, scope: !992)
!1004 = !DILocation(line: 289, column: 3, scope: !992)
!1005 = !DILocation(line: 290, column: 3, scope: !992)
!1006 = !DILocation(line: 291, column: 1, scope: !992)
!1007 = !DILocation(line: 0, scope: !177)
!1008 = !DILocation(line: 298, column: 1, scope: !177)
!1009 = !DILocation(line: 302, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !177, file: !172, line: 302, column: 7)
!1011 = !DILocation(line: 302, column: 7, scope: !177)
!1012 = !DILocation(line: 307, column: 11, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !172, line: 307, column: 11)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !172, line: 303, column: 5)
!1015 = !DILocation(line: 307, column: 27, scope: !1013)
!1016 = !DILocation(line: 308, column: 11, scope: !1013)
!1017 = !DILocation(line: 308, column: 28, scope: !1013)
!1018 = !DILocation(line: 308, column: 25, scope: !1013)
!1019 = !DILocation(line: 309, column: 15, scope: !1013)
!1020 = !DILocation(line: 309, column: 33, scope: !1013)
!1021 = !DILocation(line: 310, column: 19, scope: !1013)
!1022 = !DILocation(line: 311, column: 22, scope: !1013)
!1023 = !DILocation(line: 311, column: 56, scope: !1013)
!1024 = !DILocation(line: 307, column: 11, scope: !1014)
!1025 = !DILocation(line: 316, column: 21, scope: !1014)
!1026 = !DILocation(line: 317, column: 23, scope: !1014)
!1027 = !DILocation(line: 318, column: 5, scope: !1014)
!1028 = !DILocation(line: 327, column: 3, scope: !177)
!1029 = !DILocation(line: 331, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !177, file: !172, line: 331, column: 7)
!1031 = !DILocation(line: 331, column: 7, scope: !177)
!1032 = !DILocation(line: 332, column: 5, scope: !1030)
!1033 = !DILocation(line: 338, column: 7, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !172, line: 334, column: 5)
!1035 = !DILocation(line: 346, column: 3, scope: !177)
!1036 = !DILocation(line: 350, column: 3, scope: !177)
!1037 = !DILocation(line: 356, column: 1, scope: !177)
!1038 = distinct !DISubprogram(name: "error_at_line", scope: !172, file: !172, line: 359, type: !1039, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !171, retainedNodes: !1041)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !30, !30, !28, !7, !28, null}
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047}
!1042 = !DILocalVariable(name: "status", arg: 1, scope: !1038, file: !172, line: 359, type: !30)
!1043 = !DILocalVariable(name: "errnum", arg: 2, scope: !1038, file: !172, line: 359, type: !30)
!1044 = !DILocalVariable(name: "file_name", arg: 3, scope: !1038, file: !172, line: 359, type: !28)
!1045 = !DILocalVariable(name: "line_number", arg: 4, scope: !1038, file: !172, line: 360, type: !7)
!1046 = !DILocalVariable(name: "message", arg: 5, scope: !1038, file: !172, line: 360, type: !28)
!1047 = !DILocalVariable(name: "ap", scope: !1038, file: !172, line: 362, type: !180)
!1048 = !DILocation(line: 0, scope: !1038)
!1049 = !DILocation(line: 362, column: 3, scope: !1038)
!1050 = !DILocation(line: 362, column: 11, scope: !1038)
!1051 = !DILocation(line: 363, column: 3, scope: !1038)
!1052 = !DILocation(line: 364, column: 3, scope: !1038)
!1053 = !DILocation(line: 366, column: 3, scope: !1038)
!1054 = !DILocation(line: 367, column: 1, scope: !1038)
!1055 = distinct !DISubprogram(name: "getprogname", scope: !372, file: !372, line: 54, type: !1056, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !371, retainedNodes: !535)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!28}
!1058 = !DILocation(line: 58, column: 10, scope: !1055)
!1059 = !DILocation(line: 58, column: 3, scope: !1055)
!1060 = distinct !DISubprogram(name: "set_program_name", scope: !213, file: !213, line: 37, type: !468, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DILocalVariable(name: "argv0", arg: 1, scope: !1060, file: !213, line: 37, type: !28)
!1063 = !DILocalVariable(name: "slash", scope: !1060, file: !213, line: 44, type: !28)
!1064 = !DILocalVariable(name: "base", scope: !1060, file: !213, line: 45, type: !28)
!1065 = !DILocation(line: 0, scope: !1060)
!1066 = !DILocation(line: 44, column: 23, scope: !1060)
!1067 = !DILocation(line: 45, column: 22, scope: !1060)
!1068 = !DILocation(line: 46, column: 17, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1060, file: !213, line: 46, column: 7)
!1070 = !DILocation(line: 46, column: 9, scope: !1069)
!1071 = !DILocation(line: 46, column: 25, scope: !1069)
!1072 = !DILocation(line: 46, column: 40, scope: !1069)
!1073 = !DILocalVariable(name: "__s1", arg: 1, scope: !1074, file: !493, line: 974, type: !661)
!1074 = distinct !DISubprogram(name: "memeq", scope: !493, file: !493, line: 974, type: !1075, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!44, !661, !661, !25}
!1077 = !{!1073, !1078, !1079}
!1078 = !DILocalVariable(name: "__s2", arg: 2, scope: !1074, file: !493, line: 974, type: !661)
!1079 = !DILocalVariable(name: "__n", arg: 3, scope: !1074, file: !493, line: 974, type: !25)
!1080 = !DILocation(line: 0, scope: !1074, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 46, column: 28, scope: !1069)
!1082 = !DILocation(line: 976, column: 11, scope: !1074, inlinedAt: !1081)
!1083 = !DILocation(line: 976, column: 10, scope: !1074, inlinedAt: !1081)
!1084 = !DILocation(line: 46, column: 7, scope: !1060)
!1085 = !DILocation(line: 49, column: 11, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !213, line: 49, column: 11)
!1087 = distinct !DILexicalBlock(scope: !1069, file: !213, line: 47, column: 5)
!1088 = !DILocation(line: 49, column: 36, scope: !1086)
!1089 = !DILocation(line: 49, column: 11, scope: !1087)
!1090 = !DILocation(line: 65, column: 16, scope: !1060)
!1091 = !DILocation(line: 71, column: 27, scope: !1060)
!1092 = !DILocation(line: 74, column: 33, scope: !1060)
!1093 = !DILocation(line: 76, column: 1, scope: !1060)
!1094 = !DILocation(line: 0, scope: !218)
!1095 = !DILocation(line: 40, column: 29, scope: !218)
!1096 = !DILocation(line: 41, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !218, file: !219, line: 41, column: 7)
!1098 = !DILocation(line: 41, column: 7, scope: !218)
!1099 = !DILocation(line: 47, column: 3, scope: !218)
!1100 = !DILocation(line: 48, column: 3, scope: !218)
!1101 = !DILocation(line: 48, column: 13, scope: !218)
!1102 = !DILocalVariable(name: "ps", arg: 1, scope: !1103, file: !1104, line: 1135, type: !1107)
!1103 = distinct !DISubprogram(name: "mbszero", scope: !1104, file: !1104, line: 1135, type: !1105, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !222, retainedNodes: !1108)
!1104 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!1108 = !{!1102}
!1109 = !DILocation(line: 0, scope: !1103, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 48, column: 18, scope: !218)
!1111 = !DILocalVariable(name: "__dest", arg: 1, scope: !1112, file: !827, line: 57, type: !24)
!1112 = distinct !DISubprogram(name: "memset", scope: !827, file: !827, line: 57, type: !1113, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !222, retainedNodes: !1115)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!24, !24, !30, !25}
!1115 = !{!1111, !1116, !1117}
!1116 = !DILocalVariable(name: "__ch", arg: 2, scope: !1112, file: !827, line: 57, type: !30)
!1117 = !DILocalVariable(name: "__len", arg: 3, scope: !1112, file: !827, line: 57, type: !25)
!1118 = !DILocation(line: 0, scope: !1112, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 1137, column: 3, scope: !1103, inlinedAt: !1110)
!1120 = !DILocation(line: 59, column: 10, scope: !1112, inlinedAt: !1119)
!1121 = !DILocation(line: 49, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !218, file: !219, line: 49, column: 7)
!1123 = !DILocation(line: 49, column: 39, scope: !1122)
!1124 = !DILocation(line: 49, column: 44, scope: !1122)
!1125 = !DILocation(line: 54, column: 1, scope: !218)
!1126 = !DISubprogram(name: "mbrtoc32", scope: !230, file: !230, line: 57, type: !1127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !535)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!25, !1129, !539, !25, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1107)
!1132 = distinct !DISubprogram(name: "clone_quoting_options", scope: !253, file: !253, line: 113, type: !1133, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1136)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!1135, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!1136 = !{!1137, !1138, !1139}
!1137 = !DILocalVariable(name: "o", arg: 1, scope: !1132, file: !253, line: 113, type: !1135)
!1138 = !DILocalVariable(name: "saved_errno", scope: !1132, file: !253, line: 115, type: !30)
!1139 = !DILocalVariable(name: "p", scope: !1132, file: !253, line: 116, type: !1135)
!1140 = !DILocation(line: 0, scope: !1132)
!1141 = !DILocation(line: 115, column: 21, scope: !1132)
!1142 = !DILocation(line: 116, column: 40, scope: !1132)
!1143 = !DILocation(line: 116, column: 31, scope: !1132)
!1144 = !DILocation(line: 118, column: 9, scope: !1132)
!1145 = !DILocation(line: 119, column: 3, scope: !1132)
!1146 = distinct !DISubprogram(name: "get_quoting_style", scope: !253, file: !253, line: 124, type: !1147, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1151)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!255, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!1151 = !{!1152}
!1152 = !DILocalVariable(name: "o", arg: 1, scope: !1146, file: !253, line: 124, type: !1149)
!1153 = !DILocation(line: 0, scope: !1146)
!1154 = !DILocation(line: 126, column: 11, scope: !1146)
!1155 = !DILocation(line: 126, column: 46, scope: !1146)
!1156 = !{!1157, !457, i64 0}
!1157 = !{!"quoting_options", !457, i64 0, !544, i64 4, !457, i64 8, !456, i64 40, !456, i64 48}
!1158 = !DILocation(line: 126, column: 3, scope: !1146)
!1159 = distinct !DISubprogram(name: "set_quoting_style", scope: !253, file: !253, line: 132, type: !1160, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1162)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1135, !255}
!1162 = !{!1163, !1164}
!1163 = !DILocalVariable(name: "o", arg: 1, scope: !1159, file: !253, line: 132, type: !1135)
!1164 = !DILocalVariable(name: "s", arg: 2, scope: !1159, file: !253, line: 132, type: !255)
!1165 = !DILocation(line: 0, scope: !1159)
!1166 = !DILocation(line: 134, column: 4, scope: !1159)
!1167 = !DILocation(line: 134, column: 39, scope: !1159)
!1168 = !DILocation(line: 134, column: 45, scope: !1159)
!1169 = !DILocation(line: 135, column: 1, scope: !1159)
!1170 = distinct !DISubprogram(name: "set_char_quoting", scope: !253, file: !253, line: 143, type: !1171, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1173)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!30, !1135, !23, !30}
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1180, !1181}
!1174 = !DILocalVariable(name: "o", arg: 1, scope: !1170, file: !253, line: 143, type: !1135)
!1175 = !DILocalVariable(name: "c", arg: 2, scope: !1170, file: !253, line: 143, type: !23)
!1176 = !DILocalVariable(name: "i", arg: 3, scope: !1170, file: !253, line: 143, type: !30)
!1177 = !DILocalVariable(name: "uc", scope: !1170, file: !253, line: 145, type: !32)
!1178 = !DILocalVariable(name: "p", scope: !1170, file: !253, line: 146, type: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1180 = !DILocalVariable(name: "shift", scope: !1170, file: !253, line: 148, type: !30)
!1181 = !DILocalVariable(name: "r", scope: !1170, file: !253, line: 149, type: !7)
!1182 = !DILocation(line: 0, scope: !1170)
!1183 = !DILocation(line: 147, column: 6, scope: !1170)
!1184 = !DILocation(line: 147, column: 62, scope: !1170)
!1185 = !DILocation(line: 147, column: 57, scope: !1170)
!1186 = !DILocation(line: 148, column: 15, scope: !1170)
!1187 = !DILocation(line: 149, column: 21, scope: !1170)
!1188 = !DILocation(line: 149, column: 24, scope: !1170)
!1189 = !DILocation(line: 149, column: 34, scope: !1170)
!1190 = !DILocation(line: 150, column: 13, scope: !1170)
!1191 = !DILocation(line: 150, column: 19, scope: !1170)
!1192 = !DILocation(line: 150, column: 24, scope: !1170)
!1193 = !DILocation(line: 150, column: 6, scope: !1170)
!1194 = !DILocation(line: 151, column: 3, scope: !1170)
!1195 = distinct !DISubprogram(name: "set_quoting_flags", scope: !253, file: !253, line: 159, type: !1196, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1198)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!30, !1135, !30}
!1198 = !{!1199, !1200, !1201}
!1199 = !DILocalVariable(name: "o", arg: 1, scope: !1195, file: !253, line: 159, type: !1135)
!1200 = !DILocalVariable(name: "i", arg: 2, scope: !1195, file: !253, line: 159, type: !30)
!1201 = !DILocalVariable(name: "r", scope: !1195, file: !253, line: 163, type: !30)
!1202 = !DILocation(line: 0, scope: !1195)
