; ModuleID = 'src/du.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.exclude = type { %struct.exclude_segment*, %struct.pattern_buffer* }
%struct.exclude_segment = type { %struct.exclude_segment*, i32, i32, %union.anon.29 }
%union.anon.29 = type { %struct.exclude_pattern }
%struct.exclude_pattern = type { %struct.patopts*, i64, i64 }
%struct.patopts = type { i32, %union.anon.0 }
%union.anon.0 = type { %struct.re_pattern_buffer }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.pattern_buffer = type { %struct.pattern_buffer*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.di_set = type { %struct.hash_table*, %struct.ino_map*, %struct.di_ent* }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.ino_map = type { %struct.hash_table*, i64, %struct.timespec* }
%struct.timespec = type { i64, i64 }
%struct.di_ent = type { i64, %struct.hash_table* }
%struct.duinfo = type { i64, i64, %struct.timespec }
%struct.infomap = type { i8*, i8* }

!119 = !DILocalVariable(name: "tmp", scope: !120, file: !3, line: 861, type: !122)
!120 = distinct !DILexicalBlock(scope: !121, file: !3, line: 860, column: 11)
!121 = distinct !DILexicalBlock(scope: !117, file: !3, line: 815, column: 9)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !88, line: 101, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !90, line: 72, baseType: !94)
!124 = !DILocalVariable(name: "e", scope: !125, file: !3, line: 892, type: !5)
!125 = distinct !DILexicalBlock(scope: !121, file: !3, line: 891, column: 11)
!126 = !DILocalVariable(name: "e", scope: !127, file: !3, line: 911, type: !5)
!127 = distinct !DILexicalBlock(scope: !121, file: !3, line: 910, column: 11)
!128 = !DILocalVariable(name: "p", scope: !129, file: !3, line: 1027, type: !79)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 1024, column: 13)
!130 = distinct !DILexicalBlock(scope: !131, file: !3, line: 1023, column: 20)
!131 = distinct !DILexicalBlock(scope: !132, file: !3, line: 1021, column: 15)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 1017, column: 9)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 1016, column: 11)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 1015, column: 5)
!135 = distinct !DILexicalBlock(scope: !98, file: !3, line: 1014, column: 7)
!136 = !DILocalVariable(name: "ai", scope: !98, file: !3, line: 1065, type: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !47, line: 32, flags: DIFlagFwdDecl)
!139 = !DILocalVariable(name: "files", scope: !140, file: !3, line: 1090, type: !101)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 1089, column: 5)
!141 = distinct !DILexicalBlock(scope: !98, file: !3, line: 1066, column: 7)
!142 = !DILocalVariable(name: "skip_file", scope: !143, file: !3, line: 1117, type: !110)
!143 = distinct !DILexicalBlock(scope: !98, file: !3, line: 1116, column: 5)
!144 = !DILocalVariable(name: "ai_err", scope: !143, file: !3, line: 1118, type: !46)
!145 = !DILocalVariable(name: "file_name", scope: !143, file: !3, line: 1119, type: !76)
!146 = !DILocalVariable(name: "file_number", scope: !147, file: !3, line: 1164, type: !151)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 1160, column: 13)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 1157, column: 15)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 1152, column: 9)
!150 = distinct !DILexicalBlock(scope: !143, file: !3, line: 1151, column: 11)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !152, line: 130, baseType: !153)
!152 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !84, line: 35, baseType: !94)
!154 = !DILabel(scope: !98, name: "argv_iter_done", file: !3, line: 1179)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 56, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 7)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "prefix_len", scope: !98, file: !3, line: 1035, type: !160, isLocal: true, isDefinition: true)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "temp_argv", scope: !98, file: !3, line: 1113, type: !106, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "di_files", scope: !2, file: !3, line: 58, type: !165, isLocal: true, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !167, line: 35, flags: DIFlagFwdDecl)
!167 = !DIFile(filename: "./lib/di-set.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6799d6331104f29afec5973dd8498fc3")
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "di_mnt", scope: !2, file: !3, line: 61, type: !165, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "hash_all", scope: !2, file: !3, line: 132, type: !110, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !2, file: !3, line: 153, type: !81, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 179, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !177, line: 1039, baseType: !178)
!177 = !DIFile(filename: "./lib/time.h", directory: "/src")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !177, line: 1039, flags: DIFlagFwdDecl)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "output_block_size", scope: !2, file: !3, line: 182, type: !87, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "tot_dui", scope: !2, file: !3, line: 188, type: !184, isLocal: true, isDefinition: true)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !3, line: 68, size: 256, elements: !185)
!185 = !{!186, !187, !188}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !3, line: 71, baseType: !87, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !184, file: !3, line: 74, baseType: !87, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !184, file: !3, line: 78, baseType: !189, size: 128, offset: 128)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !190, line: 11, size: 128, elements: !191)
!190 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !189, file: !190, line: 16, baseType: !93, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !189, file: !190, line: 21, baseType: !194, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !90, line: 197, baseType: !94)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !197, file: !198, line: 575, type: !81, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "oputs_", scope: !198, file: !198, line: 573, type: !199, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !201)
!198 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !79, !79}
!201 = !{!202, !203, !204, !207, !208, !209, !210, !214, !215, !216, !217, !219, !273, !274, !275, !277, !278}
!202 = !DILocalVariable(name: "program", arg: 1, scope: !197, file: !198, line: 573, type: !79)
!203 = !DILocalVariable(name: "option", arg: 2, scope: !197, file: !198, line: 573, type: !79)
!204 = !DILocalVariable(name: "term", scope: !205, file: !198, line: 585, type: !79)
!205 = distinct !DILexicalBlock(scope: !206, file: !198, line: 582, column: 5)
!206 = distinct !DILexicalBlock(scope: !197, file: !198, line: 581, column: 7)
!207 = !DILocalVariable(name: "double_space", scope: !197, file: !198, line: 594, type: !110)
!208 = !DILocalVariable(name: "first_word", scope: !197, file: !198, line: 595, type: !79)
!209 = !DILocalVariable(name: "option_text", scope: !197, file: !198, line: 596, type: !79)
!210 = !DILocalVariable(name: "s", scope: !211, file: !198, line: 608, type: !79)
!211 = distinct !DILexicalBlock(scope: !212, file: !198, line: 605, column: 5)
!212 = distinct !DILexicalBlock(scope: !213, file: !198, line: 604, column: 12)
!213 = distinct !DILexicalBlock(scope: !197, file: !198, line: 597, column: 7)
!214 = !DILocalVariable(name: "spaces", scope: !211, file: !198, line: 609, type: !83)
!215 = !DILocalVariable(name: "anchor_len", scope: !197, file: !198, line: 620, type: !83)
!216 = !DILocalVariable(name: "desc_text", scope: !197, file: !198, line: 625, type: !79)
!217 = !DILocalVariable(name: "__ptr", scope: !218, file: !198, line: 644, type: !79)
!218 = distinct !DILexicalBlock(scope: !197, file: !198, line: 644, column: 3)
!219 = !DILocalVariable(name: "__stream", scope: !218, file: !198, line: 644, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !222, line: 7, baseType: !223)
!222 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !224, line: 49, size: 1728, elements: !225)
!224 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !241, !243, !244, !245, !247, !248, !250, !254, !257, !259, !262, !265, !266, !267, !268, !269}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !223, file: !224, line: 51, baseType: !81, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !223, file: !224, line: 54, baseType: !76, size: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !223, file: !224, line: 55, baseType: !76, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !223, file: !224, line: 56, baseType: !76, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !223, file: !224, line: 57, baseType: !76, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !223, file: !224, line: 58, baseType: !76, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !223, file: !224, line: 59, baseType: !76, size: 64, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !223, file: !224, line: 60, baseType: !76, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !223, file: !224, line: 61, baseType: !76, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !223, file: !224, line: 64, baseType: !76, size: 64, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !223, file: !224, line: 65, baseType: !76, size: 64, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !223, file: !224, line: 66, baseType: !76, size: 64, offset: 704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !223, file: !224, line: 68, baseType: !239, size: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !224, line: 36, flags: DIFlagFwdDecl)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !223, file: !224, line: 70, baseType: !242, size: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !223, file: !224, line: 72, baseType: !81, size: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !223, file: !224, line: 73, baseType: !81, size: 32, offset: 928)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !223, file: !224, line: 74, baseType: !246, size: 64, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !94)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !223, file: !224, line: 77, baseType: !82, size: 16, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !223, file: !224, line: 78, baseType: !249, size: 8, offset: 1040)
!249 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !223, file: !224, line: 79, baseType: !251, size: 8, offset: 1048)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 1)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !223, file: !224, line: 81, baseType: !255, size: 64, offset: 1088)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !224, line: 43, baseType: null)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !223, file: !224, line: 89, baseType: !258, size: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !94)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !223, file: !224, line: 91, baseType: !260, size: 64, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !224, line: 37, flags: DIFlagFwdDecl)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !223, file: !224, line: 92, baseType: !263, size: 64, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !224, line: 38, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !223, file: !224, line: 93, baseType: !242, size: 64, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !223, file: !224, line: 94, baseType: !78, size: 64, offset: 1408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !223, file: !224, line: 95, baseType: !83, size: 64, offset: 1472)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !223, file: !224, line: 96, baseType: !81, size: 32, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !223, file: !224, line: 98, baseType: !270, size: 160, offset: 1568)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 160, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 20)
!273 = !DILocalVariable(name: "__cnt", scope: !218, file: !198, line: 644, type: !83)
!274 = !DILocalVariable(name: "url_program", scope: !197, file: !198, line: 648, type: !79)
!275 = !DILocalVariable(name: "__ptr", scope: !276, file: !198, line: 686, type: !79)
!276 = distinct !DILexicalBlock(scope: !197, file: !198, line: 686, column: 3)
!277 = !DILocalVariable(name: "__stream", scope: !276, file: !198, line: 686, type: !220)
!278 = !DILocalVariable(name: "__cnt", scope: !276, file: !198, line: 686, type: !83)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 209, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 6656, elements: !291)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !284, line: 50, size: 256, elements: !285)
!284 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!285 = !{!286, !287, !288, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !284, line: 52, baseType: !79, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !283, file: !284, line: 55, baseType: !81, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !284, line: 56, baseType: !289, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !283, file: !284, line: 57, baseType: !81, size: 32, offset: 192)
!291 = !{!292}
!292 = !DISubrange(count: 26)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !2, file: !3, line: 135, type: !110, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "opt_all", scope: !2, file: !3, line: 122, type: !110, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "apparent_size", scope: !2, file: !3, line: 126, type: !110, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !2, file: !3, line: 138, type: !110, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "max_depth", scope: !2, file: !3, line: 146, type: !151, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !2, file: !3, line: 129, type: !110, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !2, file: !3, line: 150, type: !122, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !2, file: !3, line: 141, type: !110, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !2, file: !3, line: 156, type: !110, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "opt_time", scope: !2, file: !3, line: 159, type: !110, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "time_types", scope: !2, file: !3, line: 246, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 160, elements: !317)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!317 = !{!318}
!318 = !DISubrange(count: 5)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 242, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 384, elements: !323)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!323 = !{!324}
!324 = !DISubrange(count: 6)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "time_type", scope: !2, file: !3, line: 170, type: !41, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "time_style", scope: !2, file: !3, line: 173, type: !79, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 176, type: !79, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "time_style_args", scope: !2, file: !3, line: 262, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 256, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 4)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "time_style_types", scope: !2, file: !3, line: 266, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 96, elements: !340)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!340 = !{!341}
!341 = !DISubrange(count: 3)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "prev_level", scope: !2, file: !3, line: 65, type: !151, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "n_alloc", scope: !346, file: !3, line: 543, type: !151, isLocal: true, isDefinition: true)
!346 = distinct !DISubprogram(name: "process_file", scope: !3, file: !3, line: 538, type: !347, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!347 = !DISubroutineType(types: !348)
!348 = !{!110, !349, !453}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !351, line: 233, baseType: !352)
!351 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 115, size: 1024, elements: !353)
!353 = !{!354, !413, !414, !416, !419, !420, !421, !422, !423, !424, !431, !432, !435, !442}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !352, file: !351, line: 116, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !351, line: 235, size: 1920, elements: !357)
!357 = !{!358, !359, !360, !361, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !409}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !356, file: !351, line: 236, baseType: !355, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !356, file: !351, line: 237, baseType: !355, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !356, file: !351, line: 238, baseType: !355, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !356, file: !351, line: 239, baseType: !362, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !364, line: 127, baseType: !365)
!364 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !364, line: 127, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !356, file: !351, line: 242, baseType: !94, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !356, file: !351, line: 243, baseType: !78, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !356, file: !351, line: 244, baseType: !76, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !356, file: !351, line: 245, baseType: !76, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !356, file: !351, line: 246, baseType: !81, size: 32, offset: 512)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !356, file: !351, line: 247, baseType: !81, size: 32, offset: 544)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !356, file: !351, line: 248, baseType: !83, size: 64, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !356, file: !351, line: 250, baseType: !349, size: 64, offset: 640)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !356, file: !351, line: 254, baseType: !153, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !356, file: !351, line: 256, baseType: !83, size: 64, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !356, file: !351, line: 272, baseType: !82, size: 16, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !356, file: !351, line: 276, baseType: !82, size: 16, offset: 848)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !356, file: !351, line: 282, baseType: !82, size: 16, offset: 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !356, file: !351, line: 284, baseType: !380, size: 1024, offset: 896)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 1024, elements: !252)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !382, line: 44, size: 1024, elements: !383)
!382 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!383 = !{!384, !386, !388, !390, !392, !394, !396, !397, !398, !399, !401, !402, !404, !405, !406, !407}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !381, file: !382, line: 46, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !90, line: 145, baseType: !85)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !381, file: !382, line: 47, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !90, line: 148, baseType: !85)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !381, file: !382, line: 48, baseType: !389, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !90, line: 150, baseType: !7)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !381, file: !382, line: 49, baseType: !391, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !90, line: 151, baseType: !7)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !381, file: !382, line: 50, baseType: !393, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !90, line: 146, baseType: !7)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !381, file: !382, line: 51, baseType: !395, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !90, line: 147, baseType: !7)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !381, file: !382, line: 52, baseType: !385, size: 64, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !381, file: !382, line: 53, baseType: !385, size: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !381, file: !382, line: 54, baseType: !246, size: 64, offset: 384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !381, file: !382, line: 55, baseType: !400, size: 32, offset: 448)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !90, line: 175, baseType: !81)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !381, file: !382, line: 56, baseType: !81, size: 32, offset: 480)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !381, file: !382, line: 57, baseType: !403, size: 64, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !90, line: 180, baseType: !94)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !381, file: !382, line: 65, baseType: !189, size: 128, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !381, file: !382, line: 66, baseType: !189, size: 128, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !381, file: !382, line: 67, baseType: !189, size: 128, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !381, file: !382, line: 79, baseType: !408, size: 64, offset: 960)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !107)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !356, file: !351, line: 285, baseType: !410, offset: 1920)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: -1)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !352, file: !351, line: 117, baseType: !355, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !352, file: !351, line: 118, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !352, file: !351, line: 119, baseType: !417, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !418, line: 59, baseType: !385)
!418 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !352, file: !351, line: 120, baseType: !76, size: 64, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !352, file: !351, line: 121, baseType: !81, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !352, file: !351, line: 122, baseType: !81, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !352, file: !351, line: 124, baseType: !83, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !352, file: !351, line: 125, baseType: !83, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !352, file: !351, line: 126, baseType: !425, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!81, !428, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !352, file: !351, line: 196, baseType: !81, size: 32, offset: 576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !352, file: !351, line: 205, baseType: !433, size: 64, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !351, line: 205, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !352, file: !351, line: 227, baseType: !436, size: 64, offset: 704)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !351, line: 207, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !436, file: !351, line: 220, baseType: !433, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !436, file: !351, line: 226, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !351, line: 226, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !352, file: !351, line: 232, baseType: !443, size: 256, offset: 768)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !444, line: 47, baseType: !445)
!444 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !444, line: 39, size: 256, elements: !446)
!446 = !{!447, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !445, file: !444, line: 41, baseType: !448, size: 128)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 128, elements: !334)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !445, file: !444, line: 42, baseType: !81, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !445, file: !444, line: 43, baseType: !7, size: 32, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !445, file: !444, line: 44, baseType: !7, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !445, file: !444, line: 45, baseType: !110, size: 8, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !351, line: 286, baseType: !356)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !465, !466, !470, !477, !482, !483, !490}
!456 = !DILocalVariable(name: "fts", arg: 1, scope: !346, file: !3, line: 538, type: !349)
!457 = !DILocalVariable(name: "ent", arg: 2, scope: !346, file: !3, line: 538, type: !453)
!458 = !DILocalVariable(name: "ok", scope: !346, file: !3, line: 540, type: !110)
!459 = !DILocalVariable(name: "dui", scope: !346, file: !3, line: 541, type: !184)
!460 = !DILocalVariable(name: "dui_to_print", scope: !346, file: !3, line: 542, type: !184)
!461 = !DILocalVariable(name: "file", scope: !346, file: !3, line: 554, type: !79)
!462 = !DILocalVariable(name: "sb", scope: !346, file: !3, line: 555, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!465 = !DILocalVariable(name: "info", scope: !346, file: !3, line: 556, type: !81)
!466 = !DILocalVariable(name: "excluded", scope: !467, file: !3, line: 566, type: !110)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 565, column: 5)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 564, column: 12)
!469 = distinct !DILexicalBlock(scope: !346, file: !3, line: 558, column: 7)
!470 = !DILocalVariable(name: "e", scope: !471, file: !3, line: 574, type: !475)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 572, column: 13)
!472 = distinct !DILexicalBlock(scope: !473, file: !3, line: 571, column: 15)
!473 = distinct !DILexicalBlock(scope: !474, file: !3, line: 568, column: 9)
!474 = distinct !DILexicalBlock(scope: !467, file: !3, line: 567, column: 11)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!477 = !DILocalVariable(name: "e", scope: !478, file: !3, line: 607, type: !475)
!478 = distinct !DILexicalBlock(scope: !479, file: !3, line: 605, column: 13)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 604, column: 15)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 600, column: 9)
!481 = distinct !DILexicalBlock(scope: !467, file: !3, line: 596, column: 11)
!482 = !DILocalVariable(name: "level", scope: !346, file: !3, line: 645, type: !151)
!483 = !DILocalVariable(name: "i", scope: !484, file: !3, line: 670, type: !151)
!484 = distinct !DILexicalBlock(scope: !485, file: !3, line: 670, column: 11)
!485 = distinct !DILexicalBlock(scope: !486, file: !3, line: 660, column: 9)
!486 = distinct !DILexicalBlock(scope: !487, file: !3, line: 659, column: 16)
!487 = distinct !DILexicalBlock(scope: !488, file: !3, line: 655, column: 11)
!488 = distinct !DILexicalBlock(scope: !489, file: !3, line: 654, column: 5)
!489 = distinct !DILexicalBlock(scope: !346, file: !3, line: 648, column: 7)
!490 = !DILocalVariable(name: "v", scope: !491, file: !3, line: 709, type: !87)
!491 = distinct !DILexicalBlock(scope: !492, file: !3, line: 707, column: 5)
!492 = distinct !DILexicalBlock(scope: !346, file: !3, line: 704, column: 7)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "dulvl", scope: !346, file: !3, line: 552, type: !495, isLocal: true, isDefinition: true)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !3, line: 112, size: 512, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !496, file: !3, line: 115, baseType: !184, size: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !496, file: !3, line: 118, baseType: !184, size: 256, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !502, line: 57, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "./lib/exclude.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9923a67d64662c8e3bb6144e4abd8844")
!503 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!509 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!510 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "Version", scope: !513, file: !514, line: 3, type: !79, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !515, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!515 = !{!511}
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !518, file: !519, line: 65, type: !523, isLocal: false, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !520, retainedTypes: !521, globals: !522, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!520 = !{!27}
!521 = !{!78, !79, !86}
!522 = !{!516}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !524, line: 69, baseType: !525)
!524 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "file_name", scope: !530, file: !531, line: 45, type: !79, isLocal: true, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !532, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!532 = !{!528, !533}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !530, file: !531, line: 55, type: !110, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !537, file: !538, line: 66, type: !525, isLocal: false, isDefinition: true)
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !539, globals: !540, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!539 = !{!78, !86}
!540 = !{!541, !567, !535, !569, !571}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "old_file_name", scope: !543, file: !538, line: 304, type: !79, isLocal: true, isDefinition: true)
!543 = distinct !DISubprogram(name: "verror_at_line", scope: !538, file: !538, line: 298, type: !544, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !537, retainedNodes: !560)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !81, !81, !79, !7, !79, !546}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !547, line: 52, baseType: !548)
!547 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !549, line: 32, baseType: !550)
!549 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !551, baseType: !552)
!551 = !DIFile(filename: "lib/error.c", directory: "/src")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !553, size: 256, elements: !554)
!553 = !DINamespace(name: "std", scope: null)
!554 = !{!555, !556, !557, !558, !559}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !552, file: !551, baseType: !78, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !552, file: !551, baseType: !78, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !552, file: !551, baseType: !78, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !552, file: !551, baseType: !81, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !552, file: !551, baseType: !81, size: 32, offset: 224)
!560 = !{!561, !562, !563, !564, !565, !566}
!561 = !DILocalVariable(name: "status", arg: 1, scope: !543, file: !538, line: 298, type: !81)
!562 = !DILocalVariable(name: "errnum", arg: 2, scope: !543, file: !538, line: 298, type: !81)
!563 = !DILocalVariable(name: "file_name", arg: 3, scope: !543, file: !538, line: 298, type: !79)
!564 = !DILocalVariable(name: "line_number", arg: 4, scope: !543, file: !538, line: 298, type: !7)
!565 = !DILocalVariable(name: "message", arg: 5, scope: !543, file: !538, line: 298, type: !79)
!566 = !DILocalVariable(name: "args", arg: 6, scope: !543, file: !538, line: 298, type: !546)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "old_line_number", scope: !543, file: !538, line: 305, type: !7, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "error_message_count", scope: !537, file: !538, line: 69, type: !7, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !537, file: !538, line: 295, type: !81, isLocal: false, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "patsuffix", scope: !575, file: !576, line: 543, type: !155, isLocal: true, isDefinition: true)
!575 = distinct !DISubprogram(name: "add_exclude", scope: !576, file: !576, line: 508, type: !577, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !645, retainedNodes: !659)
!576 = !DIFile(filename: "lib/exclude.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa512123465487c1fb7947405d851ab7")
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579, !79, !81}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !576, line: 123, size: 128, elements: !581)
!581 = !{!582, !639}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !580, file: !576, line: 125, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_segment", file: !576, line: 103, size: 320, elements: !585)
!585 = !{!586, !587, !592, !593}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !576, line: 105, baseType: !583, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !576, line: 106, baseType: !588, size: 32, offset: 64)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !576, line: 97, baseType: !7, size: 32, elements: !589)
!589 = !{!590, !591}
!590 = !DIEnumerator(name: "exclude_hash", value: 0)
!591 = !DIEnumerator(name: "exclude_pattern", value: 1)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !584, file: !576, line: 107, baseType: !81, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !584, file: !576, line: 112, baseType: !594, size: 192, offset: 128)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !584, file: !576, line: 108, size: 192, elements: !595)
!595 = !{!596, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !594, file: !576, line: 110, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !599, line: 56, baseType: !600)
!599 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !599, line: 54, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !594, file: !576, line: 111, baseType: !602, size: 192)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_pattern", file: !576, line: 90, size: 192, elements: !603)
!603 = !{!604, !637, !638}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "exclude", scope: !602, file: !576, line: 92, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "patopts", file: !576, line: 78, size: 576, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !606, file: !576, line: 80, baseType: !81, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !606, file: !576, line: 85, baseType: !610, size: 512, offset: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !576, line: 81, size: 512, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !610, file: !576, line: 83, baseType: !79, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !610, file: !576, line: 84, baseType: !614, size: 512)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !615, line: 478, baseType: !616)
!615 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !615, line: 413, size: 512, elements: !617)
!617 = !{!618, !621, !623, !624, !626, !627, !629, !630, !631, !632, !633, !634, !635, !636}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !616, file: !615, line: 417, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !615, line: 417, flags: DIFlagFwdDecl)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !616, file: !615, line: 420, baseType: !622, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !615, line: 56, baseType: !85)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !616, file: !615, line: 423, baseType: !622, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !616, file: !615, line: 426, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !615, line: 71, baseType: !85)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !616, file: !615, line: 431, baseType: !76, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !616, file: !615, line: 437, baseType: !628, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !616, file: !615, line: 440, baseType: !83, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !616, file: !615, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !616, file: !615, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !616, file: !615, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !616, file: !615, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !616, file: !615, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !616, file: !615, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !616, file: !615, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_alloc", scope: !602, file: !576, line: 93, baseType: !151, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_count", scope: !602, file: !576, line: 94, baseType: !151, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "patbuf", scope: !580, file: !576, line: 126, baseType: !640, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pattern_buffer", file: !576, line: 115, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !576, line: 117, baseType: !640, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !641, file: !576, line: 118, baseType: !76, size: 64, offset: 64)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !646, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!646 = !{!588, !53, !647, !651, !654}
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 127, baseType: !7, size: 32, elements: !649)
!648 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!649 = !{!650}
!650 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 131, baseType: !7, size: 32, elements: !652)
!652 = !{!653}
!653 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 130, baseType: !7, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!657 = !{!81, !86, !82, !83, !628}
!658 = !{!573}
!659 = !{!660, !661, !662, !663, !667, !668, !671, !672, !675, !680, !684, !686}
!660 = !DILocalVariable(name: "ex", arg: 1, scope: !575, file: !576, line: 508, type: !579)
!661 = !DILocalVariable(name: "pattern", arg: 2, scope: !575, file: !576, line: 508, type: !79)
!662 = !DILocalVariable(name: "options", arg: 3, scope: !575, file: !576, line: 508, type: !81)
!663 = !DILocalVariable(name: "pat", scope: !664, file: !576, line: 518, type: !666)
!664 = distinct !DILexicalBlock(scope: !665, file: !576, line: 512, column: 5)
!665 = distinct !DILexicalBlock(scope: !575, file: !576, line: 510, column: 7)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!667 = !DILocalVariable(name: "patopts", scope: !664, file: !576, line: 522, type: !605)
!668 = !DILocalVariable(name: "cflags", scope: !669, file: !576, line: 527, type: !81)
!669 = distinct !DILexicalBlock(scope: !670, file: !576, line: 526, column: 9)
!670 = distinct !DILexicalBlock(scope: !664, file: !576, line: 525, column: 11)
!671 = !DILocalVariable(name: "rc", scope: !669, file: !576, line: 530, type: !81)
!672 = !DILocalVariable(name: "len", scope: !673, file: !576, line: 534, type: !151)
!673 = distinct !DILexicalBlock(scope: !674, file: !576, line: 534, column: 13)
!674 = distinct !DILexicalBlock(scope: !669, file: !576, line: 531, column: 15)
!675 = !DILocalVariable(name: "tmp", scope: !676, file: !576, line: 544, type: !76)
!676 = distinct !DILexicalBlock(scope: !677, file: !576, line: 542, column: 19)
!677 = distinct !DILexicalBlock(scope: !678, file: !576, line: 541, column: 21)
!678 = distinct !DILexicalBlock(scope: !679, file: !576, line: 535, column: 15)
!679 = distinct !DILexicalBlock(scope: !673, file: !576, line: 534, column: 13)
!680 = !DILocalVariable(name: "dup", scope: !681, file: !576, line: 563, type: !76)
!681 = distinct !DILexicalBlock(scope: !682, file: !576, line: 562, column: 13)
!682 = distinct !DILexicalBlock(scope: !683, file: !576, line: 561, column: 15)
!683 = distinct !DILexicalBlock(scope: !670, file: !576, line: 560, column: 9)
!684 = !DILocalVariable(name: "exclude_hash_flags", scope: !685, file: !576, line: 572, type: !81)
!685 = distinct !DILexicalBlock(scope: !665, file: !576, line: 571, column: 5)
!686 = !DILocalVariable(name: "str", scope: !685, file: !576, line: 579, type: !76)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !689, file: !712, line: 75, type: !725, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !691, retainedTypes: !700, globals: !709, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!691 = !{!692}
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !693, line: 163, baseType: !7, size: 32, elements: !694)
!693 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!694 = !{!695, !696, !697, !698, !699}
!695 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!696 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!697 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!698 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!699 = !DIEnumerator(name: "NO_PAD", value: 4)
!700 = !{!78, !110, !7, !94, !85, !81, !86, !701}
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !177, line: 1039, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !704, line: 24, size: 128, elements: !705)
!704 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !704, line: 28, baseType: !702, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !703, file: !704, line: 33, baseType: !77, size: 8, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !703, file: !704, line: 45, baseType: !410, offset: 72)
!709 = !{!687, !710, !722, !742, !747, !750}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !689, file: !712, line: 21, type: !713, isLocal: true, isDefinition: true)
!712 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 1920, elements: !720)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !716, line: 19, size: 128, elements: !717)
!716 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !715, file: !716, line: 21, baseType: !79, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !715, file: !716, line: 22, baseType: !79, size: 64, offset: 64)
!720 = !{!721}
!721 = !DISubrange(count: 15)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !689, file: !724, line: 131, type: !725, isLocal: true, isDefinition: true)
!724 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !716, line: 33, size: 192, elements: !727)
!727 = !{!728, !740, !741}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !726, file: !716, line: 39, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!81, !732, !81, !81, !81}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !716, line: 25, size: 192, elements: !734)
!734 = !{!735, !736, !737, !738}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !733, file: !716, line: 27, baseType: !81, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !733, file: !716, line: 28, baseType: !81, size: 32, offset: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !733, file: !716, line: 29, baseType: !81, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !733, file: !716, line: 30, baseType: !739, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !726, file: !716, line: 42, baseType: !79, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !726, file: !716, line: 44, baseType: !7, size: 32, offset: 128)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !689, file: !724, line: 37, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 1536, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 12)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !689, file: !749, line: 76, type: !725, isLocal: true, isDefinition: true)
!749 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !689, file: !749, line: 21, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 1664, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 13)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "default_tuning", scope: !757, file: !758, line: 134, type: !762, isLocal: true, isDefinition: true)
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !759, globals: !761, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!759 = !{!85, !78, !760, !83}
!760 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!761 = !{!755}
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !599, line: 52, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !599, line: 40, size: 160, elements: !765)
!765 = !{!766, !767, !768, !769, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !764, file: !599, line: 45, baseType: !760, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !764, file: !599, line: 46, baseType: !760, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !764, file: !599, line: 47, baseType: !760, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !764, file: !599, line: 48, baseType: !760, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !764, file: !599, line: 49, baseType: !110, size: 8, offset: 128)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "power_letter", scope: !773, file: !774, line: 36, type: !785, isLocal: true, isDefinition: true)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !775, retainedTypes: !776, globals: !777, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!775 = !{!14, !5}
!776 = !{!74}
!777 = !{!771, !778, !781}
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "block_size_args", scope: !773, file: !774, line: 398, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 192, elements: !340)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !773, file: !774, line: 399, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 64, elements: !107)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 88, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 11)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "program_name", scope: !790, file: !791, line: 31, type: !79, isLocal: false, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !792, globals: !793, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!792 = !{!76}
!793 = !{!788}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "utf07FF", scope: !796, file: !797, line: 46, type: !825, isLocal: true, isDefinition: true)
!796 = distinct !DISubprogram(name: "proper_name_lite", scope: !797, file: !797, line: 38, type: !798, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !800, retainedNodes: !802)
!797 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!798 = !DISubroutineType(types: !799)
!799 = !{!79, !79, !79}
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !801, splitDebugInlining: false, nameTableKind: None)
!801 = !{!794}
!802 = !{!803, !804, !805, !806, !811}
!803 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !796, file: !797, line: 38, type: !79)
!804 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !796, file: !797, line: 38, type: !79)
!805 = !DILocalVariable(name: "translation", scope: !796, file: !797, line: 40, type: !79)
!806 = !DILocalVariable(name: "w", scope: !796, file: !797, line: 47, type: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !808, line: 37, baseType: !809)
!808 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !90, line: 57, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !90, line: 42, baseType: !7)
!811 = !DILocalVariable(name: "mbs", scope: !796, file: !797, line: 48, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !813, line: 6, baseType: !814)
!813 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !815, line: 21, baseType: !816)
!815 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 13, size: 64, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !816, file: !815, line: 15, baseType: !81, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !816, file: !815, line: 20, baseType: !820, size: 32, offset: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !816, file: !815, line: 16, size: 32, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !820, file: !815, line: 18, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !820, file: !815, line: 19, baseType: !824, size: 32)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !334)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 16, elements: !107)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !828, file: !829, line: 76, type: !897, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !830, retainedTypes: !836, globals: !837, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!830 = !{!27, !831, !53}
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !28, line: 254, baseType: !7, size: 32, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!834 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!835 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!836 = !{!81, !82, !83}
!837 = !{!826, !838, !844, !856, !858, !863, !886, !893, !895}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !828, file: !829, line: 92, type: !840, isLocal: false, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 320, elements: !842)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!842 = !{!843}
!843 = !DISubrange(count: 10)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !828, file: !829, line: 1040, type: !846, isLocal: false, isDefinition: true)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !829, line: 56, size: 448, elements: !847)
!847 = !{!848, !849, !850, !854, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !846, file: !829, line: 59, baseType: !27, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !846, file: !829, line: 62, baseType: !81, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !846, file: !829, line: 66, baseType: !851, size: 256, offset: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !846, file: !829, line: 69, baseType: !79, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !846, file: !829, line: 72, baseType: !79, size: 64, offset: 384)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !828, file: !829, line: 107, type: !846, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "slot0", scope: !828, file: !829, line: 831, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 2048, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 256)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "quote", scope: !865, file: !829, line: 228, type: !884, isLocal: true, isDefinition: true)
!865 = distinct !DISubprogram(name: "gettext_quote", scope: !829, file: !829, line: 197, type: !866, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !828, retainedNodes: !868)
!866 = !DISubroutineType(types: !867)
!867 = !{!79, !79, !27}
!868 = !{!869, !870, !871, !872, !873}
!869 = !DILocalVariable(name: "msgid", arg: 1, scope: !865, file: !829, line: 197, type: !79)
!870 = !DILocalVariable(name: "s", arg: 2, scope: !865, file: !829, line: 197, type: !27)
!871 = !DILocalVariable(name: "translation", scope: !865, file: !829, line: 199, type: !79)
!872 = !DILocalVariable(name: "w", scope: !865, file: !829, line: 229, type: !807)
!873 = !DILocalVariable(name: "mbs", scope: !865, file: !829, line: 230, type: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !813, line: 6, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !815, line: 21, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 13, size: 64, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !876, file: !815, line: 15, baseType: !81, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !876, file: !815, line: 20, baseType: !880, size: 32, offset: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !876, file: !815, line: 16, size: 32, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !880, file: !815, line: 18, baseType: !7, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !880, file: !815, line: 19, baseType: !824, size: 32)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 64, elements: !885)
!885 = !{!108, !335}
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "slotvec", scope: !828, file: !829, line: 834, type: !888, isLocal: true, isDefinition: true)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !829, line: 823, size: 128, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !829, line: 825, baseType: !83, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !889, file: !829, line: 826, baseType: !76, size: 64, offset: 64)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "nslots", scope: !828, file: !829, line: 832, type: !81, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "slotvec0", scope: !828, file: !829, line: 833, type: !889, isLocal: true, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 704, elements: !786)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !900, file: !901, line: 26, type: !903, isLocal: false, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !902, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!902 = !{!898}
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 376, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 47)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "exit_failure", scope: !908, file: !909, line: 24, type: !911, isLocal: false, isDefinition: true)
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !910, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!910 = !{!906}
!911 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !81)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !914, file: !915, line: 506, type: !81, isLocal: true, isDefinition: true)
!914 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !915, file: !915, line: 485, type: !916, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !918, retainedNodes: !920)
!915 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!916 = !DISubroutineType(types: !917)
!917 = !{!81, !81, !81}
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !919, splitDebugInlining: false, nameTableKind: None)
!919 = !{!912}
!920 = !{!921, !922, !923, !924, !927}
!921 = !DILocalVariable(name: "fd", arg: 1, scope: !914, file: !915, line: 485, type: !81)
!922 = !DILocalVariable(name: "target", arg: 2, scope: !914, file: !915, line: 485, type: !81)
!923 = !DILocalVariable(name: "result", scope: !914, file: !915, line: 487, type: !81)
!924 = !DILocalVariable(name: "flags", scope: !925, file: !915, line: 530, type: !81)
!925 = distinct !DILexicalBlock(scope: !926, file: !915, line: 529, column: 5)
!926 = distinct !DILexicalBlock(scope: !914, file: !915, line: 528, column: 7)
!927 = !DILocalVariable(name: "saved_errno", scope: !928, file: !915, line: 533, type: !81)
!928 = distinct !DILexicalBlock(scope: !929, file: !915, line: 532, column: 9)
!929 = distinct !DILexicalBlock(scope: !925, file: !915, line: 531, column: 11)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "internal_state", scope: !932, file: !933, line: 97, type: !936, isLocal: true, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !934, globals: !935, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!934 = !{!78, !83, !86}
!935 = !{!930}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !813, line: 6, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !815, line: 21, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !815, line: 13, size: 64, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !938, file: !815, line: 15, baseType: !81, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !938, file: !815, line: 20, baseType: !942, size: 32, offset: 32)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !938, file: !815, line: 16, size: 32, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !942, file: !815, line: 18, baseType: !7, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !942, file: !815, line: 19, baseType: !824, size: 32)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !950, retainedTypes: !951, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "lib/argv-iter.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0e394449b22995c9f56acaf5026a67a")
!950 = !{!46}
!951 = !{!78}
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !954, retainedTypes: !989, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "lib/di-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2927c59b609b2bc86cdb544d40fe64ab")
!954 = !{!955, !978}
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !956, file: !953, line: 118, baseType: !7, size: 32, elements: !976)
!956 = distinct !DISubprogram(name: "di_set_alloc", scope: !953, file: !953, line: 113, type: !957, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !952, retainedNodes: !974)
!957 = !DISubroutineType(types: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !953, line: 60, size: 192, elements: !961)
!961 = !{!962, !964, !968}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dev_map", scope: !960, file: !953, line: 63, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ino_map", scope: !960, file: !953, line: 68, baseType: !965, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "ino_map", file: !967, line: 37, flags: DIFlagFwdDecl)
!967 = !DIFile(filename: "./lib/ino-map.h", directory: "/src", checksumkind: CSK_MD5, checksum: "164e8a651c54e2fe0b02df23e39afb85")
!968 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !960, file: !953, line: 72, baseType: !969, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "di_ent", file: !953, line: 53, size: 128, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !970, file: !953, line: 55, baseType: !417, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ino_set", scope: !970, file: !953, line: 56, baseType: !963, size: 64, offset: 64)
!974 = !{!975}
!975 = !DILocalVariable(name: "dis", scope: !956, file: !953, line: 115, type: !959)
!976 = !{!977}
!977 = !DIEnumerator(name: "INITIAL_DEV_MAP_SIZE", value: 11)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !979, file: !953, line: 185, baseType: !7, size: 32, elements: !987)
!979 = distinct !DISubprogram(name: "map_device", scope: !953, file: !953, line: 155, type: !980, scopeLine: 156, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !952, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!963, !959, !417}
!982 = !{!983, !984, !985, !986}
!983 = !DILocalVariable(name: "dis", arg: 1, scope: !979, file: !953, line: 155, type: !959)
!984 = !DILocalVariable(name: "dev", arg: 2, scope: !979, file: !953, line: 155, type: !417)
!985 = !DILocalVariable(name: "probe", scope: !979, file: !953, line: 158, type: !969)
!986 = !DILocalVariable(name: "ent", scope: !979, file: !953, line: 174, type: !969)
!987 = !{!988}
!988 = !DIEnumerator(name: "INITIAL_INO_SET_SIZE", value: 1021)
!989 = !{!83, !74, !990}
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashint", file: !953, line: 34, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !88, line: 90, baseType: !85)
!992 = distinct !DICompileUnit(language: DW_LANG_C99, file: !993, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!993 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !951, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!996 = distinct !DICompileUnit(language: DW_LANG_C99, file: !997, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!997 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !999, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !951, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1004, retainedTypes: !1137, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!1004 = !{!1005, !1009, !1113, !1116, !1120, !1131, !1134}
!1005 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !1003, line: 159, baseType: !7, size: 32, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1008 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1009 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1011, file: !1010, line: 54, baseType: !7, size: 32, elements: !1111)
!1010 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1011 = distinct !DISubprogram(name: "setup_dir", scope: !1010, file: !1010, line: 50, type: !1012, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1109)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!110, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !351, line: 233, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 115, size: 1024, elements: !1017)
!1017 = !{!1018, !1064, !1065, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1080, !1081, !1082, !1100}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1016, file: !351, line: 116, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !351, line: 235, size: 1920, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1063}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1020, file: !351, line: 236, baseType: !1019, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1020, file: !351, line: 237, baseType: !1019, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1020, file: !351, line: 238, baseType: !1019, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1020, file: !351, line: 239, baseType: !362, size: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1020, file: !351, line: 242, baseType: !94, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1020, file: !351, line: 243, baseType: !78, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1020, file: !351, line: 244, baseType: !76, size: 64, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1020, file: !351, line: 245, baseType: !76, size: 64, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1020, file: !351, line: 246, baseType: !81, size: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1020, file: !351, line: 247, baseType: !81, size: 32, offset: 544)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1020, file: !351, line: 248, baseType: !83, size: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1020, file: !351, line: 250, baseType: !1014, size: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1020, file: !351, line: 254, baseType: !153, size: 64, offset: 704)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1020, file: !351, line: 256, baseType: !83, size: 64, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1020, file: !351, line: 272, baseType: !82, size: 16, offset: 832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1020, file: !351, line: 276, baseType: !82, size: 16, offset: 848)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1020, file: !351, line: 282, baseType: !82, size: 16, offset: 864)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1020, file: !351, line: 284, baseType: !1040, size: 1024, offset: 896)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 1024, elements: !252)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !382, line: 44, size: 1024, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1060, !1061, !1062}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1041, file: !382, line: 46, baseType: !385, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1041, file: !382, line: 47, baseType: !387, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1041, file: !382, line: 48, baseType: !389, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1041, file: !382, line: 49, baseType: !391, size: 32, offset: 160)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1041, file: !382, line: 50, baseType: !393, size: 32, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1041, file: !382, line: 51, baseType: !395, size: 32, offset: 224)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1041, file: !382, line: 52, baseType: !385, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1041, file: !382, line: 53, baseType: !385, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1041, file: !382, line: 54, baseType: !246, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1041, file: !382, line: 55, baseType: !400, size: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1041, file: !382, line: 56, baseType: !81, size: 32, offset: 480)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1041, file: !382, line: 57, baseType: !403, size: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1041, file: !382, line: 65, baseType: !1056, size: 128, offset: 576)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !190, line: 11, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1056, file: !190, line: 16, baseType: !93, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1056, file: !190, line: 21, baseType: !194, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1041, file: !382, line: 66, baseType: !1056, size: 128, offset: 704)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1041, file: !382, line: 67, baseType: !1056, size: 128, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1041, file: !382, line: 79, baseType: !408, size: 64, offset: 960)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !1020, file: !351, line: 285, baseType: !410, offset: 1920)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !1016, file: !351, line: 117, baseType: !1019, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !1016, file: !351, line: 118, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1016, file: !351, line: 119, baseType: !417, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1016, file: !351, line: 120, baseType: !76, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !1016, file: !351, line: 121, baseType: !81, size: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !1016, file: !351, line: 122, baseType: !81, size: 32, offset: 352)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1016, file: !351, line: 124, baseType: !83, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !1016, file: !351, line: 125, baseType: !83, size: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !1016, file: !351, line: 126, baseType: !1074, size: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!81, !1077, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !1016, file: !351, line: 196, baseType: !81, size: 32, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !1016, file: !351, line: 205, baseType: !433, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1016, file: !351, line: 227, baseType: !1083, size: 64, offset: 704)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !351, line: 207, size: 64, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1083, file: !351, line: 220, baseType: !433, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1083, file: !351, line: 226, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !1089, line: 32, size: 256, elements: !1090)
