; ModuleID = 'src/echo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [12 x i8] c"status == 0\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"src/echo.c\00", align 1
@__PRETTY_FUNCTION__.usage = private unnamed_addr constant [16 x i8] c"void usage(int)\00", align 1
@.str.2 = private unnamed_addr constant [63 x i8] c"Usage: %s [SHORT-OPTION]... [STRING]...\0A  or:  %s LONG-OPTION\0A\00", align 1
@.str.3 = private unnamed_addr constant [41 x i8] c"Echo the STRING(s) to standard output.\0A\0A\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"echo\00", align 1
@.str.5 = private unnamed_addr constant [45 x i8] c"  -n     do not output the trailing newline\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !41)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !31, globals: !40, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/echo.c", directory: "/src", checksumkind: CSK_MD5, checksum: "35cdcf3349b867ec9786bdb5dc592ba7")
!11 = !{!12, !16}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 33, baseType: !13, size: 32, elements: !14)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DIEnumerator(name: "DEFAULT_ECHO_TO_XPG", value: 0)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 46, baseType: !13, size: 32, elements: !18)
!17 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30}
!19 = !DIEnumerator(name: "_ISupper", value: 256)
!20 = !DIEnumerator(name: "_ISlower", value: 512)
!21 = !DIEnumerator(name: "_ISalpha", value: 1024)
!22 = !DIEnumerator(name: "_ISdigit", value: 2048)
!23 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!24 = !DIEnumerator(name: "_ISspace", value: 8192)
!25 = !DIEnumerator(name: "_ISprint", value: 16384)
!26 = !DIEnumerator(name: "_ISgraph", value: 32768)
!27 = !DIEnumerator(name: "_ISblank", value: 1)
!28 = !DIEnumerator(name: "_IScntrl", value: 2)
!29 = !DIEnumerator(name: "_ISpunct", value: 4)
!30 = !DIEnumerator(name: "_ISalnum", value: 8)
!31 = !{!32, !33, !34, !35, !36, !6, !39}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 46, baseType: !38)
!37 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!38 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!0}
!41 = !{!42, !43, !44, !47, !49, !50, !51, !55, !56, !57, !58, !60, !116, !117, !118, !120, !121}
!42 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!43 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!44 = !DILocalVariable(name: "term", scope: !45, file: !3, line: 585, type: !6)
!45 = distinct !DILexicalBlock(scope: !46, file: !3, line: 582, column: 5)
!46 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!47 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !48)
!48 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!49 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!50 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!51 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 608, type: !6)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 605, column: 5)
!53 = distinct !DILexicalBlock(scope: !54, file: !3, line: 604, column: 12)
!54 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!55 = !DILocalVariable(name: "spaces", scope: !52, file: !3, line: 609, type: !36)
!56 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !36)
!57 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!58 = !DILocalVariable(name: "__ptr", scope: !59, file: !3, line: 644, type: !6)
!59 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!60 = !DILocalVariable(name: "__stream", scope: !59, file: !3, line: 644, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !82, !84, !85, !86, !90, !91, !93, !97, !100, !102, !105, !108, !109, !110, !111, !112}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !34, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !32, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !32, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !32, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !32, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !32, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !32, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !32, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !32, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !32, size: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !32, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !32, size: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !83, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !34, size: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !34, size: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 152, baseType: !89)
!88 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!89 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !35, size: 16, offset: 1024)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 153, baseType: !89)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !83, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !33, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !36, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !34, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DILocalVariable(name: "__cnt", scope: !59, file: !3, line: 644, type: !36)
!117 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!118 = !DILocalVariable(name: "__ptr", scope: !119, file: !3, line: 686, type: !6)
!119 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!120 = !DILocalVariable(name: "__stream", scope: !119, file: !3, line: 686, type: !61)
!121 = !DILocalVariable(name: "__cnt", scope: !119, file: !3, line: 686, type: !36)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "Version", scope: !124, file: !125, line: 3, type: !6, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!126 = !{!122}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "file_name", scope: !129, file: !130, line: 45, type: !6, isLocal: true, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !131, splitDebugInlining: false, nameTableKind: None)
!130 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!131 = !{!127, !132}
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !129, file: !130, line: 55, type: !48, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !136, file: !137, line: 66, type: !172, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !138, globals: !139, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!138 = !{!33, !39}
!139 = !{!140, !166, !134, !168, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "old_file_name", scope: !142, file: !137, line: 304, type: !6, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "verror_at_line", scope: !137, file: !137, line: 298, type: !143, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !159)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !34, !34, !6, !13, !6, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !146, line: 52, baseType: !147)
!146 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !148, line: 32, baseType: !149)
!148 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !150, baseType: !151)
!150 = !DIFile(filename: "lib/error.c", directory: "/src")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !152, size: 256, elements: !153)
!152 = !DINamespace(name: "std", scope: null)
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !151, file: !150, baseType: !33, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !151, file: !150, baseType: !33, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !151, file: !150, baseType: !33, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !151, file: !150, baseType: !34, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !151, file: !150, baseType: !34, size: 32, offset: 224)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(name: "status", arg: 1, scope: !142, file: !137, line: 298, type: !34)
!161 = !DILocalVariable(name: "errnum", arg: 2, scope: !142, file: !137, line: 298, type: !34)
!162 = !DILocalVariable(name: "file_name", arg: 3, scope: !142, file: !137, line: 298, type: !6)
!163 = !DILocalVariable(name: "line_number", arg: 4, scope: !142, file: !137, line: 298, type: !13)
!164 = !DILocalVariable(name: "message", arg: 5, scope: !142, file: !137, line: 298, type: !6)
!165 = !DILocalVariable(name: "args", arg: 6, scope: !142, file: !137, line: 298, type: !145)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "old_line_number", scope: !142, file: !137, line: 305, type: !13, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "error_message_count", scope: !136, file: !137, line: 69, type: !13, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !136, file: !137, line: 295, type: !34, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "program_name", scope: !177, file: !178, line: 31, type: !6, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !180, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!179 = !{!32}
!180 = !{!175}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "utf07FF", scope: !183, file: !184, line: 46, type: !214, isLocal: true, isDefinition: true)
!183 = distinct !DISubprogram(name: "proper_name_lite", scope: !184, file: !184, line: 38, type: !185, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !187, retainedNodes: !189)
!184 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!185 = !DISubroutineType(types: !186)
!186 = !{!6, !6, !6}
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !188, splitDebugInlining: false, nameTableKind: None)
!188 = !{!181}
!189 = !{!190, !191, !192, !193, !198}
!190 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !183, file: !184, line: 38, type: !6)
!191 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !183, file: !184, line: 38, type: !6)
!192 = !DILocalVariable(name: "translation", scope: !183, file: !184, line: 40, type: !6)
!193 = !DILocalVariable(name: "w", scope: !183, file: !184, line: 47, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !195, line: 37, baseType: !196)
!195 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !88, line: 57, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !88, line: 42, baseType: !13)
!198 = !DILocalVariable(name: "mbs", scope: !183, file: !184, line: 48, type: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !200, line: 6, baseType: !201)
!200 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !202, line: 21, baseType: !203)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 13, size: 64, elements: !204)
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !203, file: !202, line: 15, baseType: !34, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !203, file: !202, line: 20, baseType: !207, size: 32, offset: 32)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !202, line: 16, size: 32, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !207, file: !202, line: 18, baseType: !13, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !207, file: !202, line: 19, baseType: !211, size: 32)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 4)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 2)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !219, file: !220, line: 76, type: !302, isLocal: false, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !221, retainedTypes: !241, globals: !242, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!221 = !{!222, !236, !16}
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !223, line: 42, baseType: !13, size: 32, elements: !224)
!223 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!225 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!226 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!227 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!228 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!229 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!230 = !DIEnumerator(name: "c_quoting_style", value: 5)
!231 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!232 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!233 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!234 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!235 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !223, line: 254, baseType: !13, size: 32, elements: !237)
!237 = !{!238, !239, !240}
!238 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!239 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!240 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!241 = !{!34, !35, !36}
!242 = !{!217, !243, !249, !261, !263, !268, !291, !298, !300}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !219, file: !220, line: 92, type: !245, isLocal: false, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 320, elements: !247)
!246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!247 = !{!248}
!248 = !DISubrange(count: 10)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !219, file: !220, line: 1040, type: !251, isLocal: false, isDefinition: true)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !220, line: 56, size: 448, elements: !252)
!252 = !{!253, !254, !255, !259, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !251, file: !220, line: 59, baseType: !222, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !220, line: 62, baseType: !34, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !251, file: !220, line: 66, baseType: !256, size: 256, offset: 64)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !251, file: !220, line: 69, baseType: !6, size: 64, offset: 320)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !251, file: !220, line: 72, baseType: !6, size: 64, offset: 384)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !219, file: !220, line: 107, type: !251, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "slot0", scope: !219, file: !220, line: 831, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "quote", scope: !270, file: !220, line: 228, type: !289, isLocal: true, isDefinition: true)
!270 = distinct !DISubprogram(name: "gettext_quote", scope: !220, file: !220, line: 197, type: !271, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !273)
!271 = !DISubroutineType(types: !272)
!272 = !{!6, !6, !222}
!273 = !{!274, !275, !276, !277, !278}
!274 = !DILocalVariable(name: "msgid", arg: 1, scope: !270, file: !220, line: 197, type: !6)
!275 = !DILocalVariable(name: "s", arg: 2, scope: !270, file: !220, line: 197, type: !222)
!276 = !DILocalVariable(name: "translation", scope: !270, file: !220, line: 199, type: !6)
!277 = !DILocalVariable(name: "w", scope: !270, file: !220, line: 229, type: !194)
!278 = !DILocalVariable(name: "mbs", scope: !270, file: !220, line: 230, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !200, line: 6, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !202, line: 21, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 13, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !281, file: !202, line: 15, baseType: !34, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !281, file: !202, line: 20, baseType: !285, size: 32, offset: 32)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !202, line: 16, size: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !285, file: !202, line: 18, baseType: !13, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !285, file: !202, line: 19, baseType: !211, size: 32)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !290)
!290 = !{!216, !213}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "slotvec", scope: !219, file: !220, line: 834, type: !293, isLocal: true, isDefinition: true)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !220, line: 823, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !294, file: !220, line: 825, baseType: !36, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !294, file: !220, line: 826, baseType: !32, size: 64, offset: 64)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "nslots", scope: !219, file: !220, line: 832, type: !34, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "slotvec0", scope: !219, file: !220, line: 833, type: !294, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 704, elements: !304)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!304 = !{!305}
!305 = !DISubrange(count: 11)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !308, file: !309, line: 26, type: !311, isLocal: false, isDefinition: true)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !309, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !310, splitDebugInlining: false, nameTableKind: None)
!309 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!310 = !{!306}
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 47)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "exit_failure", scope: !316, file: !317, line: 24, type: !319, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !318, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!318 = !{!314}
!319 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "internal_state", scope: !322, file: !323, line: 97, type: !326, isLocal: true, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !324, globals: !325, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!324 = !{!33, !36, !39}
!325 = !{!320}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !200, line: 6, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !202, line: 21, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 13, size: 64, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !328, file: !202, line: 15, baseType: !34, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !328, file: !202, line: 20, baseType: !332, size: 32, offset: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !202, line: 16, size: 32, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !332, file: !202, line: 18, baseType: !13, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !332, file: !202, line: 19, baseType: !211, size: 32)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !340, retainedTypes: !344, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!340 = !{!341}
!341 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 40, baseType: !13, size: 32, elements: !342)
!342 = !{!343}
!343 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!344 = !{!33}
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, retainedTypes: !378, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!347 = !{!348, !360}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !349, file: !346, line: 188, baseType: !13, size: 32, elements: !358)
!349 = distinct !DISubprogram(name: "x2nrealloc", scope: !346, file: !346, line: 176, type: !350, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !345, retainedNodes: !353)
!350 = !DISubroutineType(types: !351)
!351 = !{!33, !33, !352, !36}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!353 = !{!354, !355, !356, !357}
!354 = !DILocalVariable(name: "p", arg: 1, scope: !349, file: !346, line: 176, type: !33)
!355 = !DILocalVariable(name: "pn", arg: 2, scope: !349, file: !346, line: 176, type: !352)
!356 = !DILocalVariable(name: "s", arg: 3, scope: !349, file: !346, line: 176, type: !36)
!357 = !DILocalVariable(name: "n", scope: !349, file: !346, line: 178, type: !36)
!358 = !{!359}
!359 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !361, file: !346, line: 228, baseType: !13, size: 32, elements: !358)
!361 = distinct !DISubprogram(name: "xpalloc", scope: !346, file: !346, line: 223, type: !362, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !345, retainedNodes: !368)
!362 = !DISubroutineType(types: !363)
!363 = !{!33, !33, !364, !365, !367, !365}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !366, line: 130, baseType: !367)
!366 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !37, line: 35, baseType: !89)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377}
!369 = !DILocalVariable(name: "pa", arg: 1, scope: !361, file: !346, line: 223, type: !33)
!370 = !DILocalVariable(name: "pn", arg: 2, scope: !361, file: !346, line: 223, type: !364)
!371 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !361, file: !346, line: 223, type: !365)
!372 = !DILocalVariable(name: "n_max", arg: 4, scope: !361, file: !346, line: 223, type: !367)
!373 = !DILocalVariable(name: "s", arg: 5, scope: !361, file: !346, line: 223, type: !365)
!374 = !DILocalVariable(name: "n0", scope: !361, file: !346, line: 230, type: !365)
!375 = !DILocalVariable(name: "n", scope: !361, file: !346, line: 237, type: !365)
!376 = !DILocalVariable(name: "nbytes", scope: !361, file: !346, line: 248, type: !365)
!377 = !DILocalVariable(name: "adjusted_nbytes", scope: !361, file: !346, line: 252, type: !365)
!378 = !{!32, !33, !48, !89, !38}
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!391 = !{!48, !38, !33}
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!398 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!399 = !{i32 7, !"Dwarf Version", i32 5}
!400 = !{i32 2, !"Debug Info Version", i32 3}
!401 = !{i32 1, !"wchar_size", i32 4}
!402 = !{i32 1, !"branch-target-enforcement", i32 0}
!403 = !{i32 1, !"sign-return-address", i32 0}
!404 = !{i32 1, !"sign-return-address-all", i32 0}
!405 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!406 = !{i32 7, !"PIC Level", i32 2}
!407 = !{i32 7, !"PIE Level", i32 2}
!408 = !{i32 7, !"uwtable", i32 1}
!409 = !{i32 7, !"frame-pointer", i32 1}
!410 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 37, type: !411, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !413)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !34}
!413 = !{!414}
!414 = !DILocalVariable(name: "status", arg: 1, scope: !410, file: !10, line: 37, type: !34)
!415 = !DILocation(line: 0, scope: !410)
!416 = !DILocation(line: 41, column: 3, scope: !417)
!417 = distinct !DILexicalBlock(scope: !418, file: !10, line: 41, column: 3)
!418 = distinct !DILexicalBlock(scope: !410, file: !10, line: 41, column: 3)
!419 = !DILocation(line: 41, column: 3, scope: !418)
!420 = !DILocation(line: 43, column: 3, scope: !410)
!421 = !{!422, !422, i64 0}
!422 = !{!"any pointer", !423, i64 0}
!423 = !{!"omnipotent char", !424, i64 0}
!424 = !{!"Simple C/C++ TBAA"}
!425 = !DILocation(line: 47, column: 3, scope: !410)
!426 = !DILocation(line: 51, column: 3, scope: !410)
!427 = !DILocation(line: 54, column: 3, scope: !410)
!428 = !DILocation(line: 61, column: 3, scope: !410)
!429 = !DILocation(line: 68, column: 3, scope: !410)
!430 = !DILocation(line: 69, column: 3, scope: !410)
!431 = !DILocation(line: 70, column: 3, scope: !410)
!432 = !DILocation(line: 75, column: 3, scope: !410)
!433 = !DILocation(line: 87, column: 3, scope: !410)
!434 = !DILocation(line: 91, column: 3, scope: !410)
!435 = !DILocation(line: 92, column: 3, scope: !410)
!436 = !DILocation(line: 96, column: 3, scope: !410)
!437 = !DILocation(line: 97, column: 3, scope: !410)
!438 = !DISubprogram(name: "dcgettext", scope: !439, file: !439, line: 51, type: !440, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!439 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!440 = !DISubroutineType(types: !441)
!441 = !{!32, !6, !6, !34}
!442 = !{}
!443 = !DISubprogram(name: "fputs_unlocked", scope: !146, file: !146, line: 691, type: !444, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!444 = !DISubroutineType(types: !445)
!445 = !{!34, !446, !447}
!446 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!447 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!448 = !DILocation(line: 0, scope: !2)
!449 = !DILocation(line: 581, column: 7, scope: !46)
!450 = !{!451, !451, i64 0}
!451 = !{!"int", !423, i64 0}
!452 = !DILocation(line: 581, column: 19, scope: !46)
!453 = !DILocation(line: 581, column: 7, scope: !2)
!454 = !DILocation(line: 585, column: 26, scope: !45)
!455 = !DILocation(line: 0, scope: !45)
!456 = !DILocation(line: 586, column: 23, scope: !45)
!457 = !DILocation(line: 586, column: 28, scope: !45)
!458 = !DILocation(line: 586, column: 32, scope: !45)
!459 = !{!423, !423, i64 0}
!460 = !DILocation(line: 586, column: 38, scope: !45)
!461 = !DILocalVariable(name: "__s1", arg: 1, scope: !462, file: !463, line: 1359, type: !6)
!462 = distinct !DISubprogram(name: "streq", scope: !463, file: !463, line: 1359, type: !464, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !466)
!463 = !DIFile(filename: "./lib/string.h", directory: "/src")
!464 = !DISubroutineType(types: !465)
!465 = !{!48, !6, !6}
!466 = !{!461, !467}
!467 = !DILocalVariable(name: "__s2", arg: 2, scope: !462, file: !463, line: 1359, type: !6)
!468 = !DILocation(line: 0, scope: !462, inlinedAt: !469)
!469 = distinct !DILocation(line: 586, column: 41, scope: !45)
!470 = !DILocation(line: 1361, column: 11, scope: !462, inlinedAt: !469)
!471 = !DILocation(line: 1361, column: 10, scope: !462, inlinedAt: !469)
!472 = !DILocation(line: 586, column: 19, scope: !45)
!473 = !DILocation(line: 587, column: 5, scope: !45)
!474 = !DILocation(line: 588, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!476 = !DILocation(line: 588, column: 7, scope: !2)
!477 = !DILocation(line: 590, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !3, line: 589, column: 5)
!479 = !DILocation(line: 591, column: 7, scope: !478)
!480 = !DILocation(line: 595, column: 37, scope: !2)
!481 = !DILocation(line: 595, column: 35, scope: !2)
!482 = !DILocation(line: 596, column: 29, scope: !2)
!483 = !DILocation(line: 597, column: 8, scope: !54)
!484 = !DILocation(line: 597, column: 7, scope: !2)
!485 = !DILocation(line: 604, column: 24, scope: !53)
!486 = !DILocation(line: 604, column: 12, scope: !54)
!487 = !DILocation(line: 0, scope: !52)
!488 = !DILocation(line: 610, column: 16, scope: !52)
!489 = !DILocation(line: 610, column: 7, scope: !52)
!490 = !DILocation(line: 611, column: 21, scope: !52)
!491 = !{!492, !492, i64 0}
!492 = !{!"short", !423, i64 0}
!493 = !DILocation(line: 611, column: 19, scope: !52)
!494 = !DILocation(line: 611, column: 16, scope: !52)
!495 = !DILocation(line: 610, column: 30, scope: !52)
!496 = distinct !{!496, !489, !490, !497}
!497 = !{!"llvm.loop.mustprogress"}
!498 = !DILocation(line: 612, column: 18, scope: !499)
!499 = distinct !DILexicalBlock(scope: !52, file: !3, line: 612, column: 11)
!500 = !DILocation(line: 612, column: 11, scope: !52)
!501 = !DILocation(line: 620, column: 23, scope: !2)
!502 = !DILocation(line: 625, column: 39, scope: !2)
!503 = !DILocation(line: 626, column: 3, scope: !2)
!504 = !DILocation(line: 626, column: 10, scope: !2)
!505 = !DILocation(line: 626, column: 21, scope: !2)
!506 = !DILocation(line: 628, column: 44, scope: !507)
!507 = distinct !DILexicalBlock(scope: !508, file: !3, line: 628, column: 11)
!508 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!509 = !DILocation(line: 628, column: 32, scope: !507)
!510 = !DILocation(line: 628, column: 49, scope: !507)
!511 = !DILocation(line: 628, column: 11, scope: !508)
!512 = !DILocation(line: 630, column: 11, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !3, line: 630, column: 11)
!514 = !DILocation(line: 630, column: 11, scope: !508)
!515 = !DILocation(line: 632, column: 26, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 632, column: 15)
!517 = distinct !DILexicalBlock(scope: !513, file: !3, line: 631, column: 9)
!518 = !DILocation(line: 632, column: 34, scope: !516)
!519 = !DILocation(line: 632, column: 37, scope: !516)
!520 = !DILocation(line: 632, column: 15, scope: !517)
!521 = !DILocation(line: 636, column: 29, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !3, line: 636, column: 15)
!523 = !DILocation(line: 640, column: 16, scope: !508)
!524 = distinct !{!524, !503, !525, !497}
!525 = !DILocation(line: 641, column: 5, scope: !2)
!526 = !DILocation(line: 644, column: 3, scope: !2)
!527 = !DILocation(line: 0, scope: !462, inlinedAt: !528)
!528 = distinct !DILocation(line: 648, column: 31, scope: !2)
!529 = !DILocation(line: 0, scope: !462, inlinedAt: !530)
!530 = distinct !DILocation(line: 649, column: 31, scope: !2)
!531 = !DILocation(line: 0, scope: !462, inlinedAt: !532)
!532 = distinct !DILocation(line: 650, column: 31, scope: !2)
!533 = !DILocation(line: 0, scope: !462, inlinedAt: !534)
!534 = distinct !DILocation(line: 651, column: 31, scope: !2)
!535 = !DILocation(line: 0, scope: !462, inlinedAt: !536)
!536 = distinct !DILocation(line: 652, column: 31, scope: !2)
!537 = !DILocation(line: 0, scope: !462, inlinedAt: !538)
!538 = distinct !DILocation(line: 653, column: 31, scope: !2)
!539 = !DILocation(line: 0, scope: !462, inlinedAt: !540)
!540 = distinct !DILocation(line: 654, column: 31, scope: !2)
!541 = !DILocation(line: 0, scope: !462, inlinedAt: !542)
!542 = distinct !DILocation(line: 655, column: 31, scope: !2)
!543 = !DILocation(line: 0, scope: !462, inlinedAt: !544)
!544 = distinct !DILocation(line: 656, column: 31, scope: !2)
!545 = !DILocation(line: 0, scope: !462, inlinedAt: !546)
!546 = distinct !DILocation(line: 657, column: 31, scope: !2)
!547 = !DILocation(line: 663, column: 7, scope: !548)
!548 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!549 = !DILocation(line: 664, column: 7, scope: !548)
!550 = !DILocation(line: 664, column: 10, scope: !548)
!551 = !DILocation(line: 663, column: 7, scope: !2)
!552 = !DILocation(line: 669, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !548, file: !3, line: 665, column: 5)
!554 = !DILocation(line: 671, column: 5, scope: !553)
!555 = !DILocation(line: 676, column: 7, scope: !556)
!556 = distinct !DILexicalBlock(scope: !548, file: !3, line: 673, column: 5)
!557 = !DILocation(line: 679, column: 3, scope: !2)
!558 = !DILocation(line: 683, column: 3, scope: !2)
!559 = !DILocation(line: 686, column: 3, scope: !2)
!560 = !DILocation(line: 688, column: 3, scope: !2)
!561 = !DILocation(line: 691, column: 3, scope: !2)
!562 = !DILocation(line: 695, column: 3, scope: !2)
!563 = !DILocation(line: 696, column: 1, scope: !2)
!564 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !565, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !6}
!567 = !{!568, !569, !578, !579, !581, !582}
!568 = !DILocalVariable(name: "program", arg: 1, scope: !564, file: !3, line: 836, type: !6)
!569 = !DILocalVariable(name: "infomap", scope: !564, file: !3, line: 838, type: !570)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 896, elements: !576)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !564, file: !3, line: 838, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !572, file: !3, line: 838, baseType: !6, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !572, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!576 = !{!577}
!577 = !DISubrange(count: 7)
!578 = !DILocalVariable(name: "node", scope: !564, file: !3, line: 848, type: !6)
!579 = !DILocalVariable(name: "map_prog", scope: !564, file: !3, line: 849, type: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!581 = !DILocalVariable(name: "lc_messages", scope: !564, file: !3, line: 861, type: !6)
!582 = !DILocalVariable(name: "url_program", scope: !564, file: !3, line: 874, type: !6)
!583 = !DILocation(line: 0, scope: !564)
!584 = !DILocation(line: 838, column: 3, scope: !564)
!585 = !DILocation(line: 838, column: 67, scope: !564)
!586 = !DILocation(line: 849, column: 36, scope: !564)
!587 = !DILocation(line: 851, column: 3, scope: !564)
!588 = !DILocation(line: 0, scope: !462, inlinedAt: !589)
!589 = distinct !DILocation(line: 851, column: 33, scope: !564)
!590 = !DILocation(line: 1361, column: 11, scope: !462, inlinedAt: !589)
!591 = !DILocation(line: 1361, column: 10, scope: !462, inlinedAt: !589)
!592 = !DILocation(line: 852, column: 13, scope: !564)
!593 = !DILocation(line: 851, column: 20, scope: !564)
!594 = !{!595, !422, i64 0}
!595 = !{!"infomap", !422, i64 0, !422, i64 8}
!596 = !DILocation(line: 851, column: 10, scope: !564)
!597 = !DILocation(line: 851, column: 28, scope: !564)
!598 = distinct !{!598, !587, !592, !497}
!599 = !DILocation(line: 854, column: 17, scope: !600)
!600 = distinct !DILexicalBlock(scope: !564, file: !3, line: 854, column: 7)
!601 = !{!595, !422, i64 8}
!602 = !DILocation(line: 854, column: 7, scope: !600)
!603 = !DILocation(line: 854, column: 7, scope: !564)
!604 = !DILocation(line: 857, column: 3, scope: !564)
!605 = !DILocation(line: 861, column: 29, scope: !564)
!606 = !DILocation(line: 862, column: 7, scope: !607)
!607 = distinct !DILexicalBlock(scope: !564, file: !3, line: 862, column: 7)
!608 = !DILocation(line: 862, column: 19, scope: !607)
!609 = !DILocation(line: 862, column: 22, scope: !607)
!610 = !DILocation(line: 862, column: 7, scope: !564)
!611 = !DILocation(line: 868, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !607, file: !3, line: 863, column: 5)
!613 = !DILocation(line: 870, column: 5, scope: !612)
!614 = !DILocation(line: 0, scope: !462, inlinedAt: !615)
!615 = distinct !DILocation(line: 874, column: 29, scope: !564)
!616 = !DILocation(line: 875, column: 3, scope: !564)
!617 = !DILocation(line: 877, column: 3, scope: !564)
!618 = !DILocation(line: 879, column: 1, scope: !564)
!619 = !DISubprogram(name: "setlocale", scope: !620, file: !620, line: 122, type: !621, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!620 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!621 = !DISubroutineType(types: !622)
!622 = !{!32, !34, !6}
!623 = !DISubprogram(name: "getenv", scope: !624, file: !624, line: 641, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!624 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!625 = !DISubroutineType(types: !626)
!626 = !{!32, !6}
!627 = !DISubprogram(name: "fwrite_unlocked", scope: !146, file: !146, line: 704, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!628 = !DISubroutineType(types: !629)
!629 = !{!36, !630, !36, !36, !447}
!630 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!633 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 121, type: !634, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !637)
!634 = !DISubroutineType(types: !635)
!635 = !{!34, !34, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !647, !648, !652, !653, !659, !660}
!638 = !DILocalVariable(name: "argc", arg: 1, scope: !633, file: !10, line: 121, type: !34)
!639 = !DILocalVariable(name: "argv", arg: 2, scope: !633, file: !10, line: 121, type: !636)
!640 = !DILocalVariable(name: "display_return", scope: !633, file: !10, line: 123, type: !48)
!641 = !DILocalVariable(name: "posixly_correct", scope: !633, file: !10, line: 124, type: !48)
!642 = !DILocalVariable(name: "allow_options", scope: !633, file: !10, line: 125, type: !48)
!643 = !DILocalVariable(name: "do_v9", scope: !633, file: !10, line: 132, type: !48)
!644 = !DILocalVariable(name: "temp", scope: !645, file: !10, line: 163, type: !6)
!645 = distinct !DILexicalBlock(scope: !646, file: !10, line: 162, column: 7)
!646 = distinct !DILexicalBlock(scope: !633, file: !10, line: 160, column: 7)
!647 = !DILocalVariable(name: "i", scope: !645, file: !10, line: 164, type: !36)
!648 = !DILocalVariable(name: "s", scope: !649, file: !10, line: 210, type: !6)
!649 = distinct !DILexicalBlock(scope: !650, file: !10, line: 209, column: 9)
!650 = distinct !DILexicalBlock(scope: !651, file: !10, line: 207, column: 5)
!651 = distinct !DILexicalBlock(scope: !633, file: !10, line: 206, column: 7)
!652 = !DILocalVariable(name: "c", scope: !649, file: !10, line: 211, type: !39)
!653 = !DILocalVariable(name: "ch", scope: !654, file: !10, line: 230, type: !39)
!654 = distinct !DILexicalBlock(scope: !655, file: !10, line: 229, column: 23)
!655 = distinct !DILexicalBlock(scope: !656, file: !10, line: 218, column: 21)
!656 = distinct !DILexicalBlock(scope: !657, file: !10, line: 216, column: 17)
!657 = distinct !DILexicalBlock(scope: !658, file: !10, line: 215, column: 19)
!658 = distinct !DILexicalBlock(scope: !649, file: !10, line: 214, column: 13)
!659 = !DILabel(scope: !633, name: "just_echo", file: !10, line: 204)
!660 = !DILabel(scope: !655, name: "not_an_escape", file: !10, line: 259)
!661 = !DILocation(line: 0, scope: !633)
!662 = !DILocation(line: 124, column: 28, scope: !633)
!663 = !DILocation(line: 124, column: 27, scope: !633)
!664 = !DILocation(line: 127, column: 6, scope: !633)
!665 = !DILocation(line: 127, column: 37, scope: !633)
!666 = !DILocation(line: 127, column: 44, scope: !633)
!667 = !DILocation(line: 127, column: 54, scope: !633)
!668 = !DILocation(line: 0, scope: !462, inlinedAt: !669)
!669 = distinct !DILocation(line: 127, column: 47, scope: !633)
!670 = !DILocation(line: 1361, column: 11, scope: !462, inlinedAt: !669)
!671 = !DILocation(line: 1361, column: 10, scope: !462, inlinedAt: !669)
!672 = !DILocation(line: 135, column: 21, scope: !633)
!673 = !DILocation(line: 135, column: 3, scope: !633)
!674 = !DILocation(line: 136, column: 3, scope: !633)
!675 = !DILocation(line: 137, column: 3, scope: !633)
!676 = !DILocation(line: 138, column: 3, scope: !633)
!677 = !DILocation(line: 140, column: 3, scope: !633)
!678 = !DILocation(line: 144, column: 21, scope: !679)
!679 = distinct !DILexicalBlock(scope: !633, file: !10, line: 144, column: 7)
!680 = !DILocation(line: 146, column: 18, scope: !681)
!681 = distinct !DILexicalBlock(scope: !682, file: !10, line: 146, column: 11)
!682 = distinct !DILexicalBlock(scope: !679, file: !10, line: 145, column: 5)
!683 = !DILocation(line: 0, scope: !462, inlinedAt: !684)
!684 = distinct !DILocation(line: 146, column: 11, scope: !681)
!685 = !DILocation(line: 1361, column: 11, scope: !462, inlinedAt: !684)
!686 = !DILocation(line: 1361, column: 10, scope: !462, inlinedAt: !684)
!687 = !DILocation(line: 146, column: 11, scope: !682)
!688 = !DILocation(line: 147, column: 9, scope: !681)
!689 = !DILocation(line: 0, scope: !462, inlinedAt: !690)
!690 = distinct !DILocation(line: 149, column: 11, scope: !691)
!691 = distinct !DILexicalBlock(scope: !682, file: !10, line: 149, column: 11)
!692 = !DILocation(line: 1361, column: 11, scope: !462, inlinedAt: !690)
!693 = !DILocation(line: 1361, column: 10, scope: !462, inlinedAt: !690)
!694 = !DILocation(line: 149, column: 11, scope: !682)
!695 = !DILocation(line: 151, column: 24, scope: !696)
!696 = distinct !DILexicalBlock(scope: !691, file: !10, line: 150, column: 9)
!697 = !DILocation(line: 151, column: 60, scope: !696)
!698 = !DILocation(line: 151, column: 69, scope: !696)
!699 = !DILocation(line: 151, column: 11, scope: !696)
!700 = !DILocation(line: 153, column: 11, scope: !696)
!701 = !DILocation(line: 157, column: 3, scope: !633)
!702 = !DILocation(line: 158, column: 3, scope: !633)
!703 = !DILocation(line: 160, column: 7, scope: !633)
!704 = !DILocation(line: 123, column: 8, scope: !633)
!705 = !DILocation(line: 132, column: 8, scope: !633)
!706 = !DILocation(line: 200, column: 13, scope: !645)
!707 = !DILocation(line: 201, column: 13, scope: !645)
!708 = !DILocation(line: 161, column: 17, scope: !646)
!709 = !DILocation(line: 161, column: 21, scope: !646)
!710 = !DILocation(line: 161, column: 25, scope: !646)
!711 = !DILocation(line: 161, column: 24, scope: !646)
!712 = !DILocation(line: 161, column: 33, scope: !646)
!713 = !DILocation(line: 161, column: 5, scope: !646)
!714 = !DILocation(line: 163, column: 36, scope: !645)
!715 = !DILocation(line: 0, scope: !645)
!716 = !DILocation(line: 170, column: 14, scope: !717)
!717 = distinct !DILexicalBlock(scope: !645, file: !10, line: 170, column: 9)
!718 = !DILocation(line: 0, scope: !717)
!719 = !DILocation(line: 170, column: 21, scope: !720)
!720 = distinct !DILexicalBlock(scope: !717, file: !10, line: 170, column: 9)
!721 = !DILocation(line: 170, column: 9, scope: !717)
!722 = !DILocation(line: 170, column: 31, scope: !720)
!723 = !DILocation(line: 170, column: 9, scope: !720)
!724 = distinct !{!724, !721, !725, !497}
!725 = !DILocation(line: 177, column: 13, scope: !717)
!726 = !DILocation(line: 179, column: 15, scope: !727)
!727 = distinct !DILexicalBlock(scope: !645, file: !10, line: 179, column: 13)
!728 = !DILocation(line: 179, column: 13, scope: !645)
!729 = !DILocation(line: 184, column: 16, scope: !645)
!730 = !DILocation(line: 184, column: 9, scope: !645)
!731 = !DILocation(line: 185, column: 24, scope: !645)
!732 = !DILocation(line: 185, column: 11, scope: !645)
!733 = !DILocation(line: 189, column: 15, scope: !734)
!734 = distinct !DILexicalBlock(scope: !645, file: !10, line: 186, column: 13)
!735 = !DILocation(line: 193, column: 15, scope: !734)
!736 = !DILocation(line: 197, column: 15, scope: !734)
!737 = distinct !{!737, !730, !738, !497}
!738 = !DILocation(line: 198, column: 13, scope: !645)
!739 = !DILocation(line: 206, column: 13, scope: !651)
!740 = !DILocation(line: 204, column: 1, scope: !633)
!741 = !DILocation(line: 0, scope: !651)
!742 = !DILocation(line: 283, column: 7, scope: !633)
!743 = !DILocation(line: 273, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !651, file: !10, line: 272, column: 5)
!745 = !DILocation(line: 275, column: 11, scope: !746)
!746 = distinct !DILexicalBlock(scope: !744, file: !10, line: 274, column: 9)
!747 = !DILocation(line: 278, column: 20, scope: !748)
!748 = distinct !DILexicalBlock(scope: !746, file: !10, line: 278, column: 15)
!749 = !DILocation(line: 278, column: 15, scope: !746)
!750 = !DILocation(line: 208, column: 7, scope: !650)
!751 = !DILocation(line: 210, column: 27, scope: !649)
!752 = !DILocation(line: 0, scope: !649)
!753 = !DILocation(line: 213, column: 11, scope: !649)
!754 = !DILocation(line: 213, column: 25, scope: !649)
!755 = !DILocation(line: 213, column: 23, scope: !649)
!756 = !DILocation(line: 215, column: 32, scope: !657)
!757 = !DILocation(line: 215, column: 19, scope: !658)
!758 = !DILocation(line: 217, column: 33, scope: !656)
!759 = !DILocation(line: 217, column: 19, scope: !656)
!760 = !DILocation(line: 219, column: 41, scope: !655)
!761 = !DILocation(line: 220, column: 41, scope: !655)
!762 = !DILocation(line: 222, column: 43, scope: !655)
!763 = !DILocation(line: 223, column: 41, scope: !655)
!764 = !DILocation(line: 224, column: 41, scope: !655)
!765 = !DILocation(line: 225, column: 41, scope: !655)
!766 = !DILocation(line: 226, column: 41, scope: !655)
!767 = !DILocation(line: 227, column: 41, scope: !655)
!768 = !DILocation(line: 230, column: 44, scope: !654)
!769 = !DILocation(line: 0, scope: !654)
!770 = !DILocation(line: 231, column: 43, scope: !771)
!771 = distinct !DILexicalBlock(scope: !654, file: !10, line: 231, column: 29)
!772 = !DILocalVariable(name: "c", arg: 1, scope: !773, file: !774, line: 324, type: !34)
!773 = distinct !DISubprogram(name: "c_isxdigit", scope: !774, file: !774, line: 324, type: !775, scopeLine: 325, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !777)
!774 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!775 = !DISubroutineType(types: !776)
!776 = !{!48, !34}
!777 = !{!772}
!778 = !DILocation(line: 0, scope: !773, inlinedAt: !779)
!779 = distinct !DILocation(line: 231, column: 31, scope: !771)
!780 = !DILocation(line: 326, column: 3, scope: !773, inlinedAt: !779)
!781 = !DILocation(line: 233, column: 26, scope: !654)
!782 = !DILocalVariable(name: "c", arg: 1, scope: !783, file: !10, line: 102, type: !39)
!783 = distinct !DISubprogram(name: "hextobin", scope: !10, file: !10, line: 102, type: !784, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !786)
!784 = !DISubroutineType(types: !785)
!785 = !{!34, !39}
!786 = !{!782}
!787 = !DILocation(line: 0, scope: !783, inlinedAt: !788)
!788 = distinct !DILocation(line: 234, column: 29, scope: !654)
!789 = !DILocation(line: 104, column: 3, scope: !783, inlinedAt: !788)
!790 = !DILocation(line: 106, column: 23, scope: !791, inlinedAt: !788)
!791 = distinct !DILexicalBlock(scope: !783, file: !10, line: 105, column: 5)
!792 = !DILocation(line: 106, column: 14, scope: !791, inlinedAt: !788)
!793 = !DILocation(line: 108, column: 25, scope: !791, inlinedAt: !788)
!794 = !DILocation(line: 109, column: 25, scope: !791, inlinedAt: !788)
!795 = !DILocation(line: 110, column: 25, scope: !791, inlinedAt: !788)
!796 = !DILocation(line: 111, column: 25, scope: !791, inlinedAt: !788)
!797 = !DILocation(line: 112, column: 25, scope: !791, inlinedAt: !788)
!798 = !DILocation(line: 0, scope: !791, inlinedAt: !788)
!799 = !DILocation(line: 235, column: 30, scope: !654)
!800 = !DILocation(line: 236, column: 41, scope: !801)
!801 = distinct !DILexicalBlock(scope: !654, file: !10, line: 236, column: 29)
!802 = !DILocation(line: 0, scope: !773, inlinedAt: !803)
!803 = distinct !DILocation(line: 236, column: 29, scope: !801)
!804 = !DILocation(line: 326, column: 3, scope: !773, inlinedAt: !803)
!805 = !DILocation(line: 238, column: 30, scope: !806)
!806 = distinct !DILexicalBlock(scope: !801, file: !10, line: 237, column: 27)
!807 = !DILocation(line: 239, column: 35, scope: !806)
!808 = !DILocation(line: 0, scope: !783, inlinedAt: !809)
!809 = distinct !DILocation(line: 239, column: 42, scope: !806)
!810 = !DILocation(line: 104, column: 3, scope: !783, inlinedAt: !809)
!811 = !DILocation(line: 106, column: 23, scope: !791, inlinedAt: !809)
!812 = !DILocation(line: 106, column: 14, scope: !791, inlinedAt: !809)
!813 = !DILocation(line: 108, column: 25, scope: !791, inlinedAt: !809)
!814 = !DILocation(line: 109, column: 25, scope: !791, inlinedAt: !809)
!815 = !DILocation(line: 110, column: 25, scope: !791, inlinedAt: !809)
!816 = !DILocation(line: 111, column: 25, scope: !791, inlinedAt: !809)
!817 = !DILocation(line: 112, column: 25, scope: !791, inlinedAt: !809)
!818 = !DILocation(line: 0, scope: !791, inlinedAt: !809)
!819 = !DILocation(line: 239, column: 40, scope: !806)
!820 = !DILocation(line: 240, column: 27, scope: !806)
!821 = !DILocation(line: 245, column: 37, scope: !822)
!822 = distinct !DILexicalBlock(scope: !655, file: !10, line: 245, column: 27)
!823 = !DILocation(line: 245, column: 40, scope: !822)
!824 = !DILocation(line: 247, column: 29, scope: !655)
!825 = !DILocation(line: 247, column: 23, scope: !655)
!826 = !DILocation(line: 0, scope: !656)
!827 = !DILocation(line: 251, column: 25, scope: !655)
!828 = !DILocation(line: 252, column: 34, scope: !829)
!829 = distinct !DILexicalBlock(scope: !655, file: !10, line: 252, column: 27)
!830 = !DILocation(line: 252, column: 37, scope: !829)
!831 = !DILocation(line: 254, column: 34, scope: !832)
!832 = distinct !DILexicalBlock(scope: !655, file: !10, line: 254, column: 27)
!833 = !DILocation(line: 254, column: 37, scope: !832)
!834 = !DILocation(line: 255, column: 31, scope: !832)
!835 = !DILocation(line: 255, column: 40, scope: !832)
!836 = !DILocation(line: 255, column: 43, scope: !832)
!837 = !DILocation(line: 255, column: 35, scope: !832)
!838 = !DILocation(line: 255, column: 25, scope: !832)
!839 = !DILocalVariable(name: "__c", arg: 1, scope: !840, file: !841, line: 108, type: !34)
!840 = distinct !DISubprogram(name: "putchar_unlocked", scope: !841, file: !841, line: 108, type: !842, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !844)
!841 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!842 = !DISubroutineType(types: !843)
!843 = !{!34, !34}
!844 = !{!839}
!845 = !DILocation(line: 0, scope: !840, inlinedAt: !846)
!846 = distinct !DILocation(line: 260, column: 31, scope: !655)
!847 = !DILocation(line: 110, column: 10, scope: !840, inlinedAt: !846)
!848 = !{!849, !422, i64 40}
!849 = !{!"_IO_FILE", !451, i64 0, !422, i64 8, !422, i64 16, !422, i64 24, !422, i64 32, !422, i64 40, !422, i64 48, !422, i64 56, !422, i64 64, !422, i64 72, !422, i64 80, !422, i64 88, !422, i64 96, !422, i64 104, !451, i64 112, !451, i64 116, !850, i64 120, !492, i64 128, !423, i64 130, !423, i64 131, !422, i64 136, !850, i64 144, !422, i64 152, !422, i64 160, !422, i64 168, !422, i64 176, !850, i64 184, !451, i64 192, !423, i64 196}
!850 = !{!"long", !423, i64 0}
!851 = !{!849, !422, i64 48}
!852 = !{!"branch_weights", i32 2000, i32 1}
!853 = !DILocation(line: 0, scope: !840, inlinedAt: !854)
!854 = distinct !DILocation(line: 263, column: 15, scope: !658)
!855 = !DILocation(line: 110, column: 10, scope: !840, inlinedAt: !854)
!856 = !DILocation(line: 263, column: 15, scope: !658)
!857 = distinct !{!857, !753, !858, !497}
!858 = !DILocation(line: 264, column: 13, scope: !649)
!859 = !DILocation(line: 265, column: 15, scope: !649)
!860 = !DILocation(line: 266, column: 15, scope: !649)
!861 = !DILocation(line: 267, column: 20, scope: !862)
!862 = distinct !DILexicalBlock(scope: !649, file: !10, line: 267, column: 15)
!863 = !DILocation(line: 267, column: 15, scope: !649)
!864 = !DILocation(line: 0, scope: !840, inlinedAt: !865)
!865 = distinct !DILocation(line: 268, column: 13, scope: !862)
!866 = !DILocation(line: 110, column: 10, scope: !840, inlinedAt: !865)
!867 = !DILocation(line: 276, column: 15, scope: !746)
!868 = !DILocation(line: 277, column: 15, scope: !746)
!869 = !DILocation(line: 0, scope: !840, inlinedAt: !870)
!870 = distinct !DILocation(line: 279, column: 13, scope: !748)
!871 = !DILocation(line: 110, column: 10, scope: !840, inlinedAt: !870)
!872 = !DILocation(line: 0, scope: !840, inlinedAt: !873)
!873 = distinct !DILocation(line: 284, column: 5, scope: !874)
!874 = distinct !DILexicalBlock(scope: !633, file: !10, line: 283, column: 7)
!875 = !DILocation(line: 110, column: 10, scope: !840, inlinedAt: !873)
!876 = !DILocation(line: 286, column: 1, scope: !633)
!877 = !DISubprogram(name: "bindtextdomain", scope: !439, file: !439, line: 86, type: !878, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!878 = !DISubroutineType(types: !879)
!879 = !{!32, !6, !6}
!880 = !DISubprogram(name: "textdomain", scope: !439, file: !439, line: 82, type: !625, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!881 = !DISubprogram(name: "atexit", scope: !624, file: !624, line: 602, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!882 = !DISubroutineType(types: !883)
!883 = !{!34, !172}
!884 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !130, file: !130, line: 50, type: !565, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !885)
!885 = !{!886}
!886 = !DILocalVariable(name: "file", arg: 1, scope: !884, file: !130, line: 50, type: !6)
!887 = !DILocation(line: 0, scope: !884)
!888 = !DILocation(line: 52, column: 13, scope: !884)
!889 = !DILocation(line: 53, column: 1, scope: !884)
!890 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !130, file: !130, line: 87, type: !891, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !48}
!893 = !{!894}
!894 = !DILocalVariable(name: "ignore", arg: 1, scope: !890, file: !130, line: 87, type: !48)
!895 = !DILocation(line: 0, scope: !890)
!896 = !DILocation(line: 89, column: 16, scope: !890)
!897 = !{!898, !898, i64 0}
!898 = !{!"_Bool", !423, i64 0}
!899 = !DILocation(line: 90, column: 1, scope: !890)
!900 = distinct !DISubprogram(name: "close_stdout", scope: !130, file: !130, line: 116, type: !173, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !901)
!901 = !{!902}
!902 = !DILocalVariable(name: "write_error", scope: !903, file: !130, line: 121, type: !6)
!903 = distinct !DILexicalBlock(scope: !904, file: !130, line: 120, column: 5)
!904 = distinct !DILexicalBlock(scope: !900, file: !130, line: 118, column: 7)
!905 = !DILocation(line: 118, column: 21, scope: !904)
!906 = !DILocation(line: 118, column: 7, scope: !904)
!907 = !DILocation(line: 118, column: 29, scope: !904)
!908 = !DILocation(line: 119, column: 7, scope: !904)
!909 = !DILocation(line: 119, column: 12, scope: !904)
!910 = !{i8 0, i8 2}
!911 = !DILocation(line: 119, column: 25, scope: !904)
!912 = !DILocation(line: 119, column: 28, scope: !904)
!913 = !DILocation(line: 119, column: 34, scope: !904)
!914 = !DILocation(line: 118, column: 7, scope: !900)
!915 = !DILocation(line: 121, column: 33, scope: !903)
!916 = !DILocation(line: 0, scope: !903)
!917 = !DILocation(line: 122, column: 11, scope: !918)
!918 = distinct !DILexicalBlock(scope: !903, file: !130, line: 122, column: 11)
!919 = !DILocation(line: 0, scope: !918)
!920 = !DILocation(line: 122, column: 11, scope: !903)
!921 = !DILocation(line: 123, column: 9, scope: !918)
!922 = !DILocation(line: 126, column: 9, scope: !918)
!923 = !DILocation(line: 128, column: 14, scope: !903)
!924 = !DILocation(line: 128, column: 7, scope: !903)
!925 = !DILocation(line: 133, column: 42, scope: !926)
!926 = distinct !DILexicalBlock(scope: !900, file: !130, line: 133, column: 7)
!927 = !DILocation(line: 133, column: 28, scope: !926)
!928 = !DILocation(line: 133, column: 50, scope: !926)
!929 = !DILocation(line: 133, column: 7, scope: !900)
!930 = !DILocation(line: 134, column: 12, scope: !926)
!931 = !DILocation(line: 134, column: 5, scope: !926)
!932 = !DILocation(line: 135, column: 1, scope: !900)
!933 = distinct !DISubprogram(name: "verror", scope: !137, file: !137, line: 251, type: !934, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !34, !34, !6, !145}
!936 = !{!937, !938, !939, !940}
!937 = !DILocalVariable(name: "status", arg: 1, scope: !933, file: !137, line: 251, type: !34)
!938 = !DILocalVariable(name: "errnum", arg: 2, scope: !933, file: !137, line: 251, type: !34)
!939 = !DILocalVariable(name: "message", arg: 3, scope: !933, file: !137, line: 251, type: !6)
!940 = !DILocalVariable(name: "args", arg: 4, scope: !933, file: !137, line: 251, type: !145)
!941 = !DILocation(line: 0, scope: !933)
!942 = !DILocation(line: 251, column: 1, scope: !933)
!943 = !DILocation(line: 261, column: 3, scope: !933)
!944 = !DILocation(line: 265, column: 7, scope: !945)
!945 = distinct !DILexicalBlock(scope: !933, file: !137, line: 265, column: 7)
!946 = !DILocation(line: 265, column: 7, scope: !933)
!947 = !DILocation(line: 266, column: 5, scope: !945)
!948 = !DILocation(line: 272, column: 7, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !137, line: 268, column: 5)
!950 = !DILocation(line: 276, column: 3, scope: !933)
!951 = !{i64 0, i64 8, !421, i64 8, i64 8, !421, i64 16, i64 8, !421, i64 24, i64 4, !450, i64 28, i64 4, !450}
!952 = !DILocation(line: 282, column: 1, scope: !933)
!953 = distinct !DISubprogram(name: "flush_stdout", scope: !137, file: !137, line: 163, type: !173, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !954)
!954 = !{!955}
!955 = !DILocalVariable(name: "stdout_fd", scope: !953, file: !137, line: 166, type: !34)
!956 = !DILocation(line: 0, scope: !953)
!957 = !DILocalVariable(name: "fd", arg: 1, scope: !958, file: !137, line: 145, type: !34)
!958 = distinct !DISubprogram(name: "is_open", scope: !137, file: !137, line: 145, type: !842, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !959)
!959 = !{!957}
!960 = !DILocation(line: 0, scope: !958, inlinedAt: !961)
!961 = distinct !DILocation(line: 182, column: 25, scope: !962)
!962 = distinct !DILexicalBlock(scope: !953, file: !137, line: 182, column: 7)
!963 = !DILocation(line: 157, column: 15, scope: !958, inlinedAt: !961)
!964 = !DILocation(line: 182, column: 25, scope: !962)
!965 = !DILocation(line: 182, column: 7, scope: !953)
!966 = !DILocation(line: 184, column: 5, scope: !962)
!967 = !DILocation(line: 185, column: 1, scope: !953)
!968 = distinct !DISubprogram(name: "error_tail", scope: !137, file: !137, line: 219, type: !934, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !969)
!969 = !{!970, !971, !972, !973}
!970 = !DILocalVariable(name: "status", arg: 1, scope: !968, file: !137, line: 219, type: !34)
!971 = !DILocalVariable(name: "errnum", arg: 2, scope: !968, file: !137, line: 219, type: !34)
!972 = !DILocalVariable(name: "message", arg: 3, scope: !968, file: !137, line: 219, type: !6)
!973 = !DILocalVariable(name: "args", arg: 4, scope: !968, file: !137, line: 219, type: !145)
!974 = !DILocation(line: 0, scope: !968)
!975 = !DILocation(line: 219, column: 1, scope: !968)
!976 = !DILocation(line: 229, column: 13, scope: !968)
!977 = !DILocation(line: 229, column: 3, scope: !968)
!978 = !DILocalVariable(name: "__stream", arg: 1, scope: !979, file: !980, line: 132, type: !983)
!979 = distinct !DISubprogram(name: "vfprintf", scope: !980, file: !980, line: 132, type: !981, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1018)
!980 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!981 = !DISubroutineType(types: !982)
!982 = !{!34, !983, !446, !147}
!983 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !986, file: !65, line: 51, baseType: !34, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !986, file: !65, line: 54, baseType: !32, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !986, file: !65, line: 55, baseType: !32, size: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !986, file: !65, line: 56, baseType: !32, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !986, file: !65, line: 57, baseType: !32, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !986, file: !65, line: 58, baseType: !32, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !986, file: !65, line: 59, baseType: !32, size: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !986, file: !65, line: 60, baseType: !32, size: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !986, file: !65, line: 61, baseType: !32, size: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !986, file: !65, line: 64, baseType: !32, size: 64, offset: 576)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !986, file: !65, line: 65, baseType: !32, size: 64, offset: 640)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !986, file: !65, line: 66, baseType: !32, size: 64, offset: 704)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !986, file: !65, line: 68, baseType: !80, size: 64, offset: 768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !986, file: !65, line: 70, baseType: !1002, size: 64, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !986, file: !65, line: 72, baseType: !34, size: 32, offset: 896)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !986, file: !65, line: 73, baseType: !34, size: 32, offset: 928)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !986, file: !65, line: 74, baseType: !87, size: 64, offset: 960)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !986, file: !65, line: 77, baseType: !35, size: 16, offset: 1024)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !986, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !986, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !986, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !986, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !986, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !986, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !986, file: !65, line: 93, baseType: !1002, size: 64, offset: 1344)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !986, file: !65, line: 94, baseType: !33, size: 64, offset: 1408)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !986, file: !65, line: 95, baseType: !36, size: 64, offset: 1472)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !986, file: !65, line: 96, baseType: !34, size: 32, offset: 1536)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !986, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!1018 = !{!978, !1019, !1020}
!1019 = !DILocalVariable(name: "__fmt", arg: 2, scope: !979, file: !980, line: 133, type: !446)
!1020 = !DILocalVariable(name: "__ap", arg: 3, scope: !979, file: !980, line: 133, type: !147)
!1021 = !DILocation(line: 0, scope: !979, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 229, column: 3, scope: !968)
!1023 = !DILocation(line: 135, column: 10, scope: !979, inlinedAt: !1022)
!1024 = !{!1025, !1027}
!1025 = distinct !{!1025, !1026, !"vfprintf.inline: argument 0"}
!1026 = distinct !{!1026, !"vfprintf.inline"}
!1027 = distinct !{!1027, !1026, !"vfprintf.inline: argument 1"}
!1028 = !DILocation(line: 232, column: 3, scope: !968)
!1029 = !DILocation(line: 233, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !968, file: !137, line: 233, column: 7)
!1031 = !DILocation(line: 233, column: 7, scope: !968)
!1032 = !DILocalVariable(name: "errnum", arg: 1, scope: !1033, file: !137, line: 188, type: !34)
!1033 = distinct !DISubprogram(name: "print_errno_message", scope: !137, file: !137, line: 188, type: !411, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1034)
!1034 = !{!1032, !1035, !1036}
!1035 = !DILocalVariable(name: "s", scope: !1033, file: !137, line: 190, type: !6)
!1036 = !DILocalVariable(name: "errbuf", scope: !1033, file: !137, line: 193, type: !1037)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 1024)
!1040 = !DILocation(line: 0, scope: !1033, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 234, column: 5, scope: !1030)
!1042 = !DILocation(line: 193, column: 3, scope: !1033, inlinedAt: !1041)
!1043 = !DILocation(line: 193, column: 8, scope: !1033, inlinedAt: !1041)
!1044 = !DILocation(line: 195, column: 7, scope: !1033, inlinedAt: !1041)
!1045 = !DILocation(line: 207, column: 9, scope: !1046, inlinedAt: !1041)
!1046 = distinct !DILexicalBlock(scope: !1033, file: !137, line: 207, column: 7)
!1047 = !DILocation(line: 207, column: 7, scope: !1033, inlinedAt: !1041)
!1048 = !DILocation(line: 208, column: 9, scope: !1046, inlinedAt: !1041)
!1049 = !DILocation(line: 208, column: 5, scope: !1046, inlinedAt: !1041)
!1050 = !DILocation(line: 214, column: 3, scope: !1033, inlinedAt: !1041)
!1051 = !DILocation(line: 216, column: 1, scope: !1033, inlinedAt: !1041)
!1052 = !DILocation(line: 234, column: 5, scope: !1030)
!1053 = !DILocation(line: 238, column: 3, scope: !968)
!1054 = !DILocalVariable(name: "__c", arg: 1, scope: !1055, file: !841, line: 101, type: !34)
!1055 = distinct !DISubprogram(name: "putc_unlocked", scope: !841, file: !841, line: 101, type: !1056, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!34, !34, !984}
!1058 = !{!1054, !1059}
!1059 = !DILocalVariable(name: "__stream", arg: 2, scope: !1055, file: !841, line: 101, type: !984)
!1060 = !DILocation(line: 0, scope: !1055, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 238, column: 3, scope: !968)
!1062 = !DILocation(line: 103, column: 10, scope: !1055, inlinedAt: !1061)
!1063 = !DILocation(line: 240, column: 3, scope: !968)
!1064 = !DILocation(line: 241, column: 7, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !968, file: !137, line: 241, column: 7)
!1066 = !DILocation(line: 241, column: 7, scope: !968)
!1067 = !DILocation(line: 242, column: 5, scope: !1065)
!1068 = !DILocation(line: 243, column: 1, scope: !968)
!1069 = !DISubprogram(name: "strerror_r", scope: !1070, file: !1070, line: 444, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!1070 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!32, !34, !32, !36}
!1073 = !DISubprogram(name: "fflush_unlocked", scope: !146, file: !146, line: 239, type: !1074, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!34, !984}
!1076 = !DISubprogram(name: "fcntl", scope: !1077, file: !1077, line: 149, type: !1078, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!1077 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!34, !34, !34, null}
!1080 = distinct !DISubprogram(name: "error", scope: !137, file: !137, line: 285, type: !1081, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1083)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !34, !34, !6, null}
!1083 = !{!1084, !1085, !1086, !1087}
!1084 = !DILocalVariable(name: "status", arg: 1, scope: !1080, file: !137, line: 285, type: !34)
!1085 = !DILocalVariable(name: "errnum", arg: 2, scope: !1080, file: !137, line: 285, type: !34)
!1086 = !DILocalVariable(name: "message", arg: 3, scope: !1080, file: !137, line: 285, type: !6)
!1087 = !DILocalVariable(name: "ap", scope: !1080, file: !137, line: 287, type: !145)
!1088 = !DILocation(line: 0, scope: !1080)
!1089 = !DILocation(line: 287, column: 3, scope: !1080)
!1090 = !DILocation(line: 287, column: 11, scope: !1080)
!1091 = !DILocation(line: 288, column: 3, scope: !1080)
!1092 = !DILocation(line: 289, column: 3, scope: !1080)
!1093 = !DILocation(line: 290, column: 3, scope: !1080)
!1094 = !DILocation(line: 291, column: 1, scope: !1080)
!1095 = !DILocation(line: 0, scope: !142)
!1096 = !DILocation(line: 298, column: 1, scope: !142)
!1097 = !DILocation(line: 302, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !142, file: !137, line: 302, column: 7)
!1099 = !DILocation(line: 302, column: 7, scope: !142)
!1100 = !DILocation(line: 307, column: 11, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !137, line: 307, column: 11)
!1102 = distinct !DILexicalBlock(scope: !1098, file: !137, line: 303, column: 5)
!1103 = !DILocation(line: 307, column: 27, scope: !1101)
!1104 = !DILocation(line: 308, column: 11, scope: !1101)
!1105 = !DILocation(line: 308, column: 28, scope: !1101)
!1106 = !DILocation(line: 308, column: 25, scope: !1101)
!1107 = !DILocation(line: 309, column: 15, scope: !1101)
!1108 = !DILocation(line: 309, column: 33, scope: !1101)
!1109 = !DILocation(line: 310, column: 19, scope: !1101)
!1110 = !DILocation(line: 311, column: 22, scope: !1101)
!1111 = !DILocation(line: 311, column: 56, scope: !1101)
!1112 = !DILocation(line: 307, column: 11, scope: !1102)
!1113 = !DILocation(line: 316, column: 21, scope: !1102)
!1114 = !DILocation(line: 317, column: 23, scope: !1102)
!1115 = !DILocation(line: 318, column: 5, scope: !1102)
!1116 = !DILocation(line: 327, column: 3, scope: !142)
!1117 = !DILocation(line: 331, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !142, file: !137, line: 331, column: 7)
!1119 = !DILocation(line: 331, column: 7, scope: !142)
!1120 = !DILocation(line: 332, column: 5, scope: !1118)
!1121 = !DILocation(line: 338, column: 7, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1118, file: !137, line: 334, column: 5)
!1123 = !DILocation(line: 346, column: 3, scope: !142)
!1124 = !DILocation(line: 350, column: 3, scope: !142)
!1125 = !DILocation(line: 356, column: 1, scope: !142)
!1126 = distinct !DISubprogram(name: "error_at_line", scope: !137, file: !137, line: 359, type: !1127, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1129)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !34, !34, !6, !13, !6, null}
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135}
!1130 = !DILocalVariable(name: "status", arg: 1, scope: !1126, file: !137, line: 359, type: !34)
!1131 = !DILocalVariable(name: "errnum", arg: 2, scope: !1126, file: !137, line: 359, type: !34)
!1132 = !DILocalVariable(name: "file_name", arg: 3, scope: !1126, file: !137, line: 359, type: !6)
!1133 = !DILocalVariable(name: "line_number", arg: 4, scope: !1126, file: !137, line: 360, type: !13)
!1134 = !DILocalVariable(name: "message", arg: 5, scope: !1126, file: !137, line: 360, type: !6)
!1135 = !DILocalVariable(name: "ap", scope: !1126, file: !137, line: 362, type: !145)
!1136 = !DILocation(line: 0, scope: !1126)
!1137 = !DILocation(line: 362, column: 3, scope: !1126)
!1138 = !DILocation(line: 362, column: 11, scope: !1126)
!1139 = !DILocation(line: 363, column: 3, scope: !1126)
!1140 = !DILocation(line: 364, column: 3, scope: !1126)
!1141 = !DILocation(line: 366, column: 3, scope: !1126)
!1142 = !DILocation(line: 367, column: 1, scope: !1126)
!1143 = distinct !DISubprogram(name: "getprogname", scope: !337, file: !337, line: 54, type: !1144, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !336, retainedNodes: !442)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!6}
!1146 = !DILocation(line: 58, column: 10, scope: !1143)
!1147 = !DILocation(line: 58, column: 3, scope: !1143)
!1148 = distinct !DISubprogram(name: "set_program_name", scope: !178, file: !178, line: 37, type: !565, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !177, retainedNodes: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DILocalVariable(name: "argv0", arg: 1, scope: !1148, file: !178, line: 37, type: !6)
!1151 = !DILocalVariable(name: "slash", scope: !1148, file: !178, line: 44, type: !6)
!1152 = !DILocalVariable(name: "base", scope: !1148, file: !178, line: 45, type: !6)
!1153 = !DILocation(line: 0, scope: !1148)
!1154 = !DILocation(line: 44, column: 23, scope: !1148)
!1155 = !DILocation(line: 45, column: 22, scope: !1148)
!1156 = !DILocation(line: 46, column: 17, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1148, file: !178, line: 46, column: 7)
!1158 = !DILocation(line: 46, column: 9, scope: !1157)
!1159 = !DILocation(line: 46, column: 25, scope: !1157)
!1160 = !DILocation(line: 46, column: 40, scope: !1157)
!1161 = !DILocalVariable(name: "__s1", arg: 1, scope: !1162, file: !463, line: 974, type: !631)
!1162 = distinct !DISubprogram(name: "memeq", scope: !463, file: !463, line: 974, type: !1163, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !177, retainedNodes: !1165)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!48, !631, !631, !36}
!1165 = !{!1161, !1166, !1167}
!1166 = !DILocalVariable(name: "__s2", arg: 2, scope: !1162, file: !463, line: 974, type: !631)
!1167 = !DILocalVariable(name: "__n", arg: 3, scope: !1162, file: !463, line: 974, type: !36)
!1168 = !DILocation(line: 0, scope: !1162, inlinedAt: !1169)
!1169 = distinct !DILocation(line: 46, column: 28, scope: !1157)
!1170 = !DILocation(line: 976, column: 11, scope: !1162, inlinedAt: !1169)
!1171 = !DILocation(line: 976, column: 10, scope: !1162, inlinedAt: !1169)
!1172 = !DILocation(line: 46, column: 7, scope: !1148)
!1173 = !DILocation(line: 49, column: 11, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !178, line: 49, column: 11)
!1175 = distinct !DILexicalBlock(scope: !1157, file: !178, line: 47, column: 5)
!1176 = !DILocation(line: 49, column: 36, scope: !1174)
!1177 = !DILocation(line: 49, column: 11, scope: !1175)
!1178 = !DILocation(line: 65, column: 16, scope: !1148)
!1179 = !DILocation(line: 71, column: 27, scope: !1148)
!1180 = !DILocation(line: 74, column: 33, scope: !1148)
!1181 = !DILocation(line: 76, column: 1, scope: !1148)
!1182 = !DILocation(line: 0, scope: !183)
!1183 = !DILocation(line: 40, column: 29, scope: !183)
!1184 = !DILocation(line: 41, column: 19, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !183, file: !184, line: 41, column: 7)
!1186 = !DILocation(line: 41, column: 7, scope: !183)
!1187 = !DILocation(line: 47, column: 3, scope: !183)
!1188 = !DILocation(line: 48, column: 3, scope: !183)
!1189 = !DILocation(line: 48, column: 13, scope: !183)
!1190 = !DILocalVariable(name: "ps", arg: 1, scope: !1191, file: !1192, line: 1135, type: !1195)
!1191 = distinct !DISubprogram(name: "mbszero", scope: !1192, file: !1192, line: 1135, type: !1193, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !187, retainedNodes: !1196)
!1192 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1193 = !DISubroutineType(types: !1194)
!1194 = !{null, !1195}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!1196 = !{!1190}
!1197 = !DILocation(line: 0, scope: !1191, inlinedAt: !1198)
!1198 = distinct !DILocation(line: 48, column: 18, scope: !183)
!1199 = !DILocalVariable(name: "__dest", arg: 1, scope: !1200, file: !1201, line: 57, type: !33)
!1200 = distinct !DISubprogram(name: "memset", scope: !1201, file: !1201, line: 57, type: !1202, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !187, retainedNodes: !1204)
!1201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!33, !33, !34, !36}
!1204 = !{!1199, !1205, !1206}
!1205 = !DILocalVariable(name: "__ch", arg: 2, scope: !1200, file: !1201, line: 57, type: !34)
!1206 = !DILocalVariable(name: "__len", arg: 3, scope: !1200, file: !1201, line: 57, type: !36)
!1207 = !DILocation(line: 0, scope: !1200, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 1137, column: 3, scope: !1191, inlinedAt: !1198)
!1209 = !DILocation(line: 59, column: 10, scope: !1200, inlinedAt: !1208)
!1210 = !DILocation(line: 49, column: 7, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !183, file: !184, line: 49, column: 7)
!1212 = !DILocation(line: 49, column: 39, scope: !1211)
!1213 = !DILocation(line: 49, column: 44, scope: !1211)
!1214 = !DILocation(line: 54, column: 1, scope: !183)
!1215 = !DISubprogram(name: "mbrtoc32", scope: !195, file: !195, line: 57, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !442)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!36, !1218, !446, !36, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1195)
!1221 = distinct !DISubprogram(name: "clone_quoting_options", scope: !220, file: !220, line: 113, type: !1222, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !1225)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1224, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!1225 = !{!1226, !1227, !1228}
!1226 = !DILocalVariable(name: "o", arg: 1, scope: !1221, file: !220, line: 113, type: !1224)
!1227 = !DILocalVariable(name: "saved_errno", scope: !1221, file: !220, line: 115, type: !34)
!1228 = !DILocalVariable(name: "p", scope: !1221, file: !220, line: 116, type: !1224)
!1229 = !DILocation(line: 0, scope: !1221)
!1230 = !DILocation(line: 115, column: 21, scope: !1221)
!1231 = !DILocation(line: 116, column: 40, scope: !1221)
!1232 = !DILocation(line: 116, column: 31, scope: !1221)
!1233 = !DILocation(line: 118, column: 9, scope: !1221)
!1234 = !DILocation(line: 119, column: 3, scope: !1221)
!1235 = distinct !DISubprogram(name: "get_quoting_style", scope: !220, file: !220, line: 124, type: !1236, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !1240)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!222, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!1240 = !{!1241}
