; ModuleID = 'src/expand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbbuf_t = type { i8*, %struct._IO_FILE*, i64, i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"expand\00", align 1
@.str.4 = private unnamed_addr constant [63 x i8] c"  -i, --initial\0A         do not convert tabs after non blanks\0A\00", align 1

!3 = !DIFile(filename: "src/expand.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c80215ff64ab09027a1b86db960a2307")
!4 = !{!5, !21, !25, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 127, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!23 = !{!24}
!24 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 131, baseType: !7, size: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 130, baseType: !7, size: 32, elements: !29)
!29 = !{!30}
!30 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!31 = !{!32, !34, !35, !36, !37, !40, !42, !43}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!39 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!44 = !{!45, !0, !131, !145}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !47, file: !48, line: 575, type: !35, isLocal: true, isDefinition: true)
!47 = distinct !DISubprogram(name: "oputs_", scope: !48, file: !48, line: 573, type: !49, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !51)
!48 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!49 = !DISubroutineType(types: !50)
!50 = !{null, !40, !40}
!51 = !{!52, !53, !54, !57, !58, !59, !60, !64, !65, !66, !67, !69, !125, !126, !127, !129, !130}
!52 = !DILocalVariable(name: "program", arg: 1, scope: !47, file: !48, line: 573, type: !40)
!53 = !DILocalVariable(name: "option", arg: 2, scope: !47, file: !48, line: 573, type: !40)
!54 = !DILocalVariable(name: "term", scope: !55, file: !48, line: 585, type: !40)
!55 = distinct !DILexicalBlock(scope: !56, file: !48, line: 582, column: 5)
!56 = distinct !DILexicalBlock(scope: !47, file: !48, line: 581, column: 7)
!57 = !DILocalVariable(name: "double_space", scope: !47, file: !48, line: 594, type: !43)
!58 = !DILocalVariable(name: "first_word", scope: !47, file: !48, line: 595, type: !40)
!59 = !DILocalVariable(name: "option_text", scope: !47, file: !48, line: 596, type: !40)
!60 = !DILocalVariable(name: "s", scope: !61, file: !48, line: 608, type: !40)
!61 = distinct !DILexicalBlock(scope: !62, file: !48, line: 605, column: 5)
!62 = distinct !DILexicalBlock(scope: !63, file: !48, line: 604, column: 12)
!63 = distinct !DILexicalBlock(scope: !47, file: !48, line: 597, column: 7)
!64 = !DILocalVariable(name: "spaces", scope: !61, file: !48, line: 609, type: !37)
!65 = !DILocalVariable(name: "anchor_len", scope: !47, file: !48, line: 620, type: !37)
!66 = !DILocalVariable(name: "desc_text", scope: !47, file: !48, line: 625, type: !40)
!67 = !DILocalVariable(name: "__ptr", scope: !68, file: !48, line: 644, type: !40)
!68 = distinct !DILexicalBlock(scope: !47, file: !48, line: 644, column: 3)
!69 = !DILocalVariable(name: "__stream", scope: !68, file: !48, line: 644, type: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !72, line: 7, baseType: !73)
!72 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !74, line: 49, size: 1728, elements: !75)
!74 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !91, !93, !94, !95, !99, !100, !102, !106, !109, !111, !114, !117, !118, !119, !120, !121}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !73, file: !74, line: 51, baseType: !35, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !73, file: !74, line: 54, baseType: !32, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !73, file: !74, line: 55, baseType: !32, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !73, file: !74, line: 56, baseType: !32, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !73, file: !74, line: 57, baseType: !32, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !73, file: !74, line: 58, baseType: !32, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !73, file: !74, line: 59, baseType: !32, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !73, file: !74, line: 60, baseType: !32, size: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !73, file: !74, line: 61, baseType: !32, size: 64, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !73, file: !74, line: 64, baseType: !32, size: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !73, file: !74, line: 65, baseType: !32, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !73, file: !74, line: 66, baseType: !32, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !73, file: !74, line: 68, baseType: !89, size: 64, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !74, line: 36, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !73, file: !74, line: 70, baseType: !92, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !73, file: !74, line: 72, baseType: !35, size: 32, offset: 896)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !73, file: !74, line: 73, baseType: !35, size: 32, offset: 928)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !73, file: !74, line: 74, baseType: !96, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !98)
!97 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!98 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !73, file: !74, line: 77, baseType: !36, size: 16, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !73, file: !74, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !73, file: !74, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !73, file: !74, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !74, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !73, file: !74, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !98)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !73, file: !74, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !74, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !73, file: !74, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !74, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !73, file: !74, line: 93, baseType: !92, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !73, file: !74, line: 94, baseType: !34, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !73, file: !74, line: 95, baseType: !37, size: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !73, file: !74, line: 96, baseType: !35, size: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !73, file: !74, line: 98, baseType: !122, size: 160, offset: 1568)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 20)
!125 = !DILocalVariable(name: "__cnt", scope: !68, file: !48, line: 644, type: !37)
!126 = !DILocalVariable(name: "url_program", scope: !47, file: !48, line: 648, type: !40)
!127 = !DILocalVariable(name: "__ptr", scope: !128, file: !48, line: 686, type: !40)
!128 = distinct !DILexicalBlock(scope: !47, file: !48, line: 686, column: 3)
!129 = !DILocalVariable(name: "__stream", scope: !128, file: !48, line: 686, type: !70)
!130 = !DILocalVariable(name: "__cnt", scope: !128, file: !48, line: 686, type: !37)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 54, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1280, elements: !143)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !136, line: 50, size: 256, elements: !137)
!136 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!137 = !{!138, !139, !140, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !136, line: 52, baseType: !40, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !135, file: !136, line: 55, baseType: !35, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !135, file: !136, line: 56, baseType: !141, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !135, file: !136, line: 57, baseType: !35, size: 32, offset: 192)
!143 = !{!144}
!144 = !DISubrange(count: 5)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "line_in", scope: !147, file: !3, line: 110, type: !199, isLocal: true, isDefinition: true)
!147 = distinct !DISubprogram(name: "expand", scope: !3, file: !3, line: 102, type: !148, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{null}
!150 = !{!151, !152, !165, !177, !178, !184, !185, !191, !192, !195, !197, !198}
!151 = !DILocalVariable(name: "fp", scope: !147, file: !3, line: 105, type: !70)
!152 = !DILocalVariable(name: "mbbuf", scope: !147, file: !3, line: 111, type: !153)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !154, line: 50, baseType: !155)
!154 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 43, size: 320, elements: !156)
!156 = !{!157, !158, !159, !163, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !155, file: !154, line: 45, baseType: !32, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !155, file: !154, line: 46, baseType: !70, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !154, line: 47, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !161, line: 130, baseType: !162)
!161 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !38, line: 35, baseType: !98)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !155, file: !154, line: 48, baseType: !160, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !155, file: !154, line: 49, baseType: !160, size: 64, offset: 256)
!165 = !DILocalVariable(name: "g", scope: !166, file: !3, line: 117, type: !167)
!166 = distinct !DILexicalBlock(scope: !147, file: !3, line: 115, column: 5)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !22, line: 143, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 138, size: 64, elements: !169)
!169 = !{!170, !175, !176}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !168, file: !22, line: 140, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !172, line: 37, baseType: !173)
!172 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !97, line: 57, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !97, line: 42, baseType: !7)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !168, file: !22, line: 141, baseType: !42, size: 8, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !168, file: !22, line: 142, baseType: !42, size: 8, offset: 40)
!177 = !DILocalVariable(name: "convert", scope: !166, file: !3, line: 120, type: !43)
!178 = !DILocalVariable(name: "column", scope: !166, file: !3, line: 127, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !180, line: 20, baseType: !181)
!180 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !182, line: 101, baseType: !183)
!182 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !97, line: 72, baseType: !98)
!184 = !DILocalVariable(name: "tab_index", scope: !166, file: !3, line: 130, type: !160)
!185 = !DILocalVariable(name: "last_tab", scope: !186, file: !3, line: 148, type: !43)
!186 = distinct !DILexicalBlock(scope: !187, file: !3, line: 146, column: 17)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 145, column: 19)
!188 = distinct !DILexicalBlock(scope: !189, file: !3, line: 142, column: 13)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 141, column: 15)
!190 = distinct !DILexicalBlock(scope: !166, file: !3, line: 136, column: 9)
!191 = !DILocalVariable(name: "next_tab_column", scope: !186, file: !3, line: 149, type: !179)
!192 = !DILocalVariable(name: "width", scope: !193, file: !3, line: 170, type: !35)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 169, column: 17)
!194 = distinct !DILexicalBlock(scope: !187, file: !3, line: 161, column: 24)
!195 = !DILocalVariable(name: "__ptr", scope: !196, file: !3, line: 180, type: !40)
!196 = distinct !DILexicalBlock(scope: !190, file: !3, line: 180, column: 11)
!197 = !DILocalVariable(name: "__stream", scope: !196, file: !3, line: 180, type: !70)
!198 = !DILocalVariable(name: "__cnt", scope: !196, file: !3, line: 180, type: !37)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2097152, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 262144)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 272, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 34)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !207, file: !208, line: 30, type: !43, isLocal: false, isDefinition: true)
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, retainedTypes: !233, globals: !234, splitDebugInlining: false, nameTableKind: None)
!208 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!209 = !{!5, !210, !224}
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !211, line: 42, baseType: !7, size: 32, elements: !212)
!211 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!213 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!214 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!215 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!216 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!217 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!218 = !DIEnumerator(name: "c_quoting_style", value: 5)
!219 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!220 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!221 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!222 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!223 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !225, line: 44, baseType: !7, size: 32, elements: !226)
!225 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!228 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!229 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!230 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!231 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!232 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!233 = !{!35, !36, !43, !98, !39, !34, !37, !40, !42}
!234 = !{!205, !235, !237, !282, !284, !286, !289, !291, !293, !295, !297, !299, !304, !307}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "exit_status", scope: !207, file: !208, line: 69, type: !35, isLocal: false, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "prev_file", scope: !239, file: !208, line: 351, type: !32, isLocal: true, isDefinition: true)
!239 = distinct !DISubprogram(name: "next_file", scope: !208, file: !208, line: 349, type: !240, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !207, retainedNodes: !276)
!240 = !DISubroutineType(types: !241)
!241 = !{!242, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !72, line: 7, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !74, line: 49, size: 1728, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !244, file: !74, line: 51, baseType: !35, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !244, file: !74, line: 54, baseType: !32, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !244, file: !74, line: 55, baseType: !32, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !244, file: !74, line: 56, baseType: !32, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !244, file: !74, line: 57, baseType: !32, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !244, file: !74, line: 58, baseType: !32, size: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !244, file: !74, line: 59, baseType: !32, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !244, file: !74, line: 60, baseType: !32, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !244, file: !74, line: 61, baseType: !32, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !244, file: !74, line: 64, baseType: !32, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !244, file: !74, line: 65, baseType: !32, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !244, file: !74, line: 66, baseType: !32, size: 64, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !244, file: !74, line: 68, baseType: !89, size: 64, offset: 768)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !244, file: !74, line: 70, baseType: !260, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !244, file: !74, line: 72, baseType: !35, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !244, file: !74, line: 73, baseType: !35, size: 32, offset: 928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !244, file: !74, line: 74, baseType: !96, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !244, file: !74, line: 77, baseType: !36, size: 16, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !244, file: !74, line: 78, baseType: !101, size: 8, offset: 1040)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !244, file: !74, line: 79, baseType: !103, size: 8, offset: 1048)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !244, file: !74, line: 81, baseType: !107, size: 64, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !244, file: !74, line: 89, baseType: !110, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !244, file: !74, line: 91, baseType: !112, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !244, file: !74, line: 92, baseType: !115, size: 64, offset: 1280)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !244, file: !74, line: 93, baseType: !260, size: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !244, file: !74, line: 94, baseType: !34, size: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !244, file: !74, line: 95, baseType: !37, size: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !244, file: !74, line: 96, baseType: !35, size: 32, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !244, file: !74, line: 98, baseType: !122, size: 160, offset: 1568)
!276 = !{!277, !278, !279}
!277 = !DILocalVariable(name: "fp", arg: 1, scope: !239, file: !208, line: 349, type: !242)
!278 = !DILocalVariable(name: "file", scope: !239, file: !208, line: 352, type: !32)
!279 = !DILocalVariable(name: "err", scope: !280, file: !208, line: 356, type: !35)
!280 = distinct !DILexicalBlock(scope: !281, file: !208, line: 355, column: 5)
!281 = distinct !DILexicalBlock(scope: !239, file: !208, line: 354, column: 7)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "max_column_width", scope: !207, file: !208, line: 42, type: !160, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !207, file: !208, line: 54, type: !160, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "tab_list", scope: !207, file: !208, line: 47, type: !288, isLocal: true, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !207, file: !208, line: 50, type: !160, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "extend_size", scope: !207, file: !208, line: 36, type: !179, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "increment_size", scope: !207, file: !208, line: 39, type: !179, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "tab_size", scope: !207, file: !208, line: 33, type: !179, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !207, file: !208, line: 66, type: !43, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !207, file: !208, line: 60, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 2)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "file_list", scope: !207, file: !208, line: 57, type: !306, isLocal: true, isDefinition: true)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !309, file: !48, line: 575, type: !35, isLocal: true, isDefinition: true)
!309 = distinct !DISubprogram(name: "oputs_", scope: !48, file: !48, line: 573, type: !49, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !207, retainedNodes: !310)
!310 = !{!311, !312, !313, !316, !317, !318, !319, !323, !324, !325, !326, !328, !329, !330, !331, !333, !334}
!311 = !DILocalVariable(name: "program", arg: 1, scope: !309, file: !48, line: 573, type: !40)
!312 = !DILocalVariable(name: "option", arg: 2, scope: !309, file: !48, line: 573, type: !40)
!313 = !DILocalVariable(name: "term", scope: !314, file: !48, line: 585, type: !40)
!314 = distinct !DILexicalBlock(scope: !315, file: !48, line: 582, column: 5)
!315 = distinct !DILexicalBlock(scope: !309, file: !48, line: 581, column: 7)
!316 = !DILocalVariable(name: "double_space", scope: !309, file: !48, line: 594, type: !43)
!317 = !DILocalVariable(name: "first_word", scope: !309, file: !48, line: 595, type: !40)
!318 = !DILocalVariable(name: "option_text", scope: !309, file: !48, line: 596, type: !40)
!319 = !DILocalVariable(name: "s", scope: !320, file: !48, line: 608, type: !40)
!320 = distinct !DILexicalBlock(scope: !321, file: !48, line: 605, column: 5)
!321 = distinct !DILexicalBlock(scope: !322, file: !48, line: 604, column: 12)
!322 = distinct !DILexicalBlock(scope: !309, file: !48, line: 597, column: 7)
!323 = !DILocalVariable(name: "spaces", scope: !320, file: !48, line: 609, type: !37)
!324 = !DILocalVariable(name: "anchor_len", scope: !309, file: !48, line: 620, type: !37)
!325 = !DILocalVariable(name: "desc_text", scope: !309, file: !48, line: 625, type: !40)
!326 = !DILocalVariable(name: "__ptr", scope: !327, file: !48, line: 644, type: !40)
!327 = distinct !DILexicalBlock(scope: !309, file: !48, line: 644, column: 3)
!328 = !DILocalVariable(name: "__stream", scope: !327, file: !48, line: 644, type: !242)
!329 = !DILocalVariable(name: "__cnt", scope: !327, file: !48, line: 644, type: !37)
!330 = !DILocalVariable(name: "url_program", scope: !309, file: !48, line: 648, type: !40)
!331 = !DILocalVariable(name: "__ptr", scope: !332, file: !48, line: 686, type: !40)
!332 = distinct !DILexicalBlock(scope: !309, file: !48, line: 686, column: 3)
!333 = !DILocalVariable(name: "__stream", scope: !332, file: !48, line: 686, type: !242)
!334 = !DILocalVariable(name: "__cnt", scope: !332, file: !48, line: 686, type: !37)
!335 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "Version", scope: !338, file: !339, line: 3, type: !40, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !340, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!340 = !{!336}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "file_name", scope: !343, file: !344, line: 45, type: !40, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !345, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!345 = !{!341, !346}
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !343, file: !344, line: 55, type: !43, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !350, file: !351, line: 66, type: !386, isLocal: false, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!352 = !{!34, !42}
!353 = !{!354, !380, !348, !382, !384}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "old_file_name", scope: !356, file: !351, line: 304, type: !40, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "verror_at_line", scope: !351, file: !351, line: 298, type: !357, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !373)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !35, !35, !40, !7, !40, !359}
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !360, line: 52, baseType: !361)
!360 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !362, line: 32, baseType: !363)
!362 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !364, baseType: !365)
!364 = !DIFile(filename: "lib/error.c", directory: "/src")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !366, size: 256, elements: !367)
!366 = !DINamespace(name: "std", scope: null)
!367 = !{!368, !369, !370, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !365, file: !364, baseType: !34, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !365, file: !364, baseType: !34, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !365, file: !364, baseType: !34, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !365, file: !364, baseType: !35, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !365, file: !364, baseType: !35, size: 32, offset: 224)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DILocalVariable(name: "status", arg: 1, scope: !356, file: !351, line: 298, type: !35)
!375 = !DILocalVariable(name: "errnum", arg: 2, scope: !356, file: !351, line: 298, type: !35)
!376 = !DILocalVariable(name: "file_name", arg: 3, scope: !356, file: !351, line: 298, type: !40)
!377 = !DILocalVariable(name: "line_number", arg: 4, scope: !356, file: !351, line: 298, type: !7)
!378 = !DILocalVariable(name: "message", arg: 5, scope: !356, file: !351, line: 298, type: !40)
!379 = !DILocalVariable(name: "args", arg: 6, scope: !356, file: !351, line: 298, type: !359)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "old_line_number", scope: !356, file: !351, line: 305, type: !7, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "error_message_count", scope: !350, file: !351, line: 69, type: !7, isLocal: false, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !350, file: !351, line: 295, type: !35, isLocal: false, isDefinition: true)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "program_name", scope: !389, file: !390, line: 31, type: !40, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !391, globals: !392, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!391 = !{!32}
!392 = !{!387}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "utf07FF", scope: !395, file: !396, line: 46, type: !422, isLocal: true, isDefinition: true)
!395 = distinct !DISubprogram(name: "proper_name_lite", scope: !396, file: !396, line: 38, type: !397, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !401)
!396 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!397 = !DISubroutineType(types: !398)
!398 = !{!40, !40, !40}
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !400, splitDebugInlining: false, nameTableKind: None)
!400 = !{!393}
!401 = !{!402, !403, !404, !405, !406}
!402 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !395, file: !396, line: 38, type: !40)
!403 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !395, file: !396, line: 38, type: !40)
!404 = !DILocalVariable(name: "translation", scope: !395, file: !396, line: 40, type: !40)
!405 = !DILocalVariable(name: "w", scope: !395, file: !396, line: 47, type: !171)
!406 = !DILocalVariable(name: "mbs", scope: !395, file: !396, line: 48, type: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !408, line: 6, baseType: !409)
!408 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !410, line: 21, baseType: !411)
!410 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !411, file: !410, line: 15, baseType: !35, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !411, file: !410, line: 20, baseType: !415, size: 32, offset: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !411, file: !410, line: 16, size: 32, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !415, file: !410, line: 18, baseType: !7, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !415, file: !410, line: 19, baseType: !419, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 4)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 16, elements: !302)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !425, file: !426, line: 76, type: !494, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !433, globals: !434, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!427 = !{!210, !428, !5}
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !211, line: 254, baseType: !7, size: 32, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!431 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!432 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!433 = !{!35, !36, !37}
!434 = !{!423, !435, !441, !453, !455, !460, !483, !490, !492}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !425, file: !426, line: 92, type: !437, isLocal: false, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 320, elements: !439)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!439 = !{!440}
!440 = !DISubrange(count: 10)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !425, file: !426, line: 1040, type: !443, isLocal: false, isDefinition: true)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !426, line: 56, size: 448, elements: !444)
!444 = !{!445, !446, !447, !451, !452}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !443, file: !426, line: 59, baseType: !210, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !426, line: 62, baseType: !35, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !443, file: !426, line: 66, baseType: !448, size: 256, offset: 64)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !443, file: !426, line: 69, baseType: !40, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !443, file: !426, line: 72, baseType: !40, size: 64, offset: 384)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !425, file: !426, line: 107, type: !443, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "slot0", scope: !425, file: !426, line: 831, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 256)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "quote", scope: !462, file: !426, line: 228, type: !481, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "gettext_quote", scope: !426, file: !426, line: 197, type: !463, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !425, retainedNodes: !465)
!463 = !DISubroutineType(types: !464)
!464 = !{!40, !40, !210}
!465 = !{!466, !467, !468, !469, !470}
!466 = !DILocalVariable(name: "msgid", arg: 1, scope: !462, file: !426, line: 197, type: !40)
!467 = !DILocalVariable(name: "s", arg: 2, scope: !462, file: !426, line: 197, type: !210)
!468 = !DILocalVariable(name: "translation", scope: !462, file: !426, line: 199, type: !40)
!469 = !DILocalVariable(name: "w", scope: !462, file: !426, line: 229, type: !171)
!470 = !DILocalVariable(name: "mbs", scope: !462, file: !426, line: 230, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !408, line: 6, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !410, line: 21, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !473, file: !410, line: 15, baseType: !35, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !473, file: !410, line: 20, baseType: !477, size: 32, offset: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !473, file: !410, line: 16, size: 32, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !477, file: !410, line: 18, baseType: !7, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !477, file: !410, line: 19, baseType: !419, size: 32)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !482)
!482 = !{!303, !421}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "slotvec", scope: !425, file: !426, line: 834, type: !485, isLocal: true, isDefinition: true)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !426, line: 823, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !426, line: 825, baseType: !37, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !486, file: !426, line: 826, baseType: !32, size: 64, offset: 64)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "nslots", scope: !425, file: !426, line: 832, type: !35, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "slotvec0", scope: !425, file: !426, line: 833, type: !486, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 704, elements: !496)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!496 = !{!497}
!497 = !DISubrange(count: 11)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !500, file: !501, line: 26, type: !503, isLocal: false, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !502, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!502 = !{!498}
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 376, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 47)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "exit_failure", scope: !508, file: !509, line: 24, type: !511, isLocal: false, isDefinition: true)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!510 = !{!506}
!511 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "internal_state", scope: !514, file: !515, line: 97, type: !518, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !516, globals: !517, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!516 = !{!34, !37, !42}
!517 = !{!512}
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !408, line: 6, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !410, line: 21, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !520, file: !410, line: 15, baseType: !35, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !520, file: !410, line: 20, baseType: !524, size: 32, offset: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !410, line: 16, size: 32, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !524, file: !410, line: 18, baseType: !7, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !524, file: !410, line: 19, baseType: !419, size: 32)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!530 = !{!224}
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!535 = !{!34}
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !544, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!544 = !{!545}
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !543, line: 40, baseType: !7, size: 32, elements: !546)
!546 = !{!547}
!547 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !550, retainedTypes: !578, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!550 = !{!551, !563}
!551 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !552, file: !549, line: 188, baseType: !7, size: 32, elements: !561)
!552 = distinct !DISubprogram(name: "x2nrealloc", scope: !549, file: !549, line: 176, type: !553, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !548, retainedNodes: !556)
!553 = !DISubroutineType(types: !554)
!554 = !{!34, !34, !555, !37}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!556 = !{!557, !558, !559, !560}
!557 = !DILocalVariable(name: "p", arg: 1, scope: !552, file: !549, line: 176, type: !34)
!558 = !DILocalVariable(name: "pn", arg: 2, scope: !552, file: !549, line: 176, type: !555)
!559 = !DILocalVariable(name: "s", arg: 3, scope: !552, file: !549, line: 176, type: !37)
!560 = !DILocalVariable(name: "n", scope: !552, file: !549, line: 178, type: !37)
!561 = !{!562}
!562 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !564, file: !549, line: 228, baseType: !7, size: 32, elements: !561)
!564 = distinct !DISubprogram(name: "xpalloc", scope: !549, file: !549, line: 223, type: !565, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !548, retainedNodes: !568)
!565 = !DISubroutineType(types: !566)
!566 = !{!34, !34, !567, !160, !162, !160}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577}
!569 = !DILocalVariable(name: "pa", arg: 1, scope: !564, file: !549, line: 223, type: !34)
!570 = !DILocalVariable(name: "pn", arg: 2, scope: !564, file: !549, line: 223, type: !567)
!571 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !564, file: !549, line: 223, type: !160)
!572 = !DILocalVariable(name: "n_max", arg: 4, scope: !564, file: !549, line: 223, type: !162)
!573 = !DILocalVariable(name: "s", arg: 5, scope: !564, file: !549, line: 223, type: !160)
!574 = !DILocalVariable(name: "n0", scope: !564, file: !549, line: 230, type: !160)
!575 = !DILocalVariable(name: "n", scope: !564, file: !549, line: 237, type: !160)
!576 = !DILocalVariable(name: "nbytes", scope: !564, file: !549, line: 248, type: !160)
!577 = !DILocalVariable(name: "adjusted_nbytes", scope: !564, file: !549, line: 252, type: !160)
!578 = !{!32, !34, !43, !98, !39}
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !587, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!587 = !{!43, !39, !34}
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !535, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!594 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!595 = !{i32 7, !"Dwarf Version", i32 5}
!596 = !{i32 2, !"Debug Info Version", i32 3}
!597 = !{i32 1, !"wchar_size", i32 4}
!598 = !{i32 1, !"branch-target-enforcement", i32 0}
!599 = !{i32 1, !"sign-return-address", i32 0}
!600 = !{i32 1, !"sign-return-address-all", i32 0}
!601 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!602 = !{i32 7, !"PIC Level", i32 2}
!603 = !{i32 7, !"PIE Level", i32 2}
!604 = !{i32 7, !"uwtable", i32 1}
!605 = !{i32 7, !"frame-pointer", i32 1}
!606 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 64, type: !607, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !35}
!609 = !{!610}
!610 = !DILocalVariable(name: "status", arg: 1, scope: !606, file: !3, line: 64, type: !35)
!611 = !DILocation(line: 0, scope: !606)
!612 = !DILocation(line: 66, column: 14, scope: !613)
!613 = distinct !DILexicalBlock(scope: !606, file: !3, line: 66, column: 7)
!614 = !DILocation(line: 66, column: 7, scope: !606)
!615 = !DILocation(line: 67, column: 5, scope: !616)
!616 = distinct !DILexicalBlock(scope: !613, file: !3, line: 67, column: 5)
!617 = !{!618, !618, i64 0}
!618 = !{!"any pointer", !619, i64 0}
!619 = !{!"omnipotent char", !620, i64 0}
!620 = !{!"Simple C/C++ TBAA"}
!621 = !DILocation(line: 70, column: 7, scope: !622)
!622 = distinct !DILexicalBlock(scope: !613, file: !3, line: 69, column: 5)
!623 = !DILocation(line: 74, column: 7, scope: !622)
!624 = !DILocation(line: 729, column: 3, scope: !625, inlinedAt: !627)
!625 = distinct !DISubprogram(name: "emit_stdin_note", scope: !48, file: !48, line: 727, type: !148, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!626 = !{}
!627 = distinct !DILocation(line: 78, column: 7, scope: !622)
!628 = !DILocation(line: 736, column: 3, scope: !629, inlinedAt: !630)
!629 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !48, file: !48, line: 734, type: !148, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!630 = distinct !DILocation(line: 79, column: 7, scope: !622)
!631 = !DILocation(line: 81, column: 7, scope: !622)
!632 = !DILocation(line: 85, column: 7, scope: !622)
!633 = !DILocation(line: 89, column: 7, scope: !622)
!634 = !DILocation(line: 90, column: 7, scope: !622)
!635 = !DILocation(line: 91, column: 7, scope: !622)
!636 = !DILocalVariable(name: "program", arg: 1, scope: !637, file: !48, line: 836, type: !40)
!637 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !48, file: !48, line: 836, type: !638, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !640)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !40}
!640 = !{!636, !641, !650, !651, !653, !654}
!641 = !DILocalVariable(name: "infomap", scope: !637, file: !48, line: 838, type: !642)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 896, elements: !648)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !637, file: !48, line: 838, size: 128, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !644, file: !48, line: 838, baseType: !40, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !644, file: !48, line: 838, baseType: !40, size: 64, offset: 64)
!648 = !{!649}
!649 = !DISubrange(count: 7)
!650 = !DILocalVariable(name: "node", scope: !637, file: !48, line: 848, type: !40)
!651 = !DILocalVariable(name: "map_prog", scope: !637, file: !48, line: 849, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!653 = !DILocalVariable(name: "lc_messages", scope: !637, file: !48, line: 861, type: !40)
!654 = !DILocalVariable(name: "url_program", scope: !637, file: !48, line: 874, type: !40)
!655 = !DILocation(line: 0, scope: !637, inlinedAt: !656)
!656 = distinct !DILocation(line: 92, column: 7, scope: !622)
!657 = !DILocation(line: 838, column: 3, scope: !637, inlinedAt: !656)
!658 = !DILocation(line: 838, column: 67, scope: !637, inlinedAt: !656)
!659 = !DILocation(line: 849, column: 36, scope: !637, inlinedAt: !656)
!660 = !DILocation(line: 851, column: 3, scope: !637, inlinedAt: !656)
!661 = !DILocalVariable(name: "__s1", arg: 1, scope: !662, file: !663, line: 1359, type: !40)
!662 = distinct !DISubprogram(name: "streq", scope: !663, file: !663, line: 1359, type: !664, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !666)
!663 = !DIFile(filename: "./lib/string.h", directory: "/src")
!664 = !DISubroutineType(types: !665)
!665 = !{!43, !40, !40}
!666 = !{!661, !667}
!667 = !DILocalVariable(name: "__s2", arg: 2, scope: !662, file: !663, line: 1359, type: !40)
!668 = !DILocation(line: 0, scope: !662, inlinedAt: !669)
!669 = distinct !DILocation(line: 851, column: 33, scope: !637, inlinedAt: !656)
!670 = !DILocation(line: 1361, column: 11, scope: !662, inlinedAt: !669)
!671 = !DILocation(line: 1361, column: 10, scope: !662, inlinedAt: !669)
!672 = !DILocation(line: 852, column: 13, scope: !637, inlinedAt: !656)
!673 = !DILocation(line: 851, column: 20, scope: !637, inlinedAt: !656)
!674 = !{!675, !618, i64 0}
!675 = !{!"infomap", !618, i64 0, !618, i64 8}
!676 = !DILocation(line: 851, column: 10, scope: !637, inlinedAt: !656)
!677 = !DILocation(line: 851, column: 28, scope: !637, inlinedAt: !656)
!678 = distinct !{!678, !660, !672, !679}
!679 = !{!"llvm.loop.mustprogress"}
!680 = !DILocation(line: 854, column: 17, scope: !681, inlinedAt: !656)
!681 = distinct !DILexicalBlock(scope: !637, file: !48, line: 854, column: 7)
!682 = !{!675, !618, i64 8}
!683 = !DILocation(line: 854, column: 7, scope: !681, inlinedAt: !656)
!684 = !DILocation(line: 854, column: 7, scope: !637, inlinedAt: !656)
!685 = !DILocation(line: 857, column: 3, scope: !637, inlinedAt: !656)
!686 = !DILocation(line: 861, column: 29, scope: !637, inlinedAt: !656)
!687 = !DILocation(line: 862, column: 7, scope: !688, inlinedAt: !656)
!688 = distinct !DILexicalBlock(scope: !637, file: !48, line: 862, column: 7)
!689 = !DILocation(line: 862, column: 19, scope: !688, inlinedAt: !656)
!690 = !DILocation(line: 862, column: 22, scope: !688, inlinedAt: !656)
!691 = !DILocation(line: 862, column: 7, scope: !637, inlinedAt: !656)
!692 = !DILocation(line: 868, column: 7, scope: !693, inlinedAt: !656)
!693 = distinct !DILexicalBlock(scope: !688, file: !48, line: 863, column: 5)
!694 = !DILocation(line: 870, column: 5, scope: !693, inlinedAt: !656)
!695 = !DILocation(line: 0, scope: !662, inlinedAt: !696)
!696 = distinct !DILocation(line: 874, column: 29, scope: !637, inlinedAt: !656)
!697 = !DILocation(line: 875, column: 3, scope: !637, inlinedAt: !656)
!698 = !DILocation(line: 877, column: 3, scope: !637, inlinedAt: !656)
!699 = !DILocation(line: 879, column: 1, scope: !637, inlinedAt: !656)
!700 = !DILocation(line: 94, column: 3, scope: !606)
!701 = !DISubprogram(name: "dcgettext", scope: !702, file: !702, line: 51, type: !703, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !626)
!702 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!703 = !DISubroutineType(types: !704)
!704 = !{!32, !40, !40, !35}
!705 = !DISubprogram(name: "fputs_unlocked", scope: !360, file: !360, line: 691, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !626)
!706 = !DISubroutineType(types: !707)
!707 = !{!35, !708, !709}
!708 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !40)
!709 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!710 = !DILocation(line: 0, scope: !47)
!711 = !DILocation(line: 581, column: 7, scope: !56)
!712 = !{!713, !713, i64 0}
!713 = !{!"int", !619, i64 0}
!714 = !DILocation(line: 581, column: 19, scope: !56)
!715 = !DILocation(line: 581, column: 7, scope: !47)
!716 = !DILocation(line: 585, column: 26, scope: !55)
!717 = !DILocation(line: 0, scope: !55)
!718 = !DILocation(line: 586, column: 23, scope: !55)
!719 = !DILocation(line: 586, column: 28, scope: !55)
!720 = !DILocation(line: 586, column: 32, scope: !55)
!721 = !{!619, !619, i64 0}
!722 = !DILocation(line: 586, column: 38, scope: !55)
!723 = !DILocation(line: 0, scope: !662, inlinedAt: !724)
!724 = distinct !DILocation(line: 586, column: 41, scope: !55)
!725 = !DILocation(line: 1361, column: 11, scope: !662, inlinedAt: !724)
!726 = !DILocation(line: 1361, column: 10, scope: !662, inlinedAt: !724)
!727 = !DILocation(line: 586, column: 19, scope: !55)
!728 = !DILocation(line: 587, column: 5, scope: !55)
!729 = !DILocation(line: 588, column: 7, scope: !730)
!730 = distinct !DILexicalBlock(scope: !47, file: !48, line: 588, column: 7)
!731 = !DILocation(line: 588, column: 7, scope: !47)
!732 = !DILocation(line: 590, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !730, file: !48, line: 589, column: 5)
!734 = !DILocation(line: 591, column: 7, scope: !733)
!735 = !DILocation(line: 595, column: 37, scope: !47)
!736 = !DILocation(line: 595, column: 35, scope: !47)
!737 = !DILocation(line: 596, column: 29, scope: !47)
!738 = !DILocation(line: 597, column: 8, scope: !63)
!739 = !DILocation(line: 597, column: 7, scope: !47)
!740 = !DILocation(line: 604, column: 24, scope: !62)
!741 = !DILocation(line: 604, column: 12, scope: !63)
!742 = !DILocation(line: 0, scope: !61)
!743 = !DILocation(line: 610, column: 16, scope: !61)
!744 = !DILocation(line: 610, column: 7, scope: !61)
!745 = !DILocation(line: 611, column: 21, scope: !61)
!746 = !{!747, !747, i64 0}
!747 = !{!"short", !619, i64 0}
!748 = !DILocation(line: 611, column: 19, scope: !61)
!749 = !DILocation(line: 611, column: 16, scope: !61)
!750 = !DILocation(line: 610, column: 30, scope: !61)
!751 = distinct !{!751, !744, !745, !679}
!752 = !DILocation(line: 612, column: 18, scope: !753)
!753 = distinct !DILexicalBlock(scope: !61, file: !48, line: 612, column: 11)
!754 = !DILocation(line: 612, column: 11, scope: !61)
!755 = !DILocation(line: 620, column: 23, scope: !47)
!756 = !DILocation(line: 625, column: 39, scope: !47)
!757 = !DILocation(line: 626, column: 3, scope: !47)
!758 = !DILocation(line: 626, column: 10, scope: !47)
!759 = !DILocation(line: 626, column: 21, scope: !47)
!760 = !DILocation(line: 628, column: 44, scope: !761)
!761 = distinct !DILexicalBlock(scope: !762, file: !48, line: 628, column: 11)
!762 = distinct !DILexicalBlock(scope: !47, file: !48, line: 627, column: 5)
!763 = !DILocation(line: 628, column: 32, scope: !761)
!764 = !DILocation(line: 628, column: 49, scope: !761)
!765 = !DILocation(line: 628, column: 11, scope: !762)
!766 = !DILocation(line: 630, column: 11, scope: !767)
!767 = distinct !DILexicalBlock(scope: !762, file: !48, line: 630, column: 11)
!768 = !DILocation(line: 630, column: 11, scope: !762)
!769 = !DILocation(line: 632, column: 26, scope: !770)
!770 = distinct !DILexicalBlock(scope: !771, file: !48, line: 632, column: 15)
!771 = distinct !DILexicalBlock(scope: !767, file: !48, line: 631, column: 9)
!772 = !DILocation(line: 632, column: 34, scope: !770)
!773 = !DILocation(line: 632, column: 37, scope: !770)
!774 = !DILocation(line: 632, column: 15, scope: !771)
!775 = !DILocation(line: 636, column: 29, scope: !776)
!776 = distinct !DILexicalBlock(scope: !771, file: !48, line: 636, column: 15)
!777 = !DILocation(line: 640, column: 16, scope: !762)
!778 = distinct !{!778, !757, !779, !679}
!779 = !DILocation(line: 641, column: 5, scope: !47)
!780 = !DILocation(line: 644, column: 3, scope: !47)
!781 = !DILocation(line: 0, scope: !662, inlinedAt: !782)
!782 = distinct !DILocation(line: 648, column: 31, scope: !47)
!783 = !DILocation(line: 0, scope: !662, inlinedAt: !784)
!784 = distinct !DILocation(line: 649, column: 31, scope: !47)
!785 = !DILocation(line: 0, scope: !662, inlinedAt: !786)
!786 = distinct !DILocation(line: 650, column: 31, scope: !47)
!787 = !DILocation(line: 0, scope: !662, inlinedAt: !788)
!788 = distinct !DILocation(line: 651, column: 31, scope: !47)
!789 = !DILocation(line: 0, scope: !662, inlinedAt: !790)
!790 = distinct !DILocation(line: 652, column: 31, scope: !47)
!791 = !DILocation(line: 0, scope: !662, inlinedAt: !792)
!792 = distinct !DILocation(line: 653, column: 31, scope: !47)
!793 = !DILocation(line: 0, scope: !662, inlinedAt: !794)
!794 = distinct !DILocation(line: 654, column: 31, scope: !47)
!795 = !DILocation(line: 0, scope: !662, inlinedAt: !796)
!796 = distinct !DILocation(line: 655, column: 31, scope: !47)
!797 = !DILocation(line: 0, scope: !662, inlinedAt: !798)
!798 = distinct !DILocation(line: 656, column: 31, scope: !47)
!799 = !DILocation(line: 0, scope: !662, inlinedAt: !800)
!800 = distinct !DILocation(line: 657, column: 31, scope: !47)
!801 = !DILocation(line: 663, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !47, file: !48, line: 663, column: 7)
!803 = !DILocation(line: 664, column: 7, scope: !802)
!804 = !DILocation(line: 664, column: 10, scope: !802)
!805 = !DILocation(line: 663, column: 7, scope: !47)
!806 = !DILocation(line: 669, column: 7, scope: !807)
!807 = distinct !DILexicalBlock(scope: !802, file: !48, line: 665, column: 5)
!808 = !DILocation(line: 671, column: 5, scope: !807)
!809 = !DILocation(line: 676, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !802, file: !48, line: 673, column: 5)
!811 = !DILocation(line: 679, column: 3, scope: !47)
!812 = !DILocation(line: 683, column: 3, scope: !47)
!813 = !DILocation(line: 686, column: 3, scope: !47)
!814 = !DILocation(line: 688, column: 3, scope: !47)
!815 = !DILocation(line: 691, column: 3, scope: !47)
!816 = !DILocation(line: 695, column: 3, scope: !47)
!817 = !DILocation(line: 696, column: 1, scope: !47)
!818 = !DISubprogram(name: "setlocale", scope: !819, file: !819, line: 122, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !626)
!819 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!820 = !DISubroutineType(types: !821)
!821 = !{!32, !35, !40}
!822 = !DISubprogram(name: "getenv", scope: !823, file: !823, line: 641, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !626)
!823 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!824 = !DISubroutineType(types: !825)
!825 = !{!32, !40}
!826 = !DISubprogram(name: "fwrite_unlocked", scope: !360, file: !360, line: 704, type: !827, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !626)
!827 = !DISubroutineType(types: !828)
!828 = !{!37, !829, !37, !37, !709}
!829 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!832 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 189, type: !833, scopeLine: 190, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !835)
!833 = !DISubroutineType(types: !834)
!834 = !{!35, !35, !306}
!835 = !{!836, !837, !838, !839}
!836 = !DILocalVariable(name: "argc", arg: 1, scope: !832, file: !3, line: 189, type: !35)
!837 = !DILocalVariable(name: "argv", arg: 2, scope: !832, file: !3, line: 189, type: !306)
!838 = !DILocalVariable(name: "c", scope: !832, file: !3, line: 191, type: !35)
!839 = !DILocalVariable(name: "tab_stop", scope: !840, file: !3, line: 220, type: !844)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 219, column: 13)
!841 = distinct !DILexicalBlock(scope: !842, file: !3, line: 216, column: 15)
!842 = distinct !DILexicalBlock(scope: !843, file: !3, line: 205, column: 9)
!843 = distinct !DILexicalBlock(scope: !832, file: !3, line: 203, column: 5)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 16, elements: !302)
!845 = !DILocation(line: 0, scope: !832)
!846 = !DILocation(line: 194, column: 21, scope: !832)
!847 = !DILocation(line: 194, column: 3, scope: !832)
!848 = !DILocation(line: 195, column: 3, scope: !832)
!849 = !DILocation(line: 196, column: 3, scope: !832)
!850 = !DILocation(line: 197, column: 3, scope: !832)
!851 = !DILocation(line: 199, column: 3, scope: !832)
!852 = !DILocation(line: 200, column: 23, scope: !832)
!853 = !{!854, !854, i64 0}
!854 = !{!"_Bool", !619, i64 0}
!855 = !DILocation(line: 202, column: 3, scope: !832)
!856 = !DILocation(line: 202, column: 15, scope: !832)
!857 = !DILocation(line: 207, column: 31, scope: !842)
!858 = !DILocation(line: 208, column: 11, scope: !842)
!859 = !DILocation(line: 211, column: 28, scope: !842)
!860 = !DILocation(line: 211, column: 11, scope: !842)
!861 = !DILocation(line: 212, column: 11, scope: !842)
!862 = !DILocation(line: 216, column: 15, scope: !841)
!863 = !DILocation(line: 216, column: 15, scope: !842)
!864 = !DILocation(line: 217, column: 37, scope: !841)
!865 = !DILocation(line: 217, column: 13, scope: !841)
!866 = distinct !{!866, !855, !867, !679}
!867 = !DILocation(line: 234, column: 5, scope: !832)
!868 = !DILocation(line: 220, column: 15, scope: !840)
!869 = !DILocation(line: 220, column: 20, scope: !840)
!870 = !DILocation(line: 221, column: 29, scope: !840)
!871 = !DILocation(line: 221, column: 27, scope: !840)
!872 = !DILocation(line: 222, column: 27, scope: !840)
!873 = !DILocation(line: 223, column: 15, scope: !840)
!874 = !DILocation(line: 224, column: 13, scope: !841)
!875 = !DILocation(line: 227, column: 9, scope: !842)
!876 = !DILocation(line: 229, column: 9, scope: !842)
!877 = !DILocation(line: 232, column: 11, scope: !842)
!878 = !DILocation(line: 236, column: 3, scope: !832)
!879 = !DILocation(line: 238, column: 18, scope: !832)
!880 = !DILocation(line: 238, column: 25, scope: !832)
!881 = !DILocation(line: 238, column: 3, scope: !832)
!882 = !DILocation(line: 105, column: 14, scope: !147, inlinedAt: !883)
!883 = distinct !DILocation(line: 240, column: 3, scope: !832)
!884 = !DILocation(line: 0, scope: !147, inlinedAt: !883)
!885 = !DILocation(line: 107, column: 8, scope: !886, inlinedAt: !883)
!886 = distinct !DILexicalBlock(scope: !147, file: !3, line: 107, column: 7)
!887 = !DILocation(line: 107, column: 7, scope: !147, inlinedAt: !883)
!888 = !DILocation(line: 114, column: 3, scope: !147, inlinedAt: !883)
!889 = !DILocation(line: 61, column: 13, scope: !890, inlinedAt: !899)
!890 = distinct !DISubprogram(name: "mbbuf_init", scope: !154, file: !154, line: 56, type: !891, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !894)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !893, !32, !160, !70}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!894 = !{!895, !896, !897, !898}
!895 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !890, file: !154, line: 56, type: !893)
!896 = !DILocalVariable(name: "buffer", arg: 2, scope: !890, file: !154, line: 56, type: !32)
!897 = !DILocalVariable(name: "size", arg: 3, scope: !890, file: !154, line: 56, type: !160)
!898 = !DILocalVariable(name: "fp", arg: 4, scope: !890, file: !154, line: 56, type: !70)
!899 = distinct !DILocation(line: 112, column: 3, scope: !147, inlinedAt: !883)
!900 = !DILocation(line: 0, scope: !166, inlinedAt: !883)
!901 = !DILocation(line: 130, column: 7, scope: !166, inlinedAt: !883)
!902 = !DILocation(line: 130, column: 13, scope: !166, inlinedAt: !883)
!903 = !{!904, !904, i64 0}
!904 = !{!"long", !619, i64 0}
!905 = !DILocation(line: 135, column: 7, scope: !166, inlinedAt: !883)
!906 = !DILocation(line: 137, column: 11, scope: !190, inlinedAt: !883)
!907 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !908, file: !154, line: 71, type: !893)
!908 = distinct !DISubprogram(name: "mbbuf_get_char", scope: !154, file: !154, line: 71, type: !909, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!167, !893}
!911 = !{!907, !912, !913, !916}
!912 = !DILocalVariable(name: "available", scope: !908, file: !154, line: 73, type: !160)
!913 = !DILocalVariable(name: "start", scope: !914, file: !154, line: 77, type: !160)
!914 = distinct !DILexicalBlock(scope: !915, file: !154, line: 76, column: 5)
!915 = distinct !DILexicalBlock(scope: !908, file: !154, line: 75, column: 7)
!916 = !DILocalVariable(name: "g", scope: !908, file: !154, line: 92, type: !167)
!917 = !DILocation(line: 0, scope: !908, inlinedAt: !918)
!918 = distinct !DILocation(line: 137, column: 23, scope: !190, inlinedAt: !883)
!919 = !DILocation(line: 73, column: 35, scope: !908, inlinedAt: !918)
!920 = !DILocation(line: 75, column: 17, scope: !915, inlinedAt: !918)
!921 = !DILocation(line: 75, column: 32, scope: !915, inlinedAt: !918)
!922 = !DILocalVariable(name: "__stream", arg: 1, scope: !923, file: !924, line: 128, type: !70)
!923 = distinct !DISubprogram(name: "feof_unlocked", scope: !924, file: !924, line: 128, type: !925, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !927)
!924 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!925 = !DISubroutineType(types: !926)
!926 = !{!35, !70}
!927 = !{!922}
!928 = !DILocation(line: 0, scope: !923, inlinedAt: !929)
!929 = distinct !DILocation(line: 75, column: 37, scope: !915, inlinedAt: !918)
!930 = !DILocation(line: 130, column: 10, scope: !923, inlinedAt: !929)
!931 = !{!932, !713, i64 0}
!932 = !{!"_IO_FILE", !713, i64 0, !618, i64 8, !618, i64 16, !618, i64 24, !618, i64 32, !618, i64 40, !618, i64 48, !618, i64 56, !618, i64 64, !618, i64 72, !618, i64 80, !618, i64 88, !618, i64 96, !618, i64 104, !713, i64 112, !713, i64 116, !904, i64 120, !747, i64 128, !619, i64 130, !619, i64 131, !618, i64 136, !904, i64 144, !618, i64 152, !618, i64 160, !618, i64 168, !618, i64 176, !904, i64 184, !713, i64 192, !619, i64 196}
!933 = !DILocation(line: 75, column: 37, scope: !915, inlinedAt: !918)
!934 = !DILocation(line: 75, column: 7, scope: !908, inlinedAt: !918)
!935 = !DILocation(line: 78, column: 15, scope: !936, inlinedAt: !918)
!936 = distinct !DILexicalBlock(scope: !914, file: !154, line: 78, column: 11)
!937 = !DILocation(line: 78, column: 11, scope: !914, inlinedAt: !918)
!938 = !DILocation(line: 82, column: 49, scope: !939, inlinedAt: !918)
!939 = distinct !DILexicalBlock(scope: !936, file: !154, line: 81, column: 9)
!940 = !DILocalVariable(name: "__dest", arg: 1, scope: !941, file: !942, line: 34, type: !34)
!941 = distinct !DISubprogram(name: "memmove", scope: !942, file: !942, line: 34, type: !943, scopeLine: 35, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !945)
!942 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!943 = !DISubroutineType(types: !944)
!944 = !{!34, !34, !830, !37}
!945 = !{!940, !946, !947}
!946 = !DILocalVariable(name: "__src", arg: 2, scope: !941, file: !942, line: 34, type: !830)
!947 = !DILocalVariable(name: "__len", arg: 3, scope: !941, file: !942, line: 34, type: !37)
!948 = !DILocation(line: 0, scope: !941, inlinedAt: !949)
!949 = distinct !DILocation(line: 82, column: 11, scope: !939, inlinedAt: !918)
!950 = !DILocation(line: 36, column: 10, scope: !941, inlinedAt: !949)
!951 = !DILocation(line: 0, scope: !914, inlinedAt: !918)
!952 = !DILocation(line: 0, scope: !936, inlinedAt: !918)
!953 = !DILocation(line: 85, column: 23, scope: !914, inlinedAt: !918)
!954 = !DILocation(line: 86, column: 41, scope: !914, inlinedAt: !918)
!955 = !DILocation(line: 89, column: 5, scope: !914, inlinedAt: !918)
!956 = !DILocation(line: 90, column: 17, scope: !957, inlinedAt: !918)
!957 = distinct !DILexicalBlock(scope: !908, file: !154, line: 90, column: 7)
!958 = !DILocation(line: 90, column: 7, scope: !908, inlinedAt: !918)
!959 = !DILocation(line: 92, column: 39, scope: !908, inlinedAt: !918)
!960 = !DILocalVariable(name: "p", arg: 1, scope: !961, file: !22, line: 230, type: !40)
!961 = distinct !DISubprogram(name: "mcel_scan", scope: !22, file: !22, line: 230, type: !962, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{!167, !40, !40}
!964 = !{!960, !965, !966, !967, !978, !979}
!965 = !DILocalVariable(name: "lim", arg: 2, scope: !961, file: !22, line: 230, type: !40)
!966 = !DILocalVariable(name: "c", scope: !961, file: !22, line: 235, type: !33)
!967 = !DILocalVariable(name: "mbs", scope: !961, file: !22, line: 244, type: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !408, line: 6, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !410, line: 21, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 13, size: 64, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !970, file: !410, line: 15, baseType: !35, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !970, file: !410, line: 20, baseType: !974, size: 32, offset: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !410, line: 16, size: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !974, file: !410, line: 18, baseType: !7, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !974, file: !410, line: 19, baseType: !419, size: 32)
!978 = !DILocalVariable(name: "ch", scope: !961, file: !22, line: 267, type: !171)
!979 = !DILocalVariable(name: "len", scope: !961, file: !22, line: 268, type: !37)
!980 = !DILocation(line: 0, scope: !961, inlinedAt: !981)
!981 = distinct !DILocation(line: 92, column: 14, scope: !908, inlinedAt: !918)
!982 = !DILocation(line: 235, column: 12, scope: !961, inlinedAt: !981)
!983 = !DILocalVariable(name: "c", arg: 1, scope: !984, file: !22, line: 215, type: !33)
!984 = distinct !DISubprogram(name: "mcel_isbasic", scope: !22, file: !22, line: 215, type: !985, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!43, !33}
!987 = !{!983}
!988 = !DILocation(line: 0, scope: !984, inlinedAt: !989)
!989 = distinct !DILocation(line: 236, column: 7, scope: !990, inlinedAt: !981)
!990 = distinct !DILexicalBlock(scope: !961, file: !22, line: 236, column: 7)
!991 = !DILocation(line: 217, column: 10, scope: !984, inlinedAt: !989)
!992 = !DILocation(line: 236, column: 7, scope: !961, inlinedAt: !981)
!993 = !DILocalVariable(name: "len", arg: 2, scope: !994, file: !22, line: 167, type: !37)
!994 = distinct !DISubprogram(name: "mcel_ch", scope: !22, file: !22, line: 167, type: !995, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!995 = !DISubroutineType(types: !996)
!996 = !{!167, !171, !37}
!997 = !{!998, !993}
!998 = !DILocalVariable(name: "ch", arg: 1, scope: !994, file: !22, line: 167, type: !171)
!999 = !DILocation(line: 0, scope: !994, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 237, column: 12, scope: !990, inlinedAt: !981)
!1001 = !DILocation(line: 172, column: 3, scope: !994, inlinedAt: !1000)
!1002 = !DILocation(line: 237, column: 5, scope: !990, inlinedAt: !981)
!1003 = !DILocation(line: 93, column: 39, scope: !908, inlinedAt: !918)
!1004 = !DILocation(line: 244, column: 3, scope: !961, inlinedAt: !981)
!1005 = !DILocation(line: 244, column: 13, scope: !961, inlinedAt: !981)
!1006 = !DILocation(line: 244, column: 30, scope: !961, inlinedAt: !981)
!1007 = !{!1008, !713, i64 0}
!1008 = !{!"", !713, i64 0, !619, i64 4}
!1009 = !DILocation(line: 267, column: 3, scope: !961, inlinedAt: !981)
!1010 = !DILocation(line: 268, column: 38, scope: !961, inlinedAt: !981)
!1011 = !DILocation(line: 268, column: 16, scope: !961, inlinedAt: !981)
!1012 = !DILocation(line: 274, column: 7, scope: !1013, inlinedAt: !981)
!1013 = distinct !DILexicalBlock(scope: !961, file: !22, line: 274, column: 7)
!1014 = !DILocation(line: 274, column: 7, scope: !961, inlinedAt: !981)
!1015 = !{!"branch_weights", i32 1, i32 2000}
!1016 = !DILocalVariable(name: "err", arg: 1, scope: !1017, file: !22, line: 175, type: !42)
!1017 = distinct !DISubprogram(name: "mcel_err", scope: !22, file: !22, line: 175, type: !1018, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!167, !42}
!1020 = !{!1016}
!1021 = !DILocation(line: 0, scope: !1017, inlinedAt: !1022)
!1022 = distinct !DILocation(line: 275, column: 12, scope: !1013, inlinedAt: !981)
!1023 = !DILocation(line: 178, column: 3, scope: !1017, inlinedAt: !1022)
!1024 = !DILocation(line: 275, column: 5, scope: !1013, inlinedAt: !981)
!1025 = !DILocation(line: 279, column: 19, scope: !961, inlinedAt: !981)
!1026 = !DILocation(line: 0, scope: !994, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 279, column: 10, scope: !961, inlinedAt: !981)
!1028 = !DILocation(line: 169, column: 3, scope: !994, inlinedAt: !1027)
!1029 = !DILocation(line: 170, column: 3, scope: !994, inlinedAt: !1027)
!1030 = !DILocation(line: 171, column: 3, scope: !994, inlinedAt: !1027)
!1031 = !DILocation(line: 172, column: 3, scope: !994, inlinedAt: !1027)
!1032 = !DILocation(line: 279, column: 3, scope: !961, inlinedAt: !981)
!1033 = !DILocation(line: 280, column: 1, scope: !961, inlinedAt: !981)
!1034 = !DILocation(line: 94, column: 9, scope: !1035, inlinedAt: !918)
!1035 = distinct !DILexicalBlock(scope: !908, file: !154, line: 94, column: 7)
!1036 = !DILocation(line: 94, column: 7, scope: !908, inlinedAt: !918)
!1037 = !DILocation(line: 92, column: 14, scope: !908, inlinedAt: !918)
!1038 = !DILocation(line: 95, column: 22, scope: !1035, inlinedAt: !918)
!1039 = !DILocation(line: 95, column: 5, scope: !1035, inlinedAt: !918)
!1040 = !DILocation(line: 99, column: 30, scope: !1041, inlinedAt: !918)
!1041 = distinct !DILexicalBlock(scope: !1035, file: !154, line: 97, column: 5)
!1042 = !DILocation(line: 99, column: 14, scope: !1041, inlinedAt: !918)
!1043 = !DILocation(line: 0, scope: !1035, inlinedAt: !918)
!1044 = !DILocation(line: 137, column: 23, scope: !190, inlinedAt: !883)
!1045 = !DILocation(line: 137, column: 51, scope: !190, inlinedAt: !883)
!1046 = !DILocation(line: 138, column: 18, scope: !190, inlinedAt: !883)
!1047 = !DILocation(line: 138, column: 27, scope: !190, inlinedAt: !883)
!1048 = distinct !{!1048, !906, !1049, !679}
!1049 = !DILocation(line: 139, column: 60, scope: !190, inlinedAt: !883)
!1050 = !DILocation(line: 141, column: 15, scope: !190, inlinedAt: !883)
!1051 = !DILocation(line: 143, column: 26, scope: !188, inlinedAt: !883)
!1052 = !{i8 0, i8 2}
!1053 = !DILocation(line: 143, column: 46, scope: !188, inlinedAt: !883)
!1054 = !DILocalVariable(name: "wc", arg: 1, scope: !1055, file: !48, line: 178, type: !171)
!1055 = distinct !DISubprogram(name: "c32issep", scope: !48, file: !48, line: 178, type: !1056, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!43, !171}
!1058 = !{!1054}
!1059 = !DILocation(line: 0, scope: !1055, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 143, column: 49, scope: !188, inlinedAt: !883)
!1061 = !DILocalVariable(name: "wc", arg: 1, scope: !1062, file: !1063, line: 770, type: !1066)
!1062 = distinct !DISubprogram(name: "c32isblank", scope: !1063, file: !1063, line: 770, type: !1064, scopeLine: 771, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1068)
!1063 = !DIFile(filename: "./lib/uchar.h", directory: "/src")
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!35, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1067, line: 20, baseType: !7)
!1067 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1068 = !{!1061}
!1069 = !DILocation(line: 0, scope: !1062, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 181, column: 13, scope: !1055, inlinedAt: !1060)
!1071 = !DILocation(line: 776, column: 10, scope: !1062, inlinedAt: !1070)
!1072 = !DILocation(line: 181, column: 11, scope: !1055, inlinedAt: !1060)
!1073 = !DILocation(line: 145, column: 19, scope: !188, inlinedAt: !883)
!1074 = !DILocation(line: 148, column: 19, scope: !186, inlinedAt: !883)
!1075 = !DILocation(line: 0, scope: !186, inlinedAt: !883)
!1076 = !DILocation(line: 150, column: 23, scope: !186, inlinedAt: !883)
!1077 = !DILocation(line: 152, column: 26, scope: !186, inlinedAt: !883)
!1078 = !DILocation(line: 152, column: 35, scope: !186, inlinedAt: !883)
!1079 = !DILocation(line: 152, column: 19, scope: !186, inlinedAt: !883)
!1080 = !DILocalVariable(name: "__c", arg: 1, scope: !1081, file: !924, line: 108, type: !35)
!1081 = distinct !DISubprogram(name: "putchar_unlocked", scope: !924, file: !924, line: 108, type: !1082, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1084)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!35, !35}
!1084 = !{!1080}
!1085 = !DILocation(line: 0, scope: !1081, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 153, column: 25, scope: !1087, inlinedAt: !883)
!1087 = distinct !DILexicalBlock(scope: !186, file: !3, line: 153, column: 25)
!1088 = !DILocation(line: 110, column: 10, scope: !1081, inlinedAt: !1086)
!1089 = !{!932, !618, i64 40}
!1090 = !{!932, !618, i64 48}
!1091 = !{!"branch_weights", i32 2000, i32 1}
!1092 = !DILocation(line: 153, column: 25, scope: !186, inlinedAt: !883)
!1093 = !DILocation(line: 153, column: 39, scope: !1087, inlinedAt: !883)
!1094 = !DILocation(line: 948, column: 21, scope: !1095, inlinedAt: !1098)
!1095 = distinct !DISubprogram(name: "write_error", scope: !48, file: !48, line: 946, type: !148, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1096)
!1096 = !{!1097}
!1097 = !DILocalVariable(name: "saved_errno", scope: !1095, file: !48, line: 948, type: !35)
!1098 = distinct !DILocation(line: 154, column: 23, scope: !1087, inlinedAt: !883)
!1099 = !DILocation(line: 0, scope: !1095, inlinedAt: !1098)
!1100 = !DILocation(line: 949, column: 3, scope: !1095, inlinedAt: !1098)
!1101 = !DILocation(line: 950, column: 11, scope: !1095, inlinedAt: !1098)
!1102 = !DILocation(line: 950, column: 3, scope: !1095, inlinedAt: !1098)
!1103 = !DILocation(line: 951, column: 3, scope: !1095, inlinedAt: !1098)
!1104 = !DILocation(line: 952, column: 3, scope: !1095, inlinedAt: !1098)
!1105 = distinct !{!1105, !1079, !1106, !679}
!1106 = !DILocation(line: 154, column: 36, scope: !186, inlinedAt: !883)
!1107 = !DILocation(line: 0, scope: !1081, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 156, column: 23, scope: !1109, inlinedAt: !883)
!1109 = distinct !DILexicalBlock(scope: !186, file: !3, line: 156, column: 23)
!1110 = !DILocation(line: 110, column: 10, scope: !1081, inlinedAt: !1108)
!1111 = !DILocation(line: 156, column: 23, scope: !186, inlinedAt: !883)
!1112 = !DILocation(line: 156, column: 37, scope: !1109, inlinedAt: !883)
!1113 = !DILocation(line: 948, column: 21, scope: !1095, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 157, column: 21, scope: !1109, inlinedAt: !883)
!1115 = !DILocation(line: 0, scope: !1095, inlinedAt: !1114)
!1116 = !DILocation(line: 949, column: 3, scope: !1095, inlinedAt: !1114)
!1117 = !DILocation(line: 950, column: 11, scope: !1095, inlinedAt: !1114)
!1118 = !DILocation(line: 950, column: 3, scope: !1095, inlinedAt: !1114)
!1119 = !DILocation(line: 951, column: 3, scope: !1095, inlinedAt: !1114)
!1120 = !DILocation(line: 952, column: 3, scope: !1095, inlinedAt: !1114)
!1121 = !DILocation(line: 160, column: 17, scope: !187, inlinedAt: !883)
!1122 = !DILocation(line: 165, column: 30, scope: !1123, inlinedAt: !883)
!1123 = distinct !DILexicalBlock(scope: !194, file: !3, line: 162, column: 17)
!1124 = !DILocation(line: 165, column: 26, scope: !1123, inlinedAt: !883)
!1125 = !DILocation(line: 166, column: 34, scope: !1123, inlinedAt: !883)
!1126 = !DILocation(line: 166, column: 33, scope: !1123, inlinedAt: !883)
!1127 = !DILocation(line: 166, column: 29, scope: !1123, inlinedAt: !883)
!1128 = !DILocation(line: 167, column: 17, scope: !1123, inlinedAt: !883)
!1129 = !DILocalVariable(name: "wc", arg: 1, scope: !1130, file: !1063, line: 1004, type: !171)
!1130 = distinct !DISubprogram(name: "c32width", scope: !1063, file: !1063, line: 1004, type: !1131, scopeLine: 1005, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1133)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!35, !171}
!1133 = !{!1129}
!1134 = !DILocation(line: 0, scope: !1130, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 170, column: 31, scope: !193, inlinedAt: !883)
!1136 = !DILocation(line: 1010, column: 10, scope: !1130, inlinedAt: !1135)
!1137 = !DILocation(line: 0, scope: !193, inlinedAt: !883)
!1138 = !DILocation(line: 171, column: 23, scope: !1139, inlinedAt: !883)
!1139 = distinct !DILexicalBlock(scope: !193, file: !3, line: 171, column: 23)
!1140 = !DILocation(line: 171, column: 23, scope: !193, inlinedAt: !883)
!1141 = !DILocation(line: 172, column: 21, scope: !1139, inlinedAt: !883)
!1142 = !DILocation(line: 177, column: 15, scope: !190, inlinedAt: !883)
!1143 = !DILocation(line: 180, column: 11, scope: !190, inlinedAt: !883)
!1144 = !DILocation(line: 0, scope: !190, inlinedAt: !883)
!1145 = !DILocalVariable(name: "g", arg: 2, scope: !1146, file: !154, line: 107, type: !167)
!1146 = distinct !DISubprogram(name: "mbbuf_char_offset", scope: !154, file: !154, line: 107, type: !1147, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1149)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!32, !893, !167}
!1149 = !{!1150, !1145}
!1150 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !1146, file: !154, line: 107, type: !893)
!1151 = !DILocation(line: 0, scope: !1146, inlinedAt: !1152)
