; ModuleID = 'src/factor.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.primes_dtab = type { i64, i64 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.tokenbuffer = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__mpz_struct = type { i32, i32, i64* }
%struct.mp_factors = type { %struct.mp_factor*, i64, i64 }
%struct.mp_factor = type { [1 x %struct.__mpz_struct], i64 }
%struct.factors = type { %struct.uuint, [26 x i64], [26 x i8], i8 }
%struct.uuint = type { [2 x i64] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.mpn_base_info = type { i32, i64 }
%struct.gmp_div_inverse = type { i32, i64, i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [32 x i8] c"Usage: %s [OPTION] [NUMBER]...\0A\00", align 1

!31 = !DIEnumerator(name: "LOG_BIG_POWER_OF_10", value: 19)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 723, baseType: !7, size: 32, elements: !33)
!33 = !{!34}
!34 = !DIEnumerator(name: "PRIMES_PTAB_ENTRIES", value: 668)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1669, baseType: !7, size: 32, elements: !36)
!36 = !{!37}
!37 = !DIEnumerator(name: "FACTOR_PIPE_BUF", value: 4096)
!38 = !{!39, !41, !42, !43, !44, !47, !49, !50, !53, !46, !54, !59, !60}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 46, baseType: !46)
!45 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!46 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_size_t", file: !51, line: 61, baseType: !52)
!51 = !DIFile(filename: "./lib/mini-gmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "68d9292d80d921bf50de4da10cd36738")
!52 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "UDItype", file: !3, line: 158, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !56, line: 27, baseType: !57)
!56 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !58, line: 45, baseType: !46)
!58 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !51, line: 60, baseType: !46)
!61 = !{!62, !64, !0, !148, !150, !155, !160, !165, !168, !179, !187, !193}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "print_exponents", scope: !2, file: !3, line: 210, type: !53, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !66, file: !67, line: 575, type: !42, isLocal: true, isDefinition: true)
!66 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !68, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!67 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!68 = !DISubroutineType(types: !69)
!69 = !{null, !47, !47}
!70 = !{!71, !72, !73, !76, !77, !78, !79, !83, !84, !85, !86, !88, !142, !143, !144, !146, !147}
!71 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !47)
!72 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !47)
!73 = !DILocalVariable(name: "term", scope: !74, file: !67, line: 585, type: !47)
!74 = distinct !DILexicalBlock(scope: !75, file: !67, line: 582, column: 5)
!75 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!76 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !53)
!77 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !47)
!78 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !47)
!79 = !DILocalVariable(name: "s", scope: !80, file: !67, line: 608, type: !47)
!80 = distinct !DILexicalBlock(scope: !81, file: !67, line: 605, column: 5)
!81 = distinct !DILexicalBlock(scope: !82, file: !67, line: 604, column: 12)
!82 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!83 = !DILocalVariable(name: "spaces", scope: !80, file: !67, line: 609, type: !44)
!84 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !44)
!85 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !47)
!86 = !DILocalVariable(name: "__ptr", scope: !87, file: !67, line: 644, type: !47)
!87 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!88 = !DILocalVariable(name: "__stream", scope: !87, file: !67, line: 644, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !91, line: 7, baseType: !92)
!91 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !93, line: 49, size: 1728, elements: !94)
!93 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !110, !112, !113, !114, !116, !117, !119, !123, !126, !128, !131, !134, !135, !136, !137, !138}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !92, file: !93, line: 51, baseType: !42, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !92, file: !93, line: 54, baseType: !39, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !92, file: !93, line: 55, baseType: !39, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !92, file: !93, line: 56, baseType: !39, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !92, file: !93, line: 57, baseType: !39, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !92, file: !93, line: 58, baseType: !39, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !92, file: !93, line: 59, baseType: !39, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !92, file: !93, line: 60, baseType: !39, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !92, file: !93, line: 61, baseType: !39, size: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !92, file: !93, line: 64, baseType: !39, size: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !92, file: !93, line: 65, baseType: !39, size: 64, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !92, file: !93, line: 66, baseType: !39, size: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !92, file: !93, line: 68, baseType: !108, size: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !93, line: 36, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !92, file: !93, line: 70, baseType: !111, size: 64, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !92, file: !93, line: 72, baseType: !42, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !92, file: !93, line: 73, baseType: !42, size: 32, offset: 928)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !92, file: !93, line: 74, baseType: !115, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !58, line: 152, baseType: !52)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !92, file: !93, line: 77, baseType: !43, size: 16, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !92, file: !93, line: 78, baseType: !118, size: 8, offset: 1040)
!118 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !92, file: !93, line: 79, baseType: !120, size: 8, offset: 1048)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !92, file: !93, line: 81, baseType: !124, size: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !93, line: 43, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !92, file: !93, line: 89, baseType: !127, size: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !58, line: 153, baseType: !52)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !92, file: !93, line: 91, baseType: !129, size: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !93, line: 37, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !92, file: !93, line: 92, baseType: !132, size: 64, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !93, line: 38, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !92, file: !93, line: 93, baseType: !111, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !92, file: !93, line: 94, baseType: !41, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !92, file: !93, line: 95, baseType: !44, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !92, file: !93, line: 96, baseType: !42, size: 32, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !92, file: !93, line: 98, baseType: !139, size: 160, offset: 1568)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 160, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 20)
!142 = !DILocalVariable(name: "__cnt", scope: !87, file: !67, line: 644, type: !44)
!143 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !47)
!144 = !DILocalVariable(name: "__ptr", scope: !145, file: !67, line: 686, type: !47)
!145 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!146 = !DILocalVariable(name: "__stream", scope: !145, file: !67, line: 686, type: !89)
!147 = !DILocalVariable(name: "__cnt", scope: !145, file: !67, line: 686, type: !44)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 749, type: !53, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "lbuffered", scope: !2, file: !3, line: 1689, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !153, line: 130, baseType: !154)
!153 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !45, line: 35, baseType: !52)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "lbuf_buf", scope: !2, file: !3, line: 1688, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 65536, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8192)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "DELIM", scope: !2, file: !3, line: 102, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 4)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression(DW_OP_constu, 10000000000000000000, DW_OP_stack_value))
!166 = distinct !DIGlobalVariable(name: "BIG_POWER_OF_10", scope: !2, file: !3, line: 249, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "primes_ptab", scope: !2, file: !3, line: 717, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 10800, elements: !177)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !173, line: 44, baseType: !174)
!173 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !58, line: 54, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !58, line: 39, baseType: !176)
!176 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!177 = !{!178}
!178 = !DISubrange(count: 675)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "primes_dtab", scope: !2, file: !3, line: 737, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 86400, elements: !177)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "primes_dtab", file: !3, line: 725, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "binv", scope: !183, file: !3, line: 727, baseType: !60, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lim", scope: !183, file: !3, line: 727, baseType: !60, size: 64, offset: 64)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "binvert_table", scope: !2, file: !3, line: 984, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 1024, elements: !191)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!191 = !{!192}
!192 = !DISubrange(count: 128)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "line_buffered", scope: !195, file: !3, line: 1738, type: !42, isLocal: true, isDefinition: true)
!195 = distinct !DISubprogram(name: "lbuf_putnl", scope: !3, file: !3, line: 1733, type: !196, scopeLine: 1734, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !198)
!196 = !DISubroutineType(types: !197)
!197 = !{null}
!198 = !{}
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 1280, elements: !209)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !202, line: 50, size: 256, elements: !203)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!203 = !{!204, !205, !206, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !202, line: 52, baseType: !47, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !201, file: !202, line: 55, baseType: !42, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 56, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !202, line: 57, baseType: !42, size: 32, offset: 192)
!209 = !{!210}
!210 = !DISubrange(count: 5)
!211 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!212 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "Version", scope: !215, file: !216, line: 3, type: !47, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !217, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!217 = !{!213}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "file_name", scope: !220, file: !221, line: 45, type: !47, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !222, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!222 = !{!218, !223}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !220, file: !221, line: 55, type: !53, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !227, file: !228, line: 66, type: !263, isLocal: false, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !229, globals: !230, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!229 = !{!41, !49}
!230 = !{!231, !257, !225, !259, !261}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "old_file_name", scope: !233, file: !228, line: 304, type: !47, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "verror_at_line", scope: !228, file: !228, line: 298, type: !234, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !250)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !42, !42, !47, !7, !47, !236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !237, line: 52, baseType: !238)
!237 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !239, line: 32, baseType: !240)
!239 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !241, baseType: !242)
!241 = !DIFile(filename: "lib/error.c", directory: "/src")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !243, size: 256, elements: !244)
!243 = !DINamespace(name: "std", scope: null)
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !242, file: !241, baseType: !41, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !242, file: !241, baseType: !41, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !242, file: !241, baseType: !41, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !242, file: !241, baseType: !42, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !242, file: !241, baseType: !42, size: 32, offset: 224)
!250 = !{!251, !252, !253, !254, !255, !256}
!251 = !DILocalVariable(name: "status", arg: 1, scope: !233, file: !228, line: 298, type: !42)
!252 = !DILocalVariable(name: "errnum", arg: 2, scope: !233, file: !228, line: 298, type: !42)
!253 = !DILocalVariable(name: "file_name", arg: 3, scope: !233, file: !228, line: 298, type: !47)
!254 = !DILocalVariable(name: "line_number", arg: 4, scope: !233, file: !228, line: 298, type: !7)
!255 = !DILocalVariable(name: "message", arg: 5, scope: !233, file: !228, line: 298, type: !47)
!256 = !DILocalVariable(name: "args", arg: 6, scope: !233, file: !228, line: 298, type: !236)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "old_line_number", scope: !233, file: !228, line: 305, type: !7, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "error_message_count", scope: !227, file: !228, line: 69, type: !7, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !227, file: !228, line: 295, type: !42, isLocal: false, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "mp_bits_per_limb", scope: !266, file: !270, line: 288, type: !318, isLocal: false, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !268, retainedTypes: !275, globals: !281, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/mini-gmp-gnulib.c", directory: "/src", checksumkind: CSK_MD5, checksum: "18c9693e80e8dc09ed363761a1d33237")
!268 = !{!269, !5}
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mpz_div_round_mode", file: !270, line: 2197, baseType: !7, size: 32, elements: !271)
!270 = !DIFile(filename: "./lib/mini-gmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5bab32053bcda54c422f28ad9a48f3db")
!271 = !{!272, !273, !274}
!272 = !DIEnumerator(name: "GMP_DIV_FLOOR", value: 0)
!273 = !DIEnumerator(name: "GMP_DIV_CEIL", value: 1)
!274 = !DIEnumerator(name: "GMP_DIV_TRUNC", value: 2)
!275 = !{!60, !276, !46, !52, !277, !42, !50, !278, !39, !279, !49, !43, !7, !154, !280}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_ptr", file: !51, line: 64, baseType: !59)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_bitcnt_t", file: !51, line: 62, baseType: !46)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!281 = !{!264, !282, !296, !301, !306, !311}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "dummy_limb", scope: !284, file: !270, line: 1437, type: !167, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "mpz_init", scope: !270, file: !270, line: 1435, type: !285, scopeLine: 1436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !266, retainedNodes: !294)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !51, line: 75, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 67, size: 128, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !289, file: !51, line: 69, baseType: !42, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !289, file: !51, line: 71, baseType: !42, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !289, file: !51, line: 74, baseType: !59, size: 64, offset: 64)
!294 = !{!295}
!295 = !DILocalVariable(name: "r", arg: 1, scope: !284, file: !270, line: 1435, type: !287)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "gmp_allocate_func", scope: !266, file: !270, line: 332, type: !298, isLocal: true, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!41, !44}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "gmp_reallocate_func", scope: !266, file: !270, line: 333, type: !303, isLocal: true, isDefinition: true)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{!41, !41, !44, !44}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "gmp_free_func", scope: !266, file: !270, line: 334, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !41, !44}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "i", scope: !313, file: !270, line: 4495, type: !318, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "gmp_detect_endian", scope: !270, file: !270, line: 4493, type: !314, scopeLine: 4494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !266, retainedNodes: !316)
!314 = !DISubroutineType(types: !315)
!315 = !{!42}
!316 = !{!317}
!317 = !DILocalVariable(name: "p", scope: !313, file: !270, line: 4496, type: !280)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "program_name", scope: !321, file: !322, line: 31, type: !47, isLocal: false, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !323, globals: !324, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!323 = !{!39}
!324 = !{!319}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "utf07FF", scope: !327, file: !328, line: 46, type: !356, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "proper_name_lite", scope: !328, file: !328, line: 38, type: !329, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !331, retainedNodes: !333)
!328 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!329 = !DISubroutineType(types: !330)
!330 = !{!47, !47, !47}
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!332 = !{!325}
!333 = !{!334, !335, !336, !337, !342}
!334 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !327, file: !328, line: 38, type: !47)
!335 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !327, file: !328, line: 38, type: !47)
!336 = !DILocalVariable(name: "translation", scope: !327, file: !328, line: 40, type: !47)
!337 = !DILocalVariable(name: "w", scope: !327, file: !328, line: 47, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !339, line: 37, baseType: !340)
!339 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !58, line: 57, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !58, line: 42, baseType: !7)
!342 = !DILocalVariable(name: "mbs", scope: !327, file: !328, line: 48, type: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !344, line: 6, baseType: !345)
!344 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !346, line: 21, baseType: !347)
!346 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 13, size: 64, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !347, file: !346, line: 15, baseType: !42, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !347, file: !346, line: 20, baseType: !351, size: 32, offset: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !346, line: 16, size: 32, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !351, file: !346, line: 18, baseType: !7, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !351, file: !346, line: 19, baseType: !355, size: 32)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 32, elements: !163)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 16, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 2)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !361, file: !362, line: 76, type: !444, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !363, retainedTypes: !383, globals: !384, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!363 = !{!364, !378, !5}
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !365, line: 42, baseType: !7, size: 32, elements: !366)
!365 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!367 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!368 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!369 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!370 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!371 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!372 = !DIEnumerator(name: "c_quoting_style", value: 5)
!373 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!374 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!375 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!376 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!377 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !365, line: 254, baseType: !7, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!381 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!382 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!383 = !{!42, !43, !44}
!384 = !{!359, !385, !391, !403, !405, !410, !433, !440, !442}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !361, file: !362, line: 92, type: !387, isLocal: false, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 320, elements: !389)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!389 = !{!390}
!390 = !DISubrange(count: 10)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !361, file: !362, line: 1040, type: !393, isLocal: false, isDefinition: true)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !362, line: 56, size: 448, elements: !394)
!394 = !{!395, !396, !397, !401, !402}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !393, file: !362, line: 59, baseType: !364, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !362, line: 62, baseType: !42, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !393, file: !362, line: 66, baseType: !398, size: 256, offset: 64)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !393, file: !362, line: 69, baseType: !47, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !393, file: !362, line: 72, baseType: !47, size: 64, offset: 384)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !361, file: !362, line: 107, type: !393, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "slot0", scope: !361, file: !362, line: 831, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 256)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "quote", scope: !412, file: !362, line: 228, type: !431, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "gettext_quote", scope: !362, file: !362, line: 197, type: !413, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !415)
!413 = !DISubroutineType(types: !414)
!414 = !{!47, !47, !364}
!415 = !{!416, !417, !418, !419, !420}
!416 = !DILocalVariable(name: "msgid", arg: 1, scope: !412, file: !362, line: 197, type: !47)
!417 = !DILocalVariable(name: "s", arg: 2, scope: !412, file: !362, line: 197, type: !364)
!418 = !DILocalVariable(name: "translation", scope: !412, file: !362, line: 199, type: !47)
!419 = !DILocalVariable(name: "w", scope: !412, file: !362, line: 229, type: !338)
!420 = !DILocalVariable(name: "mbs", scope: !412, file: !362, line: 230, type: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !344, line: 6, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !346, line: 21, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 13, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !423, file: !346, line: 15, baseType: !42, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !423, file: !346, line: 20, baseType: !427, size: 32, offset: 32)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !346, line: 16, size: 32, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !427, file: !346, line: 18, baseType: !7, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !427, file: !346, line: 19, baseType: !355, size: 32)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !432)
!432 = !{!358, !164}
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "slotvec", scope: !361, file: !362, line: 834, type: !435, isLocal: true, isDefinition: true)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !362, line: 823, size: 128, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !436, file: !362, line: 825, baseType: !44, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !436, file: !362, line: 826, baseType: !39, size: 64, offset: 64)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "nslots", scope: !361, file: !362, line: 832, type: !42, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "slotvec0", scope: !361, file: !362, line: 833, type: !436, isLocal: true, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 704, elements: !446)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!446 = !{!447}
!447 = !DISubrange(count: 11)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !450, file: !451, line: 26, type: !453, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !452, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!452 = !{!448}
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 376, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 47)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "exit_failure", scope: !458, file: !459, line: 24, type: !461, isLocal: false, isDefinition: true)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !460, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!460 = !{!456}
!461 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "internal_state", scope: !464, file: !465, line: 97, type: !468, isLocal: true, isDefinition: true)
!464 = distinct !DICompileUnit(language: DW_LANG_C99, file: !465, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !466, globals: !467, splitDebugInlining: false, nameTableKind: None)
!465 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!466 = !{!41, !44, !49}
!467 = !{!462}
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !344, line: 6, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !346, line: 21, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !346, line: 13, size: 64, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !470, file: !346, line: 15, baseType: !42, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !470, file: !346, line: 20, baseType: !474, size: 32, offset: 32)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !470, file: !346, line: 16, size: 32, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !474, file: !346, line: 18, baseType: !7, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !474, file: !346, line: 19, baseType: !355, size: 32)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !482, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!482 = !{!47}
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !487, retainedTypes: !491, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/readtokens.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bd27ae043f20cb5dd96b528a940c0bf9")
!487 = !{!488}
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !486, line: 50, baseType: !7, size: 32, elements: !489)
!489 = !{!490}
!490 = !DIEnumerator(name: "bits_per_word", value: 64)
!491 = !{!44, !41, !279}
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !494, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!494 = !{!495}
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !496, line: 36, baseType: !7, size: 32, elements: !497)
!496 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!497 = !{!498}
!498 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!499 = !{!44}
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!502 = !{!503}
!503 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !501, line: 40, baseType: !7, size: 32, elements: !504)
!504 = !{!505}
!505 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!506 = !{!41}
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !509, retainedTypes: !537, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!509 = !{!510, !522}
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !511, file: !508, line: 188, baseType: !7, size: 32, elements: !520)
!511 = distinct !DISubprogram(name: "x2nrealloc", scope: !508, file: !508, line: 176, type: !512, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !507, retainedNodes: !515)
!512 = !DISubroutineType(types: !513)
!513 = !{!41, !41, !514, !44}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!515 = !{!516, !517, !518, !519}
!516 = !DILocalVariable(name: "p", arg: 1, scope: !511, file: !508, line: 176, type: !41)
!517 = !DILocalVariable(name: "pn", arg: 2, scope: !511, file: !508, line: 176, type: !514)
!518 = !DILocalVariable(name: "s", arg: 3, scope: !511, file: !508, line: 176, type: !44)
!519 = !DILocalVariable(name: "n", scope: !511, file: !508, line: 178, type: !44)
!520 = !{!521}
!521 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !523, file: !508, line: 228, baseType: !7, size: 32, elements: !520)
!523 = distinct !DISubprogram(name: "xpalloc", scope: !508, file: !508, line: 223, type: !524, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !507, retainedNodes: !527)
!524 = !DISubroutineType(types: !525)
!525 = !{!41, !41, !526, !152, !154, !152}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536}
!528 = !DILocalVariable(name: "pa", arg: 1, scope: !523, file: !508, line: 223, type: !41)
!529 = !DILocalVariable(name: "pn", arg: 2, scope: !523, file: !508, line: 223, type: !526)
!530 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !523, file: !508, line: 223, type: !152)
!531 = !DILocalVariable(name: "n_max", arg: 4, scope: !523, file: !508, line: 223, type: !154)
!532 = !DILocalVariable(name: "s", arg: 5, scope: !523, file: !508, line: 223, type: !152)
!533 = !DILocalVariable(name: "n0", scope: !523, file: !508, line: 230, type: !152)
!534 = !DILocalVariable(name: "n", scope: !523, file: !508, line: 237, type: !152)
!535 = !DILocalVariable(name: "nbytes", scope: !523, file: !508, line: 248, type: !152)
!536 = !DILocalVariable(name: "adjusted_nbytes", scope: !523, file: !508, line: 252, type: !152)
!537 = !{!39, !41, !53, !52, !46}
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!548 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !550, splitDebugInlining: false, nameTableKind: None)
!549 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!550 = !{!53, !46, !41}
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !506, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!557 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!558 = !{i32 7, !"Dwarf Version", i32 5}
!559 = !{i32 2, !"Debug Info Version", i32 3}
!560 = !{i32 1, !"wchar_size", i32 4}
!561 = !{i32 1, !"branch-target-enforcement", i32 0}
!562 = !{i32 1, !"sign-return-address", i32 0}
!563 = !{i32 1, !"sign-return-address-all", i32 0}
!564 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!565 = !{i32 7, !"PIC Level", i32 2}
!566 = !{i32 7, !"PIE Level", i32 2}
!567 = !{i32 7, !"uwtable", i32 1}
!568 = !{i32 7, !"frame-pointer", i32 1}
!569 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1941, type: !570, scopeLine: 1942, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !42}
!572 = !{!573}
!573 = !DILocalVariable(name: "status", arg: 1, scope: !569, file: !3, line: 1941, type: !42)
!574 = !DILocation(line: 0, scope: !569)
!575 = !DILocation(line: 1943, column: 14, scope: !576)
!576 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1943, column: 7)
!577 = !DILocation(line: 1943, column: 7, scope: !569)
!578 = !DILocation(line: 1944, column: 5, scope: !579)
!579 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1944, column: 5)
!580 = !{!581, !581, i64 0}
!581 = !{!"any pointer", !582, i64 0}
!582 = !{!"omnipotent char", !583, i64 0}
!583 = !{!"Simple C/C++ TBAA"}
!584 = !DILocation(line: 1947, column: 7, scope: !585)
!585 = distinct !DILexicalBlock(scope: !576, file: !3, line: 1946, column: 5)
!586 = !DILocation(line: 1951, column: 7, scope: !585)
!587 = !DILocation(line: 1956, column: 7, scope: !585)
!588 = !DILocation(line: 1960, column: 7, scope: !585)
!589 = !DILocation(line: 1961, column: 7, scope: !585)
!590 = !DILocalVariable(name: "program", arg: 1, scope: !591, file: !67, line: 836, type: !47)
!591 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !592, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !594)
!592 = !DISubroutineType(types: !593)
!593 = !{null, !47}
!594 = !{!590, !595, !604, !605, !607, !608}
!595 = !DILocalVariable(name: "infomap", scope: !591, file: !67, line: 838, type: !596)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 896, elements: !602)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !591, file: !67, line: 838, size: 128, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !598, file: !67, line: 838, baseType: !47, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !598, file: !67, line: 838, baseType: !47, size: 64, offset: 64)
!602 = !{!603}
!603 = !DISubrange(count: 7)
!604 = !DILocalVariable(name: "node", scope: !591, file: !67, line: 848, type: !47)
!605 = !DILocalVariable(name: "map_prog", scope: !591, file: !67, line: 849, type: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!607 = !DILocalVariable(name: "lc_messages", scope: !591, file: !67, line: 861, type: !47)
!608 = !DILocalVariable(name: "url_program", scope: !591, file: !67, line: 874, type: !47)
!609 = !DILocation(line: 0, scope: !591, inlinedAt: !610)
!610 = distinct !DILocation(line: 1962, column: 7, scope: !585)
!611 = !DILocation(line: 838, column: 3, scope: !591, inlinedAt: !610)
!612 = !DILocation(line: 838, column: 67, scope: !591, inlinedAt: !610)
!613 = !DILocation(line: 849, column: 36, scope: !591, inlinedAt: !610)
!614 = !DILocation(line: 851, column: 3, scope: !591, inlinedAt: !610)
!615 = !DILocalVariable(name: "__s1", arg: 1, scope: !616, file: !617, line: 1359, type: !47)
!616 = distinct !DISubprogram(name: "streq", scope: !617, file: !617, line: 1359, type: !618, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!617 = !DIFile(filename: "./lib/string.h", directory: "/src")
!618 = !DISubroutineType(types: !619)
!619 = !{!53, !47, !47}
!620 = !{!615, !621}
!621 = !DILocalVariable(name: "__s2", arg: 2, scope: !616, file: !617, line: 1359, type: !47)
!622 = !DILocation(line: 0, scope: !616, inlinedAt: !623)
!623 = distinct !DILocation(line: 851, column: 33, scope: !591, inlinedAt: !610)
!624 = !DILocation(line: 1361, column: 11, scope: !616, inlinedAt: !623)
!625 = !DILocation(line: 1361, column: 10, scope: !616, inlinedAt: !623)
!626 = !DILocation(line: 852, column: 13, scope: !591, inlinedAt: !610)
!627 = !DILocation(line: 851, column: 20, scope: !591, inlinedAt: !610)
!628 = !{!629, !581, i64 0}
!629 = !{!"infomap", !581, i64 0, !581, i64 8}
!630 = !DILocation(line: 851, column: 10, scope: !591, inlinedAt: !610)
!631 = !DILocation(line: 851, column: 28, scope: !591, inlinedAt: !610)
!632 = distinct !{!632, !614, !626, !633}
!633 = !{!"llvm.loop.mustprogress"}
!634 = !DILocation(line: 854, column: 17, scope: !635, inlinedAt: !610)
!635 = distinct !DILexicalBlock(scope: !591, file: !67, line: 854, column: 7)
!636 = !{!629, !581, i64 8}
!637 = !DILocation(line: 854, column: 7, scope: !635, inlinedAt: !610)
!638 = !DILocation(line: 854, column: 7, scope: !591, inlinedAt: !610)
!639 = !DILocation(line: 857, column: 3, scope: !591, inlinedAt: !610)
!640 = !DILocation(line: 861, column: 29, scope: !591, inlinedAt: !610)
!641 = !DILocation(line: 862, column: 7, scope: !642, inlinedAt: !610)
!642 = distinct !DILexicalBlock(scope: !591, file: !67, line: 862, column: 7)
!643 = !DILocation(line: 862, column: 19, scope: !642, inlinedAt: !610)
!644 = !DILocation(line: 862, column: 22, scope: !642, inlinedAt: !610)
!645 = !DILocation(line: 862, column: 7, scope: !591, inlinedAt: !610)
!646 = !DILocation(line: 868, column: 7, scope: !647, inlinedAt: !610)
!647 = distinct !DILexicalBlock(scope: !642, file: !67, line: 863, column: 5)
!648 = !DILocation(line: 870, column: 5, scope: !647, inlinedAt: !610)
!649 = !DILocation(line: 0, scope: !616, inlinedAt: !650)
!650 = distinct !DILocation(line: 874, column: 29, scope: !591, inlinedAt: !610)
!651 = !DILocation(line: 875, column: 3, scope: !591, inlinedAt: !610)
!652 = !DILocation(line: 877, column: 3, scope: !591, inlinedAt: !610)
!653 = !DILocation(line: 879, column: 1, scope: !591, inlinedAt: !610)
!654 = !DILocation(line: 1964, column: 3, scope: !569)
!655 = !DISubprogram(name: "dcgettext", scope: !656, file: !656, line: 51, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!656 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!657 = !DISubroutineType(types: !658)
!658 = !{!39, !47, !47, !42}
!659 = !DISubprogram(name: "fputs_unlocked", scope: !237, file: !237, line: 691, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!660 = !DISubroutineType(types: !661)
!661 = !{!42, !662, !663}
!662 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !47)
!663 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!664 = !DILocation(line: 0, scope: !66)
!665 = !DILocation(line: 581, column: 7, scope: !75)
!666 = !{!667, !667, i64 0}
!667 = !{!"int", !582, i64 0}
!668 = !DILocation(line: 581, column: 19, scope: !75)
!669 = !DILocation(line: 581, column: 7, scope: !66)
!670 = !DILocation(line: 585, column: 26, scope: !74)
!671 = !DILocation(line: 0, scope: !74)
!672 = !DILocation(line: 586, column: 23, scope: !74)
!673 = !DILocation(line: 586, column: 28, scope: !74)
!674 = !DILocation(line: 586, column: 32, scope: !74)
!675 = !{!582, !582, i64 0}
!676 = !DILocation(line: 586, column: 38, scope: !74)
!677 = !DILocation(line: 0, scope: !616, inlinedAt: !678)
!678 = distinct !DILocation(line: 586, column: 41, scope: !74)
!679 = !DILocation(line: 1361, column: 11, scope: !616, inlinedAt: !678)
!680 = !DILocation(line: 1361, column: 10, scope: !616, inlinedAt: !678)
!681 = !DILocation(line: 586, column: 19, scope: !74)
!682 = !DILocation(line: 587, column: 5, scope: !74)
!683 = !DILocation(line: 588, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!685 = !DILocation(line: 588, column: 7, scope: !66)
!686 = !DILocation(line: 590, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !684, file: !67, line: 589, column: 5)
!688 = !DILocation(line: 591, column: 7, scope: !687)
!689 = !DILocation(line: 595, column: 37, scope: !66)
!690 = !DILocation(line: 595, column: 35, scope: !66)
!691 = !DILocation(line: 596, column: 29, scope: !66)
!692 = !DILocation(line: 597, column: 8, scope: !82)
!693 = !DILocation(line: 597, column: 7, scope: !66)
!694 = !DILocation(line: 604, column: 24, scope: !81)
!695 = !DILocation(line: 604, column: 12, scope: !82)
!696 = !DILocation(line: 0, scope: !80)
!697 = !DILocation(line: 610, column: 16, scope: !80)
!698 = !DILocation(line: 610, column: 7, scope: !80)
!699 = !DILocation(line: 611, column: 21, scope: !80)
!700 = !{!701, !701, i64 0}
!701 = !{!"short", !582, i64 0}
!702 = !DILocation(line: 611, column: 19, scope: !80)
!703 = !DILocation(line: 611, column: 16, scope: !80)
!704 = !DILocation(line: 610, column: 30, scope: !80)
!705 = distinct !{!705, !698, !699, !633}
!706 = !DILocation(line: 612, column: 18, scope: !707)
!707 = distinct !DILexicalBlock(scope: !80, file: !67, line: 612, column: 11)
!708 = !DILocation(line: 612, column: 11, scope: !80)
!709 = !DILocation(line: 620, column: 23, scope: !66)
!710 = !DILocation(line: 625, column: 39, scope: !66)
!711 = !DILocation(line: 626, column: 3, scope: !66)
!712 = !DILocation(line: 626, column: 10, scope: !66)
!713 = !DILocation(line: 626, column: 21, scope: !66)
!714 = !DILocation(line: 628, column: 44, scope: !715)
!715 = distinct !DILexicalBlock(scope: !716, file: !67, line: 628, column: 11)
!716 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!717 = !DILocation(line: 628, column: 32, scope: !715)
!718 = !DILocation(line: 628, column: 49, scope: !715)
!719 = !DILocation(line: 628, column: 11, scope: !716)
!720 = !DILocation(line: 630, column: 11, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !67, line: 630, column: 11)
!722 = !DILocation(line: 630, column: 11, scope: !716)
!723 = !DILocation(line: 632, column: 26, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !67, line: 632, column: 15)
!725 = distinct !DILexicalBlock(scope: !721, file: !67, line: 631, column: 9)
!726 = !DILocation(line: 632, column: 34, scope: !724)
!727 = !DILocation(line: 632, column: 37, scope: !724)
!728 = !DILocation(line: 632, column: 15, scope: !725)
!729 = !DILocation(line: 636, column: 29, scope: !730)
!730 = distinct !DILexicalBlock(scope: !725, file: !67, line: 636, column: 15)
!731 = !DILocation(line: 640, column: 16, scope: !716)
!732 = distinct !{!732, !711, !733, !633}
!733 = !DILocation(line: 641, column: 5, scope: !66)
!734 = !DILocation(line: 644, column: 3, scope: !66)
!735 = !DILocation(line: 0, scope: !616, inlinedAt: !736)
!736 = distinct !DILocation(line: 648, column: 31, scope: !66)
!737 = !DILocation(line: 0, scope: !616, inlinedAt: !738)
!738 = distinct !DILocation(line: 649, column: 31, scope: !66)
!739 = !DILocation(line: 0, scope: !616, inlinedAt: !740)
!740 = distinct !DILocation(line: 650, column: 31, scope: !66)
!741 = !DILocation(line: 0, scope: !616, inlinedAt: !742)
!742 = distinct !DILocation(line: 651, column: 31, scope: !66)
!743 = !DILocation(line: 0, scope: !616, inlinedAt: !744)
!744 = distinct !DILocation(line: 652, column: 31, scope: !66)
!745 = !DILocation(line: 0, scope: !616, inlinedAt: !746)
!746 = distinct !DILocation(line: 653, column: 31, scope: !66)
!747 = !DILocation(line: 0, scope: !616, inlinedAt: !748)
!748 = distinct !DILocation(line: 654, column: 31, scope: !66)
!749 = !DILocation(line: 0, scope: !616, inlinedAt: !750)
!750 = distinct !DILocation(line: 655, column: 31, scope: !66)
!751 = !DILocation(line: 0, scope: !616, inlinedAt: !752)
!752 = distinct !DILocation(line: 656, column: 31, scope: !66)
!753 = !DILocation(line: 0, scope: !616, inlinedAt: !754)
!754 = distinct !DILocation(line: 657, column: 31, scope: !66)
!755 = !DILocation(line: 663, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!757 = !DILocation(line: 664, column: 7, scope: !756)
!758 = !DILocation(line: 664, column: 10, scope: !756)
!759 = !DILocation(line: 663, column: 7, scope: !66)
!760 = !DILocation(line: 669, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !756, file: !67, line: 665, column: 5)
!762 = !DILocation(line: 671, column: 5, scope: !761)
!763 = !DILocation(line: 676, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !756, file: !67, line: 673, column: 5)
!765 = !DILocation(line: 679, column: 3, scope: !66)
!766 = !DILocation(line: 683, column: 3, scope: !66)
!767 = !DILocation(line: 686, column: 3, scope: !66)
!768 = !DILocation(line: 688, column: 3, scope: !66)
!769 = !DILocation(line: 691, column: 3, scope: !66)
!770 = !DILocation(line: 695, column: 3, scope: !66)
!771 = !DILocation(line: 696, column: 1, scope: !66)
!772 = !DISubprogram(name: "setlocale", scope: !773, file: !773, line: 122, type: !774, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!773 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!774 = !DISubroutineType(types: !775)
!775 = !{!39, !42, !47}
!776 = !DISubprogram(name: "getenv", scope: !777, file: !777, line: 641, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!777 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!778 = !DISubroutineType(types: !779)
!779 = !{!39, !47}
!780 = !DISubprogram(name: "fwrite_unlocked", scope: !237, file: !237, line: 704, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!781 = !DISubroutineType(types: !782)
!782 = !{!44, !783, !44, !44, !663}
!783 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!786 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1995, type: !787, scopeLine: 1996, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!787 = !DISubroutineType(types: !788)
!788 = !{!42, !42, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!790 = !{!791, !792, !793, !794, !795}
!791 = !DILocalVariable(name: "argc", arg: 1, scope: !786, file: !3, line: 1995, type: !42)
!792 = !DILocalVariable(name: "argv", arg: 2, scope: !786, file: !3, line: 1995, type: !789)
!793 = !DILocalVariable(name: "c", scope: !786, file: !3, line: 2005, type: !42)
!794 = !DILocalVariable(name: "ok", scope: !786, file: !3, line: 2029, type: !53)
!795 = !DILocalVariable(name: "i", scope: !796, file: !3, line: 2035, type: !42)
!796 = distinct !DILexicalBlock(scope: !797, file: !3, line: 2035, column: 7)
!797 = distinct !DILexicalBlock(scope: !798, file: !3, line: 2033, column: 5)
!798 = distinct !DILexicalBlock(scope: !786, file: !3, line: 2030, column: 7)
!799 = !DILocation(line: 0, scope: !786)
!800 = !DILocation(line: 1998, column: 21, scope: !786)
!801 = !DILocation(line: 1998, column: 3, scope: !786)
!802 = !DILocation(line: 1999, column: 3, scope: !786)
!803 = !DILocation(line: 2000, column: 3, scope: !786)
!804 = !DILocation(line: 2001, column: 3, scope: !786)
!805 = !DILocation(line: 2003, column: 3, scope: !786)
!806 = !DILocation(line: 2006, column: 3, scope: !786)
!807 = !DILocation(line: 2006, column: 15, scope: !786)
!808 = !DILocation(line: 2016, column: 11, scope: !809)
!809 = distinct !DILexicalBlock(scope: !810, file: !3, line: 2009, column: 9)
!810 = distinct !DILexicalBlock(scope: !786, file: !3, line: 2007, column: 5)
!811 = !DILocation(line: 2018, column: 9, scope: !809)
!812 = !DILocation(line: 2020, column: 9, scope: !809)
!813 = !DILocation(line: 2023, column: 11, scope: !809)
!814 = !DILocation(line: 0, scope: !809)
!815 = distinct !{!815, !806, !816, !633}
!816 = !DILocation(line: 2025, column: 5, scope: !786)
!817 = !DILocation(line: 2027, column: 3, scope: !786)
!818 = !DILocation(line: 2030, column: 15, scope: !798)
!819 = !DILocation(line: 2030, column: 12, scope: !798)
!820 = !DILocation(line: 2030, column: 7, scope: !786)
!821 = !DILocation(line: 2035, column: 7, scope: !796)
!822 = !DILocalVariable(name: "ok", scope: !823, file: !3, line: 1971, type: !53)
!823 = distinct !DISubprogram(name: "do_stdin", scope: !3, file: !3, line: 1969, type: !824, scopeLine: 1970, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{!53}
!826 = !{!822, !827, !834}
!827 = !DILocalVariable(name: "tokenbuffer", scope: !823, file: !3, line: 1972, type: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_buffer", file: !829, line: 38, baseType: !830)
!829 = !DIFile(filename: "./lib/readtokens.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75cc48641d199743577b153a0d1c82de")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !829, line: 33, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !829, line: 35, baseType: !44, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !830, file: !829, line: 36, baseType: !39, size: 64, offset: 64)
!834 = !DILocalVariable(name: "token_length", scope: !835, file: !3, line: 1978, type: !44)
!835 = distinct !DILexicalBlock(scope: !823, file: !3, line: 1977, column: 5)
!836 = !DILocation(line: 0, scope: !823, inlinedAt: !837)
!837 = distinct !DILocation(line: 2031, column: 10, scope: !798)
!838 = !DILocation(line: 1972, column: 3, scope: !823, inlinedAt: !837)
!839 = !DILocation(line: 1972, column: 16, scope: !823, inlinedAt: !837)
!840 = !DILocation(line: 1974, column: 3, scope: !823, inlinedAt: !837)
!841 = !DILocation(line: 1978, column: 40, scope: !835, inlinedAt: !837)
!842 = !DILocation(line: 1978, column: 29, scope: !835, inlinedAt: !837)
!843 = !DILocation(line: 0, scope: !835, inlinedAt: !837)
!844 = !DILocation(line: 1980, column: 24, scope: !845, inlinedAt: !837)
!845 = distinct !DILexicalBlock(scope: !835, file: !3, line: 1980, column: 11)
!846 = !DILocation(line: 1980, column: 11, scope: !835, inlinedAt: !837)
!847 = !DILocation(line: 1982, column: 15, scope: !848, inlinedAt: !837)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 1982, column: 15)
!849 = distinct !DILexicalBlock(scope: !845, file: !3, line: 1981, column: 9)
!850 = !DILocalVariable(name: "__stream", arg: 1, scope: !851, file: !852, line: 135, type: !89)
!851 = distinct !DISubprogram(name: "ferror_unlocked", scope: !852, file: !852, line: 135, type: !853, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !855)
!852 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!853 = !DISubroutineType(types: !854)
!854 = !{!42, !89}
!855 = !{!850}
!856 = !DILocation(line: 0, scope: !851, inlinedAt: !857)
!857 = distinct !DILocation(line: 1982, column: 15, scope: !848, inlinedAt: !837)
!858 = !DILocation(line: 137, column: 10, scope: !851, inlinedAt: !857)
!859 = !{!860, !667, i64 0}
!860 = !{!"_IO_FILE", !667, i64 0, !581, i64 8, !581, i64 16, !581, i64 24, !581, i64 32, !581, i64 40, !581, i64 48, !581, i64 56, !581, i64 64, !581, i64 72, !581, i64 80, !581, i64 88, !581, i64 96, !581, i64 104, !667, i64 112, !667, i64 116, !861, i64 120, !701, i64 128, !582, i64 130, !582, i64 131, !581, i64 136, !861, i64 144, !581, i64 152, !581, i64 160, !581, i64 168, !581, i64 176, !861, i64 184, !667, i64 192, !582, i64 196}
!861 = !{!"long", !582, i64 0}
!862 = !DILocation(line: 1982, column: 15, scope: !849, inlinedAt: !837)
!863 = !DILocation(line: 1983, column: 13, scope: !848, inlinedAt: !837)
!864 = !DILocation(line: 1987, column: 40, scope: !835, inlinedAt: !837)
!865 = !{!866, !581, i64 8}
!866 = !{!"tokenbuffer", !861, i64 0, !581, i64 8}
!867 = !DILocation(line: 1987, column: 13, scope: !835, inlinedAt: !837)
!868 = !DILocation(line: 1987, column: 10, scope: !835, inlinedAt: !837)
!869 = !DILocation(line: 1989, column: 21, scope: !823, inlinedAt: !837)
!870 = !DILocation(line: 1989, column: 3, scope: !823, inlinedAt: !837)
!871 = !DILocation(line: 1992, column: 1, scope: !823, inlinedAt: !837)
!872 = !DILocation(line: 2031, column: 5, scope: !798)
!873 = !DILocation(line: 0, scope: !796)
!874 = !DILocation(line: 2036, column: 30, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 2036, column: 13)
!876 = distinct !DILexicalBlock(scope: !796, file: !3, line: 2035, column: 7)
!877 = !DILocation(line: 2036, column: 15, scope: !875)
!878 = !DILocation(line: 2036, column: 13, scope: !876)
!879 = !DILocation(line: 2035, column: 39, scope: !876)
!880 = !DILocation(line: 2035, column: 30, scope: !876)
!881 = distinct !{!881, !821, !882, !633}
!882 = !DILocation(line: 2037, column: 16, scope: !796)
!883 = !DILocation(line: 2040, column: 10, scope: !786)
!884 = !DILocation(line: 2040, column: 3, scope: !786)
!885 = !DISubprogram(name: "bindtextdomain", scope: !656, file: !656, line: 86, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!886 = !DISubroutineType(types: !887)
!887 = !{!39, !47, !47}
!888 = !DISubprogram(name: "textdomain", scope: !656, file: !656, line: 82, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!889 = !DISubprogram(name: "atexit", scope: !777, file: !777, line: 602, type: !890, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!890 = !DISubroutineType(types: !891)
!891 = !{!42, !263}
!892 = !DISubprogram(name: "getopt_long", scope: !202, file: !202, line: 66, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !198)
!893 = !DISubroutineType(types: !894)
!894 = !{!42, !42, !895, !47, !897, !207}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!898 = distinct !DISubprogram(name: "lbuf_flush", scope: !3, file: !3, line: 1693, type: !196, scopeLine: 1694, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !899)
!899 = !{!900}
!900 = !DILocalVariable(name: "size", scope: !898, file: !3, line: 1695, type: !152)
!901 = !DILocation(line: 1695, column: 16, scope: !898)
!902 = !{!861, !861, i64 0}
!903 = !DILocation(line: 0, scope: !898)
!904 = !DILocation(line: 1698, column: 13, scope: !898)
!905 = !DILocation(line: 1700, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !898, file: !3, line: 1700, column: 7)
!907 = !DILocation(line: 1700, column: 50, scope: !906)
!908 = !DILocation(line: 1700, column: 7, scope: !898)
!909 = !DILocation(line: 948, column: 21, scope: !910, inlinedAt: !913)
!910 = distinct !DISubprogram(name: "write_error", scope: !67, file: !67, line: 946, type: !196, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !911)
!911 = !{!912}
!912 = !DILocalVariable(name: "saved_errno", scope: !910, file: !67, line: 948, type: !42)
!913 = distinct !DILocation(line: 1701, column: 5, scope: !906)
!914 = !DILocation(line: 0, scope: !910, inlinedAt: !913)
!915 = !DILocation(line: 949, column: 3, scope: !910, inlinedAt: !913)
!916 = !DILocation(line: 950, column: 11, scope: !910, inlinedAt: !913)
!917 = !DILocation(line: 950, column: 3, scope: !910, inlinedAt: !913)
!918 = !DILocation(line: 951, column: 3, scope: !910, inlinedAt: !913)
!919 = !DILocation(line: 952, column: 3, scope: !910, inlinedAt: !913)
!920 = !DILocation(line: 1702, column: 1, scope: !898)
!921 = distinct !DISubprogram(name: "print_factors", scope: !3, file: !3, line: 1873, type: !922, scopeLine: 1874, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !924)
!922 = !DISubroutineType(types: !923)
!923 = !{!53, !47}
!924 = !{!925, !926, !927, !933, !935, !944, !955, !957}
!925 = !DILocalVariable(name: "input", arg: 1, scope: !921, file: !3, line: 1873, type: !47)
!926 = !DILocalVariable(name: "str", scope: !921, file: !3, line: 1876, type: !47)
!927 = !DILocalVariable(name: "u", scope: !921, file: !3, line: 1885, type: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "uuint", file: !3, line: 213, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 213, size: 128, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "uu", scope: !929, file: !3, line: 213, baseType: !932, size: 128)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !357)
!933 = !DILocalVariable(name: "err", scope: !921, file: !3, line: 1886, type: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "strtol_error", file: !22, line: 43, baseType: !21)
!935 = !DILocalVariable(name: "t", scope: !921, file: !3, line: 1911, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpz_t", file: !51, line: 77, baseType: !937)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 128, elements: !121)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !51, line: 75, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 67, size: 128, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !939, file: !51, line: 69, baseType: !42, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !939, file: !51, line: 71, baseType: !42, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !939, file: !51, line: 74, baseType: !59, size: 64, offset: 64)
!944 = !DILocalVariable(name: "factors", scope: !921, file: !3, line: 1918, type: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mp_factors", file: !3, line: 288, size: 192, elements: !946)
!946 = !{!947, !953, !954}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !945, file: !3, line: 292, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mp_factor", file: !3, line: 281, size: 192, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !949, file: !3, line: 283, baseType: !936, size: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !949, file: !3, line: 284, baseType: !278, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "nfactors", scope: !945, file: !3, line: 293, baseType: !152, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "nalloc", scope: !945, file: !3, line: 294, baseType: !152, size: 64, offset: 128)
!955 = !DILocalVariable(name: "j", scope: !956, file: !3, line: 1920, type: !152)
!956 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1920, column: 3)
!957 = !DILocalVariable(name: "k", scope: !958, file: !3, line: 1921, type: !278)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 1921, column: 5)
!959 = distinct !DILexicalBlock(scope: !956, file: !3, line: 1920, column: 3)
!960 = !DILocation(line: 0, scope: !921)
!961 = !DILocation(line: 1877, column: 3, scope: !921)
!962 = !DILocation(line: 1877, column: 10, scope: !921)
!963 = !DILocation(line: 1877, column: 15, scope: !921)
!964 = !DILocation(line: 1878, column: 8, scope: !921)
!965 = distinct !{!965, !961, !964, !633}
!966 = !DILocation(line: 1879, column: 15, scope: !921)
!967 = !DILocation(line: 1879, column: 7, scope: !921)
!968 = !DILocalVariable(name: "u", arg: 1, scope: !969, file: !3, line: 1632, type: !972)
!969 = distinct !DISubprogram(name: "strtouuint", scope: !3, file: !3, line: 1632, type: !970, scopeLine: 1633, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !973)
!970 = !DISubroutineType(types: !971)
!971 = !{!934, !972, !47}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!973 = !{!968, !974, !975, !976, !977}
!974 = !DILocalVariable(name: "s", arg: 2, scope: !969, file: !3, line: 1632, type: !47)
!975 = !DILocalVariable(name: "hi", scope: !969, file: !3, line: 1634, type: !60)
!976 = !DILocalVariable(name: "lo", scope: !969, file: !3, line: 1634, type: !60)
!977 = !DILocalVariable(name: "lo_carry", scope: !978, file: !3, line: 1644, type: !42)
!978 = distinct !DILexicalBlock(scope: !979, file: !3, line: 1640, column: 5)
!979 = distinct !DILexicalBlock(scope: !980, file: !3, line: 1639, column: 3)
!980 = distinct !DILexicalBlock(scope: !969, file: !3, line: 1639, column: 3)
!981 = !DILocation(line: 0, scope: !969, inlinedAt: !982)
!982 = distinct !DILocation(line: 1886, column: 22, scope: !921)
!983 = !DILocation(line: 1634, column: 26, scope: !969, inlinedAt: !982)
!984 = !DILocation(line: 1634, column: 31, scope: !969, inlinedAt: !982)
!985 = !DILocation(line: 1636, column: 7, scope: !986, inlinedAt: !982)
!986 = distinct !DILexicalBlock(scope: !969, file: !3, line: 1636, column: 7)
!987 = !DILocation(line: 1636, column: 7, scope: !969, inlinedAt: !982)
!988 = !{!"branch_weights", i32 1, i32 2000}
!989 = !DILocation(line: 1639, column: 10, scope: !979, inlinedAt: !982)
!990 = !DILocation(line: 1639, column: 3, scope: !980, inlinedAt: !982)
!991 = !{!"branch_weights", i32 2000, i32 1}
!992 = !DILocation(line: 1641, column: 11, scope: !993, inlinedAt: !982)
!993 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1641, column: 11)
!994 = !DILocation(line: 1641, column: 11, scope: !978, inlinedAt: !982)
!995 = !DILocation(line: 1644, column: 26, scope: !978, inlinedAt: !982)
!996 = !DILocation(line: 1644, column: 54, scope: !978, inlinedAt: !982)
!997 = !DILocation(line: 1644, column: 48, scope: !978, inlinedAt: !982)
!998 = !DILocation(line: 1644, column: 22, scope: !978, inlinedAt: !982)
!999 = !DILocation(line: 0, scope: !978, inlinedAt: !982)
!1000 = !DILocation(line: 1645, column: 22, scope: !978, inlinedAt: !982)
!1001 = !DILocation(line: 1645, column: 31, scope: !978, inlinedAt: !982)
!1002 = !DILocation(line: 1645, column: 27, scope: !978, inlinedAt: !982)
!1003 = !DILocation(line: 1645, column: 16, scope: !978, inlinedAt: !982)
!1004 = !DILocation(line: 1648, column: 19, scope: !978, inlinedAt: !982)
!1005 = !DILocation(line: 1648, column: 16, scope: !978, inlinedAt: !982)
!1006 = !DILocation(line: 1649, column: 11, scope: !1007, inlinedAt: !982)
!1007 = distinct !DILexicalBlock(scope: !978, file: !3, line: 1649, column: 11)
!1008 = distinct !{!1008, !990, !1009, !633}
!1009 = !DILocation(line: 1651, column: 5, scope: !980, inlinedAt: !982)
!1010 = !DILocation(line: 1653, column: 7, scope: !1011, inlinedAt: !982)
!1011 = distinct !DILexicalBlock(scope: !969, file: !3, line: 1653, column: 7)
!1012 = !DILocation(line: 1653, column: 7, scope: !969, inlinedAt: !982)
!1013 = !DILocation(line: 1891, column: 39, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 1891, column: 11)
!1015 = distinct !DILexicalBlock(scope: !921, file: !3, line: 1889, column: 5)
!1016 = !DILocation(line: 1891, column: 11, scope: !1015)
!1017 = !DILocation(line: 1893, column: 11, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 1893, column: 11)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1893, column: 11)
!1020 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1892, column: 9)
!1021 = !DILocation(line: 1893, column: 11, scope: !1019)
!1022 = !DILocalVariable(name: "t", arg: 1, scope: !1023, file: !3, line: 1836, type: !928)
!1023 = distinct !DISubprogram(name: "print_factors_single", scope: !3, file: !3, line: 1836, type: !1024, scopeLine: 1837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1026)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{null, !928}
!1026 = !{!1022, !1027, !1038, !1040}
!1027 = !DILocalVariable(name: "factors", scope: !1023, file: !3, line: 1838, type: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "factors", file: !3, line: 266, size: 2048, elements: !1029)
!1029 = !{!1030, !1031, !1035, !1037}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "plarge", scope: !1028, file: !3, line: 271, baseType: !928, size: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1028, file: !3, line: 275, baseType: !1032, size: 1664, offset: 128)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 1664, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 26)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1028, file: !3, line: 276, baseType: !1036, size: 208, offset: 1792)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 208, elements: !1033)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "nfactors", scope: !1028, file: !3, line: 277, baseType: !49, size: 8, offset: 2000)
!1038 = !DILocalVariable(name: "j", scope: !1039, file: !3, line: 1845, type: !42)
!1039 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 1845, column: 3)
!1040 = !DILocalVariable(name: "k", scope: !1041, file: !3, line: 1846, type: !42)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 1846, column: 5)
!1042 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 1845, column: 3)
!1043 = !DILocation(line: 0, scope: !1023, inlinedAt: !1044)
!1044 = distinct !DILocation(line: 1894, column: 11, scope: !1020)
!1045 = !DILocation(line: 1838, column: 3, scope: !1023, inlinedAt: !1044)
!1046 = !DILocation(line: 1838, column: 18, scope: !1023, inlinedAt: !1044)
!1047 = !DILocalVariable(name: "t", arg: 1, scope: !1048, file: !3, line: 1787, type: !928)
!1048 = distinct !DISubprogram(name: "print_uuint", scope: !3, file: !3, line: 1787, type: !1024, scopeLine: 1788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1049)
!1049 = !{!1047, !1050, !1051, !1052, !1053, !1055, !1057, !1058, !1059, !1060, !1061, !1063}
!1050 = !DILocalVariable(name: "t1", scope: !1048, file: !3, line: 1789, type: !60)
!1051 = !DILocalVariable(name: "t0", scope: !1048, file: !3, line: 1789, type: !60)
!1052 = !DILocalVariable(name: "bufend", scope: !1048, file: !3, line: 1790, type: !39)
!1053 = !DILocalVariable(name: "r", scope: !1054, file: !3, line: 1794, type: !60)
!1054 = distinct !DILexicalBlock(scope: !1048, file: !3, line: 1793, column: 5)
!1055 = !DILocalVariable(name: "__d1", scope: !1056, file: !3, line: 1796, type: !60)
!1056 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1796, column: 7)
!1057 = !DILocalVariable(name: "__d0", scope: !1056, file: !3, line: 1796, type: !60)
!1058 = !DILocalVariable(name: "__q", scope: !1056, file: !3, line: 1796, type: !60)
!1059 = !DILocalVariable(name: "__r1", scope: !1056, file: !3, line: 1796, type: !60)
!1060 = !DILocalVariable(name: "__r0", scope: !1056, file: !3, line: 1796, type: !60)
!1061 = !DILocalVariable(name: "__i", scope: !1062, file: !3, line: 1796, type: !42)
!1062 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 1796, column: 7)
!1063 = !DILocalVariable(name: "i", scope: !1064, file: !3, line: 1797, type: !42)
!1064 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 1797, column: 7)
!1065 = !DILocation(line: 0, scope: !1048, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 1840, column: 3, scope: !1023, inlinedAt: !1044)
!1067 = !DILocation(line: 1792, column: 3, scope: !1048, inlinedAt: !1066)
!1068 = !DILocation(line: 1755, column: 3, scope: !1069, inlinedAt: !1077)
!1069 = distinct !DISubprogram(name: "lbuf_putint_append", scope: !3, file: !3, line: 1752, type: !1070, scopeLine: 1753, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1072)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !60, !39}
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DILocalVariable(name: "i", arg: 1, scope: !1069, file: !3, line: 1752, type: !60)
!1074 = !DILocalVariable(name: "bufend", arg: 2, scope: !1069, file: !3, line: 1752, type: !39)
!1075 = !DILocalVariable(name: "istr", scope: !1069, file: !3, line: 1754, type: !39)
!1076 = !DILocalVariable(name: "p", scope: !1069, file: !3, line: 1762, type: !39)
!1077 = distinct !DILocation(line: 1804, column: 3, scope: !1048, inlinedAt: !1066)
!1078 = !DILocation(line: 1795, column: 10, scope: !1054, inlinedAt: !1066)
!1079 = distinct !{!1079, !1067, !1080, !633}
!1080 = !DILocation(line: 1802, column: 5, scope: !1048, inlinedAt: !1066)
!1081 = !DILocation(line: 0, scope: !1056, inlinedAt: !1066)
!1082 = !DILocation(line: 0, scope: !1054, inlinedAt: !1066)
!1083 = !DILocation(line: 0, scope: !1062, inlinedAt: !1066)
!1084 = !DILocation(line: 1796, column: 7, scope: !1062, inlinedAt: !1066)
!1085 = !DILocation(line: 1796, column: 7, scope: !1086, inlinedAt: !1066)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 1796, column: 7)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !3, line: 1796, column: 7)
!1088 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 1796, column: 7)
!1089 = !DILocation(line: 1796, column: 7, scope: !1087, inlinedAt: !1066)
!1090 = !DILocalVariable(name: "ah", arg: 1, scope: !1091, file: !3, line: 404, type: !60)
!1091 = distinct !DISubprogram(name: "ge2", scope: !3, file: !3, line: 404, type: !1092, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1094)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!53, !60, !60, !60, !60}
!1094 = !{!1090, !1095, !1096, !1097}
!1095 = !DILocalVariable(name: "al", arg: 2, scope: !1091, file: !3, line: 404, type: !60)
!1096 = !DILocalVariable(name: "bh", arg: 3, scope: !1091, file: !3, line: 404, type: !60)
!1097 = !DILocalVariable(name: "bl", arg: 4, scope: !1091, file: !3, line: 404, type: !60)
!1098 = !DILocation(line: 0, scope: !1091, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 1796, column: 7, scope: !1100, inlinedAt: !1066)
!1100 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 1796, column: 7)
!1101 = !DILocalVariable(name: "ah", arg: 1, scope: !1102, file: !3, line: 394, type: !60)
!1102 = distinct !DISubprogram(name: "lt2", scope: !3, file: !3, line: 394, type: !1092, scopeLine: 395, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1103)
!1103 = !{!1101, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!1104 = !DILocalVariable(name: "al", arg: 2, scope: !1102, file: !3, line: 394, type: !60)
!1105 = !DILocalVariable(name: "bh", arg: 3, scope: !1102, file: !3, line: 394, type: !60)
!1106 = !DILocalVariable(name: "bl", arg: 4, scope: !1102, file: !3, line: 394, type: !60)
!1107 = !DILocalVariable(name: "dh", scope: !1102, file: !3, line: 396, type: !60)
!1108 = !DILocalVariable(name: "dl", scope: !1102, file: !3, line: 396, type: !60)
!1109 = !DILocalVariable(name: "vh", scope: !1102, file: !3, line: 397, type: !53)
!1110 = !DILocalVariable(name: "vl", scope: !1102, file: !3, line: 398, type: !60)
!1111 = !DILocation(line: 0, scope: !1102, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 406, column: 11, scope: !1091, inlinedAt: !1099)
!1113 = !DILocation(line: 397, column: 13, scope: !1102, inlinedAt: !1112)
!1114 = !DILocation(line: 398, column: 18, scope: !1102, inlinedAt: !1112)
!1115 = !DILocation(line: 399, column: 15, scope: !1102, inlinedAt: !1112)
!1116 = !DILocation(line: 399, column: 13, scope: !1102, inlinedAt: !1112)
!1117 = !DILocation(line: 1796, column: 7, scope: !1118, inlinedAt: !1066)
!1118 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 1796, column: 7)
!1119 = !DILocation(line: 1796, column: 7, scope: !1120, inlinedAt: !1066)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 1796, column: 7)
!1121 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 1796, column: 7)
!1122 = !{i64 2152638758, i64 2152638778}
!1123 = !DILocation(line: 0, scope: !1087, inlinedAt: !1066)
!1124 = !DILocation(line: 1796, column: 7, scope: !1088, inlinedAt: !1066)
!1125 = distinct !{!1125, !1084, !1084, !633}
!1126 = !DILocation(line: 0, scope: !1064, inlinedAt: !1066)
!1127 = !DILocation(line: 1800, column: 13, scope: !1128, inlinedAt: !1066)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 1798, column: 9)
!1129 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1797, column: 7)
!1130 = !DILocation(line: 1799, column: 23, scope: !1128, inlinedAt: !1066)
!1131 = !DILocation(line: 1799, column: 12, scope: !1128, inlinedAt: !1066)
!1132 = !DILocation(line: 1799, column: 21, scope: !1128, inlinedAt: !1066)
!1133 = !DILocation(line: 1797, column: 49, scope: !1129, inlinedAt: !1066)
!1134 = !DILocation(line: 1797, column: 25, scope: !1129, inlinedAt: !1066)
!1135 = !DILocation(line: 1797, column: 7, scope: !1064, inlinedAt: !1066)
!1136 = distinct !{!1136, !1135, !1137, !633}
!1137 = !DILocation(line: 1801, column: 9, scope: !1064, inlinedAt: !1066)
!1138 = !DILocation(line: 0, scope: !1069, inlinedAt: !1077)
!1139 = !DILocation(line: 1758, column: 9, scope: !1140, inlinedAt: !1077)
!1140 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 1756, column: 5)
!1141 = !DILocation(line: 1757, column: 17, scope: !1140, inlinedAt: !1077)
!1142 = !DILocation(line: 1757, column: 8, scope: !1140, inlinedAt: !1077)
!1143 = !DILocation(line: 1757, column: 15, scope: !1140, inlinedAt: !1077)
!1144 = !DILocation(line: 1759, column: 5, scope: !1140, inlinedAt: !1077)
!1145 = distinct !{!1145, !1068, !1146, !633}
!1146 = !DILocation(line: 1760, column: 11, scope: !1069, inlinedAt: !1077)
!1147 = !DILocation(line: 1762, column: 24, scope: !1069, inlinedAt: !1077)
!1148 = !DILocation(line: 1762, column: 22, scope: !1069, inlinedAt: !1077)
!1149 = !DILocation(line: 1764, column: 7, scope: !1069, inlinedAt: !1077)
!1150 = !DILocation(line: 1764, column: 10, scope: !1069, inlinedAt: !1077)
!1151 = !DILocation(line: 1765, column: 15, scope: !1069, inlinedAt: !1077)
!1152 = !DILocation(line: 1764, column: 5, scope: !1069, inlinedAt: !1077)
!1153 = distinct !{!1153, !1154, !1155, !633}
!1154 = !DILocation(line: 1763, column: 3, scope: !1069, inlinedAt: !1077)
!1155 = !DILocation(line: 1765, column: 43, scope: !1069, inlinedAt: !1077)
!1156 = !DILocation(line: 1764, column: 12, scope: !1069, inlinedAt: !1077)
!1157 = !{!1158}
!1158 = distinct !{!1158, !1159}
!1159 = distinct !{!1159, !"LVerDomain"}
!1160 = !{!1161}
!1161 = distinct !{!1161, !1159}
!1162 = distinct !{!1162, !1154, !1155, !633, !1163}
!1163 = !{!"llvm.loop.isvectorized", i32 1}
!1164 = !DILocation(line: 1764, column: 17, scope: !1069, inlinedAt: !1077)
!1165 = distinct !{!1165, !1154, !1155, !633, !1163}
!1166 = !DILocation(line: 1767, column: 17, scope: !1069, inlinedAt: !1077)
!1167 = !DILocalVariable(name: "c", arg: 1, scope: !1168, file: !3, line: 1725, type: !40)
!1168 = distinct !DISubprogram(name: "lbuf_putc", scope: !3, file: !3, line: 1725, type: !1169, scopeLine: 1726, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1171)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !40}
!1171 = !{!1167}
!1172 = !DILocation(line: 0, scope: !1168, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 1841, column: 3, scope: !1023, inlinedAt: !1044)
!1174 = !DILocation(line: 1727, column: 21, scope: !1168, inlinedAt: !1173)
!1175 = !DILocation(line: 1727, column: 3, scope: !1168, inlinedAt: !1173)
!1176 = !DILocation(line: 1727, column: 25, scope: !1168, inlinedAt: !1173)
!1177 = !DILocalVariable(name: "factors", arg: 1, scope: !1178, file: !3, line: 1600, type: !1181)
!1178 = distinct !DISubprogram(name: "factor", scope: !3, file: !3, line: 1600, type: !1179, scopeLine: 1601, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1182)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !1181, !60, !60}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1182 = !{!1177, !1183, !1184}
!1183 = !DILocalVariable(name: "t1", arg: 2, scope: !1178, file: !3, line: 1600, type: !60)
!1184 = !DILocalVariable(name: "t0", arg: 3, scope: !1178, file: !3, line: 1600, type: !60)
!1185 = !DILocation(line: 0, scope: !1178, inlinedAt: !1186)
!1186 = distinct !DILocation(line: 1843, column: 3, scope: !1023, inlinedAt: !1044)
!1187 = !DILocation(line: 1602, column: 3, scope: !1178, inlinedAt: !1186)
!1188 = !DILocation(line: 0, scope: !1039, inlinedAt: !1044)
!1189 = !{!1190, !582, i64 250}
!1190 = !{!"factors", !1191, i64 0, !582, i64 16, !582, i64 224, !582, i64 250}
!1191 = !{!"", !582, i64 0}
!1192 = !DILocation(line: 1845, column: 21, scope: !1042, inlinedAt: !1044)
!1193 = !DILocation(line: 1845, column: 3, scope: !1039, inlinedAt: !1044)
!1194 = !DILocation(line: 0, scope: !1041, inlinedAt: !1044)
!1195 = !DILocation(line: 1846, column: 23, scope: !1196, inlinedAt: !1044)
!1196 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 1846, column: 5)
!1197 = !DILocation(line: 1846, column: 5, scope: !1041, inlinedAt: !1044)
!1198 = !DILocalVariable(name: "pu", arg: 1, scope: !1199, file: !3, line: 221, type: !1202)
!1199 = distinct !DISubprogram(name: "hi_is_set", scope: !3, file: !3, line: 221, type: !1200, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1204)
