; ModuleID = 'src/fmt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.Word = type { i8*, i32, i32, i8, i32, i64, %struct.Word* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [42 x i8] c"Usage: %s [-WIDTH] [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [129 x i8] c"Reformat each paragraph in the FILE(s), writing to standard output.\0AThe option -WIDTH is an abbreviated form of --width=DIGITS.\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"fmt\00", align 1

!43 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!46 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!47 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!48 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!49 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!50 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!51 = !{!52, !54, !55, !56, !57, !60, !62, !63, !64}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!59 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "COST", file: !3, line: 63, baseType: !65)
!65 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!66 = !{!67, !70, !72, !74, !76, !78, !0, !163, !165, !167, !169, !171, !173, !175, !177, !179, !181, !183, !185, !187, !189, !191, !196, !198, !217}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "crown", scope: !2, file: !3, line: 173, type: !69, isLocal: true, isDefinition: true)
!69 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "tagged", scope: !2, file: !3, line: 176, type: !69, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "split", scope: !2, file: !3, line: 179, type: !69, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "uniform", scope: !2, file: !3, line: 182, type: !69, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "goal_width", scope: !2, file: !3, line: 203, type: !55, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !80, file: !81, line: 575, type: !55, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "oputs_", scope: !81, file: !81, line: 573, type: !82, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !84)
!81 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!82 = !DISubroutineType(types: !83)
!83 = !{null, !60, !60}
!84 = !{!85, !86, !87, !90, !91, !92, !93, !97, !98, !99, !100, !102, !157, !158, !159, !161, !162}
!85 = !DILocalVariable(name: "program", arg: 1, scope: !80, file: !81, line: 573, type: !60)
!86 = !DILocalVariable(name: "option", arg: 2, scope: !80, file: !81, line: 573, type: !60)
!87 = !DILocalVariable(name: "term", scope: !88, file: !81, line: 585, type: !60)
!88 = distinct !DILexicalBlock(scope: !89, file: !81, line: 582, column: 5)
!89 = distinct !DILexicalBlock(scope: !80, file: !81, line: 581, column: 7)
!90 = !DILocalVariable(name: "double_space", scope: !80, file: !81, line: 594, type: !69)
!91 = !DILocalVariable(name: "first_word", scope: !80, file: !81, line: 595, type: !60)
!92 = !DILocalVariable(name: "option_text", scope: !80, file: !81, line: 596, type: !60)
!93 = !DILocalVariable(name: "s", scope: !94, file: !81, line: 608, type: !60)
!94 = distinct !DILexicalBlock(scope: !95, file: !81, line: 605, column: 5)
!95 = distinct !DILexicalBlock(scope: !96, file: !81, line: 604, column: 12)
!96 = distinct !DILexicalBlock(scope: !80, file: !81, line: 597, column: 7)
!97 = !DILocalVariable(name: "spaces", scope: !94, file: !81, line: 609, type: !57)
!98 = !DILocalVariable(name: "anchor_len", scope: !80, file: !81, line: 620, type: !57)
!99 = !DILocalVariable(name: "desc_text", scope: !80, file: !81, line: 625, type: !60)
!100 = !DILocalVariable(name: "__ptr", scope: !101, file: !81, line: 644, type: !60)
!101 = distinct !DILexicalBlock(scope: !80, file: !81, line: 644, column: 3)
!102 = !DILocalVariable(name: "__stream", scope: !101, file: !81, line: 644, type: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !105, line: 7, baseType: !106)
!105 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !107, line: 49, size: 1728, elements: !108)
!107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !124, !126, !127, !128, !131, !132, !134, !138, !141, !143, !146, !149, !150, !151, !152, !153}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !106, file: !107, line: 51, baseType: !55, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !106, file: !107, line: 54, baseType: !52, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !106, file: !107, line: 55, baseType: !52, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !106, file: !107, line: 56, baseType: !52, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !106, file: !107, line: 57, baseType: !52, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !106, file: !107, line: 58, baseType: !52, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !106, file: !107, line: 59, baseType: !52, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !106, file: !107, line: 60, baseType: !52, size: 64, offset: 448)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !106, file: !107, line: 61, baseType: !52, size: 64, offset: 512)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !106, file: !107, line: 64, baseType: !52, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !106, file: !107, line: 65, baseType: !52, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !106, file: !107, line: 66, baseType: !52, size: 64, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !106, file: !107, line: 68, baseType: !122, size: 64, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !107, line: 36, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !106, file: !107, line: 70, baseType: !125, size: 64, offset: 832)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !106, file: !107, line: 72, baseType: !55, size: 32, offset: 896)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !106, file: !107, line: 73, baseType: !55, size: 32, offset: 928)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !106, file: !107, line: 74, baseType: !129, size: 64, offset: 960)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !130, line: 152, baseType: !65)
!130 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !106, file: !107, line: 77, baseType: !56, size: 16, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !106, file: !107, line: 78, baseType: !133, size: 8, offset: 1040)
!133 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !106, file: !107, line: 79, baseType: !135, size: 8, offset: 1048)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !106, file: !107, line: 81, baseType: !139, size: 64, offset: 1088)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !107, line: 43, baseType: null)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !106, file: !107, line: 89, baseType: !142, size: 64, offset: 1152)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !130, line: 153, baseType: !65)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !106, file: !107, line: 91, baseType: !144, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !107, line: 37, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !106, file: !107, line: 92, baseType: !147, size: 64, offset: 1280)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !107, line: 38, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !106, file: !107, line: 93, baseType: !125, size: 64, offset: 1344)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !106, file: !107, line: 94, baseType: !54, size: 64, offset: 1408)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !106, file: !107, line: 95, baseType: !57, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !106, file: !107, line: 96, baseType: !55, size: 32, offset: 1536)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !106, file: !107, line: 98, baseType: !154, size: 160, offset: 1568)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 20)
!157 = !DILocalVariable(name: "__cnt", scope: !101, file: !81, line: 644, type: !57)
!158 = !DILocalVariable(name: "url_program", scope: !80, file: !81, line: 648, type: !60)
!159 = !DILocalVariable(name: "__ptr", scope: !160, file: !81, line: 686, type: !60)
!160 = distinct !DILexicalBlock(scope: !80, file: !81, line: 686, column: 3)
!161 = !DILocalVariable(name: "__stream", scope: !160, file: !81, line: 686, type: !103)
!162 = !DILocalVariable(name: "__cnt", scope: !160, file: !81, line: 686, type: !57)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "max_width", scope: !2, file: !3, line: 189, type: !55, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "prefix_lead_space", scope: !2, file: !3, line: 197, type: !55, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "prefix", scope: !2, file: !3, line: 185, type: !60, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "prefix_full_length", scope: !2, file: !3, line: 194, type: !55, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "prefix_length", scope: !2, file: !3, line: 200, type: !55, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "tabs", scope: !2, file: !3, line: 231, type: !69, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "other_indent", scope: !2, file: !3, line: 240, type: !55, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "in_column", scope: !2, file: !3, line: 208, type: !55, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "next_prefix_indent", scope: !2, file: !3, line: 254, type: !55, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "next_char", scope: !2, file: !3, line: 250, type: !55, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "last_line_length", scope: !2, file: !3, line: 259, type: !55, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "out_column", scope: !2, file: !3, line: 211, type: !55, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "prefix_indent", scope: !2, file: !3, line: 234, type: !55, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "first_indent", scope: !2, file: !3, line: 237, type: !55, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "parabuf", scope: !2, file: !3, line: 215, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 40000, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 5000)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "wptr", scope: !2, file: !3, line: 218, type: !52, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "unused_word_type", scope: !2, file: !3, line: 222, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 320000, elements: !215)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !3, line: 128, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Word", file: !3, line: 130, size: 320, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !202, file: !3, line: 135, baseType: !60, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !202, file: !3, line: 136, baseType: !55, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !202, file: !3, line: 137, baseType: !55, size: 32, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !202, file: !3, line: 138, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !202, file: !3, line: 139, baseType: !7, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "punct", scope: !202, file: !3, line: 140, baseType: !7, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !202, file: !3, line: 141, baseType: !7, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !202, file: !3, line: 145, baseType: !55, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "best_cost", scope: !202, file: !3, line: 146, baseType: !64, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "next_break", scope: !202, file: !3, line: 147, baseType: !214, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!215 = !{!216}
!216 = !DISubrange(count: 1000)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "word_limit", scope: !2, file: !3, line: 227, type: !214, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 2560, elements: !229)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !222, line: 50, size: 256, elements: !223)
!222 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!223 = !{!224, !225, !226, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !221, file: !222, line: 52, baseType: !60, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !221, file: !222, line: 55, baseType: !55, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !222, line: 56, baseType: !227, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !221, file: !222, line: 57, baseType: !55, size: 32, offset: 192)
!229 = !{!230}
!230 = !DISubrange(count: 10)
!231 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!232 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!233 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!234 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!235 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "Version", scope: !238, file: !239, line: 3, type: !60, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !240, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!240 = !{!236}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "file_name", scope: !243, file: !244, line: 45, type: !60, isLocal: true, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !245, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!245 = !{!241, !246}
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !243, file: !244, line: 55, type: !69, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !250, file: !251, line: 66, type: !286, isLocal: false, isDefinition: true)
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !252, globals: !253, splitDebugInlining: false, nameTableKind: None)
!251 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!252 = !{!54, !62}
!253 = !{!254, !280, !248, !282, !284}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "old_file_name", scope: !256, file: !251, line: 304, type: !60, isLocal: true, isDefinition: true)
!256 = distinct !DISubprogram(name: "verror_at_line", scope: !251, file: !251, line: 298, type: !257, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !250, retainedNodes: !273)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !55, !55, !60, !7, !60, !259}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !260, line: 52, baseType: !261)
!260 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !262, line: 32, baseType: !263)
!262 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !264, baseType: !265)
!264 = !DIFile(filename: "lib/error.c", directory: "/src")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !266, size: 256, elements: !267)
!266 = !DINamespace(name: "std", scope: null)
!267 = !{!268, !269, !270, !271, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !265, file: !264, baseType: !54, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !265, file: !264, baseType: !54, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !265, file: !264, baseType: !54, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !265, file: !264, baseType: !55, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !265, file: !264, baseType: !55, size: 32, offset: 224)
!273 = !{!274, !275, !276, !277, !278, !279}
!274 = !DILocalVariable(name: "status", arg: 1, scope: !256, file: !251, line: 298, type: !55)
!275 = !DILocalVariable(name: "errnum", arg: 2, scope: !256, file: !251, line: 298, type: !55)
!276 = !DILocalVariable(name: "file_name", arg: 3, scope: !256, file: !251, line: 298, type: !60)
!277 = !DILocalVariable(name: "line_number", arg: 4, scope: !256, file: !251, line: 298, type: !7)
!278 = !DILocalVariable(name: "message", arg: 5, scope: !256, file: !251, line: 298, type: !60)
!279 = !DILocalVariable(name: "args", arg: 6, scope: !256, file: !251, line: 298, type: !259)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "old_line_number", scope: !256, file: !251, line: 305, type: !7, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "error_message_count", scope: !250, file: !251, line: 69, type: !7, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !250, file: !251, line: 295, type: !55, isLocal: false, isDefinition: true)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "program_name", scope: !291, file: !292, line: 31, type: !60, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!293 = !{!52}
!294 = !{!289}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "utf07FF", scope: !297, file: !298, line: 46, type: !328, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "proper_name_lite", scope: !298, file: !298, line: 38, type: !299, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !301, retainedNodes: !303)
!298 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!299 = !DISubroutineType(types: !300)
!300 = !{!60, !60, !60}
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !302, splitDebugInlining: false, nameTableKind: None)
!302 = !{!295}
!303 = !{!304, !305, !306, !307, !312}
!304 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !297, file: !298, line: 38, type: !60)
!305 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !297, file: !298, line: 38, type: !60)
!306 = !DILocalVariable(name: "translation", scope: !297, file: !298, line: 40, type: !60)
!307 = !DILocalVariable(name: "w", scope: !297, file: !298, line: 47, type: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !309, line: 37, baseType: !310)
!309 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !130, line: 57, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !130, line: 42, baseType: !7)
!312 = !DILocalVariable(name: "mbs", scope: !297, file: !298, line: 48, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !314, line: 6, baseType: !315)
!314 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !316, line: 21, baseType: !317)
!316 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 13, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !317, file: !316, line: 15, baseType: !55, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !317, file: !316, line: 20, baseType: !321, size: 32, offset: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !316, line: 16, size: 32, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !321, file: !316, line: 18, baseType: !7, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !321, file: !316, line: 19, baseType: !325, size: 32)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 4)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 16, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !333, file: !334, line: 76, type: !400, isLocal: false, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !335, retainedTypes: !341, globals: !342, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!335 = !{!13, !336, !27}
!336 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 254, baseType: !7, size: 32, elements: !337)
!337 = !{!338, !339, !340}
!338 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!339 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!340 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!341 = !{!55, !56, !57}
!342 = !{!331, !343, !347, !359, !361, !366, !389, !396, !398}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !333, file: !334, line: 92, type: !345, isLocal: false, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 320, elements: !229)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !333, file: !334, line: 1040, type: !349, isLocal: false, isDefinition: true)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !334, line: 56, size: 448, elements: !350)
!350 = !{!351, !352, !353, !357, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !349, file: !334, line: 59, baseType: !13, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !349, file: !334, line: 62, baseType: !55, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !349, file: !334, line: 66, baseType: !354, size: 256, offset: 64)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !349, file: !334, line: 69, baseType: !60, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !349, file: !334, line: 72, baseType: !60, size: 64, offset: 384)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !333, file: !334, line: 107, type: !349, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "slot0", scope: !333, file: !334, line: 831, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 256)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "quote", scope: !368, file: !334, line: 228, type: !387, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "gettext_quote", scope: !334, file: !334, line: 197, type: !369, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !333, retainedNodes: !371)
!369 = !DISubroutineType(types: !370)
!370 = !{!60, !60, !13}
!371 = !{!372, !373, !374, !375, !376}
!372 = !DILocalVariable(name: "msgid", arg: 1, scope: !368, file: !334, line: 197, type: !60)
!373 = !DILocalVariable(name: "s", arg: 2, scope: !368, file: !334, line: 197, type: !13)
!374 = !DILocalVariable(name: "translation", scope: !368, file: !334, line: 199, type: !60)
!375 = !DILocalVariable(name: "w", scope: !368, file: !334, line: 229, type: !308)
!376 = !DILocalVariable(name: "mbs", scope: !368, file: !334, line: 230, type: !377)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !314, line: 6, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !316, line: 21, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 13, size: 64, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !379, file: !316, line: 15, baseType: !55, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !379, file: !316, line: 20, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !379, file: !316, line: 16, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !383, file: !316, line: 18, baseType: !7, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !383, file: !316, line: 19, baseType: !325, size: 32)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !388)
!388 = !{!330, !327}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "slotvec", scope: !333, file: !334, line: 834, type: !391, isLocal: true, isDefinition: true)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !334, line: 823, size: 128, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !392, file: !334, line: 825, baseType: !57, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !392, file: !334, line: 826, baseType: !52, size: 64, offset: 64)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "nslots", scope: !333, file: !334, line: 832, type: !55, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "slotvec0", scope: !333, file: !334, line: 833, type: !392, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 704, elements: !402)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!402 = !{!403}
!403 = !DISubrange(count: 11)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !406, file: !407, line: 26, type: !409, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !408, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!408 = !{!404}
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 376, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 47)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "exit_failure", scope: !414, file: !415, line: 24, type: !417, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !416, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!416 = !{!412}
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "internal_state", scope: !420, file: !421, line: 97, type: !424, isLocal: true, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !422, globals: !423, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!422 = !{!54, !57, !62}
!423 = !{!418}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !314, line: 6, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !316, line: 21, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !316, line: 13, size: 64, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !426, file: !316, line: 15, baseType: !55, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !426, file: !316, line: 20, baseType: !430, size: 32, offset: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !426, file: !316, line: 16, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !430, file: !316, line: 18, baseType: !7, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !430, file: !316, line: 19, baseType: !325, size: 32)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !436, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!436 = !{!42}
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!441 = !{!54}
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !450, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!450 = !{!451}
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 40, baseType: !7, size: 32, elements: !452)
!452 = !{!453}
!453 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !456, retainedTypes: !487, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!456 = !{!457, !469}
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !458, file: !455, line: 188, baseType: !7, size: 32, elements: !467)
!458 = distinct !DISubprogram(name: "x2nrealloc", scope: !455, file: !455, line: 176, type: !459, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !454, retainedNodes: !462)
!459 = !DISubroutineType(types: !460)
!460 = !{!54, !54, !461, !57}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!462 = !{!463, !464, !465, !466}
!463 = !DILocalVariable(name: "p", arg: 1, scope: !458, file: !455, line: 176, type: !54)
!464 = !DILocalVariable(name: "pn", arg: 2, scope: !458, file: !455, line: 176, type: !461)
!465 = !DILocalVariable(name: "s", arg: 3, scope: !458, file: !455, line: 176, type: !57)
!466 = !DILocalVariable(name: "n", scope: !458, file: !455, line: 178, type: !57)
!467 = !{!468}
!468 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !470, file: !455, line: 228, baseType: !7, size: 32, elements: !467)
!470 = distinct !DISubprogram(name: "xpalloc", scope: !455, file: !455, line: 223, type: !471, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !454, retainedNodes: !477)
!471 = !DISubroutineType(types: !472)
!472 = !{!54, !54, !473, !474, !476, !474}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !475, line: 130, baseType: !476)
!475 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !58, line: 35, baseType: !65)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486}
!478 = !DILocalVariable(name: "pa", arg: 1, scope: !470, file: !455, line: 223, type: !54)
!479 = !DILocalVariable(name: "pn", arg: 2, scope: !470, file: !455, line: 223, type: !473)
!480 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !470, file: !455, line: 223, type: !474)
!481 = !DILocalVariable(name: "n_max", arg: 4, scope: !470, file: !455, line: 223, type: !476)
!482 = !DILocalVariable(name: "s", arg: 5, scope: !470, file: !455, line: 223, type: !474)
!483 = !DILocalVariable(name: "n0", scope: !470, file: !455, line: 230, type: !474)
!484 = !DILocalVariable(name: "n", scope: !470, file: !455, line: 237, type: !474)
!485 = !DILocalVariable(name: "nbytes", scope: !470, file: !455, line: 248, type: !474)
!486 = !DILocalVariable(name: "adjusted_nbytes", scope: !470, file: !455, line: 252, type: !474)
!487 = !{!52, !54, !69, !65, !59}
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!492 = !{!493, !5}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !494, line: 30, baseType: !7, size: 32, elements: !495)
!494 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!495 = !{!496, !497, !498, !499, !500}
!496 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!497 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!498 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!499 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!500 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !503, retainedTypes: !504, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!503 = !{!493, !27}
!504 = !{!55, !56, !52, !69, !59, !505}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !506, line: 102, baseType: !507)
!506 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !130, line: 73, baseType: !59)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !514, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!514 = !{!69, !59, !54}
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!521 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!522 = !{i32 7, !"Dwarf Version", i32 5}
!523 = !{i32 2, !"Debug Info Version", i32 3}
!524 = !{i32 1, !"wchar_size", i32 4}
!525 = !{i32 1, !"branch-target-enforcement", i32 0}
!526 = !{i32 1, !"sign-return-address", i32 0}
!527 = !{i32 1, !"sign-return-address-all", i32 0}
!528 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!529 = !{i32 7, !"PIC Level", i32 2}
!530 = !{i32 7, !"PIE Level", i32 2}
!531 = !{i32 7, !"uwtable", i32 1}
!532 = !{i32 7, !"frame-pointer", i32 1}
!533 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 262, type: !534, scopeLine: 263, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !55}
!536 = !{!537}
!537 = !DILocalVariable(name: "status", arg: 1, scope: !533, file: !3, line: 262, type: !55)
!538 = !DILocation(line: 0, scope: !533)
!539 = !DILocation(line: 264, column: 14, scope: !540)
!540 = distinct !DILexicalBlock(scope: !533, file: !3, line: 264, column: 7)
!541 = !DILocation(line: 264, column: 7, scope: !533)
!542 = !DILocation(line: 265, column: 5, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !3, line: 265, column: 5)
!544 = !{!545, !545, i64 0}
!545 = !{!"any pointer", !546, i64 0}
!546 = !{!"omnipotent char", !547, i64 0}
!547 = !{!"Simple C/C++ TBAA"}
!548 = !DILocation(line: 268, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !540, file: !3, line: 267, column: 5)
!550 = !DILocation(line: 269, column: 7, scope: !549)
!551 = !DILocation(line: 729, column: 3, scope: !552, inlinedAt: !554)
!552 = distinct !DISubprogram(name: "emit_stdin_note", scope: !81, file: !81, line: 727, type: !287, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!553 = !{}
!554 = distinct !DILocation(line: 274, column: 7, scope: !549)
!555 = !DILocation(line: 736, column: 3, scope: !556, inlinedAt: !557)
!556 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !81, file: !81, line: 734, type: !287, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!557 = distinct !DILocation(line: 275, column: 7, scope: !549)
!558 = !DILocation(line: 277, column: 7, scope: !549)
!559 = !DILocation(line: 281, column: 7, scope: !549)
!560 = !DILocation(line: 286, column: 7, scope: !549)
!561 = !DILocation(line: 290, column: 7, scope: !549)
!562 = !DILocation(line: 294, column: 7, scope: !549)
!563 = !DILocation(line: 298, column: 7, scope: !549)
!564 = !DILocation(line: 304, column: 7, scope: !549)
!565 = !DILocation(line: 308, column: 7, scope: !549)
!566 = !DILocation(line: 309, column: 7, scope: !549)
!567 = !DILocalVariable(name: "program", arg: 1, scope: !568, file: !81, line: 836, type: !60)
!568 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !81, file: !81, line: 836, type: !569, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !60}
!571 = !{!567, !572, !581, !582, !584, !585}
!572 = !DILocalVariable(name: "infomap", scope: !568, file: !81, line: 838, type: !573)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 896, elements: !579)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !568, file: !81, line: 838, size: 128, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !575, file: !81, line: 838, baseType: !60, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !575, file: !81, line: 838, baseType: !60, size: 64, offset: 64)
!579 = !{!580}
!580 = !DISubrange(count: 7)
!581 = !DILocalVariable(name: "node", scope: !568, file: !81, line: 848, type: !60)
!582 = !DILocalVariable(name: "map_prog", scope: !568, file: !81, line: 849, type: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!584 = !DILocalVariable(name: "lc_messages", scope: !568, file: !81, line: 861, type: !60)
!585 = !DILocalVariable(name: "url_program", scope: !568, file: !81, line: 874, type: !60)
!586 = !DILocation(line: 0, scope: !568, inlinedAt: !587)
!587 = distinct !DILocation(line: 310, column: 7, scope: !549)
!588 = !DILocation(line: 838, column: 3, scope: !568, inlinedAt: !587)
!589 = !DILocation(line: 838, column: 67, scope: !568, inlinedAt: !587)
!590 = !DILocation(line: 849, column: 36, scope: !568, inlinedAt: !587)
!591 = !DILocation(line: 851, column: 3, scope: !568, inlinedAt: !587)
!592 = !DILocalVariable(name: "__s1", arg: 1, scope: !593, file: !594, line: 1359, type: !60)
!593 = distinct !DISubprogram(name: "streq", scope: !594, file: !594, line: 1359, type: !595, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !597)
!594 = !DIFile(filename: "./lib/string.h", directory: "/src")
!595 = !DISubroutineType(types: !596)
!596 = !{!69, !60, !60}
!597 = !{!592, !598}
!598 = !DILocalVariable(name: "__s2", arg: 2, scope: !593, file: !594, line: 1359, type: !60)
!599 = !DILocation(line: 0, scope: !593, inlinedAt: !600)
!600 = distinct !DILocation(line: 851, column: 33, scope: !568, inlinedAt: !587)
!601 = !DILocation(line: 1361, column: 11, scope: !593, inlinedAt: !600)
!602 = !DILocation(line: 1361, column: 10, scope: !593, inlinedAt: !600)
!603 = !DILocation(line: 852, column: 13, scope: !568, inlinedAt: !587)
!604 = !DILocation(line: 851, column: 20, scope: !568, inlinedAt: !587)
!605 = !{!606, !545, i64 0}
!606 = !{!"infomap", !545, i64 0, !545, i64 8}
!607 = !DILocation(line: 851, column: 10, scope: !568, inlinedAt: !587)
!608 = !DILocation(line: 851, column: 28, scope: !568, inlinedAt: !587)
!609 = distinct !{!609, !591, !603, !610}
!610 = !{!"llvm.loop.mustprogress"}
!611 = !DILocation(line: 854, column: 17, scope: !612, inlinedAt: !587)
!612 = distinct !DILexicalBlock(scope: !568, file: !81, line: 854, column: 7)
!613 = !{!606, !545, i64 8}
!614 = !DILocation(line: 854, column: 7, scope: !612, inlinedAt: !587)
!615 = !DILocation(line: 854, column: 7, scope: !568, inlinedAt: !587)
!616 = !DILocation(line: 857, column: 3, scope: !568, inlinedAt: !587)
!617 = !DILocation(line: 861, column: 29, scope: !568, inlinedAt: !587)
!618 = !DILocation(line: 862, column: 7, scope: !619, inlinedAt: !587)
!619 = distinct !DILexicalBlock(scope: !568, file: !81, line: 862, column: 7)
!620 = !DILocation(line: 862, column: 19, scope: !619, inlinedAt: !587)
!621 = !DILocation(line: 862, column: 22, scope: !619, inlinedAt: !587)
!622 = !DILocation(line: 862, column: 7, scope: !568, inlinedAt: !587)
!623 = !DILocation(line: 868, column: 7, scope: !624, inlinedAt: !587)
!624 = distinct !DILexicalBlock(scope: !619, file: !81, line: 863, column: 5)
!625 = !DILocation(line: 870, column: 5, scope: !624, inlinedAt: !587)
!626 = !DILocation(line: 0, scope: !593, inlinedAt: !627)
!627 = distinct !DILocation(line: 874, column: 29, scope: !568, inlinedAt: !587)
!628 = !DILocation(line: 875, column: 3, scope: !568, inlinedAt: !587)
!629 = !DILocation(line: 877, column: 3, scope: !568, inlinedAt: !587)
!630 = !DILocation(line: 879, column: 1, scope: !568, inlinedAt: !587)
!631 = !DILocation(line: 312, column: 3, scope: !533)
!632 = !DISubprogram(name: "dcgettext", scope: !633, file: !633, line: 51, type: !634, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!633 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!634 = !DISubroutineType(types: !635)
!635 = !{!52, !60, !60, !55}
!636 = !DISubprogram(name: "fputs_unlocked", scope: !260, file: !260, line: 691, type: !637, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!637 = !DISubroutineType(types: !638)
!638 = !{!55, !639, !640}
!639 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!640 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !103)
!641 = !DILocation(line: 0, scope: !80)
!642 = !DILocation(line: 581, column: 7, scope: !89)
!643 = !{!644, !644, i64 0}
!644 = !{!"int", !546, i64 0}
!645 = !DILocation(line: 581, column: 19, scope: !89)
!646 = !DILocation(line: 581, column: 7, scope: !80)
!647 = !DILocation(line: 585, column: 26, scope: !88)
!648 = !DILocation(line: 0, scope: !88)
!649 = !DILocation(line: 586, column: 23, scope: !88)
!650 = !DILocation(line: 586, column: 28, scope: !88)
!651 = !DILocation(line: 586, column: 32, scope: !88)
!652 = !{!546, !546, i64 0}
!653 = !DILocation(line: 586, column: 38, scope: !88)
!654 = !DILocation(line: 0, scope: !593, inlinedAt: !655)
!655 = distinct !DILocation(line: 586, column: 41, scope: !88)
!656 = !DILocation(line: 1361, column: 11, scope: !593, inlinedAt: !655)
!657 = !DILocation(line: 1361, column: 10, scope: !593, inlinedAt: !655)
!658 = !DILocation(line: 586, column: 19, scope: !88)
!659 = !DILocation(line: 587, column: 5, scope: !88)
!660 = !DILocation(line: 588, column: 7, scope: !661)
!661 = distinct !DILexicalBlock(scope: !80, file: !81, line: 588, column: 7)
!662 = !DILocation(line: 588, column: 7, scope: !80)
!663 = !DILocation(line: 590, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !661, file: !81, line: 589, column: 5)
!665 = !DILocation(line: 591, column: 7, scope: !664)
!666 = !DILocation(line: 595, column: 37, scope: !80)
!667 = !DILocation(line: 595, column: 35, scope: !80)
!668 = !DILocation(line: 596, column: 29, scope: !80)
!669 = !DILocation(line: 597, column: 8, scope: !96)
!670 = !DILocation(line: 597, column: 7, scope: !80)
!671 = !DILocation(line: 604, column: 24, scope: !95)
!672 = !DILocation(line: 604, column: 12, scope: !96)
!673 = !DILocation(line: 0, scope: !94)
!674 = !DILocation(line: 610, column: 16, scope: !94)
!675 = !DILocation(line: 610, column: 7, scope: !94)
!676 = !DILocation(line: 611, column: 21, scope: !94)
!677 = !{!678, !678, i64 0}
!678 = !{!"short", !546, i64 0}
!679 = !DILocation(line: 611, column: 19, scope: !94)
!680 = !DILocation(line: 611, column: 16, scope: !94)
!681 = !DILocation(line: 610, column: 30, scope: !94)
!682 = distinct !{!682, !675, !676, !610}
!683 = !DILocation(line: 612, column: 18, scope: !684)
!684 = distinct !DILexicalBlock(scope: !94, file: !81, line: 612, column: 11)
!685 = !DILocation(line: 612, column: 11, scope: !94)
!686 = !DILocation(line: 620, column: 23, scope: !80)
!687 = !DILocation(line: 625, column: 39, scope: !80)
!688 = !DILocation(line: 626, column: 3, scope: !80)
!689 = !DILocation(line: 626, column: 10, scope: !80)
!690 = !DILocation(line: 626, column: 21, scope: !80)
!691 = !DILocation(line: 628, column: 44, scope: !692)
!692 = distinct !DILexicalBlock(scope: !693, file: !81, line: 628, column: 11)
!693 = distinct !DILexicalBlock(scope: !80, file: !81, line: 627, column: 5)
!694 = !DILocation(line: 628, column: 32, scope: !692)
!695 = !DILocation(line: 628, column: 49, scope: !692)
!696 = !DILocation(line: 628, column: 11, scope: !693)
!697 = !DILocation(line: 630, column: 11, scope: !698)
!698 = distinct !DILexicalBlock(scope: !693, file: !81, line: 630, column: 11)
!699 = !DILocation(line: 630, column: 11, scope: !693)
!700 = !DILocation(line: 632, column: 26, scope: !701)
!701 = distinct !DILexicalBlock(scope: !702, file: !81, line: 632, column: 15)
!702 = distinct !DILexicalBlock(scope: !698, file: !81, line: 631, column: 9)
!703 = !DILocation(line: 632, column: 34, scope: !701)
!704 = !DILocation(line: 632, column: 37, scope: !701)
!705 = !DILocation(line: 632, column: 15, scope: !702)
!706 = !DILocation(line: 636, column: 29, scope: !707)
!707 = distinct !DILexicalBlock(scope: !702, file: !81, line: 636, column: 15)
!708 = !DILocation(line: 640, column: 16, scope: !693)
!709 = distinct !{!709, !688, !710, !610}
!710 = !DILocation(line: 641, column: 5, scope: !80)
!711 = !DILocation(line: 644, column: 3, scope: !80)
!712 = !DILocation(line: 0, scope: !593, inlinedAt: !713)
!713 = distinct !DILocation(line: 648, column: 31, scope: !80)
!714 = !DILocation(line: 0, scope: !593, inlinedAt: !715)
!715 = distinct !DILocation(line: 649, column: 31, scope: !80)
!716 = !DILocation(line: 0, scope: !593, inlinedAt: !717)
!717 = distinct !DILocation(line: 650, column: 31, scope: !80)
!718 = !DILocation(line: 0, scope: !593, inlinedAt: !719)
!719 = distinct !DILocation(line: 651, column: 31, scope: !80)
!720 = !DILocation(line: 0, scope: !593, inlinedAt: !721)
!721 = distinct !DILocation(line: 652, column: 31, scope: !80)
!722 = !DILocation(line: 0, scope: !593, inlinedAt: !723)
!723 = distinct !DILocation(line: 653, column: 31, scope: !80)
!724 = !DILocation(line: 0, scope: !593, inlinedAt: !725)
!725 = distinct !DILocation(line: 654, column: 31, scope: !80)
!726 = !DILocation(line: 0, scope: !593, inlinedAt: !727)
!727 = distinct !DILocation(line: 655, column: 31, scope: !80)
!728 = !DILocation(line: 0, scope: !593, inlinedAt: !729)
!729 = distinct !DILocation(line: 656, column: 31, scope: !80)
!730 = !DILocation(line: 0, scope: !593, inlinedAt: !731)
!731 = distinct !DILocation(line: 657, column: 31, scope: !80)
!732 = !DILocation(line: 663, column: 7, scope: !733)
!733 = distinct !DILexicalBlock(scope: !80, file: !81, line: 663, column: 7)
!734 = !DILocation(line: 664, column: 7, scope: !733)
!735 = !DILocation(line: 664, column: 10, scope: !733)
!736 = !DILocation(line: 663, column: 7, scope: !80)
!737 = !DILocation(line: 669, column: 7, scope: !738)
!738 = distinct !DILexicalBlock(scope: !733, file: !81, line: 665, column: 5)
!739 = !DILocation(line: 671, column: 5, scope: !738)
!740 = !DILocation(line: 676, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !733, file: !81, line: 673, column: 5)
!742 = !DILocation(line: 679, column: 3, scope: !80)
!743 = !DILocation(line: 683, column: 3, scope: !80)
!744 = !DILocation(line: 686, column: 3, scope: !80)
!745 = !DILocation(line: 688, column: 3, scope: !80)
!746 = !DILocation(line: 691, column: 3, scope: !80)
!747 = !DILocation(line: 695, column: 3, scope: !80)
!748 = !DILocation(line: 696, column: 1, scope: !80)
!749 = !DISubprogram(name: "setlocale", scope: !750, file: !750, line: 122, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!750 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!751 = !DISubroutineType(types: !752)
!752 = !{!52, !55, !60}
!753 = !DISubprogram(name: "getenv", scope: !754, file: !754, line: 641, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!754 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!755 = !DISubroutineType(types: !756)
!756 = !{!52, !60}
!757 = !DISubprogram(name: "fwrite_unlocked", scope: !260, file: !260, line: 704, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!758 = !DISubroutineType(types: !759)
!759 = !{!57, !760, !57, !57, !640}
!760 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!763 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 332, type: !764, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !767)
!764 = !DISubroutineType(types: !765)
!765 = !{!55, !55, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !781}
!768 = !DILocalVariable(name: "argc", arg: 1, scope: !763, file: !3, line: 332, type: !55)
!769 = !DILocalVariable(name: "argv", arg: 2, scope: !763, file: !3, line: 332, type: !766)
!770 = !DILocalVariable(name: "optchar", scope: !763, file: !3, line: 334, type: !55)
!771 = !DILocalVariable(name: "ok", scope: !763, file: !3, line: 335, type: !69)
!772 = !DILocalVariable(name: "max_width_option", scope: !763, file: !3, line: 336, type: !60)
!773 = !DILocalVariable(name: "goal_width_option", scope: !763, file: !3, line: 337, type: !60)
!774 = !DILocalVariable(name: "have_read_stdin", scope: !763, file: !3, line: 425, type: !69)
!775 = !DILocalVariable(name: "file", scope: !776, file: !3, line: 436, type: !52)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 435, column: 9)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 434, column: 7)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 434, column: 7)
!779 = distinct !DILexicalBlock(scope: !780, file: !3, line: 433, column: 5)
!780 = distinct !DILexicalBlock(scope: !763, file: !3, line: 427, column: 7)
!781 = !DILocalVariable(name: "in_stream", scope: !782, file: !3, line: 444, type: !103)
!782 = distinct !DILexicalBlock(scope: !783, file: !3, line: 443, column: 13)
!783 = distinct !DILexicalBlock(scope: !776, file: !3, line: 437, column: 15)
!784 = !DILocation(line: 0, scope: !763)
!785 = !DILocation(line: 340, column: 21, scope: !763)
!786 = !DILocation(line: 340, column: 3, scope: !763)
!787 = !DILocation(line: 341, column: 3, scope: !763)
!788 = !DILocation(line: 342, column: 3, scope: !763)
!789 = !DILocation(line: 343, column: 3, scope: !763)
!790 = !DILocation(line: 345, column: 3, scope: !763)
!791 = !DILocation(line: 347, column: 12, scope: !792)
!792 = distinct !DILexicalBlock(scope: !763, file: !3, line: 347, column: 7)
!793 = !DILocation(line: 347, column: 16, scope: !792)
!794 = !DILocation(line: 347, column: 19, scope: !792)
!795 = !DILocation(line: 347, column: 30, scope: !792)
!796 = !DILocation(line: 347, column: 37, scope: !792)
!797 = !DILocation(line: 347, column: 51, scope: !792)
!798 = !DILocalVariable(name: "c", arg: 1, scope: !799, file: !800, line: 233, type: !55)
!799 = distinct !DISubprogram(name: "c_isdigit", scope: !800, file: !800, line: 233, type: !801, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !803)
!800 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!801 = !DISubroutineType(types: !802)
!802 = !{!69, !55}
!803 = !{!798}
!804 = !DILocation(line: 0, scope: !799, inlinedAt: !805)
!805 = distinct !DILocation(line: 347, column: 40, scope: !792)
!806 = !DILocation(line: 235, column: 3, scope: !799, inlinedAt: !805)
!807 = !DILocation(line: 347, column: 7, scope: !763)
!808 = !DILocation(line: 353, column: 17, scope: !809)
!809 = distinct !DILexicalBlock(scope: !792, file: !3, line: 348, column: 5)
!810 = !DILocation(line: 353, column: 15, scope: !809)
!811 = !DILocation(line: 355, column: 11, scope: !809)
!812 = !DILocation(line: 356, column: 5, scope: !809)
!813 = !DILocation(line: 358, column: 3, scope: !763)
!814 = !DILocation(line: 358, column: 21, scope: !763)
!815 = !DILocation(line: 0, scope: !799, inlinedAt: !816)
!816 = distinct !DILocation(line: 364, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 364, column: 13)
!818 = distinct !DILexicalBlock(scope: !763, file: !3, line: 362, column: 7)
!819 = !DILocation(line: 235, column: 3, scope: !799, inlinedAt: !816)
!820 = !DILocation(line: 364, column: 13, scope: !818)
!821 = !DILocation(line: 365, column: 11, scope: !817)
!822 = !DILocation(line: 368, column: 9, scope: !818)
!823 = !DILocation(line: 371, column: 15, scope: !818)
!824 = !DILocation(line: 372, column: 9, scope: !818)
!825 = !DILocation(line: 375, column: 15, scope: !818)
!826 = !DILocation(line: 376, column: 9, scope: !818)
!827 = !DILocation(line: 379, column: 16, scope: !818)
!828 = !DILocation(line: 380, column: 9, scope: !818)
!829 = !DILocation(line: 383, column: 17, scope: !818)
!830 = !DILocation(line: 384, column: 9, scope: !818)
!831 = !DILocation(line: 387, column: 28, scope: !818)
!832 = !DILocation(line: 388, column: 9, scope: !818)
!833 = distinct !{!833, !813, !834, !610}
!834 = !DILocation(line: 402, column: 7, scope: !763)
!835 = !DILocation(line: 391, column: 29, scope: !818)
!836 = !DILocation(line: 392, column: 9, scope: !818)
!837 = !DILocation(line: 395, column: 21, scope: !818)
!838 = !DILocalVariable(name: "p", arg: 1, scope: !839, file: !3, line: 468, type: !52)
!839 = distinct !DISubprogram(name: "set_prefix", scope: !3, file: !3, line: 468, type: !840, scopeLine: 469, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !842)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !52}
!842 = !{!838, !843}
!843 = !DILocalVariable(name: "s", scope: !839, file: !3, line: 470, type: !52)
!844 = !DILocation(line: 0, scope: !839, inlinedAt: !845)
!845 = distinct !DILocation(line: 395, column: 9, scope: !818)
!846 = !DILocation(line: 472, column: 21, scope: !839, inlinedAt: !845)
!847 = !DILocation(line: 473, column: 10, scope: !839, inlinedAt: !845)
!848 = !DILocation(line: 473, column: 13, scope: !839, inlinedAt: !845)
!849 = !DILocation(line: 473, column: 3, scope: !839, inlinedAt: !845)
!850 = !DILocation(line: 475, column: 24, scope: !851, inlinedAt: !845)
!851 = distinct !DILexicalBlock(scope: !839, file: !3, line: 474, column: 5)
!852 = !DILocation(line: 476, column: 8, scope: !851, inlinedAt: !845)
!853 = distinct !{!853, !849, !854, !610}
!854 = !DILocation(line: 477, column: 5, scope: !839, inlinedAt: !845)
!855 = !DILocation(line: 478, column: 10, scope: !839, inlinedAt: !845)
!856 = !DILocation(line: 479, column: 24, scope: !839, inlinedAt: !845)
!857 = !DILocation(line: 479, column: 22, scope: !839, inlinedAt: !845)
!858 = !DILocation(line: 480, column: 9, scope: !839, inlinedAt: !845)
!859 = !DILocation(line: 481, column: 3, scope: !839, inlinedAt: !845)
!860 = !DILocation(line: 481, column: 12, scope: !839, inlinedAt: !845)
!861 = !DILocation(line: 481, column: 16, scope: !839, inlinedAt: !845)
!862 = !DILocation(line: 481, column: 19, scope: !839, inlinedAt: !845)
!863 = !DILocation(line: 481, column: 25, scope: !839, inlinedAt: !845)
!864 = distinct !{!864, !859, !865, !610}
!865 = !DILocation(line: 482, column: 6, scope: !839, inlinedAt: !845)
!866 = !DILocation(line: 483, column: 6, scope: !839, inlinedAt: !845)
!867 = !DILocation(line: 484, column: 21, scope: !839, inlinedAt: !845)
!868 = !DILocation(line: 484, column: 19, scope: !839, inlinedAt: !845)
!869 = !DILocation(line: 484, column: 17, scope: !839, inlinedAt: !845)
!870 = !DILocation(line: 396, column: 9, scope: !818)
!871 = !DILocation(line: 398, column: 7, scope: !818)
!872 = !DILocation(line: 400, column: 7, scope: !818)
!873 = !DILocation(line: 404, column: 7, scope: !874)
!874 = distinct !DILexicalBlock(scope: !763, file: !3, line: 404, column: 7)
!875 = !DILocation(line: 404, column: 7, scope: !763)
!876 = !DILocation(line: 409, column: 31, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !3, line: 405, column: 5)
!878 = !DILocation(line: 408, column: 19, scope: !877)
!879 = !DILocation(line: 408, column: 17, scope: !877)
!880 = !DILocation(line: 410, column: 5, scope: !877)
!881 = !DILocation(line: 412, column: 7, scope: !882)
!882 = distinct !DILexicalBlock(scope: !763, file: !3, line: 412, column: 7)
!883 = !DILocation(line: 0, scope: !882)
!884 = !DILocation(line: 412, column: 7, scope: !763)
!885 = !DILocation(line: 415, column: 54, scope: !886)
!886 = distinct !DILexicalBlock(scope: !882, file: !3, line: 413, column: 5)
!887 = !DILocation(line: 416, column: 32, scope: !886)
!888 = !DILocation(line: 415, column: 20, scope: !886)
!889 = !DILocation(line: 415, column: 18, scope: !886)
!890 = !DILocation(line: 417, column: 11, scope: !886)
!891 = !DILocation(line: 418, column: 32, scope: !892)
!892 = distinct !DILexicalBlock(scope: !886, file: !3, line: 417, column: 11)
!893 = !DILocation(line: 418, column: 19, scope: !892)
!894 = !DILocation(line: 418, column: 9, scope: !892)
!895 = !DILocation(line: 422, column: 30, scope: !896)
!896 = distinct !DILexicalBlock(scope: !882, file: !3, line: 421, column: 5)
!897 = !DILocation(line: 422, column: 57, scope: !896)
!898 = !DILocation(line: 422, column: 18, scope: !896)
!899 = !DILocation(line: 427, column: 7, scope: !780)
!900 = !DILocation(line: 427, column: 14, scope: !780)
!901 = !DILocation(line: 427, column: 7, scope: !763)
!902 = !DILocation(line: 434, column: 21, scope: !777)
!903 = !DILocation(line: 434, column: 7, scope: !778)
!904 = !DILocation(line: 430, column: 17, scope: !905)
!905 = distinct !DILexicalBlock(scope: !780, file: !3, line: 428, column: 5)
!906 = !DILocation(line: 430, column: 12, scope: !905)
!907 = !DILocation(line: 458, column: 23, scope: !908)
!908 = distinct !DILexicalBlock(scope: !763, file: !3, line: 458, column: 7)
!909 = !DILocation(line: 436, column: 24, scope: !776)
!910 = !DILocation(line: 0, scope: !776)
!911 = !DILocation(line: 0, scope: !593, inlinedAt: !912)
!912 = distinct !DILocation(line: 437, column: 15, scope: !783)
!913 = !DILocation(line: 1361, column: 11, scope: !593, inlinedAt: !912)
!914 = !DILocation(line: 1361, column: 10, scope: !593, inlinedAt: !912)
!915 = !DILocation(line: 437, column: 15, scope: !776)
!916 = !DILocation(line: 439, column: 26, scope: !917)
!917 = distinct !DILexicalBlock(scope: !783, file: !3, line: 438, column: 13)
!918 = !DILocation(line: 439, column: 21, scope: !917)
!919 = !DILocation(line: 439, column: 18, scope: !917)
!920 = !DILocation(line: 441, column: 13, scope: !917)
!921 = !DILocation(line: 445, column: 27, scope: !782)
!922 = !DILocation(line: 0, scope: !782)
!923 = !DILocation(line: 446, column: 29, scope: !924)
!924 = distinct !DILexicalBlock(scope: !782, file: !3, line: 446, column: 19)
!925 = !DILocation(line: 446, column: 19, scope: !782)
!926 = !DILocation(line: 447, column: 23, scope: !924)
!927 = !DILocation(line: 447, column: 20, scope: !924)
!928 = !DILocation(line: 447, column: 17, scope: !924)
!929 = !DILocation(line: 450, column: 19, scope: !930)
!930 = distinct !DILexicalBlock(scope: !924, file: !3, line: 449, column: 17)
!931 = !DILocation(line: 0, scope: !783)
!932 = !DILocation(line: 434, column: 35, scope: !777)
!933 = distinct !{!933, !903, !934, !610}
!934 = !DILocation(line: 455, column: 9, scope: !778)
!935 = !DILocation(line: 458, column: 34, scope: !908)
!936 = !DILocation(line: 458, column: 26, scope: !908)
!937 = !DILocation(line: 458, column: 41, scope: !908)
!938 = !DILocation(line: 458, column: 7, scope: !763)
!939 = !DILocation(line: 459, column: 5, scope: !908)
!940 = !DILocation(line: 461, column: 10, scope: !763)
!941 = !DILocation(line: 462, column: 1, scope: !763)
!942 = !DISubprogram(name: "bindtextdomain", scope: !633, file: !633, line: 86, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!943 = !DISubroutineType(types: !944)
!944 = !{!52, !60, !60}
!945 = !DISubprogram(name: "textdomain", scope: !633, file: !633, line: 82, type: !755, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!946 = !DISubprogram(name: "atexit", scope: !754, file: !754, line: 602, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!947 = !DISubroutineType(types: !948)
!948 = !{!55, !286}
!949 = !DISubprogram(name: "getopt_long", scope: !222, file: !222, line: 66, type: !950, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!950 = !DISubroutineType(types: !951)
!951 = !{!55, !55, !952, !60, !954, !227}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!955 = distinct !DISubprogram(name: "fmt", scope: !3, file: !3, line: 493, type: !956, scopeLine: 494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !958)
!956 = !DISubroutineType(types: !957)
!957 = !{!69, !103, !60}
!958 = !{!959, !960, !961}
!959 = !DILocalVariable(name: "f", arg: 1, scope: !955, file: !3, line: 493, type: !103)
!960 = !DILocalVariable(name: "file", arg: 2, scope: !955, file: !3, line: 493, type: !60)
!961 = !DILocalVariable(name: "err", scope: !955, file: !3, line: 505, type: !55)
!962 = !DILocation(line: 0, scope: !955)
!963 = !DILocation(line: 495, column: 3, scope: !955)
!964 = !DILocation(line: 496, column: 8, scope: !955)
!965 = !DILocation(line: 497, column: 16, scope: !955)
!966 = !DILocation(line: 498, column: 15, scope: !955)
!967 = !DILocation(line: 498, column: 13, scope: !955)
!968 = !DILocation(line: 499, column: 3, scope: !955)
!969 = !DILocation(line: 575, column: 7, scope: !970, inlinedAt: !976)
!970 = distinct !DISubprogram(name: "get_paragraph", scope: !3, file: !3, line: 570, type: !971, scopeLine: 571, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{!69, !103}
!973 = !{!974, !975}
!974 = !DILocalVariable(name: "f", arg: 1, scope: !970, file: !3, line: 570, type: !103)
!975 = !DILocalVariable(name: "c", scope: !970, file: !3, line: 572, type: !55)
!976 = distinct !DILocation(line: 499, column: 10, scope: !955)
!977 = !DILocation(line: 0, scope: !970, inlinedAt: !976)
!978 = !DILocation(line: 574, column: 20, scope: !970, inlinedAt: !976)
!979 = !DILocation(line: 579, column: 3, scope: !970, inlinedAt: !976)
!980 = !DILocation(line: 579, column: 20, scope: !970, inlinedAt: !976)
!981 = !DILocation(line: 580, column: 13, scope: !970, inlinedAt: !976)
!982 = !DILocation(line: 580, column: 34, scope: !970, inlinedAt: !976)
!983 = !DILocation(line: 580, column: 32, scope: !970, inlinedAt: !976)
!984 = !DILocation(line: 581, column: 10, scope: !970, inlinedAt: !976)
!985 = !DILocation(line: 581, column: 13, scope: !970, inlinedAt: !976)
!986 = !DILocation(line: 581, column: 46, scope: !970, inlinedAt: !976)
!987 = !DILocation(line: 581, column: 44, scope: !970, inlinedAt: !976)
!988 = !DILocation(line: 581, column: 23, scope: !970, inlinedAt: !976)
!989 = !DILocalVariable(name: "f", arg: 1, scope: !990, file: !3, line: 647, type: !103)
!990 = distinct !DISubprogram(name: "copy_rest", scope: !3, file: !3, line: 647, type: !991, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{!55, !103, !55}
!993 = !{!989, !994, !995}
!994 = !DILocalVariable(name: "c", arg: 2, scope: !990, file: !3, line: 647, type: !55)
!995 = !DILocalVariable(name: "s", scope: !996, file: !3, line: 653, type: !60)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 653, column: 7)
!997 = distinct !DILexicalBlock(scope: !998, file: !3, line: 651, column: 5)
!998 = distinct !DILexicalBlock(scope: !990, file: !3, line: 650, column: 7)
!999 = !DILocation(line: 0, scope: !990, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 583, column: 11, scope: !1001, inlinedAt: !976)
!1001 = distinct !DILexicalBlock(scope: !970, file: !3, line: 582, column: 5)
!1002 = !DILocation(line: 649, column: 14, scope: !990, inlinedAt: !1000)
!1003 = !DILocation(line: 650, column: 7, scope: !998, inlinedAt: !1000)
!1004 = !DILocation(line: 650, column: 19, scope: !998, inlinedAt: !1000)
!1005 = !DILocation(line: 650, column: 17, scope: !998, inlinedAt: !1000)
!1006 = !DILocation(line: 650, column: 38, scope: !998, inlinedAt: !1000)
!1007 = !DILocation(line: 650, column: 52, scope: !998, inlinedAt: !1000)
!1008 = !DILocation(line: 652, column: 7, scope: !997, inlinedAt: !1000)
!1009 = !DILocation(line: 0, scope: !996, inlinedAt: !1000)
!1010 = !DILocation(line: 653, column: 36, scope: !1011, inlinedAt: !1000)
!1011 = distinct !DILexicalBlock(scope: !996, file: !3, line: 653, column: 7)
!1012 = !DILocation(line: 653, column: 50, scope: !1011, inlinedAt: !1000)
!1013 = !DILocation(line: 653, column: 47, scope: !1011, inlinedAt: !1000)
!1014 = !DILocation(line: 653, column: 60, scope: !1011, inlinedAt: !1000)
!1015 = !DILocation(line: 653, column: 28, scope: !996, inlinedAt: !1000)
!1016 = !DILocation(line: 653, column: 7, scope: !996, inlinedAt: !1000)
!1017 = !DILocation(line: 653, column: 63, scope: !1011, inlinedAt: !1000)
!1018 = !DILocation(line: 655, column: 20, scope: !1019, inlinedAt: !1000)
!1019 = distinct !DILexicalBlock(scope: !997, file: !3, line: 655, column: 11)
!1020 = !DILocation(line: 654, column: 9, scope: !1011, inlinedAt: !1000)
!1021 = !DILocalVariable(name: "__c", arg: 1, scope: !1022, file: !1023, line: 108, type: !55)
!1022 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1023, file: !1023, line: 108, type: !1024, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1026)
!1023 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!55, !55}
!1026 = !{!1021}
!1027 = !DILocation(line: 0, scope: !1022, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 654, column: 9, scope: !1011, inlinedAt: !1000)
!1029 = !DILocation(line: 110, column: 10, scope: !1022, inlinedAt: !1028)
!1030 = !{!1031, !545, i64 40}
!1031 = !{!"_IO_FILE", !644, i64 0, !545, i64 8, !545, i64 16, !545, i64 24, !545, i64 32, !545, i64 40, !545, i64 48, !545, i64 56, !545, i64 64, !545, i64 72, !545, i64 80, !545, i64 88, !545, i64 96, !545, i64 104, !644, i64 112, !644, i64 116, !1032, i64 120, !678, i64 128, !546, i64 130, !546, i64 131, !545, i64 136, !1032, i64 144, !545, i64 152, !545, i64 160, !545, i64 168, !545, i64 176, !1032, i64 184, !644, i64 192, !546, i64 196}
!1032 = !{!"long", !546, i64 0}
!1033 = !{!1031, !545, i64 48}
!1034 = !{!"branch_weights", i32 2000, i32 1}
!1035 = !DILocation(line: 653, column: 77, scope: !1011, inlinedAt: !1000)
!1036 = distinct !{!1036, !1016, !1037, !610}
!1037 = !DILocation(line: 654, column: 9, scope: !996, inlinedAt: !1000)
!1038 = !DILocation(line: 656, column: 30, scope: !1019, inlinedAt: !1000)
!1039 = !DILocation(line: 656, column: 9, scope: !1019, inlinedAt: !1000)
!1040 = !DILocation(line: 657, column: 20, scope: !1041, inlinedAt: !1000)
!1041 = distinct !DILexicalBlock(scope: !997, file: !3, line: 657, column: 11)
!1042 = !DILocation(line: 657, column: 36, scope: !1041, inlinedAt: !1000)
!1043 = !DILocation(line: 657, column: 57, scope: !1041, inlinedAt: !1000)
!1044 = !DILocation(line: 657, column: 55, scope: !1041, inlinedAt: !1000)
!1045 = !DILocation(line: 657, column: 33, scope: !1041, inlinedAt: !1000)
!1046 = !DILocation(line: 657, column: 11, scope: !997, inlinedAt: !1000)
!1047 = !DILocation(line: 0, scope: !1022, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 658, column: 9, scope: !1041, inlinedAt: !1000)
!1049 = !DILocation(line: 110, column: 10, scope: !1022, inlinedAt: !1048)
!1050 = !DILocation(line: 660, column: 3, scope: !990, inlinedAt: !1000)
!1051 = !DILocation(line: 0, scope: !1022, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 662, column: 7, scope: !1053, inlinedAt: !1000)
!1053 = distinct !DILexicalBlock(scope: !990, file: !3, line: 661, column: 5)
!1054 = !DILocation(line: 110, column: 10, scope: !1022, inlinedAt: !1052)
!1055 = !DILocalVariable(name: "__fp", arg: 1, scope: !1056, file: !1023, line: 66, type: !103)
!1056 = distinct !DISubprogram(name: "getc_unlocked", scope: !1023, file: !1023, line: 66, type: !1057, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1059)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!55, !103}
!1059 = !{!1055}
!1060 = !DILocation(line: 0, scope: !1056, inlinedAt: !1061)
!1061 = distinct !DILocation(line: 663, column: 11, scope: !1053, inlinedAt: !1000)
!1062 = !DILocation(line: 68, column: 10, scope: !1056, inlinedAt: !1061)
!1063 = !{!1031, !545, i64 8}
!1064 = !{!1031, !545, i64 16}
!1065 = distinct !{!1065, !1050, !1066, !610}
!1066 = !DILocation(line: 664, column: 5, scope: !990, inlinedAt: !1000)
!1067 = !DILocation(line: 0, scope: !1022, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 589, column: 7, scope: !1001, inlinedAt: !976)
!1069 = !DILocation(line: 110, column: 10, scope: !1022, inlinedAt: !1068)
!1070 = !DILocation(line: 590, column: 11, scope: !1001, inlinedAt: !976)
!1071 = distinct !{!1071, !979, !1072, !610}
!1072 = !DILocation(line: 591, column: 5, scope: !970, inlinedAt: !976)
!1073 = !DILocation(line: 595, column: 17, scope: !970, inlinedAt: !976)
!1074 = !DILocation(line: 596, column: 16, scope: !970, inlinedAt: !976)
!1075 = !DILocation(line: 597, column: 8, scope: !970, inlinedAt: !976)
!1076 = !DILocation(line: 598, column: 14, scope: !970, inlinedAt: !976)
!1077 = !DILocation(line: 599, column: 7, scope: !970, inlinedAt: !976)
!1078 = !DILocalVariable(name: "c", arg: 1, scope: !1079, file: !3, line: 673, type: !55)
!1079 = distinct !DISubprogram(name: "same_para", scope: !3, file: !3, line: 673, type: !801, scopeLine: 674, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1080)
!1080 = !{!1078}
!1081 = !DILocation(line: 0, scope: !1079, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 600, column: 21, scope: !970, inlinedAt: !976)
!1083 = !DILocation(line: 675, column: 11, scope: !1079, inlinedAt: !1082)
!1084 = !DILocation(line: 675, column: 33, scope: !1079, inlinedAt: !1082)
!1085 = !DILocation(line: 675, column: 30, scope: !1079, inlinedAt: !1082)
!1086 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1082)
!1087 = !DILocation(line: 676, column: 14, scope: !1079, inlinedAt: !1082)
!1088 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1082)
!1089 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1082)
!1090 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1082)
!1091 = !DILocation(line: 677, column: 11, scope: !1079, inlinedAt: !1082)
!1092 = !DILocalVariable(name: "same_paragraph", arg: 1, scope: !1093, file: !3, line: 525, type: !69)
!1093 = distinct !DISubprogram(name: "set_other_indent", scope: !3, file: !3, line: 525, type: !1094, scopeLine: 526, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1096)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !69}
!1096 = !{!1092}
!1097 = !DILocation(line: 0, scope: !1093, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 600, column: 3, scope: !970, inlinedAt: !976)
!1099 = !DILocation(line: 527, column: 7, scope: !1100, inlinedAt: !1098)
!1100 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 527, column: 7)
!1101 = !DILocation(line: 527, column: 7, scope: !1093, inlinedAt: !1098)
!1102 = !DILocation(line: 529, column: 12, scope: !1103, inlinedAt: !1098)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 529, column: 12)
!1104 = !DILocation(line: 529, column: 12, scope: !1100, inlinedAt: !1098)
!1105 = !DILocation(line: 533, column: 12, scope: !1106, inlinedAt: !1098)
!1106 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 533, column: 12)
!1107 = !DILocation(line: 533, column: 12, scope: !1103, inlinedAt: !1098)
!1108 = !DILocation(line: 535, column: 26, scope: !1109, inlinedAt: !1098)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 535, column: 11)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 534, column: 5)
!1111 = !DILocation(line: 545, column: 32, scope: !1112, inlinedAt: !1098)
!1112 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 545, column: 16)
!1113 = !DILocation(line: 535, column: 29, scope: !1109, inlinedAt: !1098)
!1114 = !DILocation(line: 535, column: 42, scope: !1109, inlinedAt: !1098)
!1115 = !DILocation(line: 535, column: 39, scope: !1109, inlinedAt: !1098)
!1116 = !DILocation(line: 535, column: 11, scope: !1110, inlinedAt: !1098)
!1117 = !DILocation(line: 545, column: 16, scope: !1112, inlinedAt: !1098)
!1118 = !DILocation(line: 545, column: 29, scope: !1112, inlinedAt: !1098)
!1119 = !DILocation(line: 545, column: 16, scope: !1109, inlinedAt: !1098)
!1120 = !DILocation(line: 546, column: 37, scope: !1112, inlinedAt: !1098)
!1121 = !DILocation(line: 546, column: 24, scope: !1112, inlinedAt: !1098)
!1122 = !DILocation(line: 546, column: 9, scope: !1112, inlinedAt: !1098)
!1123 = !DILocation(line: 528, column: 20, scope: !1100, inlinedAt: !1098)
!1124 = !DILocation(line: 0, scope: !1100, inlinedAt: !1098)
!1125 = !DILocation(line: 531, column: 23, scope: !1126, inlinedAt: !1098)
!1126 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 530, column: 5)
!1127 = !DILocation(line: 0, scope: !1079, inlinedAt: !1128)
!1128 = distinct !DILocation(line: 610, column: 11, scope: !1129, inlinedAt: !976)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 610, column: 11)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 609, column: 5)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 608, column: 12)
!1132 = distinct !DILexicalBlock(scope: !970, file: !3, line: 604, column: 7)
!1133 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1128)
!1134 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1128)
!1135 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1128)
!1136 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1128)
!1137 = !DILocation(line: 610, column: 11, scope: !1130, inlinedAt: !976)
!1138 = !DILocation(line: 614, column: 19, scope: !1139, inlinedAt: !976)
!1139 = distinct !DILexicalBlock(scope: !1140, file: !3, line: 613, column: 13)
!1140 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 611, column: 9)
!1141 = !DILocation(line: 0, scope: !1079, inlinedAt: !1142)
!1142 = distinct !DILocation(line: 616, column: 18, scope: !1140, inlinedAt: !976)
!1143 = !DILocation(line: 675, column: 11, scope: !1079, inlinedAt: !1142)
!1144 = !DILocation(line: 675, column: 33, scope: !1079, inlinedAt: !1142)
!1145 = !DILocation(line: 675, column: 30, scope: !1079, inlinedAt: !1142)
!1146 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1142)
!1147 = !DILocation(line: 676, column: 14, scope: !1079, inlinedAt: !1142)
!1148 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1142)
!1149 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1142)
!1150 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1142)
!1151 = !DILocation(line: 677, column: 11, scope: !1079, inlinedAt: !1142)
!1152 = !DILocation(line: 616, column: 32, scope: !1140, inlinedAt: !976)
!1153 = !DILocation(line: 615, column: 13, scope: !1139, inlinedAt: !976)
!1154 = distinct !{!1154, !1155, !1156, !610}
!1155 = !DILocation(line: 612, column: 11, scope: !1140, inlinedAt: !976)
!1156 = !DILocation(line: 616, column: 60, scope: !1140, inlinedAt: !976)
!1157 = !DILocation(line: 619, column: 12, scope: !1131, inlinedAt: !976)
!1158 = !DILocation(line: 550, column: 22, scope: !1159, inlinedAt: !1098)
!1159 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 549, column: 5)
!1160 = !DILocation(line: 0, scope: !1079, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 632, column: 14, scope: !1162, inlinedAt: !976)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 631, column: 5)
!1163 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 619, column: 12)
!1164 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1161)
!1165 = !DILocation(line: 676, column: 14, scope: !1079, inlinedAt: !1161)
!1166 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1161)
!1167 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1161)
!1168 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1161)
!1169 = !DILocation(line: 677, column: 11, scope: !1079, inlinedAt: !1161)
!1170 = !DILocation(line: 632, column: 28, scope: !1162, inlinedAt: !976)
!1171 = !DILocation(line: 632, column: 7, scope: !1162, inlinedAt: !976)
!1172 = !DILocation(line: 0, scope: !1079, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 621, column: 11, scope: !1174, inlinedAt: !976)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 621, column: 11)
!1175 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 620, column: 5)
!1176 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1173)
!1177 = !DILocation(line: 676, column: 14, scope: !1079, inlinedAt: !1173)
!1178 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1173)
!1179 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1173)
!1180 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1173)
!1181 = !DILocation(line: 621, column: 25, scope: !1174, inlinedAt: !976)
!1182 = !DILocation(line: 621, column: 38, scope: !1174, inlinedAt: !976)
!1183 = !DILocation(line: 621, column: 11, scope: !1175, inlinedAt: !976)
!1184 = !DILocation(line: 625, column: 19, scope: !1185, inlinedAt: !976)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 624, column: 13)
!1186 = distinct !DILexicalBlock(scope: !1174, file: !3, line: 622, column: 9)
!1187 = !DILocation(line: 0, scope: !1079, inlinedAt: !1188)
!1188 = distinct !DILocation(line: 627, column: 18, scope: !1186, inlinedAt: !976)
!1189 = !DILocation(line: 675, column: 11, scope: !1079, inlinedAt: !1188)
!1190 = !DILocation(line: 675, column: 33, scope: !1079, inlinedAt: !1188)
!1191 = !DILocation(line: 675, column: 30, scope: !1079, inlinedAt: !1188)
!1192 = !DILocation(line: 676, column: 11, scope: !1079, inlinedAt: !1188)
!1193 = !DILocation(line: 676, column: 14, scope: !1079, inlinedAt: !1188)
!1194 = !DILocation(line: 676, column: 48, scope: !1079, inlinedAt: !1188)
!1195 = !DILocation(line: 676, column: 46, scope: !1079, inlinedAt: !1188)
!1196 = !DILocation(line: 676, column: 24, scope: !1079, inlinedAt: !1188)
!1197 = !DILocation(line: 677, column: 11, scope: !1079, inlinedAt: !1188)
!1198 = !DILocation(line: 627, column: 32, scope: !1186, inlinedAt: !976)
!1199 = !DILocation(line: 626, column: 13, scope: !1185, inlinedAt: !976)
!1200 = distinct !{!1200, !1201, !1202, !610}
!1201 = !DILocation(line: 623, column: 11, scope: !1186, inlinedAt: !976)
!1202 = !DILocation(line: 627, column: 60, scope: !1186, inlinedAt: !976)
!1203 = !DILocation(line: 633, column: 13, scope: !1162, inlinedAt: !976)
!1204 = !DILocation(line: 675, column: 11, scope: !1079, inlinedAt: !1161)
!1205 = !DILocation(line: 675, column: 33, scope: !1079, inlinedAt: !1161)
!1206 = !DILocation(line: 675, column: 30, scope: !1079, inlinedAt: !1161)
!1207 = distinct !{!1207, !1171, !1208, !610}
!1208 = !DILocation(line: 633, column: 27, scope: !1162, inlinedAt: !976)
!1209 = !DILocation(line: 636, column: 31, scope: !970, inlinedAt: !976)
!1210 = !DILocation(line: 636, column: 48, scope: !970, inlinedAt: !976)
!1211 = !DILocation(line: 636, column: 54, scope: !970, inlinedAt: !976)
!1212 = !DILocation(line: 636, column: 28, scope: !970, inlinedAt: !976)
!1213 = !DILocation(line: 501, column: 7, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !955, file: !3, line: 500, column: 5)
!1215 = !DILocalVariable(name: "finish", arg: 1, scope: !1216, file: !3, line: 991, type: !214)
!1216 = distinct !DISubprogram(name: "put_paragraph", scope: !3, file: !3, line: 991, type: !1217, scopeLine: 992, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1219)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{null, !214}
!1219 = !{!1215, !1220}
!1220 = !DILocalVariable(name: "w", scope: !1221, file: !3, line: 994, type: !214)
!1221 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 994, column: 3)
!1222 = !DILocation(line: 0, scope: !1216, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 502, column: 7, scope: !1214)
!1224 = !DILocation(line: 993, column: 19, scope: !1216, inlinedAt: !1223)
!1225 = !DILocation(line: 993, column: 3, scope: !1216, inlinedAt: !1223)
!1226 = !DILocation(line: 0, scope: !1221, inlinedAt: !1223)
!1227 = !{!1228, !545, i64 32}
!1228 = !{!"Word", !545, i64 0, !644, i64 8, !644, i64 12, !644, i64 16, !644, i64 16, !644, i64 16, !644, i64 16, !644, i64 20, !1032, i64 24, !545, i64 32}
!1229 = !DILocation(line: 994, column: 38, scope: !1230, inlinedAt: !1223)
!1230 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 994, column: 3)
!1231 = !DILocation(line: 994, column: 3, scope: !1221, inlinedAt: !1223)
!1232 = !DILocation(line: 995, column: 18, scope: !1230, inlinedAt: !1223)
