; ModuleID = 'src/fold.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbbuf_t = type { i8*, %struct._IO_FILE*, i64, i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [60 x i8] c"Wrap input lines in each FILE, writing to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"fold\00", align 1
@.str.4 = private unnamed_addr constant [56 x i8] c"  -b, --bytes\0A         count bytes rather than columns\0A\00", align 1

!46 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 44, baseType: !6, size: 32, elements: !49)
!48 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!51 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!52 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!53 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!54 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!55 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 127, baseType: !6, size: 32, elements: !58)
!57 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!58 = !{!59}
!59 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 131, baseType: !6, size: 32, elements: !61)
!61 = !{!62}
!62 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 130, baseType: !6, size: 32, elements: !64)
!64 = !{!65}
!65 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!66 = !{!67, !69, !70, !71, !72, !75, !77}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 46, baseType: !74)
!73 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!74 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!77 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!78 = !{!79, !82, !84, !0, !170, !184, !186, !243, !245}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "break_spaces", scope: !2, file: !3, line: 40, type: !81, isLocal: true, isDefinition: true)
!81 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 51, type: !81, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !86, file: !87, line: 575, type: !70, isLocal: true, isDefinition: true)
!86 = distinct !DISubprogram(name: "oputs_", scope: !87, file: !87, line: 573, type: !88, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !90)
!87 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!88 = !DISubroutineType(types: !89)
!89 = !{null, !75, !75}
!90 = !{!91, !92, !93, !96, !97, !98, !99, !103, !104, !105, !106, !108, !164, !165, !166, !168, !169}
!91 = !DILocalVariable(name: "program", arg: 1, scope: !86, file: !87, line: 573, type: !75)
!92 = !DILocalVariable(name: "option", arg: 2, scope: !86, file: !87, line: 573, type: !75)
!93 = !DILocalVariable(name: "term", scope: !94, file: !87, line: 585, type: !75)
!94 = distinct !DILexicalBlock(scope: !95, file: !87, line: 582, column: 5)
!95 = distinct !DILexicalBlock(scope: !86, file: !87, line: 581, column: 7)
!96 = !DILocalVariable(name: "double_space", scope: !86, file: !87, line: 594, type: !81)
!97 = !DILocalVariable(name: "first_word", scope: !86, file: !87, line: 595, type: !75)
!98 = !DILocalVariable(name: "option_text", scope: !86, file: !87, line: 596, type: !75)
!99 = !DILocalVariable(name: "s", scope: !100, file: !87, line: 608, type: !75)
!100 = distinct !DILexicalBlock(scope: !101, file: !87, line: 605, column: 5)
!101 = distinct !DILexicalBlock(scope: !102, file: !87, line: 604, column: 12)
!102 = distinct !DILexicalBlock(scope: !86, file: !87, line: 597, column: 7)
!103 = !DILocalVariable(name: "spaces", scope: !100, file: !87, line: 609, type: !72)
!104 = !DILocalVariable(name: "anchor_len", scope: !86, file: !87, line: 620, type: !72)
!105 = !DILocalVariable(name: "desc_text", scope: !86, file: !87, line: 625, type: !75)
!106 = !DILocalVariable(name: "__ptr", scope: !107, file: !87, line: 644, type: !75)
!107 = distinct !DILexicalBlock(scope: !86, file: !87, line: 644, column: 3)
!108 = !DILocalVariable(name: "__stream", scope: !107, file: !87, line: 644, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !111, line: 7, baseType: !112)
!111 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !113, line: 49, size: 1728, elements: !114)
!113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !130, !132, !133, !134, !138, !139, !141, !145, !148, !150, !153, !156, !157, !158, !159, !160}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !112, file: !113, line: 51, baseType: !70, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !112, file: !113, line: 54, baseType: !67, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !112, file: !113, line: 55, baseType: !67, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !112, file: !113, line: 56, baseType: !67, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !112, file: !113, line: 57, baseType: !67, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !112, file: !113, line: 58, baseType: !67, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !112, file: !113, line: 59, baseType: !67, size: 64, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !112, file: !113, line: 60, baseType: !67, size: 64, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !112, file: !113, line: 61, baseType: !67, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !112, file: !113, line: 64, baseType: !67, size: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !112, file: !113, line: 65, baseType: !67, size: 64, offset: 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !112, file: !113, line: 66, baseType: !67, size: 64, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !112, file: !113, line: 68, baseType: !128, size: 64, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !113, line: 36, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !112, file: !113, line: 70, baseType: !131, size: 64, offset: 832)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !112, file: !113, line: 72, baseType: !70, size: 32, offset: 896)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !112, file: !113, line: 73, baseType: !70, size: 32, offset: 928)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !112, file: !113, line: 74, baseType: !135, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !136, line: 152, baseType: !137)
!136 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!137 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !112, file: !113, line: 77, baseType: !71, size: 16, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !112, file: !113, line: 78, baseType: !140, size: 8, offset: 1040)
!140 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !112, file: !113, line: 79, baseType: !142, size: 8, offset: 1048)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 8, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !112, file: !113, line: 81, baseType: !146, size: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !113, line: 43, baseType: null)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !112, file: !113, line: 89, baseType: !149, size: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !136, line: 153, baseType: !137)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !112, file: !113, line: 91, baseType: !151, size: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !113, line: 37, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !112, file: !113, line: 92, baseType: !154, size: 64, offset: 1280)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !113, line: 38, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !112, file: !113, line: 93, baseType: !131, size: 64, offset: 1344)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !112, file: !113, line: 94, baseType: !69, size: 64, offset: 1408)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !112, file: !113, line: 95, baseType: !72, size: 64, offset: 1472)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !112, file: !113, line: 96, baseType: !70, size: 32, offset: 1536)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !112, file: !113, line: 98, baseType: !161, size: 160, offset: 1568)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 160, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 20)
!164 = !DILocalVariable(name: "__cnt", scope: !107, file: !87, line: 644, type: !72)
!165 = !DILocalVariable(name: "url_program", scope: !86, file: !87, line: 648, type: !75)
!166 = !DILocalVariable(name: "__ptr", scope: !167, file: !87, line: 686, type: !75)
!167 = distinct !DILexicalBlock(scope: !86, file: !87, line: 686, column: 3)
!168 = !DILocalVariable(name: "__stream", scope: !167, file: !87, line: 686, type: !109)
!169 = !DILocalVariable(name: "__cnt", scope: !167, file: !87, line: 686, type: !72)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 58, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 1792, elements: !182)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !175, line: 50, size: 256, elements: !176)
!175 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!176 = !{!177, !178, !179, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !174, file: !175, line: 52, baseType: !75, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !174, file: !175, line: 55, baseType: !70, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !174, file: !175, line: 56, baseType: !180, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !174, file: !175, line: 57, baseType: !70, size: 32, offset: 192)
!182 = !{!183}
!183 = !DISubrange(count: 7)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "counting_mode", scope: !2, file: !3, line: 48, type: !5, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "line_out", scope: !188, file: !3, line: 164, type: !240, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "fold_file", scope: !3, file: !3, line: 159, type: !189, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !191)
!189 = !DISubroutineType(types: !190)
!190 = !{!81, !75, !72}
!191 = !{!192, !193, !194, !195, !196, !200, !210, !211, !222, !228, !229, !230, !231, !233, !236, !237, !239}
!192 = !DILocalVariable(name: "filename", arg: 1, scope: !188, file: !3, line: 159, type: !75)
!193 = !DILocalVariable(name: "width", arg: 2, scope: !188, file: !3, line: 159, type: !72)
!194 = !DILocalVariable(name: "istream", scope: !188, file: !3, line: 161, type: !109)
!195 = !DILocalVariable(name: "column", scope: !188, file: !3, line: 162, type: !72)
!196 = !DILocalVariable(name: "offset_out", scope: !188, file: !3, line: 163, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !198, line: 130, baseType: !199)
!198 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !73, line: 35, baseType: !137)
!200 = !DILocalVariable(name: "mbbuf", scope: !188, file: !3, line: 166, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !202, line: 50, baseType: !203)
!202 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 43, size: 320, elements: !204)
!204 = !{!205, !206, !207, !208, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !203, file: !202, line: 45, baseType: !67, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !203, file: !202, line: 46, baseType: !109, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !202, line: 47, baseType: !197, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !203, file: !202, line: 48, baseType: !197, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !203, file: !202, line: 49, baseType: !197, size: 64, offset: 256)
!210 = !DILocalVariable(name: "saved_errno", scope: !188, file: !3, line: 167, type: !70)
!211 = !DILocalVariable(name: "g", scope: !188, file: !3, line: 186, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !57, line: 143, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 138, size: 64, elements: !214)
!214 = !{!215, !220, !221}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !213, file: !57, line: 140, baseType: !216, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !217, line: 37, baseType: !218)
!217 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !136, line: 57, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !136, line: 42, baseType: !6)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !213, file: !57, line: 141, baseType: !77, size: 8, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !57, line: 142, baseType: !77, size: 8, offset: 40)
!222 = !DILocalVariable(name: "space_length", scope: !223, file: !3, line: 205, type: !70)
!223 = distinct !DILexicalBlock(scope: !224, file: !3, line: 204, column: 13)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 203, column: 15)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 199, column: 9)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 198, column: 11)
!227 = distinct !DILexicalBlock(scope: !188, file: !3, line: 188, column: 5)
!228 = !DILocalVariable(name: "logical_end", scope: !223, file: !3, line: 206, type: !197)
!229 = !DILocalVariable(name: "logical_p", scope: !223, file: !3, line: 207, type: !67)
!230 = !DILocalVariable(name: "logical_lim", scope: !223, file: !3, line: 208, type: !67)
!231 = !DILocalVariable(name: "g2", scope: !232, file: !3, line: 210, type: !212)
!232 = distinct !DILexicalBlock(scope: !223, file: !3, line: 210, column: 15)
!233 = !DILocalVariable(name: "printed_p", scope: !234, file: !3, line: 231, type: !67)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 221, column: 17)
!235 = distinct !DILexicalBlock(scope: !223, file: !3, line: 220, column: 19)
!236 = !DILocalVariable(name: "printed_lim", scope: !234, file: !3, line: 232, type: !67)
!237 = !DILocalVariable(name: "g2", scope: !238, file: !3, line: 233, type: !212)
!238 = distinct !DILexicalBlock(scope: !234, file: !3, line: 233, column: 19)
!239 = !DILabel(scope: !227, name: "rescan", file: !3, line: 195)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2097152, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 262144)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "line_in", scope: !188, file: !3, line: 165, type: !240, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "last_character_width", scope: !2, file: !3, line: 54, type: !70, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 288, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 36)
!250 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!251 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "Version", scope: !254, file: !255, line: 3, type: !75, isLocal: false, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !256, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!256 = !{!252}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "file_name", scope: !259, file: !260, line: 45, type: !75, isLocal: true, isDefinition: true)
!259 = distinct !DICompileUnit(language: DW_LANG_C99, file: !260, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !261, splitDebugInlining: false, nameTableKind: None)
!260 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!261 = !{!257, !262}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !259, file: !260, line: 55, type: !81, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !266, file: !267, line: 66, type: !302, isLocal: false, isDefinition: true)
!266 = distinct !DICompileUnit(language: DW_LANG_C99, file: !267, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !268, globals: !269, splitDebugInlining: false, nameTableKind: None)
!267 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!268 = !{!69, !77}
!269 = !{!270, !296, !264, !298, !300}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "old_file_name", scope: !272, file: !267, line: 304, type: !75, isLocal: true, isDefinition: true)
!272 = distinct !DISubprogram(name: "verror_at_line", scope: !267, file: !267, line: 298, type: !273, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !266, retainedNodes: !289)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !70, !70, !75, !6, !75, !275}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !276, line: 52, baseType: !277)
!276 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !278, line: 32, baseType: !279)
!278 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !280, baseType: !281)
!280 = !DIFile(filename: "lib/error.c", directory: "/src")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !282, size: 256, elements: !283)
!282 = !DINamespace(name: "std", scope: null)
!283 = !{!284, !285, !286, !287, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !281, file: !280, baseType: !69, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !281, file: !280, baseType: !69, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !281, file: !280, baseType: !69, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !281, file: !280, baseType: !70, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !281, file: !280, baseType: !70, size: 32, offset: 224)
!289 = !{!290, !291, !292, !293, !294, !295}
!290 = !DILocalVariable(name: "status", arg: 1, scope: !272, file: !267, line: 298, type: !70)
!291 = !DILocalVariable(name: "errnum", arg: 2, scope: !272, file: !267, line: 298, type: !70)
!292 = !DILocalVariable(name: "file_name", arg: 3, scope: !272, file: !267, line: 298, type: !75)
!293 = !DILocalVariable(name: "line_number", arg: 4, scope: !272, file: !267, line: 298, type: !6)
!294 = !DILocalVariable(name: "message", arg: 5, scope: !272, file: !267, line: 298, type: !75)
!295 = !DILocalVariable(name: "args", arg: 6, scope: !272, file: !267, line: 298, type: !275)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "old_line_number", scope: !272, file: !267, line: 305, type: !6, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "error_message_count", scope: !266, file: !267, line: 69, type: !6, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !266, file: !267, line: 295, type: !70, isLocal: false, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "program_name", scope: !307, file: !308, line: 31, type: !75, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !309, globals: !310, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!309 = !{!67}
!310 = !{!305}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "utf07FF", scope: !313, file: !314, line: 46, type: !340, isLocal: true, isDefinition: true)
!313 = distinct !DISubprogram(name: "proper_name_lite", scope: !314, file: !314, line: 38, type: !315, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !317, retainedNodes: !319)
!314 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!315 = !DISubroutineType(types: !316)
!316 = !{!75, !75, !75}
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !318, splitDebugInlining: false, nameTableKind: None)
!318 = !{!311}
!319 = !{!320, !321, !322, !323, !324}
!320 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !313, file: !314, line: 38, type: !75)
!321 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !313, file: !314, line: 38, type: !75)
!322 = !DILocalVariable(name: "translation", scope: !313, file: !314, line: 40, type: !75)
!323 = !DILocalVariable(name: "w", scope: !313, file: !314, line: 47, type: !216)
!324 = !DILocalVariable(name: "mbs", scope: !313, file: !314, line: 48, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !326, line: 6, baseType: !327)
!326 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !328, line: 21, baseType: !329)
!328 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 13, size: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !329, file: !328, line: 15, baseType: !70, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !329, file: !328, line: 20, baseType: !333, size: 32, offset: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !328, line: 16, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !333, file: !328, line: 18, baseType: !6, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !333, file: !328, line: 19, baseType: !337, size: 32)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 4)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 2)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !345, file: !346, line: 76, type: !414, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !347, retainedTypes: !353, globals: !354, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!347 = !{!33, !348, !18}
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !34, line: 254, baseType: !6, size: 32, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!351 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!352 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!353 = !{!70, !71, !72}
!354 = !{!343, !355, !361, !373, !375, !380, !403, !410, !412}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !345, file: !346, line: 92, type: !357, isLocal: false, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 320, elements: !359)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!359 = !{!360}
!360 = !DISubrange(count: 10)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !345, file: !346, line: 1040, type: !363, isLocal: false, isDefinition: true)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !346, line: 56, size: 448, elements: !364)
!364 = !{!365, !366, !367, !371, !372}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !363, file: !346, line: 59, baseType: !33, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !363, file: !346, line: 62, baseType: !70, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !363, file: !346, line: 66, baseType: !368, size: 256, offset: 64)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 8)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !363, file: !346, line: 69, baseType: !75, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !363, file: !346, line: 72, baseType: !75, size: 64, offset: 384)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !345, file: !346, line: 107, type: !363, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "slot0", scope: !345, file: !346, line: 831, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2048, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 256)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "quote", scope: !382, file: !346, line: 228, type: !401, isLocal: true, isDefinition: true)
!382 = distinct !DISubprogram(name: "gettext_quote", scope: !346, file: !346, line: 197, type: !383, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !345, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!75, !75, !33}
!385 = !{!386, !387, !388, !389, !390}
!386 = !DILocalVariable(name: "msgid", arg: 1, scope: !382, file: !346, line: 197, type: !75)
!387 = !DILocalVariable(name: "s", arg: 2, scope: !382, file: !346, line: 197, type: !33)
!388 = !DILocalVariable(name: "translation", scope: !382, file: !346, line: 199, type: !75)
!389 = !DILocalVariable(name: "w", scope: !382, file: !346, line: 229, type: !216)
!390 = !DILocalVariable(name: "mbs", scope: !382, file: !346, line: 230, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !326, line: 6, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !328, line: 21, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 13, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !393, file: !328, line: 15, baseType: !70, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !393, file: !328, line: 20, baseType: !397, size: 32, offset: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !393, file: !328, line: 16, size: 32, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !397, file: !328, line: 18, baseType: !6, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !397, file: !328, line: 19, baseType: !337, size: 32)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !402)
!402 = !{!342, !339}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "slotvec", scope: !345, file: !346, line: 834, type: !405, isLocal: true, isDefinition: true)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !346, line: 823, size: 128, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !346, line: 825, baseType: !72, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !406, file: !346, line: 826, baseType: !67, size: 64, offset: 64)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "nslots", scope: !345, file: !346, line: 832, type: !70, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "slotvec0", scope: !345, file: !346, line: 833, type: !406, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 704, elements: !416)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!416 = !{!417}
!417 = !DISubrange(count: 11)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !420, file: !421, line: 26, type: !423, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !422, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!422 = !{!418}
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 47)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "exit_failure", scope: !428, file: !429, line: 24, type: !431, isLocal: false, isDefinition: true)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !430, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!430 = !{!426}
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "internal_state", scope: !434, file: !435, line: 97, type: !438, isLocal: true, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !436, globals: !437, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!436 = !{!69, !72, !77}
!437 = !{!432}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !326, line: 6, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !328, line: 21, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 13, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !440, file: !328, line: 15, baseType: !70, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !440, file: !328, line: 20, baseType: !444, size: 32, offset: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !440, file: !328, line: 16, size: 32, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !444, file: !328, line: 18, baseType: !6, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !444, file: !328, line: 19, baseType: !337, size: 32)
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !450, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!450 = !{!47}
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!455 = !{!69}
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !464, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!464 = !{!465}
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !463, line: 40, baseType: !6, size: 32, elements: !466)
!466 = !{!467}
!467 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !498, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!470 = !{!471, !483}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !472, file: !469, line: 188, baseType: !6, size: 32, elements: !481)
!472 = distinct !DISubprogram(name: "x2nrealloc", scope: !469, file: !469, line: 176, type: !473, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !476)
!473 = !DISubroutineType(types: !474)
!474 = !{!69, !69, !475, !72}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!476 = !{!477, !478, !479, !480}
!477 = !DILocalVariable(name: "p", arg: 1, scope: !472, file: !469, line: 176, type: !69)
!478 = !DILocalVariable(name: "pn", arg: 2, scope: !472, file: !469, line: 176, type: !475)
!479 = !DILocalVariable(name: "s", arg: 3, scope: !472, file: !469, line: 176, type: !72)
!480 = !DILocalVariable(name: "n", scope: !472, file: !469, line: 178, type: !72)
!481 = !{!482}
!482 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !484, file: !469, line: 228, baseType: !6, size: 32, elements: !481)
!484 = distinct !DISubprogram(name: "xpalloc", scope: !469, file: !469, line: 223, type: !485, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !488)
!485 = !DISubroutineType(types: !486)
!486 = !{!69, !69, !487, !197, !199, !197}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497}
!489 = !DILocalVariable(name: "pa", arg: 1, scope: !484, file: !469, line: 223, type: !69)
!490 = !DILocalVariable(name: "pn", arg: 2, scope: !484, file: !469, line: 223, type: !487)
!491 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !484, file: !469, line: 223, type: !197)
!492 = !DILocalVariable(name: "n_max", arg: 4, scope: !484, file: !469, line: 223, type: !199)
!493 = !DILocalVariable(name: "s", arg: 5, scope: !484, file: !469, line: 223, type: !197)
!494 = !DILocalVariable(name: "n0", scope: !484, file: !469, line: 230, type: !197)
!495 = !DILocalVariable(name: "n", scope: !484, file: !469, line: 237, type: !197)
!496 = !DILocalVariable(name: "nbytes", scope: !484, file: !469, line: 248, type: !197)
!497 = !DILocalVariable(name: "adjusted_nbytes", scope: !484, file: !469, line: 252, type: !197)
!498 = !{!67, !69, !81, !137, !74}
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !502, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !503, splitDebugInlining: false, nameTableKind: None)
!502 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!503 = !{!504, !11}
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !505, line: 30, baseType: !6, size: 32, elements: !506)
!505 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!506 = !{!507, !508, !509, !510, !511}
!507 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!508 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!509 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!510 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!511 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !514, retainedTypes: !515, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!514 = !{!504, !18}
!515 = !{!70, !71, !67, !81, !74, !516}
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !517, line: 102, baseType: !518)
!517 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !136, line: 73, baseType: !74)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !525, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!525 = !{!81, !74, !69}
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!532 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!533 = !{i32 7, !"Dwarf Version", i32 5}
!534 = !{i32 2, !"Debug Info Version", i32 3}
!535 = !{i32 1, !"wchar_size", i32 4}
!536 = !{i32 1, !"branch-target-enforcement", i32 0}
!537 = !{i32 1, !"sign-return-address", i32 0}
!538 = !{i32 1, !"sign-return-address-all", i32 0}
!539 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!540 = !{i32 7, !"PIC Level", i32 2}
!541 = !{i32 7, !"PIE Level", i32 2}
!542 = !{i32 7, !"uwtable", i32 1}
!543 = !{i32 7, !"frame-pointer", i32 1}
!544 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 70, type: !545, scopeLine: 71, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !547)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !70}
!547 = !{!548}
!548 = !DILocalVariable(name: "status", arg: 1, scope: !544, file: !3, line: 70, type: !70)
!549 = !DILocation(line: 0, scope: !544)
!550 = !DILocation(line: 72, column: 14, scope: !551)
!551 = distinct !DILexicalBlock(scope: !544, file: !3, line: 72, column: 7)
!552 = !DILocation(line: 72, column: 7, scope: !544)
!553 = !DILocation(line: 73, column: 5, scope: !554)
!554 = distinct !DILexicalBlock(scope: !551, file: !3, line: 73, column: 5)
!555 = !{!556, !556, i64 0}
!556 = !{!"any pointer", !557, i64 0}
!557 = !{!"omnipotent char", !558, i64 0}
!558 = !{!"Simple C/C++ TBAA"}
!559 = !DILocation(line: 76, column: 7, scope: !560)
!560 = distinct !DILexicalBlock(scope: !551, file: !3, line: 75, column: 5)
!561 = !DILocation(line: 80, column: 7, scope: !560)
!562 = !DILocation(line: 729, column: 3, scope: !563, inlinedAt: !565)
!563 = distinct !DISubprogram(name: "emit_stdin_note", scope: !87, file: !87, line: 727, type: !303, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !564)
!564 = !{}
!565 = distinct !DILocation(line: 84, column: 7, scope: !560)
!566 = !DILocation(line: 736, column: 3, scope: !567, inlinedAt: !568)
!567 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !87, file: !87, line: 734, type: !303, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !564)
!568 = distinct !DILocation(line: 85, column: 7, scope: !560)
!569 = !DILocation(line: 87, column: 7, scope: !560)
!570 = !DILocation(line: 91, column: 7, scope: !560)
!571 = !DILocation(line: 95, column: 7, scope: !560)
!572 = !DILocation(line: 99, column: 7, scope: !560)
!573 = !DILocation(line: 103, column: 7, scope: !560)
!574 = !DILocation(line: 104, column: 7, scope: !560)
!575 = !DILocalVariable(name: "program", arg: 1, scope: !576, file: !87, line: 836, type: !75)
!576 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !87, file: !87, line: 836, type: !577, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !75}
!579 = !{!575, !580, !587, !588, !590, !591}
!580 = !DILocalVariable(name: "infomap", scope: !576, file: !87, line: 838, type: !581)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 896, elements: !182)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !576, file: !87, line: 838, size: 128, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !583, file: !87, line: 838, baseType: !75, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !583, file: !87, line: 838, baseType: !75, size: 64, offset: 64)
!587 = !DILocalVariable(name: "node", scope: !576, file: !87, line: 848, type: !75)
!588 = !DILocalVariable(name: "map_prog", scope: !576, file: !87, line: 849, type: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!590 = !DILocalVariable(name: "lc_messages", scope: !576, file: !87, line: 861, type: !75)
!591 = !DILocalVariable(name: "url_program", scope: !576, file: !87, line: 874, type: !75)
!592 = !DILocation(line: 0, scope: !576, inlinedAt: !593)
!593 = distinct !DILocation(line: 105, column: 7, scope: !560)
!594 = !DILocation(line: 838, column: 3, scope: !576, inlinedAt: !593)
!595 = !DILocation(line: 838, column: 67, scope: !576, inlinedAt: !593)
!596 = !DILocation(line: 849, column: 36, scope: !576, inlinedAt: !593)
!597 = !DILocation(line: 851, column: 3, scope: !576, inlinedAt: !593)
!598 = !DILocalVariable(name: "__s1", arg: 1, scope: !599, file: !600, line: 1359, type: !75)
!599 = distinct !DISubprogram(name: "streq", scope: !600, file: !600, line: 1359, type: !601, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !603)
!600 = !DIFile(filename: "./lib/string.h", directory: "/src")
!601 = !DISubroutineType(types: !602)
!602 = !{!81, !75, !75}
!603 = !{!598, !604}
!604 = !DILocalVariable(name: "__s2", arg: 2, scope: !599, file: !600, line: 1359, type: !75)
!605 = !DILocation(line: 0, scope: !599, inlinedAt: !606)
!606 = distinct !DILocation(line: 851, column: 33, scope: !576, inlinedAt: !593)
!607 = !DILocation(line: 1361, column: 11, scope: !599, inlinedAt: !606)
!608 = !DILocation(line: 1361, column: 10, scope: !599, inlinedAt: !606)
!609 = !DILocation(line: 852, column: 13, scope: !576, inlinedAt: !593)
!610 = !DILocation(line: 851, column: 20, scope: !576, inlinedAt: !593)
!611 = !{!612, !556, i64 0}
!612 = !{!"infomap", !556, i64 0, !556, i64 8}
!613 = !DILocation(line: 851, column: 10, scope: !576, inlinedAt: !593)
!614 = !DILocation(line: 851, column: 28, scope: !576, inlinedAt: !593)
!615 = distinct !{!615, !597, !609, !616}
!616 = !{!"llvm.loop.mustprogress"}
!617 = !DILocation(line: 854, column: 17, scope: !618, inlinedAt: !593)
!618 = distinct !DILexicalBlock(scope: !576, file: !87, line: 854, column: 7)
!619 = !{!612, !556, i64 8}
!620 = !DILocation(line: 854, column: 7, scope: !618, inlinedAt: !593)
!621 = !DILocation(line: 854, column: 7, scope: !576, inlinedAt: !593)
!622 = !DILocation(line: 857, column: 3, scope: !576, inlinedAt: !593)
!623 = !DILocation(line: 861, column: 29, scope: !576, inlinedAt: !593)
!624 = !DILocation(line: 862, column: 7, scope: !625, inlinedAt: !593)
!625 = distinct !DILexicalBlock(scope: !576, file: !87, line: 862, column: 7)
!626 = !DILocation(line: 862, column: 19, scope: !625, inlinedAt: !593)
!627 = !DILocation(line: 862, column: 22, scope: !625, inlinedAt: !593)
!628 = !DILocation(line: 862, column: 7, scope: !576, inlinedAt: !593)
!629 = !DILocation(line: 868, column: 7, scope: !630, inlinedAt: !593)
!630 = distinct !DILexicalBlock(scope: !625, file: !87, line: 863, column: 5)
!631 = !DILocation(line: 870, column: 5, scope: !630, inlinedAt: !593)
!632 = !DILocation(line: 0, scope: !599, inlinedAt: !633)
!633 = distinct !DILocation(line: 874, column: 29, scope: !576, inlinedAt: !593)
!634 = !DILocation(line: 875, column: 3, scope: !576, inlinedAt: !593)
!635 = !DILocation(line: 877, column: 3, scope: !576, inlinedAt: !593)
!636 = !DILocation(line: 879, column: 1, scope: !576, inlinedAt: !593)
!637 = !DILocation(line: 107, column: 3, scope: !544)
!638 = !DISubprogram(name: "dcgettext", scope: !639, file: !639, line: 51, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!639 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!640 = !DISubroutineType(types: !641)
!641 = !{!67, !75, !75, !70}
!642 = !DISubprogram(name: "fputs_unlocked", scope: !276, file: !276, line: 691, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!643 = !DISubroutineType(types: !644)
!644 = !{!70, !645, !646}
!645 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!646 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !109)
!647 = !DILocation(line: 0, scope: !86)
!648 = !DILocation(line: 581, column: 7, scope: !95)
!649 = !{!650, !650, i64 0}
!650 = !{!"int", !557, i64 0}
!651 = !DILocation(line: 581, column: 19, scope: !95)
!652 = !DILocation(line: 581, column: 7, scope: !86)
!653 = !DILocation(line: 585, column: 26, scope: !94)
!654 = !DILocation(line: 0, scope: !94)
!655 = !DILocation(line: 586, column: 23, scope: !94)
!656 = !DILocation(line: 586, column: 28, scope: !94)
!657 = !DILocation(line: 586, column: 32, scope: !94)
!658 = !{!557, !557, i64 0}
!659 = !DILocation(line: 586, column: 38, scope: !94)
!660 = !DILocation(line: 0, scope: !599, inlinedAt: !661)
!661 = distinct !DILocation(line: 586, column: 41, scope: !94)
!662 = !DILocation(line: 1361, column: 11, scope: !599, inlinedAt: !661)
!663 = !DILocation(line: 1361, column: 10, scope: !599, inlinedAt: !661)
!664 = !DILocation(line: 586, column: 19, scope: !94)
!665 = !DILocation(line: 587, column: 5, scope: !94)
!666 = !DILocation(line: 588, column: 7, scope: !667)
!667 = distinct !DILexicalBlock(scope: !86, file: !87, line: 588, column: 7)
!668 = !DILocation(line: 588, column: 7, scope: !86)
!669 = !DILocation(line: 590, column: 7, scope: !670)
!670 = distinct !DILexicalBlock(scope: !667, file: !87, line: 589, column: 5)
!671 = !DILocation(line: 591, column: 7, scope: !670)
!672 = !DILocation(line: 595, column: 37, scope: !86)
!673 = !DILocation(line: 595, column: 35, scope: !86)
!674 = !DILocation(line: 596, column: 29, scope: !86)
!675 = !DILocation(line: 597, column: 8, scope: !102)
!676 = !DILocation(line: 597, column: 7, scope: !86)
!677 = !DILocation(line: 604, column: 24, scope: !101)
!678 = !DILocation(line: 604, column: 12, scope: !102)
!679 = !DILocation(line: 0, scope: !100)
!680 = !DILocation(line: 610, column: 16, scope: !100)
!681 = !DILocation(line: 610, column: 7, scope: !100)
!682 = !DILocation(line: 611, column: 21, scope: !100)
!683 = !{!684, !684, i64 0}
!684 = !{!"short", !557, i64 0}
!685 = !DILocation(line: 611, column: 19, scope: !100)
!686 = !DILocation(line: 611, column: 16, scope: !100)
!687 = !DILocation(line: 610, column: 30, scope: !100)
!688 = distinct !{!688, !681, !682, !616}
!689 = !DILocation(line: 612, column: 18, scope: !690)
!690 = distinct !DILexicalBlock(scope: !100, file: !87, line: 612, column: 11)
!691 = !DILocation(line: 612, column: 11, scope: !100)
!692 = !DILocation(line: 620, column: 23, scope: !86)
!693 = !DILocation(line: 625, column: 39, scope: !86)
!694 = !DILocation(line: 626, column: 3, scope: !86)
!695 = !DILocation(line: 626, column: 10, scope: !86)
!696 = !DILocation(line: 626, column: 21, scope: !86)
!697 = !DILocation(line: 628, column: 44, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !87, line: 628, column: 11)
!699 = distinct !DILexicalBlock(scope: !86, file: !87, line: 627, column: 5)
!700 = !DILocation(line: 628, column: 32, scope: !698)
!701 = !DILocation(line: 628, column: 49, scope: !698)
!702 = !DILocation(line: 628, column: 11, scope: !699)
!703 = !DILocation(line: 630, column: 11, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !87, line: 630, column: 11)
!705 = !DILocation(line: 630, column: 11, scope: !699)
!706 = !DILocation(line: 632, column: 26, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !87, line: 632, column: 15)
!708 = distinct !DILexicalBlock(scope: !704, file: !87, line: 631, column: 9)
!709 = !DILocation(line: 632, column: 34, scope: !707)
!710 = !DILocation(line: 632, column: 37, scope: !707)
!711 = !DILocation(line: 632, column: 15, scope: !708)
!712 = !DILocation(line: 636, column: 29, scope: !713)
!713 = distinct !DILexicalBlock(scope: !708, file: !87, line: 636, column: 15)
!714 = !DILocation(line: 640, column: 16, scope: !699)
!715 = distinct !{!715, !694, !716, !616}
!716 = !DILocation(line: 641, column: 5, scope: !86)
!717 = !DILocation(line: 644, column: 3, scope: !86)
!718 = !DILocation(line: 0, scope: !599, inlinedAt: !719)
!719 = distinct !DILocation(line: 648, column: 31, scope: !86)
!720 = !DILocation(line: 0, scope: !599, inlinedAt: !721)
!721 = distinct !DILocation(line: 649, column: 31, scope: !86)
!722 = !DILocation(line: 0, scope: !599, inlinedAt: !723)
!723 = distinct !DILocation(line: 650, column: 31, scope: !86)
!724 = !DILocation(line: 0, scope: !599, inlinedAt: !725)
!725 = distinct !DILocation(line: 651, column: 31, scope: !86)
!726 = !DILocation(line: 0, scope: !599, inlinedAt: !727)
!727 = distinct !DILocation(line: 652, column: 31, scope: !86)
!728 = !DILocation(line: 0, scope: !599, inlinedAt: !729)
!729 = distinct !DILocation(line: 653, column: 31, scope: !86)
!730 = !DILocation(line: 0, scope: !599, inlinedAt: !731)
!731 = distinct !DILocation(line: 654, column: 31, scope: !86)
!732 = !DILocation(line: 0, scope: !599, inlinedAt: !733)
!733 = distinct !DILocation(line: 655, column: 31, scope: !86)
!734 = !DILocation(line: 0, scope: !599, inlinedAt: !735)
!735 = distinct !DILocation(line: 656, column: 31, scope: !86)
!736 = !DILocation(line: 0, scope: !599, inlinedAt: !737)
!737 = distinct !DILocation(line: 657, column: 31, scope: !86)
!738 = !DILocation(line: 663, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !86, file: !87, line: 663, column: 7)
!740 = !DILocation(line: 664, column: 7, scope: !739)
!741 = !DILocation(line: 664, column: 10, scope: !739)
!742 = !DILocation(line: 663, column: 7, scope: !86)
!743 = !DILocation(line: 669, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !739, file: !87, line: 665, column: 5)
!745 = !DILocation(line: 671, column: 5, scope: !744)
!746 = !DILocation(line: 676, column: 7, scope: !747)
!747 = distinct !DILexicalBlock(scope: !739, file: !87, line: 673, column: 5)
!748 = !DILocation(line: 679, column: 3, scope: !86)
!749 = !DILocation(line: 683, column: 3, scope: !86)
!750 = !DILocation(line: 686, column: 3, scope: !86)
!751 = !DILocation(line: 688, column: 3, scope: !86)
!752 = !DILocation(line: 691, column: 3, scope: !86)
!753 = !DILocation(line: 695, column: 3, scope: !86)
!754 = !DILocation(line: 696, column: 1, scope: !86)
!755 = !DISubprogram(name: "setlocale", scope: !756, file: !756, line: 122, type: !757, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!756 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!757 = !DISubroutineType(types: !758)
!758 = !{!67, !70, !75}
!759 = !DISubprogram(name: "getenv", scope: !760, file: !760, line: 641, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!760 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!761 = !DISubroutineType(types: !762)
!762 = !{!67, !75}
!763 = !DISubprogram(name: "fwrite_unlocked", scope: !276, file: !276, line: 704, type: !764, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!764 = !DISubroutineType(types: !765)
!765 = !{!72, !766, !72, !72, !646}
!766 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!769 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 289, type: !770, scopeLine: 290, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!770 = !DISubroutineType(types: !771)
!771 = !{!70, !70, !772}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!773 = !{!774, !775, !776, !777, !778, !779, !782}
!774 = !DILocalVariable(name: "argc", arg: 1, scope: !769, file: !3, line: 289, type: !70)
!775 = !DILocalVariable(name: "argv", arg: 2, scope: !769, file: !3, line: 289, type: !772)
!776 = !DILocalVariable(name: "width", scope: !769, file: !3, line: 291, type: !72)
!777 = !DILocalVariable(name: "optc", scope: !769, file: !3, line: 292, type: !70)
!778 = !DILocalVariable(name: "ok", scope: !769, file: !3, line: 293, type: !81)
!779 = !DILocalVariable(name: "optargbuf", scope: !780, file: !3, line: 305, type: !781)
!780 = distinct !DILexicalBlock(scope: !769, file: !3, line: 304, column: 5)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16, elements: !341)
!782 = !DILocalVariable(name: "i", scope: !783, file: !3, line: 352, type: !70)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 352, column: 7)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 350, column: 5)
!785 = distinct !DILexicalBlock(scope: !769, file: !3, line: 347, column: 7)
!786 = !DILocation(line: 0, scope: !769)
!787 = !DILocation(line: 296, column: 21, scope: !769)
!788 = !DILocation(line: 296, column: 3, scope: !769)
!789 = !DILocation(line: 297, column: 3, scope: !769)
!790 = !DILocation(line: 298, column: 3, scope: !769)
!791 = !DILocation(line: 299, column: 3, scope: !769)
!792 = !DILocation(line: 301, column: 3, scope: !769)
!793 = !DILocation(line: 303, column: 18, scope: !769)
!794 = !DILocation(line: 303, column: 71, scope: !769)
!795 = !DILocation(line: 303, column: 3, scope: !769)
!796 = !DILocation(line: 305, column: 7, scope: !780)
!797 = !DILocation(line: 305, column: 12, scope: !780)
!798 = !DILocation(line: 307, column: 7, scope: !780)
!799 = !DILocation(line: 333, column: 31, scope: !800)
!800 = distinct !DILexicalBlock(scope: !780, file: !3, line: 308, column: 9)
!801 = !DILocation(line: 310, column: 25, scope: !800)
!802 = !DILocation(line: 311, column: 11, scope: !800)
!803 = !DILocation(line: 314, column: 25, scope: !800)
!804 = !DILocation(line: 315, column: 11, scope: !800)
!805 = !DILocation(line: 318, column: 24, scope: !800)
!806 = !DILocation(line: 319, column: 11, scope: !800)
!807 = !DILocation(line: 323, column: 15, scope: !808)
!808 = distinct !DILexicalBlock(scope: !800, file: !3, line: 323, column: 15)
!809 = !DILocation(line: 323, column: 15, scope: !800)
!810 = !DILocation(line: 324, column: 19, scope: !808)
!811 = !DILocation(line: 324, column: 13, scope: !808)
!812 = !DILocation(line: 327, column: 30, scope: !813)
!813 = distinct !DILexicalBlock(scope: !808, file: !3, line: 326, column: 13)
!814 = !DILocation(line: 327, column: 28, scope: !813)
!815 = !DILocation(line: 328, column: 28, scope: !813)
!816 = !DILocation(line: 329, column: 22, scope: !813)
!817 = !DILocation(line: 334, column: 31, scope: !800)
!818 = !DILocation(line: 333, column: 19, scope: !800)
!819 = !DILocation(line: 336, column: 11, scope: !800)
!820 = !DILocation(line: 338, column: 9, scope: !800)
!821 = !DILocation(line: 340, column: 9, scope: !800)
!822 = !DILocation(line: 343, column: 11, scope: !800)
!823 = !DILocation(line: 345, column: 5, scope: !769)
!824 = distinct !{!824, !795, !823, !616}
!825 = !DILocation(line: 347, column: 15, scope: !785)
!826 = !DILocation(line: 347, column: 12, scope: !785)
!827 = !DILocation(line: 347, column: 7, scope: !769)
!828 = !DILocation(line: 0, scope: !783)
!829 = !DILocation(line: 352, column: 30, scope: !830)
!830 = distinct !DILexicalBlock(scope: !783, file: !3, line: 352, column: 7)
!831 = !DILocation(line: 352, column: 7, scope: !783)
!832 = !DILocation(line: 348, column: 10, scope: !785)
!833 = !DILocation(line: 348, column: 5, scope: !785)
!834 = !DILocation(line: 353, column: 26, scope: !830)
!835 = !DILocation(line: 353, column: 15, scope: !830)
!836 = !DILocation(line: 353, column: 12, scope: !830)
!837 = !DILocation(line: 352, column: 39, scope: !830)
!838 = distinct !{!838, !831, !839, !616}
!839 = !DILocation(line: 353, column: 40, scope: !783)
!840 = !DILocation(line: 356, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !769, file: !3, line: 356, column: 7)
!842 = !DILocation(line: 356, column: 23, scope: !841)
!843 = !DILocation(line: 356, column: 34, scope: !841)
!844 = !DILocation(line: 356, column: 26, scope: !841)
!845 = !DILocation(line: 356, column: 41, scope: !841)
!846 = !DILocation(line: 356, column: 7, scope: !769)
!847 = !DILocation(line: 357, column: 5, scope: !841)
!848 = !DILocation(line: 359, column: 10, scope: !769)
!849 = !DILocation(line: 359, column: 3, scope: !769)
!850 = !DISubprogram(name: "bindtextdomain", scope: !639, file: !639, line: 86, type: !851, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!851 = !DISubroutineType(types: !852)
!852 = !{!67, !75, !75}
!853 = !DISubprogram(name: "textdomain", scope: !639, file: !639, line: 82, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!854 = !DISubprogram(name: "atexit", scope: !760, file: !760, line: 602, type: !855, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!855 = !DISubroutineType(types: !856)
!856 = !{!70, !302}
!857 = !DISubprogram(name: "getopt_long", scope: !175, file: !175, line: 66, type: !858, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !564)
!858 = !DISubroutineType(types: !859)
!859 = !{!70, !70, !860, !75, !862, !180}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!863 = !DILocation(line: 0, scope: !188)
!864 = !DILocation(line: 0, scope: !599, inlinedAt: !865)
!865 = distinct !DILocation(line: 169, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !188, file: !3, line: 169, column: 7)
!867 = !DILocation(line: 1361, column: 11, scope: !599, inlinedAt: !865)
!868 = !DILocation(line: 1361, column: 10, scope: !599, inlinedAt: !865)
!869 = !DILocation(line: 169, column: 7, scope: !188)
!870 = !DILocation(line: 171, column: 17, scope: !871)
!871 = distinct !DILexicalBlock(scope: !866, file: !3, line: 170, column: 5)
!872 = !DILocation(line: 172, column: 23, scope: !871)
!873 = !DILocation(line: 173, column: 5, scope: !871)
!874 = !DILocation(line: 175, column: 15, scope: !866)
!875 = !DILocation(line: 0, scope: !866)
!876 = !DILocation(line: 177, column: 15, scope: !877)
!877 = distinct !DILexicalBlock(scope: !188, file: !3, line: 177, column: 7)
!878 = !DILocation(line: 177, column: 7, scope: !188)
!879 = !DILocation(line: 179, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !877, file: !3, line: 178, column: 5)
!881 = !DILocation(line: 180, column: 7, scope: !880)
!882 = !DILocation(line: 183, column: 3, scope: !188)
!883 = !DILocation(line: 187, column: 3, scope: !188)
!884 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !885, file: !202, line: 71, type: !888)
!885 = distinct !DISubprogram(name: "mbbuf_get_char", scope: !202, file: !202, line: 71, type: !886, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !889)
!886 = !DISubroutineType(types: !887)
!887 = !{!212, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!889 = !{!884, !890, !891, !894}
!890 = !DILocalVariable(name: "available", scope: !885, file: !202, line: 73, type: !197)
!891 = !DILocalVariable(name: "start", scope: !892, file: !202, line: 77, type: !197)
!892 = distinct !DILexicalBlock(scope: !893, file: !202, line: 76, column: 5)
!893 = distinct !DILexicalBlock(scope: !885, file: !202, line: 75, column: 7)
!894 = !DILocalVariable(name: "g", scope: !885, file: !202, line: 92, type: !212)
!895 = !DILocation(line: 0, scope: !885, inlinedAt: !896)
!896 = distinct !DILocation(line: 187, column: 15, scope: !188)
!897 = !DILocation(line: 73, column: 35, scope: !885, inlinedAt: !896)
!898 = !DILocation(line: 75, column: 17, scope: !893, inlinedAt: !896)
!899 = !DILocation(line: 75, column: 32, scope: !893, inlinedAt: !896)
!900 = !DILocalVariable(name: "__stream", arg: 1, scope: !901, file: !902, line: 128, type: !109)
!901 = distinct !DISubprogram(name: "feof_unlocked", scope: !902, file: !902, line: 128, type: !903, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!902 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!903 = !DISubroutineType(types: !904)
!904 = !{!70, !109}
!905 = !{!900}
!906 = !DILocation(line: 0, scope: !901, inlinedAt: !907)
!907 = distinct !DILocation(line: 75, column: 37, scope: !893, inlinedAt: !896)
!908 = !DILocation(line: 130, column: 10, scope: !901, inlinedAt: !907)
!909 = !{!910, !650, i64 0}
!910 = !{!"_IO_FILE", !650, i64 0, !556, i64 8, !556, i64 16, !556, i64 24, !556, i64 32, !556, i64 40, !556, i64 48, !556, i64 56, !556, i64 64, !556, i64 72, !556, i64 80, !556, i64 88, !556, i64 96, !556, i64 104, !650, i64 112, !650, i64 116, !911, i64 120, !684, i64 128, !557, i64 130, !557, i64 131, !556, i64 136, !911, i64 144, !556, i64 152, !556, i64 160, !556, i64 168, !556, i64 176, !911, i64 184, !650, i64 192, !557, i64 196}
!911 = !{!"long", !557, i64 0}
!912 = !DILocation(line: 75, column: 37, scope: !893, inlinedAt: !896)
!913 = !DILocation(line: 75, column: 7, scope: !885, inlinedAt: !896)
!914 = !DILocation(line: 78, column: 15, scope: !915, inlinedAt: !896)
!915 = distinct !DILexicalBlock(scope: !892, file: !202, line: 78, column: 11)
!916 = !DILocation(line: 78, column: 11, scope: !892, inlinedAt: !896)
!917 = !DILocation(line: 82, column: 49, scope: !918, inlinedAt: !896)
!918 = distinct !DILexicalBlock(scope: !915, file: !202, line: 81, column: 9)
!919 = !DILocalVariable(name: "__dest", arg: 1, scope: !920, file: !921, line: 34, type: !69)
!920 = distinct !DISubprogram(name: "memmove", scope: !921, file: !921, line: 34, type: !922, scopeLine: 35, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !924)
!921 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!922 = !DISubroutineType(types: !923)
!923 = !{!69, !69, !767, !72}
!924 = !{!919, !925, !926}
!925 = !DILocalVariable(name: "__src", arg: 2, scope: !920, file: !921, line: 34, type: !767)
!926 = !DILocalVariable(name: "__len", arg: 3, scope: !920, file: !921, line: 34, type: !72)
!927 = !DILocation(line: 0, scope: !920, inlinedAt: !928)
!928 = distinct !DILocation(line: 82, column: 11, scope: !918, inlinedAt: !896)
!929 = !DILocation(line: 36, column: 10, scope: !920, inlinedAt: !928)
!930 = !DILocation(line: 0, scope: !892, inlinedAt: !896)
!931 = !DILocation(line: 0, scope: !915, inlinedAt: !896)
!932 = !DILocation(line: 85, column: 23, scope: !892, inlinedAt: !896)
!933 = !DILocation(line: 86, column: 41, scope: !892, inlinedAt: !896)
!934 = !DILocation(line: 89, column: 5, scope: !892, inlinedAt: !896)
!935 = !DILocation(line: 90, column: 17, scope: !936, inlinedAt: !896)
!936 = distinct !DILexicalBlock(scope: !885, file: !202, line: 90, column: 7)
!937 = !DILocation(line: 90, column: 7, scope: !885, inlinedAt: !896)
!938 = !DILocation(line: 92, column: 39, scope: !885, inlinedAt: !896)
!939 = !DILocalVariable(name: "p", arg: 1, scope: !940, file: !57, line: 230, type: !75)
!940 = distinct !DISubprogram(name: "mcel_scan", scope: !57, file: !57, line: 230, type: !941, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{!212, !75, !75}
!943 = !{!939, !944, !945, !946, !957, !958}
!944 = !DILocalVariable(name: "lim", arg: 2, scope: !940, file: !57, line: 230, type: !75)
!945 = !DILocalVariable(name: "c", scope: !940, file: !57, line: 235, type: !68)
!946 = !DILocalVariable(name: "mbs", scope: !940, file: !57, line: 244, type: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !326, line: 6, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !328, line: 21, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 13, size: 64, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !949, file: !328, line: 15, baseType: !70, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !949, file: !328, line: 20, baseType: !953, size: 32, offset: 32)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !949, file: !328, line: 16, size: 32, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !953, file: !328, line: 18, baseType: !6, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !953, file: !328, line: 19, baseType: !337, size: 32)
!957 = !DILocalVariable(name: "ch", scope: !940, file: !57, line: 267, type: !216)
!958 = !DILocalVariable(name: "len", scope: !940, file: !57, line: 268, type: !72)
!959 = !DILocation(line: 0, scope: !940, inlinedAt: !960)
!960 = distinct !DILocation(line: 92, column: 14, scope: !885, inlinedAt: !896)
!961 = !DILocation(line: 235, column: 12, scope: !940, inlinedAt: !960)
!962 = !DILocalVariable(name: "c", arg: 1, scope: !963, file: !57, line: 215, type: !68)
!963 = distinct !DISubprogram(name: "mcel_isbasic", scope: !57, file: !57, line: 215, type: !964, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{!81, !68}
!966 = !{!962}
!967 = !DILocation(line: 0, scope: !963, inlinedAt: !968)
!968 = distinct !DILocation(line: 236, column: 7, scope: !969, inlinedAt: !960)
!969 = distinct !DILexicalBlock(scope: !940, file: !57, line: 236, column: 7)
!970 = !DILocation(line: 217, column: 10, scope: !963, inlinedAt: !968)
!971 = !DILocation(line: 236, column: 7, scope: !940, inlinedAt: !960)
!972 = !DILocalVariable(name: "len", arg: 2, scope: !973, file: !57, line: 167, type: !72)
!973 = distinct !DISubprogram(name: "mcel_ch", scope: !57, file: !57, line: 167, type: !974, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !976)
!974 = !DISubroutineType(types: !975)
!975 = !{!212, !216, !72}
!976 = !{!977, !972}
!977 = !DILocalVariable(name: "ch", arg: 1, scope: !973, file: !57, line: 167, type: !216)
!978 = !DILocation(line: 0, scope: !973, inlinedAt: !979)
!979 = distinct !DILocation(line: 237, column: 12, scope: !969, inlinedAt: !960)
!980 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !979)
!981 = !DILocation(line: 237, column: 5, scope: !969, inlinedAt: !960)
!982 = !DILocation(line: 93, column: 39, scope: !885, inlinedAt: !896)
!983 = !DILocation(line: 244, column: 3, scope: !940, inlinedAt: !960)
!984 = !DILocation(line: 244, column: 13, scope: !940, inlinedAt: !960)
!985 = !DILocation(line: 244, column: 30, scope: !940, inlinedAt: !960)
!986 = !{!987, !650, i64 0}
!987 = !{!"", !650, i64 0, !557, i64 4}
!988 = !DILocation(line: 267, column: 3, scope: !940, inlinedAt: !960)
!989 = !DILocation(line: 268, column: 38, scope: !940, inlinedAt: !960)
!990 = !DILocation(line: 268, column: 16, scope: !940, inlinedAt: !960)
!991 = !DILocation(line: 274, column: 7, scope: !992, inlinedAt: !960)
!992 = distinct !DILexicalBlock(scope: !940, file: !57, line: 274, column: 7)
!993 = !DILocation(line: 274, column: 7, scope: !940, inlinedAt: !960)
!994 = !{!"branch_weights", i32 1, i32 2000}
!995 = !DILocalVariable(name: "err", arg: 1, scope: !996, file: !57, line: 175, type: !77)
!996 = distinct !DISubprogram(name: "mcel_err", scope: !57, file: !57, line: 175, type: !997, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !999)
!997 = !DISubroutineType(types: !998)
!998 = !{!212, !77}
!999 = !{!995}
!1000 = !DILocation(line: 0, scope: !996, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 275, column: 12, scope: !992, inlinedAt: !960)
!1002 = !DILocation(line: 178, column: 3, scope: !996, inlinedAt: !1001)
!1003 = !DILocation(line: 275, column: 5, scope: !992, inlinedAt: !960)
!1004 = !DILocation(line: 279, column: 19, scope: !940, inlinedAt: !960)
!1005 = !DILocation(line: 0, scope: !973, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 279, column: 10, scope: !940, inlinedAt: !960)
!1007 = !DILocation(line: 169, column: 3, scope: !973, inlinedAt: !1006)
!1008 = !DILocation(line: 170, column: 3, scope: !973, inlinedAt: !1006)
!1009 = !DILocation(line: 171, column: 3, scope: !973, inlinedAt: !1006)
!1010 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !1006)
!1011 = !DILocation(line: 279, column: 3, scope: !940, inlinedAt: !960)
!1012 = !DILocation(line: 280, column: 1, scope: !940, inlinedAt: !960)
!1013 = !DILocation(line: 94, column: 9, scope: !1014, inlinedAt: !896)
!1014 = distinct !DILexicalBlock(scope: !885, file: !202, line: 94, column: 7)
!1015 = !DILocation(line: 94, column: 7, scope: !885, inlinedAt: !896)
!1016 = !DILocation(line: 92, column: 14, scope: !885, inlinedAt: !896)
!1017 = !DILocation(line: 95, column: 22, scope: !1014, inlinedAt: !896)
!1018 = !DILocation(line: 95, column: 5, scope: !1014, inlinedAt: !896)
!1019 = !DILocation(line: 99, column: 30, scope: !1020, inlinedAt: !896)
!1020 = distinct !DILexicalBlock(scope: !1014, file: !202, line: 97, column: 5)
!1021 = !DILocation(line: 99, column: 14, scope: !1020, inlinedAt: !896)
!1022 = !DILocation(line: 0, scope: !1014, inlinedAt: !896)
!1023 = !DILocation(line: 187, column: 15, scope: !188)
!1024 = !DILocation(line: 117, column: 7, scope: !1025, inlinedAt: !1040)
!1025 = distinct !DISubprogram(name: "adjust_column", scope: !3, file: !3, line: 115, type: !1026, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!72, !72, !212}
!1028 = !{!1029, !1030, !1031}
!1029 = !DILocalVariable(name: "column", arg: 1, scope: !1025, file: !3, line: 115, type: !72)
!1030 = !DILocalVariable(name: "g", arg: 2, scope: !1025, file: !3, line: 115, type: !212)
!1031 = !DILocalVariable(name: "width", scope: !1032, file: !3, line: 134, type: !70)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 133, column: 13)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 130, column: 15)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 129, column: 9)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 126, column: 16)
!1036 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 124, column: 16)
!1037 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 119, column: 11)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 118, column: 5)
!1039 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 117, column: 7)
!1040 = distinct !DILocation(line: 196, column: 16, scope: !227)
!1041 = !DILocation(line: 191, column: 11, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !3, line: 190, column: 9)
!1043 = distinct !DILexicalBlock(scope: !227, file: !3, line: 189, column: 11)
!1044 = !DILocation(line: 193, column: 11, scope: !1042)
!1045 = distinct !{!1045, !883, !1046, !616}
!1046 = !DILocation(line: 265, column: 5, scope: !188)
!1047 = !DILocation(line: 195, column: 5, scope: !227)
!1048 = !DILocation(line: 0, scope: !1025, inlinedAt: !1040)
!1049 = !DILocation(line: 117, column: 7, scope: !1039, inlinedAt: !1040)
!1050 = !DILocation(line: 117, column: 21, scope: !1039, inlinedAt: !1040)
!1051 = !DILocation(line: 119, column: 11, scope: !1038, inlinedAt: !1040)
!1052 = !DILocation(line: 121, column: 22, scope: !1053, inlinedAt: !1040)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !3, line: 121, column: 15)
!1054 = distinct !DILexicalBlock(scope: !1037, file: !3, line: 120, column: 9)
!1055 = !DILocation(line: 121, column: 15, scope: !1054, inlinedAt: !1040)
!1056 = !DILocation(line: 122, column: 23, scope: !1053, inlinedAt: !1040)
!1057 = !DILocation(line: 122, column: 20, scope: !1053, inlinedAt: !1040)
!1058 = !DILocation(line: 122, column: 13, scope: !1053, inlinedAt: !1040)
!1059 = !DILocation(line: 127, column: 29, scope: !1035, inlinedAt: !1040)
!1060 = !DILocation(line: 127, column: 16, scope: !1035, inlinedAt: !1040)
!1061 = !DILocation(line: 127, column: 9, scope: !1035, inlinedAt: !1040)
!1062 = !DILocation(line: 130, column: 29, scope: !1033, inlinedAt: !1040)
!1063 = !DILocation(line: 130, column: 15, scope: !1034, inlinedAt: !1040)
!1064 = !DILocalVariable(name: "wc", arg: 1, scope: !1065, file: !1066, line: 1004, type: !216)
!1065 = distinct !DISubprogram(name: "c32width", scope: !1066, file: !1066, line: 1004, type: !1067, scopeLine: 1005, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1069)
!1066 = !DIFile(filename: "./lib/uchar.h", directory: "/src")
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!70, !216}
!1069 = !{!1064}
!1070 = !DILocation(line: 0, scope: !1065, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 134, column: 27, scope: !1032, inlinedAt: !1040)
!1072 = !DILocation(line: 1010, column: 10, scope: !1065, inlinedAt: !1071)
!1073 = !DILocation(line: 0, scope: !1032, inlinedAt: !1040)
!1074 = !DILocation(line: 136, column: 44, scope: !1032, inlinedAt: !1040)
!1075 = !DILocation(line: 136, column: 38, scope: !1032, inlinedAt: !1040)
!1076 = !DILocation(line: 0, scope: !1033, inlinedAt: !1040)
!1077 = !DILocation(line: 138, column: 21, scope: !1034, inlinedAt: !1040)
!1078 = !DILocation(line: 138, column: 18, scope: !1034, inlinedAt: !1040)
!1079 = !DILocation(line: 142, column: 12, scope: !1039, inlinedAt: !1040)
!1080 = !DILocation(line: 198, column: 18, scope: !226)
!1081 = !DILocation(line: 198, column: 11, scope: !227)
!1082 = !DILocation(line: 203, column: 15, scope: !224)
!1083 = !DILocation(line: 203, column: 15, scope: !225)
!1084 = !DILocation(line: 0, scope: !223)
!1085 = !DILocation(line: 208, column: 45, scope: !223)
!1086 = !DILocation(line: 210, column: 41, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !232, file: !3, line: 210, column: 15)
!1088 = !DILocation(line: 210, column: 15, scope: !232)
!1089 = !DILocation(line: 220, column: 19, scope: !235)
!1090 = !DILocation(line: 220, column: 19, scope: !223)
!1091 = !DILocation(line: 0, scope: !940, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 212, column: 24, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 211, column: 17)
!1094 = !DILocation(line: 235, column: 12, scope: !940, inlinedAt: !1092)
!1095 = !DILocation(line: 0, scope: !963, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 236, column: 7, scope: !969, inlinedAt: !1092)
!1097 = !DILocation(line: 217, column: 10, scope: !963, inlinedAt: !1096)
!1098 = !DILocation(line: 236, column: 7, scope: !940, inlinedAt: !1092)
!1099 = !DILocation(line: 0, scope: !973, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 237, column: 12, scope: !969, inlinedAt: !1092)
!1101 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !1100)
!1102 = !DILocation(line: 213, column: 23, scope: !1093)
!1103 = !DILocation(line: 237, column: 5, scope: !969, inlinedAt: !1092)
!1104 = !DILocation(line: 244, column: 3, scope: !940, inlinedAt: !1092)
!1105 = !DILocation(line: 244, column: 13, scope: !940, inlinedAt: !1092)
!1106 = !DILocation(line: 244, column: 30, scope: !940, inlinedAt: !1092)
!1107 = !DILocation(line: 267, column: 3, scope: !940, inlinedAt: !1092)
!1108 = !DILocation(line: 268, column: 38, scope: !940, inlinedAt: !1092)
!1109 = !DILocation(line: 268, column: 16, scope: !940, inlinedAt: !1092)
!1110 = !DILocation(line: 274, column: 7, scope: !992, inlinedAt: !1092)
!1111 = !DILocation(line: 274, column: 7, scope: !940, inlinedAt: !1092)
!1112 = !DILocation(line: 279, column: 19, scope: !940, inlinedAt: !1092)
!1113 = !DILocation(line: 0, scope: !973, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 279, column: 10, scope: !940, inlinedAt: !1092)
!1115 = !DILocation(line: 169, column: 3, scope: !973, inlinedAt: !1114)
!1116 = !DILocation(line: 170, column: 3, scope: !973, inlinedAt: !1114)
!1117 = !DILocation(line: 171, column: 3, scope: !973, inlinedAt: !1114)
!1118 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !1114)
!1119 = !DILocation(line: 279, column: 3, scope: !940, inlinedAt: !1092)
!1120 = !DILocation(line: 280, column: 1, scope: !940, inlinedAt: !1092)
!1121 = !DILocation(line: 212, column: 24, scope: !1093)
!1122 = !DILocation(line: 0, scope: !232)
!1123 = !DILocalVariable(name: "wc", arg: 1, scope: !1124, file: !87, line: 178, type: !216)
!1124 = distinct !DISubprogram(name: "c32issep", scope: !87, file: !87, line: 178, type: !1125, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1127)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!81, !216}
!1127 = !{!1123}
!1128 = !DILocation(line: 0, scope: !1124, inlinedAt: !1129)
!1129 = distinct !DILocation(line: 213, column: 23, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 213, column: 23)
!1131 = !DILocalVariable(name: "wc", arg: 1, scope: !1132, file: !1066, line: 770, type: !1135)
!1132 = distinct !DISubprogram(name: "c32isblank", scope: !1066, file: !1066, line: 770, type: !1133, scopeLine: 771, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1137)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!70, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1136, line: 20, baseType: !6)
!1136 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1137 = !{!1131}
!1138 = !DILocation(line: 0, scope: !1132, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 181, column: 13, scope: !1124, inlinedAt: !1129)
!1140 = !DILocation(line: 776, column: 10, scope: !1132, inlinedAt: !1139)
!1141 = !DILocation(line: 181, column: 11, scope: !1124, inlinedAt: !1129)
!1142 = !DILocation(line: 210, column: 69, scope: !1087)
!1143 = !DILocation(line: 210, column: 66, scope: !1087)
!1144 = distinct !{!1144, !1088, !1145, !616}
!1145 = !DILocation(line: 218, column: 17, scope: !232)
!1146 = !DILocation(line: 222, column: 31, scope: !234)
!1147 = !DILocation(line: 224, column: 19, scope: !234)
!1148 = !DILocation(line: 227, column: 47, scope: !234)
!1149 = !DILocation(line: 228, column: 39, scope: !234)
!1150 = !DILocation(line: 0, scope: !920, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 227, column: 19, scope: !234)
!1152 = !DILocation(line: 36, column: 10, scope: !920, inlinedAt: !1151)
!1153 = !DILocation(line: 0, scope: !234)
!1154 = !DILocation(line: 232, column: 49, scope: !234)
!1155 = !DILocation(line: 233, column: 45, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !238, file: !3, line: 233, column: 19)
!1157 = !DILocation(line: 233, column: 19, scope: !238)
!1158 = !DILocation(line: 0, scope: !940, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 236, column: 28, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 235, column: 21)
!1161 = !DILocation(line: 235, column: 12, scope: !940, inlinedAt: !1159)
!1162 = !DILocation(line: 0, scope: !963, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 236, column: 7, scope: !969, inlinedAt: !1159)
!1164 = !DILocation(line: 217, column: 10, scope: !963, inlinedAt: !1163)
!1165 = !DILocation(line: 236, column: 7, scope: !940, inlinedAt: !1159)
!1166 = !DILocation(line: 0, scope: !973, inlinedAt: !1167)
!1167 = distinct !DILocation(line: 237, column: 12, scope: !969, inlinedAt: !1159)
!1168 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !1167)
!1169 = !DILocation(line: 237, column: 5, scope: !969, inlinedAt: !1159)
!1170 = !DILocation(line: 244, column: 3, scope: !940, inlinedAt: !1159)
!1171 = !DILocation(line: 244, column: 13, scope: !940, inlinedAt: !1159)
!1172 = !DILocation(line: 244, column: 30, scope: !940, inlinedAt: !1159)
!1173 = !DILocation(line: 267, column: 3, scope: !940, inlinedAt: !1159)
!1174 = !DILocation(line: 268, column: 38, scope: !940, inlinedAt: !1159)
!1175 = !DILocation(line: 268, column: 16, scope: !940, inlinedAt: !1159)
!1176 = !DILocation(line: 274, column: 7, scope: !992, inlinedAt: !1159)
!1177 = !DILocation(line: 274, column: 7, scope: !940, inlinedAt: !1159)
!1178 = !DILocation(line: 279, column: 19, scope: !940, inlinedAt: !1159)
!1179 = !DILocation(line: 0, scope: !973, inlinedAt: !1180)
!1180 = distinct !DILocation(line: 279, column: 10, scope: !940, inlinedAt: !1159)
!1181 = !DILocation(line: 169, column: 3, scope: !973, inlinedAt: !1180)
!1182 = !DILocation(line: 170, column: 3, scope: !973, inlinedAt: !1180)
!1183 = !DILocation(line: 171, column: 3, scope: !973, inlinedAt: !1180)
!1184 = !DILocation(line: 172, column: 3, scope: !973, inlinedAt: !1180)
!1185 = !DILocation(line: 279, column: 3, scope: !940, inlinedAt: !1159)
!1186 = !DILocation(line: 280, column: 1, scope: !940, inlinedAt: !1159)
!1187 = !DILocation(line: 0, scope: !238)
!1188 = !DILocation(line: 236, column: 28, scope: !1160)
!1189 = !DILocation(line: 0, scope: !1025, inlinedAt: !1190)
!1190 = distinct !DILocation(line: 237, column: 32, scope: !1160)
!1191 = !DILocation(line: 117, column: 7, scope: !1039, inlinedAt: !1190)
!1192 = !DILocation(line: 117, column: 21, scope: !1039, inlinedAt: !1190)
!1193 = !DILocation(line: 117, column: 7, scope: !1025, inlinedAt: !1190)
!1194 = !DILocation(line: 119, column: 11, scope: !1038, inlinedAt: !1190)
!1195 = !DILocation(line: 121, column: 22, scope: !1053, inlinedAt: !1190)
!1196 = !DILocation(line: 121, column: 15, scope: !1054, inlinedAt: !1190)
!1197 = !DILocation(line: 122, column: 23, scope: !1053, inlinedAt: !1190)
!1198 = !DILocation(line: 122, column: 20, scope: !1053, inlinedAt: !1190)
!1199 = !DILocation(line: 122, column: 13, scope: !1053, inlinedAt: !1190)
!1200 = !DILocation(line: 127, column: 29, scope: !1035, inlinedAt: !1190)
!1201 = !DILocation(line: 127, column: 16, scope: !1035, inlinedAt: !1190)
!1202 = !DILocation(line: 127, column: 9, scope: !1035, inlinedAt: !1190)
!1203 = !DILocation(line: 130, column: 29, scope: !1033, inlinedAt: !1190)
!1204 = !DILocation(line: 130, column: 15, scope: !1034, inlinedAt: !1190)
!1205 = !DILocation(line: 0, scope: !1065, inlinedAt: !1206)
!1206 = distinct !DILocation(line: 134, column: 27, scope: !1032, inlinedAt: !1190)
!1207 = !DILocation(line: 1010, column: 10, scope: !1065, inlinedAt: !1206)
!1208 = !DILocation(line: 0, scope: !1032, inlinedAt: !1190)
!1209 = !DILocation(line: 136, column: 44, scope: !1032, inlinedAt: !1190)
!1210 = !DILocation(line: 136, column: 38, scope: !1032, inlinedAt: !1190)
!1211 = !DILocation(line: 0, scope: !1033, inlinedAt: !1190)
!1212 = !DILocation(line: 138, column: 21, scope: !1034, inlinedAt: !1190)
!1213 = !DILocation(line: 138, column: 18, scope: !1034, inlinedAt: !1190)
!1214 = !DILocation(line: 142, column: 15, scope: !1039, inlinedAt: !1190)
!1215 = !DILocation(line: 142, column: 12, scope: !1039, inlinedAt: !1190)
!1216 = !DILocation(line: 234, column: 37, scope: !1156)
!1217 = !DILocation(line: 234, column: 34, scope: !1156)
!1218 = distinct !{!1218, !1157, !1219, !616}
!1219 = !DILocation(line: 238, column: 21, scope: !238)
!1220 = !DILocation(line: 243, column: 26, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !225, file: !3, line: 243, column: 15)
!1222 = !DILocation(line: 243, column: 15, scope: !225)
!1223 = !DILocalVariable(name: "g", arg: 2, scope: !1224, file: !202, line: 107, type: !212)
!1224 = distinct !DISubprogram(name: "mbbuf_char_offset", scope: !202, file: !202, line: 107, type: !1225, scopeLine: 108, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1227)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!67, !888, !212}
!1227 = !{!1228, !1223}
!1228 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !1224, file: !202, line: 107, type: !888)
!1229 = !DILocation(line: 0, scope: !1224, inlinedAt: !1230)
!1230 = distinct !DILocation(line: 245, column: 33, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 244, column: 13)
!1232 = !DILocation(line: 109, column: 21, scope: !1233, inlinedAt: !1230)
!1233 = distinct !DILexicalBlock(scope: !1224, file: !202, line: 109, column: 7)
!1234 = !DILocation(line: 109, column: 7, scope: !1224, inlinedAt: !1230)
!1235 = !DILocation(line: 111, column: 41, scope: !1224, inlinedAt: !1230)
!1236 = !DILocation(line: 111, column: 24, scope: !1224, inlinedAt: !1230)
!1237 = !DILocalVariable(name: "__dest", arg: 1, scope: !1238, file: !921, line: 26, type: !1241)
!1238 = distinct !DISubprogram(name: "memcpy", scope: !921, file: !921, line: 26, type: !1239, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1242)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!69, !1241, !766, !72}
!1241 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!1242 = !{!1237, !1243, !1244}
!1243 = !DILocalVariable(name: "__src", arg: 2, scope: !1238, file: !921, line: 26, type: !766)
!1244 = !DILocalVariable(name: "__len", arg: 3, scope: !1238, file: !921, line: 26, type: !72)
