; ModuleID = 'src/ginstall.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.selabel_handle*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }
%struct.selabel_handle = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 114, type: !326, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !112, globals: !190, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/install.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c5fd509f415938f62ab888c44cb4547a")
!4 = !{!5, !13, !20, !26, !32, !38, !43, !57, !80, !95, !103, !108}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "backup_type", file: !6, line: 38, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "no_backups", value: 0)
!10 = !DIEnumerator(name: "simple_backups", value: 1)
!11 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!12 = !DIEnumerator(name: "numbered_backups", value: 3)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !14, line: 86, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "src/copy.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4854856c8f3aacad20824070737d83b1")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!17 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!18 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!19 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !14, line: 77, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "I_UNSPECIFIED", value: 0)
!23 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!24 = !DIEnumerator(name: "I_ALWAYS_SKIP", value: 2)
!25 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !14, line: 27, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!29 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!30 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!31 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Update_type", file: !14, line: 61, baseType: !7, size: 32, elements: !33)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "UPDATE_ALL", value: 0)
!35 = !DIEnumerator(name: "UPDATE_OLDER", value: 1)
!36 = !DIEnumerator(name: "UPDATE_NONE", value: 2)
!37 = !DIEnumerator(name: "UPDATE_NONE_FAIL", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !14, line: 48, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42}
!40 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!41 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!42 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !44, line: 42, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!46 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!47 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!48 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!49 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!50 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!51 = !DIEnumerator(name: "c_quoting_style", value: 5)
!52 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!53 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!54 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!55 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!56 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !59, file: !58, line: 45, baseType: !7, size: 32, elements: !73)
!58 = !DIFile(filename: "./lib/savewd.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ad4dd1c19e06c974b5c544edb9d47f86")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !58, line: 42, size: 64, elements: !60)
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !59, file: !58, line: 73, baseType: !57, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !59, file: !58, line: 81, baseType: !63, size: 32, offset: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !59, file: !58, line: 76, size: 32, elements: !64)
!64 = !{!65, !67, !68}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !63, file: !58, line: 78, baseType: !66, size: 32)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !63, file: !58, line: 79, baseType: !66, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !63, file: !58, line: 80, baseType: !69, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !70, line: 97, baseType: !71)
!70 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !72, line: 154, baseType: !66)
!72 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!73 = !{!74, !75, !76, !77, !78, !79}
!74 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!75 = !DIEnumerator(name: "FD_STATE", value: 1)
!76 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!77 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!78 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!79 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 46, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!83 = !DIEnumerator(name: "_ISupper", value: 256)
!84 = !DIEnumerator(name: "_ISlower", value: 512)
!85 = !DIEnumerator(name: "_ISalpha", value: 1024)
!86 = !DIEnumerator(name: "_ISdigit", value: 2048)
!87 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!88 = !DIEnumerator(name: "_ISspace", value: 8192)
!89 = !DIEnumerator(name: "_ISprint", value: 16384)
!90 = !DIEnumerator(name: "_ISgraph", value: 32768)
!91 = !DIEnumerator(name: "_ISblank", value: 1)
!92 = !DIEnumerator(name: "_IScntrl", value: 2)
!93 = !DIEnumerator(name: "_ISpunct", value: 4)
!94 = !DIEnumerator(name: "_ISalnum", value: 8)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !96, line: 30, baseType: !7, size: 32, elements: !97)
!96 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!99 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!100 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!101 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!102 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!103 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_status", file: !3, line: 409, baseType: !7, size: 32, elements: !104)
!104 = !{!105, !106, !107}
!105 = !DIEnumerator(name: "COPY_FAILED", value: 0)
!106 = !DIEnumerator(name: "COPY_OK", value: 1)
!107 = !DIEnumerator(name: "COPY_SKIPPED", value: 2)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !109, line: 110, baseType: !7, size: 32, elements: !110)
!109 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!110 = !{!111}
!111 = !DIEnumerator(name: "O_PATHSEARCH", value: 2097152)
!112 = !{!113, !118, !120, !66, !121, !122, !125, !127, !128, !131, !132, !134, !136, !188}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !114, line: 72, baseType: !115)
!114 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{null, !66}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !123, line: 46, baseType: !124)
!123 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!124 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !130, line: 53, flags: DIFlagFwdDecl)
!130 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !70, line: 79, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !72, line: 146, baseType: !7)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !70, line: 64, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !72, line: 147, baseType: !7)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !14, line: 115, size: 768, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !187}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !137, file: !14, line: 117, baseType: !5, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !137, file: !14, line: 120, baseType: !13, size: 32, offset: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !137, file: !14, line: 125, baseType: !20, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !137, file: !14, line: 128, baseType: !26, size: 32, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !137, file: !14, line: 132, baseType: !144, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !70, line: 69, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !72, line: 150, baseType: !7)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !137, file: !14, line: 136, baseType: !131, size: 8, offset: 160)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !137, file: !14, line: 140, baseType: !131, size: 8, offset: 168)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !137, file: !14, line: 147, baseType: !131, size: 8, offset: 176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !137, file: !14, line: 151, baseType: !131, size: 8, offset: 184)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !137, file: !14, line: 155, baseType: !131, size: 8, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "no_copy", scope: !137, file: !14, line: 155, baseType: !131, size: 8, offset: 200)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "exchange", scope: !137, file: !14, line: 159, baseType: !131, size: 8, offset: 208)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !137, file: !14, line: 162, baseType: !131, size: 8, offset: 216)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !137, file: !14, line: 166, baseType: !131, size: 8, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !137, file: !14, line: 173, baseType: !131, size: 8, offset: 232)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !137, file: !14, line: 177, baseType: !131, size: 8, offset: 240)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !137, file: !14, line: 181, baseType: !131, size: 8, offset: 248)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !137, file: !14, line: 182, baseType: !131, size: 8, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !137, file: !14, line: 183, baseType: !131, size: 8, offset: 264)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !137, file: !14, line: 184, baseType: !131, size: 8, offset: 272)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !137, file: !14, line: 187, baseType: !128, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !137, file: !14, line: 199, baseType: !131, size: 8, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !137, file: !14, line: 203, baseType: !131, size: 8, offset: 392)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !137, file: !14, line: 209, baseType: !131, size: 8, offset: 400)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !137, file: !14, line: 213, baseType: !131, size: 8, offset: 408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !137, file: !14, line: 222, baseType: !131, size: 8, offset: 416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !137, file: !14, line: 226, baseType: !131, size: 8, offset: 424)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !137, file: !14, line: 235, baseType: !131, size: 8, offset: 432)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !137, file: !14, line: 244, baseType: !131, size: 8, offset: 440)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !137, file: !14, line: 248, baseType: !131, size: 8, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !137, file: !14, line: 252, baseType: !131, size: 8, offset: 456)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !137, file: !14, line: 256, baseType: !131, size: 8, offset: 464)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !137, file: !14, line: 259, baseType: !32, size: 32, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !137, file: !14, line: 262, baseType: !131, size: 8, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "keep_directory_symlink", scope: !137, file: !14, line: 265, baseType: !131, size: 8, offset: 520)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !137, file: !14, line: 268, baseType: !131, size: 8, offset: 528)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !137, file: !14, line: 271, baseType: !131, size: 8, offset: 536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !137, file: !14, line: 276, baseType: !131, size: 8, offset: 544)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !137, file: !14, line: 280, baseType: !131, size: 8, offset: 552)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !137, file: !14, line: 285, baseType: !66, size: 32, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !137, file: !14, line: 288, baseType: !38, size: 32, offset: 608)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !137, file: !14, line: 299, baseType: !183, size: 64, offset: 640)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !185, line: 56, baseType: !186)
!185 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !185, line: 54, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !137, file: !14, line: 302, baseType: !183, size: 64, offset: 704)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!190 = !{!191, !193, !195, !197, !199, !201, !285, !0, !287, !289, !291, !297, !299, !301, !303, !305, !307, !309, !324}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "owner_name", scope: !2, file: !3, line: 66, type: !118, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "group_name", scope: !2, file: !3, line: 73, type: !118, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "copy_only_if_needed", scope: !2, file: !3, line: 94, type: !131, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "strip_files", scope: !2, file: !3, line: 97, type: !131, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "dir_arg", scope: !2, file: !3, line: 100, type: !131, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !203, file: !109, line: 575, type: !66, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "oputs_", scope: !109, file: !109, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !206)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !125, !125}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !279, !280, !281, !283, !284}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !203, file: !109, line: 573, type: !125)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !203, file: !109, line: 573, type: !125)
!209 = !DILocalVariable(name: "term", scope: !210, file: !109, line: 585, type: !125)
!210 = distinct !DILexicalBlock(scope: !211, file: !109, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !203, file: !109, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !203, file: !109, line: 594, type: !131)
!213 = !DILocalVariable(name: "first_word", scope: !203, file: !109, line: 595, type: !125)
!214 = !DILocalVariable(name: "option_text", scope: !203, file: !109, line: 596, type: !125)
!215 = !DILocalVariable(name: "s", scope: !216, file: !109, line: 608, type: !125)
!216 = distinct !DILexicalBlock(scope: !217, file: !109, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !109, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !203, file: !109, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !109, line: 609, type: !122)
!220 = !DILocalVariable(name: "anchor_len", scope: !203, file: !109, line: 620, type: !122)
!221 = !DILocalVariable(name: "desc_text", scope: !203, file: !109, line: 625, type: !125)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !109, line: 644, type: !125)
!223 = distinct !DILexicalBlock(scope: !203, file: !109, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !109, line: 644, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !227, line: 7, baseType: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !229, line: 49, size: 1728, elements: !230)
!229 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !248, !249, !250, !253, !254, !256, !260, !263, !265, !268, !271, !272, !273, !274, !275}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !229, line: 51, baseType: !66, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !229, line: 54, baseType: !118, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !229, line: 55, baseType: !118, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !229, line: 56, baseType: !118, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !229, line: 57, baseType: !118, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !229, line: 58, baseType: !118, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !229, line: 59, baseType: !118, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !229, line: 60, baseType: !118, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !229, line: 61, baseType: !118, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !229, line: 64, baseType: !118, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !229, line: 65, baseType: !118, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !229, line: 66, baseType: !118, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !229, line: 68, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !229, line: 36, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !229, line: 70, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !229, line: 72, baseType: !66, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !229, line: 73, baseType: !66, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !229, line: 74, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 152, baseType: !252)
!252 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !229, line: 77, baseType: !121, size: 16, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !229, line: 78, baseType: !255, size: 8, offset: 1040)
!255 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !229, line: 79, baseType: !257, size: 8, offset: 1048)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !229, line: 81, baseType: !261, size: 64, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !229, line: 43, baseType: null)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !229, line: 89, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 153, baseType: !252)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !229, line: 91, baseType: !266, size: 64, offset: 1216)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !229, line: 37, flags: DIFlagFwdDecl)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !229, line: 92, baseType: !269, size: 64, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !229, line: 38, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !229, line: 93, baseType: !247, size: 64, offset: 1344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !229, line: 94, baseType: !120, size: 64, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !229, line: 95, baseType: !122, size: 64, offset: 1472)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !229, line: 96, baseType: !66, size: 32, offset: 1536)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !229, line: 98, baseType: !276, size: 160, offset: 1568)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 160, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 20)
!279 = !DILocalVariable(name: "__cnt", scope: !223, file: !109, line: 644, type: !122)
!280 = !DILocalVariable(name: "url_program", scope: !203, file: !109, line: 648, type: !125)
!281 = !DILocalVariable(name: "__ptr", scope: !282, file: !109, line: 686, type: !125)
!282 = distinct !DILexicalBlock(scope: !203, file: !109, line: 686, column: 3)
!283 = !DILocalVariable(name: "__stream", scope: !282, file: !109, line: 686, type: !225)
!284 = !DILocalVariable(name: "__cnt", scope: !282, file: !109, line: 686, type: !122)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !2, file: !3, line: 53, type: !66, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "strip_program", scope: !2, file: !3, line: 103, type: !125, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "use_default_selinux_context", scope: !2, file: !3, line: 54, type: !131, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "initialized", scope: !293, file: !3, line: 303, type: !131, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "get_labeling_handle", scope: !3, file: !3, line: 301, type: !294, scopeLine: 302, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !296)
!294 = !DISubroutineType(types: !295)
!295 = !{!128}
!296 = !{}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "hnd", scope: !293, file: !3, line: 304, type: !128, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "mode", scope: !2, file: !3, line: 82, type: !144, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "dir_mode_bits", scope: !2, file: !3, line: 91, type: !144, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "dir_mode", scope: !2, file: !3, line: 85, type: !144, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "owner_id", scope: !2, file: !3, line: 69, type: !132, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "group_id", scope: !2, file: !3, line: 76, type: !134, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "a_buff", scope: !311, file: !3, line: 143, type: !321, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "have_same_content", scope: !3, file: !3, line: 140, type: !312, scopeLine: 141, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!131, !66, !66}
!314 = !{!315, !316, !317}
!315 = !DILocalVariable(name: "a_fd", arg: 1, scope: !311, file: !3, line: 140, type: !66)
!316 = !DILocalVariable(name: "b_fd", arg: 2, scope: !311, file: !3, line: 140, type: !66)
!317 = !DILocalVariable(name: "size", scope: !311, file: !3, line: 146, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !319, line: 130, baseType: !320)
!319 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !123, line: 35, baseType: !252)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32768, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 4096)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "b_buff", scope: !311, file: !3, line: 144, type: !321, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 4864, elements: !336)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !329, line: 50, size: 256, elements: !330)
!329 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!330 = !{!331, !332, !333, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 52, baseType: !125, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !328, file: !329, line: 55, baseType: !66, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !329, line: 56, baseType: !334, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !328, file: !329, line: 57, baseType: !66, size: 32, offset: 192)
!336 = !{!337}
!337 = !DISubrange(count: 19)
!338 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!339 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!340 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !343, file: !344, line: 128, type: !125, isLocal: true, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !345, retainedTypes: !366, globals: !367, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!345 = !{!5, !13, !20, !26, !32, !38, !43, !346, !350, !357}
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 32, baseType: !7, size: 32, elements: !348)
!347 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!348 = !{!349}
!349 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !351, line: 37, baseType: !7, size: 32, elements: !352)
!351 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!352 = !{!353, !354, !355, !356}
!353 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!354 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!355 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!356 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !14, line: 305, baseType: !7, size: 32, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365}
!359 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!360 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!361 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!362 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!363 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!364 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!365 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!366 = !{!7, !120, !124, !127}
!367 = !{!368, !373, !341, !375, !377}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "mask", scope: !370, file: !344, line: 2890, type: !144, isLocal: true, isDefinition: true)
!370 = distinct !DISubprogram(name: "cached_umask", scope: !344, file: !344, line: 2888, type: !371, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !296)
!371 = !DISubroutineType(types: !372)
!372 = !{!144}
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "cached", scope: !370, file: !344, line: 2891, type: !131, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !343, file: !344, line: 129, type: !125, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "copy_debug", scope: !343, file: !344, line: 132, type: !379, isLocal: true, isDefinition: true)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !14, line: 317, size: 96, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !379, file: !14, line: 319, baseType: !357, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !379, file: !14, line: 320, baseType: !357, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !379, file: !14, line: 321, baseType: !357, size: 32, offset: 64)
!384 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !387, file: !388, line: 45, type: !183, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!389 = !{!120, !118, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !391, line: 102, baseType: !392)
!391 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !72, line: 73, baseType: !124)
!393 = !{!385}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !396, file: !397, line: 38, type: !406, isLocal: true, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, globals: !405, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!398 = !{!399, !402}
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 39, baseType: !7, size: 32, elements: !400)
!400 = !{!401}
!401 = !DIEnumerator(name: "x_suffix_len", value: 6)
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 44, baseType: !7, size: 32, elements: !403)
!403 = !{!404}
!404 = !DIEnumerator(name: "smallsize", value: 256)
!405 = !{!394}
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 72, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 9)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "Version", scope: !411, file: !412, line: 3, type: !125, isLocal: false, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !413, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!413 = !{!409}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !416, file: !417, line: 77, type: !125, isLocal: false, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !478, globals: !479, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!418 = !{!5, !419, !448, !454}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !417, line: 325, baseType: !7, size: 32, elements: !446)
!420 = distinct !DISubprogram(name: "backupfile_internal", scope: !417, file: !417, line: 312, type: !421, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!118, !66, !125, !5, !131}
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !439, !440, !441, !443, !444, !445}
!424 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !420, file: !417, line: 312, type: !66)
!425 = !DILocalVariable(name: "file", arg: 2, scope: !420, file: !417, line: 312, type: !125)
!426 = !DILocalVariable(name: "backup_type", arg: 3, scope: !420, file: !417, line: 313, type: !5)
!427 = !DILocalVariable(name: "rename", arg: 4, scope: !420, file: !417, line: 313, type: !131)
!428 = !DILocalVariable(name: "base_offset", scope: !420, file: !417, line: 315, type: !318)
!429 = !DILocalVariable(name: "filelen", scope: !420, file: !417, line: 316, type: !318)
!430 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !420, file: !417, line: 323, type: !318)
!431 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !420, file: !417, line: 324, type: !318)
!432 = !DILocalVariable(name: "ssize", scope: !420, file: !417, line: 329, type: !318)
!433 = !DILocalVariable(name: "s", scope: !420, file: !417, line: 330, type: !118)
!434 = !DILocalVariable(name: "dirp", scope: !420, file: !417, line: 334, type: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !437, line: 127, baseType: !438)
!437 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !437, line: 127, flags: DIFlagFwdDecl)
!439 = !DILocalVariable(name: "sdir", scope: !420, file: !417, line: 335, type: !66)
!440 = !DILocalVariable(name: "base_max", scope: !420, file: !417, line: 336, type: !318)
!441 = !DILocalVariable(name: "extended", scope: !442, file: !417, line: 339, type: !131)
!442 = distinct !DILexicalBlock(scope: !420, file: !417, line: 338, column: 5)
!443 = !DILocalVariable(name: "offset", scope: !442, file: !417, line: 375, type: !318)
!444 = !DILocalVariable(name: "flags", scope: !442, file: !417, line: 376, type: !7)
!445 = !DILocalVariable(name: "saved_errno", scope: !442, file: !417, line: 379, type: !66)
!446 = !{!447}
!447 = !DIEnumerator(name: "GUESS", value: 9)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !417, line: 171, baseType: !7, size: 32, elements: !449)
!449 = !{!450, !451, !452, !453}
!450 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!451 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!452 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!453 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !455, line: 24, baseType: !7, size: 32, elements: !456)
!455 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!457 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!458 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!459 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!460 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!461 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!462 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!463 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!464 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!465 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!466 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!467 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!468 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!469 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!470 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!471 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!472 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!473 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!474 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!475 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!476 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!477 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!478 = !{!120, !7, !131}
!479 = !{!414}
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "backup_types", scope: !482, file: !483, line: 53, type: !493, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !485, globals: !488, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!484 = !{!5}
!485 = !{!120, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!488 = !{!480, !489}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "backup_args", scope: !482, file: !483, line: 42, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 576, elements: !407)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 256, elements: !495)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!495 = !{!496}
!496 = !DISubrange(count: 8)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "file_name", scope: !499, file: !500, line: 36, type: !125, isLocal: true, isDefinition: true)
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !501, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!501 = !{!497}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "file_name", scope: !504, file: !505, line: 45, type: !125, isLocal: true, isDefinition: true)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!506 = !{!502, !507}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !504, file: !505, line: 55, type: !131, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !511, file: !512, line: 66, type: !547, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !513, globals: !514, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!513 = !{!120, !127}
!514 = !{!515, !541, !509, !543, !545}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "old_file_name", scope: !517, file: !512, line: 304, type: !125, isLocal: true, isDefinition: true)
!517 = distinct !DISubprogram(name: "verror_at_line", scope: !512, file: !512, line: 298, type: !518, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !511, retainedNodes: !534)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !66, !66, !125, !7, !125, !520}
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !521, line: 52, baseType: !522)
!521 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !523, line: 32, baseType: !524)
!523 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !525, baseType: !526)
!525 = !DIFile(filename: "lib/error.c", directory: "/src")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !527, size: 256, elements: !528)
!527 = !DINamespace(name: "std", scope: null)
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !526, file: !525, baseType: !120, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !526, file: !525, baseType: !120, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !526, file: !525, baseType: !120, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !526, file: !525, baseType: !66, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !526, file: !525, baseType: !66, size: 32, offset: 224)
!534 = !{!535, !536, !537, !538, !539, !540}
!535 = !DILocalVariable(name: "status", arg: 1, scope: !517, file: !512, line: 298, type: !66)
!536 = !DILocalVariable(name: "errnum", arg: 2, scope: !517, file: !512, line: 298, type: !66)
!537 = !DILocalVariable(name: "file_name", arg: 3, scope: !517, file: !512, line: 298, type: !125)
!538 = !DILocalVariable(name: "line_number", arg: 4, scope: !517, file: !512, line: 298, type: !7)
!539 = !DILocalVariable(name: "message", arg: 5, scope: !517, file: !512, line: 298, type: !125)
!540 = !DILocalVariable(name: "args", arg: 6, scope: !517, file: !512, line: 298, type: !520)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "old_line_number", scope: !517, file: !512, line: 305, type: !7, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "error_message_count", scope: !511, file: !512, line: 69, type: !7, isLocal: false, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !511, file: !512, line: 295, type: !66, isLocal: false, isDefinition: true)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "default_tuning", scope: !552, file: !553, line: 134, type: !557, isLocal: true, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !553, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !554, globals: !556, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!554 = !{!124, !120, !555, !122}
!555 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!556 = !{!550}
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !185, line: 52, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !185, line: 40, size: 160, elements: !560)
!560 = !{!561, !562, !563, !564, !565}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !559, file: !185, line: 45, baseType: !555, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !559, file: !185, line: 46, baseType: !555, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !559, file: !185, line: 47, baseType: !555, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !559, file: !185, line: 48, baseType: !555, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !559, file: !185, line: 49, baseType: !131, size: 8, offset: 128)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "program_name", scope: !568, file: !569, line: 31, type: !125, isLocal: false, isDefinition: true)
!568 = distinct !DICompileUnit(language: DW_LANG_C99, file: !569, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !570, globals: !571, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!570 = !{!118}
!571 = !{!566}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "utf07FF", scope: !574, file: !575, line: 46, type: !605, isLocal: true, isDefinition: true)
!574 = distinct !DISubprogram(name: "proper_name_lite", scope: !575, file: !575, line: 38, type: !576, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !578, retainedNodes: !580)
!575 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!576 = !DISubroutineType(types: !577)
!577 = !{!125, !125, !125}
!578 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !579, splitDebugInlining: false, nameTableKind: None)
!579 = !{!572}
!580 = !{!581, !582, !583, !584, !589}
!581 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !574, file: !575, line: 38, type: !125)
!582 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !574, file: !575, line: 38, type: !125)
!583 = !DILocalVariable(name: "translation", scope: !574, file: !575, line: 40, type: !125)
!584 = !DILocalVariable(name: "w", scope: !574, file: !575, line: 47, type: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !586, line: 37, baseType: !587)
!586 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !72, line: 57, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !72, line: 42, baseType: !7)
!589 = !DILocalVariable(name: "mbs", scope: !574, file: !575, line: 48, type: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !591, line: 6, baseType: !592)
!591 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !593, line: 21, baseType: !594)
!593 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 13, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !594, file: !593, line: 15, baseType: !66, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !594, file: !593, line: 20, baseType: !598, size: 32, offset: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !594, file: !593, line: 16, size: 32, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !598, file: !593, line: 18, baseType: !7, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !598, file: !593, line: 19, baseType: !602, size: 32)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 4)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 16, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 2)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !610, file: !611, line: 76, type: !677, isLocal: false, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !618, globals: !619, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!612 = !{!43, !613, !80}
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !44, line: 254, baseType: !7, size: 32, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!616 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!617 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!618 = !{!66, !121, !122}
!619 = !{!608, !620, !626, !636, !638, !643, !666, !673, !675}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !610, file: !611, line: 92, type: !622, isLocal: false, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 320, elements: !624)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!624 = !{!625}
!625 = !DISubrange(count: 10)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !610, file: !611, line: 1040, type: !628, isLocal: false, isDefinition: true)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !611, line: 56, size: 448, elements: !629)
!629 = !{!630, !631, !632, !634, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !628, file: !611, line: 59, baseType: !43, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !611, line: 62, baseType: !66, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !628, file: !611, line: 66, baseType: !633, size: 256, offset: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !495)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !628, file: !611, line: 69, baseType: !125, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !628, file: !611, line: 72, baseType: !125, size: 64, offset: 384)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !610, file: !611, line: 107, type: !628, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "slot0", scope: !610, file: !611, line: 831, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2048, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 256)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "quote", scope: !645, file: !611, line: 228, type: !664, isLocal: true, isDefinition: true)
!645 = distinct !DISubprogram(name: "gettext_quote", scope: !611, file: !611, line: 197, type: !646, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{!125, !125, !43}
!648 = !{!649, !650, !651, !652, !653}
!649 = !DILocalVariable(name: "msgid", arg: 1, scope: !645, file: !611, line: 197, type: !125)
!650 = !DILocalVariable(name: "s", arg: 2, scope: !645, file: !611, line: 197, type: !43)
!651 = !DILocalVariable(name: "translation", scope: !645, file: !611, line: 199, type: !125)
!652 = !DILocalVariable(name: "w", scope: !645, file: !611, line: 229, type: !585)
!653 = !DILocalVariable(name: "mbs", scope: !645, file: !611, line: 230, type: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !591, line: 6, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !593, line: 21, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 13, size: 64, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !656, file: !593, line: 15, baseType: !66, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !656, file: !593, line: 20, baseType: !660, size: 32, offset: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !656, file: !593, line: 16, size: 32, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !660, file: !593, line: 18, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !660, file: !593, line: 19, baseType: !602, size: 32)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !665)
!665 = !{!607, !604}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "slotvec", scope: !610, file: !611, line: 834, type: !668, isLocal: true, isDefinition: true)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !611, line: 823, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !611, line: 825, baseType: !122, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !669, file: !611, line: 826, baseType: !118, size: 64, offset: 64)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "nslots", scope: !610, file: !611, line: 832, type: !66, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "slotvec0", scope: !610, file: !611, line: 833, type: !669, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 704, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 11)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !682, file: !683, line: 88, type: !687, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !685, globals: !686, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/savedir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02eab3775a03291323b0c9a53bf5293b")
!684 = !{!350}
!685 = !{!120}
!686 = !{!680}
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 192, elements: !693)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !683, line: 86, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!66, !486, !486, !120}
!693 = !{!694}
!694 = !DISubrange(count: 3)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "tryfunc", scope: !697, file: !698, line: 175, type: !714, isLocal: true, isDefinition: true)
!697 = distinct !DISubprogram(name: "gen_tempname_len", scope: !698, file: !698, line: 172, type: !699, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !701, retainedNodes: !708)
!698 = !DIFile(filename: "lib/tempname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "89467f8095ceec51ae791cc96ec80d48")
!699 = !DISubroutineType(types: !700)
!700 = !{!66, !118, !66, !66, !66, !122}
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !702, splitDebugInlining: false, nameTableKind: None)
!702 = !{!695, !703}
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "letters", scope: !701, file: !698, line: 151, type: !705, isLocal: true, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 504, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 63)
!708 = !{!709, !710, !711, !712, !713}
!709 = !DILocalVariable(name: "tmpl", arg: 1, scope: !697, file: !698, line: 172, type: !118)
!710 = !DILocalVariable(name: "suffixlen", arg: 2, scope: !697, file: !698, line: 172, type: !66)
!711 = !DILocalVariable(name: "flags", arg: 3, scope: !697, file: !698, line: 172, type: !66)
!712 = !DILocalVariable(name: "kind", arg: 4, scope: !697, file: !698, line: 172, type: !66)
!713 = !DILocalVariable(name: "x_suffix_len", arg: 5, scope: !697, file: !698, line: 173, type: !122)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 192, elements: !693)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!66, !118, !120}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "ht", scope: !721, file: !722, line: 171, type: !183, isLocal: true, isDefinition: true)
!721 = distinct !DISubprogram(name: "utimecmpat", scope: !722, file: !722, line: 129, type: !723, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !759, retainedNodes: !774)
!722 = !DIFile(filename: "lib/utimecmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b33c342642dbf94e8e18e40dfff270d9")
!723 = !DISubroutineType(types: !724)
!724 = !{!66, !66, !125, !725, !725, !66}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !728, line: 44, size: 1024, elements: !729)
!728 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!729 = !{!730, !732, !734, !735, !737, !738, !739, !740, !741, !742, !744, !745, !747, !755, !756, !757}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !727, file: !728, line: 46, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !72, line: 145, baseType: !124)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !727, file: !728, line: 47, baseType: !733, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !72, line: 148, baseType: !124)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !727, file: !728, line: 48, baseType: !145, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !727, file: !728, line: 49, baseType: !736, size: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !72, line: 151, baseType: !7)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !727, file: !728, line: 50, baseType: !133, size: 32, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !727, file: !728, line: 51, baseType: !135, size: 32, offset: 224)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !727, file: !728, line: 52, baseType: !731, size: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !727, file: !728, line: 53, baseType: !731, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !727, file: !728, line: 54, baseType: !251, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !727, file: !728, line: 55, baseType: !743, size: 32, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !72, line: 175, baseType: !66)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !727, file: !728, line: 56, baseType: !66, size: 32, offset: 480)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !727, file: !728, line: 57, baseType: !746, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !72, line: 180, baseType: !252)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !727, file: !728, line: 65, baseType: !748, size: 128, offset: 576)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !749, line: 11, size: 128, elements: !750)
!749 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!750 = !{!751, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !748, file: !749, line: 16, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !72, line: 160, baseType: !252)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !748, file: !749, line: 21, baseType: !754, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !72, line: 197, baseType: !252)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !727, file: !728, line: 66, baseType: !748, size: 128, offset: 704)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !727, file: !728, line: 67, baseType: !748, size: 128, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !727, file: !728, line: 79, baseType: !758, size: 64, offset: 960)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !606)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !760, globals: !764, splitDebugInlining: false, nameTableKind: None)
!760 = !{!346, !761}
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !722, line: 47, baseType: !7, size: 32, elements: !762)
!762 = !{!763}
!763 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!764 = !{!719, !765}
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !721, file: !722, line: 174, type: !767, isLocal: true, isDefinition: true)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !722, line: 63, size: 128, elements: !769)
!769 = !{!770, !772, !773}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !768, file: !722, line: 66, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !70, line: 59, baseType: !731)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !768, file: !722, line: 73, baseType: !66, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !768, file: !722, line: 77, baseType: !131, size: 8, offset: 96)
!774 = !{!775, !776, !777, !778, !779, !780, !783, !784, !785, !786, !789, !790, !791, !794, !795, !796, !797, !798, !799, !801, !804, !805, !806, !807, !811, !813, !814, !816, !818, !819}
!775 = !DILocalVariable(name: "dfd", arg: 1, scope: !721, file: !722, line: 129, type: !66)
!776 = !DILocalVariable(name: "dst_name", arg: 2, scope: !721, file: !722, line: 129, type: !125)
!777 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !721, file: !722, line: 130, type: !725)
!778 = !DILocalVariable(name: "src_stat", arg: 4, scope: !721, file: !722, line: 131, type: !725)
!779 = !DILocalVariable(name: "options", arg: 5, scope: !721, file: !722, line: 132, type: !66)
!780 = !DILocalVariable(name: "dst_s", scope: !721, file: !722, line: 150, type: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !782, line: 10, baseType: !752)
!782 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!783 = !DILocalVariable(name: "src_s", scope: !721, file: !722, line: 151, type: !781)
!784 = !DILocalVariable(name: "dst_ns", scope: !721, file: !722, line: 152, type: !66)
!785 = !DILocalVariable(name: "src_ns", scope: !721, file: !722, line: 153, type: !66)
!786 = !DILocalVariable(name: "dst_res", scope: !787, file: !722, line: 175, type: !767)
!787 = distinct !DILexicalBlock(scope: !788, file: !722, line: 156, column: 5)
!788 = distinct !DILexicalBlock(scope: !721, file: !722, line: 155, column: 7)
!789 = !DILocalVariable(name: "res", scope: !787, file: !722, line: 178, type: !66)
!790 = !DILocalVariable(name: "tmp_dst_res", scope: !787, file: !722, line: 192, type: !768)
!791 = !DILocalVariable(name: "dst_a_s", scope: !792, file: !722, line: 270, type: !781)
!792 = distinct !DILexicalBlock(scope: !793, file: !722, line: 266, column: 9)
!793 = distinct !DILexicalBlock(scope: !787, file: !722, line: 265, column: 11)
!794 = !DILocalVariable(name: "dst_c_s", scope: !792, file: !722, line: 271, type: !781)
!795 = !DILocalVariable(name: "dst_m_s", scope: !792, file: !722, line: 272, type: !781)
!796 = !DILocalVariable(name: "dst_a_ns", scope: !792, file: !722, line: 273, type: !66)
!797 = !DILocalVariable(name: "dst_c_ns", scope: !792, file: !722, line: 274, type: !66)
!798 = !DILocalVariable(name: "dst_m_ns", scope: !792, file: !722, line: 275, type: !66)
!799 = !DILocalVariable(name: "odd_second", scope: !800, file: !722, line: 284, type: !131)
!800 = distinct !DILexicalBlock(scope: !792, file: !722, line: 283, column: 11)
!801 = !DILocalVariable(name: "a", scope: !802, file: !722, line: 293, type: !66)
!802 = distinct !DILexicalBlock(scope: !803, file: !722, line: 292, column: 15)
!803 = distinct !DILexicalBlock(scope: !800, file: !722, line: 286, column: 17)
!804 = !DILocalVariable(name: "c", scope: !802, file: !722, line: 294, type: !66)
!805 = !DILocalVariable(name: "m", scope: !802, file: !722, line: 295, type: !66)
!806 = !DILocalVariable(name: "SR10", scope: !802, file: !722, line: 299, type: !66)
!807 = !DILocalVariable(name: "s", scope: !808, file: !722, line: 329, type: !781)
!808 = distinct !DILexicalBlock(scope: !809, file: !722, line: 328, column: 15)
!809 = distinct !DILexicalBlock(scope: !810, file: !722, line: 320, column: 13)
!810 = distinct !DILexicalBlock(scope: !792, file: !722, line: 319, column: 15)
!811 = !DILocalVariable(name: "timespec", scope: !809, file: !722, line: 343, type: !812)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 256, elements: !606)
!813 = !DILocalVariable(name: "dst_status", scope: !809, file: !722, line: 353, type: !727)
!814 = !DILocalVariable(name: "stat_result", scope: !815, file: !722, line: 357, type: !66)
!815 = distinct !DILexicalBlock(scope: !809, file: !722, line: 356, column: 15)
!816 = !DILocalVariable(name: "old_res", scope: !817, file: !722, line: 378, type: !66)
!817 = distinct !DILexicalBlock(scope: !809, file: !722, line: 377, column: 15)
!818 = !DILocalVariable(name: "a", scope: !817, file: !722, line: 379, type: !66)
!819 = !DILabel(scope: !820, name: "low_memory", file: !722, line: 219)
!820 = distinct !DILexicalBlock(scope: !821, file: !722, line: 218, column: 9)
!821 = distinct !DILexicalBlock(scope: !787, file: !722, line: 195, column: 11)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !824, file: !825, line: 26, type: !827, isLocal: false, isDefinition: true)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !826, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!826 = !{!822}
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 376, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 47)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!831 = distinct !DIGlobalVariable(name: "initialized", scope: !832, file: !833, line: 41, type: !131, isLocal: true, isDefinition: true)
!832 = distinct !DISubprogram(name: "can_write_any_file", scope: !833, file: !833, line: 39, type: !834, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !836, retainedNodes: !841)
!833 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!834 = !DISubroutineType(types: !835)
!835 = !{!131}
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !833, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !837, splitDebugInlining: false, nameTableKind: None)
!837 = !{!838, !839}
!838 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "can_write", scope: !832, file: !833, line: 42, type: !131, isLocal: true, isDefinition: true)
!841 = !{!842}
!842 = !DILocalVariable(name: "can", scope: !843, file: !833, line: 46, type: !131)
!843 = distinct !DILexicalBlock(scope: !844, file: !833, line: 45, column: 5)
!844 = distinct !DILexicalBlock(scope: !832, file: !833, line: 44, column: 7)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "exit_failure", scope: !847, file: !848, line: 24, type: !850, isLocal: false, isDefinition: true)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !849, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!849 = !{!845}
!850 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !853, file: !854, line: 65, type: !858, isLocal: false, isDefinition: true)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !855, retainedTypes: !856, globals: !857, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!855 = !{!43}
!856 = !{!120, !125, !127}
!857 = !{!851}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !859, line: 69, baseType: !547)
!859 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "internal_state", scope: !862, file: !863, line: 97, type: !866, isLocal: true, isDefinition: true)
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !864, globals: !865, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!864 = !{!120, !122, !127}
!865 = !{!860}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !591, line: 6, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !593, line: 21, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 13, size: 64, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !868, file: !593, line: 15, baseType: !66, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !868, file: !593, line: 20, baseType: !872, size: 32, offset: 32)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !868, file: !593, line: 16, size: 32, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !872, file: !593, line: 18, baseType: !7, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !872, file: !593, line: 19, baseType: !602, size: 32)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !878, file: !879, line: 506, type: !66, isLocal: true, isDefinition: true)
!878 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !879, file: !879, line: 485, type: !880, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !882, retainedNodes: !884)
!879 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!880 = !DISubroutineType(types: !881)
!881 = !{!66, !66, !66}
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !883, splitDebugInlining: false, nameTableKind: None)
!883 = !{!876}
!884 = !{!885, !886, !887, !888, !891}
!885 = !DILocalVariable(name: "fd", arg: 1, scope: !878, file: !879, line: 485, type: !66)
!886 = !DILocalVariable(name: "target", arg: 2, scope: !878, file: !879, line: 485, type: !66)
!887 = !DILocalVariable(name: "result", scope: !878, file: !879, line: 487, type: !66)
!888 = !DILocalVariable(name: "flags", scope: !889, file: !879, line: 530, type: !66)
!889 = distinct !DILexicalBlock(scope: !890, file: !879, line: 529, column: 5)
!890 = distinct !DILexicalBlock(scope: !878, file: !879, line: 528, column: 7)
!891 = !DILocalVariable(name: "saved_errno", scope: !892, file: !879, line: 533, type: !66)
!892 = distinct !DILexicalBlock(scope: !893, file: !879, line: 532, column: 9)
!893 = distinct !DILexicalBlock(scope: !889, file: !879, line: 531, column: 11)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !896, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!896 = !{!127}
!897 = distinct !DICompileUnit(language: DW_LANG_C99, file: !898, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !899, retainedTypes: !923, splitDebugInlining: false, nameTableKind: None)
!898 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!899 = !{!5, !13, !20, !26, !32, !38, !357, !900, !43, !906, !915, !919}
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "scantype", file: !898, line: 459, baseType: !7, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIEnumerator(name: "ERROR_SCANTYPE", value: 0)
!903 = !DIEnumerator(name: "PLAIN_SCANTYPE", value: 1)
!904 = !DIEnumerator(name: "ZERO_SCANTYPE", value: 2)
!905 = !DIEnumerator(name: "LSEEK_SCANTYPE", value: 3)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !907, line: 44, baseType: !7, size: 32, elements: !908)
!907 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!908 = !{!909, !910, !911, !912, !913, !914}
!909 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!910 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!911 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!912 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!913 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!914 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !916, line: 79, baseType: !7, size: 32, elements: !917)
!916 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!917 = !{!918}
!918 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !920, line: 36, baseType: !7, size: 32, elements: !921)
!920 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!921 = !{!922}
!922 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!923 = !{!131, !122, !924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !70, line: 85, baseType: !251)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !933, retainedTypes: !685, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aaac2d7e2e4691c3c7dfceec011d70d1")
!933 = !{!934}
!934 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !935, file: !932, line: 60, baseType: !7, size: 32, elements: !962)
!935 = distinct !DISubprogram(name: "areadlink_with_size", scope: !932, file: !932, line: 49, type: !936, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !931, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{!118, !125, !122}
!938 = !{!939, !940, !941, !942, !943, !944, !945, !950, !951, !952, !955, !956}
!939 = !DILocalVariable(name: "file", arg: 1, scope: !935, file: !932, line: 49, type: !125)
!940 = !DILocalVariable(name: "size", arg: 2, scope: !935, file: !932, line: 49, type: !122)
!941 = !DILocalVariable(name: "symlink_max", scope: !935, file: !932, line: 54, type: !122)
!942 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !935, file: !932, line: 55, type: !122)
!943 = !DILocalVariable(name: "initial_limit", scope: !935, file: !932, line: 56, type: !122)
!944 = !DILocalVariable(name: "buf_size", scope: !935, file: !932, line: 63, type: !122)
!945 = !DILocalVariable(name: "stackbuf", scope: !946, file: !932, line: 68, type: !947)
!946 = distinct !DILexicalBlock(scope: !935, file: !932, line: 67, column: 5)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 1024, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 128)
!950 = !DILocalVariable(name: "buf", scope: !946, file: !932, line: 69, type: !118)
!951 = !DILocalVariable(name: "buffer", scope: !946, file: !932, line: 70, type: !118)
!952 = !DILocalVariable(name: "r", scope: !946, file: !932, line: 82, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !70, line: 108, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !72, line: 194, baseType: !252)
!955 = !DILocalVariable(name: "link_length", scope: !946, file: !932, line: 89, type: !122)
!956 = !DILocalVariable(name: "shrinked_buffer", scope: !957, file: !932, line: 102, type: !118)
!957 = distinct !DILexicalBlock(scope: !958, file: !932, line: 100, column: 13)
!958 = distinct !DILexicalBlock(scope: !959, file: !932, line: 99, column: 20)
!959 = distinct !DILexicalBlock(scope: !960, file: !932, line: 93, column: 15)
!960 = distinct !DILexicalBlock(scope: !961, file: !932, line: 91, column: 9)
!961 = distinct !DILexicalBlock(scope: !946, file: !932, line: 90, column: 11)
!962 = !{!963}
!963 = !DIEnumerator(name: "stackbuf_size", value: 128)
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !966, retainedTypes: !685, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "lib/areadlinkat-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "326d53ebd4d51818fba309db538ba252")
!966 = !{!967}
!967 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !968, file: !965, line: 65, baseType: !7, size: 32, elements: !962)
!968 = distinct !DISubprogram(name: "areadlinkat_with_size", scope: !965, file: !965, line: 54, type: !969, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !964, retainedNodes: !971)
!969 = !DISubroutineType(types: !970)
!970 = !{!118, !66, !125, !122}
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !981, !982, !983, !984, !985}
!972 = !DILocalVariable(name: "fd", arg: 1, scope: !968, file: !965, line: 54, type: !66)
!973 = !DILocalVariable(name: "file", arg: 2, scope: !968, file: !965, line: 54, type: !125)
!974 = !DILocalVariable(name: "size", arg: 3, scope: !968, file: !965, line: 54, type: !122)
!975 = !DILocalVariable(name: "symlink_max", scope: !968, file: !965, line: 59, type: !122)
!976 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !968, file: !965, line: 60, type: !122)
!977 = !DILocalVariable(name: "initial_limit", scope: !968, file: !965, line: 61, type: !122)
!978 = !DILocalVariable(name: "buf_size", scope: !968, file: !965, line: 68, type: !122)
!979 = !DILocalVariable(name: "stackbuf", scope: !980, file: !965, line: 73, type: !947)
!980 = distinct !DILexicalBlock(scope: !968, file: !965, line: 72, column: 5)
!981 = !DILocalVariable(name: "buf", scope: !980, file: !965, line: 74, type: !118)
!982 = !DILocalVariable(name: "buffer", scope: !980, file: !965, line: 75, type: !118)
!983 = !DILocalVariable(name: "r", scope: !980, file: !965, line: 86, type: !953)
!984 = !DILocalVariable(name: "link_length", scope: !980, file: !965, line: 93, type: !122)
!985 = !DILocalVariable(name: "shrinked_buffer", scope: !986, file: !965, line: 106, type: !118)
!986 = distinct !DILexicalBlock(scope: !987, file: !965, line: 104, column: 13)
!987 = distinct !DILexicalBlock(scope: !988, file: !965, line: 103, column: 20)
!988 = distinct !DILexicalBlock(scope: !989, file: !965, line: 97, column: 15)
!989 = distinct !DILexicalBlock(scope: !990, file: !965, line: 95, column: 9)
!990 = distinct !DILexicalBlock(scope: !980, file: !965, line: 94, column: 11)
!991 = distinct !DICompileUnit(language: DW_LANG_C99, file: !992, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, splitDebugInlining: false, nameTableKind: None)
!992 = !DIFile(filename: "lib/backup-rename.c", directory: "/src", checksumkind: CSK_MD5, checksum: "88cb9da5a68506185c7e375c65552513")
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !570, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!996 = !DIFile(filename: "lib/buffer-lcm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "204b1d663c06054dea2138b65ef12013")
!997 = distinct !DICompileUnit(language: DW_LANG_C99, file: !998, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !999, splitDebugInlining: false, nameTableKind: None)
!998 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!999 = !{!919}
!1000 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1001, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1001 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1006, splitDebugInlining: false, nameTableKind: None)
!1005 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1006 = !{!906}
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "lib/fdutimensat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7ed4a56b581c8ad87a015a222c14deba")
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !685, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
