; ModuleID = 'src/hostid.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [89 x i8] c"Usage: %s [OPTION]\0APrint the numeric identifier (in hexadecimal) for the current host.\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [7 x i8] c"hostid\00", align 1
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !30, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !37)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !28, globals: !36, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/hostid.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7f0e5f3aa5d6f632ed5741d47ec6b339")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !{!6, !29, !30, !31, !32, !35}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 46, baseType: !34)
!33 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!34 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!0}
!37 = !{!38, !39, !40, !43, !45, !46, !47, !51, !52, !53, !54, !56, !113, !114, !115, !117, !118}
!38 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!39 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!40 = !DILocalVariable(name: "term", scope: !41, file: !3, line: 585, type: !6)
!41 = distinct !DILexicalBlock(scope: !42, file: !3, line: 582, column: 5)
!42 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!43 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !44)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!46 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!47 = !DILocalVariable(name: "s", scope: !48, file: !3, line: 608, type: !6)
!48 = distinct !DILexicalBlock(scope: !49, file: !3, line: 605, column: 5)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 604, column: 12)
!50 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!51 = !DILocalVariable(name: "spaces", scope: !48, file: !3, line: 609, type: !32)
!52 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !32)
!53 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!54 = !DILocalVariable(name: "__ptr", scope: !55, file: !3, line: 644, type: !6)
!55 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!56 = !DILocalVariable(name: "__stream", scope: !55, file: !3, line: 644, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !60)
!59 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!62 = !{!63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !88, !90, !94, !97, !99, !102, !105, !106, !107, !108, !109}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !30, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !80, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocalVariable(name: "__cnt", scope: !55, file: !3, line: 644, type: !32)
!114 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!115 = !DILocalVariable(name: "__ptr", scope: !116, file: !3, line: 686, type: !6)
!116 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!117 = !DILocalVariable(name: "__stream", scope: !116, file: !3, line: 686, type: !57)
!118 = !DILocalVariable(name: "__cnt", scope: !116, file: !3, line: 686, type: !32)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Version", scope: !121, file: !122, line: 3, type: !6, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !123, splitDebugInlining: false, nameTableKind: None)
!122 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!123 = !{!119}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "file_name", scope: !126, file: !127, line: 45, type: !6, isLocal: true, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !128, splitDebugInlining: false, nameTableKind: None)
!127 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!128 = !{!124, !129}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !126, file: !127, line: 55, type: !44, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !133, file: !134, line: 66, type: !169, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !135, globals: !136, splitDebugInlining: false, nameTableKind: None)
!134 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!135 = !{!29, !35}
!136 = !{!137, !163, !131, !165, !167}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "old_file_name", scope: !139, file: !134, line: 304, type: !6, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "verror_at_line", scope: !134, file: !134, line: 298, type: !140, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !156)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !30, !30, !6, !14, !6, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !147, baseType: !148)
!147 = !DIFile(filename: "lib/error.c", directory: "/src")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !150)
!149 = !DINamespace(name: "std", scope: null)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !148, file: !147, baseType: !29, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 224)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DILocalVariable(name: "status", arg: 1, scope: !139, file: !134, line: 298, type: !30)
!158 = !DILocalVariable(name: "errnum", arg: 2, scope: !139, file: !134, line: 298, type: !30)
!159 = !DILocalVariable(name: "file_name", arg: 3, scope: !139, file: !134, line: 298, type: !6)
!160 = !DILocalVariable(name: "line_number", arg: 4, scope: !139, file: !134, line: 298, type: !14)
!161 = !DILocalVariable(name: "message", arg: 5, scope: !139, file: !134, line: 298, type: !6)
!162 = !DILocalVariable(name: "args", arg: 6, scope: !139, file: !134, line: 298, type: !142)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "old_line_number", scope: !139, file: !134, line: 305, type: !14, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "error_message_count", scope: !133, file: !134, line: 69, type: !14, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !133, file: !134, line: 295, type: !30, isLocal: false, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "long_options", scope: !174, file: !175, line: 34, type: !177, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!176 = !{!172}
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !187)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !180, line: 50, size: 256, elements: !181)
!180 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 52, baseType: !6, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !179, file: !180, line: 55, baseType: !30, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !180, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !180, line: 57, baseType: !30, size: 32, offset: 192)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "program_name", scope: !191, file: !192, line: 31, type: !6, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !193, globals: !194, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!193 = !{!65}
!194 = !{!189}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "utf07FF", scope: !197, file: !198, line: 46, type: !228, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "proper_name_lite", scope: !198, file: !198, line: 38, type: !199, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !203)
!198 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!199 = !DISubroutineType(types: !200)
!200 = !{!6, !6, !6}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !202, splitDebugInlining: false, nameTableKind: None)
!202 = !{!195}
!203 = !{!204, !205, !206, !207, !212}
!204 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !197, file: !198, line: 38, type: !6)
!205 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !197, file: !198, line: 38, type: !6)
!206 = !DILocalVariable(name: "translation", scope: !197, file: !198, line: 40, type: !6)
!207 = !DILocalVariable(name: "w", scope: !197, file: !198, line: 47, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !209, line: 37, baseType: !210)
!209 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !85, line: 57, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 42, baseType: !14)
!212 = !DILocalVariable(name: "mbs", scope: !197, file: !198, line: 48, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !217, file: !216, line: 15, baseType: !30, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !217, file: !216, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !216, line: 16, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !216, line: 18, baseType: !14, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !216, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 4)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !233, file: !234, line: 76, type: !316, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !255, globals: !256, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!235 = !{!236, !250, !12}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !237, line: 42, baseType: !14, size: 32, elements: !238)
!237 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!239 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!240 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!241 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!242 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!243 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!244 = !DIEnumerator(name: "c_quoting_style", value: 5)
!245 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!246 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!247 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!248 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!249 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !237, line: 254, baseType: !14, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!30, !31, !32}
!256 = !{!231, !257, !263, !275, !277, !282, !305, !312, !314}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !233, file: !234, line: 92, type: !259, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !233, file: !234, line: 1040, type: !265, isLocal: false, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !234, line: 56, size: 448, elements: !266)
!266 = !{!267, !268, !269, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !265, file: !234, line: 59, baseType: !236, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !234, line: 62, baseType: !30, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !265, file: !234, line: 66, baseType: !270, size: 256, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !265, file: !234, line: 69, baseType: !6, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !265, file: !234, line: 72, baseType: !6, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !233, file: !234, line: 107, type: !265, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !233, file: !234, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !234, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !234, file: !234, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!6, !6, !236}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !234, line: 197, type: !6)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !234, line: 197, type: !236)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !234, line: 199, type: !6)
!291 = !DILocalVariable(name: "w", scope: !284, file: !234, line: 229, type: !208)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !234, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !216, line: 15, baseType: !30, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !216, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !216, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !216, line: 18, baseType: !14, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !216, line: 19, baseType: !225, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !304)
!304 = !{!230, !227}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !233, file: !234, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !234, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !234, line: 825, baseType: !32, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !234, line: 826, baseType: !65, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !233, file: !234, line: 832, type: !30, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !233, file: !234, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !323, line: 26, type: !325, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!324 = !{!320}
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "exit_failure", scope: !330, file: !331, line: 24, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!332 = !{!328}
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "internal_state", scope: !336, file: !337, line: 97, type: !340, isLocal: true, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !339, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!338 = !{!29, !32, !35}
!339 = !{!334}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !216, line: 15, baseType: !30, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !216, line: 20, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !216, line: 16, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !216, line: 18, baseType: !14, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !216, line: 19, baseType: !225, size: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !354, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !353, line: 40, baseType: !14, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!358 = !{!29}
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !361, retainedTypes: !392, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!361 = !{!362, !374}
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !363, file: !360, line: 188, baseType: !14, size: 32, elements: !372)
!363 = distinct !DISubprogram(name: "x2nrealloc", scope: !360, file: !360, line: 176, type: !364, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !367)
!364 = !DISubroutineType(types: !365)
!365 = !{!29, !29, !366, !32}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!367 = !{!368, !369, !370, !371}
!368 = !DILocalVariable(name: "p", arg: 1, scope: !363, file: !360, line: 176, type: !29)
!369 = !DILocalVariable(name: "pn", arg: 2, scope: !363, file: !360, line: 176, type: !366)
!370 = !DILocalVariable(name: "s", arg: 3, scope: !363, file: !360, line: 176, type: !32)
!371 = !DILocalVariable(name: "n", scope: !363, file: !360, line: 178, type: !32)
!372 = !{!373}
!373 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !375, file: !360, line: 228, baseType: !14, size: 32, elements: !372)
!375 = distinct !DISubprogram(name: "xpalloc", scope: !360, file: !360, line: 223, type: !376, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !382)
!376 = !DISubroutineType(types: !377)
!377 = !{!29, !29, !378, !379, !381, !379}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !380, line: 130, baseType: !381)
!380 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !33, line: 35, baseType: !86)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391}
!383 = !DILocalVariable(name: "pa", arg: 1, scope: !375, file: !360, line: 223, type: !29)
!384 = !DILocalVariable(name: "pn", arg: 2, scope: !375, file: !360, line: 223, type: !378)
!385 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !375, file: !360, line: 223, type: !379)
!386 = !DILocalVariable(name: "n_max", arg: 4, scope: !375, file: !360, line: 223, type: !381)
!387 = !DILocalVariable(name: "s", arg: 5, scope: !375, file: !360, line: 223, type: !379)
!388 = !DILocalVariable(name: "n0", scope: !375, file: !360, line: 230, type: !379)
!389 = !DILocalVariable(name: "n", scope: !375, file: !360, line: 237, type: !379)
!390 = !DILocalVariable(name: "nbytes", scope: !375, file: !360, line: 248, type: !379)
!391 = !DILocalVariable(name: "adjusted_nbytes", scope: !375, file: !360, line: 252, type: !379)
!392 = !{!65, !29, !44, !86, !34}
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!405 = !{!44, !34, !29}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!412 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!413 = !{i32 7, !"Dwarf Version", i32 5}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{i32 1, !"branch-target-enforcement", i32 0}
!417 = !{i32 1, !"sign-return-address", i32 0}
!418 = !{i32 1, !"sign-return-address-all", i32 0}
!419 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!420 = !{i32 7, !"PIC Level", i32 2}
!421 = !{i32 7, !"PIE Level", i32 2}
!422 = !{i32 7, !"uwtable", i32 1}
!423 = !{i32 7, !"frame-pointer", i32 1}
!424 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 34, type: !425, scopeLine: 35, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !30}
!427 = !{!428}
!428 = !DILocalVariable(name: "status", arg: 1, scope: !424, file: !10, line: 34, type: !30)
!429 = !DILocation(line: 0, scope: !424)
!430 = !DILocation(line: 36, column: 14, scope: !431)
!431 = distinct !DILexicalBlock(scope: !424, file: !10, line: 36, column: 7)
!432 = !DILocation(line: 36, column: 7, scope: !424)
!433 = !DILocation(line: 37, column: 5, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !10, line: 37, column: 5)
!435 = !{!436, !436, i64 0}
!436 = !{!"any pointer", !437, i64 0}
!437 = !{!"omnipotent char", !438, i64 0}
!438 = !{!"Simple C/C++ TBAA"}
!439 = !DILocation(line: 40, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !431, file: !10, line: 39, column: 5)
!441 = !DILocation(line: 45, column: 7, scope: !440)
!442 = !DILocation(line: 46, column: 7, scope: !440)
!443 = !DILocalVariable(name: "program", arg: 1, scope: !444, file: !3, line: 836, type: !6)
!444 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !445, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !6}
!447 = !{!443, !448, !457, !458, !460, !461}
!448 = !DILocalVariable(name: "infomap", scope: !444, file: !3, line: 838, type: !449)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 896, elements: !455)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !444, file: !3, line: 838, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !451, file: !3, line: 838, baseType: !6, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !451, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!455 = !{!456}
!456 = !DISubrange(count: 7)
!457 = !DILocalVariable(name: "node", scope: !444, file: !3, line: 848, type: !6)
!458 = !DILocalVariable(name: "map_prog", scope: !444, file: !3, line: 849, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!460 = !DILocalVariable(name: "lc_messages", scope: !444, file: !3, line: 861, type: !6)
!461 = !DILocalVariable(name: "url_program", scope: !444, file: !3, line: 874, type: !6)
!462 = !DILocation(line: 0, scope: !444, inlinedAt: !463)
!463 = distinct !DILocation(line: 47, column: 7, scope: !440)
!464 = !DILocation(line: 838, column: 3, scope: !444, inlinedAt: !463)
!465 = !DILocation(line: 838, column: 67, scope: !444, inlinedAt: !463)
!466 = !DILocation(line: 849, column: 36, scope: !444, inlinedAt: !463)
!467 = !DILocation(line: 851, column: 3, scope: !444, inlinedAt: !463)
!468 = !DILocalVariable(name: "__s1", arg: 1, scope: !469, file: !470, line: 1359, type: !6)
!469 = distinct !DISubprogram(name: "streq", scope: !470, file: !470, line: 1359, type: !471, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !473)
!470 = !DIFile(filename: "./lib/string.h", directory: "/src")
!471 = !DISubroutineType(types: !472)
!472 = !{!44, !6, !6}
!473 = !{!468, !474}
!474 = !DILocalVariable(name: "__s2", arg: 2, scope: !469, file: !470, line: 1359, type: !6)
!475 = !DILocation(line: 0, scope: !469, inlinedAt: !476)
!476 = distinct !DILocation(line: 851, column: 33, scope: !444, inlinedAt: !463)
!477 = !DILocation(line: 1361, column: 11, scope: !469, inlinedAt: !476)
!478 = !DILocation(line: 1361, column: 10, scope: !469, inlinedAt: !476)
!479 = !DILocation(line: 852, column: 13, scope: !444, inlinedAt: !463)
!480 = !DILocation(line: 851, column: 20, scope: !444, inlinedAt: !463)
!481 = !{!482, !436, i64 0}
!482 = !{!"infomap", !436, i64 0, !436, i64 8}
!483 = !DILocation(line: 851, column: 10, scope: !444, inlinedAt: !463)
!484 = !DILocation(line: 851, column: 28, scope: !444, inlinedAt: !463)
!485 = distinct !{!485, !467, !479, !486}
!486 = !{!"llvm.loop.mustprogress"}
!487 = !DILocation(line: 854, column: 17, scope: !488, inlinedAt: !463)
!488 = distinct !DILexicalBlock(scope: !444, file: !3, line: 854, column: 7)
!489 = !{!482, !436, i64 8}
!490 = !DILocation(line: 854, column: 7, scope: !488, inlinedAt: !463)
!491 = !DILocation(line: 854, column: 7, scope: !444, inlinedAt: !463)
!492 = !DILocation(line: 857, column: 3, scope: !444, inlinedAt: !463)
!493 = !DILocation(line: 861, column: 29, scope: !444, inlinedAt: !463)
!494 = !DILocation(line: 862, column: 7, scope: !495, inlinedAt: !463)
!495 = distinct !DILexicalBlock(scope: !444, file: !3, line: 862, column: 7)
!496 = !DILocation(line: 862, column: 19, scope: !495, inlinedAt: !463)
!497 = !DILocation(line: 862, column: 22, scope: !495, inlinedAt: !463)
!498 = !DILocation(line: 862, column: 7, scope: !444, inlinedAt: !463)
!499 = !DILocation(line: 868, column: 7, scope: !500, inlinedAt: !463)
!500 = distinct !DILexicalBlock(scope: !495, file: !3, line: 863, column: 5)
!501 = !DILocation(line: 870, column: 5, scope: !500, inlinedAt: !463)
!502 = !DILocation(line: 0, scope: !469, inlinedAt: !503)
!503 = distinct !DILocation(line: 874, column: 29, scope: !444, inlinedAt: !463)
!504 = !DILocation(line: 875, column: 3, scope: !444, inlinedAt: !463)
!505 = !DILocation(line: 877, column: 3, scope: !444, inlinedAt: !463)
!506 = !DILocation(line: 879, column: 1, scope: !444, inlinedAt: !463)
!507 = !DILocation(line: 49, column: 3, scope: !424)
!508 = !DISubprogram(name: "dcgettext", scope: !509, file: !509, line: 51, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!509 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!510 = !DISubroutineType(types: !511)
!511 = !{!65, !6, !6, !30}
!512 = !{}
!513 = !DILocation(line: 0, scope: !2)
!514 = !DILocation(line: 581, column: 7, scope: !42)
!515 = !{!516, !516, i64 0}
!516 = !{!"int", !437, i64 0}
!517 = !DILocation(line: 581, column: 19, scope: !42)
!518 = !DILocation(line: 581, column: 7, scope: !2)
!519 = !DILocation(line: 585, column: 26, scope: !41)
!520 = !DILocation(line: 0, scope: !41)
!521 = !DILocation(line: 586, column: 23, scope: !41)
!522 = !DILocation(line: 586, column: 28, scope: !41)
!523 = !DILocation(line: 586, column: 32, scope: !41)
!524 = !{!437, !437, i64 0}
!525 = !DILocation(line: 586, column: 38, scope: !41)
!526 = !DILocation(line: 0, scope: !469, inlinedAt: !527)
!527 = distinct !DILocation(line: 586, column: 41, scope: !41)
!528 = !DILocation(line: 1361, column: 11, scope: !469, inlinedAt: !527)
!529 = !DILocation(line: 1361, column: 10, scope: !469, inlinedAt: !527)
!530 = !DILocation(line: 586, column: 19, scope: !41)
!531 = !DILocation(line: 587, column: 5, scope: !41)
!532 = !DILocation(line: 588, column: 7, scope: !533)
!533 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!534 = !DILocation(line: 588, column: 7, scope: !2)
!535 = !DILocation(line: 590, column: 7, scope: !536)
!536 = distinct !DILexicalBlock(scope: !533, file: !3, line: 589, column: 5)
!537 = !DILocation(line: 591, column: 7, scope: !536)
!538 = !DILocation(line: 595, column: 37, scope: !2)
!539 = !DILocation(line: 595, column: 35, scope: !2)
!540 = !DILocation(line: 596, column: 29, scope: !2)
!541 = !DILocation(line: 597, column: 8, scope: !50)
!542 = !DILocation(line: 597, column: 7, scope: !2)
!543 = !DILocation(line: 604, column: 24, scope: !49)
!544 = !DILocation(line: 604, column: 12, scope: !50)
!545 = !DILocation(line: 0, scope: !48)
!546 = !DILocation(line: 610, column: 16, scope: !48)
!547 = !DILocation(line: 610, column: 7, scope: !48)
!548 = !DILocation(line: 611, column: 21, scope: !48)
!549 = !{!550, !550, i64 0}
!550 = !{!"short", !437, i64 0}
!551 = !DILocation(line: 611, column: 19, scope: !48)
!552 = !DILocation(line: 611, column: 16, scope: !48)
!553 = !DILocation(line: 610, column: 30, scope: !48)
!554 = distinct !{!554, !547, !548, !486}
!555 = !DILocation(line: 612, column: 18, scope: !556)
!556 = distinct !DILexicalBlock(scope: !48, file: !3, line: 612, column: 11)
!557 = !DILocation(line: 612, column: 11, scope: !48)
!558 = !DILocation(line: 620, column: 23, scope: !2)
!559 = !DILocation(line: 625, column: 39, scope: !2)
!560 = !DILocation(line: 626, column: 3, scope: !2)
!561 = !DILocation(line: 626, column: 10, scope: !2)
!562 = !DILocation(line: 626, column: 21, scope: !2)
!563 = !DILocation(line: 628, column: 44, scope: !564)
!564 = distinct !DILexicalBlock(scope: !565, file: !3, line: 628, column: 11)
!565 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!566 = !DILocation(line: 628, column: 32, scope: !564)
!567 = !DILocation(line: 628, column: 49, scope: !564)
!568 = !DILocation(line: 628, column: 11, scope: !565)
!569 = !DILocation(line: 630, column: 11, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !3, line: 630, column: 11)
!571 = !DILocation(line: 630, column: 11, scope: !565)
!572 = !DILocation(line: 632, column: 26, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 632, column: 15)
!574 = distinct !DILexicalBlock(scope: !570, file: !3, line: 631, column: 9)
!575 = !DILocation(line: 632, column: 34, scope: !573)
!576 = !DILocation(line: 632, column: 37, scope: !573)
!577 = !DILocation(line: 632, column: 15, scope: !574)
!578 = !DILocation(line: 636, column: 29, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 636, column: 15)
!580 = !DILocation(line: 640, column: 16, scope: !565)
!581 = distinct !{!581, !560, !582, !486}
!582 = !DILocation(line: 641, column: 5, scope: !2)
!583 = !DILocation(line: 644, column: 3, scope: !2)
!584 = !DILocation(line: 0, scope: !469, inlinedAt: !585)
!585 = distinct !DILocation(line: 648, column: 31, scope: !2)
!586 = !DILocation(line: 0, scope: !469, inlinedAt: !587)
!587 = distinct !DILocation(line: 649, column: 31, scope: !2)
!588 = !DILocation(line: 0, scope: !469, inlinedAt: !589)
!589 = distinct !DILocation(line: 650, column: 31, scope: !2)
!590 = !DILocation(line: 0, scope: !469, inlinedAt: !591)
!591 = distinct !DILocation(line: 651, column: 31, scope: !2)
!592 = !DILocation(line: 0, scope: !469, inlinedAt: !593)
!593 = distinct !DILocation(line: 652, column: 31, scope: !2)
!594 = !DILocation(line: 0, scope: !469, inlinedAt: !595)
!595 = distinct !DILocation(line: 653, column: 31, scope: !2)
!596 = !DILocation(line: 0, scope: !469, inlinedAt: !597)
!597 = distinct !DILocation(line: 654, column: 31, scope: !2)
!598 = !DILocation(line: 0, scope: !469, inlinedAt: !599)
!599 = distinct !DILocation(line: 655, column: 31, scope: !2)
!600 = !DILocation(line: 0, scope: !469, inlinedAt: !601)
!601 = distinct !DILocation(line: 656, column: 31, scope: !2)
!602 = !DILocation(line: 0, scope: !469, inlinedAt: !603)
!603 = distinct !DILocation(line: 657, column: 31, scope: !2)
!604 = !DILocation(line: 663, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!606 = !DILocation(line: 664, column: 7, scope: !605)
!607 = !DILocation(line: 664, column: 10, scope: !605)
!608 = !DILocation(line: 663, column: 7, scope: !2)
!609 = !DILocation(line: 669, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !605, file: !3, line: 665, column: 5)
!611 = !DILocation(line: 671, column: 5, scope: !610)
!612 = !DILocation(line: 676, column: 7, scope: !613)
!613 = distinct !DILexicalBlock(scope: !605, file: !3, line: 673, column: 5)
!614 = !DILocation(line: 679, column: 3, scope: !2)
!615 = !DILocation(line: 683, column: 3, scope: !2)
!616 = !DILocation(line: 686, column: 3, scope: !2)
!617 = !DILocation(line: 688, column: 3, scope: !2)
!618 = !DILocation(line: 691, column: 3, scope: !2)
!619 = !DILocation(line: 695, column: 3, scope: !2)
!620 = !DILocation(line: 696, column: 1, scope: !2)
!621 = !DISubprogram(name: "setlocale", scope: !622, file: !622, line: 122, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!622 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!623 = !DISubroutineType(types: !624)
!624 = !{!65, !30, !6}
!625 = !DISubprogram(name: "fputs_unlocked", scope: !143, file: !143, line: 691, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!626 = !DISubroutineType(types: !627)
!627 = !{!30, !628, !629}
!628 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!629 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!630 = !DISubprogram(name: "getenv", scope: !631, file: !631, line: 641, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!631 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!632 = !DISubroutineType(types: !633)
!633 = !{!65, !6}
!634 = !DISubprogram(name: "fwrite_unlocked", scope: !143, file: !143, line: 704, type: !635, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!635 = !DISubroutineType(types: !636)
!636 = !{!32, !637, !32, !32, !629}
!637 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!640 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 53, type: !641, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !644)
!641 = !DISubroutineType(types: !642)
!642 = !{!30, !30, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!644 = !{!645, !646, !647}
!645 = !DILocalVariable(name: "argc", arg: 1, scope: !640, file: !10, line: 53, type: !30)
!646 = !DILocalVariable(name: "argv", arg: 2, scope: !640, file: !10, line: 53, type: !643)
!647 = !DILocalVariable(name: "id", scope: !640, file: !10, line: 76, type: !14)
!648 = !DILocation(line: 0, scope: !640)
!649 = !DILocation(line: 56, column: 21, scope: !640)
!650 = !DILocation(line: 56, column: 3, scope: !640)
!651 = !DILocation(line: 57, column: 3, scope: !640)
!652 = !DILocation(line: 58, column: 3, scope: !640)
!653 = !DILocation(line: 59, column: 3, scope: !640)
!654 = !DILocation(line: 61, column: 3, scope: !640)
!655 = !DILocation(line: 64, column: 36, scope: !640)
!656 = !DILocation(line: 64, column: 58, scope: !640)
!657 = !DILocation(line: 63, column: 3, scope: !640)
!658 = !DILocation(line: 67, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !640, file: !10, line: 67, column: 7)
!660 = !DILocation(line: 67, column: 14, scope: !659)
!661 = !DILocation(line: 67, column: 7, scope: !640)
!662 = !DILocation(line: 69, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !10, line: 68, column: 5)
!664 = !DILocation(line: 70, column: 7, scope: !663)
!665 = !DILocation(line: 76, column: 21, scope: !640)
!666 = !DILocation(line: 78, column: 3, scope: !640)
!667 = !DILocation(line: 80, column: 3, scope: !640)
!668 = !DISubprogram(name: "bindtextdomain", scope: !509, file: !509, line: 86, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!669 = !DISubroutineType(types: !670)
!670 = !{!65, !6, !6}
!671 = !DISubprogram(name: "textdomain", scope: !509, file: !509, line: 82, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!672 = !DISubprogram(name: "atexit", scope: !631, file: !631, line: 602, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!673 = !DISubroutineType(types: !674)
!674 = !{!30, !169}
!675 = !DISubprogram(name: "gethostid", scope: !676, file: !676, line: 1002, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!676 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!677 = !DISubroutineType(types: !678)
!678 = !{!86}
!679 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !127, file: !127, line: 50, type: !445, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !680)
!680 = !{!681}
!681 = !DILocalVariable(name: "file", arg: 1, scope: !679, file: !127, line: 50, type: !6)
!682 = !DILocation(line: 0, scope: !679)
!683 = !DILocation(line: 52, column: 13, scope: !679)
!684 = !DILocation(line: 53, column: 1, scope: !679)
!685 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !127, file: !127, line: 87, type: !686, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !44}
!688 = !{!689}
!689 = !DILocalVariable(name: "ignore", arg: 1, scope: !685, file: !127, line: 87, type: !44)
!690 = !DILocation(line: 0, scope: !685)
!691 = !DILocation(line: 89, column: 16, scope: !685)
!692 = !{!693, !693, i64 0}
!693 = !{!"_Bool", !437, i64 0}
!694 = !DILocation(line: 90, column: 1, scope: !685)
!695 = distinct !DISubprogram(name: "close_stdout", scope: !127, file: !127, line: 116, type: !170, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !696)
!696 = !{!697}
!697 = !DILocalVariable(name: "write_error", scope: !698, file: !127, line: 121, type: !6)
!698 = distinct !DILexicalBlock(scope: !699, file: !127, line: 120, column: 5)
!699 = distinct !DILexicalBlock(scope: !695, file: !127, line: 118, column: 7)
!700 = !DILocation(line: 118, column: 21, scope: !699)
!701 = !DILocation(line: 118, column: 7, scope: !699)
!702 = !DILocation(line: 118, column: 29, scope: !699)
!703 = !DILocation(line: 119, column: 7, scope: !699)
!704 = !DILocation(line: 119, column: 12, scope: !699)
!705 = !{i8 0, i8 2}
!706 = !DILocation(line: 119, column: 25, scope: !699)
!707 = !DILocation(line: 119, column: 28, scope: !699)
!708 = !DILocation(line: 119, column: 34, scope: !699)
!709 = !DILocation(line: 118, column: 7, scope: !695)
!710 = !DILocation(line: 121, column: 33, scope: !698)
!711 = !DILocation(line: 0, scope: !698)
!712 = !DILocation(line: 122, column: 11, scope: !713)
!713 = distinct !DILexicalBlock(scope: !698, file: !127, line: 122, column: 11)
!714 = !DILocation(line: 0, scope: !713)
!715 = !DILocation(line: 122, column: 11, scope: !698)
!716 = !DILocation(line: 123, column: 9, scope: !713)
!717 = !DILocation(line: 126, column: 9, scope: !713)
!718 = !DILocation(line: 128, column: 14, scope: !698)
!719 = !DILocation(line: 128, column: 7, scope: !698)
!720 = !DILocation(line: 133, column: 42, scope: !721)
!721 = distinct !DILexicalBlock(scope: !695, file: !127, line: 133, column: 7)
!722 = !DILocation(line: 133, column: 28, scope: !721)
!723 = !DILocation(line: 133, column: 50, scope: !721)
!724 = !DILocation(line: 133, column: 7, scope: !695)
!725 = !DILocation(line: 134, column: 12, scope: !721)
!726 = !DILocation(line: 134, column: 5, scope: !721)
!727 = !DILocation(line: 135, column: 1, scope: !695)
!728 = distinct !DISubprogram(name: "verror", scope: !134, file: !134, line: 251, type: !729, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !30, !30, !6, !142}
!731 = !{!732, !733, !734, !735}
!732 = !DILocalVariable(name: "status", arg: 1, scope: !728, file: !134, line: 251, type: !30)
!733 = !DILocalVariable(name: "errnum", arg: 2, scope: !728, file: !134, line: 251, type: !30)
!734 = !DILocalVariable(name: "message", arg: 3, scope: !728, file: !134, line: 251, type: !6)
!735 = !DILocalVariable(name: "args", arg: 4, scope: !728, file: !134, line: 251, type: !142)
!736 = !DILocation(line: 0, scope: !728)
!737 = !DILocation(line: 251, column: 1, scope: !728)
!738 = !DILocation(line: 261, column: 3, scope: !728)
!739 = !DILocation(line: 265, column: 7, scope: !740)
!740 = distinct !DILexicalBlock(scope: !728, file: !134, line: 265, column: 7)
!741 = !DILocation(line: 265, column: 7, scope: !728)
!742 = !DILocation(line: 266, column: 5, scope: !740)
!743 = !DILocation(line: 272, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !134, line: 268, column: 5)
!745 = !DILocation(line: 276, column: 3, scope: !728)
!746 = !{i64 0, i64 8, !435, i64 8, i64 8, !435, i64 16, i64 8, !435, i64 24, i64 4, !515, i64 28, i64 4, !515}
!747 = !DILocation(line: 282, column: 1, scope: !728)
!748 = distinct !DISubprogram(name: "flush_stdout", scope: !134, file: !134, line: 163, type: !170, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !749)
!749 = !{!750}
!750 = !DILocalVariable(name: "stdout_fd", scope: !748, file: !134, line: 166, type: !30)
!751 = !DILocation(line: 0, scope: !748)
!752 = !DILocalVariable(name: "fd", arg: 1, scope: !753, file: !134, line: 145, type: !30)
!753 = distinct !DISubprogram(name: "is_open", scope: !134, file: !134, line: 145, type: !754, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!30, !30}
!756 = !{!752}
!757 = !DILocation(line: 0, scope: !753, inlinedAt: !758)
!758 = distinct !DILocation(line: 182, column: 25, scope: !759)
!759 = distinct !DILexicalBlock(scope: !748, file: !134, line: 182, column: 7)
!760 = !DILocation(line: 157, column: 15, scope: !753, inlinedAt: !758)
!761 = !DILocation(line: 182, column: 25, scope: !759)
!762 = !DILocation(line: 182, column: 7, scope: !748)
!763 = !DILocation(line: 184, column: 5, scope: !759)
!764 = !DILocation(line: 185, column: 1, scope: !748)
!765 = distinct !DISubprogram(name: "error_tail", scope: !134, file: !134, line: 219, type: !729, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DILocalVariable(name: "status", arg: 1, scope: !765, file: !134, line: 219, type: !30)
!768 = !DILocalVariable(name: "errnum", arg: 2, scope: !765, file: !134, line: 219, type: !30)
!769 = !DILocalVariable(name: "message", arg: 3, scope: !765, file: !134, line: 219, type: !6)
!770 = !DILocalVariable(name: "args", arg: 4, scope: !765, file: !134, line: 219, type: !142)
!771 = !DILocation(line: 0, scope: !765)
!772 = !DILocation(line: 219, column: 1, scope: !765)
!773 = !DILocation(line: 229, column: 13, scope: !765)
!774 = !DILocation(line: 229, column: 3, scope: !765)
!775 = !DILocalVariable(name: "__stream", arg: 1, scope: !776, file: !777, line: 132, type: !780)
!776 = distinct !DISubprogram(name: "vfprintf", scope: !777, file: !777, line: 132, type: !778, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !815)
!777 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!778 = !DISubroutineType(types: !779)
!779 = !{!30, !780, !628, !144}
!780 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !783, file: !61, line: 51, baseType: !30, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !783, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !783, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !783, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !783, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !783, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !783, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !783, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !783, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !783, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !783, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !783, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !783, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !783, file: !61, line: 70, baseType: !799, size: 64, offset: 832)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !783, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !783, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !783, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !783, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !783, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !783, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !783, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !783, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !783, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !783, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !783, file: !61, line: 93, baseType: !799, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !783, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !783, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !783, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !783, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!815 = !{!775, !816, !817}
!816 = !DILocalVariable(name: "__fmt", arg: 2, scope: !776, file: !777, line: 133, type: !628)
!817 = !DILocalVariable(name: "__ap", arg: 3, scope: !776, file: !777, line: 133, type: !144)
!818 = !DILocation(line: 0, scope: !776, inlinedAt: !819)
!819 = distinct !DILocation(line: 229, column: 3, scope: !765)
!820 = !DILocation(line: 135, column: 10, scope: !776, inlinedAt: !819)
!821 = !{!822, !824}
!822 = distinct !{!822, !823, !"vfprintf.inline: argument 0"}
!823 = distinct !{!823, !"vfprintf.inline"}
!824 = distinct !{!824, !823, !"vfprintf.inline: argument 1"}
!825 = !DILocation(line: 232, column: 3, scope: !765)
!826 = !DILocation(line: 233, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !765, file: !134, line: 233, column: 7)
!828 = !DILocation(line: 233, column: 7, scope: !765)
!829 = !DILocalVariable(name: "errnum", arg: 1, scope: !830, file: !134, line: 188, type: !30)
!830 = distinct !DISubprogram(name: "print_errno_message", scope: !134, file: !134, line: 188, type: !425, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !831)
!831 = !{!829, !832, !833}
!832 = !DILocalVariable(name: "s", scope: !830, file: !134, line: 190, type: !6)
!833 = !DILocalVariable(name: "errbuf", scope: !830, file: !134, line: 193, type: !834)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 1024)
!837 = !DILocation(line: 0, scope: !830, inlinedAt: !838)
!838 = distinct !DILocation(line: 234, column: 5, scope: !827)
!839 = !DILocation(line: 193, column: 3, scope: !830, inlinedAt: !838)
!840 = !DILocation(line: 193, column: 8, scope: !830, inlinedAt: !838)
!841 = !DILocation(line: 195, column: 7, scope: !830, inlinedAt: !838)
!842 = !DILocation(line: 207, column: 9, scope: !843, inlinedAt: !838)
!843 = distinct !DILexicalBlock(scope: !830, file: !134, line: 207, column: 7)
!844 = !DILocation(line: 207, column: 7, scope: !830, inlinedAt: !838)
!845 = !DILocation(line: 208, column: 9, scope: !843, inlinedAt: !838)
!846 = !DILocation(line: 208, column: 5, scope: !843, inlinedAt: !838)
!847 = !DILocation(line: 214, column: 3, scope: !830, inlinedAt: !838)
!848 = !DILocation(line: 216, column: 1, scope: !830, inlinedAt: !838)
!849 = !DILocation(line: 234, column: 5, scope: !827)
!850 = !DILocation(line: 238, column: 3, scope: !765)
!851 = !DILocalVariable(name: "__c", arg: 1, scope: !852, file: !853, line: 101, type: !30)
!852 = distinct !DISubprogram(name: "putc_unlocked", scope: !853, file: !853, line: 101, type: !854, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !856)
!853 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!854 = !DISubroutineType(types: !855)
!855 = !{!30, !30, !781}
!856 = !{!851, !857}
!857 = !DILocalVariable(name: "__stream", arg: 2, scope: !852, file: !853, line: 101, type: !781)
!858 = !DILocation(line: 0, scope: !852, inlinedAt: !859)
!859 = distinct !DILocation(line: 238, column: 3, scope: !765)
!860 = !DILocation(line: 103, column: 10, scope: !852, inlinedAt: !859)
!861 = !{!862, !436, i64 40}
!862 = !{!"_IO_FILE", !516, i64 0, !436, i64 8, !436, i64 16, !436, i64 24, !436, i64 32, !436, i64 40, !436, i64 48, !436, i64 56, !436, i64 64, !436, i64 72, !436, i64 80, !436, i64 88, !436, i64 96, !436, i64 104, !516, i64 112, !516, i64 116, !863, i64 120, !550, i64 128, !437, i64 130, !437, i64 131, !436, i64 136, !863, i64 144, !436, i64 152, !436, i64 160, !436, i64 168, !436, i64 176, !863, i64 184, !516, i64 192, !437, i64 196}
!863 = !{!"long", !437, i64 0}
!864 = !{!862, !436, i64 48}
!865 = !{!"branch_weights", i32 2000, i32 1}
!866 = !DILocation(line: 240, column: 3, scope: !765)
!867 = !DILocation(line: 241, column: 7, scope: !868)
!868 = distinct !DILexicalBlock(scope: !765, file: !134, line: 241, column: 7)
!869 = !DILocation(line: 241, column: 7, scope: !765)
!870 = !DILocation(line: 242, column: 5, scope: !868)
!871 = !DILocation(line: 243, column: 1, scope: !765)
!872 = !DISubprogram(name: "strerror_r", scope: !873, file: !873, line: 444, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!873 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!874 = !DISubroutineType(types: !875)
!875 = !{!65, !30, !65, !32}
!876 = !DISubprogram(name: "fflush_unlocked", scope: !143, file: !143, line: 239, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!877 = !DISubroutineType(types: !878)
!878 = !{!30, !781}
!879 = !DISubprogram(name: "fcntl", scope: !880, file: !880, line: 149, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!880 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!881 = !DISubroutineType(types: !882)
!882 = !{!30, !30, !30, null}
!883 = distinct !DISubprogram(name: "error", scope: !134, file: !134, line: 285, type: !884, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !886)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !30, !30, !6, null}
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "status", arg: 1, scope: !883, file: !134, line: 285, type: !30)
!888 = !DILocalVariable(name: "errnum", arg: 2, scope: !883, file: !134, line: 285, type: !30)
!889 = !DILocalVariable(name: "message", arg: 3, scope: !883, file: !134, line: 285, type: !6)
!890 = !DILocalVariable(name: "ap", scope: !883, file: !134, line: 287, type: !142)
!891 = !DILocation(line: 0, scope: !883)
!892 = !DILocation(line: 287, column: 3, scope: !883)
!893 = !DILocation(line: 287, column: 11, scope: !883)
!894 = !DILocation(line: 288, column: 3, scope: !883)
!895 = !DILocation(line: 289, column: 3, scope: !883)
!896 = !DILocation(line: 290, column: 3, scope: !883)
!897 = !DILocation(line: 291, column: 1, scope: !883)
!898 = !DILocation(line: 0, scope: !139)
!899 = !DILocation(line: 298, column: 1, scope: !139)
!900 = !DILocation(line: 302, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !139, file: !134, line: 302, column: 7)
!902 = !DILocation(line: 302, column: 7, scope: !139)
!903 = !DILocation(line: 307, column: 11, scope: !904)
!904 = distinct !DILexicalBlock(scope: !905, file: !134, line: 307, column: 11)
!905 = distinct !DILexicalBlock(scope: !901, file: !134, line: 303, column: 5)
!906 = !DILocation(line: 307, column: 27, scope: !904)
!907 = !DILocation(line: 308, column: 11, scope: !904)
!908 = !DILocation(line: 308, column: 28, scope: !904)
!909 = !DILocation(line: 308, column: 25, scope: !904)
!910 = !DILocation(line: 309, column: 15, scope: !904)
!911 = !DILocation(line: 309, column: 33, scope: !904)
!912 = !DILocation(line: 310, column: 19, scope: !904)
!913 = !DILocation(line: 311, column: 22, scope: !904)
!914 = !DILocation(line: 311, column: 56, scope: !904)
!915 = !DILocation(line: 307, column: 11, scope: !905)
!916 = !DILocation(line: 316, column: 21, scope: !905)
!917 = !DILocation(line: 317, column: 23, scope: !905)
!918 = !DILocation(line: 318, column: 5, scope: !905)
!919 = !DILocation(line: 327, column: 3, scope: !139)
!920 = !DILocation(line: 331, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !139, file: !134, line: 331, column: 7)
!922 = !DILocation(line: 331, column: 7, scope: !139)
!923 = !DILocation(line: 332, column: 5, scope: !921)
!924 = !DILocation(line: 338, column: 7, scope: !925)
!925 = distinct !DILexicalBlock(scope: !921, file: !134, line: 334, column: 5)
!926 = !DILocation(line: 346, column: 3, scope: !139)
!927 = !DILocation(line: 350, column: 3, scope: !139)
!928 = !DILocation(line: 356, column: 1, scope: !139)
!929 = distinct !DISubprogram(name: "error_at_line", scope: !134, file: !134, line: 359, type: !930, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !30, !30, !6, !14, !6, null}
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DILocalVariable(name: "status", arg: 1, scope: !929, file: !134, line: 359, type: !30)
!934 = !DILocalVariable(name: "errnum", arg: 2, scope: !929, file: !134, line: 359, type: !30)
!935 = !DILocalVariable(name: "file_name", arg: 3, scope: !929, file: !134, line: 359, type: !6)
!936 = !DILocalVariable(name: "line_number", arg: 4, scope: !929, file: !134, line: 360, type: !14)
!937 = !DILocalVariable(name: "message", arg: 5, scope: !929, file: !134, line: 360, type: !6)
!938 = !DILocalVariable(name: "ap", scope: !929, file: !134, line: 362, type: !142)
!939 = !DILocation(line: 0, scope: !929)
!940 = !DILocation(line: 362, column: 3, scope: !929)
!941 = !DILocation(line: 362, column: 11, scope: !929)
!942 = !DILocation(line: 363, column: 3, scope: !929)
!943 = !DILocation(line: 364, column: 3, scope: !929)
!944 = !DILocation(line: 366, column: 3, scope: !929)
!945 = !DILocation(line: 367, column: 1, scope: !929)
!946 = distinct !DISubprogram(name: "getprogname", scope: !351, file: !351, line: 54, type: !947, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !512)
!947 = !DISubroutineType(types: !948)
!948 = !{!6}
!949 = !DILocation(line: 58, column: 10, scope: !946)
!950 = !DILocation(line: 58, column: 3, scope: !946)
!951 = distinct !DISubprogram(name: "parse_long_options", scope: !175, file: !175, line: 45, type: !952, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !955)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !30, !643, !6, !6, !6, !954, null}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!955 = !{!956, !957, !958, !959, !960, !961, !962, !963, !966}
!956 = !DILocalVariable(name: "argc", arg: 1, scope: !951, file: !175, line: 45, type: !30)
!957 = !DILocalVariable(name: "argv", arg: 2, scope: !951, file: !175, line: 46, type: !643)
!958 = !DILocalVariable(name: "command_name", arg: 3, scope: !951, file: !175, line: 47, type: !6)
!959 = !DILocalVariable(name: "package", arg: 4, scope: !951, file: !175, line: 48, type: !6)
!960 = !DILocalVariable(name: "version", arg: 5, scope: !951, file: !175, line: 49, type: !6)
!961 = !DILocalVariable(name: "usage_func", arg: 6, scope: !951, file: !175, line: 50, type: !954)
!962 = !DILocalVariable(name: "saved_opterr", scope: !951, file: !175, line: 53, type: !30)
!963 = !DILocalVariable(name: "c", scope: !964, file: !175, line: 60, type: !30)
!964 = distinct !DILexicalBlock(scope: !965, file: !175, line: 59, column: 5)
!965 = distinct !DILexicalBlock(scope: !951, file: !175, line: 58, column: 7)
!966 = !DILocalVariable(name: "authors", scope: !967, file: !175, line: 71, type: !971)
!967 = distinct !DILexicalBlock(scope: !968, file: !175, line: 70, column: 15)
!968 = distinct !DILexicalBlock(scope: !969, file: !175, line: 64, column: 13)
!969 = distinct !DILexicalBlock(scope: !970, file: !175, line: 62, column: 9)
!970 = distinct !DILexicalBlock(scope: !964, file: !175, line: 61, column: 11)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !974, baseType: !975)
!974 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !976)
!976 = !{!977, !978, !979, !980, !981}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !975, file: !974, line: 71, baseType: !29, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !975, file: !974, line: 71, baseType: !29, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !975, file: !974, line: 71, baseType: !29, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !975, file: !974, line: 71, baseType: !30, size: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !975, file: !974, line: 71, baseType: !30, size: 32, offset: 224)
!982 = !DILocation(line: 0, scope: !951)
!983 = !DILocation(line: 53, column: 22, scope: !951)
!984 = !DILocation(line: 56, column: 10, scope: !951)
!985 = !DILocation(line: 58, column: 12, scope: !965)
!986 = !DILocation(line: 58, column: 7, scope: !951)
!987 = !DILocation(line: 60, column: 15, scope: !964)
!988 = !DILocation(line: 0, scope: !964)
!989 = !DILocation(line: 61, column: 11, scope: !964)
!990 = !DILocation(line: 66, column: 15, scope: !968)
!991 = !DILocation(line: 67, column: 15, scope: !968)
!992 = !DILocation(line: 71, column: 17, scope: !967)
!993 = !DILocation(line: 71, column: 25, scope: !967)
!994 = !DILocation(line: 72, column: 17, scope: !967)
!995 = !DILocation(line: 73, column: 33, scope: !967)
!996 = !DILocation(line: 73, column: 17, scope: !967)
!997 = !DILocation(line: 74, column: 17, scope: !967)
!998 = !DILocation(line: 85, column: 10, scope: !951)
!999 = !DILocation(line: 89, column: 10, scope: !951)
!1000 = !DILocation(line: 90, column: 1, scope: !951)
!1001 = !DISubprogram(name: "getopt_long", scope: !180, file: !180, line: 66, type: !1002, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!30, !30, !1004, !6, !1006, !185}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!1007 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !175, file: !175, line: 98, type: !1008, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !1010)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !30, !643, !6, !6, !6, !44, !954, null}
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!1011 = !DILocalVariable(name: "argc", arg: 1, scope: !1007, file: !175, line: 98, type: !30)
!1012 = !DILocalVariable(name: "argv", arg: 2, scope: !1007, file: !175, line: 99, type: !643)
!1013 = !DILocalVariable(name: "command_name", arg: 3, scope: !1007, file: !175, line: 100, type: !6)
!1014 = !DILocalVariable(name: "package", arg: 4, scope: !1007, file: !175, line: 101, type: !6)
!1015 = !DILocalVariable(name: "version", arg: 5, scope: !1007, file: !175, line: 102, type: !6)
!1016 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1007, file: !175, line: 103, type: !44)
!1017 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1007, file: !175, line: 104, type: !954)
!1018 = !DILocalVariable(name: "saved_opterr", scope: !1007, file: !175, line: 107, type: !30)
!1019 = !DILocalVariable(name: "optstring", scope: !1007, file: !175, line: 112, type: !6)
!1020 = !DILocalVariable(name: "c", scope: !1007, file: !175, line: 114, type: !30)
!1021 = !DILocalVariable(name: "authors", scope: !1022, file: !175, line: 125, type: !971)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !175, line: 124, column: 11)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !175, line: 118, column: 9)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !175, line: 116, column: 5)
!1025 = distinct !DILexicalBlock(scope: !1007, file: !175, line: 115, column: 7)
!1026 = !DILocation(line: 0, scope: !1007)
!1027 = !DILocation(line: 107, column: 22, scope: !1007)
!1028 = !DILocation(line: 110, column: 10, scope: !1007)
!1029 = !DILocation(line: 112, column: 27, scope: !1007)
!1030 = !DILocation(line: 114, column: 11, scope: !1007)
!1031 = !DILocation(line: 115, column: 7, scope: !1007)
!1032 = !DILocation(line: 125, column: 13, scope: !1022)
!1033 = !DILocation(line: 125, column: 21, scope: !1022)
!1034 = !DILocation(line: 126, column: 13, scope: !1022)
!1035 = !DILocation(line: 127, column: 29, scope: !1022)
!1036 = !DILocation(line: 127, column: 13, scope: !1022)
!1037 = !DILocation(line: 128, column: 13, scope: !1022)
!1038 = !DILocation(line: 132, column: 26, scope: !1023)
!1039 = !DILocation(line: 133, column: 11, scope: !1023)
!1040 = !DILocation(line: 0, scope: !1023)
!1041 = !DILocation(line: 138, column: 10, scope: !1007)
!1042 = !DILocation(line: 139, column: 1, scope: !1007)
!1043 = distinct !DISubprogram(name: "set_program_name", scope: !192, file: !192, line: 37, type: !445, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DILocalVariable(name: "argv0", arg: 1, scope: !1043, file: !192, line: 37, type: !6)
!1046 = !DILocalVariable(name: "slash", scope: !1043, file: !192, line: 44, type: !6)
!1047 = !DILocalVariable(name: "base", scope: !1043, file: !192, line: 45, type: !6)
!1048 = !DILocation(line: 0, scope: !1043)
!1049 = !DILocation(line: 44, column: 23, scope: !1043)
!1050 = !DILocation(line: 45, column: 22, scope: !1043)
!1051 = !DILocation(line: 46, column: 17, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1043, file: !192, line: 46, column: 7)
!1053 = !DILocation(line: 46, column: 9, scope: !1052)
!1054 = !DILocation(line: 46, column: 25, scope: !1052)
!1055 = !DILocation(line: 46, column: 40, scope: !1052)
!1056 = !DILocalVariable(name: "__s1", arg: 1, scope: !1057, file: !470, line: 974, type: !638)
!1057 = distinct !DISubprogram(name: "memeq", scope: !470, file: !470, line: 974, type: !1058, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!44, !638, !638, !32}
!1060 = !{!1056, !1061, !1062}
!1061 = !DILocalVariable(name: "__s2", arg: 2, scope: !1057, file: !470, line: 974, type: !638)
!1062 = !DILocalVariable(name: "__n", arg: 3, scope: !1057, file: !470, line: 974, type: !32)
!1063 = !DILocation(line: 0, scope: !1057, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 46, column: 28, scope: !1052)
!1065 = !DILocation(line: 976, column: 11, scope: !1057, inlinedAt: !1064)
!1066 = !DILocation(line: 976, column: 10, scope: !1057, inlinedAt: !1064)
!1067 = !DILocation(line: 46, column: 7, scope: !1043)
!1068 = !DILocation(line: 49, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !192, line: 49, column: 11)
!1070 = distinct !DILexicalBlock(scope: !1052, file: !192, line: 47, column: 5)
!1071 = !DILocation(line: 49, column: 36, scope: !1069)
!1072 = !DILocation(line: 49, column: 11, scope: !1070)
!1073 = !DILocation(line: 65, column: 16, scope: !1043)
!1074 = !DILocation(line: 71, column: 27, scope: !1043)
!1075 = !DILocation(line: 74, column: 33, scope: !1043)
!1076 = !DILocation(line: 76, column: 1, scope: !1043)
!1077 = !DILocation(line: 0, scope: !197)
!1078 = !DILocation(line: 40, column: 29, scope: !197)
!1079 = !DILocation(line: 41, column: 19, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !197, file: !198, line: 41, column: 7)
!1081 = !DILocation(line: 41, column: 7, scope: !197)
!1082 = !DILocation(line: 47, column: 3, scope: !197)
!1083 = !DILocation(line: 48, column: 3, scope: !197)
!1084 = !DILocation(line: 48, column: 13, scope: !197)
!1085 = !DILocalVariable(name: "ps", arg: 1, scope: !1086, file: !1087, line: 1135, type: !1090)
!1086 = distinct !DISubprogram(name: "mbszero", scope: !1087, file: !1087, line: 1135, type: !1088, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1091)
!1087 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!1091 = !{!1085}
!1092 = !DILocation(line: 0, scope: !1086, inlinedAt: !1093)
!1093 = distinct !DILocation(line: 48, column: 18, scope: !197)
!1094 = !DILocalVariable(name: "__dest", arg: 1, scope: !1095, file: !1096, line: 57, type: !29)
!1095 = distinct !DISubprogram(name: "memset", scope: !1096, file: !1096, line: 57, type: !1097, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1099)
!1096 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!29, !29, !30, !32}
!1099 = !{!1094, !1100, !1101}
!1100 = !DILocalVariable(name: "__ch", arg: 2, scope: !1095, file: !1096, line: 57, type: !30)
!1101 = !DILocalVariable(name: "__len", arg: 3, scope: !1095, file: !1096, line: 57, type: !32)
!1102 = !DILocation(line: 0, scope: !1095, inlinedAt: !1103)
!1103 = distinct !DILocation(line: 1137, column: 3, scope: !1086, inlinedAt: !1093)
!1104 = !DILocation(line: 59, column: 10, scope: !1095, inlinedAt: !1103)
!1105 = !DILocation(line: 49, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !197, file: !198, line: 49, column: 7)
!1107 = !DILocation(line: 49, column: 39, scope: !1106)
!1108 = !DILocation(line: 49, column: 44, scope: !1106)
!1109 = !DILocation(line: 54, column: 1, scope: !197)
!1110 = !DISubprogram(name: "mbrtoc32", scope: !209, file: !209, line: 57, type: !1111, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!32, !1113, !628, !32, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1090)
!1116 = distinct !DISubprogram(name: "clone_quoting_options", scope: !234, file: !234, line: 113, type: !1117, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1120)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!1119, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!1120 = !{!1121, !1122, !1123}
!1121 = !DILocalVariable(name: "o", arg: 1, scope: !1116, file: !234, line: 113, type: !1119)
!1122 = !DILocalVariable(name: "saved_errno", scope: !1116, file: !234, line: 115, type: !30)
!1123 = !DILocalVariable(name: "p", scope: !1116, file: !234, line: 116, type: !1119)
!1124 = !DILocation(line: 0, scope: !1116)
!1125 = !DILocation(line: 115, column: 21, scope: !1116)
!1126 = !DILocation(line: 116, column: 40, scope: !1116)
!1127 = !DILocation(line: 116, column: 31, scope: !1116)
!1128 = !DILocation(line: 118, column: 9, scope: !1116)
!1129 = !DILocation(line: 119, column: 3, scope: !1116)
!1130 = distinct !DISubprogram(name: "get_quoting_style", scope: !234, file: !234, line: 124, type: !1131, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1135)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!236, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!1135 = !{!1136}
!1136 = !DILocalVariable(name: "o", arg: 1, scope: !1130, file: !234, line: 124, type: !1133)
!1137 = !DILocation(line: 0, scope: !1130)
!1138 = !DILocation(line: 126, column: 11, scope: !1130)
!1139 = !DILocation(line: 126, column: 46, scope: !1130)
!1140 = !{!1141, !437, i64 0}
!1141 = !{!"quoting_options", !437, i64 0, !516, i64 4, !437, i64 8, !436, i64 40, !436, i64 48}
!1142 = !DILocation(line: 126, column: 3, scope: !1130)
!1143 = distinct !DISubprogram(name: "set_quoting_style", scope: !234, file: !234, line: 132, type: !1144, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1146)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{null, !1119, !236}
!1146 = !{!1147, !1148}
!1147 = !DILocalVariable(name: "o", arg: 1, scope: !1143, file: !234, line: 132, type: !1119)
!1148 = !DILocalVariable(name: "s", arg: 2, scope: !1143, file: !234, line: 132, type: !236)
!1149 = !DILocation(line: 0, scope: !1143)
!1150 = !DILocation(line: 134, column: 4, scope: !1143)
!1151 = !DILocation(line: 134, column: 39, scope: !1143)
!1152 = !DILocation(line: 134, column: 45, scope: !1143)
!1153 = !DILocation(line: 135, column: 1, scope: !1143)
!1154 = distinct !DISubprogram(name: "set_char_quoting", scope: !234, file: !234, line: 143, type: !1155, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1157)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!30, !1119, !8, !30}
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1164, !1165}
!1158 = !DILocalVariable(name: "o", arg: 1, scope: !1154, file: !234, line: 143, type: !1119)
!1159 = !DILocalVariable(name: "c", arg: 2, scope: !1154, file: !234, line: 143, type: !8)
!1160 = !DILocalVariable(name: "i", arg: 3, scope: !1154, file: !234, line: 143, type: !30)
!1161 = !DILocalVariable(name: "uc", scope: !1154, file: !234, line: 145, type: !35)
!1162 = !DILocalVariable(name: "p", scope: !1154, file: !234, line: 146, type: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!1164 = !DILocalVariable(name: "shift", scope: !1154, file: !234, line: 148, type: !30)
!1165 = !DILocalVariable(name: "r", scope: !1154, file: !234, line: 149, type: !14)
!1166 = !DILocation(line: 0, scope: !1154)
!1167 = !DILocation(line: 147, column: 6, scope: !1154)
!1168 = !DILocation(line: 147, column: 62, scope: !1154)
!1169 = !DILocation(line: 147, column: 57, scope: !1154)
!1170 = !DILocation(line: 148, column: 15, scope: !1154)
!1171 = !DILocation(line: 149, column: 21, scope: !1154)
!1172 = !DILocation(line: 149, column: 24, scope: !1154)
!1173 = !DILocation(line: 149, column: 34, scope: !1154)
!1174 = !DILocation(line: 150, column: 13, scope: !1154)
!1175 = !DILocation(line: 150, column: 19, scope: !1154)
!1176 = !DILocation(line: 150, column: 24, scope: !1154)
!1177 = !DILocation(line: 150, column: 6, scope: !1154)
!1178 = !DILocation(line: 151, column: 3, scope: !1154)
!1179 = distinct !DISubprogram(name: "set_quoting_flags", scope: !234, file: !234, line: 159, type: !1180, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1182)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!30, !1119, !30}
!1182 = !{!1183, !1184, !1185}
!1183 = !DILocalVariable(name: "o", arg: 1, scope: !1179, file: !234, line: 159, type: !1119)
!1184 = !DILocalVariable(name: "i", arg: 2, scope: !1179, file: !234, line: 159, type: !30)
!1185 = !DILocalVariable(name: "r", scope: !1179, file: !234, line: 163, type: !30)
!1186 = !DILocation(line: 0, scope: !1179)
!1187 = !DILocation(line: 161, column: 8, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1179, file: !234, line: 161, column: 7)
!1189 = !DILocation(line: 161, column: 7, scope: !1179)
!1190 = !DILocation(line: 163, column: 14, scope: !1179)
!1191 = !{!1141, !516, i64 4}
!1192 = !DILocation(line: 164, column: 12, scope: !1179)
!1193 = !DILocation(line: 165, column: 3, scope: !1179)
!1194 = distinct !DISubprogram(name: "set_custom_quoting", scope: !234, file: !234, line: 169, type: !1195, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1197)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{null, !1119, !6, !6}
!1197 = !{!1198, !1199, !1200}
!1198 = !DILocalVariable(name: "o", arg: 1, scope: !1194, file: !234, line: 169, type: !1119)
!1199 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1194, file: !234, line: 170, type: !6)
!1200 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1194, file: !234, line: 170, type: !6)
!1201 = !DILocation(line: 0, scope: !1194)
