; ModuleID = 'src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"link\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1

!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !42, globals: !50, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "355a8a3740f0720795f10b09973f5dbc")
!11 = !{!12, !27}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !13, line: 42, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!16 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!17 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!18 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 46, baseType: !14, size: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "_ISupper", value: 256)
!31 = !DIEnumerator(name: "_ISlower", value: 512)
!32 = !DIEnumerator(name: "_ISalpha", value: 1024)
!33 = !DIEnumerator(name: "_ISdigit", value: 2048)
!34 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!35 = !DIEnumerator(name: "_ISspace", value: 8192)
!36 = !DIEnumerator(name: "_ISprint", value: 16384)
!37 = !DIEnumerator(name: "_ISgraph", value: 32768)
!38 = !DIEnumerator(name: "_ISblank", value: 1)
!39 = !DIEnumerator(name: "_IScntrl", value: 2)
!40 = !DIEnumerator(name: "_ISpunct", value: 4)
!41 = !DIEnumerator(name: "_ISalnum", value: 8)
!42 = !{!6, !43, !44, !45, !46, !49}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!48 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !{!0}
!51 = !{!52, !53, !54, !57, !59, !60, !61, !65, !66, !67, !68, !70, !127, !128, !129, !131, !132}
!52 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!53 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!54 = !DILocalVariable(name: "term", scope: !55, file: !3, line: 585, type: !6)
!55 = distinct !DILexicalBlock(scope: !56, file: !3, line: 582, column: 5)
!56 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!57 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !58)
!58 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!59 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!60 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!61 = !DILocalVariable(name: "s", scope: !62, file: !3, line: 608, type: !6)
!62 = distinct !DILexicalBlock(scope: !63, file: !3, line: 605, column: 5)
!63 = distinct !DILexicalBlock(scope: !64, file: !3, line: 604, column: 12)
!64 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!65 = !DILocalVariable(name: "spaces", scope: !62, file: !3, line: 609, type: !46)
!66 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !46)
!67 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!68 = !DILocalVariable(name: "__ptr", scope: !69, file: !3, line: 644, type: !6)
!69 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!70 = !DILocalVariable(name: "__stream", scope: !69, file: !3, line: 644, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 7, baseType: !74)
!73 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!76 = !{!77, !78, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !93, !95, !96, !97, !101, !102, !104, !108, !111, !113, !116, !119, !120, !121, !122, !123}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !44, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !79, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !79, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !79, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !79, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !79, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !79, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !79, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !79, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !79, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !79, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !94, size: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !44, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !44, size: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !98, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !99, line: 152, baseType: !100)
!99 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!100 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !45, size: 16, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !103, size: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !105, size: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !109, size: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !112, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !99, line: 153, baseType: !100)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !114, size: 64, offset: 1216)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !117, size: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !94, size: 64, offset: 1344)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !43, size: 64, offset: 1408)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !46, size: 64, offset: 1472)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !44, size: 32, offset: 1536)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !124, size: 160, offset: 1568)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 20)
!127 = !DILocalVariable(name: "__cnt", scope: !69, file: !3, line: 644, type: !46)
!128 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!129 = !DILocalVariable(name: "__ptr", scope: !130, file: !3, line: 686, type: !6)
!130 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!131 = !DILocalVariable(name: "__stream", scope: !130, file: !3, line: 686, type: !71)
!132 = !DILocalVariable(name: "__cnt", scope: !130, file: !3, line: 686, type: !46)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "Version", scope: !135, file: !136, line: 3, type: !6, isLocal: false, isDefinition: true)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !137, splitDebugInlining: false, nameTableKind: None)
!136 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!137 = !{!133}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "file_name", scope: !140, file: !141, line: 45, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !142, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!142 = !{!138, !143}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !140, file: !141, line: 55, type: !58, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !147, file: !148, line: 66, type: !183, isLocal: false, isDefinition: true)
!147 = distinct !DICompileUnit(language: DW_LANG_C99, file: !148, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !149, globals: !150, splitDebugInlining: false, nameTableKind: None)
!148 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!149 = !{!43, !49}
!150 = !{!151, !177, !145, !179, !181}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "old_file_name", scope: !153, file: !148, line: 304, type: !6, isLocal: true, isDefinition: true)
!153 = distinct !DISubprogram(name: "verror_at_line", scope: !148, file: !148, line: 298, type: !154, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !170)
!154 = !DISubroutineType(types: !155)
!155 = !{null, !44, !44, !6, !14, !6, !156}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !157, line: 52, baseType: !158)
!157 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !159, line: 32, baseType: !160)
!159 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !161, baseType: !162)
!161 = !DIFile(filename: "lib/error.c", directory: "/src")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !163, size: 256, elements: !164)
!163 = !DINamespace(name: "std", scope: null)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !162, file: !161, baseType: !43, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !162, file: !161, baseType: !43, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !162, file: !161, baseType: !43, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !162, file: !161, baseType: !44, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !162, file: !161, baseType: !44, size: 32, offset: 224)
!170 = !{!171, !172, !173, !174, !175, !176}
!171 = !DILocalVariable(name: "status", arg: 1, scope: !153, file: !148, line: 298, type: !44)
!172 = !DILocalVariable(name: "errnum", arg: 2, scope: !153, file: !148, line: 298, type: !44)
!173 = !DILocalVariable(name: "file_name", arg: 3, scope: !153, file: !148, line: 298, type: !6)
!174 = !DILocalVariable(name: "line_number", arg: 4, scope: !153, file: !148, line: 298, type: !14)
!175 = !DILocalVariable(name: "message", arg: 5, scope: !153, file: !148, line: 298, type: !6)
!176 = !DILocalVariable(name: "args", arg: 6, scope: !153, file: !148, line: 298, type: !156)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "old_line_number", scope: !153, file: !148, line: 305, type: !14, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "error_message_count", scope: !147, file: !148, line: 69, type: !14, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !147, file: !148, line: 295, type: !44, isLocal: false, isDefinition: true)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{null}
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "long_options", scope: !188, file: !189, line: 34, type: !191, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !190, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!190 = !{!186}
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 768, elements: !201)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !194, line: 50, size: 256, elements: !195)
!194 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!195 = !{!196, !197, !198, !200}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !194, line: 52, baseType: !6, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !193, file: !194, line: 55, baseType: !44, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !193, file: !194, line: 56, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !193, file: !194, line: 57, baseType: !44, size: 32, offset: 192)
!201 = !{!202}
!202 = !DISubrange(count: 3)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "program_name", scope: !205, file: !206, line: 31, type: !6, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !207, globals: !208, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!207 = !{!79}
!208 = !{!203}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "utf07FF", scope: !211, file: !212, line: 46, type: !242, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "proper_name_lite", scope: !212, file: !212, line: 38, type: !213, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !217)
!212 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!213 = !DISubroutineType(types: !214)
!214 = !{!6, !6, !6}
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !212, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !216, splitDebugInlining: false, nameTableKind: None)
!216 = !{!209}
!217 = !{!218, !219, !220, !221, !226}
!218 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !211, file: !212, line: 38, type: !6)
!219 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !211, file: !212, line: 38, type: !6)
!220 = !DILocalVariable(name: "translation", scope: !211, file: !212, line: 40, type: !6)
!221 = !DILocalVariable(name: "w", scope: !211, file: !212, line: 47, type: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !223, line: 37, baseType: !224)
!223 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !99, line: 57, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !99, line: 42, baseType: !14)
!226 = !DILocalVariable(name: "mbs", scope: !211, file: !212, line: 48, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !231, file: !230, line: 15, baseType: !44, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !231, file: !230, line: 20, baseType: !235, size: 32, offset: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !230, line: 16, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !235, file: !230, line: 18, baseType: !14, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !235, file: !230, line: 19, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 4)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 2)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !247, file: !248, line: 76, type: !316, isLocal: false, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !255, globals: !256, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!249 = !{!12, !250, !27}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !13, line: 254, baseType: !14, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!44, !45, !46}
!256 = !{!245, !257, !263, !275, !277, !282, !305, !312, !314}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !247, file: !248, line: 92, type: !259, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !247, file: !248, line: 1040, type: !265, isLocal: false, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !248, line: 56, size: 448, elements: !266)
!266 = !{!267, !268, !269, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !265, file: !248, line: 59, baseType: !12, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !248, line: 62, baseType: !44, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !265, file: !248, line: 66, baseType: !270, size: 256, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !265, file: !248, line: 69, baseType: !6, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !265, file: !248, line: 72, baseType: !6, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !247, file: !248, line: 107, type: !265, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !247, file: !248, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !248, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !248, file: !248, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!6, !6, !12}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !248, line: 197, type: !6)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !248, line: 197, type: !12)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !248, line: 199, type: !6)
!291 = !DILocalVariable(name: "w", scope: !284, file: !248, line: 229, type: !222)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !248, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !230, line: 15, baseType: !44, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !230, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !230, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !230, line: 18, baseType: !14, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !230, line: 19, baseType: !239, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !304)
!304 = !{!244, !241}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !247, file: !248, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !248, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !248, line: 825, baseType: !46, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !248, line: 826, baseType: !79, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !247, file: !248, line: 832, type: !44, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !247, file: !248, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !323, line: 26, type: !325, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!324 = !{!320}
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "exit_failure", scope: !330, file: !331, line: 24, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!332 = !{!328}
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !44)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "internal_state", scope: !336, file: !337, line: 97, type: !340, isLocal: true, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !339, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!338 = !{!43, !46, !49}
!339 = !{!334}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !228, line: 6, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !230, line: 21, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !230, line: 13, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !230, line: 15, baseType: !44, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !230, line: 20, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !230, line: 16, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !230, line: 18, baseType: !14, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !230, line: 19, baseType: !239, size: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !354, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !353, line: 40, baseType: !14, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!358 = !{!43}
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !361, retainedTypes: !392, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!361 = !{!362, !374}
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !363, file: !360, line: 188, baseType: !14, size: 32, elements: !372)
!363 = distinct !DISubprogram(name: "x2nrealloc", scope: !360, file: !360, line: 176, type: !364, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !367)
!364 = !DISubroutineType(types: !365)
!365 = !{!43, !43, !366, !46}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!367 = !{!368, !369, !370, !371}
!368 = !DILocalVariable(name: "p", arg: 1, scope: !363, file: !360, line: 176, type: !43)
!369 = !DILocalVariable(name: "pn", arg: 2, scope: !363, file: !360, line: 176, type: !366)
!370 = !DILocalVariable(name: "s", arg: 3, scope: !363, file: !360, line: 176, type: !46)
!371 = !DILocalVariable(name: "n", scope: !363, file: !360, line: 178, type: !46)
!372 = !{!373}
!373 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !375, file: !360, line: 228, baseType: !14, size: 32, elements: !372)
!375 = distinct !DISubprogram(name: "xpalloc", scope: !360, file: !360, line: 223, type: !376, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !382)
!376 = !DISubroutineType(types: !377)
!377 = !{!43, !43, !378, !379, !381, !379}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !380, line: 130, baseType: !381)
!380 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !47, line: 35, baseType: !100)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391}
!383 = !DILocalVariable(name: "pa", arg: 1, scope: !375, file: !360, line: 223, type: !43)
!384 = !DILocalVariable(name: "pn", arg: 2, scope: !375, file: !360, line: 223, type: !378)
!385 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !375, file: !360, line: 223, type: !379)
!386 = !DILocalVariable(name: "n_max", arg: 4, scope: !375, file: !360, line: 223, type: !381)
!387 = !DILocalVariable(name: "s", arg: 5, scope: !375, file: !360, line: 223, type: !379)
!388 = !DILocalVariable(name: "n0", scope: !375, file: !360, line: 230, type: !379)
!389 = !DILocalVariable(name: "n", scope: !375, file: !360, line: 237, type: !379)
!390 = !DILocalVariable(name: "nbytes", scope: !375, file: !360, line: 248, type: !379)
!391 = !DILocalVariable(name: "adjusted_nbytes", scope: !375, file: !360, line: 252, type: !379)
!392 = !{!79, !43, !58, !100, !48}
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!405 = !{!58, !48, !43}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!412 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!413 = !{i32 7, !"Dwarf Version", i32 5}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{i32 1, !"branch-target-enforcement", i32 0}
!417 = !{i32 1, !"sign-return-address", i32 0}
!418 = !{i32 1, !"sign-return-address-all", i32 0}
!419 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!420 = !{i32 7, !"PIC Level", i32 2}
!421 = !{i32 7, !"PIE Level", i32 2}
!422 = !{i32 7, !"uwtable", i32 1}
!423 = !{i32 7, !"frame-pointer", i32 1}
!424 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 37, type: !425, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !44}
!427 = !{!428}
!428 = !DILocalVariable(name: "status", arg: 1, scope: !424, file: !10, line: 37, type: !44)
!429 = !DILocation(line: 0, scope: !424)
!430 = !DILocation(line: 39, column: 14, scope: !431)
!431 = distinct !DILexicalBlock(scope: !424, file: !10, line: 39, column: 7)
!432 = !DILocation(line: 39, column: 7, scope: !424)
!433 = !DILocation(line: 40, column: 5, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !10, line: 40, column: 5)
!435 = !{!436, !436, i64 0}
!436 = !{!"any pointer", !437, i64 0}
!437 = !{!"omnipotent char", !438, i64 0}
!438 = !{!"Simple C/C++ TBAA"}
!439 = !DILocation(line: 43, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !431, file: !10, line: 42, column: 5)
!441 = !DILocation(line: 46, column: 7, scope: !440)
!442 = !DILocation(line: 49, column: 7, scope: !440)
!443 = !DILocation(line: 50, column: 7, scope: !440)
!444 = !DILocalVariable(name: "program", arg: 1, scope: !445, file: !3, line: 836, type: !6)
!445 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !446, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !6}
!448 = !{!444, !449, !458, !459, !461, !462}
!449 = !DILocalVariable(name: "infomap", scope: !445, file: !3, line: 838, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 896, elements: !456)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !445, file: !3, line: 838, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !452, file: !3, line: 838, baseType: !6, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !452, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!456 = !{!457}
!457 = !DISubrange(count: 7)
!458 = !DILocalVariable(name: "node", scope: !445, file: !3, line: 848, type: !6)
!459 = !DILocalVariable(name: "map_prog", scope: !445, file: !3, line: 849, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!461 = !DILocalVariable(name: "lc_messages", scope: !445, file: !3, line: 861, type: !6)
!462 = !DILocalVariable(name: "url_program", scope: !445, file: !3, line: 874, type: !6)
!463 = !DILocation(line: 0, scope: !445, inlinedAt: !464)
!464 = distinct !DILocation(line: 51, column: 7, scope: !440)
!465 = !DILocation(line: 838, column: 3, scope: !445, inlinedAt: !464)
!466 = !DILocation(line: 838, column: 67, scope: !445, inlinedAt: !464)
!467 = !DILocation(line: 849, column: 36, scope: !445, inlinedAt: !464)
!468 = !DILocation(line: 851, column: 3, scope: !445, inlinedAt: !464)
!469 = !DILocalVariable(name: "__s1", arg: 1, scope: !470, file: !471, line: 1359, type: !6)
!470 = distinct !DISubprogram(name: "streq", scope: !471, file: !471, line: 1359, type: !472, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !474)
!471 = !DIFile(filename: "./lib/string.h", directory: "/src")
!472 = !DISubroutineType(types: !473)
!473 = !{!58, !6, !6}
!474 = !{!469, !475}
!475 = !DILocalVariable(name: "__s2", arg: 2, scope: !470, file: !471, line: 1359, type: !6)
!476 = !DILocation(line: 0, scope: !470, inlinedAt: !477)
!477 = distinct !DILocation(line: 851, column: 33, scope: !445, inlinedAt: !464)
!478 = !DILocation(line: 1361, column: 11, scope: !470, inlinedAt: !477)
!479 = !DILocation(line: 1361, column: 10, scope: !470, inlinedAt: !477)
!480 = !DILocation(line: 852, column: 13, scope: !445, inlinedAt: !464)
!481 = !DILocation(line: 851, column: 20, scope: !445, inlinedAt: !464)
!482 = !{!483, !436, i64 0}
!483 = !{!"infomap", !436, i64 0, !436, i64 8}
!484 = !DILocation(line: 851, column: 10, scope: !445, inlinedAt: !464)
!485 = !DILocation(line: 851, column: 28, scope: !445, inlinedAt: !464)
!486 = distinct !{!486, !468, !480, !487}
!487 = !{!"llvm.loop.mustprogress"}
!488 = !DILocation(line: 854, column: 17, scope: !489, inlinedAt: !464)
!489 = distinct !DILexicalBlock(scope: !445, file: !3, line: 854, column: 7)
!490 = !{!483, !436, i64 8}
!491 = !DILocation(line: 854, column: 7, scope: !489, inlinedAt: !464)
!492 = !DILocation(line: 854, column: 7, scope: !445, inlinedAt: !464)
!493 = !DILocation(line: 857, column: 3, scope: !445, inlinedAt: !464)
!494 = !DILocation(line: 861, column: 29, scope: !445, inlinedAt: !464)
!495 = !DILocation(line: 862, column: 7, scope: !496, inlinedAt: !464)
!496 = distinct !DILexicalBlock(scope: !445, file: !3, line: 862, column: 7)
!497 = !DILocation(line: 862, column: 19, scope: !496, inlinedAt: !464)
!498 = !DILocation(line: 862, column: 22, scope: !496, inlinedAt: !464)
!499 = !DILocation(line: 862, column: 7, scope: !445, inlinedAt: !464)
!500 = !DILocation(line: 868, column: 7, scope: !501, inlinedAt: !464)
!501 = distinct !DILexicalBlock(scope: !496, file: !3, line: 863, column: 5)
!502 = !DILocation(line: 870, column: 5, scope: !501, inlinedAt: !464)
!503 = !DILocation(line: 0, scope: !470, inlinedAt: !504)
!504 = distinct !DILocation(line: 874, column: 29, scope: !445, inlinedAt: !464)
!505 = !DILocation(line: 875, column: 3, scope: !445, inlinedAt: !464)
!506 = !DILocation(line: 877, column: 3, scope: !445, inlinedAt: !464)
!507 = !DILocation(line: 879, column: 1, scope: !445, inlinedAt: !464)
!508 = !DILocation(line: 53, column: 3, scope: !424)
!509 = !DISubprogram(name: "dcgettext", scope: !510, file: !510, line: 51, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!510 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!511 = !DISubroutineType(types: !512)
!512 = !{!79, !6, !6, !44}
!513 = !{}
!514 = !DISubprogram(name: "fputs_unlocked", scope: !157, file: !157, line: 691, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!515 = !DISubroutineType(types: !516)
!516 = !{!44, !517, !518}
!517 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!518 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!519 = !DILocation(line: 0, scope: !2)
!520 = !DILocation(line: 581, column: 7, scope: !56)
!521 = !{!522, !522, i64 0}
!522 = !{!"int", !437, i64 0}
!523 = !DILocation(line: 581, column: 19, scope: !56)
!524 = !DILocation(line: 581, column: 7, scope: !2)
!525 = !DILocation(line: 585, column: 26, scope: !55)
!526 = !DILocation(line: 0, scope: !55)
!527 = !DILocation(line: 586, column: 23, scope: !55)
!528 = !DILocation(line: 586, column: 28, scope: !55)
!529 = !DILocation(line: 586, column: 32, scope: !55)
!530 = !{!437, !437, i64 0}
!531 = !DILocation(line: 586, column: 38, scope: !55)
!532 = !DILocation(line: 0, scope: !470, inlinedAt: !533)
!533 = distinct !DILocation(line: 586, column: 41, scope: !55)
!534 = !DILocation(line: 1361, column: 11, scope: !470, inlinedAt: !533)
!535 = !DILocation(line: 1361, column: 10, scope: !470, inlinedAt: !533)
!536 = !DILocation(line: 586, column: 19, scope: !55)
!537 = !DILocation(line: 587, column: 5, scope: !55)
!538 = !DILocation(line: 588, column: 7, scope: !539)
!539 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!540 = !DILocation(line: 588, column: 7, scope: !2)
!541 = !DILocation(line: 590, column: 7, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !3, line: 589, column: 5)
!543 = !DILocation(line: 591, column: 7, scope: !542)
!544 = !DILocation(line: 595, column: 37, scope: !2)
!545 = !DILocation(line: 595, column: 35, scope: !2)
!546 = !DILocation(line: 596, column: 29, scope: !2)
!547 = !DILocation(line: 597, column: 8, scope: !64)
!548 = !DILocation(line: 597, column: 7, scope: !2)
!549 = !DILocation(line: 604, column: 24, scope: !63)
!550 = !DILocation(line: 604, column: 12, scope: !64)
!551 = !DILocation(line: 0, scope: !62)
!552 = !DILocation(line: 610, column: 16, scope: !62)
!553 = !DILocation(line: 610, column: 7, scope: !62)
!554 = !DILocation(line: 611, column: 21, scope: !62)
!555 = !{!556, !556, i64 0}
!556 = !{!"short", !437, i64 0}
!557 = !DILocation(line: 611, column: 19, scope: !62)
!558 = !DILocation(line: 611, column: 16, scope: !62)
!559 = !DILocation(line: 610, column: 30, scope: !62)
!560 = distinct !{!560, !553, !554, !487}
!561 = !DILocation(line: 612, column: 18, scope: !562)
!562 = distinct !DILexicalBlock(scope: !62, file: !3, line: 612, column: 11)
!563 = !DILocation(line: 612, column: 11, scope: !62)
!564 = !DILocation(line: 620, column: 23, scope: !2)
!565 = !DILocation(line: 625, column: 39, scope: !2)
!566 = !DILocation(line: 626, column: 3, scope: !2)
!567 = !DILocation(line: 626, column: 10, scope: !2)
!568 = !DILocation(line: 626, column: 21, scope: !2)
!569 = !DILocation(line: 628, column: 44, scope: !570)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 628, column: 11)
!571 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!572 = !DILocation(line: 628, column: 32, scope: !570)
!573 = !DILocation(line: 628, column: 49, scope: !570)
!574 = !DILocation(line: 628, column: 11, scope: !571)
!575 = !DILocation(line: 630, column: 11, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !3, line: 630, column: 11)
!577 = !DILocation(line: 630, column: 11, scope: !571)
!578 = !DILocation(line: 632, column: 26, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 632, column: 15)
!580 = distinct !DILexicalBlock(scope: !576, file: !3, line: 631, column: 9)
!581 = !DILocation(line: 632, column: 34, scope: !579)
!582 = !DILocation(line: 632, column: 37, scope: !579)
!583 = !DILocation(line: 632, column: 15, scope: !580)
!584 = !DILocation(line: 636, column: 29, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !3, line: 636, column: 15)
!586 = !DILocation(line: 640, column: 16, scope: !571)
!587 = distinct !{!587, !566, !588, !487}
!588 = !DILocation(line: 641, column: 5, scope: !2)
!589 = !DILocation(line: 644, column: 3, scope: !2)
!590 = !DILocation(line: 0, scope: !470, inlinedAt: !591)
!591 = distinct !DILocation(line: 648, column: 31, scope: !2)
!592 = !DILocation(line: 0, scope: !470, inlinedAt: !593)
!593 = distinct !DILocation(line: 649, column: 31, scope: !2)
!594 = !DILocation(line: 0, scope: !470, inlinedAt: !595)
!595 = distinct !DILocation(line: 650, column: 31, scope: !2)
!596 = !DILocation(line: 0, scope: !470, inlinedAt: !597)
!597 = distinct !DILocation(line: 651, column: 31, scope: !2)
!598 = !DILocation(line: 0, scope: !470, inlinedAt: !599)
!599 = distinct !DILocation(line: 652, column: 31, scope: !2)
!600 = !DILocation(line: 0, scope: !470, inlinedAt: !601)
!601 = distinct !DILocation(line: 653, column: 31, scope: !2)
!602 = !DILocation(line: 0, scope: !470, inlinedAt: !603)
!603 = distinct !DILocation(line: 654, column: 31, scope: !2)
!604 = !DILocation(line: 0, scope: !470, inlinedAt: !605)
!605 = distinct !DILocation(line: 655, column: 31, scope: !2)
!606 = !DILocation(line: 0, scope: !470, inlinedAt: !607)
!607 = distinct !DILocation(line: 656, column: 31, scope: !2)
!608 = !DILocation(line: 0, scope: !470, inlinedAt: !609)
!609 = distinct !DILocation(line: 657, column: 31, scope: !2)
!610 = !DILocation(line: 663, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!612 = !DILocation(line: 664, column: 7, scope: !611)
!613 = !DILocation(line: 664, column: 10, scope: !611)
!614 = !DILocation(line: 663, column: 7, scope: !2)
!615 = !DILocation(line: 669, column: 7, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !3, line: 665, column: 5)
!617 = !DILocation(line: 671, column: 5, scope: !616)
!618 = !DILocation(line: 676, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !611, file: !3, line: 673, column: 5)
!620 = !DILocation(line: 679, column: 3, scope: !2)
!621 = !DILocation(line: 683, column: 3, scope: !2)
!622 = !DILocation(line: 686, column: 3, scope: !2)
!623 = !DILocation(line: 688, column: 3, scope: !2)
!624 = !DILocation(line: 691, column: 3, scope: !2)
!625 = !DILocation(line: 695, column: 3, scope: !2)
!626 = !DILocation(line: 696, column: 1, scope: !2)
!627 = !DISubprogram(name: "setlocale", scope: !628, file: !628, line: 122, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!628 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!629 = !DISubroutineType(types: !630)
!630 = !{!79, !44, !6}
!631 = !DISubprogram(name: "getenv", scope: !632, file: !632, line: 641, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!632 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!633 = !DISubroutineType(types: !634)
!634 = !{!79, !6}
!635 = !DISubprogram(name: "fwrite_unlocked", scope: !157, file: !157, line: 704, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!636 = !DISubroutineType(types: !637)
!637 = !{!46, !638, !46, !46, !518}
!638 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!641 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 57, type: !642, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !645)
!642 = !DISubroutineType(types: !643)
!643 = !{!44, !44, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!645 = !{!646, !647}
!646 = !DILocalVariable(name: "argc", arg: 1, scope: !641, file: !10, line: 57, type: !44)
!647 = !DILocalVariable(name: "argv", arg: 2, scope: !641, file: !10, line: 57, type: !644)
!648 = !DILocation(line: 0, scope: !641)
!649 = !DILocation(line: 60, column: 21, scope: !641)
!650 = !DILocation(line: 60, column: 3, scope: !641)
!651 = !DILocation(line: 61, column: 3, scope: !641)
!652 = !DILocation(line: 62, column: 3, scope: !641)
!653 = !DILocation(line: 63, column: 3, scope: !641)
!654 = !DILocation(line: 65, column: 3, scope: !641)
!655 = !DILocation(line: 68, column: 36, scope: !641)
!656 = !DILocation(line: 68, column: 58, scope: !641)
!657 = !DILocation(line: 67, column: 3, scope: !641)
!658 = !DILocation(line: 71, column: 14, scope: !659)
!659 = distinct !DILexicalBlock(scope: !641, file: !10, line: 71, column: 7)
!660 = !DILocation(line: 71, column: 21, scope: !659)
!661 = !DILocation(line: 71, column: 12, scope: !659)
!662 = !DILocation(line: 71, column: 7, scope: !641)
!663 = !DILocation(line: 73, column: 16, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !10, line: 73, column: 11)
!665 = distinct !DILexicalBlock(scope: !659, file: !10, line: 72, column: 5)
!666 = !DILocation(line: 73, column: 11, scope: !665)
!667 = !DILocation(line: 74, column: 9, scope: !664)
!668 = !DILocation(line: 76, column: 9, scope: !664)
!669 = !DILocation(line: 77, column: 7, scope: !665)
!670 = !DILocation(line: 80, column: 18, scope: !671)
!671 = distinct !DILexicalBlock(scope: !641, file: !10, line: 80, column: 7)
!672 = !DILocation(line: 80, column: 7, scope: !641)
!673 = !DILocation(line: 82, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !671, file: !10, line: 81, column: 5)
!675 = !DILocation(line: 83, column: 7, scope: !674)
!676 = !DILocation(line: 86, column: 13, scope: !677)
!677 = distinct !DILexicalBlock(scope: !641, file: !10, line: 86, column: 7)
!678 = !DILocation(line: 86, column: 39, scope: !677)
!679 = !DILocation(line: 86, column: 27, scope: !677)
!680 = !DILocation(line: 86, column: 7, scope: !677)
!681 = !DILocation(line: 86, column: 45, scope: !677)
!682 = !DILocation(line: 86, column: 7, scope: !641)
!683 = !DILocation(line: 87, column: 5, scope: !677)
!684 = !DILocation(line: 90, column: 3, scope: !641)
!685 = !DISubprogram(name: "bindtextdomain", scope: !510, file: !510, line: 86, type: !686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!686 = !DISubroutineType(types: !687)
!687 = !{!79, !6, !6}
!688 = !DISubprogram(name: "textdomain", scope: !510, file: !510, line: 82, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!689 = !DISubprogram(name: "atexit", scope: !632, file: !632, line: 602, type: !690, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!690 = !DISubroutineType(types: !691)
!691 = !{!44, !183}
!692 = !DISubprogram(name: "link", scope: !693, file: !693, line: 819, type: !694, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!693 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!694 = !DISubroutineType(types: !695)
!695 = !{!44, !6, !6}
!696 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !141, file: !141, line: 50, type: !446, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !697)
!697 = !{!698}
!698 = !DILocalVariable(name: "file", arg: 1, scope: !696, file: !141, line: 50, type: !6)
!699 = !DILocation(line: 0, scope: !696)
!700 = !DILocation(line: 52, column: 13, scope: !696)
!701 = !DILocation(line: 53, column: 1, scope: !696)
!702 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !141, file: !141, line: 87, type: !703, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !58}
!705 = !{!706}
!706 = !DILocalVariable(name: "ignore", arg: 1, scope: !702, file: !141, line: 87, type: !58)
!707 = !DILocation(line: 0, scope: !702)
!708 = !DILocation(line: 89, column: 16, scope: !702)
!709 = !{!710, !710, i64 0}
!710 = !{!"_Bool", !437, i64 0}
!711 = !DILocation(line: 90, column: 1, scope: !702)
!712 = distinct !DISubprogram(name: "close_stdout", scope: !141, file: !141, line: 116, type: !184, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !140, retainedNodes: !713)
!713 = !{!714}
!714 = !DILocalVariable(name: "write_error", scope: !715, file: !141, line: 121, type: !6)
!715 = distinct !DILexicalBlock(scope: !716, file: !141, line: 120, column: 5)
!716 = distinct !DILexicalBlock(scope: !712, file: !141, line: 118, column: 7)
!717 = !DILocation(line: 118, column: 21, scope: !716)
!718 = !DILocation(line: 118, column: 7, scope: !716)
!719 = !DILocation(line: 118, column: 29, scope: !716)
!720 = !DILocation(line: 119, column: 7, scope: !716)
!721 = !DILocation(line: 119, column: 12, scope: !716)
!722 = !{i8 0, i8 2}
!723 = !DILocation(line: 119, column: 25, scope: !716)
!724 = !DILocation(line: 119, column: 28, scope: !716)
!725 = !DILocation(line: 119, column: 34, scope: !716)
!726 = !DILocation(line: 118, column: 7, scope: !712)
!727 = !DILocation(line: 121, column: 33, scope: !715)
!728 = !DILocation(line: 0, scope: !715)
!729 = !DILocation(line: 122, column: 11, scope: !730)
!730 = distinct !DILexicalBlock(scope: !715, file: !141, line: 122, column: 11)
!731 = !DILocation(line: 0, scope: !730)
!732 = !DILocation(line: 122, column: 11, scope: !715)
!733 = !DILocation(line: 123, column: 9, scope: !730)
!734 = !DILocation(line: 126, column: 9, scope: !730)
!735 = !DILocation(line: 128, column: 14, scope: !715)
!736 = !DILocation(line: 128, column: 7, scope: !715)
!737 = !DILocation(line: 133, column: 42, scope: !738)
!738 = distinct !DILexicalBlock(scope: !712, file: !141, line: 133, column: 7)
!739 = !DILocation(line: 133, column: 28, scope: !738)
!740 = !DILocation(line: 133, column: 50, scope: !738)
!741 = !DILocation(line: 133, column: 7, scope: !712)
!742 = !DILocation(line: 134, column: 12, scope: !738)
!743 = !DILocation(line: 134, column: 5, scope: !738)
!744 = !DILocation(line: 135, column: 1, scope: !712)
!745 = distinct !DISubprogram(name: "verror", scope: !148, file: !148, line: 251, type: !746, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !44, !44, !6, !156}
!748 = !{!749, !750, !751, !752}
!749 = !DILocalVariable(name: "status", arg: 1, scope: !745, file: !148, line: 251, type: !44)
!750 = !DILocalVariable(name: "errnum", arg: 2, scope: !745, file: !148, line: 251, type: !44)
!751 = !DILocalVariable(name: "message", arg: 3, scope: !745, file: !148, line: 251, type: !6)
!752 = !DILocalVariable(name: "args", arg: 4, scope: !745, file: !148, line: 251, type: !156)
!753 = !DILocation(line: 0, scope: !745)
!754 = !DILocation(line: 251, column: 1, scope: !745)
!755 = !DILocation(line: 261, column: 3, scope: !745)
!756 = !DILocation(line: 265, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !745, file: !148, line: 265, column: 7)
!758 = !DILocation(line: 265, column: 7, scope: !745)
!759 = !DILocation(line: 266, column: 5, scope: !757)
!760 = !DILocation(line: 272, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !757, file: !148, line: 268, column: 5)
!762 = !DILocation(line: 276, column: 3, scope: !745)
!763 = !{i64 0, i64 8, !435, i64 8, i64 8, !435, i64 16, i64 8, !435, i64 24, i64 4, !521, i64 28, i64 4, !521}
!764 = !DILocation(line: 282, column: 1, scope: !745)
!765 = distinct !DISubprogram(name: "flush_stdout", scope: !148, file: !148, line: 163, type: !184, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !766)
!766 = !{!767}
!767 = !DILocalVariable(name: "stdout_fd", scope: !765, file: !148, line: 166, type: !44)
!768 = !DILocation(line: 0, scope: !765)
!769 = !DILocalVariable(name: "fd", arg: 1, scope: !770, file: !148, line: 145, type: !44)
!770 = distinct !DISubprogram(name: "is_open", scope: !148, file: !148, line: 145, type: !771, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{!44, !44}
!773 = !{!769}
!774 = !DILocation(line: 0, scope: !770, inlinedAt: !775)
!775 = distinct !DILocation(line: 182, column: 25, scope: !776)
!776 = distinct !DILexicalBlock(scope: !765, file: !148, line: 182, column: 7)
!777 = !DILocation(line: 157, column: 15, scope: !770, inlinedAt: !775)
!778 = !DILocation(line: 182, column: 25, scope: !776)
!779 = !DILocation(line: 182, column: 7, scope: !765)
!780 = !DILocation(line: 184, column: 5, scope: !776)
!781 = !DILocation(line: 185, column: 1, scope: !765)
!782 = distinct !DISubprogram(name: "error_tail", scope: !148, file: !148, line: 219, type: !746, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !783)
!783 = !{!784, !785, !786, !787}
!784 = !DILocalVariable(name: "status", arg: 1, scope: !782, file: !148, line: 219, type: !44)
!785 = !DILocalVariable(name: "errnum", arg: 2, scope: !782, file: !148, line: 219, type: !44)
!786 = !DILocalVariable(name: "message", arg: 3, scope: !782, file: !148, line: 219, type: !6)
!787 = !DILocalVariable(name: "args", arg: 4, scope: !782, file: !148, line: 219, type: !156)
!788 = !DILocation(line: 0, scope: !782)
!789 = !DILocation(line: 219, column: 1, scope: !782)
!790 = !DILocation(line: 229, column: 13, scope: !782)
!791 = !DILocation(line: 229, column: 3, scope: !782)
!792 = !DILocalVariable(name: "__stream", arg: 1, scope: !793, file: !794, line: 132, type: !797)
!793 = distinct !DISubprogram(name: "vfprintf", scope: !794, file: !794, line: 132, type: !795, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !832)
!794 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!795 = !DISubroutineType(types: !796)
!796 = !{!44, !797, !517, !158}
!797 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 7, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !800, file: !75, line: 51, baseType: !44, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !800, file: !75, line: 54, baseType: !79, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !800, file: !75, line: 55, baseType: !79, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !800, file: !75, line: 56, baseType: !79, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !800, file: !75, line: 57, baseType: !79, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !800, file: !75, line: 58, baseType: !79, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !800, file: !75, line: 59, baseType: !79, size: 64, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !800, file: !75, line: 60, baseType: !79, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !800, file: !75, line: 61, baseType: !79, size: 64, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !800, file: !75, line: 64, baseType: !79, size: 64, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !800, file: !75, line: 65, baseType: !79, size: 64, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !800, file: !75, line: 66, baseType: !79, size: 64, offset: 704)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !800, file: !75, line: 68, baseType: !91, size: 64, offset: 768)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !800, file: !75, line: 70, baseType: !816, size: 64, offset: 832)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !800, file: !75, line: 72, baseType: !44, size: 32, offset: 896)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !800, file: !75, line: 73, baseType: !44, size: 32, offset: 928)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !800, file: !75, line: 74, baseType: !98, size: 64, offset: 960)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !800, file: !75, line: 77, baseType: !45, size: 16, offset: 1024)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !800, file: !75, line: 78, baseType: !103, size: 8, offset: 1040)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !800, file: !75, line: 79, baseType: !105, size: 8, offset: 1048)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !800, file: !75, line: 81, baseType: !109, size: 64, offset: 1088)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !800, file: !75, line: 89, baseType: !112, size: 64, offset: 1152)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !800, file: !75, line: 91, baseType: !114, size: 64, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !800, file: !75, line: 92, baseType: !117, size: 64, offset: 1280)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !800, file: !75, line: 93, baseType: !816, size: 64, offset: 1344)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !800, file: !75, line: 94, baseType: !43, size: 64, offset: 1408)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !800, file: !75, line: 95, baseType: !46, size: 64, offset: 1472)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !800, file: !75, line: 96, baseType: !44, size: 32, offset: 1536)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !800, file: !75, line: 98, baseType: !124, size: 160, offset: 1568)
!832 = !{!792, !833, !834}
!833 = !DILocalVariable(name: "__fmt", arg: 2, scope: !793, file: !794, line: 133, type: !517)
!834 = !DILocalVariable(name: "__ap", arg: 3, scope: !793, file: !794, line: 133, type: !158)
!835 = !DILocation(line: 0, scope: !793, inlinedAt: !836)
!836 = distinct !DILocation(line: 229, column: 3, scope: !782)
!837 = !DILocation(line: 135, column: 10, scope: !793, inlinedAt: !836)
!838 = !{!839, !841}
!839 = distinct !{!839, !840, !"vfprintf.inline: argument 0"}
!840 = distinct !{!840, !"vfprintf.inline"}
!841 = distinct !{!841, !840, !"vfprintf.inline: argument 1"}
!842 = !DILocation(line: 232, column: 3, scope: !782)
!843 = !DILocation(line: 233, column: 7, scope: !844)
!844 = distinct !DILexicalBlock(scope: !782, file: !148, line: 233, column: 7)
!845 = !DILocation(line: 233, column: 7, scope: !782)
!846 = !DILocalVariable(name: "errnum", arg: 1, scope: !847, file: !148, line: 188, type: !44)
!847 = distinct !DISubprogram(name: "print_errno_message", scope: !148, file: !148, line: 188, type: !425, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !848)
!848 = !{!846, !849, !850}
!849 = !DILocalVariable(name: "s", scope: !847, file: !148, line: 190, type: !6)
!850 = !DILocalVariable(name: "errbuf", scope: !847, file: !148, line: 193, type: !851)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 1024)
!854 = !DILocation(line: 0, scope: !847, inlinedAt: !855)
!855 = distinct !DILocation(line: 234, column: 5, scope: !844)
!856 = !DILocation(line: 193, column: 3, scope: !847, inlinedAt: !855)
!857 = !DILocation(line: 193, column: 8, scope: !847, inlinedAt: !855)
!858 = !DILocation(line: 195, column: 7, scope: !847, inlinedAt: !855)
!859 = !DILocation(line: 207, column: 9, scope: !860, inlinedAt: !855)
!860 = distinct !DILexicalBlock(scope: !847, file: !148, line: 207, column: 7)
!861 = !DILocation(line: 207, column: 7, scope: !847, inlinedAt: !855)
!862 = !DILocation(line: 208, column: 9, scope: !860, inlinedAt: !855)
!863 = !DILocation(line: 208, column: 5, scope: !860, inlinedAt: !855)
!864 = !DILocation(line: 214, column: 3, scope: !847, inlinedAt: !855)
!865 = !DILocation(line: 216, column: 1, scope: !847, inlinedAt: !855)
!866 = !DILocation(line: 234, column: 5, scope: !844)
!867 = !DILocation(line: 238, column: 3, scope: !782)
!868 = !DILocalVariable(name: "__c", arg: 1, scope: !869, file: !870, line: 101, type: !44)
!869 = distinct !DISubprogram(name: "putc_unlocked", scope: !870, file: !870, line: 101, type: !871, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !873)
!870 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!871 = !DISubroutineType(types: !872)
!872 = !{!44, !44, !798}
!873 = !{!868, !874}
!874 = !DILocalVariable(name: "__stream", arg: 2, scope: !869, file: !870, line: 101, type: !798)
!875 = !DILocation(line: 0, scope: !869, inlinedAt: !876)
!876 = distinct !DILocation(line: 238, column: 3, scope: !782)
!877 = !DILocation(line: 103, column: 10, scope: !869, inlinedAt: !876)
!878 = !{!879, !436, i64 40}
!879 = !{!"_IO_FILE", !522, i64 0, !436, i64 8, !436, i64 16, !436, i64 24, !436, i64 32, !436, i64 40, !436, i64 48, !436, i64 56, !436, i64 64, !436, i64 72, !436, i64 80, !436, i64 88, !436, i64 96, !436, i64 104, !522, i64 112, !522, i64 116, !880, i64 120, !556, i64 128, !437, i64 130, !437, i64 131, !436, i64 136, !880, i64 144, !436, i64 152, !436, i64 160, !436, i64 168, !436, i64 176, !880, i64 184, !522, i64 192, !437, i64 196}
!880 = !{!"long", !437, i64 0}
!881 = !{!879, !436, i64 48}
!882 = !{!"branch_weights", i32 2000, i32 1}
!883 = !DILocation(line: 240, column: 3, scope: !782)
!884 = !DILocation(line: 241, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !782, file: !148, line: 241, column: 7)
!886 = !DILocation(line: 241, column: 7, scope: !782)
!887 = !DILocation(line: 242, column: 5, scope: !885)
!888 = !DILocation(line: 243, column: 1, scope: !782)
!889 = !DISubprogram(name: "strerror_r", scope: !890, file: !890, line: 444, type: !891, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!890 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!891 = !DISubroutineType(types: !892)
!892 = !{!79, !44, !79, !46}
!893 = !DISubprogram(name: "fflush_unlocked", scope: !157, file: !157, line: 239, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!894 = !DISubroutineType(types: !895)
!895 = !{!44, !798}
!896 = !DISubprogram(name: "fcntl", scope: !897, file: !897, line: 149, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!897 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!898 = !DISubroutineType(types: !899)
!899 = !{!44, !44, !44, null}
!900 = distinct !DISubprogram(name: "error", scope: !148, file: !148, line: 285, type: !901, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !903)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !44, !44, !6, null}
!903 = !{!904, !905, !906, !907}
!904 = !DILocalVariable(name: "status", arg: 1, scope: !900, file: !148, line: 285, type: !44)
!905 = !DILocalVariable(name: "errnum", arg: 2, scope: !900, file: !148, line: 285, type: !44)
!906 = !DILocalVariable(name: "message", arg: 3, scope: !900, file: !148, line: 285, type: !6)
!907 = !DILocalVariable(name: "ap", scope: !900, file: !148, line: 287, type: !156)
!908 = !DILocation(line: 0, scope: !900)
!909 = !DILocation(line: 287, column: 3, scope: !900)
!910 = !DILocation(line: 287, column: 11, scope: !900)
!911 = !DILocation(line: 288, column: 3, scope: !900)
!912 = !DILocation(line: 289, column: 3, scope: !900)
!913 = !DILocation(line: 290, column: 3, scope: !900)
!914 = !DILocation(line: 291, column: 1, scope: !900)
!915 = !DILocation(line: 0, scope: !153)
!916 = !DILocation(line: 298, column: 1, scope: !153)
!917 = !DILocation(line: 302, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !153, file: !148, line: 302, column: 7)
!919 = !DILocation(line: 302, column: 7, scope: !153)
!920 = !DILocation(line: 307, column: 11, scope: !921)
!921 = distinct !DILexicalBlock(scope: !922, file: !148, line: 307, column: 11)
!922 = distinct !DILexicalBlock(scope: !918, file: !148, line: 303, column: 5)
!923 = !DILocation(line: 307, column: 27, scope: !921)
!924 = !DILocation(line: 308, column: 11, scope: !921)
!925 = !DILocation(line: 308, column: 28, scope: !921)
!926 = !DILocation(line: 308, column: 25, scope: !921)
!927 = !DILocation(line: 309, column: 15, scope: !921)
!928 = !DILocation(line: 309, column: 33, scope: !921)
!929 = !DILocation(line: 310, column: 19, scope: !921)
!930 = !DILocation(line: 311, column: 22, scope: !921)
!931 = !DILocation(line: 311, column: 56, scope: !921)
!932 = !DILocation(line: 307, column: 11, scope: !922)
!933 = !DILocation(line: 316, column: 21, scope: !922)
!934 = !DILocation(line: 317, column: 23, scope: !922)
!935 = !DILocation(line: 318, column: 5, scope: !922)
!936 = !DILocation(line: 327, column: 3, scope: !153)
!937 = !DILocation(line: 331, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !153, file: !148, line: 331, column: 7)
!939 = !DILocation(line: 331, column: 7, scope: !153)
!940 = !DILocation(line: 332, column: 5, scope: !938)
!941 = !DILocation(line: 338, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !938, file: !148, line: 334, column: 5)
!943 = !DILocation(line: 346, column: 3, scope: !153)
!944 = !DILocation(line: 350, column: 3, scope: !153)
!945 = !DILocation(line: 356, column: 1, scope: !153)
!946 = distinct !DISubprogram(name: "error_at_line", scope: !148, file: !148, line: 359, type: !947, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !147, retainedNodes: !949)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !44, !44, !6, !14, !6, null}
!949 = !{!950, !951, !952, !953, !954, !955}
!950 = !DILocalVariable(name: "status", arg: 1, scope: !946, file: !148, line: 359, type: !44)
!951 = !DILocalVariable(name: "errnum", arg: 2, scope: !946, file: !148, line: 359, type: !44)
!952 = !DILocalVariable(name: "file_name", arg: 3, scope: !946, file: !148, line: 359, type: !6)
!953 = !DILocalVariable(name: "line_number", arg: 4, scope: !946, file: !148, line: 360, type: !14)
!954 = !DILocalVariable(name: "message", arg: 5, scope: !946, file: !148, line: 360, type: !6)
!955 = !DILocalVariable(name: "ap", scope: !946, file: !148, line: 362, type: !156)
!956 = !DILocation(line: 0, scope: !946)
!957 = !DILocation(line: 362, column: 3, scope: !946)
!958 = !DILocation(line: 362, column: 11, scope: !946)
!959 = !DILocation(line: 363, column: 3, scope: !946)
!960 = !DILocation(line: 364, column: 3, scope: !946)
!961 = !DILocation(line: 366, column: 3, scope: !946)
!962 = !DILocation(line: 367, column: 1, scope: !946)
!963 = distinct !DISubprogram(name: "getprogname", scope: !351, file: !351, line: 54, type: !964, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !513)
!964 = !DISubroutineType(types: !965)
!965 = !{!6}
!966 = !DILocation(line: 58, column: 10, scope: !963)
!967 = !DILocation(line: 58, column: 3, scope: !963)
!968 = distinct !DISubprogram(name: "parse_long_options", scope: !189, file: !189, line: 45, type: !969, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !972)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !44, !644, !6, !6, !6, !971, null}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !983}
!973 = !DILocalVariable(name: "argc", arg: 1, scope: !968, file: !189, line: 45, type: !44)
!974 = !DILocalVariable(name: "argv", arg: 2, scope: !968, file: !189, line: 46, type: !644)
!975 = !DILocalVariable(name: "command_name", arg: 3, scope: !968, file: !189, line: 47, type: !6)
!976 = !DILocalVariable(name: "package", arg: 4, scope: !968, file: !189, line: 48, type: !6)
!977 = !DILocalVariable(name: "version", arg: 5, scope: !968, file: !189, line: 49, type: !6)
!978 = !DILocalVariable(name: "usage_func", arg: 6, scope: !968, file: !189, line: 50, type: !971)
!979 = !DILocalVariable(name: "saved_opterr", scope: !968, file: !189, line: 53, type: !44)
!980 = !DILocalVariable(name: "c", scope: !981, file: !189, line: 60, type: !44)
!981 = distinct !DILexicalBlock(scope: !982, file: !189, line: 59, column: 5)
!982 = distinct !DILexicalBlock(scope: !968, file: !189, line: 58, column: 7)
!983 = !DILocalVariable(name: "authors", scope: !984, file: !189, line: 71, type: !988)
!984 = distinct !DILexicalBlock(scope: !985, file: !189, line: 70, column: 15)
!985 = distinct !DILexicalBlock(scope: !986, file: !189, line: 64, column: 13)
!986 = distinct !DILexicalBlock(scope: !987, file: !189, line: 62, column: 9)
!987 = distinct !DILexicalBlock(scope: !981, file: !189, line: 61, column: 11)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !157, line: 52, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !159, line: 32, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !991, baseType: !992)
!991 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !163, size: 256, elements: !993)
!993 = !{!994, !995, !996, !997, !998}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !992, file: !991, line: 71, baseType: !43, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !992, file: !991, line: 71, baseType: !43, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !992, file: !991, line: 71, baseType: !43, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !992, file: !991, line: 71, baseType: !44, size: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !992, file: !991, line: 71, baseType: !44, size: 32, offset: 224)
!999 = !DILocation(line: 0, scope: !968)
!1000 = !DILocation(line: 53, column: 22, scope: !968)
!1001 = !DILocation(line: 56, column: 10, scope: !968)
!1002 = !DILocation(line: 58, column: 12, scope: !982)
!1003 = !DILocation(line: 58, column: 7, scope: !968)
!1004 = !DILocation(line: 60, column: 15, scope: !981)
!1005 = !DILocation(line: 0, scope: !981)
!1006 = !DILocation(line: 61, column: 11, scope: !981)
!1007 = !DILocation(line: 66, column: 15, scope: !985)
!1008 = !DILocation(line: 67, column: 15, scope: !985)
!1009 = !DILocation(line: 71, column: 17, scope: !984)
!1010 = !DILocation(line: 71, column: 25, scope: !984)
!1011 = !DILocation(line: 72, column: 17, scope: !984)
!1012 = !DILocation(line: 73, column: 33, scope: !984)
!1013 = !DILocation(line: 73, column: 17, scope: !984)
!1014 = !DILocation(line: 74, column: 17, scope: !984)
!1015 = !DILocation(line: 85, column: 10, scope: !968)
!1016 = !DILocation(line: 89, column: 10, scope: !968)
!1017 = !DILocation(line: 90, column: 1, scope: !968)
!1018 = !DISubprogram(name: "getopt_long", scope: !194, file: !194, line: 66, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!44, !44, !1021, !6, !1023, !199}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!1024 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !189, file: !189, line: 98, type: !1025, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !44, !644, !6, !6, !6, !58, !971, null}
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038}
!1028 = !DILocalVariable(name: "argc", arg: 1, scope: !1024, file: !189, line: 98, type: !44)
!1029 = !DILocalVariable(name: "argv", arg: 2, scope: !1024, file: !189, line: 99, type: !644)
!1030 = !DILocalVariable(name: "command_name", arg: 3, scope: !1024, file: !189, line: 100, type: !6)
!1031 = !DILocalVariable(name: "package", arg: 4, scope: !1024, file: !189, line: 101, type: !6)
!1032 = !DILocalVariable(name: "version", arg: 5, scope: !1024, file: !189, line: 102, type: !6)
!1033 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1024, file: !189, line: 103, type: !58)
!1034 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1024, file: !189, line: 104, type: !971)
!1035 = !DILocalVariable(name: "saved_opterr", scope: !1024, file: !189, line: 107, type: !44)
!1036 = !DILocalVariable(name: "optstring", scope: !1024, file: !189, line: 112, type: !6)
!1037 = !DILocalVariable(name: "c", scope: !1024, file: !189, line: 114, type: !44)
!1038 = !DILocalVariable(name: "authors", scope: !1039, file: !189, line: 125, type: !988)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !189, line: 124, column: 11)
!1040 = distinct !DILexicalBlock(scope: !1041, file: !189, line: 118, column: 9)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !189, line: 116, column: 5)
!1042 = distinct !DILexicalBlock(scope: !1024, file: !189, line: 115, column: 7)
!1043 = !DILocation(line: 0, scope: !1024)
!1044 = !DILocation(line: 107, column: 22, scope: !1024)
!1045 = !DILocation(line: 110, column: 10, scope: !1024)
!1046 = !DILocation(line: 112, column: 27, scope: !1024)
!1047 = !DILocation(line: 114, column: 11, scope: !1024)
!1048 = !DILocation(line: 115, column: 7, scope: !1024)
!1049 = !DILocation(line: 125, column: 13, scope: !1039)
!1050 = !DILocation(line: 125, column: 21, scope: !1039)
!1051 = !DILocation(line: 126, column: 13, scope: !1039)
!1052 = !DILocation(line: 127, column: 29, scope: !1039)
!1053 = !DILocation(line: 127, column: 13, scope: !1039)
!1054 = !DILocation(line: 128, column: 13, scope: !1039)
!1055 = !DILocation(line: 132, column: 26, scope: !1040)
!1056 = !DILocation(line: 133, column: 11, scope: !1040)
!1057 = !DILocation(line: 0, scope: !1040)
!1058 = !DILocation(line: 138, column: 10, scope: !1024)
!1059 = !DILocation(line: 139, column: 1, scope: !1024)
!1060 = distinct !DISubprogram(name: "set_program_name", scope: !206, file: !206, line: 37, type: !446, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DILocalVariable(name: "argv0", arg: 1, scope: !1060, file: !206, line: 37, type: !6)
!1063 = !DILocalVariable(name: "slash", scope: !1060, file: !206, line: 44, type: !6)
!1064 = !DILocalVariable(name: "base", scope: !1060, file: !206, line: 45, type: !6)
!1065 = !DILocation(line: 0, scope: !1060)
!1066 = !DILocation(line: 44, column: 23, scope: !1060)
!1067 = !DILocation(line: 45, column: 22, scope: !1060)
!1068 = !DILocation(line: 46, column: 17, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1060, file: !206, line: 46, column: 7)
!1070 = !DILocation(line: 46, column: 9, scope: !1069)
!1071 = !DILocation(line: 46, column: 25, scope: !1069)
!1072 = !DILocation(line: 46, column: 40, scope: !1069)
!1073 = !DILocalVariable(name: "__s1", arg: 1, scope: !1074, file: !471, line: 974, type: !639)
!1074 = distinct !DISubprogram(name: "memeq", scope: !471, file: !471, line: 974, type: !1075, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!58, !639, !639, !46}
!1077 = !{!1073, !1078, !1079}
!1078 = !DILocalVariable(name: "__s2", arg: 2, scope: !1074, file: !471, line: 974, type: !639)
!1079 = !DILocalVariable(name: "__n", arg: 3, scope: !1074, file: !471, line: 974, type: !46)
!1080 = !DILocation(line: 0, scope: !1074, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 46, column: 28, scope: !1069)
!1082 = !DILocation(line: 976, column: 11, scope: !1074, inlinedAt: !1081)
!1083 = !DILocation(line: 976, column: 10, scope: !1074, inlinedAt: !1081)
!1084 = !DILocation(line: 46, column: 7, scope: !1060)
!1085 = !DILocation(line: 49, column: 11, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !206, line: 49, column: 11)
!1087 = distinct !DILexicalBlock(scope: !1069, file: !206, line: 47, column: 5)
!1088 = !DILocation(line: 49, column: 36, scope: !1086)
!1089 = !DILocation(line: 49, column: 11, scope: !1087)
!1090 = !DILocation(line: 65, column: 16, scope: !1060)
!1091 = !DILocation(line: 71, column: 27, scope: !1060)
!1092 = !DILocation(line: 74, column: 33, scope: !1060)
!1093 = !DILocation(line: 76, column: 1, scope: !1060)
!1094 = !DILocation(line: 0, scope: !211)
!1095 = !DILocation(line: 40, column: 29, scope: !211)
!1096 = !DILocation(line: 41, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !211, file: !212, line: 41, column: 7)
!1098 = !DILocation(line: 41, column: 7, scope: !211)
!1099 = !DILocation(line: 47, column: 3, scope: !211)
!1100 = !DILocation(line: 48, column: 3, scope: !211)
!1101 = !DILocation(line: 48, column: 13, scope: !211)
!1102 = !DILocalVariable(name: "ps", arg: 1, scope: !1103, file: !1104, line: 1135, type: !1107)
!1103 = distinct !DISubprogram(name: "mbszero", scope: !1104, file: !1104, line: 1135, type: !1105, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !1108)
!1104 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!1108 = !{!1102}
!1109 = !DILocation(line: 0, scope: !1103, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 48, column: 18, scope: !211)
!1111 = !DILocalVariable(name: "__dest", arg: 1, scope: !1112, file: !1113, line: 57, type: !43)
!1112 = distinct !DISubprogram(name: "memset", scope: !1113, file: !1113, line: 57, type: !1114, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !1116)
!1113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!43, !43, !44, !46}
!1116 = !{!1111, !1117, !1118}
!1117 = !DILocalVariable(name: "__ch", arg: 2, scope: !1112, file: !1113, line: 57, type: !44)
!1118 = !DILocalVariable(name: "__len", arg: 3, scope: !1112, file: !1113, line: 57, type: !46)
!1119 = !DILocation(line: 0, scope: !1112, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 1137, column: 3, scope: !1103, inlinedAt: !1110)
!1121 = !DILocation(line: 59, column: 10, scope: !1112, inlinedAt: !1120)
!1122 = !DILocation(line: 49, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !211, file: !212, line: 49, column: 7)
!1124 = !DILocation(line: 49, column: 39, scope: !1123)
!1125 = !DILocation(line: 49, column: 44, scope: !1123)
!1126 = !DILocation(line: 54, column: 1, scope: !211)
!1127 = !DISubprogram(name: "mbrtoc32", scope: !223, file: !223, line: 57, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!46, !1130, !517, !46, !1132}
!1130 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1107)
!1133 = distinct !DISubprogram(name: "clone_quoting_options", scope: !248, file: !248, line: 113, type: !1134, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !1137)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!1136, !1136}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!1137 = !{!1138, !1139, !1140}
!1138 = !DILocalVariable(name: "o", arg: 1, scope: !1133, file: !248, line: 113, type: !1136)
!1139 = !DILocalVariable(name: "saved_errno", scope: !1133, file: !248, line: 115, type: !44)
!1140 = !DILocalVariable(name: "p", scope: !1133, file: !248, line: 116, type: !1136)
!1141 = !DILocation(line: 0, scope: !1133)
!1142 = !DILocation(line: 115, column: 21, scope: !1133)
!1143 = !DILocation(line: 116, column: 40, scope: !1133)
!1144 = !DILocation(line: 116, column: 31, scope: !1133)
!1145 = !DILocation(line: 118, column: 9, scope: !1133)
!1146 = !DILocation(line: 119, column: 3, scope: !1133)
!1147 = distinct !DISubprogram(name: "get_quoting_style", scope: !248, file: !248, line: 124, type: !1148, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !1152)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!12, !1150}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!1152 = !{!1153}
!1153 = !DILocalVariable(name: "o", arg: 1, scope: !1147, file: !248, line: 124, type: !1150)
!1154 = !DILocation(line: 0, scope: !1147)
!1155 = !DILocation(line: 126, column: 11, scope: !1147)
!1156 = !DILocation(line: 126, column: 46, scope: !1147)
!1157 = !{!1158, !437, i64 0}
!1158 = !{!"quoting_options", !437, i64 0, !522, i64 4, !437, i64 8, !436, i64 40, !436, i64 48}
!1159 = !DILocation(line: 126, column: 3, scope: !1147)
!1160 = distinct !DISubprogram(name: "set_quoting_style", scope: !248, file: !248, line: 132, type: !1161, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !1163)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !1136, !12}
!1163 = !{!1164, !1165}
!1164 = !DILocalVariable(name: "o", arg: 1, scope: !1160, file: !248, line: 132, type: !1136)
!1165 = !DILocalVariable(name: "s", arg: 2, scope: !1160, file: !248, line: 132, type: !12)
!1166 = !DILocation(line: 0, scope: !1160)
!1167 = !DILocation(line: 134, column: 4, scope: !1160)
!1168 = !DILocation(line: 134, column: 39, scope: !1160)
!1169 = !DILocation(line: 134, column: 45, scope: !1160)
!1170 = !DILocation(line: 135, column: 1, scope: !1160)
!1171 = distinct !DISubprogram(name: "set_char_quoting", scope: !248, file: !248, line: 143, type: !1172, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !1174)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!44, !1136, !8, !44}
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1181, !1182}
!1175 = !DILocalVariable(name: "o", arg: 1, scope: !1171, file: !248, line: 143, type: !1136)
!1176 = !DILocalVariable(name: "c", arg: 2, scope: !1171, file: !248, line: 143, type: !8)
!1177 = !DILocalVariable(name: "i", arg: 3, scope: !1171, file: !248, line: 143, type: !44)
!1178 = !DILocalVariable(name: "uc", scope: !1171, file: !248, line: 145, type: !49)
!1179 = !DILocalVariable(name: "p", scope: !1171, file: !248, line: 146, type: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!1181 = !DILocalVariable(name: "shift", scope: !1171, file: !248, line: 148, type: !44)
!1182 = !DILocalVariable(name: "r", scope: !1171, file: !248, line: 149, type: !14)
!1183 = !DILocation(line: 0, scope: !1171)
!1184 = !DILocation(line: 147, column: 6, scope: !1171)
!1185 = !DILocation(line: 147, column: 62, scope: !1171)
!1186 = !DILocation(line: 147, column: 57, scope: !1171)
!1187 = !DILocation(line: 148, column: 15, scope: !1171)
!1188 = !DILocation(line: 149, column: 21, scope: !1171)
!1189 = !DILocation(line: 149, column: 24, scope: !1171)
!1190 = !DILocation(line: 149, column: 34, scope: !1171)
!1191 = !DILocation(line: 150, column: 13, scope: !1171)
!1192 = !DILocation(line: 150, column: 19, scope: !1171)
!1193 = !DILocation(line: 150, column: 24, scope: !1171)
!1194 = !DILocation(line: 150, column: 6, scope: !1171)
!1195 = !DILocation(line: 151, column: 3, scope: !1171)
!1196 = distinct !DISubprogram(name: "set_quoting_flags", scope: !248, file: !248, line: 159, type: !1197, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !1199)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!44, !1136, !44}
!1199 = !{!1200, !1201, !1202}
!1200 = !DILocalVariable(name: "o", arg: 1, scope: !1196, file: !248, line: 159, type: !1136)
!1201 = !DILocalVariable(name: "i", arg: 2, scope: !1196, file: !248, line: 159, type: !44)
!1202 = !DILocalVariable(name: "r", scope: !1196, file: !248, line: 163, type: !44)
!1203 = !DILocation(line: 0, scope: !1196)
!1204 = !DILocation(line: 161, column: 8, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1196, file: !248, line: 161, column: 7)
!1206 = !DILocation(line: 161, column: 7, scope: !1196)
!1207 = !DILocation(line: 163, column: 14, scope: !1196)
!1208 = !{!1158, !522, i64 4}
!1209 = !DILocation(line: 164, column: 12, scope: !1196)
!1210 = !DILocation(line: 165, column: 3, scope: !1196)
