; ModuleID = 'src/ln.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.49 }
%union.anon.49 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.link_arg = type { i32, i8*, i32, i32 }
%struct.symlink_arg = type { i8*, i32 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }

!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 46, baseType: !64)
!63 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!64 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69, !71, !74, !76, !78, !80, !82, !84, !86, !92, !0, !177, !179}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "backup_type", scope: !2, file: !3, line: 47, type: !24, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "symbolic_link", scope: !2, file: !3, line: 50, type: !73, isLocal: true, isDefinition: true)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "relative", scope: !2, file: !3, line: 53, type: !73, isLocal: true, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "interactive", scope: !2, file: !3, line: 59, type: !73, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "remove_existing_files", scope: !2, file: !3, line: 62, type: !73, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 65, type: !73, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "hard_dir_link", scope: !2, file: !3, line: 71, type: !73, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "beware_hard_dir_link", scope: !2, file: !3, line: 74, type: !73, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "dest_set", scope: !2, file: !3, line: 86, type: !88, isLocal: true, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !90, line: 56, baseType: !91)
!90 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !90, line: 54, flags: DIFlagFwdDecl)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !94, file: !21, line: 575, type: !60, isLocal: true, isDefinition: true)
!94 = distinct !DISubprogram(name: "oputs_", scope: !21, file: !21, line: 573, type: !95, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !97)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !65, !65}
!97 = !{!98, !99, !100, !103, !104, !105, !106, !110, !111, !112, !113, !115, !171, !172, !173, !175, !176}
!98 = !DILocalVariable(name: "program", arg: 1, scope: !94, file: !21, line: 573, type: !65)
!99 = !DILocalVariable(name: "option", arg: 2, scope: !94, file: !21, line: 573, type: !65)
!100 = !DILocalVariable(name: "term", scope: !101, file: !21, line: 585, type: !65)
!101 = distinct !DILexicalBlock(scope: !102, file: !21, line: 582, column: 5)
!102 = distinct !DILexicalBlock(scope: !94, file: !21, line: 581, column: 7)
!103 = !DILocalVariable(name: "double_space", scope: !94, file: !21, line: 594, type: !73)
!104 = !DILocalVariable(name: "first_word", scope: !94, file: !21, line: 595, type: !65)
!105 = !DILocalVariable(name: "option_text", scope: !94, file: !21, line: 596, type: !65)
!106 = !DILocalVariable(name: "s", scope: !107, file: !21, line: 608, type: !65)
!107 = distinct !DILexicalBlock(scope: !108, file: !21, line: 605, column: 5)
!108 = distinct !DILexicalBlock(scope: !109, file: !21, line: 604, column: 12)
!109 = distinct !DILexicalBlock(scope: !94, file: !21, line: 597, column: 7)
!110 = !DILocalVariable(name: "spaces", scope: !107, file: !21, line: 609, type: !62)
!111 = !DILocalVariable(name: "anchor_len", scope: !94, file: !21, line: 620, type: !62)
!112 = !DILocalVariable(name: "desc_text", scope: !94, file: !21, line: 625, type: !65)
!113 = !DILocalVariable(name: "__ptr", scope: !114, file: !21, line: 644, type: !65)
!114 = distinct !DILexicalBlock(scope: !94, file: !21, line: 644, column: 3)
!115 = !DILocalVariable(name: "__stream", scope: !114, file: !21, line: 644, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !118, line: 7, baseType: !119)
!118 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !120, line: 49, size: 1728, elements: !121)
!120 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !137, !139, !140, !141, !145, !146, !148, !152, !155, !157, !160, !163, !164, !165, !166, !167}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !119, file: !120, line: 51, baseType: !60, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !119, file: !120, line: 54, baseType: !57, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !119, file: !120, line: 55, baseType: !57, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !119, file: !120, line: 56, baseType: !57, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !119, file: !120, line: 57, baseType: !57, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !119, file: !120, line: 58, baseType: !57, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !119, file: !120, line: 59, baseType: !57, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !119, file: !120, line: 60, baseType: !57, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !119, file: !120, line: 61, baseType: !57, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !119, file: !120, line: 64, baseType: !57, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !119, file: !120, line: 65, baseType: !57, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !119, file: !120, line: 66, baseType: !57, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !119, file: !120, line: 68, baseType: !135, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !120, line: 36, flags: DIFlagFwdDecl)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !119, file: !120, line: 70, baseType: !138, size: 64, offset: 832)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !119, file: !120, line: 72, baseType: !60, size: 32, offset: 896)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !119, file: !120, line: 73, baseType: !60, size: 32, offset: 928)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !119, file: !120, line: 74, baseType: !142, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !143, line: 152, baseType: !144)
!143 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!144 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !119, file: !120, line: 77, baseType: !61, size: 16, offset: 1024)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !119, file: !120, line: 78, baseType: !147, size: 8, offset: 1040)
!147 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !119, file: !120, line: 79, baseType: !149, size: 8, offset: 1048)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 1)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !119, file: !120, line: 81, baseType: !153, size: 64, offset: 1088)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !120, line: 43, baseType: null)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !119, file: !120, line: 89, baseType: !156, size: 64, offset: 1152)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !143, line: 153, baseType: !144)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !119, file: !120, line: 91, baseType: !158, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !120, line: 37, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !119, file: !120, line: 92, baseType: !161, size: 64, offset: 1280)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !120, line: 38, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !119, file: !120, line: 93, baseType: !138, size: 64, offset: 1344)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !119, file: !120, line: 94, baseType: !59, size: 64, offset: 1408)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !119, file: !120, line: 95, baseType: !62, size: 64, offset: 1472)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !119, file: !120, line: 96, baseType: !60, size: 32, offset: 1536)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !119, file: !120, line: 98, baseType: !168, size: 160, offset: 1568)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 20)
!171 = !DILocalVariable(name: "__cnt", scope: !114, file: !21, line: 644, type: !62)
!172 = !DILocalVariable(name: "url_program", scope: !94, file: !21, line: 648, type: !65)
!173 = !DILocalVariable(name: "__ptr", scope: !174, file: !21, line: 686, type: !65)
!174 = distinct !DILexicalBlock(scope: !94, file: !21, line: 686, column: 3)
!175 = !DILocalVariable(name: "__stream", scope: !174, file: !21, line: 686, type: !116)
!176 = !DILocalVariable(name: "__cnt", scope: !174, file: !21, line: 686, type: !62)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "logical", scope: !2, file: !3, line: 56, type: !73, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dereference_dest_dir_symlinks", scope: !2, file: !3, line: 80, type: !73, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 4096, elements: !191)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !184, line: 50, size: 256, elements: !185)
!184 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!185 = !{!186, !187, !188, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !184, line: 52, baseType: !65, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !183, file: !184, line: 55, baseType: !60, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !183, file: !184, line: 56, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !183, file: !184, line: 57, baseType: !60, size: 32, offset: 192)
!191 = !{!192}
!192 = !DISubrange(count: 16)
!193 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!194 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!195 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!196 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!197 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!198 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!199 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!200 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !203, file: !204, line: 38, type: !213, isLocal: true, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !205, globals: !212, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!205 = !{!206, !209}
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 39, baseType: !7, size: 32, elements: !207)
!207 = !{!208}
!208 = !DIEnumerator(name: "x_suffix_len", value: 6)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 44, baseType: !7, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIEnumerator(name: "smallsize", value: 256)
!212 = !{!201}
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 72, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 9)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "Version", scope: !218, file: !219, line: 3, type: !65, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !220, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!220 = !{!216}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !223, file: !224, line: 77, type: !65, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !288, globals: !289, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!225 = !{!24, !226, !258, !264}
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !227, file: !224, line: 325, baseType: !7, size: 32, elements: !256)
!227 = distinct !DISubprogram(name: "backupfile_internal", scope: !224, file: !224, line: 312, type: !228, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !223, retainedNodes: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{!57, !60, !65, !24, !73}
!230 = !{!231, !232, !233, !234, !235, !239, !240, !241, !242, !243, !244, !249, !250, !251, !253, !254, !255}
!231 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !227, file: !224, line: 312, type: !60)
!232 = !DILocalVariable(name: "file", arg: 2, scope: !227, file: !224, line: 312, type: !65)
!233 = !DILocalVariable(name: "backup_type", arg: 3, scope: !227, file: !224, line: 313, type: !24)
!234 = !DILocalVariable(name: "rename", arg: 4, scope: !227, file: !224, line: 313, type: !73)
!235 = !DILocalVariable(name: "base_offset", scope: !227, file: !224, line: 315, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !237, line: 130, baseType: !238)
!237 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !63, line: 35, baseType: !144)
!239 = !DILocalVariable(name: "filelen", scope: !227, file: !224, line: 316, type: !236)
!240 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !227, file: !224, line: 323, type: !236)
!241 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !227, file: !224, line: 324, type: !236)
!242 = !DILocalVariable(name: "ssize", scope: !227, file: !224, line: 329, type: !236)
!243 = !DILocalVariable(name: "s", scope: !227, file: !224, line: 330, type: !57)
!244 = !DILocalVariable(name: "dirp", scope: !227, file: !224, line: 334, type: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !247, line: 127, baseType: !248)
!247 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !247, line: 127, flags: DIFlagFwdDecl)
!249 = !DILocalVariable(name: "sdir", scope: !227, file: !224, line: 335, type: !60)
!250 = !DILocalVariable(name: "base_max", scope: !227, file: !224, line: 336, type: !236)
!251 = !DILocalVariable(name: "extended", scope: !252, file: !224, line: 339, type: !73)
!252 = distinct !DILexicalBlock(scope: !227, file: !224, line: 338, column: 5)
!253 = !DILocalVariable(name: "offset", scope: !252, file: !224, line: 375, type: !236)
!254 = !DILocalVariable(name: "flags", scope: !252, file: !224, line: 376, type: !7)
!255 = !DILocalVariable(name: "saved_errno", scope: !252, file: !224, line: 379, type: !60)
!256 = !{!257}
!257 = !DIEnumerator(name: "GUESS", value: 9)
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !224, line: 171, baseType: !7, size: 32, elements: !259)
!259 = !{!260, !261, !262, !263}
!260 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!261 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!262 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!263 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 24, baseType: !7, size: 32, elements: !266)
!265 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287}
!267 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!268 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!269 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!270 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!271 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!272 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!273 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!274 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!275 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!276 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!277 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!278 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!279 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!280 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!281 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!282 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!283 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!284 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!285 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!286 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!287 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!288 = !{!59, !7, !73}
!289 = !{!221}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "backup_types", scope: !292, file: !293, line: 53, type: !303, isLocal: true, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !295, globals: !298, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!294 = !{!24}
!295 = !{!59, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!298 = !{!290, !299}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "backup_args", scope: !292, file: !293, line: 42, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 576, elements: !214)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 256, elements: !305)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!305 = !{!306}
!306 = !DISubrange(count: 8)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "file_name", scope: !309, file: !310, line: 36, type: !65, isLocal: true, isDefinition: true)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !311, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!311 = !{!307}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "file_name", scope: !314, file: !315, line: 45, type: !65, isLocal: true, isDefinition: true)
!314 = distinct !DICompileUnit(language: DW_LANG_C99, file: !315, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !316, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!316 = !{!312, !317}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !314, file: !315, line: 55, type: !73, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !321, file: !322, line: 66, type: !357, isLocal: false, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !323, globals: !324, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!323 = !{!59, !67}
!324 = !{!325, !351, !319, !353, !355}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "old_file_name", scope: !327, file: !322, line: 304, type: !65, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "verror_at_line", scope: !322, file: !322, line: 298, type: !328, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !321, retainedNodes: !344)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !60, !60, !65, !7, !65, !330}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !331, line: 52, baseType: !332)
!331 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !333, line: 32, baseType: !334)
!333 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !335, baseType: !336)
!335 = !DIFile(filename: "lib/error.c", directory: "/src")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !337, size: 256, elements: !338)
!337 = !DINamespace(name: "std", scope: null)
!338 = !{!339, !340, !341, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !336, file: !335, baseType: !59, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !336, file: !335, baseType: !59, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !336, file: !335, baseType: !59, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !336, file: !335, baseType: !60, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !336, file: !335, baseType: !60, size: 32, offset: 224)
!344 = !{!345, !346, !347, !348, !349, !350}
!345 = !DILocalVariable(name: "status", arg: 1, scope: !327, file: !322, line: 298, type: !60)
!346 = !DILocalVariable(name: "errnum", arg: 2, scope: !327, file: !322, line: 298, type: !60)
!347 = !DILocalVariable(name: "file_name", arg: 3, scope: !327, file: !322, line: 298, type: !65)
!348 = !DILocalVariable(name: "line_number", arg: 4, scope: !327, file: !322, line: 298, type: !7)
!349 = !DILocalVariable(name: "message", arg: 5, scope: !327, file: !322, line: 298, type: !65)
!350 = !DILocalVariable(name: "args", arg: 6, scope: !327, file: !322, line: 298, type: !330)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "old_line_number", scope: !327, file: !322, line: 305, type: !7, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "error_message_count", scope: !321, file: !322, line: 69, type: !7, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !321, file: !322, line: 295, type: !60, isLocal: false, isDefinition: true)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{null}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "default_tuning", scope: !362, file: !363, line: 134, type: !367, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, globals: !366, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!364 = !{!64, !59, !365, !62}
!365 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!366 = !{!360}
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !90, line: 52, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !90, line: 40, size: 160, elements: !370)
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !369, file: !90, line: 45, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !369, file: !90, line: 46, baseType: !365, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !369, file: !90, line: 47, baseType: !365, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !369, file: !90, line: 48, baseType: !365, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !369, file: !90, line: 49, baseType: !73, size: 8, offset: 128)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "program_name", scope: !378, file: !379, line: 31, type: !65, isLocal: false, isDefinition: true)
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, globals: !381, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!380 = !{!57}
!381 = !{!376}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "utf07FF", scope: !384, file: !385, line: 46, type: !415, isLocal: true, isDefinition: true)
!384 = distinct !DISubprogram(name: "proper_name_lite", scope: !385, file: !385, line: 38, type: !386, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !388, retainedNodes: !390)
!385 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!386 = !DISubroutineType(types: !387)
!387 = !{!65, !65, !65}
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !389, splitDebugInlining: false, nameTableKind: None)
!389 = !{!382}
!390 = !{!391, !392, !393, !394, !399}
!391 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !384, file: !385, line: 38, type: !65)
!392 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !384, file: !385, line: 38, type: !65)
!393 = !DILocalVariable(name: "translation", scope: !384, file: !385, line: 40, type: !65)
!394 = !DILocalVariable(name: "w", scope: !384, file: !385, line: 47, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !396, line: 37, baseType: !397)
!396 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !143, line: 57, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !143, line: 42, baseType: !7)
!399 = !DILocalVariable(name: "mbs", scope: !384, file: !385, line: 48, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !401, line: 6, baseType: !402)
!401 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !403, line: 21, baseType: !404)
!403 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 13, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !404, file: !403, line: 15, baseType: !60, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !404, file: !403, line: 20, baseType: !408, size: 32, offset: 32)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !404, file: !403, line: 16, size: 32, elements: !409)
!409 = !{!410, !411}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !408, file: !403, line: 18, baseType: !7, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !408, file: !403, line: 19, baseType: !412, size: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 4)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 16, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 2)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !420, file: !421, line: 76, type: !487, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !428, globals: !429, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!422 = !{!5, !423, !34}
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!426 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!427 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!428 = !{!60, !61, !62}
!429 = !{!418, !430, !436, !446, !448, !453, !476, !483, !485}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !420, file: !421, line: 92, type: !432, isLocal: false, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 320, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!434 = !{!435}
!435 = !DISubrange(count: 10)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !420, file: !421, line: 1040, type: !438, isLocal: false, isDefinition: true)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !421, line: 56, size: 448, elements: !439)
!439 = !{!440, !441, !442, !444, !445}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !438, file: !421, line: 59, baseType: !5, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !421, line: 62, baseType: !60, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !438, file: !421, line: 66, baseType: !443, size: 256, offset: 64)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !305)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !438, file: !421, line: 69, baseType: !65, size: 64, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !438, file: !421, line: 72, baseType: !65, size: 64, offset: 384)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !420, file: !421, line: 107, type: !438, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "slot0", scope: !420, file: !421, line: 831, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 256)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "quote", scope: !455, file: !421, line: 228, type: !474, isLocal: true, isDefinition: true)
!455 = distinct !DISubprogram(name: "gettext_quote", scope: !421, file: !421, line: 197, type: !456, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !420, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!65, !65, !5}
!458 = !{!459, !460, !461, !462, !463}
!459 = !DILocalVariable(name: "msgid", arg: 1, scope: !455, file: !421, line: 197, type: !65)
!460 = !DILocalVariable(name: "s", arg: 2, scope: !455, file: !421, line: 197, type: !5)
!461 = !DILocalVariable(name: "translation", scope: !455, file: !421, line: 199, type: !65)
!462 = !DILocalVariable(name: "w", scope: !455, file: !421, line: 229, type: !395)
!463 = !DILocalVariable(name: "mbs", scope: !455, file: !421, line: 230, type: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !401, line: 6, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !403, line: 21, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 13, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !466, file: !403, line: 15, baseType: !60, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !466, file: !403, line: 20, baseType: !470, size: 32, offset: 32)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !403, line: 16, size: 32, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !470, file: !403, line: 18, baseType: !7, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !470, file: !403, line: 19, baseType: !412, size: 32)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 64, elements: !475)
!475 = !{!417, !414}
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "slotvec", scope: !420, file: !421, line: 834, type: !478, isLocal: true, isDefinition: true)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !421, line: 823, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !479, file: !421, line: 825, baseType: !62, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !479, file: !421, line: 826, baseType: !57, size: 64, offset: 64)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "nslots", scope: !420, file: !421, line: 832, type: !60, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "slotvec0", scope: !420, file: !421, line: 833, type: !479, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 704, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 11)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "tryfunc", scope: !492, file: !493, line: 175, type: !509, isLocal: true, isDefinition: true)
!492 = distinct !DISubprogram(name: "gen_tempname_len", scope: !493, file: !493, line: 172, type: !494, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !496, retainedNodes: !503)
!493 = !DIFile(filename: "lib/tempname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "89467f8095ceec51ae791cc96ec80d48")
!494 = !DISubroutineType(types: !495)
!495 = !{!60, !57, !60, !60, !60, !62}
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !497, splitDebugInlining: false, nameTableKind: None)
!497 = !{!490, !498}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "letters", scope: !496, file: !493, line: 151, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 504, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 63)
!503 = !{!504, !505, !506, !507, !508}
!504 = !DILocalVariable(name: "tmpl", arg: 1, scope: !492, file: !493, line: 172, type: !57)
!505 = !DILocalVariable(name: "suffixlen", arg: 2, scope: !492, file: !493, line: 172, type: !60)
!506 = !DILocalVariable(name: "flags", arg: 3, scope: !492, file: !493, line: 172, type: !60)
!507 = !DILocalVariable(name: "kind", arg: 4, scope: !492, file: !493, line: 172, type: !60)
!508 = !DILocalVariable(name: "x_suffix_len", arg: 5, scope: !492, file: !493, line: 173, type: !62)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 192, elements: !514)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!60, !57, !59}
!514 = !{!515}
!515 = !DISubrange(count: 3)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !518, file: !519, line: 26, type: !521, isLocal: false, isDefinition: true)
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !520, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!520 = !{!516}
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 376, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 47)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "exit_failure", scope: !526, file: !527, line: 24, type: !529, isLocal: false, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !528, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!528 = !{!524}
!529 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !532, file: !533, line: 65, type: !537, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !534, retainedTypes: !535, globals: !536, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!534 = !{!5}
!535 = !{!59, !65, !67}
!536 = !{!530}
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !538, line: 69, baseType: !357)
!538 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "internal_state", scope: !541, file: !542, line: 97, type: !545, isLocal: true, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !543, globals: !544, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!543 = !{!59, !62, !67}
!544 = !{!539}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !401, line: 6, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !403, line: 21, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !403, line: 13, size: 64, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !547, file: !403, line: 15, baseType: !60, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !547, file: !403, line: 20, baseType: !551, size: 32, offset: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !547, file: !403, line: 16, size: 32, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !551, file: !403, line: 18, baseType: !7, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !551, file: !403, line: 19, baseType: !412, size: 32)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !557, file: !558, line: 506, type: !60, isLocal: true, isDefinition: true)
!557 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !558, file: !558, line: 485, type: !559, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !563)
!558 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!559 = !DISubroutineType(types: !560)
!560 = !{!60, !60, !60}
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !562, splitDebugInlining: false, nameTableKind: None)
!562 = !{!555}
!563 = !{!564, !565, !566, !567, !570}
!564 = !DILocalVariable(name: "fd", arg: 1, scope: !557, file: !558, line: 485, type: !60)
!565 = !DILocalVariable(name: "target", arg: 2, scope: !557, file: !558, line: 485, type: !60)
!566 = !DILocalVariable(name: "result", scope: !557, file: !558, line: 487, type: !60)
!567 = !DILocalVariable(name: "flags", scope: !568, file: !558, line: 530, type: !60)
!568 = distinct !DILexicalBlock(scope: !569, file: !558, line: 529, column: 5)
!569 = distinct !DILexicalBlock(scope: !557, file: !558, line: 528, column: 7)
!570 = !DILocalVariable(name: "saved_errno", scope: !571, file: !558, line: 533, type: !60)
!571 = distinct !DILexicalBlock(scope: !572, file: !558, line: 532, column: 9)
!572 = distinct !DILexicalBlock(scope: !568, file: !558, line: 531, column: 11)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "src/relpath.c", directory: "/src", checksumkind: CSK_MD5, checksum: "16c7701de380a03fd2bfbb50611956cf")
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !580, globals: !581, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!579 = !{!49}
!580 = !{!59}
!581 = !{!582}
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !577, file: !578, line: 110, type: !415, isLocal: true, isDefinition: true)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !594, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!594 = !{!59, !57}
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "lib/freadahead.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0335573db6cc583acb894a308e230b2b")
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !604, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!604 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!607 = distinct !DICompileUnit(language: DW_LANG_C99, file: !608, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!608 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "lib/hashcode-file-inode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3ee21699b437776a572b0ed169ee633")
!611 = distinct !DICompileUnit(language: DW_LANG_C99, file: !612, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!612 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!613 = distinct !DICompileUnit(language: DW_LANG_C99, file: !614, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!614 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/openat-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "946ef6e8fdb1124c3d2ae8982ba6c16b")
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/opendirat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9ae84c4c59278018f497b82d8ee5d941")
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !380, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "lib/renameatu.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c018670dfeb96d47df408cf9bacb370e")
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "lib/same.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9cf62a9eecab826ec0c9447bdd432eb")
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!627 = distinct !DICompileUnit(language: DW_LANG_C99, file: !628, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !629, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!628 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!629 = !{!630}
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !628, line: 40, baseType: !7, size: 32, elements: !631)
!631 = !{!632}
!632 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !663, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!635 = !{!636, !648}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !637, file: !634, line: 188, baseType: !7, size: 32, elements: !646)
!637 = distinct !DISubprogram(name: "x2nrealloc", scope: !634, file: !634, line: 176, type: !638, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !641)
!638 = !DISubroutineType(types: !639)
!639 = !{!59, !59, !640, !62}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!641 = !{!642, !643, !644, !645}
!642 = !DILocalVariable(name: "p", arg: 1, scope: !637, file: !634, line: 176, type: !59)
!643 = !DILocalVariable(name: "pn", arg: 2, scope: !637, file: !634, line: 176, type: !640)
!644 = !DILocalVariable(name: "s", arg: 3, scope: !637, file: !634, line: 176, type: !62)
!645 = !DILocalVariable(name: "n", scope: !637, file: !634, line: 178, type: !62)
!646 = !{!647}
!647 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !649, file: !634, line: 228, baseType: !7, size: 32, elements: !646)
!649 = distinct !DISubprogram(name: "xpalloc", scope: !634, file: !634, line: 223, type: !650, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !653)
!650 = !DISubroutineType(types: !651)
!651 = !{!59, !59, !652, !236, !238, !236}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662}
!654 = !DILocalVariable(name: "pa", arg: 1, scope: !649, file: !634, line: 223, type: !59)
!655 = !DILocalVariable(name: "pn", arg: 2, scope: !649, file: !634, line: 223, type: !652)
!656 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !649, file: !634, line: 223, type: !236)
!657 = !DILocalVariable(name: "n_max", arg: 4, scope: !649, file: !634, line: 223, type: !238)
!658 = !DILocalVariable(name: "s", arg: 5, scope: !649, file: !634, line: 223, type: !236)
!659 = !DILocalVariable(name: "n0", scope: !649, file: !634, line: 230, type: !236)
!660 = !DILocalVariable(name: "n", scope: !649, file: !634, line: 237, type: !236)
!661 = !DILocalVariable(name: "nbytes", scope: !649, file: !634, line: 248, type: !236)
!662 = !DILocalVariable(name: "adjusted_nbytes", scope: !649, file: !634, line: 252, type: !236)
!663 = !{!57, !59, !73, !144, !64}
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!665 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/yesno.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f502cb9314a0b73fa3879d5bf878f96f")
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!674 = !{!73, !64, !59}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !580, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!683 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!684 = !{i32 7, !"Dwarf Version", i32 5}
!685 = !{i32 2, !"Debug Info Version", i32 3}
!686 = !{i32 1, !"wchar_size", i32 4}
!687 = !{i32 1, !"branch-target-enforcement", i32 0}
!688 = !{i32 1, !"sign-return-address", i32 0}
!689 = !{i32 1, !"sign-return-address-all", i32 0}
!690 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!691 = !{i32 7, !"PIC Level", i32 2}
!692 = !{i32 7, !"PIE Level", i32 2}
!693 = !{i32 7, !"uwtable", i32 1}
!694 = !{i32 7, !"frame-pointer", i32 1}
!695 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 415, type: !696, scopeLine: 416, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !60}
!698 = !{!699}
!699 = !DILocalVariable(name: "status", arg: 1, scope: !695, file: !3, line: 415, type: !60)
!700 = !DILocation(line: 0, scope: !695)
!701 = !DILocation(line: 417, column: 14, scope: !702)
!702 = distinct !DILexicalBlock(scope: !695, file: !3, line: 417, column: 7)
!703 = !DILocation(line: 417, column: 7, scope: !695)
!704 = !DILocation(line: 418, column: 5, scope: !705)
!705 = distinct !DILexicalBlock(scope: !702, file: !3, line: 418, column: 5)
!706 = !{!707, !707, i64 0}
!707 = !{!"any pointer", !708, i64 0}
!708 = !{!"omnipotent char", !709, i64 0}
!709 = !{!"Simple C/C++ TBAA"}
!710 = !DILocation(line: 421, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !702, file: !3, line: 420, column: 5)
!712 = !DILocation(line: 428, column: 7, scope: !711)
!713 = !DILocation(line: 736, column: 3, scope: !714, inlinedAt: !716)
!714 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !21, file: !21, line: 734, type: !358, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !715)
!715 = !{}
!716 = distinct !DILocation(line: 439, column: 7, scope: !711)
!717 = !DILocation(line: 441, column: 7, scope: !711)
!718 = !DILocation(line: 445, column: 7, scope: !711)
!719 = !DILocation(line: 449, column: 7, scope: !711)
!720 = !DILocation(line: 454, column: 7, scope: !711)
!721 = !DILocation(line: 458, column: 7, scope: !711)
!722 = !DILocation(line: 462, column: 7, scope: !711)
!723 = !DILocation(line: 466, column: 7, scope: !711)
!724 = !DILocation(line: 471, column: 7, scope: !711)
!725 = !DILocation(line: 475, column: 7, scope: !711)
!726 = !DILocation(line: 479, column: 7, scope: !711)
!727 = !DILocation(line: 483, column: 7, scope: !711)
!728 = !DILocation(line: 487, column: 7, scope: !711)
!729 = !DILocation(line: 491, column: 7, scope: !711)
!730 = !DILocation(line: 495, column: 7, scope: !711)
!731 = !DILocation(line: 499, column: 7, scope: !711)
!732 = !DILocation(line: 500, column: 7, scope: !711)
!733 = !DILocation(line: 781, column: 3, scope: !734, inlinedAt: !735)
!734 = distinct !DISubprogram(name: "emit_backup_suffix_note", scope: !21, file: !21, line: 779, type: !358, scopeLine: 780, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !715)
!735 = distinct !DILocation(line: 501, column: 7, scope: !711)
!736 = !DILocation(line: 788, column: 3, scope: !734, inlinedAt: !735)
!737 = !DILocation(line: 502, column: 7, scope: !711)
!738 = !DILocalVariable(name: "program", arg: 1, scope: !739, file: !21, line: 836, type: !65)
!739 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !21, file: !21, line: 836, type: !740, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !65}
!742 = !{!738, !743, !752, !753, !755, !756}
!743 = !DILocalVariable(name: "infomap", scope: !739, file: !21, line: 838, type: !744)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 896, elements: !750)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !739, file: !21, line: 838, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !746, file: !21, line: 838, baseType: !65, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !21, line: 838, baseType: !65, size: 64, offset: 64)
!750 = !{!751}
!751 = !DISubrange(count: 7)
!752 = !DILocalVariable(name: "node", scope: !739, file: !21, line: 848, type: !65)
!753 = !DILocalVariable(name: "map_prog", scope: !739, file: !21, line: 849, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!755 = !DILocalVariable(name: "lc_messages", scope: !739, file: !21, line: 861, type: !65)
!756 = !DILocalVariable(name: "url_program", scope: !739, file: !21, line: 874, type: !65)
!757 = !DILocation(line: 0, scope: !739, inlinedAt: !758)
!758 = distinct !DILocation(line: 507, column: 7, scope: !711)
!759 = !DILocation(line: 838, column: 3, scope: !739, inlinedAt: !758)
!760 = !DILocation(line: 838, column: 67, scope: !739, inlinedAt: !758)
!761 = !DILocation(line: 849, column: 36, scope: !739, inlinedAt: !758)
!762 = !DILocation(line: 851, column: 3, scope: !739, inlinedAt: !758)
!763 = !DILocalVariable(name: "__s1", arg: 1, scope: !764, file: !765, line: 1359, type: !65)
!764 = distinct !DISubprogram(name: "streq", scope: !765, file: !765, line: 1359, type: !766, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !768)
!765 = !DIFile(filename: "./lib/string.h", directory: "/src")
!766 = !DISubroutineType(types: !767)
!767 = !{!73, !65, !65}
!768 = !{!763, !769}
!769 = !DILocalVariable(name: "__s2", arg: 2, scope: !764, file: !765, line: 1359, type: !65)
!770 = !DILocation(line: 0, scope: !764, inlinedAt: !771)
!771 = distinct !DILocation(line: 851, column: 33, scope: !739, inlinedAt: !758)
!772 = !DILocation(line: 1361, column: 11, scope: !764, inlinedAt: !771)
!773 = !DILocation(line: 1361, column: 10, scope: !764, inlinedAt: !771)
!774 = !DILocation(line: 852, column: 13, scope: !739, inlinedAt: !758)
!775 = !DILocation(line: 851, column: 20, scope: !739, inlinedAt: !758)
!776 = !{!777, !707, i64 0}
!777 = !{!"infomap", !707, i64 0, !707, i64 8}
!778 = !DILocation(line: 851, column: 10, scope: !739, inlinedAt: !758)
!779 = !DILocation(line: 851, column: 28, scope: !739, inlinedAt: !758)
!780 = distinct !{!780, !762, !774, !781}
!781 = !{!"llvm.loop.mustprogress"}
!782 = !DILocation(line: 854, column: 17, scope: !783, inlinedAt: !758)
!783 = distinct !DILexicalBlock(scope: !739, file: !21, line: 854, column: 7)
!784 = !{!777, !707, i64 8}
!785 = !DILocation(line: 854, column: 7, scope: !783, inlinedAt: !758)
!786 = !DILocation(line: 854, column: 7, scope: !739, inlinedAt: !758)
!787 = !DILocation(line: 857, column: 3, scope: !739, inlinedAt: !758)
!788 = !DILocation(line: 861, column: 29, scope: !739, inlinedAt: !758)
!789 = !DILocation(line: 862, column: 7, scope: !790, inlinedAt: !758)
!790 = distinct !DILexicalBlock(scope: !739, file: !21, line: 862, column: 7)
!791 = !DILocation(line: 862, column: 19, scope: !790, inlinedAt: !758)
!792 = !DILocation(line: 862, column: 22, scope: !790, inlinedAt: !758)
!793 = !DILocation(line: 862, column: 7, scope: !739, inlinedAt: !758)
!794 = !DILocation(line: 868, column: 7, scope: !795, inlinedAt: !758)
!795 = distinct !DILexicalBlock(scope: !790, file: !21, line: 863, column: 5)
!796 = !DILocation(line: 870, column: 5, scope: !795, inlinedAt: !758)
!797 = !DILocation(line: 0, scope: !764, inlinedAt: !798)
!798 = distinct !DILocation(line: 874, column: 29, scope: !739, inlinedAt: !758)
!799 = !DILocation(line: 875, column: 3, scope: !739, inlinedAt: !758)
!800 = !DILocation(line: 877, column: 3, scope: !739, inlinedAt: !758)
!801 = !DILocation(line: 879, column: 1, scope: !739, inlinedAt: !758)
!802 = !DILocation(line: 509, column: 3, scope: !695)
!803 = !DISubprogram(name: "dcgettext", scope: !804, file: !804, line: 51, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!804 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!805 = !DISubroutineType(types: !806)
!806 = !{!57, !65, !65, !60}
!807 = !DISubprogram(name: "fputs_unlocked", scope: !331, file: !331, line: 691, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!808 = !DISubroutineType(types: !809)
!809 = !{!60, !810, !811}
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!811 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!812 = !DILocation(line: 0, scope: !94)
!813 = !DILocation(line: 581, column: 7, scope: !102)
!814 = !{!815, !815, i64 0}
!815 = !{!"int", !708, i64 0}
!816 = !DILocation(line: 581, column: 19, scope: !102)
!817 = !DILocation(line: 581, column: 7, scope: !94)
!818 = !DILocation(line: 585, column: 26, scope: !101)
!819 = !DILocation(line: 0, scope: !101)
!820 = !DILocation(line: 586, column: 23, scope: !101)
!821 = !DILocation(line: 586, column: 28, scope: !101)
!822 = !DILocation(line: 586, column: 32, scope: !101)
!823 = !{!708, !708, i64 0}
!824 = !DILocation(line: 586, column: 38, scope: !101)
!825 = !DILocation(line: 0, scope: !764, inlinedAt: !826)
!826 = distinct !DILocation(line: 586, column: 41, scope: !101)
!827 = !DILocation(line: 1361, column: 11, scope: !764, inlinedAt: !826)
!828 = !DILocation(line: 1361, column: 10, scope: !764, inlinedAt: !826)
!829 = !DILocation(line: 586, column: 19, scope: !101)
!830 = !DILocation(line: 587, column: 5, scope: !101)
!831 = !DILocation(line: 588, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !94, file: !21, line: 588, column: 7)
!833 = !DILocation(line: 588, column: 7, scope: !94)
!834 = !DILocation(line: 590, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !21, line: 589, column: 5)
!836 = !DILocation(line: 591, column: 7, scope: !835)
!837 = !DILocation(line: 595, column: 37, scope: !94)
!838 = !DILocation(line: 595, column: 35, scope: !94)
!839 = !DILocation(line: 596, column: 29, scope: !94)
!840 = !DILocation(line: 597, column: 8, scope: !109)
!841 = !DILocation(line: 597, column: 7, scope: !94)
!842 = !DILocation(line: 604, column: 24, scope: !108)
!843 = !DILocation(line: 604, column: 12, scope: !109)
!844 = !DILocation(line: 0, scope: !107)
!845 = !DILocation(line: 610, column: 16, scope: !107)
!846 = !DILocation(line: 610, column: 7, scope: !107)
!847 = !DILocation(line: 611, column: 21, scope: !107)
!848 = !{!849, !849, i64 0}
!849 = !{!"short", !708, i64 0}
!850 = !DILocation(line: 611, column: 19, scope: !107)
!851 = !DILocation(line: 611, column: 16, scope: !107)
!852 = !DILocation(line: 610, column: 30, scope: !107)
!853 = distinct !{!853, !846, !847, !781}
!854 = !DILocation(line: 612, column: 18, scope: !855)
!855 = distinct !DILexicalBlock(scope: !107, file: !21, line: 612, column: 11)
!856 = !DILocation(line: 612, column: 11, scope: !107)
!857 = !DILocation(line: 620, column: 23, scope: !94)
!858 = !DILocation(line: 625, column: 39, scope: !94)
!859 = !DILocation(line: 626, column: 3, scope: !94)
!860 = !DILocation(line: 626, column: 10, scope: !94)
!861 = !DILocation(line: 626, column: 21, scope: !94)
!862 = !DILocation(line: 628, column: 44, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !21, line: 628, column: 11)
!864 = distinct !DILexicalBlock(scope: !94, file: !21, line: 627, column: 5)
!865 = !DILocation(line: 628, column: 32, scope: !863)
!866 = !DILocation(line: 628, column: 49, scope: !863)
!867 = !DILocation(line: 628, column: 11, scope: !864)
!868 = !DILocation(line: 630, column: 11, scope: !869)
!869 = distinct !DILexicalBlock(scope: !864, file: !21, line: 630, column: 11)
!870 = !DILocation(line: 630, column: 11, scope: !864)
!871 = !DILocation(line: 632, column: 26, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !21, line: 632, column: 15)
!873 = distinct !DILexicalBlock(scope: !869, file: !21, line: 631, column: 9)
!874 = !DILocation(line: 632, column: 34, scope: !872)
!875 = !DILocation(line: 632, column: 37, scope: !872)
!876 = !DILocation(line: 632, column: 15, scope: !873)
!877 = !DILocation(line: 636, column: 29, scope: !878)
!878 = distinct !DILexicalBlock(scope: !873, file: !21, line: 636, column: 15)
!879 = !DILocation(line: 640, column: 16, scope: !864)
!880 = distinct !{!880, !859, !881, !781}
!881 = !DILocation(line: 641, column: 5, scope: !94)
!882 = !DILocation(line: 644, column: 3, scope: !94)
!883 = !DILocation(line: 0, scope: !764, inlinedAt: !884)
!884 = distinct !DILocation(line: 648, column: 31, scope: !94)
!885 = !DILocation(line: 0, scope: !764, inlinedAt: !886)
!886 = distinct !DILocation(line: 649, column: 31, scope: !94)
!887 = !DILocation(line: 0, scope: !764, inlinedAt: !888)
!888 = distinct !DILocation(line: 650, column: 31, scope: !94)
!889 = !DILocation(line: 0, scope: !764, inlinedAt: !890)
!890 = distinct !DILocation(line: 651, column: 31, scope: !94)
!891 = !DILocation(line: 0, scope: !764, inlinedAt: !892)
!892 = distinct !DILocation(line: 652, column: 31, scope: !94)
!893 = !DILocation(line: 0, scope: !764, inlinedAt: !894)
!894 = distinct !DILocation(line: 653, column: 31, scope: !94)
!895 = !DILocation(line: 0, scope: !764, inlinedAt: !896)
!896 = distinct !DILocation(line: 654, column: 31, scope: !94)
!897 = !DILocation(line: 0, scope: !764, inlinedAt: !898)
!898 = distinct !DILocation(line: 655, column: 31, scope: !94)
!899 = !DILocation(line: 0, scope: !764, inlinedAt: !900)
!900 = distinct !DILocation(line: 656, column: 31, scope: !94)
!901 = !DILocation(line: 0, scope: !764, inlinedAt: !902)
!902 = distinct !DILocation(line: 657, column: 31, scope: !94)
!903 = !DILocation(line: 663, column: 7, scope: !904)
!904 = distinct !DILexicalBlock(scope: !94, file: !21, line: 663, column: 7)
!905 = !DILocation(line: 664, column: 7, scope: !904)
!906 = !DILocation(line: 664, column: 10, scope: !904)
!907 = !DILocation(line: 663, column: 7, scope: !94)
!908 = !DILocation(line: 669, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !904, file: !21, line: 665, column: 5)
!910 = !DILocation(line: 671, column: 5, scope: !909)
!911 = !DILocation(line: 676, column: 7, scope: !912)
!912 = distinct !DILexicalBlock(scope: !904, file: !21, line: 673, column: 5)
!913 = !DILocation(line: 679, column: 3, scope: !94)
!914 = !DILocation(line: 683, column: 3, scope: !94)
!915 = !DILocation(line: 686, column: 3, scope: !94)
!916 = !DILocation(line: 688, column: 3, scope: !94)
!917 = !DILocation(line: 691, column: 3, scope: !94)
!918 = !DILocation(line: 695, column: 3, scope: !94)
!919 = !DILocation(line: 696, column: 1, scope: !94)
!920 = !DISubprogram(name: "setlocale", scope: !921, file: !921, line: 122, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!921 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!922 = !DISubroutineType(types: !923)
!923 = !{!57, !60, !65}
!924 = !DISubprogram(name: "getenv", scope: !925, file: !925, line: 641, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!925 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!926 = !DISubroutineType(types: !927)
!927 = !{!57, !65}
!928 = !DISubprogram(name: "fwrite_unlocked", scope: !331, file: !331, line: 704, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !715)
!929 = !DISubroutineType(types: !930)
!930 = !{!62, !931, !62, !62, !811}
!931 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !296)
!932 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 513, type: !933, scopeLine: 514, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !936)
!933 = !DISubroutineType(types: !934)
!934 = !{!60, !60, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !990, !996, !997, !1001, !1004}
!937 = !DILocalVariable(name: "argc", arg: 1, scope: !932, file: !3, line: 513, type: !60)
!938 = !DILocalVariable(name: "argv", arg: 2, scope: !932, file: !3, line: 513, type: !935)
!939 = !DILocalVariable(name: "c", scope: !932, file: !3, line: 515, type: !60)
!940 = !DILocalVariable(name: "ok", scope: !932, file: !3, line: 516, type: !73)
!941 = !DILocalVariable(name: "make_backups", scope: !932, file: !3, line: 517, type: !73)
!942 = !DILocalVariable(name: "backup_suffix", scope: !932, file: !3, line: 518, type: !65)
!943 = !DILocalVariable(name: "version_control_string", scope: !932, file: !3, line: 519, type: !57)
!944 = !DILocalVariable(name: "target_directory", scope: !932, file: !3, line: 520, type: !65)
!945 = !DILocalVariable(name: "destdir_fd", scope: !932, file: !3, line: 521, type: !60)
!946 = !DILocalVariable(name: "no_target_directory", scope: !932, file: !3, line: 522, type: !73)
!947 = !DILocalVariable(name: "n_files", scope: !932, file: !3, line: 523, type: !60)
!948 = !DILocalVariable(name: "file", scope: !932, file: !3, line: 524, type: !935)
!949 = !DILocalVariable(name: "link_errno", scope: !932, file: !3, line: 525, type: !60)
!950 = !DILocalVariable(name: "st", scope: !951, file: !3, line: 578, type: !955)
!951 = distinct !DILexicalBlock(scope: !952, file: !3, line: 577, column: 13)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 574, column: 15)
!953 = distinct !DILexicalBlock(scope: !954, file: !3, line: 540, column: 9)
!954 = distinct !DILexicalBlock(scope: !932, file: !3, line: 538, column: 5)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !956, line: 44, size: 1024, elements: !957)
!956 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!957 = !{!958, !960, !962, !964, !966, !968, !970, !971, !972, !973, !975, !976, !978, !986, !987, !988}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !955, file: !956, line: 46, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !143, line: 145, baseType: !64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !955, file: !956, line: 47, baseType: !961, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !143, line: 148, baseType: !64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !955, file: !956, line: 48, baseType: !963, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !143, line: 150, baseType: !7)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !955, file: !956, line: 49, baseType: !965, size: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !143, line: 151, baseType: !7)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !955, file: !956, line: 50, baseType: !967, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !143, line: 146, baseType: !7)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !955, file: !956, line: 51, baseType: !969, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !143, line: 147, baseType: !7)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !955, file: !956, line: 52, baseType: !959, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !955, file: !956, line: 53, baseType: !959, size: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !955, file: !956, line: 54, baseType: !142, size: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !955, file: !956, line: 55, baseType: !974, size: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !143, line: 175, baseType: !60)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !955, file: !956, line: 56, baseType: !60, size: 32, offset: 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !955, file: !956, line: 57, baseType: !977, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !143, line: 180, baseType: !144)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !955, file: !956, line: 65, baseType: !979, size: 128, offset: 576)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !980, line: 11, size: 128, elements: !981)
!980 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!981 = !{!982, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !979, file: !980, line: 16, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !143, line: 160, baseType: !144)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !979, file: !980, line: 21, baseType: !985, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !143, line: 197, baseType: !144)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !955, file: !956, line: 66, baseType: !979, size: 128, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !955, file: !956, line: 67, baseType: !979, size: 128, offset: 832)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !955, file: !956, line: 79, baseType: !989, size: 64, offset: 960)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !416)
!990 = !DILocalVariable(name: "d", scope: !991, file: !3, line: 653, type: !65)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 652, column: 9)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 650, column: 11)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 647, column: 5)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 641, column: 12)
!995 = distinct !DILexicalBlock(scope: !932, file: !3, line: 624, column: 7)
!996 = !DILocalVariable(name: "flags", scope: !991, file: !3, line: 655, type: !60)
!997 = !DILocalVariable(name: "i", scope: !998, file: !3, line: 698, type: !60)
!998 = distinct !DILexicalBlock(scope: !999, file: !3, line: 698, column: 7)
!999 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 675, column: 5)
!1000 = distinct !DILexicalBlock(scope: !932, file: !3, line: 674, column: 7)
!1001 = !DILocalVariable(name: "dest_base", scope: !1002, file: !3, line: 700, type: !57)
!1002 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 699, column: 9)
!1003 = distinct !DILexicalBlock(scope: !998, file: !3, line: 698, column: 7)
!1004 = !DILocalVariable(name: "dest", scope: !1002, file: !3, line: 701, type: !57)
!1005 = !DILocation(line: 0, scope: !932)
!1006 = !DILocation(line: 528, column: 21, scope: !932)
!1007 = !DILocation(line: 528, column: 3, scope: !932)
!1008 = !DILocation(line: 529, column: 3, scope: !932)
!1009 = !DILocation(line: 530, column: 3, scope: !932)
!1010 = !DILocation(line: 531, column: 3, scope: !932)
!1011 = !DILocation(line: 533, column: 3, scope: !932)
!1012 = !DILocation(line: 535, column: 3, scope: !932)
!1013 = !DILocation(line: 519, column: 9, scope: !932)
!1014 = !DILocation(line: 520, column: 15, scope: !932)
!1015 = !DILocation(line: 535, column: 15, scope: !932)
!1016 = !DILocation(line: 543, column: 15, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !953, file: !3, line: 543, column: 15)
!1018 = !DILocation(line: 543, column: 15, scope: !953)
!1019 = distinct !{!1019, !1012, !1020, !781}
!1020 = !DILocation(line: 604, column: 5, scope: !932)
!1021 = !DILocation(line: 548, column: 25, scope: !953)
!1022 = !DILocation(line: 549, column: 11, scope: !953)
!1023 = !DILocation(line: 551, column: 33, scope: !953)
!1024 = !DILocation(line: 552, column: 23, scope: !953)
!1025 = !DILocation(line: 553, column: 11, scope: !953)
!1026 = !DILocation(line: 555, column: 33, scope: !953)
!1027 = !DILocation(line: 556, column: 23, scope: !953)
!1028 = !DILocation(line: 557, column: 11, scope: !953)
!1029 = !DILocation(line: 559, column: 19, scope: !953)
!1030 = !DILocation(line: 560, column: 11, scope: !953)
!1031 = !DILocation(line: 562, column: 41, scope: !953)
!1032 = !DILocation(line: 563, column: 11, scope: !953)
!1033 = !DILocation(line: 565, column: 19, scope: !953)
!1034 = !DILocation(line: 566, column: 11, scope: !953)
!1035 = !DILocation(line: 568, column: 20, scope: !953)
!1036 = !DILocation(line: 569, column: 11, scope: !953)
!1037 = !DILocation(line: 571, column: 25, scope: !953)
!1038 = !DILocation(line: 572, column: 11, scope: !953)
!1039 = !DILocation(line: 574, column: 15, scope: !952)
!1040 = !DILocation(line: 574, column: 15, scope: !953)
!1041 = !DILocation(line: 575, column: 13, scope: !952)
!1042 = !DILocation(line: 578, column: 15, scope: !951)
!1043 = !DILocation(line: 578, column: 27, scope: !951)
!1044 = !DILocation(line: 579, column: 25, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !951, file: !3, line: 579, column: 19)
!1046 = !DILocation(line: 579, column: 19, scope: !1045)
!1047 = !DILocation(line: 579, column: 38, scope: !1045)
!1048 = !DILocation(line: 579, column: 19, scope: !951)
!1049 = !DILocation(line: 580, column: 17, scope: !1045)
!1050 = !DILocation(line: 582, column: 21, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !951, file: !3, line: 582, column: 19)
!1052 = !{!1053, !815, i64 16}
!1053 = !{!"stat", !1054, i64 0, !1054, i64 8, !815, i64 16, !815, i64 20, !815, i64 24, !815, i64 28, !1054, i64 32, !1054, i64 40, !1054, i64 48, !815, i64 56, !815, i64 60, !1054, i64 64, !1055, i64 72, !1055, i64 88, !1055, i64 104, !708, i64 120}
!1054 = !{!"long", !708, i64 0}
!1055 = !{!"timespec", !1054, i64 0, !1054, i64 8}
!1056 = !DILocation(line: 582, column: 19, scope: !951)
!1057 = !DILocation(line: 583, column: 17, scope: !1051)
!1058 = !DILocation(line: 585, column: 13, scope: !952)
!1059 = !DILocation(line: 586, column: 30, scope: !953)
!1060 = !DILocation(line: 587, column: 11, scope: !953)
!1061 = !DILocation(line: 592, column: 19, scope: !953)
!1062 = !DILocation(line: 593, column: 11, scope: !953)
!1063 = !DILocation(line: 596, column: 27, scope: !953)
!1064 = !DILocation(line: 597, column: 11, scope: !953)
!1065 = !DILocation(line: 598, column: 9, scope: !953)
!1066 = !DILocation(line: 599, column: 9, scope: !953)
!1067 = !DILocation(line: 601, column: 11, scope: !953)
!1068 = !DILocation(line: 606, column: 20, scope: !932)
!1069 = !DILocation(line: 606, column: 18, scope: !932)
!1070 = !DILocation(line: 607, column: 15, scope: !932)
!1071 = !DILocation(line: 609, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !932, file: !3, line: 609, column: 7)
!1073 = !DILocation(line: 609, column: 7, scope: !932)
!1074 = !DILocation(line: 611, column: 7, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 610, column: 5)
!1076 = !DILocation(line: 612, column: 7, scope: !1075)
!1077 = !DILocation(line: 615, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !932, file: !3, line: 615, column: 7)
!1079 = !DILocation(line: 615, column: 16, scope: !1078)
!1080 = !DILocation(line: 615, column: 20, scope: !1078)
!1081 = !DILocation(line: 615, column: 7, scope: !932)
!1082 = !DILocation(line: 616, column: 5, scope: !1078)
!1083 = !DILocation(line: 624, column: 7, scope: !932)
!1084 = !DILocation(line: 626, column: 11, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 626, column: 11)
!1086 = distinct !DILexicalBlock(scope: !995, file: !3, line: 625, column: 5)
!1087 = !DILocation(line: 626, column: 11, scope: !1086)
!1088 = !DILocation(line: 627, column: 9, scope: !1085)
!1089 = !DILocation(line: 630, column: 19, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 630, column: 11)
!1091 = !DILocation(line: 630, column: 11, scope: !1086)
!1092 = !DILocation(line: 632, column: 23, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 632, column: 15)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 631, column: 9)
!1095 = !DILocation(line: 632, column: 15, scope: !1094)
!1096 = !DILocation(line: 633, column: 13, scope: !1093)
!1097 = !DILocation(line: 637, column: 13, scope: !1093)
!1098 = !DILocation(line: 0, scope: !1093)
!1099 = !DILocation(line: 638, column: 11, scope: !1094)
!1100 = !DILocation(line: 641, column: 20, scope: !994)
!1101 = !DILocation(line: 641, column: 24, scope: !994)
!1102 = !DILocation(line: 648, column: 19, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !993, file: !3, line: 648, column: 11)
!1104 = !DILocation(line: 648, column: 24, scope: !1103)
!1105 = !DILocation(line: 649, column: 35, scope: !1103)
!1106 = !DILocation(line: 649, column: 54, scope: !1103)
!1107 = !DILocalVariable(name: "source", arg: 1, scope: !1108, file: !3, line: 160, type: !65)
!1108 = distinct !DISubprogram(name: "atomic_link", scope: !3, file: !3, line: 160, type: !1109, scopeLine: 161, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!60, !65, !60, !65}
!1111 = !{!1107, !1112, !1113}
!1112 = !DILocalVariable(name: "destdir_fd", arg: 2, scope: !1108, file: !3, line: 160, type: !60)
!1113 = !DILocalVariable(name: "dest_base", arg: 3, scope: !1108, file: !3, line: 160, type: !65)
!1114 = !DILocation(line: 0, scope: !1108, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 649, column: 22, scope: !1103)
!1116 = !DILocation(line: 162, column: 11, scope: !1108, inlinedAt: !1115)
!1117 = !DILocation(line: 163, column: 14, scope: !1108, inlinedAt: !1115)
!1118 = !DILocation(line: 164, column: 26, scope: !1108, inlinedAt: !1115)
!1119 = !DILocalVariable(name: "status", arg: 1, scope: !1120, file: !3, line: 115, type: !60)
!1120 = distinct !DISubprogram(name: "errnoize", scope: !3, file: !3, line: 115, type: !1121, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!60, !60}
!1123 = !{!1119}
!1124 = !DILocation(line: 0, scope: !1120, inlinedAt: !1125)
!1125 = distinct !DILocation(line: 164, column: 16, scope: !1108, inlinedAt: !1115)
!1126 = !DILocation(line: 117, column: 17, scope: !1120, inlinedAt: !1125)
!1127 = !DILocation(line: 117, column: 10, scope: !1120, inlinedAt: !1125)
!1128 = !DILocation(line: 167, column: 31, scope: !1108, inlinedAt: !1115)
!1129 = !DILocation(line: 166, column: 23, scope: !1108, inlinedAt: !1115)
!1130 = !DILocation(line: 0, scope: !1120, inlinedAt: !1131)
!1131 = distinct !DILocation(line: 166, column: 13, scope: !1108, inlinedAt: !1115)
!1132 = !DILocation(line: 117, column: 17, scope: !1120, inlinedAt: !1131)
!1133 = !DILocation(line: 117, column: 10, scope: !1120, inlinedAt: !1131)
!1134 = !DILocation(line: 650, column: 22, scope: !992)
!1135 = !DILocation(line: 650, column: 26, scope: !992)
!1136 = !DILocation(line: 654, column: 15, scope: !991)
!1137 = !DILocation(line: 654, column: 66, scope: !991)
!1138 = !DILocation(line: 654, column: 53, scope: !991)
!1139 = !DILocation(line: 0, scope: !991)
!1140 = !DILocation(line: 656, column: 27, scope: !991)
!1141 = !DILocation(line: 656, column: 24, scope: !991)
!1142 = !DILocation(line: 657, column: 24, scope: !991)
!1143 = !DILocation(line: 658, column: 17, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !991, file: !3, line: 658, column: 15)
!1145 = !DILocation(line: 658, column: 15, scope: !991)
!1146 = !DILocation(line: 660, column: 26, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 659, column: 13)
!1148 = !DILocation(line: 660, column: 23, scope: !1147)
!1149 = !DILocation(line: 662, column: 13, scope: !1147)
!1150 = !DILocation(line: 663, column: 36, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 663, column: 20)
!1152 = !DILocation(line: 664, column: 13, scope: !1151)
!1153 = !DILocation(line: 525, column: 7, scope: !932)
!1154 = !DILocation(line: 668, column: 18, scope: !932)
!1155 = !DILocation(line: 669, column: 34, scope: !932)
!1156 = !DILocation(line: 669, column: 20, scope: !932)
!1157 = !DILocation(line: 668, column: 15, scope: !932)
!1158 = !DILocation(line: 671, column: 3, scope: !932)
!1159 = !DILocation(line: 674, column: 7, scope: !1000)
!1160 = !DILocation(line: 674, column: 7, scope: !932)
!1161 = !DILocation(line: 679, column: 13, scope: !1162)
