; ModuleID = 'src/logname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [20 x i8] c"Usage: %s [OPTION]\0A\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"Print the user's login name.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"logname\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !30, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !37)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !28, globals: !36, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/logname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "be0652542a48a595035eed51530c903c")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !{!6, !29, !30, !31, !32, !35}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 46, baseType: !34)
!33 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!34 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!0}
!37 = !{!38, !39, !40, !43, !45, !46, !47, !51, !52, !53, !54, !56, !113, !114, !115, !117, !118}
!38 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!39 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!40 = !DILocalVariable(name: "term", scope: !41, file: !3, line: 585, type: !6)
!41 = distinct !DILexicalBlock(scope: !42, file: !3, line: 582, column: 5)
!42 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!43 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !44)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!46 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!47 = !DILocalVariable(name: "s", scope: !48, file: !3, line: 608, type: !6)
!48 = distinct !DILexicalBlock(scope: !49, file: !3, line: 605, column: 5)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 604, column: 12)
!50 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!51 = !DILocalVariable(name: "spaces", scope: !48, file: !3, line: 609, type: !32)
!52 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !32)
!53 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!54 = !DILocalVariable(name: "__ptr", scope: !55, file: !3, line: 644, type: !6)
!55 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!56 = !DILocalVariable(name: "__stream", scope: !55, file: !3, line: 644, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !60)
!59 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!62 = !{!63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !88, !90, !94, !97, !99, !102, !105, !106, !107, !108, !109}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !30, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !80, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocalVariable(name: "__cnt", scope: !55, file: !3, line: 644, type: !32)
!114 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!115 = !DILocalVariable(name: "__ptr", scope: !116, file: !3, line: 686, type: !6)
!116 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!117 = !DILocalVariable(name: "__stream", scope: !116, file: !3, line: 686, type: !57)
!118 = !DILocalVariable(name: "__cnt", scope: !116, file: !3, line: 686, type: !32)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Version", scope: !121, file: !122, line: 3, type: !6, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !123, splitDebugInlining: false, nameTableKind: None)
!122 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!123 = !{!119}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "file_name", scope: !126, file: !127, line: 45, type: !6, isLocal: true, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !128, splitDebugInlining: false, nameTableKind: None)
!127 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!128 = !{!124, !129}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !126, file: !127, line: 55, type: !44, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !133, file: !134, line: 66, type: !169, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !135, globals: !136, splitDebugInlining: false, nameTableKind: None)
!134 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!135 = !{!29, !35}
!136 = !{!137, !163, !131, !165, !167}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "old_file_name", scope: !139, file: !134, line: 304, type: !6, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "verror_at_line", scope: !134, file: !134, line: 298, type: !140, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !156)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !30, !30, !6, !14, !6, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !147, baseType: !148)
!147 = !DIFile(filename: "lib/error.c", directory: "/src")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !150)
!149 = !DINamespace(name: "std", scope: null)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !148, file: !147, baseType: !29, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 224)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DILocalVariable(name: "status", arg: 1, scope: !139, file: !134, line: 298, type: !30)
!158 = !DILocalVariable(name: "errnum", arg: 2, scope: !139, file: !134, line: 298, type: !30)
!159 = !DILocalVariable(name: "file_name", arg: 3, scope: !139, file: !134, line: 298, type: !6)
!160 = !DILocalVariable(name: "line_number", arg: 4, scope: !139, file: !134, line: 298, type: !14)
!161 = !DILocalVariable(name: "message", arg: 5, scope: !139, file: !134, line: 298, type: !6)
!162 = !DILocalVariable(name: "args", arg: 6, scope: !139, file: !134, line: 298, type: !142)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "old_line_number", scope: !139, file: !134, line: 305, type: !14, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "error_message_count", scope: !133, file: !134, line: 69, type: !14, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !133, file: !134, line: 295, type: !30, isLocal: false, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "long_options", scope: !174, file: !175, line: 34, type: !177, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!176 = !{!172}
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !187)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !180, line: 50, size: 256, elements: !181)
!180 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 52, baseType: !6, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !179, file: !180, line: 55, baseType: !30, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !180, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !180, line: 57, baseType: !30, size: 32, offset: 192)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "program_name", scope: !191, file: !192, line: 31, type: !6, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !193, globals: !194, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!193 = !{!65}
!194 = !{!189}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "utf07FF", scope: !197, file: !198, line: 46, type: !228, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "proper_name_lite", scope: !198, file: !198, line: 38, type: !199, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !203)
!198 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!199 = !DISubroutineType(types: !200)
!200 = !{!6, !6, !6}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !202, splitDebugInlining: false, nameTableKind: None)
!202 = !{!195}
!203 = !{!204, !205, !206, !207, !212}
!204 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !197, file: !198, line: 38, type: !6)
!205 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !197, file: !198, line: 38, type: !6)
!206 = !DILocalVariable(name: "translation", scope: !197, file: !198, line: 40, type: !6)
!207 = !DILocalVariable(name: "w", scope: !197, file: !198, line: 47, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !209, line: 37, baseType: !210)
!209 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !85, line: 57, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 42, baseType: !14)
!212 = !DILocalVariable(name: "mbs", scope: !197, file: !198, line: 48, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !217, file: !216, line: 15, baseType: !30, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !217, file: !216, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !216, line: 16, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !216, line: 18, baseType: !14, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !216, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 4)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !233, file: !234, line: 76, type: !316, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !255, globals: !256, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!235 = !{!236, !250, !12}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !237, line: 42, baseType: !14, size: 32, elements: !238)
!237 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!239 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!240 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!241 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!242 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!243 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!244 = !DIEnumerator(name: "c_quoting_style", value: 5)
!245 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!246 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!247 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!248 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!249 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !237, line: 254, baseType: !14, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!30, !31, !32}
!256 = !{!231, !257, !263, !275, !277, !282, !305, !312, !314}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !233, file: !234, line: 92, type: !259, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !233, file: !234, line: 1040, type: !265, isLocal: false, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !234, line: 56, size: 448, elements: !266)
!266 = !{!267, !268, !269, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !265, file: !234, line: 59, baseType: !236, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !234, line: 62, baseType: !30, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !265, file: !234, line: 66, baseType: !270, size: 256, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !265, file: !234, line: 69, baseType: !6, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !265, file: !234, line: 72, baseType: !6, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !233, file: !234, line: 107, type: !265, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !233, file: !234, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !234, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !234, file: !234, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!6, !6, !236}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !234, line: 197, type: !6)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !234, line: 197, type: !236)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !234, line: 199, type: !6)
!291 = !DILocalVariable(name: "w", scope: !284, file: !234, line: 229, type: !208)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !234, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !216, line: 15, baseType: !30, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !216, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !216, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !216, line: 18, baseType: !14, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !216, line: 19, baseType: !225, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !304)
!304 = !{!230, !227}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !233, file: !234, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !234, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !234, line: 825, baseType: !32, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !234, line: 826, baseType: !65, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !233, file: !234, line: 832, type: !30, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !233, file: !234, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !323, line: 26, type: !325, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!324 = !{!320}
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "exit_failure", scope: !330, file: !331, line: 24, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!332 = !{!328}
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "internal_state", scope: !336, file: !337, line: 97, type: !340, isLocal: true, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !339, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!338 = !{!29, !32, !35}
!339 = !{!334}
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !342, file: !216, line: 15, baseType: !30, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !342, file: !216, line: 20, baseType: !346, size: 32, offset: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !216, line: 16, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !346, file: !216, line: 18, baseType: !14, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !346, file: !216, line: 19, baseType: !225, size: 32)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !354, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!354 = !{!355}
!355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !353, line: 40, baseType: !14, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!358 = !{!29}
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !361, retainedTypes: !392, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!361 = !{!362, !374}
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !363, file: !360, line: 188, baseType: !14, size: 32, elements: !372)
!363 = distinct !DISubprogram(name: "x2nrealloc", scope: !360, file: !360, line: 176, type: !364, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !367)
!364 = !DISubroutineType(types: !365)
!365 = !{!29, !29, !366, !32}
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!367 = !{!368, !369, !370, !371}
!368 = !DILocalVariable(name: "p", arg: 1, scope: !363, file: !360, line: 176, type: !29)
!369 = !DILocalVariable(name: "pn", arg: 2, scope: !363, file: !360, line: 176, type: !366)
!370 = !DILocalVariable(name: "s", arg: 3, scope: !363, file: !360, line: 176, type: !32)
!371 = !DILocalVariable(name: "n", scope: !363, file: !360, line: 178, type: !32)
!372 = !{!373}
!373 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !375, file: !360, line: 228, baseType: !14, size: 32, elements: !372)
!375 = distinct !DISubprogram(name: "xpalloc", scope: !360, file: !360, line: 223, type: !376, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !359, retainedNodes: !382)
!376 = !DISubroutineType(types: !377)
!377 = !{!29, !29, !378, !379, !381, !379}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !380, line: 130, baseType: !381)
!380 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !33, line: 35, baseType: !86)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391}
!383 = !DILocalVariable(name: "pa", arg: 1, scope: !375, file: !360, line: 223, type: !29)
!384 = !DILocalVariable(name: "pn", arg: 2, scope: !375, file: !360, line: 223, type: !378)
!385 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !375, file: !360, line: 223, type: !379)
!386 = !DILocalVariable(name: "n_max", arg: 4, scope: !375, file: !360, line: 223, type: !381)
!387 = !DILocalVariable(name: "s", arg: 5, scope: !375, file: !360, line: 223, type: !379)
!388 = !DILocalVariable(name: "n0", scope: !375, file: !360, line: 230, type: !379)
!389 = !DILocalVariable(name: "n", scope: !375, file: !360, line: 237, type: !379)
!390 = !DILocalVariable(name: "nbytes", scope: !375, file: !360, line: 248, type: !379)
!391 = !DILocalVariable(name: "adjusted_nbytes", scope: !375, file: !360, line: 252, type: !379)
!392 = !{!65, !29, !44, !86, !34}
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !405, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!405 = !{!44, !34, !29}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !358, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!412 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!413 = !{i32 7, !"Dwarf Version", i32 5}
!414 = !{i32 2, !"Debug Info Version", i32 3}
!415 = !{i32 1, !"wchar_size", i32 4}
!416 = !{i32 1, !"branch-target-enforcement", i32 0}
!417 = !{i32 1, !"sign-return-address", i32 0}
!418 = !{i32 1, !"sign-return-address-all", i32 0}
!419 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!420 = !{i32 7, !"PIC Level", i32 2}
!421 = !{i32 7, !"PIE Level", i32 2}
!422 = !{i32 7, !"uwtable", i32 1}
!423 = !{i32 7, !"frame-pointer", i32 1}
!424 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 31, type: !425, scopeLine: 32, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !427)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !30}
!427 = !{!428}
!428 = !DILocalVariable(name: "status", arg: 1, scope: !424, file: !10, line: 31, type: !30)
!429 = !DILocation(line: 0, scope: !424)
!430 = !DILocation(line: 33, column: 14, scope: !431)
!431 = distinct !DILexicalBlock(scope: !424, file: !10, line: 33, column: 7)
!432 = !DILocation(line: 33, column: 7, scope: !424)
!433 = !DILocation(line: 34, column: 5, scope: !434)
!434 = distinct !DILexicalBlock(scope: !431, file: !10, line: 34, column: 5)
!435 = !{!436, !436, i64 0}
!436 = !{!"any pointer", !437, i64 0}
!437 = !{!"omnipotent char", !438, i64 0}
!438 = !{!"Simple C/C++ TBAA"}
!439 = !DILocation(line: 37, column: 7, scope: !440)
!440 = distinct !DILexicalBlock(scope: !431, file: !10, line: 36, column: 5)
!441 = !DILocation(line: 38, column: 7, scope: !440)
!442 = !DILocation(line: 42, column: 7, scope: !440)
!443 = !DILocation(line: 43, column: 7, scope: !440)
!444 = !DILocalVariable(name: "program", arg: 1, scope: !445, file: !3, line: 836, type: !6)
!445 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !446, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !6}
!448 = !{!444, !449, !458, !459, !461, !462}
!449 = !DILocalVariable(name: "infomap", scope: !445, file: !3, line: 838, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 896, elements: !456)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !445, file: !3, line: 838, size: 128, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !452, file: !3, line: 838, baseType: !6, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !452, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!456 = !{!457}
!457 = !DISubrange(count: 7)
!458 = !DILocalVariable(name: "node", scope: !445, file: !3, line: 848, type: !6)
!459 = !DILocalVariable(name: "map_prog", scope: !445, file: !3, line: 849, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!461 = !DILocalVariable(name: "lc_messages", scope: !445, file: !3, line: 861, type: !6)
!462 = !DILocalVariable(name: "url_program", scope: !445, file: !3, line: 874, type: !6)
!463 = !DILocation(line: 0, scope: !445, inlinedAt: !464)
!464 = distinct !DILocation(line: 44, column: 7, scope: !440)
!465 = !DILocation(line: 838, column: 3, scope: !445, inlinedAt: !464)
!466 = !DILocation(line: 838, column: 67, scope: !445, inlinedAt: !464)
!467 = !DILocation(line: 849, column: 36, scope: !445, inlinedAt: !464)
!468 = !DILocation(line: 851, column: 3, scope: !445, inlinedAt: !464)
!469 = !DILocalVariable(name: "__s1", arg: 1, scope: !470, file: !471, line: 1359, type: !6)
!470 = distinct !DISubprogram(name: "streq", scope: !471, file: !471, line: 1359, type: !472, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !474)
!471 = !DIFile(filename: "./lib/string.h", directory: "/src")
!472 = !DISubroutineType(types: !473)
!473 = !{!44, !6, !6}
!474 = !{!469, !475}
!475 = !DILocalVariable(name: "__s2", arg: 2, scope: !470, file: !471, line: 1359, type: !6)
!476 = !DILocation(line: 0, scope: !470, inlinedAt: !477)
!477 = distinct !DILocation(line: 851, column: 33, scope: !445, inlinedAt: !464)
!478 = !DILocation(line: 1361, column: 11, scope: !470, inlinedAt: !477)
!479 = !DILocation(line: 1361, column: 10, scope: !470, inlinedAt: !477)
!480 = !DILocation(line: 852, column: 13, scope: !445, inlinedAt: !464)
!481 = !DILocation(line: 851, column: 20, scope: !445, inlinedAt: !464)
!482 = !{!483, !436, i64 0}
!483 = !{!"infomap", !436, i64 0, !436, i64 8}
!484 = !DILocation(line: 851, column: 10, scope: !445, inlinedAt: !464)
!485 = !DILocation(line: 851, column: 28, scope: !445, inlinedAt: !464)
!486 = distinct !{!486, !468, !480, !487}
!487 = !{!"llvm.loop.mustprogress"}
!488 = !DILocation(line: 854, column: 17, scope: !489, inlinedAt: !464)
!489 = distinct !DILexicalBlock(scope: !445, file: !3, line: 854, column: 7)
!490 = !{!483, !436, i64 8}
!491 = !DILocation(line: 854, column: 7, scope: !489, inlinedAt: !464)
!492 = !DILocation(line: 854, column: 7, scope: !445, inlinedAt: !464)
!493 = !DILocation(line: 857, column: 3, scope: !445, inlinedAt: !464)
!494 = !DILocation(line: 861, column: 29, scope: !445, inlinedAt: !464)
!495 = !DILocation(line: 862, column: 7, scope: !496, inlinedAt: !464)
!496 = distinct !DILexicalBlock(scope: !445, file: !3, line: 862, column: 7)
!497 = !DILocation(line: 862, column: 19, scope: !496, inlinedAt: !464)
!498 = !DILocation(line: 862, column: 22, scope: !496, inlinedAt: !464)
!499 = !DILocation(line: 862, column: 7, scope: !445, inlinedAt: !464)
!500 = !DILocation(line: 868, column: 7, scope: !501, inlinedAt: !464)
!501 = distinct !DILexicalBlock(scope: !496, file: !3, line: 863, column: 5)
!502 = !DILocation(line: 870, column: 5, scope: !501, inlinedAt: !464)
!503 = !DILocation(line: 0, scope: !470, inlinedAt: !504)
!504 = distinct !DILocation(line: 874, column: 29, scope: !445, inlinedAt: !464)
!505 = !DILocation(line: 875, column: 3, scope: !445, inlinedAt: !464)
!506 = !DILocation(line: 877, column: 3, scope: !445, inlinedAt: !464)
!507 = !DILocation(line: 879, column: 1, scope: !445, inlinedAt: !464)
!508 = !DILocation(line: 46, column: 3, scope: !424)
!509 = !DISubprogram(name: "dcgettext", scope: !510, file: !510, line: 51, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!510 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!511 = !DISubroutineType(types: !512)
!512 = !{!65, !6, !6, !30}
!513 = !{}
!514 = !DISubprogram(name: "fputs_unlocked", scope: !143, file: !143, line: 691, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!515 = !DISubroutineType(types: !516)
!516 = !{!30, !517, !518}
!517 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!518 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!519 = !DILocation(line: 0, scope: !2)
!520 = !DILocation(line: 581, column: 7, scope: !42)
!521 = !{!522, !522, i64 0}
!522 = !{!"int", !437, i64 0}
!523 = !DILocation(line: 581, column: 19, scope: !42)
!524 = !DILocation(line: 581, column: 7, scope: !2)
!525 = !DILocation(line: 585, column: 26, scope: !41)
!526 = !DILocation(line: 0, scope: !41)
!527 = !DILocation(line: 586, column: 23, scope: !41)
!528 = !DILocation(line: 586, column: 28, scope: !41)
!529 = !DILocation(line: 586, column: 32, scope: !41)
!530 = !{!437, !437, i64 0}
!531 = !DILocation(line: 586, column: 38, scope: !41)
!532 = !DILocation(line: 0, scope: !470, inlinedAt: !533)
!533 = distinct !DILocation(line: 586, column: 41, scope: !41)
!534 = !DILocation(line: 1361, column: 11, scope: !470, inlinedAt: !533)
!535 = !DILocation(line: 1361, column: 10, scope: !470, inlinedAt: !533)
!536 = !DILocation(line: 586, column: 19, scope: !41)
!537 = !DILocation(line: 587, column: 5, scope: !41)
!538 = !DILocation(line: 588, column: 7, scope: !539)
!539 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!540 = !DILocation(line: 588, column: 7, scope: !2)
!541 = !DILocation(line: 590, column: 7, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !3, line: 589, column: 5)
!543 = !DILocation(line: 591, column: 7, scope: !542)
!544 = !DILocation(line: 595, column: 37, scope: !2)
!545 = !DILocation(line: 595, column: 35, scope: !2)
!546 = !DILocation(line: 596, column: 29, scope: !2)
!547 = !DILocation(line: 597, column: 8, scope: !50)
!548 = !DILocation(line: 597, column: 7, scope: !2)
!549 = !DILocation(line: 604, column: 24, scope: !49)
!550 = !DILocation(line: 604, column: 12, scope: !50)
!551 = !DILocation(line: 0, scope: !48)
!552 = !DILocation(line: 610, column: 16, scope: !48)
!553 = !DILocation(line: 610, column: 7, scope: !48)
!554 = !DILocation(line: 611, column: 21, scope: !48)
!555 = !{!556, !556, i64 0}
!556 = !{!"short", !437, i64 0}
!557 = !DILocation(line: 611, column: 19, scope: !48)
!558 = !DILocation(line: 611, column: 16, scope: !48)
!559 = !DILocation(line: 610, column: 30, scope: !48)
!560 = distinct !{!560, !553, !554, !487}
!561 = !DILocation(line: 612, column: 18, scope: !562)
!562 = distinct !DILexicalBlock(scope: !48, file: !3, line: 612, column: 11)
!563 = !DILocation(line: 612, column: 11, scope: !48)
!564 = !DILocation(line: 620, column: 23, scope: !2)
!565 = !DILocation(line: 625, column: 39, scope: !2)
!566 = !DILocation(line: 626, column: 3, scope: !2)
!567 = !DILocation(line: 626, column: 10, scope: !2)
!568 = !DILocation(line: 626, column: 21, scope: !2)
!569 = !DILocation(line: 628, column: 44, scope: !570)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 628, column: 11)
!571 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!572 = !DILocation(line: 628, column: 32, scope: !570)
!573 = !DILocation(line: 628, column: 49, scope: !570)
!574 = !DILocation(line: 628, column: 11, scope: !571)
!575 = !DILocation(line: 630, column: 11, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !3, line: 630, column: 11)
!577 = !DILocation(line: 630, column: 11, scope: !571)
!578 = !DILocation(line: 632, column: 26, scope: !579)
!579 = distinct !DILexicalBlock(scope: !580, file: !3, line: 632, column: 15)
!580 = distinct !DILexicalBlock(scope: !576, file: !3, line: 631, column: 9)
!581 = !DILocation(line: 632, column: 34, scope: !579)
!582 = !DILocation(line: 632, column: 37, scope: !579)
!583 = !DILocation(line: 632, column: 15, scope: !580)
!584 = !DILocation(line: 636, column: 29, scope: !585)
!585 = distinct !DILexicalBlock(scope: !580, file: !3, line: 636, column: 15)
!586 = !DILocation(line: 640, column: 16, scope: !571)
!587 = distinct !{!587, !566, !588, !487}
!588 = !DILocation(line: 641, column: 5, scope: !2)
!589 = !DILocation(line: 644, column: 3, scope: !2)
!590 = !DILocation(line: 0, scope: !470, inlinedAt: !591)
!591 = distinct !DILocation(line: 648, column: 31, scope: !2)
!592 = !DILocation(line: 0, scope: !470, inlinedAt: !593)
!593 = distinct !DILocation(line: 649, column: 31, scope: !2)
!594 = !DILocation(line: 0, scope: !470, inlinedAt: !595)
!595 = distinct !DILocation(line: 650, column: 31, scope: !2)
!596 = !DILocation(line: 0, scope: !470, inlinedAt: !597)
!597 = distinct !DILocation(line: 651, column: 31, scope: !2)
!598 = !DILocation(line: 0, scope: !470, inlinedAt: !599)
!599 = distinct !DILocation(line: 652, column: 31, scope: !2)
!600 = !DILocation(line: 0, scope: !470, inlinedAt: !601)
!601 = distinct !DILocation(line: 653, column: 31, scope: !2)
!602 = !DILocation(line: 0, scope: !470, inlinedAt: !603)
!603 = distinct !DILocation(line: 654, column: 31, scope: !2)
!604 = !DILocation(line: 0, scope: !470, inlinedAt: !605)
!605 = distinct !DILocation(line: 655, column: 31, scope: !2)
!606 = !DILocation(line: 0, scope: !470, inlinedAt: !607)
!607 = distinct !DILocation(line: 656, column: 31, scope: !2)
!608 = !DILocation(line: 0, scope: !470, inlinedAt: !609)
!609 = distinct !DILocation(line: 657, column: 31, scope: !2)
!610 = !DILocation(line: 663, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!612 = !DILocation(line: 664, column: 7, scope: !611)
!613 = !DILocation(line: 664, column: 10, scope: !611)
!614 = !DILocation(line: 663, column: 7, scope: !2)
!615 = !DILocation(line: 669, column: 7, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !3, line: 665, column: 5)
!617 = !DILocation(line: 671, column: 5, scope: !616)
!618 = !DILocation(line: 676, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !611, file: !3, line: 673, column: 5)
!620 = !DILocation(line: 679, column: 3, scope: !2)
!621 = !DILocation(line: 683, column: 3, scope: !2)
!622 = !DILocation(line: 686, column: 3, scope: !2)
!623 = !DILocation(line: 688, column: 3, scope: !2)
!624 = !DILocation(line: 691, column: 3, scope: !2)
!625 = !DILocation(line: 695, column: 3, scope: !2)
!626 = !DILocation(line: 696, column: 1, scope: !2)
!627 = !DISubprogram(name: "setlocale", scope: !628, file: !628, line: 122, type: !629, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!628 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!629 = !DISubroutineType(types: !630)
!630 = !{!65, !30, !6}
!631 = !DISubprogram(name: "getenv", scope: !632, file: !632, line: 641, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!632 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!633 = !DISubroutineType(types: !634)
!634 = !{!65, !6}
!635 = !DISubprogram(name: "fwrite_unlocked", scope: !143, file: !143, line: 704, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!636 = !DISubroutineType(types: !637)
!637 = !{!32, !638, !32, !32, !518}
!638 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!641 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 50, type: !642, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !645)
!642 = !DISubroutineType(types: !643)
!643 = !{!30, !30, !644}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!645 = !{!646, !647, !648}
!646 = !DILocalVariable(name: "argc", arg: 1, scope: !641, file: !10, line: 50, type: !30)
!647 = !DILocalVariable(name: "argv", arg: 2, scope: !641, file: !10, line: 50, type: !644)
!648 = !DILocalVariable(name: "cp", scope: !641, file: !10, line: 72, type: !6)
!649 = !DILocation(line: 0, scope: !641)
!650 = !DILocation(line: 53, column: 21, scope: !641)
!651 = !DILocation(line: 53, column: 3, scope: !641)
!652 = !DILocation(line: 54, column: 3, scope: !641)
!653 = !DILocation(line: 55, column: 3, scope: !641)
!654 = !DILocation(line: 56, column: 3, scope: !641)
!655 = !DILocation(line: 58, column: 3, scope: !641)
!656 = !DILocation(line: 61, column: 36, scope: !641)
!657 = !DILocation(line: 61, column: 58, scope: !641)
!658 = !DILocation(line: 60, column: 3, scope: !641)
!659 = !DILocation(line: 64, column: 7, scope: !660)
!660 = distinct !DILexicalBlock(scope: !641, file: !10, line: 64, column: 7)
!661 = !DILocation(line: 64, column: 14, scope: !660)
!662 = !DILocation(line: 64, column: 7, scope: !641)
!663 = !DILocation(line: 66, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !660, file: !10, line: 65, column: 5)
!665 = !DILocation(line: 67, column: 7, scope: !664)
!666 = !DILocation(line: 72, column: 20, scope: !641)
!667 = !DILocation(line: 73, column: 9, scope: !668)
!668 = distinct !DILexicalBlock(scope: !641, file: !10, line: 73, column: 7)
!669 = !DILocation(line: 73, column: 7, scope: !641)
!670 = !DILocation(line: 74, column: 5, scope: !668)
!671 = !DILocation(line: 76, column: 3, scope: !641)
!672 = !DILocation(line: 77, column: 3, scope: !641)
!673 = !DISubprogram(name: "bindtextdomain", scope: !510, file: !510, line: 86, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!674 = !DISubroutineType(types: !675)
!675 = !{!65, !6, !6}
!676 = !DISubprogram(name: "textdomain", scope: !510, file: !510, line: 82, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!677 = !DISubprogram(name: "atexit", scope: !632, file: !632, line: 602, type: !678, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!678 = !DISubroutineType(types: !679)
!679 = !{!30, !169}
!680 = !DISubprogram(name: "getlogin", scope: !681, file: !681, line: 881, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!681 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!682 = !DISubroutineType(types: !193)
!683 = !DISubprogram(name: "puts", scope: !143, file: !143, line: 661, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!684 = !DISubroutineType(types: !685)
!685 = !{!30, !6}
!686 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !127, file: !127, line: 50, type: !446, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !687)
!687 = !{!688}
!688 = !DILocalVariable(name: "file", arg: 1, scope: !686, file: !127, line: 50, type: !6)
!689 = !DILocation(line: 0, scope: !686)
!690 = !DILocation(line: 52, column: 13, scope: !686)
!691 = !DILocation(line: 53, column: 1, scope: !686)
!692 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !127, file: !127, line: 87, type: !693, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !695)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !44}
!695 = !{!696}
!696 = !DILocalVariable(name: "ignore", arg: 1, scope: !692, file: !127, line: 87, type: !44)
!697 = !DILocation(line: 0, scope: !692)
!698 = !DILocation(line: 89, column: 16, scope: !692)
!699 = !{!700, !700, i64 0}
!700 = !{!"_Bool", !437, i64 0}
!701 = !DILocation(line: 90, column: 1, scope: !692)
!702 = distinct !DISubprogram(name: "close_stdout", scope: !127, file: !127, line: 116, type: !170, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !703)
!703 = !{!704}
!704 = !DILocalVariable(name: "write_error", scope: !705, file: !127, line: 121, type: !6)
!705 = distinct !DILexicalBlock(scope: !706, file: !127, line: 120, column: 5)
!706 = distinct !DILexicalBlock(scope: !702, file: !127, line: 118, column: 7)
!707 = !DILocation(line: 118, column: 21, scope: !706)
!708 = !DILocation(line: 118, column: 7, scope: !706)
!709 = !DILocation(line: 118, column: 29, scope: !706)
!710 = !DILocation(line: 119, column: 7, scope: !706)
!711 = !DILocation(line: 119, column: 12, scope: !706)
!712 = !{i8 0, i8 2}
!713 = !DILocation(line: 119, column: 25, scope: !706)
!714 = !DILocation(line: 119, column: 28, scope: !706)
!715 = !DILocation(line: 119, column: 34, scope: !706)
!716 = !DILocation(line: 118, column: 7, scope: !702)
!717 = !DILocation(line: 121, column: 33, scope: !705)
!718 = !DILocation(line: 0, scope: !705)
!719 = !DILocation(line: 122, column: 11, scope: !720)
!720 = distinct !DILexicalBlock(scope: !705, file: !127, line: 122, column: 11)
!721 = !DILocation(line: 0, scope: !720)
!722 = !DILocation(line: 122, column: 11, scope: !705)
!723 = !DILocation(line: 123, column: 9, scope: !720)
!724 = !DILocation(line: 126, column: 9, scope: !720)
!725 = !DILocation(line: 128, column: 14, scope: !705)
!726 = !DILocation(line: 128, column: 7, scope: !705)
!727 = !DILocation(line: 133, column: 42, scope: !728)
!728 = distinct !DILexicalBlock(scope: !702, file: !127, line: 133, column: 7)
!729 = !DILocation(line: 133, column: 28, scope: !728)
!730 = !DILocation(line: 133, column: 50, scope: !728)
!731 = !DILocation(line: 133, column: 7, scope: !702)
!732 = !DILocation(line: 134, column: 12, scope: !728)
!733 = !DILocation(line: 134, column: 5, scope: !728)
!734 = !DILocation(line: 135, column: 1, scope: !702)
!735 = distinct !DISubprogram(name: "verror", scope: !134, file: !134, line: 251, type: !736, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !738)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !30, !30, !6, !142}
!738 = !{!739, !740, !741, !742}
!739 = !DILocalVariable(name: "status", arg: 1, scope: !735, file: !134, line: 251, type: !30)
!740 = !DILocalVariable(name: "errnum", arg: 2, scope: !735, file: !134, line: 251, type: !30)
!741 = !DILocalVariable(name: "message", arg: 3, scope: !735, file: !134, line: 251, type: !6)
!742 = !DILocalVariable(name: "args", arg: 4, scope: !735, file: !134, line: 251, type: !142)
!743 = !DILocation(line: 0, scope: !735)
!744 = !DILocation(line: 251, column: 1, scope: !735)
!745 = !DILocation(line: 261, column: 3, scope: !735)
!746 = !DILocation(line: 265, column: 7, scope: !747)
!747 = distinct !DILexicalBlock(scope: !735, file: !134, line: 265, column: 7)
!748 = !DILocation(line: 265, column: 7, scope: !735)
!749 = !DILocation(line: 266, column: 5, scope: !747)
!750 = !DILocation(line: 272, column: 7, scope: !751)
!751 = distinct !DILexicalBlock(scope: !747, file: !134, line: 268, column: 5)
!752 = !DILocation(line: 276, column: 3, scope: !735)
!753 = !{i64 0, i64 8, !435, i64 8, i64 8, !435, i64 16, i64 8, !435, i64 24, i64 4, !521, i64 28, i64 4, !521}
!754 = !DILocation(line: 282, column: 1, scope: !735)
!755 = distinct !DISubprogram(name: "flush_stdout", scope: !134, file: !134, line: 163, type: !170, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !756)
!756 = !{!757}
!757 = !DILocalVariable(name: "stdout_fd", scope: !755, file: !134, line: 166, type: !30)
!758 = !DILocation(line: 0, scope: !755)
!759 = !DILocalVariable(name: "fd", arg: 1, scope: !760, file: !134, line: 145, type: !30)
!760 = distinct !DISubprogram(name: "is_open", scope: !134, file: !134, line: 145, type: !761, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{!30, !30}
!763 = !{!759}
!764 = !DILocation(line: 0, scope: !760, inlinedAt: !765)
!765 = distinct !DILocation(line: 182, column: 25, scope: !766)
!766 = distinct !DILexicalBlock(scope: !755, file: !134, line: 182, column: 7)
!767 = !DILocation(line: 157, column: 15, scope: !760, inlinedAt: !765)
!768 = !DILocation(line: 182, column: 25, scope: !766)
!769 = !DILocation(line: 182, column: 7, scope: !755)
!770 = !DILocation(line: 184, column: 5, scope: !766)
!771 = !DILocation(line: 185, column: 1, scope: !755)
!772 = distinct !DISubprogram(name: "error_tail", scope: !134, file: !134, line: 219, type: !736, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DILocalVariable(name: "status", arg: 1, scope: !772, file: !134, line: 219, type: !30)
!775 = !DILocalVariable(name: "errnum", arg: 2, scope: !772, file: !134, line: 219, type: !30)
!776 = !DILocalVariable(name: "message", arg: 3, scope: !772, file: !134, line: 219, type: !6)
!777 = !DILocalVariable(name: "args", arg: 4, scope: !772, file: !134, line: 219, type: !142)
!778 = !DILocation(line: 0, scope: !772)
!779 = !DILocation(line: 219, column: 1, scope: !772)
!780 = !DILocation(line: 229, column: 13, scope: !772)
!781 = !DILocation(line: 229, column: 3, scope: !772)
!782 = !DILocalVariable(name: "__stream", arg: 1, scope: !783, file: !784, line: 132, type: !787)
!783 = distinct !DISubprogram(name: "vfprintf", scope: !784, file: !784, line: 132, type: !785, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !822)
!784 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!785 = !DISubroutineType(types: !786)
!786 = !{!30, !787, !517, !144}
!787 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !790, file: !61, line: 51, baseType: !30, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !790, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !790, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !790, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !790, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !790, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !790, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !790, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !790, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !790, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !790, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !790, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !790, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !790, file: !61, line: 70, baseType: !806, size: 64, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !790, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !790, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !790, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !790, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !790, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !790, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !790, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !790, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !790, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !790, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !790, file: !61, line: 93, baseType: !806, size: 64, offset: 1344)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !790, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !790, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !790, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !790, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!822 = !{!782, !823, !824}
!823 = !DILocalVariable(name: "__fmt", arg: 2, scope: !783, file: !784, line: 133, type: !517)
!824 = !DILocalVariable(name: "__ap", arg: 3, scope: !783, file: !784, line: 133, type: !144)
!825 = !DILocation(line: 0, scope: !783, inlinedAt: !826)
!826 = distinct !DILocation(line: 229, column: 3, scope: !772)
!827 = !DILocation(line: 135, column: 10, scope: !783, inlinedAt: !826)
!828 = !{!829, !831}
!829 = distinct !{!829, !830, !"vfprintf.inline: argument 0"}
!830 = distinct !{!830, !"vfprintf.inline"}
!831 = distinct !{!831, !830, !"vfprintf.inline: argument 1"}
!832 = !DILocation(line: 232, column: 3, scope: !772)
!833 = !DILocation(line: 233, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !772, file: !134, line: 233, column: 7)
!835 = !DILocation(line: 233, column: 7, scope: !772)
!836 = !DILocalVariable(name: "errnum", arg: 1, scope: !837, file: !134, line: 188, type: !30)
!837 = distinct !DISubprogram(name: "print_errno_message", scope: !134, file: !134, line: 188, type: !425, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !838)
!838 = !{!836, !839, !840}
!839 = !DILocalVariable(name: "s", scope: !837, file: !134, line: 190, type: !6)
!840 = !DILocalVariable(name: "errbuf", scope: !837, file: !134, line: 193, type: !841)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 1024)
!844 = !DILocation(line: 0, scope: !837, inlinedAt: !845)
!845 = distinct !DILocation(line: 234, column: 5, scope: !834)
!846 = !DILocation(line: 193, column: 3, scope: !837, inlinedAt: !845)
!847 = !DILocation(line: 193, column: 8, scope: !837, inlinedAt: !845)
!848 = !DILocation(line: 195, column: 7, scope: !837, inlinedAt: !845)
!849 = !DILocation(line: 207, column: 9, scope: !850, inlinedAt: !845)
!850 = distinct !DILexicalBlock(scope: !837, file: !134, line: 207, column: 7)
!851 = !DILocation(line: 207, column: 7, scope: !837, inlinedAt: !845)
!852 = !DILocation(line: 208, column: 9, scope: !850, inlinedAt: !845)
!853 = !DILocation(line: 208, column: 5, scope: !850, inlinedAt: !845)
!854 = !DILocation(line: 214, column: 3, scope: !837, inlinedAt: !845)
!855 = !DILocation(line: 216, column: 1, scope: !837, inlinedAt: !845)
!856 = !DILocation(line: 234, column: 5, scope: !834)
!857 = !DILocation(line: 238, column: 3, scope: !772)
!858 = !DILocalVariable(name: "__c", arg: 1, scope: !859, file: !860, line: 101, type: !30)
!859 = distinct !DISubprogram(name: "putc_unlocked", scope: !860, file: !860, line: 101, type: !861, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !863)
!860 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!861 = !DISubroutineType(types: !862)
!862 = !{!30, !30, !788}
!863 = !{!858, !864}
!864 = !DILocalVariable(name: "__stream", arg: 2, scope: !859, file: !860, line: 101, type: !788)
!865 = !DILocation(line: 0, scope: !859, inlinedAt: !866)
!866 = distinct !DILocation(line: 238, column: 3, scope: !772)
!867 = !DILocation(line: 103, column: 10, scope: !859, inlinedAt: !866)
!868 = !{!869, !436, i64 40}
!869 = !{!"_IO_FILE", !522, i64 0, !436, i64 8, !436, i64 16, !436, i64 24, !436, i64 32, !436, i64 40, !436, i64 48, !436, i64 56, !436, i64 64, !436, i64 72, !436, i64 80, !436, i64 88, !436, i64 96, !436, i64 104, !522, i64 112, !522, i64 116, !870, i64 120, !556, i64 128, !437, i64 130, !437, i64 131, !436, i64 136, !870, i64 144, !436, i64 152, !436, i64 160, !436, i64 168, !436, i64 176, !870, i64 184, !522, i64 192, !437, i64 196}
!870 = !{!"long", !437, i64 0}
!871 = !{!869, !436, i64 48}
!872 = !{!"branch_weights", i32 2000, i32 1}
!873 = !DILocation(line: 240, column: 3, scope: !772)
!874 = !DILocation(line: 241, column: 7, scope: !875)
!875 = distinct !DILexicalBlock(scope: !772, file: !134, line: 241, column: 7)
!876 = !DILocation(line: 241, column: 7, scope: !772)
!877 = !DILocation(line: 242, column: 5, scope: !875)
!878 = !DILocation(line: 243, column: 1, scope: !772)
!879 = !DISubprogram(name: "strerror_r", scope: !880, file: !880, line: 444, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!880 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!881 = !DISubroutineType(types: !882)
!882 = !{!65, !30, !65, !32}
!883 = !DISubprogram(name: "fflush_unlocked", scope: !143, file: !143, line: 239, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!884 = !DISubroutineType(types: !885)
!885 = !{!30, !788}
!886 = !DISubprogram(name: "fcntl", scope: !887, file: !887, line: 149, type: !888, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!887 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!888 = !DISubroutineType(types: !889)
!889 = !{!30, !30, !30, null}
!890 = distinct !DISubprogram(name: "error", scope: !134, file: !134, line: 285, type: !891, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !30, !30, !6, null}
!893 = !{!894, !895, !896, !897}
!894 = !DILocalVariable(name: "status", arg: 1, scope: !890, file: !134, line: 285, type: !30)
!895 = !DILocalVariable(name: "errnum", arg: 2, scope: !890, file: !134, line: 285, type: !30)
!896 = !DILocalVariable(name: "message", arg: 3, scope: !890, file: !134, line: 285, type: !6)
!897 = !DILocalVariable(name: "ap", scope: !890, file: !134, line: 287, type: !142)
!898 = !DILocation(line: 0, scope: !890)
!899 = !DILocation(line: 287, column: 3, scope: !890)
!900 = !DILocation(line: 287, column: 11, scope: !890)
!901 = !DILocation(line: 288, column: 3, scope: !890)
!902 = !DILocation(line: 289, column: 3, scope: !890)
!903 = !DILocation(line: 290, column: 3, scope: !890)
!904 = !DILocation(line: 291, column: 1, scope: !890)
!905 = !DILocation(line: 0, scope: !139)
!906 = !DILocation(line: 298, column: 1, scope: !139)
!907 = !DILocation(line: 302, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !139, file: !134, line: 302, column: 7)
!909 = !DILocation(line: 302, column: 7, scope: !139)
!910 = !DILocation(line: 307, column: 11, scope: !911)
!911 = distinct !DILexicalBlock(scope: !912, file: !134, line: 307, column: 11)
!912 = distinct !DILexicalBlock(scope: !908, file: !134, line: 303, column: 5)
!913 = !DILocation(line: 307, column: 27, scope: !911)
!914 = !DILocation(line: 308, column: 11, scope: !911)
!915 = !DILocation(line: 308, column: 28, scope: !911)
!916 = !DILocation(line: 308, column: 25, scope: !911)
!917 = !DILocation(line: 309, column: 15, scope: !911)
!918 = !DILocation(line: 309, column: 33, scope: !911)
!919 = !DILocation(line: 310, column: 19, scope: !911)
!920 = !DILocation(line: 311, column: 22, scope: !911)
!921 = !DILocation(line: 311, column: 56, scope: !911)
!922 = !DILocation(line: 307, column: 11, scope: !912)
!923 = !DILocation(line: 316, column: 21, scope: !912)
!924 = !DILocation(line: 317, column: 23, scope: !912)
!925 = !DILocation(line: 318, column: 5, scope: !912)
!926 = !DILocation(line: 327, column: 3, scope: !139)
!927 = !DILocation(line: 331, column: 7, scope: !928)
!928 = distinct !DILexicalBlock(scope: !139, file: !134, line: 331, column: 7)
!929 = !DILocation(line: 331, column: 7, scope: !139)
!930 = !DILocation(line: 332, column: 5, scope: !928)
!931 = !DILocation(line: 338, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !928, file: !134, line: 334, column: 5)
!933 = !DILocation(line: 346, column: 3, scope: !139)
!934 = !DILocation(line: 350, column: 3, scope: !139)
!935 = !DILocation(line: 356, column: 1, scope: !139)
!936 = distinct !DISubprogram(name: "error_at_line", scope: !134, file: !134, line: 359, type: !937, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !939)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !30, !30, !6, !14, !6, null}
!939 = !{!940, !941, !942, !943, !944, !945}
!940 = !DILocalVariable(name: "status", arg: 1, scope: !936, file: !134, line: 359, type: !30)
!941 = !DILocalVariable(name: "errnum", arg: 2, scope: !936, file: !134, line: 359, type: !30)
!942 = !DILocalVariable(name: "file_name", arg: 3, scope: !936, file: !134, line: 359, type: !6)
!943 = !DILocalVariable(name: "line_number", arg: 4, scope: !936, file: !134, line: 360, type: !14)
!944 = !DILocalVariable(name: "message", arg: 5, scope: !936, file: !134, line: 360, type: !6)
!945 = !DILocalVariable(name: "ap", scope: !936, file: !134, line: 362, type: !142)
!946 = !DILocation(line: 0, scope: !936)
!947 = !DILocation(line: 362, column: 3, scope: !936)
!948 = !DILocation(line: 362, column: 11, scope: !936)
!949 = !DILocation(line: 363, column: 3, scope: !936)
!950 = !DILocation(line: 364, column: 3, scope: !936)
!951 = !DILocation(line: 366, column: 3, scope: !936)
!952 = !DILocation(line: 367, column: 1, scope: !936)
!953 = distinct !DISubprogram(name: "getprogname", scope: !351, file: !351, line: 54, type: !954, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !350, retainedNodes: !513)
!954 = !DISubroutineType(types: !955)
!955 = !{!6}
!956 = !DILocation(line: 58, column: 10, scope: !953)
!957 = !DILocation(line: 58, column: 3, scope: !953)
!958 = distinct !DISubprogram(name: "parse_long_options", scope: !175, file: !175, line: 45, type: !959, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !962)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !30, !644, !6, !6, !6, !961, null}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !973}
!963 = !DILocalVariable(name: "argc", arg: 1, scope: !958, file: !175, line: 45, type: !30)
!964 = !DILocalVariable(name: "argv", arg: 2, scope: !958, file: !175, line: 46, type: !644)
!965 = !DILocalVariable(name: "command_name", arg: 3, scope: !958, file: !175, line: 47, type: !6)
!966 = !DILocalVariable(name: "package", arg: 4, scope: !958, file: !175, line: 48, type: !6)
!967 = !DILocalVariable(name: "version", arg: 5, scope: !958, file: !175, line: 49, type: !6)
!968 = !DILocalVariable(name: "usage_func", arg: 6, scope: !958, file: !175, line: 50, type: !961)
!969 = !DILocalVariable(name: "saved_opterr", scope: !958, file: !175, line: 53, type: !30)
!970 = !DILocalVariable(name: "c", scope: !971, file: !175, line: 60, type: !30)
!971 = distinct !DILexicalBlock(scope: !972, file: !175, line: 59, column: 5)
!972 = distinct !DILexicalBlock(scope: !958, file: !175, line: 58, column: 7)
!973 = !DILocalVariable(name: "authors", scope: !974, file: !175, line: 71, type: !978)
!974 = distinct !DILexicalBlock(scope: !975, file: !175, line: 70, column: 15)
!975 = distinct !DILexicalBlock(scope: !976, file: !175, line: 64, column: 13)
!976 = distinct !DILexicalBlock(scope: !977, file: !175, line: 62, column: 9)
!977 = distinct !DILexicalBlock(scope: !971, file: !175, line: 61, column: 11)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !981, baseType: !982)
!981 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !983)
!983 = !{!984, !985, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !982, file: !981, line: 71, baseType: !29, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !982, file: !981, line: 71, baseType: !29, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !982, file: !981, line: 71, baseType: !29, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !982, file: !981, line: 71, baseType: !30, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !982, file: !981, line: 71, baseType: !30, size: 32, offset: 224)
!989 = !DILocation(line: 0, scope: !958)
!990 = !DILocation(line: 53, column: 22, scope: !958)
!991 = !DILocation(line: 56, column: 10, scope: !958)
!992 = !DILocation(line: 58, column: 12, scope: !972)
!993 = !DILocation(line: 58, column: 7, scope: !958)
!994 = !DILocation(line: 60, column: 15, scope: !971)
!995 = !DILocation(line: 0, scope: !971)
!996 = !DILocation(line: 61, column: 11, scope: !971)
!997 = !DILocation(line: 66, column: 15, scope: !975)
!998 = !DILocation(line: 67, column: 15, scope: !975)
!999 = !DILocation(line: 71, column: 17, scope: !974)
!1000 = !DILocation(line: 71, column: 25, scope: !974)
!1001 = !DILocation(line: 72, column: 17, scope: !974)
!1002 = !DILocation(line: 73, column: 33, scope: !974)
!1003 = !DILocation(line: 73, column: 17, scope: !974)
!1004 = !DILocation(line: 74, column: 17, scope: !974)
!1005 = !DILocation(line: 85, column: 10, scope: !958)
!1006 = !DILocation(line: 89, column: 10, scope: !958)
!1007 = !DILocation(line: 90, column: 1, scope: !958)
!1008 = !DISubprogram(name: "getopt_long", scope: !180, file: !180, line: 66, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!30, !30, !1011, !6, !1013, !185}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!1014 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !175, file: !175, line: 98, type: !1015, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !30, !644, !6, !6, !6, !44, !961, null}
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!1018 = !DILocalVariable(name: "argc", arg: 1, scope: !1014, file: !175, line: 98, type: !30)
!1019 = !DILocalVariable(name: "argv", arg: 2, scope: !1014, file: !175, line: 99, type: !644)
!1020 = !DILocalVariable(name: "command_name", arg: 3, scope: !1014, file: !175, line: 100, type: !6)
!1021 = !DILocalVariable(name: "package", arg: 4, scope: !1014, file: !175, line: 101, type: !6)
!1022 = !DILocalVariable(name: "version", arg: 5, scope: !1014, file: !175, line: 102, type: !6)
!1023 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1014, file: !175, line: 103, type: !44)
!1024 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1014, file: !175, line: 104, type: !961)
!1025 = !DILocalVariable(name: "saved_opterr", scope: !1014, file: !175, line: 107, type: !30)
!1026 = !DILocalVariable(name: "optstring", scope: !1014, file: !175, line: 112, type: !6)
!1027 = !DILocalVariable(name: "c", scope: !1014, file: !175, line: 114, type: !30)
!1028 = !DILocalVariable(name: "authors", scope: !1029, file: !175, line: 125, type: !978)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !175, line: 124, column: 11)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !175, line: 118, column: 9)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !175, line: 116, column: 5)
!1032 = distinct !DILexicalBlock(scope: !1014, file: !175, line: 115, column: 7)
!1033 = !DILocation(line: 0, scope: !1014)
!1034 = !DILocation(line: 107, column: 22, scope: !1014)
!1035 = !DILocation(line: 110, column: 10, scope: !1014)
!1036 = !DILocation(line: 112, column: 27, scope: !1014)
!1037 = !DILocation(line: 114, column: 11, scope: !1014)
!1038 = !DILocation(line: 115, column: 7, scope: !1014)
!1039 = !DILocation(line: 125, column: 13, scope: !1029)
!1040 = !DILocation(line: 125, column: 21, scope: !1029)
!1041 = !DILocation(line: 126, column: 13, scope: !1029)
!1042 = !DILocation(line: 127, column: 29, scope: !1029)
!1043 = !DILocation(line: 127, column: 13, scope: !1029)
!1044 = !DILocation(line: 128, column: 13, scope: !1029)
!1045 = !DILocation(line: 132, column: 26, scope: !1030)
!1046 = !DILocation(line: 133, column: 11, scope: !1030)
!1047 = !DILocation(line: 0, scope: !1030)
!1048 = !DILocation(line: 138, column: 10, scope: !1014)
!1049 = !DILocation(line: 139, column: 1, scope: !1014)
!1050 = distinct !DISubprogram(name: "set_program_name", scope: !192, file: !192, line: 37, type: !446, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DILocalVariable(name: "argv0", arg: 1, scope: !1050, file: !192, line: 37, type: !6)
!1053 = !DILocalVariable(name: "slash", scope: !1050, file: !192, line: 44, type: !6)
!1054 = !DILocalVariable(name: "base", scope: !1050, file: !192, line: 45, type: !6)
!1055 = !DILocation(line: 0, scope: !1050)
!1056 = !DILocation(line: 44, column: 23, scope: !1050)
!1057 = !DILocation(line: 45, column: 22, scope: !1050)
!1058 = !DILocation(line: 46, column: 17, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1050, file: !192, line: 46, column: 7)
!1060 = !DILocation(line: 46, column: 9, scope: !1059)
!1061 = !DILocation(line: 46, column: 25, scope: !1059)
!1062 = !DILocation(line: 46, column: 40, scope: !1059)
!1063 = !DILocalVariable(name: "__s1", arg: 1, scope: !1064, file: !471, line: 974, type: !639)
!1064 = distinct !DISubprogram(name: "memeq", scope: !471, file: !471, line: 974, type: !1065, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1067)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!44, !639, !639, !32}
!1067 = !{!1063, !1068, !1069}
!1068 = !DILocalVariable(name: "__s2", arg: 2, scope: !1064, file: !471, line: 974, type: !639)
!1069 = !DILocalVariable(name: "__n", arg: 3, scope: !1064, file: !471, line: 974, type: !32)
!1070 = !DILocation(line: 0, scope: !1064, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 46, column: 28, scope: !1059)
!1072 = !DILocation(line: 976, column: 11, scope: !1064, inlinedAt: !1071)
!1073 = !DILocation(line: 976, column: 10, scope: !1064, inlinedAt: !1071)
!1074 = !DILocation(line: 46, column: 7, scope: !1050)
!1075 = !DILocation(line: 49, column: 11, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !192, line: 49, column: 11)
!1077 = distinct !DILexicalBlock(scope: !1059, file: !192, line: 47, column: 5)
!1078 = !DILocation(line: 49, column: 36, scope: !1076)
!1079 = !DILocation(line: 49, column: 11, scope: !1077)
!1080 = !DILocation(line: 65, column: 16, scope: !1050)
!1081 = !DILocation(line: 71, column: 27, scope: !1050)
!1082 = !DILocation(line: 74, column: 33, scope: !1050)
!1083 = !DILocation(line: 76, column: 1, scope: !1050)
!1084 = !DILocation(line: 0, scope: !197)
!1085 = !DILocation(line: 40, column: 29, scope: !197)
!1086 = !DILocation(line: 41, column: 19, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !197, file: !198, line: 41, column: 7)
!1088 = !DILocation(line: 41, column: 7, scope: !197)
!1089 = !DILocation(line: 47, column: 3, scope: !197)
!1090 = !DILocation(line: 48, column: 3, scope: !197)
!1091 = !DILocation(line: 48, column: 13, scope: !197)
!1092 = !DILocalVariable(name: "ps", arg: 1, scope: !1093, file: !1094, line: 1135, type: !1097)
!1093 = distinct !DISubprogram(name: "mbszero", scope: !1094, file: !1094, line: 1135, type: !1095, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1098)
!1094 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1095 = !DISubroutineType(types: !1096)
!1096 = !{null, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!1098 = !{!1092}
!1099 = !DILocation(line: 0, scope: !1093, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 48, column: 18, scope: !197)
!1101 = !DILocalVariable(name: "__dest", arg: 1, scope: !1102, file: !1103, line: 57, type: !29)
!1102 = distinct !DISubprogram(name: "memset", scope: !1103, file: !1103, line: 57, type: !1104, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1106)
!1103 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!29, !29, !30, !32}
!1106 = !{!1101, !1107, !1108}
!1107 = !DILocalVariable(name: "__ch", arg: 2, scope: !1102, file: !1103, line: 57, type: !30)
!1108 = !DILocalVariable(name: "__len", arg: 3, scope: !1102, file: !1103, line: 57, type: !32)
!1109 = !DILocation(line: 0, scope: !1102, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 1137, column: 3, scope: !1093, inlinedAt: !1100)
!1111 = !DILocation(line: 59, column: 10, scope: !1102, inlinedAt: !1110)
!1112 = !DILocation(line: 49, column: 7, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !197, file: !198, line: 49, column: 7)
!1114 = !DILocation(line: 49, column: 39, scope: !1113)
!1115 = !DILocation(line: 49, column: 44, scope: !1113)
!1116 = !DILocation(line: 54, column: 1, scope: !197)
!1117 = !DISubprogram(name: "mbrtoc32", scope: !209, file: !209, line: 57, type: !1118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !513)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!32, !1120, !517, !32, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1097)
!1123 = distinct !DISubprogram(name: "clone_quoting_options", scope: !234, file: !234, line: 113, type: !1124, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1127)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!1126, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!1127 = !{!1128, !1129, !1130}
!1128 = !DILocalVariable(name: "o", arg: 1, scope: !1123, file: !234, line: 113, type: !1126)
!1129 = !DILocalVariable(name: "saved_errno", scope: !1123, file: !234, line: 115, type: !30)
!1130 = !DILocalVariable(name: "p", scope: !1123, file: !234, line: 116, type: !1126)
!1131 = !DILocation(line: 0, scope: !1123)
!1132 = !DILocation(line: 115, column: 21, scope: !1123)
!1133 = !DILocation(line: 116, column: 40, scope: !1123)
!1134 = !DILocation(line: 116, column: 31, scope: !1123)
!1135 = !DILocation(line: 118, column: 9, scope: !1123)
!1136 = !DILocation(line: 119, column: 3, scope: !1123)
!1137 = distinct !DISubprogram(name: "get_quoting_style", scope: !234, file: !234, line: 124, type: !1138, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1142)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!236, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!1142 = !{!1143}
!1143 = !DILocalVariable(name: "o", arg: 1, scope: !1137, file: !234, line: 124, type: !1140)
!1144 = !DILocation(line: 0, scope: !1137)
!1145 = !DILocation(line: 126, column: 11, scope: !1137)
!1146 = !DILocation(line: 126, column: 46, scope: !1137)
!1147 = !{!1148, !437, i64 0}
!1148 = !{!"quoting_options", !437, i64 0, !522, i64 4, !437, i64 8, !436, i64 40, !436, i64 48}
!1149 = !DILocation(line: 126, column: 3, scope: !1137)
!1150 = distinct !DISubprogram(name: "set_quoting_style", scope: !234, file: !234, line: 132, type: !1151, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1153)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1126, !236}
!1153 = !{!1154, !1155}
!1154 = !DILocalVariable(name: "o", arg: 1, scope: !1150, file: !234, line: 132, type: !1126)
!1155 = !DILocalVariable(name: "s", arg: 2, scope: !1150, file: !234, line: 132, type: !236)
!1156 = !DILocation(line: 0, scope: !1150)
!1157 = !DILocation(line: 134, column: 4, scope: !1150)
!1158 = !DILocation(line: 134, column: 39, scope: !1150)
!1159 = !DILocation(line: 134, column: 45, scope: !1150)
!1160 = !DILocation(line: 135, column: 1, scope: !1150)
!1161 = distinct !DISubprogram(name: "set_char_quoting", scope: !234, file: !234, line: 143, type: !1162, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!30, !1126, !8, !30}
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1171, !1172}
!1165 = !DILocalVariable(name: "o", arg: 1, scope: !1161, file: !234, line: 143, type: !1126)
!1166 = !DILocalVariable(name: "c", arg: 2, scope: !1161, file: !234, line: 143, type: !8)
!1167 = !DILocalVariable(name: "i", arg: 3, scope: !1161, file: !234, line: 143, type: !30)
!1168 = !DILocalVariable(name: "uc", scope: !1161, file: !234, line: 145, type: !35)
!1169 = !DILocalVariable(name: "p", scope: !1161, file: !234, line: 146, type: !1170)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!1171 = !DILocalVariable(name: "shift", scope: !1161, file: !234, line: 148, type: !30)
!1172 = !DILocalVariable(name: "r", scope: !1161, file: !234, line: 149, type: !14)
!1173 = !DILocation(line: 0, scope: !1161)
!1174 = !DILocation(line: 147, column: 6, scope: !1161)
!1175 = !DILocation(line: 147, column: 62, scope: !1161)
!1176 = !DILocation(line: 147, column: 57, scope: !1161)
!1177 = !DILocation(line: 148, column: 15, scope: !1161)
!1178 = !DILocation(line: 149, column: 21, scope: !1161)
!1179 = !DILocation(line: 149, column: 24, scope: !1161)
!1180 = !DILocation(line: 149, column: 34, scope: !1161)
!1181 = !DILocation(line: 150, column: 13, scope: !1161)
!1182 = !DILocation(line: 150, column: 19, scope: !1161)
!1183 = !DILocation(line: 150, column: 24, scope: !1161)
!1184 = !DILocation(line: 150, column: 6, scope: !1161)
!1185 = !DILocation(line: 151, column: 3, scope: !1161)
!1186 = distinct !DISubprogram(name: "set_quoting_flags", scope: !234, file: !234, line: 159, type: !1187, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !1189)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!30, !1126, !30}
!1189 = !{!1190, !1191, !1192}
!1190 = !DILocalVariable(name: "o", arg: 1, scope: !1186, file: !234, line: 159, type: !1126)
!1191 = !DILocalVariable(name: "i", arg: 2, scope: !1186, file: !234, line: 159, type: !30)
!1192 = !DILocalVariable(name: "r", scope: !1186, file: !234, line: 163, type: !30)
!1193 = !DILocation(line: 0, scope: !1186)
!1194 = !DILocation(line: 161, column: 8, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1186, file: !234, line: 161, column: 7)
!1196 = !DILocation(line: 161, column: 7, scope: !1186)
!1197 = !DILocation(line: 163, column: 14, scope: !1186)
!1198 = !{!1148, !522, i64 4}
!1199 = !DILocation(line: 164, column: 12, scope: !1186)
!1200 = !DILocation(line: 165, column: 3, scope: !1186)
