; ModuleID = 'src/mkdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.savewd = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mkdir_options = type { i32 (i8*, i8*, i8*)*, i32, i32, i32, i32, %struct.selabel_handle*, i8* }
%struct.selabel_handle = type opaque
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 39, type: !160, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !58, globals: !73, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mkdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d793d15b84a01608d40780cfd3f61f54")
!4 = !{!5, !29, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !7, file: !6, line: 45, baseType: !21, size: 32, elements: !22)
!6 = !DIFile(filename: "./lib/savewd.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ad4dd1c19e06c974b5c544edb9d47f86")
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 42, size: 64, elements: !8)
!8 = !{!9, !10}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !7, file: !6, line: 73, baseType: !5, size: 32)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !7, file: !6, line: 81, baseType: !11, size: 32, offset: 32)
!11 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !7, file: !6, line: 76, size: 32, elements: !12)
!12 = !{!13, !15, !16}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !11, file: !6, line: 78, baseType: !14, size: 32)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !11, file: !6, line: 79, baseType: !14, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !11, file: !6, line: 80, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !18, line: 97, baseType: !19)
!18 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !20, line: 154, baseType: !14)
!20 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "INITIAL_STATE", value: 0)
!24 = !DIEnumerator(name: "FD_STATE", value: 1)
!25 = !DIEnumerator(name: "FD_POST_CHDIR_STATE", value: 2)
!26 = !DIEnumerator(name: "FORKING_STATE", value: 3)
!27 = !DIEnumerator(name: "ERROR_STATE", value: 4)
!28 = !DIEnumerator(name: "FINAL_STATE", value: 5)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 46, baseType: !21, size: 32, elements: !31)
!30 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43}
!32 = !DIEnumerator(name: "_ISupper", value: 256)
!33 = !DIEnumerator(name: "_ISlower", value: 512)
!34 = !DIEnumerator(name: "_ISalpha", value: 1024)
!35 = !DIEnumerator(name: "_ISdigit", value: 2048)
!36 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!37 = !DIEnumerator(name: "_ISspace", value: 8192)
!38 = !DIEnumerator(name: "_ISprint", value: 16384)
!39 = !DIEnumerator(name: "_ISgraph", value: 32768)
!40 = !DIEnumerator(name: "_ISblank", value: 1)
!41 = !DIEnumerator(name: "_IScntrl", value: 2)
!42 = !DIEnumerator(name: "_ISpunct", value: 4)
!43 = !DIEnumerator(name: "_ISalnum", value: 8)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !45, line: 42, baseType: !21, size: 32, elements: !46)
!45 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!47 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!48 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!49 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!50 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!51 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!52 = !DIEnumerator(name: "c_quoting_style", value: 5)
!53 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!54 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!55 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!56 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!57 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!58 = !{!59, !61, !14, !62, !63, !66, !68, !69, !71}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 46, baseType: !65)
!64 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!65 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!68 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !18, line: 79, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !20, line: 146, baseType: !21)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !18, line: 64, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !20, line: 147, baseType: !21)
!73 = !{!74, !0}
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !76, file: !77, line: 575, type: !14, isLocal: true, isDefinition: true)
!76 = distinct !DISubprogram(name: "oputs_", scope: !77, file: !77, line: 573, type: !78, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !80)
!77 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!78 = !DISubroutineType(types: !79)
!79 = !{null, !66, !66}
!80 = !{!81, !82, !83, !86, !88, !89, !90, !94, !95, !96, !97, !99, !154, !155, !156, !158, !159}
!81 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !66)
!82 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !66)
!83 = !DILocalVariable(name: "term", scope: !84, file: !77, line: 585, type: !66)
!84 = distinct !DILexicalBlock(scope: !85, file: !77, line: 582, column: 5)
!85 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!86 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !87)
!87 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!88 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !66)
!89 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !66)
!90 = !DILocalVariable(name: "s", scope: !91, file: !77, line: 608, type: !66)
!91 = distinct !DILexicalBlock(scope: !92, file: !77, line: 605, column: 5)
!92 = distinct !DILexicalBlock(scope: !93, file: !77, line: 604, column: 12)
!93 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!94 = !DILocalVariable(name: "spaces", scope: !91, file: !77, line: 609, type: !63)
!95 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !63)
!96 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !66)
!97 = !DILocalVariable(name: "__ptr", scope: !98, file: !77, line: 644, type: !66)
!98 = distinct !DILexicalBlock(scope: !76, file: !77, line: 644, column: 3)
!99 = !DILocalVariable(name: "__stream", scope: !98, file: !77, line: 644, type: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !102, line: 7, baseType: !103)
!102 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !121, !123, !124, !125, !128, !129, !131, !135, !138, !140, !143, !146, !147, !148, !149, !150}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !103, file: !104, line: 51, baseType: !14, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !103, file: !104, line: 54, baseType: !59, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !103, file: !104, line: 55, baseType: !59, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !103, file: !104, line: 56, baseType: !59, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !103, file: !104, line: 57, baseType: !59, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !103, file: !104, line: 58, baseType: !59, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !103, file: !104, line: 59, baseType: !59, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !103, file: !104, line: 60, baseType: !59, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !103, file: !104, line: 61, baseType: !59, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !103, file: !104, line: 64, baseType: !59, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !103, file: !104, line: 65, baseType: !59, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !103, file: !104, line: 66, baseType: !59, size: 64, offset: 704)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !103, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !104, line: 36, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !103, file: !104, line: 70, baseType: !122, size: 64, offset: 832)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !103, file: !104, line: 72, baseType: !14, size: 32, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !103, file: !104, line: 73, baseType: !14, size: 32, offset: 928)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !103, file: !104, line: 74, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !20, line: 152, baseType: !127)
!127 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !103, file: !104, line: 77, baseType: !62, size: 16, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !103, file: !104, line: 78, baseType: !130, size: 8, offset: 1040)
!130 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !103, file: !104, line: 79, baseType: !132, size: 8, offset: 1048)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 1)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !103, file: !104, line: 81, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !104, line: 43, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !103, file: !104, line: 89, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !20, line: 153, baseType: !127)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !103, file: !104, line: 91, baseType: !141, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !104, line: 37, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !103, file: !104, line: 92, baseType: !144, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !104, line: 38, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !103, file: !104, line: 93, baseType: !122, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !103, file: !104, line: 94, baseType: !61, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !103, file: !104, line: 95, baseType: !63, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !103, file: !104, line: 96, baseType: !14, size: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !103, file: !104, line: 98, baseType: !151, size: 160, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !DILocalVariable(name: "__cnt", scope: !98, file: !77, line: 644, type: !63)
!155 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !66)
!156 = !DILocalVariable(name: "__ptr", scope: !157, file: !77, line: 686, type: !66)
!157 = distinct !DILexicalBlock(scope: !76, file: !77, line: 686, column: 3)
!158 = !DILocalVariable(name: "__stream", scope: !157, file: !77, line: 686, type: !100)
!159 = !DILocalVariable(name: "__cnt", scope: !157, file: !77, line: 686, type: !63)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1792, elements: !170)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !163, line: 50, size: 256, elements: !164)
!163 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!164 = !{!165, !166, !167, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !163, line: 52, baseType: !66, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !162, file: !163, line: 55, baseType: !14, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !162, file: !163, line: 56, baseType: !168, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !162, file: !163, line: 57, baseType: !14, size: 32, offset: 192)
!170 = !{!171}
!171 = !DISubrange(count: 7)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "Version", scope: !174, file: !175, line: 3, type: !66, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!176 = !{!172}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "file_name", scope: !179, file: !180, line: 45, type: !66, isLocal: true, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !181, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!181 = !{!177, !182}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !179, file: !180, line: 55, type: !87, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !186, file: !187, line: 66, type: !222, isLocal: false, isDefinition: true)
!186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !187, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !188, globals: !189, splitDebugInlining: false, nameTableKind: None)
!187 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!188 = !{!61, !68}
!189 = !{!190, !216, !184, !218, !220}
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "old_file_name", scope: !192, file: !187, line: 304, type: !66, isLocal: true, isDefinition: true)
!192 = distinct !DISubprogram(name: "verror_at_line", scope: !187, file: !187, line: 298, type: !193, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !186, retainedNodes: !209)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !14, !14, !66, !21, !66, !195}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !196, line: 52, baseType: !197)
!196 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !198, line: 32, baseType: !199)
!198 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !200, baseType: !201)
!200 = !DIFile(filename: "lib/error.c", directory: "/src")
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !202, size: 256, elements: !203)
!202 = !DINamespace(name: "std", scope: null)
!203 = !{!204, !205, !206, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !201, file: !200, baseType: !61, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !201, file: !200, baseType: !61, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !201, file: !200, baseType: !61, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !201, file: !200, baseType: !14, size: 32, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !201, file: !200, baseType: !14, size: 32, offset: 224)
!209 = !{!210, !211, !212, !213, !214, !215}
!210 = !DILocalVariable(name: "status", arg: 1, scope: !192, file: !187, line: 298, type: !14)
!211 = !DILocalVariable(name: "errnum", arg: 2, scope: !192, file: !187, line: 298, type: !14)
!212 = !DILocalVariable(name: "file_name", arg: 3, scope: !192, file: !187, line: 298, type: !66)
!213 = !DILocalVariable(name: "line_number", arg: 4, scope: !192, file: !187, line: 298, type: !21)
!214 = !DILocalVariable(name: "message", arg: 5, scope: !192, file: !187, line: 298, type: !66)
!215 = !DILocalVariable(name: "args", arg: 6, scope: !192, file: !187, line: 298, type: !195)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "old_line_number", scope: !192, file: !187, line: 305, type: !21, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "error_message_count", scope: !186, file: !187, line: 69, type: !21, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !186, file: !187, line: 295, type: !14, isLocal: false, isDefinition: true)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "program_name", scope: !227, file: !228, line: 31, type: !66, isLocal: false, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !229, globals: !230, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!229 = !{!59}
!230 = !{!225}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "utf07FF", scope: !233, file: !234, line: 46, type: !264, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "proper_name_lite", scope: !234, file: !234, line: 38, type: !235, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !237, retainedNodes: !239)
!234 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!235 = !DISubroutineType(types: !236)
!236 = !{!66, !66, !66}
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !238, splitDebugInlining: false, nameTableKind: None)
!238 = !{!231}
!239 = !{!240, !241, !242, !243, !248}
!240 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !233, file: !234, line: 38, type: !66)
!241 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !233, file: !234, line: 38, type: !66)
!242 = !DILocalVariable(name: "translation", scope: !233, file: !234, line: 40, type: !66)
!243 = !DILocalVariable(name: "w", scope: !233, file: !234, line: 47, type: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !245, line: 37, baseType: !246)
!245 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !20, line: 57, baseType: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !20, line: 42, baseType: !21)
!248 = !DILocalVariable(name: "mbs", scope: !233, file: !234, line: 48, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !250, line: 6, baseType: !251)
!250 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !252, line: 21, baseType: !253)
!252 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 13, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !253, file: !252, line: 15, baseType: !14, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !253, file: !252, line: 20, baseType: !257, size: 32, offset: 32)
!257 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !253, file: !252, line: 16, size: 32, elements: !258)
!258 = !{!259, !260}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !257, file: !252, line: 18, baseType: !21, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !257, file: !252, line: 19, baseType: !261, size: 32)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 4)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 16, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 2)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !269, file: !270, line: 76, type: !338, isLocal: false, isDefinition: true)
!269 = distinct !DICompileUnit(language: DW_LANG_C99, file: !270, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !271, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!270 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!271 = !{!44, !272, !29}
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !45, line: 254, baseType: !21, size: 32, elements: !273)
!273 = !{!274, !275, !276}
!274 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!275 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!276 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!277 = !{!14, !62, !63}
!278 = !{!267, !279, !285, !297, !299, !304, !327, !334, !336}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !269, file: !270, line: 92, type: !281, isLocal: false, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 320, elements: !283)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!283 = !{!284}
!284 = !DISubrange(count: 10)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !269, file: !270, line: 1040, type: !287, isLocal: false, isDefinition: true)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !270, line: 56, size: 448, elements: !288)
!288 = !{!289, !290, !291, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !287, file: !270, line: 59, baseType: !44, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !270, line: 62, baseType: !14, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !287, file: !270, line: 66, baseType: !292, size: 256, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 256, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !287, file: !270, line: 69, baseType: !66, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !287, file: !270, line: 72, baseType: !66, size: 64, offset: 384)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !269, file: !270, line: 107, type: !287, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "slot0", scope: !269, file: !270, line: 831, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 256)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "quote", scope: !306, file: !270, line: 228, type: !325, isLocal: true, isDefinition: true)
!306 = distinct !DISubprogram(name: "gettext_quote", scope: !270, file: !270, line: 197, type: !307, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !269, retainedNodes: !309)
!307 = !DISubroutineType(types: !308)
!308 = !{!66, !66, !44}
!309 = !{!310, !311, !312, !313, !314}
!310 = !DILocalVariable(name: "msgid", arg: 1, scope: !306, file: !270, line: 197, type: !66)
!311 = !DILocalVariable(name: "s", arg: 2, scope: !306, file: !270, line: 197, type: !44)
!312 = !DILocalVariable(name: "translation", scope: !306, file: !270, line: 199, type: !66)
!313 = !DILocalVariable(name: "w", scope: !306, file: !270, line: 229, type: !244)
!314 = !DILocalVariable(name: "mbs", scope: !306, file: !270, line: 230, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !250, line: 6, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !252, line: 21, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 13, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !317, file: !252, line: 15, baseType: !14, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !317, file: !252, line: 20, baseType: !321, size: 32, offset: 32)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !317, file: !252, line: 16, size: 32, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !321, file: !252, line: 18, baseType: !21, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !321, file: !252, line: 19, baseType: !261, size: 32)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !326)
!326 = !{!266, !263}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "slotvec", scope: !269, file: !270, line: 834, type: !329, isLocal: true, isDefinition: true)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !270, line: 823, size: 128, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !270, line: 825, baseType: !63, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !330, file: !270, line: 826, baseType: !59, size: 64, offset: 64)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "nslots", scope: !269, file: !270, line: 832, type: !14, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "slotvec0", scope: !269, file: !270, line: 833, type: !330, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 704, elements: !340)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!340 = !{!341}
!341 = !DISubrange(count: 11)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !344, file: !345, line: 26, type: !347, isLocal: false, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !346, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!346 = !{!342}
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 376, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 47)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "exit_failure", scope: !352, file: !353, line: 24, type: !355, isLocal: false, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !354, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!354 = !{!350}
!355 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "internal_state", scope: !358, file: !359, line: 97, type: !362, isLocal: true, isDefinition: true)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !360, globals: !361, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!360 = !{!61, !63, !68}
!361 = !{!356}
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !250, line: 6, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !252, line: 21, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 13, size: 64, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !364, file: !252, line: 15, baseType: !14, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !364, file: !252, line: 20, baseType: !368, size: 32, offset: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !364, file: !252, line: 16, size: 32, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !368, file: !252, line: 18, baseType: !21, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !368, file: !252, line: 19, baseType: !261, size: 32)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !374, file: !375, line: 506, type: !14, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !375, file: !375, line: 485, type: !376, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !380)
!375 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!376 = !DISubroutineType(types: !377)
!377 = !{!14, !14, !14}
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !379, splitDebugInlining: false, nameTableKind: None)
!379 = !{!372}
!380 = !{!381, !382, !383, !384, !387}
!381 = !DILocalVariable(name: "fd", arg: 1, scope: !374, file: !375, line: 485, type: !14)
!382 = !DILocalVariable(name: "target", arg: 2, scope: !374, file: !375, line: 485, type: !14)
!383 = !DILocalVariable(name: "result", scope: !374, file: !375, line: 487, type: !14)
!384 = !DILocalVariable(name: "flags", scope: !385, file: !375, line: 530, type: !14)
!385 = distinct !DILexicalBlock(scope: !386, file: !375, line: 529, column: 5)
!386 = distinct !DILexicalBlock(scope: !374, file: !375, line: 528, column: 7)
!387 = !DILocalVariable(name: "saved_errno", scope: !388, file: !375, line: 533, type: !14)
!388 = distinct !DILexicalBlock(scope: !389, file: !375, line: 532, column: 9)
!389 = distinct !DILexicalBlock(scope: !385, file: !375, line: 531, column: 11)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !392, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!392 = !{!68}
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !399, retainedTypes: !414, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/mkdir-p.c", directory: "/src", checksumkind: CSK_MD5, checksum: "35fabba6c7fba2a5201f9ea7f8c0e0d1")
!399 = !{!400, !410}
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !401, file: !6, line: 45, baseType: !21, size: 32, elements: !22)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 42, size: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !401, file: !6, line: 73, baseType: !400, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !401, file: !6, line: 81, baseType: !405, size: 32, offset: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !6, line: 76, size: 32, elements: !406)
!406 = !{!407, !408, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !405, file: !6, line: 78, baseType: !14, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !405, file: !6, line: 79, baseType: !14, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !405, file: !6, line: 80, baseType: !17, size: 32)
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 93, baseType: !21, size: 32, elements: !411)
!411 = !{!412, !413}
!412 = !DIEnumerator(name: "SAVEWD_CHDIR_NOFOLLOW", value: 1)
!413 = !DIEnumerator(name: "SAVEWD_CHDIR_SKIP_READABLE", value: 2)
!414 = !{!69, !71}
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !417, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!417 = !{!418}
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !416, line: 78, baseType: !21, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIEnumerator(name: "MODE_DONE", value: 0)
!421 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!422 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!423 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !426, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/savewd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0cafd16d007fc7abd1f9bf11434952af")
!426 = !{!427, !410}
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !428, file: !6, line: 45, baseType: !21, size: 32, elements: !22)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 42, size: 64, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !428, file: !6, line: 73, baseType: !427, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !428, file: !6, line: 81, baseType: !432, size: 32, offset: 32)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !428, file: !6, line: 76, size: 32, elements: !433)
!433 = !{!434, !435, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !432, file: !6, line: 78, baseType: !14, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !432, file: !6, line: 79, baseType: !14, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !432, file: !6, line: 80, baseType: !17, size: 32)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !439, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!439 = !{!440}
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 40, baseType: !21, size: 32, elements: !441)
!441 = !{!442}
!442 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!443 = !{!61}
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !477, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!446 = !{!447, !459}
!447 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !448, file: !445, line: 188, baseType: !21, size: 32, elements: !457)
!448 = distinct !DISubprogram(name: "x2nrealloc", scope: !445, file: !445, line: 176, type: !449, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !444, retainedNodes: !452)
!449 = !DISubroutineType(types: !450)
!450 = !{!61, !61, !451, !63}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!452 = !{!453, !454, !455, !456}
!453 = !DILocalVariable(name: "p", arg: 1, scope: !448, file: !445, line: 176, type: !61)
!454 = !DILocalVariable(name: "pn", arg: 2, scope: !448, file: !445, line: 176, type: !451)
!455 = !DILocalVariable(name: "s", arg: 3, scope: !448, file: !445, line: 176, type: !63)
!456 = !DILocalVariable(name: "n", scope: !448, file: !445, line: 178, type: !63)
!457 = !{!458}
!458 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !460, file: !445, line: 228, baseType: !21, size: 32, elements: !457)
!460 = distinct !DISubprogram(name: "xpalloc", scope: !445, file: !445, line: 223, type: !461, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !444, retainedNodes: !467)
!461 = !DISubroutineType(types: !462)
!462 = !{!61, !61, !463, !464, !466, !464}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !465, line: 130, baseType: !466)
!465 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !64, line: 35, baseType: !127)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DILocalVariable(name: "pa", arg: 1, scope: !460, file: !445, line: 223, type: !61)
!469 = !DILocalVariable(name: "pn", arg: 2, scope: !460, file: !445, line: 223, type: !463)
!470 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !460, file: !445, line: 223, type: !464)
!471 = !DILocalVariable(name: "n_max", arg: 4, scope: !460, file: !445, line: 223, type: !466)
!472 = !DILocalVariable(name: "s", arg: 5, scope: !460, file: !445, line: 223, type: !464)
!473 = !DILocalVariable(name: "n0", scope: !460, file: !445, line: 230, type: !464)
!474 = !DILocalVariable(name: "n", scope: !460, file: !445, line: 237, type: !464)
!475 = !DILocalVariable(name: "nbytes", scope: !460, file: !445, line: 248, type: !464)
!476 = !DILocalVariable(name: "adjusted_nbytes", scope: !460, file: !445, line: 252, type: !464)
!477 = !{!59, !61, !87, !127, !65}
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!480 = distinct !DICompileUnit(language: DW_LANG_C99, file: !481, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!481 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !492, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/mkancesdirs.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6b54240f33d18f510b92d67eeccd60e")
!492 = !{!493, !410}
!493 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !494, file: !6, line: 45, baseType: !21, size: 32, elements: !22)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "savewd", file: !6, line: 42, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !494, file: !6, line: 73, baseType: !493, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !494, file: !6, line: 81, baseType: !498, size: 32, offset: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !6, line: 76, size: 32, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !498, file: !6, line: 78, baseType: !14, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !498, file: !6, line: 79, baseType: !14, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !498, file: !6, line: 80, baseType: !17, size: 32)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "lib/dirchownmod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b1a0bf6d4e9295f75572be521597aa1e")
!505 = !{!69, !71, !506}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !18, line: 69, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !20, line: 150, baseType: !21)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!510 = !{!87, !65, !61}
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !443, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!521 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!522 = !{i32 7, !"Dwarf Version", i32 5}
!523 = !{i32 2, !"Debug Info Version", i32 3}
!524 = !{i32 1, !"wchar_size", i32 4}
!525 = !{i32 1, !"branch-target-enforcement", i32 0}
!526 = !{i32 1, !"sign-return-address", i32 0}
!527 = !{i32 1, !"sign-return-address-all", i32 0}
!528 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!529 = !{i32 7, !"PIC Level", i32 2}
!530 = !{i32 7, !"PIE Level", i32 2}
!531 = !{i32 7, !"uwtable", i32 1}
!532 = !{i32 7, !"frame-pointer", i32 1}
!533 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !534, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !14}
!536 = !{!537}
!537 = !DILocalVariable(name: "status", arg: 1, scope: !533, file: !3, line: 51, type: !14)
!538 = !DILocation(line: 0, scope: !533)
!539 = !DILocation(line: 53, column: 14, scope: !540)
!540 = distinct !DILexicalBlock(scope: !533, file: !3, line: 53, column: 7)
!541 = !DILocation(line: 53, column: 7, scope: !533)
!542 = !DILocation(line: 54, column: 5, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !3, line: 54, column: 5)
!544 = !{!545, !545, i64 0}
!545 = !{!"any pointer", !546, i64 0}
!546 = !{!"omnipotent char", !547, i64 0}
!547 = !{!"Simple C/C++ TBAA"}
!548 = !DILocation(line: 57, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !540, file: !3, line: 56, column: 5)
!550 = !DILocation(line: 58, column: 7, scope: !549)
!551 = !DILocation(line: 736, column: 3, scope: !552, inlinedAt: !554)
!552 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !77, file: !77, line: 734, type: !223, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!553 = !{}
!554 = distinct !DILocation(line: 62, column: 7, scope: !549)
!555 = !DILocation(line: 64, column: 7, scope: !549)
!556 = !DILocation(line: 68, column: 7, scope: !549)
!557 = !DILocation(line: 73, column: 7, scope: !549)
!558 = !DILocation(line: 77, column: 7, scope: !549)
!559 = !DILocation(line: 82, column: 7, scope: !549)
!560 = !DILocation(line: 87, column: 7, scope: !549)
!561 = !DILocation(line: 88, column: 7, scope: !549)
!562 = !DILocalVariable(name: "program", arg: 1, scope: !563, file: !77, line: 836, type: !66)
!563 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !564, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !66}
!566 = !{!562, !567, !574, !575, !577, !578}
!567 = !DILocalVariable(name: "infomap", scope: !563, file: !77, line: 838, type: !568)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 896, elements: !170)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !563, file: !77, line: 838, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !570, file: !77, line: 838, baseType: !66, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !570, file: !77, line: 838, baseType: !66, size: 64, offset: 64)
!574 = !DILocalVariable(name: "node", scope: !563, file: !77, line: 848, type: !66)
!575 = !DILocalVariable(name: "map_prog", scope: !563, file: !77, line: 849, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!577 = !DILocalVariable(name: "lc_messages", scope: !563, file: !77, line: 861, type: !66)
!578 = !DILocalVariable(name: "url_program", scope: !563, file: !77, line: 874, type: !66)
!579 = !DILocation(line: 0, scope: !563, inlinedAt: !580)
!580 = distinct !DILocation(line: 89, column: 7, scope: !549)
!581 = !DILocation(line: 838, column: 3, scope: !563, inlinedAt: !580)
!582 = !DILocation(line: 838, column: 67, scope: !563, inlinedAt: !580)
!583 = !DILocation(line: 849, column: 36, scope: !563, inlinedAt: !580)
!584 = !DILocation(line: 851, column: 3, scope: !563, inlinedAt: !580)
!585 = !DILocalVariable(name: "__s1", arg: 1, scope: !586, file: !587, line: 1359, type: !66)
!586 = distinct !DISubprogram(name: "streq", scope: !587, file: !587, line: 1359, type: !588, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !590)
!587 = !DIFile(filename: "./lib/string.h", directory: "/src")
!588 = !DISubroutineType(types: !589)
!589 = !{!87, !66, !66}
!590 = !{!585, !591}
!591 = !DILocalVariable(name: "__s2", arg: 2, scope: !586, file: !587, line: 1359, type: !66)
!592 = !DILocation(line: 0, scope: !586, inlinedAt: !593)
!593 = distinct !DILocation(line: 851, column: 33, scope: !563, inlinedAt: !580)
!594 = !DILocation(line: 1361, column: 11, scope: !586, inlinedAt: !593)
!595 = !DILocation(line: 1361, column: 10, scope: !586, inlinedAt: !593)
!596 = !DILocation(line: 852, column: 13, scope: !563, inlinedAt: !580)
!597 = !DILocation(line: 851, column: 20, scope: !563, inlinedAt: !580)
!598 = !{!599, !545, i64 0}
!599 = !{!"infomap", !545, i64 0, !545, i64 8}
!600 = !DILocation(line: 851, column: 10, scope: !563, inlinedAt: !580)
!601 = !DILocation(line: 851, column: 28, scope: !563, inlinedAt: !580)
!602 = distinct !{!602, !584, !596, !603}
!603 = !{!"llvm.loop.mustprogress"}
!604 = !DILocation(line: 854, column: 17, scope: !605, inlinedAt: !580)
!605 = distinct !DILexicalBlock(scope: !563, file: !77, line: 854, column: 7)
!606 = !{!599, !545, i64 8}
!607 = !DILocation(line: 854, column: 7, scope: !605, inlinedAt: !580)
!608 = !DILocation(line: 854, column: 7, scope: !563, inlinedAt: !580)
!609 = !DILocation(line: 857, column: 3, scope: !563, inlinedAt: !580)
!610 = !DILocation(line: 861, column: 29, scope: !563, inlinedAt: !580)
!611 = !DILocation(line: 862, column: 7, scope: !612, inlinedAt: !580)
!612 = distinct !DILexicalBlock(scope: !563, file: !77, line: 862, column: 7)
!613 = !DILocation(line: 862, column: 19, scope: !612, inlinedAt: !580)
!614 = !DILocation(line: 862, column: 22, scope: !612, inlinedAt: !580)
!615 = !DILocation(line: 862, column: 7, scope: !563, inlinedAt: !580)
!616 = !DILocation(line: 868, column: 7, scope: !617, inlinedAt: !580)
!617 = distinct !DILexicalBlock(scope: !612, file: !77, line: 863, column: 5)
!618 = !DILocation(line: 870, column: 5, scope: !617, inlinedAt: !580)
!619 = !DILocation(line: 0, scope: !586, inlinedAt: !620)
!620 = distinct !DILocation(line: 874, column: 29, scope: !563, inlinedAt: !580)
!621 = !DILocation(line: 875, column: 3, scope: !563, inlinedAt: !580)
!622 = !DILocation(line: 877, column: 3, scope: !563, inlinedAt: !580)
!623 = !DILocation(line: 879, column: 1, scope: !563, inlinedAt: !580)
!624 = !DILocation(line: 91, column: 3, scope: !533)
!625 = !DISubprogram(name: "dcgettext", scope: !626, file: !626, line: 51, type: !627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!626 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!627 = !DISubroutineType(types: !628)
!628 = !{!59, !66, !66, !14}
!629 = !DISubprogram(name: "fputs_unlocked", scope: !196, file: !196, line: 691, type: !630, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!630 = !DISubroutineType(types: !631)
!631 = !{!14, !632, !633}
!632 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!633 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!634 = !DILocation(line: 0, scope: !76)
!635 = !DILocation(line: 581, column: 7, scope: !85)
!636 = !{!637, !637, i64 0}
!637 = !{!"int", !546, i64 0}
!638 = !DILocation(line: 581, column: 19, scope: !85)
!639 = !DILocation(line: 581, column: 7, scope: !76)
!640 = !DILocation(line: 585, column: 26, scope: !84)
!641 = !DILocation(line: 0, scope: !84)
!642 = !DILocation(line: 586, column: 23, scope: !84)
!643 = !DILocation(line: 586, column: 28, scope: !84)
!644 = !DILocation(line: 586, column: 32, scope: !84)
!645 = !{!546, !546, i64 0}
!646 = !DILocation(line: 586, column: 38, scope: !84)
!647 = !DILocation(line: 0, scope: !586, inlinedAt: !648)
!648 = distinct !DILocation(line: 586, column: 41, scope: !84)
!649 = !DILocation(line: 1361, column: 11, scope: !586, inlinedAt: !648)
!650 = !DILocation(line: 1361, column: 10, scope: !586, inlinedAt: !648)
!651 = !DILocation(line: 586, column: 19, scope: !84)
!652 = !DILocation(line: 587, column: 5, scope: !84)
!653 = !DILocation(line: 588, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!655 = !DILocation(line: 588, column: 7, scope: !76)
!656 = !DILocation(line: 590, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !77, line: 589, column: 5)
!658 = !DILocation(line: 591, column: 7, scope: !657)
!659 = !DILocation(line: 595, column: 37, scope: !76)
!660 = !DILocation(line: 595, column: 35, scope: !76)
!661 = !DILocation(line: 596, column: 29, scope: !76)
!662 = !DILocation(line: 597, column: 8, scope: !93)
!663 = !DILocation(line: 597, column: 7, scope: !76)
!664 = !DILocation(line: 604, column: 24, scope: !92)
!665 = !DILocation(line: 604, column: 12, scope: !93)
!666 = !DILocation(line: 0, scope: !91)
!667 = !DILocation(line: 610, column: 16, scope: !91)
!668 = !DILocation(line: 610, column: 7, scope: !91)
!669 = !DILocation(line: 611, column: 21, scope: !91)
!670 = !{!671, !671, i64 0}
!671 = !{!"short", !546, i64 0}
!672 = !DILocation(line: 611, column: 19, scope: !91)
!673 = !DILocation(line: 611, column: 16, scope: !91)
!674 = !DILocation(line: 610, column: 30, scope: !91)
!675 = distinct !{!675, !668, !669, !603}
!676 = !DILocation(line: 612, column: 18, scope: !677)
!677 = distinct !DILexicalBlock(scope: !91, file: !77, line: 612, column: 11)
!678 = !DILocation(line: 612, column: 11, scope: !91)
!679 = !DILocation(line: 620, column: 23, scope: !76)
!680 = !DILocation(line: 625, column: 39, scope: !76)
!681 = !DILocation(line: 626, column: 3, scope: !76)
!682 = !DILocation(line: 626, column: 10, scope: !76)
!683 = !DILocation(line: 626, column: 21, scope: !76)
!684 = !DILocation(line: 628, column: 44, scope: !685)
!685 = distinct !DILexicalBlock(scope: !686, file: !77, line: 628, column: 11)
!686 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!687 = !DILocation(line: 628, column: 32, scope: !685)
!688 = !DILocation(line: 628, column: 49, scope: !685)
!689 = !DILocation(line: 628, column: 11, scope: !686)
!690 = !DILocation(line: 630, column: 11, scope: !691)
!691 = distinct !DILexicalBlock(scope: !686, file: !77, line: 630, column: 11)
!692 = !DILocation(line: 630, column: 11, scope: !686)
!693 = !DILocation(line: 632, column: 26, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !77, line: 632, column: 15)
!695 = distinct !DILexicalBlock(scope: !691, file: !77, line: 631, column: 9)
!696 = !DILocation(line: 632, column: 34, scope: !694)
!697 = !DILocation(line: 632, column: 37, scope: !694)
!698 = !DILocation(line: 632, column: 15, scope: !695)
!699 = !DILocation(line: 636, column: 29, scope: !700)
!700 = distinct !DILexicalBlock(scope: !695, file: !77, line: 636, column: 15)
!701 = !DILocation(line: 640, column: 16, scope: !686)
!702 = distinct !{!702, !681, !703, !603}
!703 = !DILocation(line: 641, column: 5, scope: !76)
!704 = !DILocation(line: 644, column: 3, scope: !76)
!705 = !DILocation(line: 0, scope: !586, inlinedAt: !706)
!706 = distinct !DILocation(line: 648, column: 31, scope: !76)
!707 = !DILocation(line: 0, scope: !586, inlinedAt: !708)
!708 = distinct !DILocation(line: 649, column: 31, scope: !76)
!709 = !DILocation(line: 0, scope: !586, inlinedAt: !710)
!710 = distinct !DILocation(line: 650, column: 31, scope: !76)
!711 = !DILocation(line: 0, scope: !586, inlinedAt: !712)
!712 = distinct !DILocation(line: 651, column: 31, scope: !76)
!713 = !DILocation(line: 0, scope: !586, inlinedAt: !714)
!714 = distinct !DILocation(line: 652, column: 31, scope: !76)
!715 = !DILocation(line: 0, scope: !586, inlinedAt: !716)
!716 = distinct !DILocation(line: 653, column: 31, scope: !76)
!717 = !DILocation(line: 0, scope: !586, inlinedAt: !718)
!718 = distinct !DILocation(line: 654, column: 31, scope: !76)
!719 = !DILocation(line: 0, scope: !586, inlinedAt: !720)
!720 = distinct !DILocation(line: 655, column: 31, scope: !76)
!721 = !DILocation(line: 0, scope: !586, inlinedAt: !722)
!722 = distinct !DILocation(line: 656, column: 31, scope: !76)
!723 = !DILocation(line: 0, scope: !586, inlinedAt: !724)
!724 = distinct !DILocation(line: 657, column: 31, scope: !76)
!725 = !DILocation(line: 663, column: 7, scope: !726)
!726 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!727 = !DILocation(line: 664, column: 7, scope: !726)
!728 = !DILocation(line: 664, column: 10, scope: !726)
!729 = !DILocation(line: 663, column: 7, scope: !76)
!730 = !DILocation(line: 669, column: 7, scope: !731)
!731 = distinct !DILexicalBlock(scope: !726, file: !77, line: 665, column: 5)
!732 = !DILocation(line: 671, column: 5, scope: !731)
!733 = !DILocation(line: 676, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !726, file: !77, line: 673, column: 5)
!735 = !DILocation(line: 679, column: 3, scope: !76)
!736 = !DILocation(line: 683, column: 3, scope: !76)
!737 = !DILocation(line: 686, column: 3, scope: !76)
!738 = !DILocation(line: 688, column: 3, scope: !76)
!739 = !DILocation(line: 691, column: 3, scope: !76)
!740 = !DILocation(line: 695, column: 3, scope: !76)
!741 = !DILocation(line: 696, column: 1, scope: !76)
!742 = !DISubprogram(name: "setlocale", scope: !743, file: !743, line: 122, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!743 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!744 = !DISubroutineType(types: !745)
!745 = !{!59, !14, !66}
!746 = !DISubprogram(name: "getenv", scope: !747, file: !747, line: 641, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!747 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!748 = !DISubroutineType(types: !749)
!749 = !{!59, !66}
!750 = !DISubprogram(name: "fwrite_unlocked", scope: !196, file: !196, line: 704, type: !751, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!751 = !DISubroutineType(types: !752)
!752 = !{!63, !753, !63, !63, !633}
!753 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!756 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 202, type: !757, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !760)
!757 = !DISubroutineType(types: !758)
!758 = !{!14, !14, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!760 = !{!761, !762, !763, !764, !765, !766, !782, !785, !788}
!761 = !DILocalVariable(name: "argc", arg: 1, scope: !756, file: !3, line: 202, type: !14)
!762 = !DILocalVariable(name: "argv", arg: 2, scope: !756, file: !3, line: 202, type: !759)
!763 = !DILocalVariable(name: "specified_mode", scope: !756, file: !3, line: 204, type: !66)
!764 = !DILocalVariable(name: "optc", scope: !756, file: !3, line: 205, type: !14)
!765 = !DILocalVariable(name: "scontext", scope: !756, file: !3, line: 206, type: !66)
!766 = !DILocalVariable(name: "options", scope: !756, file: !3, line: 207, type: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mkdir_options", file: !3, line: 95, size: 320, elements: !768)
!768 = !{!769, !773, !774, !775, !776, !777, !781}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "make_ancestor_function", scope: !767, file: !3, line: 99, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!14, !66, !66, !61}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "umask_ancestor", scope: !767, file: !3, line: 102, baseType: !506, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "umask_self", scope: !767, file: !3, line: 105, baseType: !506, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !767, file: !3, line: 108, baseType: !506, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mode_bits", scope: !767, file: !3, line: 111, baseType: !506, size: 32, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !767, file: !3, line: 114, baseType: !778, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !780, line: 53, flags: DIFlagFwdDecl)
!780 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!781 = !DIDerivedType(tag: DW_TAG_member, name: "created_directory_format", scope: !767, file: !3, line: 117, baseType: !66, size: 64, offset: 256)
!782 = !DILocalVariable(name: "ret", scope: !783, file: !3, line: 279, type: !14)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 278, column: 5)
!784 = distinct !DILexicalBlock(scope: !756, file: !3, line: 277, column: 7)
!785 = !DILocalVariable(name: "umask_value", scope: !786, file: !3, line: 294, type: !506)
!786 = distinct !DILexicalBlock(scope: !787, file: !3, line: 293, column: 5)
!787 = distinct !DILexicalBlock(scope: !756, file: !3, line: 292, column: 7)
!788 = !DILocalVariable(name: "change", scope: !789, file: !3, line: 299, type: !791)
!789 = distinct !DILexicalBlock(scope: !790, file: !3, line: 298, column: 9)
!790 = distinct !DILexicalBlock(scope: !786, file: !3, line: 297, column: 11)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !793, line: 35, flags: DIFlagFwdDecl)
!793 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!794 = !DILocation(line: 0, scope: !756)
!795 = !DILocation(line: 207, column: 3, scope: !756)
!796 = !DILocation(line: 207, column: 24, scope: !756)
!797 = !DILocation(line: 209, column: 11, scope: !756)
!798 = !DILocation(line: 210, column: 11, scope: !756)
!799 = !DILocation(line: 210, column: 16, scope: !756)
!800 = !{!801, !637, i64 16}
!801 = !{!"mkdir_options", !545, i64 0, !637, i64 8, !637, i64 12, !637, i64 16, !637, i64 20, !545, i64 24, !545, i64 32}
!802 = !DILocation(line: 211, column: 11, scope: !756)
!803 = !DILocation(line: 212, column: 11, scope: !756)
!804 = !DILocation(line: 216, column: 21, scope: !756)
!805 = !DILocation(line: 212, column: 36, scope: !756)
!806 = !DILocation(line: 216, column: 3, scope: !756)
!807 = !DILocation(line: 217, column: 3, scope: !756)
!808 = !DILocation(line: 218, column: 3, scope: !756)
!809 = !DILocation(line: 219, column: 3, scope: !756)
!810 = !DILocation(line: 221, column: 3, scope: !756)
!811 = !DILocation(line: 223, column: 3, scope: !756)
!812 = !DILocation(line: 223, column: 18, scope: !756)
!813 = distinct !{!813, !811, !814, !603}
!814 = !DILocation(line: 266, column: 5, scope: !756)
!815 = !DILocation(line: 231, column: 28, scope: !816)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 226, column: 9)
!817 = distinct !DILexicalBlock(scope: !756, file: !3, line: 224, column: 5)
!818 = !DILocation(line: 232, column: 11, scope: !816)
!819 = !DILocation(line: 234, column: 46, scope: !816)
!820 = !DILocation(line: 235, column: 11, scope: !816)
!821 = !DILocation(line: 254, column: 20, scope: !822)
!822 = distinct !DILexicalBlock(scope: !823, file: !3, line: 254, column: 20)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 242, column: 20)
!824 = distinct !DILexicalBlock(scope: !816, file: !3, line: 237, column: 15)
!825 = !DILocation(line: 254, column: 20, scope: !823)
!826 = !DILocation(line: 256, column: 15, scope: !827)
!827 = distinct !DILexicalBlock(scope: !822, file: !3, line: 255, column: 13)
!828 = !DILocation(line: 259, column: 13, scope: !827)
!829 = !DILocation(line: 261, column: 9, scope: !816)
!830 = !DILocation(line: 262, column: 9, scope: !816)
!831 = !DILocation(line: 264, column: 11, scope: !816)
!832 = !DILocation(line: 234, column: 44, scope: !816)
!833 = !{!801, !545, i64 32}
!834 = !DILocation(line: 228, column: 42, scope: !816)
!835 = !{!801, !545, i64 0}
!836 = !DILocation(line: 268, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !756, file: !3, line: 268, column: 7)
!838 = !DILocation(line: 268, column: 14, scope: !837)
!839 = !DILocation(line: 268, column: 7, scope: !756)
!840 = !DILocation(line: 270, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !837, file: !3, line: 269, column: 5)
!842 = !DILocation(line: 271, column: 7, scope: !841)
!843 = !DILocation(line: 292, column: 38, scope: !787)
!844 = !DILocation(line: 294, column: 28, scope: !786)
!845 = !DILocation(line: 0, scope: !786)
!846 = !DILocation(line: 295, column: 44, scope: !786)
!847 = !DILocation(line: 295, column: 15, scope: !786)
!848 = !DILocation(line: 295, column: 30, scope: !786)
!849 = !{!801, !637, i64 8}
!850 = !DILocation(line: 297, column: 11, scope: !786)
!851 = !DILocation(line: 299, column: 40, scope: !789)
!852 = !DILocation(line: 0, scope: !789)
!853 = !DILocation(line: 300, column: 16, scope: !854)
!854 = distinct !DILexicalBlock(scope: !789, file: !3, line: 300, column: 15)
!855 = !DILocation(line: 300, column: 15, scope: !789)
!856 = !DILocation(line: 301, column: 13, scope: !854)
!857 = !DILocation(line: 303, column: 26, scope: !789)
!858 = !DILocation(line: 303, column: 24, scope: !789)
!859 = !DILocation(line: 305, column: 46, scope: !789)
!860 = !DILocation(line: 305, column: 44, scope: !789)
!861 = !DILocation(line: 305, column: 19, scope: !789)
!862 = !DILocation(line: 305, column: 30, scope: !789)
!863 = !{!801, !637, i64 12}
!864 = !DILocation(line: 306, column: 17, scope: !789)
!865 = !DILocation(line: 306, column: 11, scope: !789)
!866 = !DILocation(line: 307, column: 9, scope: !789)
!867 = !DILocation(line: 310, column: 24, scope: !868)
!868 = distinct !DILexicalBlock(scope: !790, file: !3, line: 309, column: 9)
!869 = !DILocation(line: 311, column: 19, scope: !868)
!870 = !DILocation(line: 311, column: 30, scope: !868)
!871 = !DILocation(line: 314, column: 22, scope: !786)
!872 = !DILocation(line: 314, column: 7, scope: !786)
!873 = !DILocation(line: 317, column: 39, scope: !756)
!874 = !DILocation(line: 315, column: 5, scope: !786)
!875 = !DILocation(line: 317, column: 37, scope: !756)
!876 = !DILocation(line: 317, column: 52, scope: !756)
!877 = !DILocation(line: 317, column: 10, scope: !756)
!878 = !DILocation(line: 319, column: 1, scope: !756)
!879 = !DILocation(line: 317, column: 3, scope: !756)
!880 = !DISubprogram(name: "bindtextdomain", scope: !626, file: !626, line: 86, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!881 = !DISubroutineType(types: !882)
!882 = !{!59, !66, !66}
!883 = !DISubprogram(name: "textdomain", scope: !626, file: !626, line: 82, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!884 = !DISubprogram(name: "atexit", scope: !747, file: !747, line: 602, type: !885, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!885 = !DISubroutineType(types: !886)
!886 = !{!14, !222}
!887 = distinct !DISubprogram(name: "make_ancestor", scope: !3, file: !3, line: 135, type: !771, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !888)
!888 = !{!889, !890, !891, !892, !895, !896}
!889 = !DILocalVariable(name: "dir", arg: 1, scope: !887, file: !3, line: 135, type: !66)
!890 = !DILocalVariable(name: "component", arg: 2, scope: !887, file: !3, line: 135, type: !66)
!891 = !DILocalVariable(name: "options", arg: 3, scope: !887, file: !3, line: 135, type: !61)
!892 = !DILocalVariable(name: "o", scope: !887, file: !3, line: 137, type: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!895 = !DILocalVariable(name: "r", scope: !887, file: !3, line: 147, type: !14)
!896 = !DILocalVariable(name: "mkdir_errno", scope: !897, file: !3, line: 150, type: !14)
!897 = distinct !DILexicalBlock(scope: !898, file: !3, line: 149, column: 5)
!898 = distinct !DILexicalBlock(scope: !887, file: !3, line: 148, column: 7)
!899 = !DILocation(line: 0, scope: !887)
!900 = !DILocation(line: 139, column: 10, scope: !901)
!901 = distinct !DILexicalBlock(scope: !887, file: !3, line: 139, column: 7)
!902 = !{!801, !545, i64 24}
!903 = !DILocation(line: 139, column: 7, scope: !901)
!904 = !DILocation(line: 140, column: 7, scope: !901)
!905 = !DILocalVariable(name: "selabel_handle", arg: 1, scope: !906, file: !907, line: 49, type: !778)
!906 = distinct !DISubprogram(name: "defaultcon", scope: !907, file: !907, line: 49, type: !908, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !910)
!907 = !DIFile(filename: "src/selinux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "13efa93c67c6cc8e1be8195655a2b752")
!908 = !DISubroutineType(types: !909)
!909 = !{!14, !778, !66, !506}
!910 = !{!905, !911, !912}
!911 = !DILocalVariable(name: "path", arg: 2, scope: !906, file: !907, line: 50, type: !66)
!912 = !DILocalVariable(name: "mode", arg: 3, scope: !906, file: !907, line: 50, type: !506)
!913 = !DILocation(line: 0, scope: !906, inlinedAt: !914)
!914 = distinct !DILocation(line: 140, column: 10, scope: !901)
!915 = !DILocation(line: 51, column: 3, scope: !906, inlinedAt: !914)
!916 = !DILocation(line: 51, column: 9, scope: !906, inlinedAt: !914)
!917 = !DILocation(line: 139, column: 7, scope: !887)
!918 = !DILocation(line: 145, column: 10, scope: !919)
!919 = distinct !DILexicalBlock(scope: !887, file: !3, line: 145, column: 7)
!920 = !DILocation(line: 145, column: 31, scope: !919)
!921 = !DILocation(line: 145, column: 25, scope: !919)
!922 = !DILocation(line: 145, column: 7, scope: !887)
!923 = !DILocation(line: 146, column: 5, scope: !919)
!924 = !DILocation(line: 147, column: 11, scope: !887)
!925 = !DILocation(line: 148, column: 10, scope: !898)
!926 = !DILocation(line: 148, column: 31, scope: !898)
!927 = !DILocation(line: 148, column: 25, scope: !898)
!928 = !DILocation(line: 148, column: 7, scope: !887)
!929 = !DILocation(line: 150, column: 25, scope: !897)
!930 = !DILocation(line: 0, scope: !897)
!931 = !DILocation(line: 151, column: 7, scope: !897)
!932 = !DILocation(line: 152, column: 13, scope: !897)
!933 = !DILocation(line: 153, column: 5, scope: !897)
!934 = !DILocation(line: 154, column: 9, scope: !935)
!935 = distinct !DILexicalBlock(scope: !887, file: !3, line: 154, column: 7)
!936 = !DILocation(line: 154, column: 7, scope: !887)
!937 = !DILocation(line: 156, column: 15, scope: !938)
!938 = distinct !DILexicalBlock(scope: !935, file: !3, line: 155, column: 5)
!939 = !DILocation(line: 156, column: 41, scope: !938)
!940 = !DILocalVariable(name: "dir", arg: 1, scope: !941, file: !3, line: 122, type: !66)
!941 = distinct !DISubprogram(name: "announce_mkdir", scope: !3, file: !3, line: 122, type: !942, scopeLine: 123, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !66, !61}
!944 = !{!940, !945, !946}
!945 = !DILocalVariable(name: "options", arg: 2, scope: !941, file: !3, line: 122, type: !61)
!946 = !DILocalVariable(name: "o", scope: !941, file: !3, line: 124, type: !893)
!947 = !DILocation(line: 0, scope: !941, inlinedAt: !948)
!948 = distinct !DILocation(line: 157, column: 7, scope: !938)
!949 = !DILocation(line: 125, column: 10, scope: !950, inlinedAt: !948)
!950 = distinct !DILexicalBlock(scope: !941, file: !3, line: 125, column: 7)
!951 = !DILocation(line: 125, column: 7, scope: !950, inlinedAt: !948)
!952 = !DILocation(line: 125, column: 7, scope: !941, inlinedAt: !948)
!953 = !DILocation(line: 126, column: 19, scope: !950, inlinedAt: !948)
!954 = !DILocation(line: 126, column: 56, scope: !950, inlinedAt: !948)
!955 = !DILocation(line: 126, column: 5, scope: !950, inlinedAt: !948)
!956 = !DILocation(line: 159, column: 3, scope: !887)
!957 = !DISubprogram(name: "getopt_long", scope: !163, file: !163, line: 66, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!958 = !DISubroutineType(types: !959)
!959 = !{!14, !14, !960, !66, !962, !168}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!963 = !DISubprogram(name: "umask", scope: !964, file: !964, line: 380, type: !965, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!964 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!965 = !DISubroutineType(types: !966)
!966 = !{!507, !507}
!967 = distinct !DISubprogram(name: "process_dir", scope: !3, file: !3, line: 164, type: !968, scopeLine: 165, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !971)
!968 = !DISubroutineType(types: !969)
!969 = !{!14, !59, !970, !61}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!971 = !{!972, !973, !974, !975, !976}
!972 = !DILocalVariable(name: "dir", arg: 1, scope: !967, file: !3, line: 164, type: !59)
!973 = !DILocalVariable(name: "wd", arg: 2, scope: !967, file: !3, line: 164, type: !970)
!974 = !DILocalVariable(name: "options", arg: 3, scope: !967, file: !3, line: 164, type: !61)
!975 = !DILocalVariable(name: "o", scope: !967, file: !3, line: 166, type: !893)
!976 = !DILocalVariable(name: "ret", scope: !967, file: !3, line: 178, type: !14)
!977 = !DILocation(line: 0, scope: !967)
!978 = !DILocation(line: 169, column: 10, scope: !979)
!979 = distinct !DILexicalBlock(scope: !967, file: !3, line: 169, column: 7)
!980 = !DILocation(line: 169, column: 7, scope: !979)
!981 = !DILocation(line: 169, column: 7, scope: !967)
!982 = !DILocation(line: 0, scope: !906, inlinedAt: !983)
!983 = distinct !DILocation(line: 172, column: 14, scope: !984)
!984 = distinct !DILexicalBlock(scope: !985, file: !3, line: 171, column: 11)
!985 = distinct !DILexicalBlock(scope: !979, file: !3, line: 170, column: 5)
!986 = !DILocation(line: 51, column: 3, scope: !906, inlinedAt: !983)
!987 = !DILocation(line: 51, column: 9, scope: !906, inlinedAt: !983)
!988 = !DILocation(line: 171, column: 11, scope: !985)
!989 = !DILocation(line: 178, column: 44, scope: !967)
!990 = !DILocation(line: 179, column: 35, scope: !967)
!991 = !DILocation(line: 180, column: 35, scope: !967)
!992 = !{!801, !637, i64 20}
!993 = !DILocation(line: 178, column: 14, scope: !967)
!994 = !DILocation(line: 189, column: 27, scope: !995)
!995 = distinct !DILexicalBlock(scope: !967, file: !3, line: 189, column: 7)
!996 = !DILocation(line: 189, column: 33, scope: !995)
!997 = !DILocation(line: 189, column: 30, scope: !995)
!998 = !DILocation(line: 190, column: 7, scope: !995)
!999 = !DILocation(line: 190, column: 13, scope: !995)
!1000 = !DILocation(line: 190, column: 10, scope: !995)
!1001 = !DILocation(line: 189, column: 7, scope: !967)
!1002 = !DILocalVariable(name: "selabel_handle", arg: 1, scope: !1003, file: !907, line: 44, type: !778)
!1003 = distinct !DISubprogram(name: "restorecon", scope: !907, file: !907, line: 44, type: !1004, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!87, !778, !66, !87}
!1006 = !{!1002, !1007, !1008}
!1007 = !DILocalVariable(name: "path", arg: 2, scope: !1003, file: !907, line: 45, type: !66)
!1008 = !DILocalVariable(name: "recurse", arg: 3, scope: !1003, file: !907, line: 45, type: !87)
!1009 = !DILocation(line: 0, scope: !1003, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 192, column: 13, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 192, column: 11)
!1012 = distinct !DILexicalBlock(scope: !995, file: !3, line: 191, column: 5)
!1013 = !DILocation(line: 46, column: 3, scope: !1003, inlinedAt: !1010)
!1014 = !DILocation(line: 46, column: 9, scope: !1003, inlinedAt: !1010)
!1015 = !DILocation(line: 192, column: 11, scope: !1012)
!1016 = !DILocation(line: 198, column: 3, scope: !967)
!1017 = !DILocation(line: 0, scope: !941)
!1018 = !DILocation(line: 125, column: 10, scope: !950)
!1019 = !DILocation(line: 125, column: 7, scope: !950)
!1020 = !DILocation(line: 125, column: 7, scope: !941)
!1021 = !DILocation(line: 126, column: 19, scope: !950)
!1022 = !DILocation(line: 126, column: 56, scope: !950)
!1023 = !DILocation(line: 126, column: 5, scope: !950)
!1024 = !DILocation(line: 127, column: 1, scope: !941)
!1025 = !DISubprogram(name: "mkdir", scope: !964, file: !964, line: 389, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!14, !66, !507}
!1028 = distinct !DISubprogram(name: "prog_fprintf", scope: !391, file: !391, line: 28, type: !1029, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1065)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !1031, !66, null}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !102, line: 7, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !104, line: 49, size: 1728, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1033, file: !104, line: 51, baseType: !14, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1033, file: !104, line: 54, baseType: !59, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1033, file: !104, line: 55, baseType: !59, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1033, file: !104, line: 56, baseType: !59, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1033, file: !104, line: 57, baseType: !59, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1033, file: !104, line: 58, baseType: !59, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1033, file: !104, line: 59, baseType: !59, size: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1033, file: !104, line: 60, baseType: !59, size: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1033, file: !104, line: 61, baseType: !59, size: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1033, file: !104, line: 64, baseType: !59, size: 64, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1033, file: !104, line: 65, baseType: !59, size: 64, offset: 640)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1033, file: !104, line: 66, baseType: !59, size: 64, offset: 704)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1033, file: !104, line: 68, baseType: !119, size: 64, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1033, file: !104, line: 70, baseType: !1049, size: 64, offset: 832)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1033, file: !104, line: 72, baseType: !14, size: 32, offset: 896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1033, file: !104, line: 73, baseType: !14, size: 32, offset: 928)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1033, file: !104, line: 74, baseType: !126, size: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1033, file: !104, line: 77, baseType: !62, size: 16, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1033, file: !104, line: 78, baseType: !130, size: 8, offset: 1040)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1033, file: !104, line: 79, baseType: !132, size: 8, offset: 1048)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1033, file: !104, line: 81, baseType: !136, size: 64, offset: 1088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1033, file: !104, line: 89, baseType: !139, size: 64, offset: 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1033, file: !104, line: 91, baseType: !141, size: 64, offset: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1033, file: !104, line: 92, baseType: !144, size: 64, offset: 1280)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1033, file: !104, line: 93, baseType: !1049, size: 64, offset: 1344)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1033, file: !104, line: 94, baseType: !61, size: 64, offset: 1408)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1033, file: !104, line: 95, baseType: !63, size: 64, offset: 1472)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1033, file: !104, line: 96, baseType: !14, size: 32, offset: 1536)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1033, file: !104, line: 98, baseType: !151, size: 160, offset: 1568)
!1065 = !{!1066, !1067, !1068}
!1066 = !DILocalVariable(name: "fp", arg: 1, scope: !1028, file: !391, line: 28, type: !1031)
!1067 = !DILocalVariable(name: "fmt", arg: 2, scope: !1028, file: !391, line: 28, type: !66)
!1068 = !DILocalVariable(name: "ap", scope: !1028, file: !391, line: 30, type: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !196, line: 52, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !198, line: 32, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1072, baseType: !1073)
!1072 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src")
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !202, size: 256, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1073, file: !1072, line: 30, baseType: !61, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1073, file: !1072, line: 30, baseType: !61, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1073, file: !1072, line: 30, baseType: !61, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1073, file: !1072, line: 30, baseType: !14, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1073, file: !1072, line: 30, baseType: !14, size: 32, offset: 224)
!1080 = !DILocation(line: 0, scope: !1028)
!1081 = !DILocation(line: 30, column: 3, scope: !1028)
!1082 = !DILocation(line: 30, column: 11, scope: !1028)
!1083 = !DILocation(line: 31, column: 3, scope: !1028)
!1084 = !DILocation(line: 32, column: 3, scope: !1028)
!1085 = !DILocation(line: 33, column: 3, scope: !1028)
!1086 = !DILocalVariable(name: "__stream", arg: 1, scope: !1087, file: !1088, line: 132, type: !1091)
!1087 = distinct !DISubprogram(name: "vfprintf", scope: !1088, file: !1088, line: 132, type: !1089, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1092)
!1088 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!14, !1091, !632, !1070}
!1091 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1031)
!1092 = !{!1086, !1093, !1094}
!1093 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1087, file: !1088, line: 133, type: !632)
!1094 = !DILocalVariable(name: "__ap", arg: 3, scope: !1087, file: !1088, line: 133, type: !1070)
!1095 = !DILocation(line: 0, scope: !1087, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 34, column: 3, scope: !1028)
!1097 = !DILocation(line: 135, column: 10, scope: !1087, inlinedAt: !1096)
!1098 = !{!1099, !1101}
!1099 = distinct !{!1099, !1100, !"vfprintf.inline: argument 0"}
!1100 = distinct !{!1100, !"vfprintf.inline"}
!1101 = distinct !{!1101, !1100, !"vfprintf.inline: argument 1"}
!1102 = !DILocation(line: 35, column: 3, scope: !1028)
!1103 = !DILocalVariable(name: "__c", arg: 1, scope: !1104, file: !1105, line: 91, type: !14)
!1104 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1105, file: !1105, line: 91, type: !1106, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1108)
!1105 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!14, !14, !1031}
!1108 = !{!1103, !1109}
!1109 = !DILocalVariable(name: "__stream", arg: 2, scope: !1104, file: !1105, line: 91, type: !1031)
!1110 = !DILocation(line: 0, scope: !1104, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 36, column: 3, scope: !1028)
!1112 = !DILocation(line: 93, column: 10, scope: !1104, inlinedAt: !1111)
!1113 = !{!1114, !545, i64 40}
!1114 = !{!"_IO_FILE", !637, i64 0, !545, i64 8, !545, i64 16, !545, i64 24, !545, i64 32, !545, i64 40, !545, i64 48, !545, i64 56, !545, i64 64, !545, i64 72, !545, i64 80, !545, i64 88, !545, i64 96, !545, i64 104, !637, i64 112, !637, i64 116, !1115, i64 120, !671, i64 128, !546, i64 130, !546, i64 131, !545, i64 136, !1115, i64 144, !545, i64 152, !545, i64 160, !545, i64 168, !545, i64 176, !1115, i64 184, !637, i64 192, !546, i64 196}
!1115 = !{!"long", !546, i64 0}
!1116 = !{!1114, !545, i64 48}
!1117 = !{!"branch_weights", i32 2000, i32 1}
!1118 = !DILocation(line: 37, column: 1, scope: !1028)
!1119 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !180, file: !180, line: 50, type: !564, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !179, retainedNodes: !1120)
!1120 = !{!1121}
!1121 = !DILocalVariable(name: "file", arg: 1, scope: !1119, file: !180, line: 50, type: !66)
!1122 = !DILocation(line: 0, scope: !1119)
!1123 = !DILocation(line: 52, column: 13, scope: !1119)
!1124 = !DILocation(line: 53, column: 1, scope: !1119)
!1125 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !180, file: !180, line: 87, type: !1126, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !179, retainedNodes: !1128)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{null, !87}
!1128 = !{!1129}
!1129 = !DILocalVariable(name: "ignore", arg: 1, scope: !1125, file: !180, line: 87, type: !87)
!1130 = !DILocation(line: 0, scope: !1125)
!1131 = !DILocation(line: 89, column: 16, scope: !1125)
!1132 = !{!1133, !1133, i64 0}
!1133 = !{!"_Bool", !546, i64 0}
!1134 = !DILocation(line: 90, column: 1, scope: !1125)
!1135 = distinct !DISubprogram(name: "close_stdout", scope: !180, file: !180, line: 116, type: !223, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !179, retainedNodes: !1136)
!1136 = !{!1137}
!1137 = !DILocalVariable(name: "write_error", scope: !1138, file: !180, line: 121, type: !66)
!1138 = distinct !DILexicalBlock(scope: !1139, file: !180, line: 120, column: 5)
!1139 = distinct !DILexicalBlock(scope: !1135, file: !180, line: 118, column: 7)
!1140 = !DILocation(line: 118, column: 21, scope: !1139)
!1141 = !DILocation(line: 118, column: 7, scope: !1139)
!1142 = !DILocation(line: 118, column: 29, scope: !1139)
!1143 = !DILocation(line: 119, column: 7, scope: !1139)
!1144 = !DILocation(line: 119, column: 12, scope: !1139)
!1145 = !{i8 0, i8 2}
!1146 = !DILocation(line: 119, column: 25, scope: !1139)
!1147 = !DILocation(line: 119, column: 28, scope: !1139)
!1148 = !DILocation(line: 119, column: 34, scope: !1139)
!1149 = !DILocation(line: 118, column: 7, scope: !1135)
!1150 = !DILocation(line: 121, column: 33, scope: !1138)
!1151 = !DILocation(line: 0, scope: !1138)
!1152 = !DILocation(line: 122, column: 11, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1138, file: !180, line: 122, column: 11)
!1154 = !DILocation(line: 0, scope: !1153)
