; ModuleID = 'src/mkfifo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.selabel_handle = type opaque
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [50 x i8] c"Create named pipes (FIFOs) with the given NAMEs.\0A\00", align 1

!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256)
!24 = !DIEnumerator(name: "_ISlower", value: 512)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!28 = !DIEnumerator(name: "_ISspace", value: 8192)
!29 = !DIEnumerator(name: "_ISprint", value: 16384)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768)
!31 = !DIEnumerator(name: "_ISblank", value: 1)
!32 = !DIEnumerator(name: "_IScntrl", value: 2)
!33 = !DIEnumerator(name: "_ISpunct", value: 4)
!34 = !DIEnumerator(name: "_ISalnum", value: 8)
!35 = !{!36, !38, !39, !40, !41, !44, !46}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!43 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !{!48, !0}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !50, file: !51, line: 575, type: !39, isLocal: true, isDefinition: true)
!50 = distinct !DISubprogram(name: "oputs_", scope: !51, file: !51, line: 573, type: !52, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !54)
!51 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!52 = !DISubroutineType(types: !53)
!53 = !{null, !44, !44}
!54 = !{!55, !56, !57, !60, !62, !63, !64, !68, !69, !70, !71, !73, !129, !130, !131, !133, !134}
!55 = !DILocalVariable(name: "program", arg: 1, scope: !50, file: !51, line: 573, type: !44)
!56 = !DILocalVariable(name: "option", arg: 2, scope: !50, file: !51, line: 573, type: !44)
!57 = !DILocalVariable(name: "term", scope: !58, file: !51, line: 585, type: !44)
!58 = distinct !DILexicalBlock(scope: !59, file: !51, line: 582, column: 5)
!59 = distinct !DILexicalBlock(scope: !50, file: !51, line: 581, column: 7)
!60 = !DILocalVariable(name: "double_space", scope: !50, file: !51, line: 594, type: !61)
!61 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!62 = !DILocalVariable(name: "first_word", scope: !50, file: !51, line: 595, type: !44)
!63 = !DILocalVariable(name: "option_text", scope: !50, file: !51, line: 596, type: !44)
!64 = !DILocalVariable(name: "s", scope: !65, file: !51, line: 608, type: !44)
!65 = distinct !DILexicalBlock(scope: !66, file: !51, line: 605, column: 5)
!66 = distinct !DILexicalBlock(scope: !67, file: !51, line: 604, column: 12)
!67 = distinct !DILexicalBlock(scope: !50, file: !51, line: 597, column: 7)
!68 = !DILocalVariable(name: "spaces", scope: !65, file: !51, line: 609, type: !41)
!69 = !DILocalVariable(name: "anchor_len", scope: !50, file: !51, line: 620, type: !41)
!70 = !DILocalVariable(name: "desc_text", scope: !50, file: !51, line: 625, type: !44)
!71 = !DILocalVariable(name: "__ptr", scope: !72, file: !51, line: 644, type: !44)
!72 = distinct !DILexicalBlock(scope: !50, file: !51, line: 644, column: 3)
!73 = !DILocalVariable(name: "__stream", scope: !72, file: !51, line: 644, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 7, baseType: !77)
!76 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !78, line: 49, size: 1728, elements: !79)
!78 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !95, !97, !98, !99, !103, !104, !106, !110, !113, !115, !118, !121, !122, !123, !124, !125}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !77, file: !78, line: 51, baseType: !39, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !77, file: !78, line: 54, baseType: !36, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !77, file: !78, line: 55, baseType: !36, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !77, file: !78, line: 56, baseType: !36, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !77, file: !78, line: 57, baseType: !36, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !77, file: !78, line: 58, baseType: !36, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !77, file: !78, line: 59, baseType: !36, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !77, file: !78, line: 60, baseType: !36, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !77, file: !78, line: 61, baseType: !36, size: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !77, file: !78, line: 64, baseType: !36, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !77, file: !78, line: 65, baseType: !36, size: 64, offset: 640)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !77, file: !78, line: 66, baseType: !36, size: 64, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !77, file: !78, line: 68, baseType: !93, size: 64, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !78, line: 36, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !77, file: !78, line: 70, baseType: !96, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !77, file: !78, line: 72, baseType: !39, size: 32, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !77, file: !78, line: 73, baseType: !39, size: 32, offset: 928)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !77, file: !78, line: 74, baseType: !100, size: 64, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !101, line: 152, baseType: !102)
!101 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!102 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !77, file: !78, line: 77, baseType: !40, size: 16, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !77, file: !78, line: 78, baseType: !105, size: 8, offset: 1040)
!105 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !77, file: !78, line: 79, baseType: !107, size: 8, offset: 1048)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 1)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !77, file: !78, line: 81, baseType: !111, size: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !78, line: 43, baseType: null)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !77, file: !78, line: 89, baseType: !114, size: 64, offset: 1152)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !101, line: 153, baseType: !102)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !77, file: !78, line: 91, baseType: !116, size: 64, offset: 1216)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !78, line: 37, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !77, file: !78, line: 92, baseType: !119, size: 64, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !78, line: 38, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !77, file: !78, line: 93, baseType: !96, size: 64, offset: 1344)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !77, file: !78, line: 94, baseType: !38, size: 64, offset: 1408)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !77, file: !78, line: 95, baseType: !41, size: 64, offset: 1472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !77, file: !78, line: 96, baseType: !39, size: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !77, file: !78, line: 98, baseType: !126, size: 160, offset: 1568)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 20)
!129 = !DILocalVariable(name: "__cnt", scope: !72, file: !51, line: 644, type: !41)
!130 = !DILocalVariable(name: "url_program", scope: !50, file: !51, line: 648, type: !44)
!131 = !DILocalVariable(name: "__ptr", scope: !132, file: !51, line: 686, type: !44)
!132 = distinct !DILexicalBlock(scope: !50, file: !51, line: 686, column: 3)
!133 = !DILocalVariable(name: "__stream", scope: !132, file: !51, line: 686, type: !74)
!134 = !DILocalVariable(name: "__cnt", scope: !132, file: !51, line: 686, type: !41)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1280, elements: !145)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !138, line: 50, size: 256, elements: !139)
!138 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!139 = !{!140, !141, !142, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !137, file: !138, line: 52, baseType: !44, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !137, file: !138, line: 55, baseType: !39, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !137, file: !138, line: 56, baseType: !143, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !137, file: !138, line: 57, baseType: !39, size: 32, offset: 192)
!145 = !{!146}
!146 = !DISubrange(count: 5)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "Version", scope: !149, file: !150, line: 3, type: !44, isLocal: false, isDefinition: true)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !151, splitDebugInlining: false, nameTableKind: None)
!150 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!151 = !{!147}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "file_name", scope: !154, file: !155, line: 45, type: !44, isLocal: true, isDefinition: true)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !156, splitDebugInlining: false, nameTableKind: None)
!155 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!156 = !{!152, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !154, file: !155, line: 55, type: !61, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !161, file: !162, line: 66, type: !197, isLocal: false, isDefinition: true)
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !163, globals: !164, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!163 = !{!38, !46}
!164 = !{!165, !191, !159, !193, !195}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "old_file_name", scope: !167, file: !162, line: 304, type: !44, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "verror_at_line", scope: !162, file: !162, line: 298, type: !168, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !184)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !39, !39, !44, !7, !44, !170}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !171, line: 52, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !173, line: 32, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !175, baseType: !176)
!175 = !DIFile(filename: "lib/error.c", directory: "/src")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !177, size: 256, elements: !178)
!177 = !DINamespace(name: "std", scope: null)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !176, file: !175, baseType: !38, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !176, file: !175, baseType: !38, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !176, file: !175, baseType: !38, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !176, file: !175, baseType: !39, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !176, file: !175, baseType: !39, size: 32, offset: 224)
!184 = !{!185, !186, !187, !188, !189, !190}
!185 = !DILocalVariable(name: "status", arg: 1, scope: !167, file: !162, line: 298, type: !39)
!186 = !DILocalVariable(name: "errnum", arg: 2, scope: !167, file: !162, line: 298, type: !39)
!187 = !DILocalVariable(name: "file_name", arg: 3, scope: !167, file: !162, line: 298, type: !44)
!188 = !DILocalVariable(name: "line_number", arg: 4, scope: !167, file: !162, line: 298, type: !7)
!189 = !DILocalVariable(name: "message", arg: 5, scope: !167, file: !162, line: 298, type: !44)
!190 = !DILocalVariable(name: "args", arg: 6, scope: !167, file: !162, line: 298, type: !170)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "old_line_number", scope: !167, file: !162, line: 305, type: !7, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "error_message_count", scope: !161, file: !162, line: 69, type: !7, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !161, file: !162, line: 295, type: !39, isLocal: false, isDefinition: true)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "program_name", scope: !202, file: !203, line: 31, type: !44, isLocal: false, isDefinition: true)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !204, globals: !205, splitDebugInlining: false, nameTableKind: None)
!203 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!204 = !{!36}
!205 = !{!200}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "utf07FF", scope: !208, file: !209, line: 46, type: !239, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "proper_name_lite", scope: !209, file: !209, line: 38, type: !210, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !214)
!209 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!210 = !DISubroutineType(types: !211)
!211 = !{!44, !44, !44}
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !213, splitDebugInlining: false, nameTableKind: None)
!213 = !{!206}
!214 = !{!215, !216, !217, !218, !223}
!215 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !208, file: !209, line: 38, type: !44)
!216 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !208, file: !209, line: 38, type: !44)
!217 = !DILocalVariable(name: "translation", scope: !208, file: !209, line: 40, type: !44)
!218 = !DILocalVariable(name: "w", scope: !208, file: !209, line: 47, type: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !220, line: 37, baseType: !221)
!220 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !101, line: 57, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !101, line: 42, baseType: !7)
!223 = !DILocalVariable(name: "mbs", scope: !208, file: !209, line: 48, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !225, line: 6, baseType: !226)
!225 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !227, line: 21, baseType: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 13, size: 64, elements: !229)
!229 = !{!230, !231}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !228, file: !227, line: 15, baseType: !39, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !228, file: !227, line: 20, baseType: !232, size: 32, offset: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !227, line: 16, size: 32, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !232, file: !227, line: 18, baseType: !7, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !232, file: !227, line: 19, baseType: !236, size: 32)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 4)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 2)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !244, file: !245, line: 76, type: !313, isLocal: false, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !246, retainedTypes: !252, globals: !253, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!246 = !{!5, !247, !20}
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !248)
!248 = !{!249, !250, !251}
!249 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!250 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!251 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!252 = !{!39, !40, !41}
!253 = !{!242, !254, !260, !272, !274, !279, !302, !309, !311}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !244, file: !245, line: 92, type: !256, isLocal: false, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 320, elements: !258)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!258 = !{!259}
!259 = !DISubrange(count: 10)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !244, file: !245, line: 1040, type: !262, isLocal: false, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !245, line: 56, size: 448, elements: !263)
!263 = !{!264, !265, !266, !270, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !262, file: !245, line: 59, baseType: !5, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !262, file: !245, line: 62, baseType: !39, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !262, file: !245, line: 66, baseType: !267, size: 256, offset: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !262, file: !245, line: 69, baseType: !44, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !262, file: !245, line: 72, baseType: !44, size: 64, offset: 384)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !244, file: !245, line: 107, type: !262, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "slot0", scope: !244, file: !245, line: 831, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "quote", scope: !281, file: !245, line: 228, type: !300, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "gettext_quote", scope: !245, file: !245, line: 197, type: !282, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !244, retainedNodes: !284)
!282 = !DISubroutineType(types: !283)
!283 = !{!44, !44, !5}
!284 = !{!285, !286, !287, !288, !289}
!285 = !DILocalVariable(name: "msgid", arg: 1, scope: !281, file: !245, line: 197, type: !44)
!286 = !DILocalVariable(name: "s", arg: 2, scope: !281, file: !245, line: 197, type: !5)
!287 = !DILocalVariable(name: "translation", scope: !281, file: !245, line: 199, type: !44)
!288 = !DILocalVariable(name: "w", scope: !281, file: !245, line: 229, type: !219)
!289 = !DILocalVariable(name: "mbs", scope: !281, file: !245, line: 230, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !225, line: 6, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !227, line: 21, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 13, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !292, file: !227, line: 15, baseType: !39, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !292, file: !227, line: 20, baseType: !296, size: 32, offset: 32)
!296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !227, line: 16, size: 32, elements: !297)
!297 = !{!298, !299}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !296, file: !227, line: 18, baseType: !7, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !296, file: !227, line: 19, baseType: !236, size: 32)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !301)
!301 = !{!241, !238}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "slotvec", scope: !244, file: !245, line: 834, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !245, line: 823, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !305, file: !245, line: 825, baseType: !41, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !305, file: !245, line: 826, baseType: !36, size: 64, offset: 64)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "nslots", scope: !244, file: !245, line: 832, type: !39, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "slotvec0", scope: !244, file: !245, line: 833, type: !305, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!315 = !{!316}
!316 = !DISubrange(count: 11)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !319, file: !320, line: 26, type: !322, isLocal: false, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !321, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!321 = !{!317}
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 376, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 47)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "exit_failure", scope: !327, file: !328, line: 24, type: !330, isLocal: false, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !329, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!329 = !{!325}
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "internal_state", scope: !333, file: !334, line: 97, type: !337, isLocal: true, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !335, globals: !336, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!335 = !{!38, !41, !46}
!336 = !{!331}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !225, line: 6, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !227, line: 21, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !227, line: 13, size: 64, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !339, file: !227, line: 15, baseType: !39, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !339, file: !227, line: 20, baseType: !343, size: 32, offset: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !227, line: 16, size: 32, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !343, file: !227, line: 18, baseType: !7, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !343, file: !227, line: 19, baseType: !236, size: 32)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !353, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!353 = !{!354}
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !352, line: 78, baseType: !7, size: 32, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIEnumerator(name: "MODE_DONE", value: 0)
!357 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!358 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!359 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !362, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!362 = !{!363}
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !361, line: 40, baseType: !7, size: 32, elements: !364)
!364 = !{!365}
!365 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!366 = !{!38}
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !400, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!369 = !{!370, !382}
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !371, file: !368, line: 188, baseType: !7, size: 32, elements: !380)
!371 = distinct !DISubprogram(name: "x2nrealloc", scope: !368, file: !368, line: 176, type: !372, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !367, retainedNodes: !375)
!372 = !DISubroutineType(types: !373)
!373 = !{!38, !38, !374, !41}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!375 = !{!376, !377, !378, !379}
!376 = !DILocalVariable(name: "p", arg: 1, scope: !371, file: !368, line: 176, type: !38)
!377 = !DILocalVariable(name: "pn", arg: 2, scope: !371, file: !368, line: 176, type: !374)
!378 = !DILocalVariable(name: "s", arg: 3, scope: !371, file: !368, line: 176, type: !41)
!379 = !DILocalVariable(name: "n", scope: !371, file: !368, line: 178, type: !41)
!380 = !{!381}
!381 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !383, file: !368, line: 228, baseType: !7, size: 32, elements: !380)
!383 = distinct !DISubprogram(name: "xpalloc", scope: !368, file: !368, line: 223, type: !384, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !367, retainedNodes: !390)
!384 = !DISubroutineType(types: !385)
!385 = !{!38, !38, !386, !387, !389, !387}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !388, line: 130, baseType: !389)
!388 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !42, line: 35, baseType: !102)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399}
!391 = !DILocalVariable(name: "pa", arg: 1, scope: !383, file: !368, line: 223, type: !38)
!392 = !DILocalVariable(name: "pn", arg: 2, scope: !383, file: !368, line: 223, type: !386)
!393 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !383, file: !368, line: 223, type: !387)
!394 = !DILocalVariable(name: "n_max", arg: 4, scope: !383, file: !368, line: 223, type: !389)
!395 = !DILocalVariable(name: "s", arg: 5, scope: !383, file: !368, line: 223, type: !387)
!396 = !DILocalVariable(name: "n0", scope: !383, file: !368, line: 230, type: !387)
!397 = !DILocalVariable(name: "n", scope: !383, file: !368, line: 237, type: !387)
!398 = !DILocalVariable(name: "nbytes", scope: !383, file: !368, line: 248, type: !387)
!399 = !DILocalVariable(name: "adjusted_nbytes", scope: !383, file: !368, line: 252, type: !387)
!400 = !{!36, !38, !61, !102, !43}
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !413, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!413 = !{!61, !43, !38}
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !366, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!420 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!421 = !{i32 7, !"Dwarf Version", i32 5}
!422 = !{i32 2, !"Debug Info Version", i32 3}
!423 = !{i32 1, !"wchar_size", i32 4}
!424 = !{i32 1, !"branch-target-enforcement", i32 0}
!425 = !{i32 1, !"sign-return-address", i32 0}
!426 = !{i32 1, !"sign-return-address-all", i32 0}
!427 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!428 = !{i32 7, !"PIC Level", i32 2}
!429 = !{i32 7, !"PIE Level", i32 2}
!430 = !{i32 7, !"uwtable", i32 1}
!431 = !{i32 7, !"frame-pointer", i32 1}
!432 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 46, type: !433, scopeLine: 47, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !39}
!435 = !{!436}
!436 = !DILocalVariable(name: "status", arg: 1, scope: !432, file: !3, line: 46, type: !39)
!437 = !DILocation(line: 0, scope: !432)
!438 = !DILocation(line: 48, column: 14, scope: !439)
!439 = distinct !DILexicalBlock(scope: !432, file: !3, line: 48, column: 7)
!440 = !DILocation(line: 48, column: 7, scope: !432)
!441 = !DILocation(line: 49, column: 5, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 49, column: 5)
!443 = !{!444, !444, i64 0}
!444 = !{!"any pointer", !445, i64 0}
!445 = !{!"omnipotent char", !446, i64 0}
!446 = !{!"Simple C/C++ TBAA"}
!447 = !DILocation(line: 52, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !439, file: !3, line: 51, column: 5)
!449 = !DILocation(line: 53, column: 7, scope: !448)
!450 = !DILocation(line: 736, column: 3, scope: !451, inlinedAt: !453)
!451 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !51, file: !51, line: 734, type: !198, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !452)
!452 = !{}
!453 = distinct !DILocation(line: 57, column: 7, scope: !448)
!454 = !DILocation(line: 59, column: 7, scope: !448)
!455 = !DILocation(line: 63, column: 7, scope: !448)
!456 = !DILocation(line: 67, column: 7, scope: !448)
!457 = !DILocation(line: 72, column: 7, scope: !448)
!458 = !DILocation(line: 73, column: 7, scope: !448)
!459 = !DILocalVariable(name: "program", arg: 1, scope: !460, file: !51, line: 836, type: !44)
!460 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !51, file: !51, line: 836, type: !461, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !44}
!463 = !{!459, !464, !473, !474, !476, !477}
!464 = !DILocalVariable(name: "infomap", scope: !460, file: !51, line: 838, type: !465)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 896, elements: !471)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !460, file: !51, line: 838, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !467, file: !51, line: 838, baseType: !44, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !467, file: !51, line: 838, baseType: !44, size: 64, offset: 64)
!471 = !{!472}
!472 = !DISubrange(count: 7)
!473 = !DILocalVariable(name: "node", scope: !460, file: !51, line: 848, type: !44)
!474 = !DILocalVariable(name: "map_prog", scope: !460, file: !51, line: 849, type: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!476 = !DILocalVariable(name: "lc_messages", scope: !460, file: !51, line: 861, type: !44)
!477 = !DILocalVariable(name: "url_program", scope: !460, file: !51, line: 874, type: !44)
!478 = !DILocation(line: 0, scope: !460, inlinedAt: !479)
!479 = distinct !DILocation(line: 74, column: 7, scope: !448)
!480 = !DILocation(line: 838, column: 3, scope: !460, inlinedAt: !479)
!481 = !DILocation(line: 838, column: 67, scope: !460, inlinedAt: !479)
!482 = !DILocation(line: 849, column: 36, scope: !460, inlinedAt: !479)
!483 = !DILocation(line: 851, column: 3, scope: !460, inlinedAt: !479)
!484 = !DILocalVariable(name: "__s1", arg: 1, scope: !485, file: !486, line: 1359, type: !44)
!485 = distinct !DISubprogram(name: "streq", scope: !486, file: !486, line: 1359, type: !487, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !489)
!486 = !DIFile(filename: "./lib/string.h", directory: "/src")
!487 = !DISubroutineType(types: !488)
!488 = !{!61, !44, !44}
!489 = !{!484, !490}
!490 = !DILocalVariable(name: "__s2", arg: 2, scope: !485, file: !486, line: 1359, type: !44)
!491 = !DILocation(line: 0, scope: !485, inlinedAt: !492)
!492 = distinct !DILocation(line: 851, column: 33, scope: !460, inlinedAt: !479)
!493 = !DILocation(line: 1361, column: 11, scope: !485, inlinedAt: !492)
!494 = !DILocation(line: 1361, column: 10, scope: !485, inlinedAt: !492)
!495 = !DILocation(line: 852, column: 13, scope: !460, inlinedAt: !479)
!496 = !DILocation(line: 851, column: 20, scope: !460, inlinedAt: !479)
!497 = !{!498, !444, i64 0}
!498 = !{!"infomap", !444, i64 0, !444, i64 8}
!499 = !DILocation(line: 851, column: 10, scope: !460, inlinedAt: !479)
!500 = !DILocation(line: 851, column: 28, scope: !460, inlinedAt: !479)
!501 = distinct !{!501, !483, !495, !502}
!502 = !{!"llvm.loop.mustprogress"}
!503 = !DILocation(line: 854, column: 17, scope: !504, inlinedAt: !479)
!504 = distinct !DILexicalBlock(scope: !460, file: !51, line: 854, column: 7)
!505 = !{!498, !444, i64 8}
!506 = !DILocation(line: 854, column: 7, scope: !504, inlinedAt: !479)
!507 = !DILocation(line: 854, column: 7, scope: !460, inlinedAt: !479)
!508 = !DILocation(line: 857, column: 3, scope: !460, inlinedAt: !479)
!509 = !DILocation(line: 861, column: 29, scope: !460, inlinedAt: !479)
!510 = !DILocation(line: 862, column: 7, scope: !511, inlinedAt: !479)
!511 = distinct !DILexicalBlock(scope: !460, file: !51, line: 862, column: 7)
!512 = !DILocation(line: 862, column: 19, scope: !511, inlinedAt: !479)
!513 = !DILocation(line: 862, column: 22, scope: !511, inlinedAt: !479)
!514 = !DILocation(line: 862, column: 7, scope: !460, inlinedAt: !479)
!515 = !DILocation(line: 868, column: 7, scope: !516, inlinedAt: !479)
!516 = distinct !DILexicalBlock(scope: !511, file: !51, line: 863, column: 5)
!517 = !DILocation(line: 870, column: 5, scope: !516, inlinedAt: !479)
!518 = !DILocation(line: 0, scope: !485, inlinedAt: !519)
!519 = distinct !DILocation(line: 874, column: 29, scope: !460, inlinedAt: !479)
!520 = !DILocation(line: 875, column: 3, scope: !460, inlinedAt: !479)
!521 = !DILocation(line: 877, column: 3, scope: !460, inlinedAt: !479)
!522 = !DILocation(line: 879, column: 1, scope: !460, inlinedAt: !479)
!523 = !DILocation(line: 76, column: 3, scope: !432)
!524 = !DISubprogram(name: "dcgettext", scope: !525, file: !525, line: 51, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!525 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!526 = !DISubroutineType(types: !527)
!527 = !{!36, !44, !44, !39}
!528 = !DISubprogram(name: "fputs_unlocked", scope: !171, file: !171, line: 691, type: !529, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!529 = !DISubroutineType(types: !530)
!530 = !{!39, !531, !532}
!531 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !44)
!532 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !74)
!533 = !DILocation(line: 0, scope: !50)
!534 = !DILocation(line: 581, column: 7, scope: !59)
!535 = !{!536, !536, i64 0}
!536 = !{!"int", !445, i64 0}
!537 = !DILocation(line: 581, column: 19, scope: !59)
!538 = !DILocation(line: 581, column: 7, scope: !50)
!539 = !DILocation(line: 585, column: 26, scope: !58)
!540 = !DILocation(line: 0, scope: !58)
!541 = !DILocation(line: 586, column: 23, scope: !58)
!542 = !DILocation(line: 586, column: 28, scope: !58)
!543 = !DILocation(line: 586, column: 32, scope: !58)
!544 = !{!445, !445, i64 0}
!545 = !DILocation(line: 586, column: 38, scope: !58)
!546 = !DILocation(line: 0, scope: !485, inlinedAt: !547)
!547 = distinct !DILocation(line: 586, column: 41, scope: !58)
!548 = !DILocation(line: 1361, column: 11, scope: !485, inlinedAt: !547)
!549 = !DILocation(line: 1361, column: 10, scope: !485, inlinedAt: !547)
!550 = !DILocation(line: 586, column: 19, scope: !58)
!551 = !DILocation(line: 587, column: 5, scope: !58)
!552 = !DILocation(line: 588, column: 7, scope: !553)
!553 = distinct !DILexicalBlock(scope: !50, file: !51, line: 588, column: 7)
!554 = !DILocation(line: 588, column: 7, scope: !50)
!555 = !DILocation(line: 590, column: 7, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !51, line: 589, column: 5)
!557 = !DILocation(line: 591, column: 7, scope: !556)
!558 = !DILocation(line: 595, column: 37, scope: !50)
!559 = !DILocation(line: 595, column: 35, scope: !50)
!560 = !DILocation(line: 596, column: 29, scope: !50)
!561 = !DILocation(line: 597, column: 8, scope: !67)
!562 = !DILocation(line: 597, column: 7, scope: !50)
!563 = !DILocation(line: 604, column: 24, scope: !66)
!564 = !DILocation(line: 604, column: 12, scope: !67)
!565 = !DILocation(line: 0, scope: !65)
!566 = !DILocation(line: 610, column: 16, scope: !65)
!567 = !DILocation(line: 610, column: 7, scope: !65)
!568 = !DILocation(line: 611, column: 21, scope: !65)
!569 = !{!570, !570, i64 0}
!570 = !{!"short", !445, i64 0}
!571 = !DILocation(line: 611, column: 19, scope: !65)
!572 = !DILocation(line: 611, column: 16, scope: !65)
!573 = !DILocation(line: 610, column: 30, scope: !65)
!574 = distinct !{!574, !567, !568, !502}
!575 = !DILocation(line: 612, column: 18, scope: !576)
!576 = distinct !DILexicalBlock(scope: !65, file: !51, line: 612, column: 11)
!577 = !DILocation(line: 612, column: 11, scope: !65)
!578 = !DILocation(line: 620, column: 23, scope: !50)
!579 = !DILocation(line: 625, column: 39, scope: !50)
!580 = !DILocation(line: 626, column: 3, scope: !50)
!581 = !DILocation(line: 626, column: 10, scope: !50)
!582 = !DILocation(line: 626, column: 21, scope: !50)
!583 = !DILocation(line: 628, column: 44, scope: !584)
!584 = distinct !DILexicalBlock(scope: !585, file: !51, line: 628, column: 11)
!585 = distinct !DILexicalBlock(scope: !50, file: !51, line: 627, column: 5)
!586 = !DILocation(line: 628, column: 32, scope: !584)
!587 = !DILocation(line: 628, column: 49, scope: !584)
!588 = !DILocation(line: 628, column: 11, scope: !585)
!589 = !DILocation(line: 630, column: 11, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !51, line: 630, column: 11)
!591 = !DILocation(line: 630, column: 11, scope: !585)
!592 = !DILocation(line: 632, column: 26, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !51, line: 632, column: 15)
!594 = distinct !DILexicalBlock(scope: !590, file: !51, line: 631, column: 9)
!595 = !DILocation(line: 632, column: 34, scope: !593)
!596 = !DILocation(line: 632, column: 37, scope: !593)
!597 = !DILocation(line: 632, column: 15, scope: !594)
!598 = !DILocation(line: 636, column: 29, scope: !599)
!599 = distinct !DILexicalBlock(scope: !594, file: !51, line: 636, column: 15)
!600 = !DILocation(line: 640, column: 16, scope: !585)
!601 = distinct !{!601, !580, !602, !502}
!602 = !DILocation(line: 641, column: 5, scope: !50)
!603 = !DILocation(line: 644, column: 3, scope: !50)
!604 = !DILocation(line: 0, scope: !485, inlinedAt: !605)
!605 = distinct !DILocation(line: 648, column: 31, scope: !50)
!606 = !DILocation(line: 0, scope: !485, inlinedAt: !607)
!607 = distinct !DILocation(line: 649, column: 31, scope: !50)
!608 = !DILocation(line: 0, scope: !485, inlinedAt: !609)
!609 = distinct !DILocation(line: 650, column: 31, scope: !50)
!610 = !DILocation(line: 0, scope: !485, inlinedAt: !611)
!611 = distinct !DILocation(line: 651, column: 31, scope: !50)
!612 = !DILocation(line: 0, scope: !485, inlinedAt: !613)
!613 = distinct !DILocation(line: 652, column: 31, scope: !50)
!614 = !DILocation(line: 0, scope: !485, inlinedAt: !615)
!615 = distinct !DILocation(line: 653, column: 31, scope: !50)
!616 = !DILocation(line: 0, scope: !485, inlinedAt: !617)
!617 = distinct !DILocation(line: 654, column: 31, scope: !50)
!618 = !DILocation(line: 0, scope: !485, inlinedAt: !619)
!619 = distinct !DILocation(line: 655, column: 31, scope: !50)
!620 = !DILocation(line: 0, scope: !485, inlinedAt: !621)
!621 = distinct !DILocation(line: 656, column: 31, scope: !50)
!622 = !DILocation(line: 0, scope: !485, inlinedAt: !623)
!623 = distinct !DILocation(line: 657, column: 31, scope: !50)
!624 = !DILocation(line: 663, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !50, file: !51, line: 663, column: 7)
!626 = !DILocation(line: 664, column: 7, scope: !625)
!627 = !DILocation(line: 664, column: 10, scope: !625)
!628 = !DILocation(line: 663, column: 7, scope: !50)
!629 = !DILocation(line: 669, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !625, file: !51, line: 665, column: 5)
!631 = !DILocation(line: 671, column: 5, scope: !630)
!632 = !DILocation(line: 676, column: 7, scope: !633)
!633 = distinct !DILexicalBlock(scope: !625, file: !51, line: 673, column: 5)
!634 = !DILocation(line: 679, column: 3, scope: !50)
!635 = !DILocation(line: 683, column: 3, scope: !50)
!636 = !DILocation(line: 686, column: 3, scope: !50)
!637 = !DILocation(line: 688, column: 3, scope: !50)
!638 = !DILocation(line: 691, column: 3, scope: !50)
!639 = !DILocation(line: 695, column: 3, scope: !50)
!640 = !DILocation(line: 696, column: 1, scope: !50)
!641 = !DISubprogram(name: "setlocale", scope: !642, file: !642, line: 122, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!642 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!643 = !DISubroutineType(types: !644)
!644 = !{!36, !39, !44}
!645 = !DISubprogram(name: "getenv", scope: !646, file: !646, line: 641, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!646 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!647 = !DISubroutineType(types: !648)
!648 = !{!36, !44}
!649 = !DISubprogram(name: "fwrite_unlocked", scope: !171, file: !171, line: 704, type: !650, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!650 = !DISubroutineType(types: !651)
!651 = !{!41, !652, !41, !41, !532}
!652 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!655 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 80, type: !656, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !659)
!656 = !DISubroutineType(types: !657)
!657 = !{!39, !39, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!659 = !{!660, !661, !662, !663, !664, !668, !669, !672, !676, !682, !683}
!660 = !DILocalVariable(name: "argc", arg: 1, scope: !655, file: !3, line: 80, type: !39)
!661 = !DILocalVariable(name: "argv", arg: 2, scope: !655, file: !3, line: 80, type: !658)
!662 = !DILocalVariable(name: "specified_mode", scope: !655, file: !3, line: 82, type: !44)
!663 = !DILocalVariable(name: "scontext", scope: !655, file: !3, line: 83, type: !44)
!664 = !DILocalVariable(name: "set_security_context", scope: !655, file: !3, line: 84, type: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !667, line: 53, flags: DIFlagFwdDecl)
!667 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!668 = !DILocalVariable(name: "optc", scope: !655, file: !3, line: 94, type: !39)
!669 = !DILocalVariable(name: "ret", scope: !670, file: !3, line: 142, type: !39)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 141, column: 5)
!671 = distinct !DILexicalBlock(scope: !655, file: !3, line: 140, column: 7)
!672 = !DILocalVariable(name: "newmode", scope: !655, file: !3, line: 154, type: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !674, line: 69, baseType: !675)
!674 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !101, line: 150, baseType: !7)
!676 = !DILocalVariable(name: "change", scope: !677, file: !3, line: 157, type: !679)
!677 = distinct !DILexicalBlock(scope: !678, file: !3, line: 156, column: 5)
!678 = distinct !DILexicalBlock(scope: !655, file: !3, line: 155, column: 7)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !681, line: 35, flags: DIFlagFwdDecl)
!681 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!682 = !DILocalVariable(name: "umask_value", scope: !677, file: !3, line: 160, type: !673)
!683 = !DILocalVariable(name: "exit_status", scope: !655, file: !3, line: 169, type: !39)
!684 = !DILocation(line: 0, scope: !655)
!685 = !DILocation(line: 87, column: 21, scope: !655)
!686 = !DILocation(line: 87, column: 3, scope: !655)
!687 = !DILocation(line: 88, column: 3, scope: !655)
!688 = !DILocation(line: 89, column: 3, scope: !655)
!689 = !DILocation(line: 90, column: 3, scope: !655)
!690 = !DILocation(line: 92, column: 3, scope: !655)
!691 = !DILocation(line: 95, column: 3, scope: !655)
!692 = !DILocation(line: 95, column: 18, scope: !655)
!693 = !DILocation(line: 100, column: 28, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 98, column: 9)
!695 = distinct !DILexicalBlock(scope: !655, file: !3, line: 96, column: 5)
!696 = !DILocation(line: 101, column: 11, scope: !694)
!697 = distinct !{!697, !691, !698, !502}
!698 = !DILocation(line: 132, column: 5, scope: !655)
!699 = !DILocation(line: 120, column: 20, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 120, column: 20)
!701 = distinct !DILexicalBlock(scope: !702, file: !3, line: 108, column: 20)
!702 = distinct !DILexicalBlock(scope: !694, file: !3, line: 103, column: 15)
!703 = !DILocation(line: 120, column: 20, scope: !701)
!704 = !DILocation(line: 122, column: 15, scope: !705)
!705 = distinct !DILexicalBlock(scope: !700, file: !3, line: 121, column: 13)
!706 = !DILocation(line: 125, column: 13, scope: !705)
!707 = !DILocation(line: 127, column: 9, scope: !694)
!708 = !DILocation(line: 128, column: 9, scope: !694)
!709 = !DILocation(line: 130, column: 11, scope: !694)
!710 = !DILocation(line: 134, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !655, file: !3, line: 134, column: 7)
!712 = !DILocation(line: 134, column: 14, scope: !711)
!713 = !DILocation(line: 134, column: 7, scope: !655)
!714 = !DILocation(line: 136, column: 7, scope: !715)
!715 = distinct !DILexicalBlock(scope: !711, file: !3, line: 135, column: 5)
!716 = !DILocation(line: 137, column: 7, scope: !715)
!717 = !DILocation(line: 155, column: 7, scope: !678)
!718 = !DILocation(line: 155, column: 7, scope: !655)
!719 = !DILocation(line: 157, column: 36, scope: !677)
!720 = !DILocation(line: 0, scope: !677)
!721 = !DILocation(line: 158, column: 12, scope: !722)
!722 = distinct !DILexicalBlock(scope: !677, file: !3, line: 158, column: 11)
!723 = !DILocation(line: 158, column: 11, scope: !677)
!724 = !DILocation(line: 159, column: 9, scope: !722)
!725 = !DILocation(line: 160, column: 28, scope: !677)
!726 = !DILocation(line: 161, column: 7, scope: !677)
!727 = !DILocation(line: 162, column: 17, scope: !677)
!728 = !DILocation(line: 163, column: 13, scope: !677)
!729 = !DILocation(line: 163, column: 7, scope: !677)
!730 = !DILocation(line: 164, column: 19, scope: !731)
!731 = distinct !DILexicalBlock(scope: !677, file: !3, line: 164, column: 11)
!732 = !DILocation(line: 164, column: 11, scope: !677)
!733 = !DILocation(line: 170, column: 10, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 170, column: 3)
!735 = distinct !DILexicalBlock(scope: !655, file: !3, line: 170, column: 3)
!736 = !DILocation(line: 165, column: 9, scope: !731)
!737 = !DILocation(line: 170, column: 17, scope: !734)
!738 = !DILocation(line: 170, column: 3, scope: !735)
!739 = !DILocation(line: 174, column: 19, scope: !740)
!740 = distinct !DILexicalBlock(scope: !741, file: !3, line: 174, column: 11)
!741 = distinct !DILexicalBlock(scope: !734, file: !3, line: 171, column: 5)
!742 = !DILocation(line: 174, column: 11, scope: !740)
!743 = !DILocation(line: 174, column: 42, scope: !740)
!744 = !DILocation(line: 174, column: 11, scope: !741)
!745 = !DILocation(line: 179, column: 31, scope: !746)
!746 = distinct !DILexicalBlock(scope: !740, file: !3, line: 179, column: 16)
!747 = !DILocation(line: 179, column: 47, scope: !746)
!748 = !DILocation(line: 179, column: 42, scope: !746)
!749 = !DILocation(line: 179, column: 34, scope: !746)
!750 = !DILocation(line: 179, column: 65, scope: !746)
!751 = !DILocation(line: 179, column: 16, scope: !740)
!752 = !DILocation(line: 0, scope: !740)
!753 = !DILocation(line: 170, column: 25, scope: !734)
!754 = distinct !{!754, !738, !755, !502}
!755 = !DILocation(line: 185, column: 5, scope: !735)
!756 = !DILocation(line: 187, column: 3, scope: !655)
!757 = !DISubprogram(name: "bindtextdomain", scope: !525, file: !525, line: 86, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!758 = !DISubroutineType(types: !759)
!759 = !{!36, !44, !44}
!760 = !DISubprogram(name: "textdomain", scope: !525, file: !525, line: 82, type: !647, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!761 = !DISubprogram(name: "atexit", scope: !646, file: !646, line: 602, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!762 = !DISubroutineType(types: !763)
!763 = !{!39, !197}
!764 = !DISubprogram(name: "getopt_long", scope: !138, file: !138, line: 66, type: !765, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!765 = !DISubroutineType(types: !766)
!766 = !{!39, !39, !767, !44, !769, !143}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!770 = !DISubprogram(name: "umask", scope: !771, file: !771, line: 380, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!771 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!772 = !DISubroutineType(types: !773)
!773 = !{!675, !675}
!774 = !DISubprogram(name: "mkfifo", scope: !771, file: !771, line: 418, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!775 = !DISubroutineType(types: !776)
!776 = !{!39, !44, !675}
!777 = !DISubprogram(name: "lchmod", scope: !771, file: !771, line: 359, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!778 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !155, file: !155, line: 50, type: !461, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !779)
!779 = !{!780}
!780 = !DILocalVariable(name: "file", arg: 1, scope: !778, file: !155, line: 50, type: !44)
!781 = !DILocation(line: 0, scope: !778)
!782 = !DILocation(line: 52, column: 13, scope: !778)
!783 = !DILocation(line: 53, column: 1, scope: !778)
!784 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !155, file: !155, line: 87, type: !785, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !787)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !61}
!787 = !{!788}
!788 = !DILocalVariable(name: "ignore", arg: 1, scope: !784, file: !155, line: 87, type: !61)
!789 = !DILocation(line: 0, scope: !784)
!790 = !DILocation(line: 89, column: 16, scope: !784)
!791 = !{!792, !792, i64 0}
!792 = !{!"_Bool", !445, i64 0}
!793 = !DILocation(line: 90, column: 1, scope: !784)
!794 = distinct !DISubprogram(name: "close_stdout", scope: !155, file: !155, line: 116, type: !198, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !795)
!795 = !{!796}
!796 = !DILocalVariable(name: "write_error", scope: !797, file: !155, line: 121, type: !44)
!797 = distinct !DILexicalBlock(scope: !798, file: !155, line: 120, column: 5)
!798 = distinct !DILexicalBlock(scope: !794, file: !155, line: 118, column: 7)
!799 = !DILocation(line: 118, column: 21, scope: !798)
!800 = !DILocation(line: 118, column: 7, scope: !798)
!801 = !DILocation(line: 118, column: 29, scope: !798)
!802 = !DILocation(line: 119, column: 7, scope: !798)
!803 = !DILocation(line: 119, column: 12, scope: !798)
!804 = !{i8 0, i8 2}
!805 = !DILocation(line: 119, column: 25, scope: !798)
!806 = !DILocation(line: 119, column: 28, scope: !798)
!807 = !DILocation(line: 119, column: 34, scope: !798)
!808 = !DILocation(line: 118, column: 7, scope: !794)
!809 = !DILocation(line: 121, column: 33, scope: !797)
!810 = !DILocation(line: 0, scope: !797)
!811 = !DILocation(line: 122, column: 11, scope: !812)
!812 = distinct !DILexicalBlock(scope: !797, file: !155, line: 122, column: 11)
!813 = !DILocation(line: 0, scope: !812)
!814 = !DILocation(line: 122, column: 11, scope: !797)
!815 = !DILocation(line: 123, column: 9, scope: !812)
!816 = !DILocation(line: 126, column: 9, scope: !812)
!817 = !DILocation(line: 128, column: 14, scope: !797)
!818 = !DILocation(line: 128, column: 7, scope: !797)
!819 = !DILocation(line: 133, column: 42, scope: !820)
!820 = distinct !DILexicalBlock(scope: !794, file: !155, line: 133, column: 7)
!821 = !DILocation(line: 133, column: 28, scope: !820)
!822 = !DILocation(line: 133, column: 50, scope: !820)
!823 = !DILocation(line: 133, column: 7, scope: !794)
!824 = !DILocation(line: 134, column: 12, scope: !820)
!825 = !DILocation(line: 134, column: 5, scope: !820)
!826 = !DILocation(line: 135, column: 1, scope: !794)
!827 = distinct !DISubprogram(name: "verror", scope: !162, file: !162, line: 251, type: !828, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !39, !39, !44, !170}
!830 = !{!831, !832, !833, !834}
!831 = !DILocalVariable(name: "status", arg: 1, scope: !827, file: !162, line: 251, type: !39)
!832 = !DILocalVariable(name: "errnum", arg: 2, scope: !827, file: !162, line: 251, type: !39)
!833 = !DILocalVariable(name: "message", arg: 3, scope: !827, file: !162, line: 251, type: !44)
!834 = !DILocalVariable(name: "args", arg: 4, scope: !827, file: !162, line: 251, type: !170)
!835 = !DILocation(line: 0, scope: !827)
!836 = !DILocation(line: 251, column: 1, scope: !827)
!837 = !DILocation(line: 261, column: 3, scope: !827)
!838 = !DILocation(line: 265, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !827, file: !162, line: 265, column: 7)
!840 = !DILocation(line: 265, column: 7, scope: !827)
!841 = !DILocation(line: 266, column: 5, scope: !839)
!842 = !DILocation(line: 272, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !839, file: !162, line: 268, column: 5)
!844 = !DILocation(line: 276, column: 3, scope: !827)
!845 = !{i64 0, i64 8, !443, i64 8, i64 8, !443, i64 16, i64 8, !443, i64 24, i64 4, !535, i64 28, i64 4, !535}
!846 = !DILocation(line: 282, column: 1, scope: !827)
!847 = distinct !DISubprogram(name: "flush_stdout", scope: !162, file: !162, line: 163, type: !198, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !848)
!848 = !{!849}
!849 = !DILocalVariable(name: "stdout_fd", scope: !847, file: !162, line: 166, type: !39)
!850 = !DILocation(line: 0, scope: !847)
!851 = !DILocalVariable(name: "fd", arg: 1, scope: !852, file: !162, line: 145, type: !39)
!852 = distinct !DISubprogram(name: "is_open", scope: !162, file: !162, line: 145, type: !853, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !855)
!853 = !DISubroutineType(types: !854)
!854 = !{!39, !39}
!855 = !{!851}
!856 = !DILocation(line: 0, scope: !852, inlinedAt: !857)
!857 = distinct !DILocation(line: 182, column: 25, scope: !858)
!858 = distinct !DILexicalBlock(scope: !847, file: !162, line: 182, column: 7)
!859 = !DILocation(line: 157, column: 15, scope: !852, inlinedAt: !857)
!860 = !DILocation(line: 182, column: 25, scope: !858)
!861 = !DILocation(line: 182, column: 7, scope: !847)
!862 = !DILocation(line: 184, column: 5, scope: !858)
!863 = !DILocation(line: 185, column: 1, scope: !847)
!864 = distinct !DISubprogram(name: "error_tail", scope: !162, file: !162, line: 219, type: !828, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DILocalVariable(name: "status", arg: 1, scope: !864, file: !162, line: 219, type: !39)
!867 = !DILocalVariable(name: "errnum", arg: 2, scope: !864, file: !162, line: 219, type: !39)
!868 = !DILocalVariable(name: "message", arg: 3, scope: !864, file: !162, line: 219, type: !44)
!869 = !DILocalVariable(name: "args", arg: 4, scope: !864, file: !162, line: 219, type: !170)
!870 = !DILocation(line: 0, scope: !864)
!871 = !DILocation(line: 219, column: 1, scope: !864)
!872 = !DILocation(line: 229, column: 13, scope: !864)
!873 = !DILocation(line: 229, column: 3, scope: !864)
!874 = !DILocalVariable(name: "__stream", arg: 1, scope: !875, file: !876, line: 132, type: !879)
!875 = distinct !DISubprogram(name: "vfprintf", scope: !876, file: !876, line: 132, type: !877, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !914)
!876 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!877 = !DISubroutineType(types: !878)
!878 = !{!39, !879, !531, !172}
!879 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !76, line: 7, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !78, line: 49, size: 1728, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !882, file: !78, line: 51, baseType: !39, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !882, file: !78, line: 54, baseType: !36, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !882, file: !78, line: 55, baseType: !36, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !882, file: !78, line: 56, baseType: !36, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !882, file: !78, line: 57, baseType: !36, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !882, file: !78, line: 58, baseType: !36, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !882, file: !78, line: 59, baseType: !36, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !882, file: !78, line: 60, baseType: !36, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !882, file: !78, line: 61, baseType: !36, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !882, file: !78, line: 64, baseType: !36, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !882, file: !78, line: 65, baseType: !36, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !882, file: !78, line: 66, baseType: !36, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !882, file: !78, line: 68, baseType: !93, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !882, file: !78, line: 70, baseType: !898, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !882, file: !78, line: 72, baseType: !39, size: 32, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !882, file: !78, line: 73, baseType: !39, size: 32, offset: 928)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !882, file: !78, line: 74, baseType: !100, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !882, file: !78, line: 77, baseType: !40, size: 16, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !882, file: !78, line: 78, baseType: !105, size: 8, offset: 1040)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !882, file: !78, line: 79, baseType: !107, size: 8, offset: 1048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !882, file: !78, line: 81, baseType: !111, size: 64, offset: 1088)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !882, file: !78, line: 89, baseType: !114, size: 64, offset: 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !882, file: !78, line: 91, baseType: !116, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !882, file: !78, line: 92, baseType: !119, size: 64, offset: 1280)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !882, file: !78, line: 93, baseType: !898, size: 64, offset: 1344)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !882, file: !78, line: 94, baseType: !38, size: 64, offset: 1408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !882, file: !78, line: 95, baseType: !41, size: 64, offset: 1472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !882, file: !78, line: 96, baseType: !39, size: 32, offset: 1536)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !882, file: !78, line: 98, baseType: !126, size: 160, offset: 1568)
!914 = !{!874, !915, !916}
!915 = !DILocalVariable(name: "__fmt", arg: 2, scope: !875, file: !876, line: 133, type: !531)
!916 = !DILocalVariable(name: "__ap", arg: 3, scope: !875, file: !876, line: 133, type: !172)
!917 = !DILocation(line: 0, scope: !875, inlinedAt: !918)
!918 = distinct !DILocation(line: 229, column: 3, scope: !864)
!919 = !DILocation(line: 135, column: 10, scope: !875, inlinedAt: !918)
!920 = !{!921, !923}
!921 = distinct !{!921, !922, !"vfprintf.inline: argument 0"}
!922 = distinct !{!922, !"vfprintf.inline"}
!923 = distinct !{!923, !922, !"vfprintf.inline: argument 1"}
!924 = !DILocation(line: 232, column: 3, scope: !864)
!925 = !DILocation(line: 233, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !864, file: !162, line: 233, column: 7)
!927 = !DILocation(line: 233, column: 7, scope: !864)
!928 = !DILocalVariable(name: "errnum", arg: 1, scope: !929, file: !162, line: 188, type: !39)
!929 = distinct !DISubprogram(name: "print_errno_message", scope: !162, file: !162, line: 188, type: !433, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !930)
!930 = !{!928, !931, !932}
!931 = !DILocalVariable(name: "s", scope: !929, file: !162, line: 190, type: !44)
!932 = !DILocalVariable(name: "errbuf", scope: !929, file: !162, line: 193, type: !933)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 1024)
!936 = !DILocation(line: 0, scope: !929, inlinedAt: !937)
!937 = distinct !DILocation(line: 234, column: 5, scope: !926)
!938 = !DILocation(line: 193, column: 3, scope: !929, inlinedAt: !937)
!939 = !DILocation(line: 193, column: 8, scope: !929, inlinedAt: !937)
!940 = !DILocation(line: 195, column: 7, scope: !929, inlinedAt: !937)
!941 = !DILocation(line: 207, column: 9, scope: !942, inlinedAt: !937)
!942 = distinct !DILexicalBlock(scope: !929, file: !162, line: 207, column: 7)
!943 = !DILocation(line: 207, column: 7, scope: !929, inlinedAt: !937)
!944 = !DILocation(line: 208, column: 9, scope: !942, inlinedAt: !937)
!945 = !DILocation(line: 208, column: 5, scope: !942, inlinedAt: !937)
!946 = !DILocation(line: 214, column: 3, scope: !929, inlinedAt: !937)
!947 = !DILocation(line: 216, column: 1, scope: !929, inlinedAt: !937)
!948 = !DILocation(line: 234, column: 5, scope: !926)
!949 = !DILocation(line: 238, column: 3, scope: !864)
!950 = !DILocalVariable(name: "__c", arg: 1, scope: !951, file: !952, line: 101, type: !39)
!951 = distinct !DISubprogram(name: "putc_unlocked", scope: !952, file: !952, line: 101, type: !953, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !955)
!952 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!953 = !DISubroutineType(types: !954)
!954 = !{!39, !39, !880}
!955 = !{!950, !956}
!956 = !DILocalVariable(name: "__stream", arg: 2, scope: !951, file: !952, line: 101, type: !880)
!957 = !DILocation(line: 0, scope: !951, inlinedAt: !958)
!958 = distinct !DILocation(line: 238, column: 3, scope: !864)
!959 = !DILocation(line: 103, column: 10, scope: !951, inlinedAt: !958)
!960 = !{!961, !444, i64 40}
!961 = !{!"_IO_FILE", !536, i64 0, !444, i64 8, !444, i64 16, !444, i64 24, !444, i64 32, !444, i64 40, !444, i64 48, !444, i64 56, !444, i64 64, !444, i64 72, !444, i64 80, !444, i64 88, !444, i64 96, !444, i64 104, !536, i64 112, !536, i64 116, !962, i64 120, !570, i64 128, !445, i64 130, !445, i64 131, !444, i64 136, !962, i64 144, !444, i64 152, !444, i64 160, !444, i64 168, !444, i64 176, !962, i64 184, !536, i64 192, !445, i64 196}
!962 = !{!"long", !445, i64 0}
!963 = !{!961, !444, i64 48}
!964 = !{!"branch_weights", i32 2000, i32 1}
!965 = !DILocation(line: 240, column: 3, scope: !864)
!966 = !DILocation(line: 241, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !864, file: !162, line: 241, column: 7)
!968 = !DILocation(line: 241, column: 7, scope: !864)
!969 = !DILocation(line: 242, column: 5, scope: !967)
!970 = !DILocation(line: 243, column: 1, scope: !864)
!971 = !DISubprogram(name: "strerror_r", scope: !972, file: !972, line: 444, type: !973, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!972 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!973 = !DISubroutineType(types: !974)
!974 = !{!36, !39, !36, !41}
!975 = !DISubprogram(name: "fflush_unlocked", scope: !171, file: !171, line: 239, type: !976, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!976 = !DISubroutineType(types: !977)
!977 = !{!39, !880}
!978 = !DISubprogram(name: "fcntl", scope: !979, file: !979, line: 149, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !452)
!979 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!980 = !DISubroutineType(types: !981)
!981 = !{!39, !39, !39, null}
!982 = distinct !DISubprogram(name: "error", scope: !162, file: !162, line: 285, type: !983, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !985)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !39, !39, !44, null}
!985 = !{!986, !987, !988, !989}
!986 = !DILocalVariable(name: "status", arg: 1, scope: !982, file: !162, line: 285, type: !39)
!987 = !DILocalVariable(name: "errnum", arg: 2, scope: !982, file: !162, line: 285, type: !39)
!988 = !DILocalVariable(name: "message", arg: 3, scope: !982, file: !162, line: 285, type: !44)
!989 = !DILocalVariable(name: "ap", scope: !982, file: !162, line: 287, type: !170)
!990 = !DILocation(line: 0, scope: !982)
!991 = !DILocation(line: 287, column: 3, scope: !982)
!992 = !DILocation(line: 287, column: 11, scope: !982)
!993 = !DILocation(line: 288, column: 3, scope: !982)
!994 = !DILocation(line: 289, column: 3, scope: !982)
!995 = !DILocation(line: 290, column: 3, scope: !982)
!996 = !DILocation(line: 291, column: 1, scope: !982)
!997 = !DILocation(line: 0, scope: !167)
!998 = !DILocation(line: 298, column: 1, scope: !167)
!999 = !DILocation(line: 302, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !167, file: !162, line: 302, column: 7)
!1001 = !DILocation(line: 302, column: 7, scope: !167)
!1002 = !DILocation(line: 307, column: 11, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !162, line: 307, column: 11)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !162, line: 303, column: 5)
!1005 = !DILocation(line: 307, column: 27, scope: !1003)
!1006 = !DILocation(line: 308, column: 11, scope: !1003)
!1007 = !DILocation(line: 308, column: 28, scope: !1003)
!1008 = !DILocation(line: 308, column: 25, scope: !1003)
!1009 = !DILocation(line: 309, column: 15, scope: !1003)
!1010 = !DILocation(line: 309, column: 33, scope: !1003)
!1011 = !DILocation(line: 310, column: 19, scope: !1003)
!1012 = !DILocation(line: 311, column: 22, scope: !1003)
!1013 = !DILocation(line: 311, column: 56, scope: !1003)
!1014 = !DILocation(line: 307, column: 11, scope: !1004)
!1015 = !DILocation(line: 316, column: 21, scope: !1004)
!1016 = !DILocation(line: 317, column: 23, scope: !1004)
!1017 = !DILocation(line: 318, column: 5, scope: !1004)
!1018 = !DILocation(line: 327, column: 3, scope: !167)
!1019 = !DILocation(line: 331, column: 7, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !167, file: !162, line: 331, column: 7)
!1021 = !DILocation(line: 331, column: 7, scope: !167)
!1022 = !DILocation(line: 332, column: 5, scope: !1020)
!1023 = !DILocation(line: 338, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1020, file: !162, line: 334, column: 5)
!1025 = !DILocation(line: 346, column: 3, scope: !167)
!1026 = !DILocation(line: 350, column: 3, scope: !167)
!1027 = !DILocation(line: 356, column: 1, scope: !167)
!1028 = distinct !DISubprogram(name: "error_at_line", scope: !162, file: !162, line: 359, type: !1029, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !39, !39, !44, !7, !44, null}
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037}
!1032 = !DILocalVariable(name: "status", arg: 1, scope: !1028, file: !162, line: 359, type: !39)
!1033 = !DILocalVariable(name: "errnum", arg: 2, scope: !1028, file: !162, line: 359, type: !39)
!1034 = !DILocalVariable(name: "file_name", arg: 3, scope: !1028, file: !162, line: 359, type: !44)
!1035 = !DILocalVariable(name: "line_number", arg: 4, scope: !1028, file: !162, line: 360, type: !7)
!1036 = !DILocalVariable(name: "message", arg: 5, scope: !1028, file: !162, line: 360, type: !44)
!1037 = !DILocalVariable(name: "ap", scope: !1028, file: !162, line: 362, type: !170)
!1038 = !DILocation(line: 0, scope: !1028)
!1039 = !DILocation(line: 362, column: 3, scope: !1028)
!1040 = !DILocation(line: 362, column: 11, scope: !1028)
!1041 = !DILocation(line: 363, column: 3, scope: !1028)
!1042 = !DILocation(line: 364, column: 3, scope: !1028)
!1043 = !DILocation(line: 366, column: 3, scope: !1028)
!1044 = !DILocation(line: 367, column: 1, scope: !1028)
!1045 = distinct !DISubprogram(name: "getprogname", scope: !350, file: !350, line: 54, type: !1046, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !452)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!44}
!1048 = !DILocation(line: 58, column: 10, scope: !1045)
!1049 = !DILocation(line: 58, column: 3, scope: !1045)
!1050 = distinct !DISubprogram(name: "mode_compile", scope: !352, file: !352, line: 134, type: !1051, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !1061)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !44}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !352, line: 98, size: 128, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1054, file: !352, line: 100, baseType: !37, size: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1054, file: !352, line: 101, baseType: !37, size: 8, offset: 8)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "affected", scope: !1054, file: !352, line: 102, baseType: !673, size: 32, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1054, file: !352, line: 103, baseType: !673, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "mentioned", scope: !1054, file: !352, line: 104, baseType: !673, size: 32, offset: 96)
!1061 = !{!1062, !1063, !1066, !1067, !1068, !1069, !1070, !1072, !1074, !1075, !1076, !1080, !1082, !1083, !1084, !1085, !1088, !1089, !1090, !1091}
!1062 = !DILocalVariable(name: "mode_string", arg: 1, scope: !1050, file: !352, line: 134, type: !44)
!1063 = !DILocalVariable(name: "p", scope: !1064, file: !352, line: 138, type: !44)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !352, line: 137, column: 5)
!1065 = distinct !DILexicalBlock(scope: !1050, file: !352, line: 136, column: 7)
!1066 = !DILocalVariable(name: "octal_mode", scope: !1064, file: !352, line: 139, type: !7)
!1067 = !DILocalVariable(name: "mode", scope: !1064, file: !352, line: 140, type: !673)
!1068 = !DILocalVariable(name: "mentioned", scope: !1064, file: !352, line: 141, type: !673)
!1069 = !DILocalVariable(name: "mc", scope: !1050, file: !352, line: 163, type: !1053)
!1070 = !DILocalVariable(name: "needed", scope: !1071, file: !352, line: 167, type: !41)
!1071 = distinct !DILexicalBlock(scope: !1050, file: !352, line: 166, column: 3)
!1072 = !DILocalVariable(name: "p", scope: !1073, file: !352, line: 168, type: !44)
!1073 = distinct !DILexicalBlock(scope: !1071, file: !352, line: 168, column: 5)
!1074 = !DILocalVariable(name: "used", scope: !1050, file: !352, line: 175, type: !41)
!1075 = !DILocalVariable(name: "p", scope: !1050, file: !352, line: 176, type: !44)
!1076 = !DILocalVariable(name: "affected", scope: !1077, file: !352, line: 180, type: !673)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !352, line: 178, column: 5)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !352, line: 177, column: 3)
!1079 = distinct !DILexicalBlock(scope: !1050, file: !352, line: 177, column: 3)
!1080 = !DILocalVariable(name: "op", scope: !1081, file: !352, line: 207, type: !37)
!1081 = distinct !DILexicalBlock(scope: !1077, file: !352, line: 206, column: 9)
!1082 = !DILocalVariable(name: "value", scope: !1081, file: !352, line: 208, type: !673)
!1083 = !DILocalVariable(name: "mentioned", scope: !1081, file: !352, line: 209, type: !673)
!1084 = !DILocalVariable(name: "flag", scope: !1081, file: !352, line: 210, type: !37)
!1085 = !DILocalVariable(name: "octal_mode", scope: !1086, file: !352, line: 217, type: !7)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !352, line: 216, column: 15)
!1087 = distinct !DILexicalBlock(scope: !1081, file: !352, line: 213, column: 13)
!1088 = !DILocalVariable(name: "change", scope: !1081, file: !352, line: 287, type: !1053)
!1089 = !DILabel(scope: !1077, name: "no_more_affected", file: !352, line: 203)
!1090 = !DILabel(scope: !1087, name: "no_more_values", file: !352, line: 284)
!1091 = !DILabel(scope: !1050, name: "invalid", file: !352, line: 308)
!1092 = !DILocation(line: 0, scope: !1050)
!1093 = !DILocation(line: 136, column: 14, scope: !1065)
!1094 = !DILocation(line: 136, column: 27, scope: !1065)
!1095 = !DILocation(line: 146, column: 41, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1064, file: !352, line: 145, column: 9)
!1097 = !DILocation(line: 0, scope: !1064)
!1098 = !DILocation(line: 146, column: 26, scope: !1096)
!1099 = !DILocation(line: 146, column: 43, scope: !1096)
!1100 = !DILocation(line: 146, column: 39, scope: !1096)
!1101 = !DILocation(line: 146, column: 46, scope: !1096)
!1102 = !DILocation(line: 147, column: 20, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1096, file: !352, line: 147, column: 15)
!1104 = !DILocation(line: 147, column: 15, scope: !1096)
!1105 = !DILocation(line: 150, column: 21, scope: !1064)
!1106 = !DILocation(line: 150, column: 24, scope: !1064)
!1107 = distinct !{!1107, !1108, !1109, !502}
!1108 = !DILocation(line: 144, column: 7, scope: !1064)
!1109 = !DILocation(line: 150, column: 35, scope: !1064)
!1110 = !DILocation(line: 152, column: 11, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1064, file: !352, line: 152, column: 11)
!1112 = !DILocation(line: 152, column: 11, scope: !1064)
!1113 = !DILocation(line: 156, column: 22, scope: !1064)
!1114 = !DILocation(line: 156, column: 36, scope: !1064)
!1115 = !DILocation(line: 156, column: 20, scope: !1064)
!1116 = !DILocalVariable(name: "new_mode", arg: 1, scope: !1117, file: !352, line: 112, type: !673)
!1117 = distinct !DISubprogram(name: "make_node_op_equals", scope: !352, file: !352, line: 112, type: !1118, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!1053, !673, !673}
!1120 = !{!1116, !1121, !1122}
!1121 = !DILocalVariable(name: "mentioned", arg: 2, scope: !1117, file: !352, line: 112, type: !673)
!1122 = !DILocalVariable(name: "p", scope: !1117, file: !352, line: 114, type: !1053)
!1123 = !DILocation(line: 0, scope: !1117, inlinedAt: !1124)
!1124 = distinct !DILocation(line: 159, column: 14, scope: !1064)
!1125 = !DILocation(line: 114, column: 27, scope: !1117, inlinedAt: !1124)
!1126 = !DILocation(line: 115, column: 9, scope: !1117, inlinedAt: !1124)
!1127 = !{!1128, !445, i64 0}
!1128 = !{!"mode_change", !445, i64 0, !445, i64 1, !536, i64 4, !536, i64 8, !536, i64 12}
!1129 = !DILocation(line: 116, column: 6, scope: !1117, inlinedAt: !1124)
!1130 = !DILocation(line: 116, column: 11, scope: !1117, inlinedAt: !1124)
!1131 = !{!1128, !445, i64 1}
!1132 = !DILocation(line: 117, column: 6, scope: !1117, inlinedAt: !1124)
!1133 = !DILocation(line: 117, column: 15, scope: !1117, inlinedAt: !1124)
!1134 = !{!1128, !536, i64 4}
!1135 = !DILocation(line: 118, column: 6, scope: !1117, inlinedAt: !1124)
!1136 = !DILocation(line: 118, column: 12, scope: !1117, inlinedAt: !1124)
!1137 = !{!1128, !536, i64 8}
!1138 = !DILocation(line: 119, column: 6, scope: !1117, inlinedAt: !1124)
!1139 = !DILocation(line: 119, column: 16, scope: !1117, inlinedAt: !1124)
!1140 = !{!1128, !536, i64 12}
!1141 = !DILocation(line: 120, column: 8, scope: !1117, inlinedAt: !1124)
!1142 = !DILocation(line: 120, column: 13, scope: !1117, inlinedAt: !1124)
!1143 = !DILocation(line: 159, column: 7, scope: !1064)
!1144 = !DILocation(line: 168, column: 39, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1073, file: !352, line: 168, column: 5)
!1146 = !DILocation(line: 0, scope: !1071)
!1147 = !DILocation(line: 0, scope: !1073)
!1148 = !DILocation(line: 168, column: 5, scope: !1073)
!1149 = !DILocation(line: 170, column: 10, scope: !1071)
!1150 = !DILocation(line: 177, column: 8, scope: !1079)
!1151 = !DILocation(line: 169, column: 41, scope: !1145)
!1152 = !DILocation(line: 169, column: 14, scope: !1145)
!1153 = !DILocation(line: 168, column: 44, scope: !1145)
!1154 = !DILocation(line: 168, column: 5, scope: !1145)
!1155 = distinct !{!1155, !1148, !1156, !502}
!1156 = !DILocation(line: 169, column: 53, scope: !1073)
!1157 = !DILocation(line: 175, column: 10, scope: !1050)
!1158 = !DILocation(line: 0, scope: !1079)
!1159 = !DILocation(line: 0, scope: !1081)
!1160 = !DILocation(line: 0, scope: !1077)
!1161 = !DILocation(line: 183, column: 7, scope: !1077)
!1162 = !DILocation(line: 184, column: 17, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !352, line: 183, column: 7)
!1164 = distinct !DILexicalBlock(scope: !1077, file: !352, line: 183, column: 7)
!1165 = !DILocation(line: 184, column: 9, scope: !1163)
!1166 = !DILocation(line: 212, column: 11, scope: !1081)
!1167 = !DILocation(line: 193, column: 13, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !352, line: 185, column: 11)
!1169 = !DILocation(line: 196, column: 13, scope: !1168)
!1170 = !DILocation(line: 199, column: 13, scope: !1168)
!1171 = !DILocation(line: 0, scope: !1168)
!1172 = !DILocation(line: 183, column: 16, scope: !1163)
!1173 = !DILocation(line: 183, column: 7, scope: !1163)
!1174 = distinct !{!1174, !1175, !1176}
!1175 = !DILocation(line: 183, column: 7, scope: !1164)
!1176 = !DILocation(line: 202, column: 11, scope: !1164)
!1177 = !DILocation(line: 207, column: 21, scope: !1081)
!1178 = !DILocation(line: 180, column: 14, scope: !1077)
!1179 = !DILocation(line: 207, column: 23, scope: !1081)
!1180 = !DILocation(line: 212, column: 19, scope: !1081)
!1181 = !DILocation(line: 219, column: 17, scope: !1086)
!1182 = !DILocation(line: 221, column: 51, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1086, file: !352, line: 220, column: 19)
!1184 = !DILocation(line: 0, scope: !1086)
!1185 = !DILocation(line: 221, column: 36, scope: !1183)
!1186 = !DILocation(line: 221, column: 53, scope: !1183)
!1187 = !DILocation(line: 221, column: 49, scope: !1183)
!1188 = !DILocation(line: 221, column: 56, scope: !1183)
!1189 = !DILocation(line: 222, column: 30, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1183, file: !352, line: 222, column: 25)
!1191 = !DILocation(line: 222, column: 25, scope: !1183)
!1192 = !DILocation(line: 225, column: 31, scope: !1086)
!1193 = !DILocation(line: 225, column: 34, scope: !1086)
!1194 = distinct !{!1194, !1181, !1195, !502}
!1195 = !DILocation(line: 225, column: 45, scope: !1086)
!1196 = !DILocation(line: 227, column: 21, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1086, file: !352, line: 227, column: 21)
!1198 = !DILocation(line: 227, column: 30, scope: !1197)
!1199 = !DILocation(line: 227, column: 37, scope: !1197)
!1200 = !DILocation(line: 239, column: 16, scope: !1087)
!1201 = !DILocation(line: 240, column: 15, scope: !1087)
!1202 = !DILocation(line: 245, column: 16, scope: !1087)
!1203 = !DILocation(line: 246, column: 15, scope: !1087)
!1204 = !DILocation(line: 251, column: 16, scope: !1087)
!1205 = !DILocation(line: 252, column: 15, scope: !1087)
!1206 = !DILocation(line: 259, column: 25, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !352, line: 258, column: 15)
!1208 = distinct !DILexicalBlock(scope: !1087, file: !352, line: 258, column: 15)
!1209 = !DILocation(line: 0, scope: !1087)
!1210 = !DILocation(line: 256, column: 20, scope: !1087)
!1211 = !DILocation(line: 259, column: 17, scope: !1207)
!1212 = !DILocation(line: 262, column: 27, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1207, file: !352, line: 260, column: 19)
!1214 = !DILocation(line: 263, column: 21, scope: !1213)
!1215 = !DILocation(line: 265, column: 27, scope: !1213)
!1216 = !DILocation(line: 266, column: 21, scope: !1213)
!1217 = !DILocation(line: 268, column: 27, scope: !1213)
!1218 = !DILocation(line: 269, column: 21, scope: !1213)
!1219 = !DILocation(line: 275, column: 27, scope: !1213)
!1220 = !DILocation(line: 276, column: 21, scope: !1213)
!1221 = !DILocation(line: 279, column: 27, scope: !1213)
!1222 = !DILocation(line: 280, column: 21, scope: !1213)
!1223 = !DILocation(line: 258, column: 24, scope: !1207)
!1224 = !DILocation(line: 258, column: 15, scope: !1207)
