; ModuleID = 'src/mknod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.selabel_handle = type opaque
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [47 x i8] c"Usage: %s [OPTION]... NAME TYPE [MAJOR MINOR]\0A\00", align 1
@.str.2 = private unnamed_addr constant [49 x i8] c"Create the special file NAME of the given TYPE.\0A\00", align 1

!22 = !DIEnumerator(name: "c_quoting_style", value: 5)
!23 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!24 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!25 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!26 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!27 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 46, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!31 = !DIEnumerator(name: "_ISupper", value: 256)
!32 = !DIEnumerator(name: "_ISlower", value: 512)
!33 = !DIEnumerator(name: "_ISalpha", value: 1024)
!34 = !DIEnumerator(name: "_ISdigit", value: 2048)
!35 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!36 = !DIEnumerator(name: "_ISspace", value: 8192)
!37 = !DIEnumerator(name: "_ISprint", value: 16384)
!38 = !DIEnumerator(name: "_ISgraph", value: 32768)
!39 = !DIEnumerator(name: "_ISblank", value: 1)
!40 = !DIEnumerator(name: "_IScntrl", value: 2)
!41 = !DIEnumerator(name: "_ISpunct", value: 4)
!42 = !DIEnumerator(name: "_ISalnum", value: 8)
!43 = !{!44, !46, !7, !47, !52, !53, !54, !56, !58, !49}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !48, line: 59, baseType: !49)
!48 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !50, line: 145, baseType: !51)
!50 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!51 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !51)
!55 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !{!60, !0}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !62, file: !63, line: 575, type: !52, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "oputs_", scope: !63, file: !63, line: 573, type: !64, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!63 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !56, !56}
!66 = !{!67, !68, !69, !72, !74, !75, !76, !80, !81, !82, !83, !85, !140, !141, !142, !144, !145}
!67 = !DILocalVariable(name: "program", arg: 1, scope: !62, file: !63, line: 573, type: !56)
!68 = !DILocalVariable(name: "option", arg: 2, scope: !62, file: !63, line: 573, type: !56)
!69 = !DILocalVariable(name: "term", scope: !70, file: !63, line: 585, type: !56)
!70 = distinct !DILexicalBlock(scope: !71, file: !63, line: 582, column: 5)
!71 = distinct !DILexicalBlock(scope: !62, file: !63, line: 581, column: 7)
!72 = !DILocalVariable(name: "double_space", scope: !62, file: !63, line: 594, type: !73)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DILocalVariable(name: "first_word", scope: !62, file: !63, line: 595, type: !56)
!75 = !DILocalVariable(name: "option_text", scope: !62, file: !63, line: 596, type: !56)
!76 = !DILocalVariable(name: "s", scope: !77, file: !63, line: 608, type: !56)
!77 = distinct !DILexicalBlock(scope: !78, file: !63, line: 605, column: 5)
!78 = distinct !DILexicalBlock(scope: !79, file: !63, line: 604, column: 12)
!79 = distinct !DILexicalBlock(scope: !62, file: !63, line: 597, column: 7)
!80 = !DILocalVariable(name: "spaces", scope: !77, file: !63, line: 609, type: !54)
!81 = !DILocalVariable(name: "anchor_len", scope: !62, file: !63, line: 620, type: !54)
!82 = !DILocalVariable(name: "desc_text", scope: !62, file: !63, line: 625, type: !56)
!83 = !DILocalVariable(name: "__ptr", scope: !84, file: !63, line: 644, type: !56)
!84 = distinct !DILexicalBlock(scope: !62, file: !63, line: 644, column: 3)
!85 = !DILocalVariable(name: "__stream", scope: !84, file: !63, line: 644, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 7, baseType: !89)
!88 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !91)
!90 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !107, !109, !110, !111, !114, !115, !117, !121, !124, !126, !129, !132, !133, !134, !135, !136}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !90, line: 51, baseType: !52, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !89, file: !90, line: 54, baseType: !44, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !89, file: !90, line: 55, baseType: !44, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !89, file: !90, line: 56, baseType: !44, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !89, file: !90, line: 57, baseType: !44, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !89, file: !90, line: 58, baseType: !44, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !89, file: !90, line: 59, baseType: !44, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !89, file: !90, line: 60, baseType: !44, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !89, file: !90, line: 61, baseType: !44, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !89, file: !90, line: 64, baseType: !44, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !89, file: !90, line: 65, baseType: !44, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !89, file: !90, line: 66, baseType: !44, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !89, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !90, line: 36, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !89, file: !90, line: 70, baseType: !108, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !89, file: !90, line: 72, baseType: !52, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !89, file: !90, line: 73, baseType: !52, size: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !89, file: !90, line: 74, baseType: !112, size: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !113)
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !89, file: !90, line: 77, baseType: !53, size: 16, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !89, file: !90, line: 78, baseType: !116, size: 8, offset: 1040)
!116 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !89, file: !90, line: 79, baseType: !118, size: 8, offset: 1048)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !89, file: !90, line: 81, baseType: !122, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !90, line: 43, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !90, line: 89, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !113)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !89, file: !90, line: 91, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !90, line: 37, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !89, file: !90, line: 92, baseType: !130, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !90, line: 38, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !89, file: !90, line: 93, baseType: !108, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !89, file: !90, line: 94, baseType: !46, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !89, file: !90, line: 95, baseType: !54, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !89, file: !90, line: 96, baseType: !52, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !89, file: !90, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocalVariable(name: "__cnt", scope: !84, file: !63, line: 644, type: !54)
!141 = !DILocalVariable(name: "url_program", scope: !62, file: !63, line: 648, type: !56)
!142 = !DILocalVariable(name: "__ptr", scope: !143, file: !63, line: 686, type: !56)
!143 = distinct !DILexicalBlock(scope: !62, file: !63, line: 686, column: 3)
!144 = !DILocalVariable(name: "__stream", scope: !143, file: !63, line: 686, type: !86)
!145 = !DILocalVariable(name: "__cnt", scope: !143, file: !63, line: 686, type: !54)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 1280, elements: !156)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !149, line: 50, size: 256, elements: !150)
!149 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!150 = !{!151, !152, !153, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 52, baseType: !56, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !148, file: !149, line: 55, baseType: !52, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !149, line: 56, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !148, file: !149, line: 57, baseType: !52, size: 32, offset: 192)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "Version", scope: !160, file: !161, line: 3, type: !56, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !162, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!162 = !{!158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "file_name", scope: !165, file: !166, line: 45, type: !56, isLocal: true, isDefinition: true)
!165 = distinct !DICompileUnit(language: DW_LANG_C99, file: !166, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !167, splitDebugInlining: false, nameTableKind: None)
!166 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!167 = !{!163, !168}
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !165, file: !166, line: 55, type: !73, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !172, file: !173, line: 66, type: !208, isLocal: false, isDefinition: true)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !174, globals: !175, splitDebugInlining: false, nameTableKind: None)
!173 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!174 = !{!46, !58}
!175 = !{!176, !202, !170, !204, !206}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "old_file_name", scope: !178, file: !173, line: 304, type: !56, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "verror_at_line", scope: !173, file: !173, line: 298, type: !179, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !195)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !52, !52, !56, !7, !56, !181}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !182, line: 52, baseType: !183)
!182 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !184, line: 32, baseType: !185)
!184 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !186, baseType: !187)
!186 = !DIFile(filename: "lib/error.c", directory: "/src")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !188, size: 256, elements: !189)
!188 = !DINamespace(name: "std", scope: null)
!189 = !{!190, !191, !192, !193, !194}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !187, file: !186, baseType: !46, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !187, file: !186, baseType: !46, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !187, file: !186, baseType: !46, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !187, file: !186, baseType: !52, size: 32, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !187, file: !186, baseType: !52, size: 32, offset: 224)
!195 = !{!196, !197, !198, !199, !200, !201}
!196 = !DILocalVariable(name: "status", arg: 1, scope: !178, file: !173, line: 298, type: !52)
!197 = !DILocalVariable(name: "errnum", arg: 2, scope: !178, file: !173, line: 298, type: !52)
!198 = !DILocalVariable(name: "file_name", arg: 3, scope: !178, file: !173, line: 298, type: !56)
!199 = !DILocalVariable(name: "line_number", arg: 4, scope: !178, file: !173, line: 298, type: !7)
!200 = !DILocalVariable(name: "message", arg: 5, scope: !178, file: !173, line: 298, type: !56)
!201 = !DILocalVariable(name: "args", arg: 6, scope: !178, file: !173, line: 298, type: !181)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "old_line_number", scope: !178, file: !173, line: 305, type: !7, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "error_message_count", scope: !172, file: !173, line: 69, type: !7, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !172, file: !173, line: 295, type: !52, isLocal: false, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{null}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !214, line: 31, type: !56, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !215, globals: !216, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!215 = !{!44}
!216 = !{!211}
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "utf07FF", scope: !219, file: !220, line: 46, type: !250, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "proper_name_lite", scope: !220, file: !220, line: 38, type: !221, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !223, retainedNodes: !225)
!220 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!221 = !DISubroutineType(types: !222)
!222 = !{!56, !56, !56}
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !224, splitDebugInlining: false, nameTableKind: None)
!224 = !{!217}
!225 = !{!226, !227, !228, !229, !234}
!226 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !219, file: !220, line: 38, type: !56)
!227 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !219, file: !220, line: 38, type: !56)
!228 = !DILocalVariable(name: "translation", scope: !219, file: !220, line: 40, type: !56)
!229 = !DILocalVariable(name: "w", scope: !219, file: !220, line: 47, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !231, line: 37, baseType: !232)
!231 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !50, line: 57, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !50, line: 42, baseType: !7)
!234 = !DILocalVariable(name: "mbs", scope: !219, file: !220, line: 48, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !239)
!238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !239, file: !238, line: 15, baseType: !52, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !239, file: !238, line: 20, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !238, line: 16, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !243, file: !238, line: 18, baseType: !7, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !243, file: !238, line: 19, baseType: !247, size: 32)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 4)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 16, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !255, file: !256, line: 76, type: !324, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !257, retainedTypes: !263, globals: !264, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!257 = !{!14, !258, !28}
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !15, line: 254, baseType: !7, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!261 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!262 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!263 = !{!52, !53, !54}
!264 = !{!253, !265, !271, !283, !285, !290, !313, !320, !322}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !255, file: !256, line: 92, type: !267, isLocal: false, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!269 = !{!270}
!270 = !DISubrange(count: 10)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !255, file: !256, line: 1040, type: !273, isLocal: false, isDefinition: true)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !256, line: 56, size: 448, elements: !274)
!274 = !{!275, !276, !277, !281, !282}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !273, file: !256, line: 59, baseType: !14, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !256, line: 62, baseType: !52, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !273, file: !256, line: 66, baseType: !278, size: 256, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !273, file: !256, line: 69, baseType: !56, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !273, file: !256, line: 72, baseType: !56, size: 64, offset: 384)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !255, file: !256, line: 107, type: !273, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "slot0", scope: !255, file: !256, line: 831, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 256)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "quote", scope: !292, file: !256, line: 228, type: !311, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "gettext_quote", scope: !256, file: !256, line: 197, type: !293, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!56, !56, !14}
!295 = !{!296, !297, !298, !299, !300}
!296 = !DILocalVariable(name: "msgid", arg: 1, scope: !292, file: !256, line: 197, type: !56)
!297 = !DILocalVariable(name: "s", arg: 2, scope: !292, file: !256, line: 197, type: !14)
!298 = !DILocalVariable(name: "translation", scope: !292, file: !256, line: 199, type: !56)
!299 = !DILocalVariable(name: "w", scope: !292, file: !256, line: 229, type: !230)
!300 = !DILocalVariable(name: "mbs", scope: !292, file: !256, line: 230, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !303, file: !238, line: 15, baseType: !52, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !303, file: !238, line: 20, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !238, line: 16, size: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !307, file: !238, line: 18, baseType: !7, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !307, file: !238, line: 19, baseType: !247, size: 32)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !312)
!312 = !{!252, !249}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "slotvec", scope: !255, file: !256, line: 834, type: !315, isLocal: true, isDefinition: true)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !256, line: 823, size: 128, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !316, file: !256, line: 825, baseType: !54, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !256, line: 826, baseType: !44, size: 64, offset: 64)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "nslots", scope: !255, file: !256, line: 832, type: !52, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "slotvec0", scope: !255, file: !256, line: 833, type: !316, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 704, elements: !326)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!326 = !{!327}
!327 = !DISubrange(count: 11)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !330, file: !331, line: 26, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!332 = !{!328}
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 376, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 47)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "exit_failure", scope: !338, file: !339, line: 24, type: !341, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !340, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!340 = !{!336}
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !52)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "internal_state", scope: !344, file: !345, line: 97, type: !348, isLocal: true, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !346, globals: !347, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!346 = !{!46, !54, !58}
!347 = !{!342}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !350, file: !238, line: 15, baseType: !52, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !350, file: !238, line: 20, baseType: !354, size: 32, offset: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !238, line: 16, size: 32, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !354, file: !238, line: 18, baseType: !7, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !354, file: !238, line: 19, baseType: !247, size: 32)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/mknod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a1171358cd5346ce916515df55db10ad")
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !366, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!366 = !{!367}
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 78, baseType: !7, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIEnumerator(name: "MODE_DONE", value: 0)
!370 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!371 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!372 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!375 = !{!376}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 40, baseType: !7, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!379 = !{!46}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !413, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!382 = !{!383, !395}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !384, file: !381, line: 188, baseType: !7, size: 32, elements: !393)
!384 = distinct !DISubprogram(name: "x2nrealloc", scope: !381, file: !381, line: 176, type: !385, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !388)
!385 = !DISubroutineType(types: !386)
!386 = !{!46, !46, !387, !54}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!388 = !{!389, !390, !391, !392}
!389 = !DILocalVariable(name: "p", arg: 1, scope: !384, file: !381, line: 176, type: !46)
!390 = !DILocalVariable(name: "pn", arg: 2, scope: !384, file: !381, line: 176, type: !387)
!391 = !DILocalVariable(name: "s", arg: 3, scope: !384, file: !381, line: 176, type: !54)
!392 = !DILocalVariable(name: "n", scope: !384, file: !381, line: 178, type: !54)
!393 = !{!394}
!394 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !396, file: !381, line: 228, baseType: !7, size: 32, elements: !393)
!396 = distinct !DISubprogram(name: "xpalloc", scope: !381, file: !381, line: 223, type: !397, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !403)
!397 = !DISubroutineType(types: !398)
!398 = !{!46, !46, !399, !400, !402, !400}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !401, line: 130, baseType: !402)
!401 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 35, baseType: !113)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DILocalVariable(name: "pa", arg: 1, scope: !396, file: !381, line: 223, type: !46)
!405 = !DILocalVariable(name: "pn", arg: 2, scope: !396, file: !381, line: 223, type: !399)
!406 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !396, file: !381, line: 223, type: !400)
!407 = !DILocalVariable(name: "n_max", arg: 4, scope: !396, file: !381, line: 223, type: !402)
!408 = !DILocalVariable(name: "s", arg: 5, scope: !396, file: !381, line: 223, type: !400)
!409 = !DILocalVariable(name: "n0", scope: !396, file: !381, line: 230, type: !400)
!410 = !DILocalVariable(name: "n", scope: !396, file: !381, line: 237, type: !400)
!411 = !DILocalVariable(name: "nbytes", scope: !396, file: !381, line: 248, type: !400)
!412 = !DILocalVariable(name: "adjusted_nbytes", scope: !396, file: !381, line: 252, type: !400)
!413 = !{!44, !46, !73, !113, !51}
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !419, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!418 = !{!5, !28}
!419 = !{!52, !53, !44, !73, !51, !420}
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !421, line: 102, baseType: !422)
!421 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !50, line: 73, baseType: !51)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!433 = !{!73, !51, !46}
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!440 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!441 = !{i32 7, !"Dwarf Version", i32 5}
!442 = !{i32 2, !"Debug Info Version", i32 3}
!443 = !{i32 1, !"wchar_size", i32 4}
!444 = !{i32 1, !"branch-target-enforcement", i32 0}
!445 = !{i32 1, !"sign-return-address", i32 0}
!446 = !{i32 1, !"sign-return-address-all", i32 0}
!447 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!448 = !{i32 7, !"PIC Level", i32 2}
!449 = !{i32 7, !"PIE Level", i32 2}
!450 = !{i32 7, !"uwtable", i32 1}
!451 = !{i32 7, !"frame-pointer", i32 1}
!452 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 47, type: !453, scopeLine: 48, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !52}
!455 = !{!456}
!456 = !DILocalVariable(name: "status", arg: 1, scope: !452, file: !3, line: 47, type: !52)
!457 = !DILocation(line: 0, scope: !452)
!458 = !DILocation(line: 49, column: 14, scope: !459)
!459 = distinct !DILexicalBlock(scope: !452, file: !3, line: 49, column: 7)
!460 = !DILocation(line: 49, column: 7, scope: !452)
!461 = !DILocation(line: 50, column: 5, scope: !462)
!462 = distinct !DILexicalBlock(scope: !459, file: !3, line: 50, column: 5)
!463 = !{!464, !464, i64 0}
!464 = !{!"any pointer", !465, i64 0}
!465 = !{!"omnipotent char", !466, i64 0}
!466 = !{!"Simple C/C++ TBAA"}
!467 = !DILocation(line: 53, column: 7, scope: !468)
!468 = distinct !DILexicalBlock(scope: !459, file: !3, line: 52, column: 5)
!469 = !DILocation(line: 55, column: 7, scope: !468)
!470 = !DILocation(line: 736, column: 3, scope: !471, inlinedAt: !473)
!471 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !63, file: !63, line: 734, type: !209, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !472)
!472 = !{}
!473 = distinct !DILocation(line: 59, column: 7, scope: !468)
!474 = !DILocation(line: 61, column: 7, scope: !468)
!475 = !DILocation(line: 65, column: 7, scope: !468)
!476 = !DILocation(line: 69, column: 7, scope: !468)
!477 = !DILocation(line: 74, column: 7, scope: !468)
!478 = !DILocation(line: 75, column: 7, scope: !468)
!479 = !DILocation(line: 76, column: 7, scope: !468)
!480 = !DILocation(line: 83, column: 7, scope: !468)
!481 = !DILocation(line: 89, column: 7, scope: !468)
!482 = !DILocalVariable(name: "program", arg: 1, scope: !483, file: !63, line: 836, type: !56)
!483 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !63, file: !63, line: 836, type: !484, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !486)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !56}
!486 = !{!482, !487, !496, !497, !499, !500}
!487 = !DILocalVariable(name: "infomap", scope: !483, file: !63, line: 838, type: !488)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 896, elements: !494)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !483, file: !63, line: 838, size: 128, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !490, file: !63, line: 838, baseType: !56, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !490, file: !63, line: 838, baseType: !56, size: 64, offset: 64)
!494 = !{!495}
!495 = !DISubrange(count: 7)
!496 = !DILocalVariable(name: "node", scope: !483, file: !63, line: 848, type: !56)
!497 = !DILocalVariable(name: "map_prog", scope: !483, file: !63, line: 849, type: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!499 = !DILocalVariable(name: "lc_messages", scope: !483, file: !63, line: 861, type: !56)
!500 = !DILocalVariable(name: "url_program", scope: !483, file: !63, line: 874, type: !56)
!501 = !DILocation(line: 0, scope: !483, inlinedAt: !502)
!502 = distinct !DILocation(line: 90, column: 7, scope: !468)
!503 = !DILocation(line: 838, column: 3, scope: !483, inlinedAt: !502)
!504 = !DILocation(line: 838, column: 67, scope: !483, inlinedAt: !502)
!505 = !DILocation(line: 849, column: 36, scope: !483, inlinedAt: !502)
!506 = !DILocation(line: 851, column: 3, scope: !483, inlinedAt: !502)
!507 = !DILocalVariable(name: "__s1", arg: 1, scope: !508, file: !509, line: 1359, type: !56)
!508 = distinct !DISubprogram(name: "streq", scope: !509, file: !509, line: 1359, type: !510, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !512)
!509 = !DIFile(filename: "./lib/string.h", directory: "/src")
!510 = !DISubroutineType(types: !511)
!511 = !{!73, !56, !56}
!512 = !{!507, !513}
!513 = !DILocalVariable(name: "__s2", arg: 2, scope: !508, file: !509, line: 1359, type: !56)
!514 = !DILocation(line: 0, scope: !508, inlinedAt: !515)
!515 = distinct !DILocation(line: 851, column: 33, scope: !483, inlinedAt: !502)
!516 = !DILocation(line: 1361, column: 11, scope: !508, inlinedAt: !515)
!517 = !DILocation(line: 1361, column: 10, scope: !508, inlinedAt: !515)
!518 = !DILocation(line: 852, column: 13, scope: !483, inlinedAt: !502)
!519 = !DILocation(line: 851, column: 20, scope: !483, inlinedAt: !502)
!520 = !{!521, !464, i64 0}
!521 = !{!"infomap", !464, i64 0, !464, i64 8}
!522 = !DILocation(line: 851, column: 10, scope: !483, inlinedAt: !502)
!523 = !DILocation(line: 851, column: 28, scope: !483, inlinedAt: !502)
!524 = distinct !{!524, !506, !518, !525}
!525 = !{!"llvm.loop.mustprogress"}
!526 = !DILocation(line: 854, column: 17, scope: !527, inlinedAt: !502)
!527 = distinct !DILexicalBlock(scope: !483, file: !63, line: 854, column: 7)
!528 = !{!521, !464, i64 8}
!529 = !DILocation(line: 854, column: 7, scope: !527, inlinedAt: !502)
!530 = !DILocation(line: 854, column: 7, scope: !483, inlinedAt: !502)
!531 = !DILocation(line: 857, column: 3, scope: !483, inlinedAt: !502)
!532 = !DILocation(line: 861, column: 29, scope: !483, inlinedAt: !502)
!533 = !DILocation(line: 862, column: 7, scope: !534, inlinedAt: !502)
!534 = distinct !DILexicalBlock(scope: !483, file: !63, line: 862, column: 7)
!535 = !DILocation(line: 862, column: 19, scope: !534, inlinedAt: !502)
!536 = !DILocation(line: 862, column: 22, scope: !534, inlinedAt: !502)
!537 = !DILocation(line: 862, column: 7, scope: !483, inlinedAt: !502)
!538 = !DILocation(line: 868, column: 7, scope: !539, inlinedAt: !502)
!539 = distinct !DILexicalBlock(scope: !534, file: !63, line: 863, column: 5)
!540 = !DILocation(line: 870, column: 5, scope: !539, inlinedAt: !502)
!541 = !DILocation(line: 0, scope: !508, inlinedAt: !542)
!542 = distinct !DILocation(line: 874, column: 29, scope: !483, inlinedAt: !502)
!543 = !DILocation(line: 875, column: 3, scope: !483, inlinedAt: !502)
!544 = !DILocation(line: 877, column: 3, scope: !483, inlinedAt: !502)
!545 = !DILocation(line: 879, column: 1, scope: !483, inlinedAt: !502)
!546 = !DILocation(line: 92, column: 3, scope: !452)
!547 = !DISubprogram(name: "dcgettext", scope: !548, file: !548, line: 51, type: !549, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!548 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!549 = !DISubroutineType(types: !550)
!550 = !{!44, !56, !56, !52}
!551 = !DISubprogram(name: "fputs_unlocked", scope: !182, file: !182, line: 691, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!552 = !DISubroutineType(types: !553)
!553 = !{!52, !554, !555}
!554 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!555 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!556 = !DILocation(line: 0, scope: !62)
!557 = !DILocation(line: 581, column: 7, scope: !71)
!558 = !{!559, !559, i64 0}
!559 = !{!"int", !465, i64 0}
!560 = !DILocation(line: 581, column: 19, scope: !71)
!561 = !DILocation(line: 581, column: 7, scope: !62)
!562 = !DILocation(line: 585, column: 26, scope: !70)
!563 = !DILocation(line: 0, scope: !70)
!564 = !DILocation(line: 586, column: 23, scope: !70)
!565 = !DILocation(line: 586, column: 28, scope: !70)
!566 = !DILocation(line: 586, column: 32, scope: !70)
!567 = !{!465, !465, i64 0}
!568 = !DILocation(line: 586, column: 38, scope: !70)
!569 = !DILocation(line: 0, scope: !508, inlinedAt: !570)
!570 = distinct !DILocation(line: 586, column: 41, scope: !70)
!571 = !DILocation(line: 1361, column: 11, scope: !508, inlinedAt: !570)
!572 = !DILocation(line: 1361, column: 10, scope: !508, inlinedAt: !570)
!573 = !DILocation(line: 586, column: 19, scope: !70)
!574 = !DILocation(line: 587, column: 5, scope: !70)
!575 = !DILocation(line: 588, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !62, file: !63, line: 588, column: 7)
!577 = !DILocation(line: 588, column: 7, scope: !62)
!578 = !DILocation(line: 590, column: 7, scope: !579)
!579 = distinct !DILexicalBlock(scope: !576, file: !63, line: 589, column: 5)
!580 = !DILocation(line: 591, column: 7, scope: !579)
!581 = !DILocation(line: 595, column: 37, scope: !62)
!582 = !DILocation(line: 595, column: 35, scope: !62)
!583 = !DILocation(line: 596, column: 29, scope: !62)
!584 = !DILocation(line: 597, column: 8, scope: !79)
!585 = !DILocation(line: 597, column: 7, scope: !62)
!586 = !DILocation(line: 604, column: 24, scope: !78)
!587 = !DILocation(line: 604, column: 12, scope: !79)
!588 = !DILocation(line: 0, scope: !77)
!589 = !DILocation(line: 610, column: 16, scope: !77)
!590 = !DILocation(line: 610, column: 7, scope: !77)
!591 = !DILocation(line: 611, column: 21, scope: !77)
!592 = !{!593, !593, i64 0}
!593 = !{!"short", !465, i64 0}
!594 = !DILocation(line: 611, column: 19, scope: !77)
!595 = !DILocation(line: 611, column: 16, scope: !77)
!596 = !DILocation(line: 610, column: 30, scope: !77)
!597 = distinct !{!597, !590, !591, !525}
!598 = !DILocation(line: 612, column: 18, scope: !599)
!599 = distinct !DILexicalBlock(scope: !77, file: !63, line: 612, column: 11)
!600 = !DILocation(line: 612, column: 11, scope: !77)
!601 = !DILocation(line: 620, column: 23, scope: !62)
!602 = !DILocation(line: 625, column: 39, scope: !62)
!603 = !DILocation(line: 626, column: 3, scope: !62)
!604 = !DILocation(line: 626, column: 10, scope: !62)
!605 = !DILocation(line: 626, column: 21, scope: !62)
!606 = !DILocation(line: 628, column: 44, scope: !607)
!607 = distinct !DILexicalBlock(scope: !608, file: !63, line: 628, column: 11)
!608 = distinct !DILexicalBlock(scope: !62, file: !63, line: 627, column: 5)
!609 = !DILocation(line: 628, column: 32, scope: !607)
!610 = !DILocation(line: 628, column: 49, scope: !607)
!611 = !DILocation(line: 628, column: 11, scope: !608)
!612 = !DILocation(line: 630, column: 11, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !63, line: 630, column: 11)
!614 = !DILocation(line: 630, column: 11, scope: !608)
!615 = !DILocation(line: 632, column: 26, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !63, line: 632, column: 15)
!617 = distinct !DILexicalBlock(scope: !613, file: !63, line: 631, column: 9)
!618 = !DILocation(line: 632, column: 34, scope: !616)
!619 = !DILocation(line: 632, column: 37, scope: !616)
!620 = !DILocation(line: 632, column: 15, scope: !617)
!621 = !DILocation(line: 636, column: 29, scope: !622)
!622 = distinct !DILexicalBlock(scope: !617, file: !63, line: 636, column: 15)
!623 = !DILocation(line: 640, column: 16, scope: !608)
!624 = distinct !{!624, !603, !625, !525}
!625 = !DILocation(line: 641, column: 5, scope: !62)
!626 = !DILocation(line: 644, column: 3, scope: !62)
!627 = !DILocation(line: 0, scope: !508, inlinedAt: !628)
!628 = distinct !DILocation(line: 648, column: 31, scope: !62)
!629 = !DILocation(line: 0, scope: !508, inlinedAt: !630)
!630 = distinct !DILocation(line: 649, column: 31, scope: !62)
!631 = !DILocation(line: 0, scope: !508, inlinedAt: !632)
!632 = distinct !DILocation(line: 650, column: 31, scope: !62)
!633 = !DILocation(line: 0, scope: !508, inlinedAt: !634)
!634 = distinct !DILocation(line: 651, column: 31, scope: !62)
!635 = !DILocation(line: 0, scope: !508, inlinedAt: !636)
!636 = distinct !DILocation(line: 652, column: 31, scope: !62)
!637 = !DILocation(line: 0, scope: !508, inlinedAt: !638)
!638 = distinct !DILocation(line: 653, column: 31, scope: !62)
!639 = !DILocation(line: 0, scope: !508, inlinedAt: !640)
!640 = distinct !DILocation(line: 654, column: 31, scope: !62)
!641 = !DILocation(line: 0, scope: !508, inlinedAt: !642)
!642 = distinct !DILocation(line: 655, column: 31, scope: !62)
!643 = !DILocation(line: 0, scope: !508, inlinedAt: !644)
!644 = distinct !DILocation(line: 656, column: 31, scope: !62)
!645 = !DILocation(line: 0, scope: !508, inlinedAt: !646)
!646 = distinct !DILocation(line: 657, column: 31, scope: !62)
!647 = !DILocation(line: 663, column: 7, scope: !648)
!648 = distinct !DILexicalBlock(scope: !62, file: !63, line: 663, column: 7)
!649 = !DILocation(line: 664, column: 7, scope: !648)
!650 = !DILocation(line: 664, column: 10, scope: !648)
!651 = !DILocation(line: 663, column: 7, scope: !62)
!652 = !DILocation(line: 669, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !648, file: !63, line: 665, column: 5)
!654 = !DILocation(line: 671, column: 5, scope: !653)
!655 = !DILocation(line: 676, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !648, file: !63, line: 673, column: 5)
!657 = !DILocation(line: 679, column: 3, scope: !62)
!658 = !DILocation(line: 683, column: 3, scope: !62)
!659 = !DILocation(line: 686, column: 3, scope: !62)
!660 = !DILocation(line: 688, column: 3, scope: !62)
!661 = !DILocation(line: 691, column: 3, scope: !62)
!662 = !DILocation(line: 695, column: 3, scope: !62)
!663 = !DILocation(line: 696, column: 1, scope: !62)
!664 = !DISubprogram(name: "setlocale", scope: !665, file: !665, line: 122, type: !666, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!665 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!666 = !DISubroutineType(types: !667)
!667 = !{!44, !52, !56}
!668 = !DISubprogram(name: "getenv", scope: !669, file: !669, line: 641, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!669 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!670 = !DISubroutineType(types: !671)
!671 = !{!44, !56}
!672 = !DISubprogram(name: "fwrite_unlocked", scope: !182, file: !182, line: 704, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!673 = !DISubroutineType(types: !674)
!674 = !{!54, !675, !54, !54, !555}
!675 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!678 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 96, type: !679, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !682)
!679 = !DISubroutineType(types: !680)
!680 = !{!52, !52, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!682 = !{!683, !684, !685, !686, !687, !691, !692, !695, !701, !702, !703, !706, !707, !710, !711, !712, !713, !714}
!683 = !DILocalVariable(name: "argc", arg: 1, scope: !678, file: !3, line: 96, type: !52)
!684 = !DILocalVariable(name: "argv", arg: 2, scope: !678, file: !3, line: 96, type: !681)
!685 = !DILocalVariable(name: "specified_mode", scope: !678, file: !3, line: 98, type: !56)
!686 = !DILocalVariable(name: "scontext", scope: !678, file: !3, line: 99, type: !56)
!687 = !DILocalVariable(name: "set_security_context", scope: !678, file: !3, line: 100, type: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !690, line: 53, flags: DIFlagFwdDecl)
!690 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!691 = !DILocalVariable(name: "optc", scope: !678, file: !3, line: 110, type: !52)
!692 = !DILocalVariable(name: "newmode", scope: !678, file: !3, line: 150, type: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !48, line: 69, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !50, line: 150, baseType: !7)
!695 = !DILocalVariable(name: "change", scope: !696, file: !3, line: 153, type: !698)
!696 = distinct !DILexicalBlock(scope: !697, file: !3, line: 152, column: 5)
!697 = distinct !DILexicalBlock(scope: !678, file: !3, line: 151, column: 7)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !700, line: 35, flags: DIFlagFwdDecl)
!700 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!701 = !DILocalVariable(name: "umask_value", scope: !696, file: !3, line: 156, type: !693)
!702 = !DILocalVariable(name: "expected_operands", scope: !678, file: !3, line: 168, type: !52)
!703 = !DILocalVariable(name: "ret", scope: !704, file: !3, line: 196, type: !52)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 195, column: 5)
!705 = distinct !DILexicalBlock(scope: !678, file: !3, line: 194, column: 7)
!706 = !DILocalVariable(name: "node_type", scope: !678, file: !3, line: 211, type: !693)
!707 = !DILocalVariable(name: "s_major", scope: !708, file: !3, line: 233, type: !56)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 232, column: 7)
!709 = distinct !DILexicalBlock(scope: !678, file: !3, line: 213, column: 5)
!710 = !DILocalVariable(name: "i_major", scope: !708, file: !3, line: 234, type: !420)
!711 = !DILocalVariable(name: "s_minor", scope: !708, file: !3, line: 240, type: !56)
!712 = !DILocalVariable(name: "i_minor", scope: !708, file: !3, line: 241, type: !420)
!713 = !DILocalVariable(name: "device", scope: !708, file: !3, line: 247, type: !47)
!714 = !DILabel(scope: !709, name: "block_or_character", file: !3, line: 231)
!715 = !DILocation(line: 0, scope: !678)
!716 = !DILocation(line: 103, column: 21, scope: !678)
!717 = !DILocation(line: 103, column: 3, scope: !678)
!718 = !DILocation(line: 104, column: 3, scope: !678)
!719 = !DILocation(line: 105, column: 3, scope: !678)
!720 = !DILocation(line: 106, column: 3, scope: !678)
!721 = !DILocation(line: 108, column: 3, scope: !678)
!722 = !DILocation(line: 111, column: 3, scope: !678)
!723 = !DILocation(line: 111, column: 18, scope: !678)
!724 = !DILocation(line: 116, column: 28, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 114, column: 9)
!726 = distinct !DILexicalBlock(scope: !678, file: !3, line: 112, column: 5)
!727 = !DILocation(line: 117, column: 11, scope: !725)
!728 = distinct !{!728, !722, !729, !525}
!729 = !DILocation(line: 148, column: 5, scope: !678)
!730 = !DILocation(line: 136, column: 20, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 136, column: 20)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 124, column: 20)
!733 = distinct !DILexicalBlock(scope: !725, file: !3, line: 119, column: 15)
!734 = !DILocation(line: 136, column: 20, scope: !732)
!735 = !DILocation(line: 138, column: 15, scope: !736)
!736 = distinct !DILexicalBlock(scope: !731, file: !3, line: 137, column: 13)
!737 = !DILocation(line: 141, column: 13, scope: !736)
!738 = !DILocation(line: 143, column: 9, scope: !725)
!739 = !DILocation(line: 144, column: 9, scope: !725)
!740 = !DILocation(line: 146, column: 11, scope: !725)
!741 = !DILocation(line: 151, column: 7, scope: !697)
!742 = !DILocation(line: 151, column: 7, scope: !678)
!743 = !DILocation(line: 153, column: 36, scope: !696)
!744 = !DILocation(line: 0, scope: !696)
!745 = !DILocation(line: 154, column: 12, scope: !746)
!746 = distinct !DILexicalBlock(scope: !696, file: !3, line: 154, column: 11)
!747 = !DILocation(line: 154, column: 11, scope: !696)
!748 = !DILocation(line: 155, column: 9, scope: !746)
!749 = !DILocation(line: 156, column: 28, scope: !696)
!750 = !DILocation(line: 157, column: 7, scope: !696)
!751 = !DILocation(line: 158, column: 17, scope: !696)
!752 = !DILocation(line: 159, column: 13, scope: !696)
!753 = !DILocation(line: 159, column: 7, scope: !696)
!754 = !DILocation(line: 160, column: 19, scope: !755)
!755 = distinct !DILexicalBlock(scope: !696, file: !3, line: 160, column: 11)
!756 = !DILocation(line: 160, column: 11, scope: !696)
!757 = !DILocation(line: 161, column: 9, scope: !755)
!758 = !DILocation(line: 168, column: 36, scope: !678)
!759 = !DILocation(line: 168, column: 33, scope: !678)
!760 = !DILocation(line: 169, column: 28, scope: !678)
!761 = !DILocation(line: 169, column: 39, scope: !678)
!762 = !DILocation(line: 169, column: 43, scope: !678)
!763 = !DILocation(line: 169, column: 50, scope: !678)
!764 = !DILocation(line: 169, column: 53, scope: !678)
!765 = !DILocation(line: 169, column: 73, scope: !678)
!766 = !DILocation(line: 168, column: 28, scope: !678)
!767 = !DILocation(line: 172, column: 12, scope: !768)
!768 = distinct !DILexicalBlock(scope: !678, file: !3, line: 172, column: 7)
!769 = !DILocation(line: 172, column: 21, scope: !768)
!770 = !DILocation(line: 172, column: 7, scope: !678)
!771 = !DILocation(line: 174, column: 11, scope: !772)
!772 = distinct !DILexicalBlock(scope: !768, file: !3, line: 173, column: 5)
!773 = !DILocation(line: 175, column: 9, scope: !774)
!774 = distinct !DILexicalBlock(scope: !772, file: !3, line: 174, column: 11)
!775 = !DILocation(line: 177, column: 9, scope: !774)
!776 = !DILocation(line: 178, column: 34, scope: !777)
!777 = distinct !DILexicalBlock(scope: !772, file: !3, line: 178, column: 11)
!778 = !DILocation(line: 178, column: 44, scope: !777)
!779 = !DILocation(line: 178, column: 42, scope: !777)
!780 = !DILocation(line: 178, column: 51, scope: !777)
!781 = !DILocation(line: 178, column: 11, scope: !772)
!782 = !DILocation(line: 179, column: 9, scope: !777)
!783 = !DILocation(line: 181, column: 7, scope: !772)
!784 = !DILocation(line: 184, column: 25, scope: !785)
!785 = distinct !DILexicalBlock(scope: !678, file: !3, line: 184, column: 7)
!786 = !DILocation(line: 184, column: 7, scope: !678)
!787 = !DILocation(line: 186, column: 7, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !3, line: 185, column: 5)
!789 = !DILocation(line: 188, column: 34, scope: !790)
!790 = distinct !DILexicalBlock(scope: !788, file: !3, line: 188, column: 11)
!791 = !DILocation(line: 188, column: 44, scope: !790)
!792 = !DILocation(line: 188, column: 42, scope: !790)
!793 = !DILocation(line: 188, column: 51, scope: !790)
!794 = !DILocation(line: 188, column: 11, scope: !788)
!795 = !DILocation(line: 189, column: 9, scope: !790)
!796 = !DILocation(line: 191, column: 7, scope: !788)
!797 = !DILocation(line: 212, column: 23, scope: !678)
!798 = !DILocation(line: 212, column: 11, scope: !678)
!799 = !DILocation(line: 212, column: 3, scope: !678)
!800 = !DILocation(line: 229, column: 7, scope: !709)
!801 = !DILocation(line: 0, scope: !709)
!802 = !DILocation(line: 231, column: 5, scope: !709)
!803 = !DILocation(line: 233, column: 43, scope: !708)
!804 = !DILocation(line: 233, column: 31, scope: !708)
!805 = !DILocation(line: 0, scope: !708)
!806 = !DILocation(line: 234, column: 9, scope: !708)
!807 = !DILocation(line: 235, column: 13, scope: !808)
!808 = distinct !DILexicalBlock(scope: !708, file: !3, line: 235, column: 13)
!809 = !DILocation(line: 235, column: 57, scope: !808)
!810 = !DILocation(line: 236, column: 13, scope: !808)
!811 = !DILocation(line: 237, column: 11, scope: !808)
!812 = !DILocation(line: 240, column: 36, scope: !708)
!813 = !DILocation(line: 240, column: 43, scope: !708)
!814 = !DILocation(line: 240, column: 31, scope: !708)
!815 = !DILocation(line: 241, column: 9, scope: !708)
!816 = !DILocation(line: 242, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !708, file: !3, line: 242, column: 13)
!818 = !DILocation(line: 242, column: 57, scope: !817)
!819 = !DILocation(line: 243, column: 13, scope: !817)
!820 = !DILocation(line: 243, column: 16, scope: !817)
!821 = !{!822, !822, i64 0}
!822 = !{!"long", !465, i64 0}
!823 = !DILocation(line: 243, column: 24, scope: !817)
!824 = !DILocation(line: 242, column: 13, scope: !708)
!825 = !DILocation(line: 244, column: 11, scope: !817)
!826 = !DILocation(line: 247, column: 24, scope: !708)
!827 = !DILocalVariable(name: "__major", arg: 1, scope: !828, file: !829, line: 43, type: !7)
!828 = distinct !DISubprogram(name: "gnu_dev_makedev", scope: !829, file: !829, line: 43, type: !830, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !832)
!829 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/sysmacros.h", directory: "", checksumkind: CSK_MD5, checksum: "55fcf1d6b566cf23c756196786ec2d1a")
!830 = !DISubroutineType(types: !831)
!831 = !{!49, !7, !7}
!832 = !{!827, !833, !834}
!833 = !DILocalVariable(name: "__minor", arg: 2, scope: !828, file: !829, line: 43, type: !7)
!834 = !DILocalVariable(name: "__dev", scope: !828, file: !829, line: 43, type: !49)
!835 = !DILocation(line: 0, scope: !828, inlinedAt: !836)
!836 = distinct !DILocation(line: 247, column: 24, scope: !708)
!837 = !DILocation(line: 43, column: 1, scope: !828, inlinedAt: !836)
!838 = !DILocation(line: 249, column: 20, scope: !839)
!839 = distinct !DILexicalBlock(scope: !708, file: !3, line: 249, column: 13)
!840 = !DILocation(line: 249, column: 13, scope: !708)
!841 = !DILocation(line: 250, column: 11, scope: !839)
!842 = !DILocation(line: 257, column: 25, scope: !843)
!843 = distinct !DILexicalBlock(scope: !708, file: !3, line: 257, column: 13)
!844 = !DILocation(line: 257, column: 20, scope: !843)
!845 = !DILocation(line: 257, column: 42, scope: !843)
!846 = !DILocation(line: 257, column: 13, scope: !843)
!847 = !DILocation(line: 257, column: 63, scope: !843)
!848 = !DILocation(line: 257, column: 13, scope: !708)
!849 = !DILocation(line: 258, column: 11, scope: !843)
!850 = !DILocation(line: 259, column: 7, scope: !709)
!851 = !DILocation(line: 260, column: 7, scope: !709)
!852 = !DILocation(line: 265, column: 19, scope: !853)
!853 = distinct !DILexicalBlock(scope: !709, file: !3, line: 265, column: 11)
!854 = !DILocation(line: 265, column: 11, scope: !853)
!855 = !DILocation(line: 265, column: 42, scope: !853)
!856 = !DILocation(line: 265, column: 11, scope: !709)
!857 = !DILocation(line: 266, column: 9, scope: !853)
!858 = !DILocation(line: 270, column: 7, scope: !709)
!859 = !DILocation(line: 271, column: 7, scope: !709)
!860 = !DILocation(line: 274, column: 22, scope: !861)
!861 = distinct !DILexicalBlock(scope: !678, file: !3, line: 274, column: 7)
!862 = !DILocation(line: 274, column: 38, scope: !861)
!863 = !DILocation(line: 274, column: 33, scope: !861)
!864 = !DILocation(line: 274, column: 25, scope: !861)
!865 = !DILocation(line: 274, column: 56, scope: !861)
!866 = !DILocation(line: 274, column: 7, scope: !678)
!867 = !DILocation(line: 275, column: 5, scope: !861)
!868 = !DILocation(line: 278, column: 3, scope: !678)
!869 = !DISubprogram(name: "bindtextdomain", scope: !548, file: !548, line: 86, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!870 = !DISubroutineType(types: !871)
!871 = !{!44, !56, !56}
!872 = !DISubprogram(name: "textdomain", scope: !548, file: !548, line: 82, type: !670, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!873 = !DISubprogram(name: "atexit", scope: !669, file: !669, line: 602, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!874 = !DISubroutineType(types: !875)
!875 = !{!52, !208}
!876 = !DISubprogram(name: "getopt_long", scope: !149, file: !149, line: 66, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!877 = !DISubroutineType(types: !878)
!878 = !{!52, !52, !879, !56, !881, !154}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!882 = !DISubprogram(name: "umask", scope: !883, file: !883, line: 380, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!883 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!884 = !DISubroutineType(types: !885)
!885 = !{!694, !694}
!886 = !DISubprogram(name: "mkfifo", scope: !883, file: !883, line: 418, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!887 = !DISubroutineType(types: !888)
!888 = !{!52, !56, !694}
!889 = !DISubprogram(name: "lchmod", scope: !883, file: !883, line: 359, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!890 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !166, file: !166, line: 50, type: !484, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !165, retainedNodes: !891)
!891 = !{!892}
!892 = !DILocalVariable(name: "file", arg: 1, scope: !890, file: !166, line: 50, type: !56)
!893 = !DILocation(line: 0, scope: !890)
!894 = !DILocation(line: 52, column: 13, scope: !890)
!895 = !DILocation(line: 53, column: 1, scope: !890)
!896 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !166, file: !166, line: 87, type: !897, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !165, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !73}
!899 = !{!900}
!900 = !DILocalVariable(name: "ignore", arg: 1, scope: !896, file: !166, line: 87, type: !73)
!901 = !DILocation(line: 0, scope: !896)
!902 = !DILocation(line: 89, column: 16, scope: !896)
!903 = !{!904, !904, i64 0}
!904 = !{!"_Bool", !465, i64 0}
!905 = !DILocation(line: 90, column: 1, scope: !896)
!906 = distinct !DISubprogram(name: "close_stdout", scope: !166, file: !166, line: 116, type: !209, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !165, retainedNodes: !907)
!907 = !{!908}
!908 = !DILocalVariable(name: "write_error", scope: !909, file: !166, line: 121, type: !56)
!909 = distinct !DILexicalBlock(scope: !910, file: !166, line: 120, column: 5)
!910 = distinct !DILexicalBlock(scope: !906, file: !166, line: 118, column: 7)
!911 = !DILocation(line: 118, column: 21, scope: !910)
!912 = !DILocation(line: 118, column: 7, scope: !910)
!913 = !DILocation(line: 118, column: 29, scope: !910)
!914 = !DILocation(line: 119, column: 7, scope: !910)
!915 = !DILocation(line: 119, column: 12, scope: !910)
!916 = !{i8 0, i8 2}
!917 = !DILocation(line: 119, column: 25, scope: !910)
!918 = !DILocation(line: 119, column: 28, scope: !910)
!919 = !DILocation(line: 119, column: 34, scope: !910)
!920 = !DILocation(line: 118, column: 7, scope: !906)
!921 = !DILocation(line: 121, column: 33, scope: !909)
!922 = !DILocation(line: 0, scope: !909)
!923 = !DILocation(line: 122, column: 11, scope: !924)
!924 = distinct !DILexicalBlock(scope: !909, file: !166, line: 122, column: 11)
!925 = !DILocation(line: 0, scope: !924)
!926 = !DILocation(line: 122, column: 11, scope: !909)
!927 = !DILocation(line: 123, column: 9, scope: !924)
!928 = !DILocation(line: 126, column: 9, scope: !924)
!929 = !DILocation(line: 128, column: 14, scope: !909)
!930 = !DILocation(line: 128, column: 7, scope: !909)
!931 = !DILocation(line: 133, column: 42, scope: !932)
!932 = distinct !DILexicalBlock(scope: !906, file: !166, line: 133, column: 7)
!933 = !DILocation(line: 133, column: 28, scope: !932)
!934 = !DILocation(line: 133, column: 50, scope: !932)
!935 = !DILocation(line: 133, column: 7, scope: !906)
!936 = !DILocation(line: 134, column: 12, scope: !932)
!937 = !DILocation(line: 134, column: 5, scope: !932)
!938 = !DILocation(line: 135, column: 1, scope: !906)
!939 = distinct !DISubprogram(name: "verror", scope: !173, file: !173, line: 251, type: !940, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !52, !52, !56, !181}
!942 = !{!943, !944, !945, !946}
!943 = !DILocalVariable(name: "status", arg: 1, scope: !939, file: !173, line: 251, type: !52)
!944 = !DILocalVariable(name: "errnum", arg: 2, scope: !939, file: !173, line: 251, type: !52)
!945 = !DILocalVariable(name: "message", arg: 3, scope: !939, file: !173, line: 251, type: !56)
!946 = !DILocalVariable(name: "args", arg: 4, scope: !939, file: !173, line: 251, type: !181)
!947 = !DILocation(line: 0, scope: !939)
!948 = !DILocation(line: 251, column: 1, scope: !939)
!949 = !DILocation(line: 261, column: 3, scope: !939)
!950 = !DILocation(line: 265, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !939, file: !173, line: 265, column: 7)
!952 = !DILocation(line: 265, column: 7, scope: !939)
!953 = !DILocation(line: 266, column: 5, scope: !951)
!954 = !DILocation(line: 272, column: 7, scope: !955)
!955 = distinct !DILexicalBlock(scope: !951, file: !173, line: 268, column: 5)
!956 = !DILocation(line: 276, column: 3, scope: !939)
!957 = !{i64 0, i64 8, !463, i64 8, i64 8, !463, i64 16, i64 8, !463, i64 24, i64 4, !558, i64 28, i64 4, !558}
!958 = !DILocation(line: 282, column: 1, scope: !939)
!959 = distinct !DISubprogram(name: "flush_stdout", scope: !173, file: !173, line: 163, type: !209, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !960)
!960 = !{!961}
!961 = !DILocalVariable(name: "stdout_fd", scope: !959, file: !173, line: 166, type: !52)
!962 = !DILocation(line: 0, scope: !959)
!963 = !DILocalVariable(name: "fd", arg: 1, scope: !964, file: !173, line: 145, type: !52)
!964 = distinct !DISubprogram(name: "is_open", scope: !173, file: !173, line: 145, type: !965, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{!52, !52}
!967 = !{!963}
!968 = !DILocation(line: 0, scope: !964, inlinedAt: !969)
!969 = distinct !DILocation(line: 182, column: 25, scope: !970)
!970 = distinct !DILexicalBlock(scope: !959, file: !173, line: 182, column: 7)
!971 = !DILocation(line: 157, column: 15, scope: !964, inlinedAt: !969)
!972 = !DILocation(line: 182, column: 25, scope: !970)
!973 = !DILocation(line: 182, column: 7, scope: !959)
!974 = !DILocation(line: 184, column: 5, scope: !970)
!975 = !DILocation(line: 185, column: 1, scope: !959)
!976 = distinct !DISubprogram(name: "error_tail", scope: !173, file: !173, line: 219, type: !940, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !977)
!977 = !{!978, !979, !980, !981}
!978 = !DILocalVariable(name: "status", arg: 1, scope: !976, file: !173, line: 219, type: !52)
!979 = !DILocalVariable(name: "errnum", arg: 2, scope: !976, file: !173, line: 219, type: !52)
!980 = !DILocalVariable(name: "message", arg: 3, scope: !976, file: !173, line: 219, type: !56)
!981 = !DILocalVariable(name: "args", arg: 4, scope: !976, file: !173, line: 219, type: !181)
!982 = !DILocation(line: 0, scope: !976)
!983 = !DILocation(line: 219, column: 1, scope: !976)
!984 = !DILocation(line: 229, column: 13, scope: !976)
!985 = !DILocation(line: 229, column: 3, scope: !976)
!986 = !DILocalVariable(name: "__stream", arg: 1, scope: !987, file: !988, line: 132, type: !991)
!987 = distinct !DISubprogram(name: "vfprintf", scope: !988, file: !988, line: 132, type: !989, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1026)
!988 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!989 = !DISubroutineType(types: !990)
!990 = !{!52, !991, !554, !183}
!991 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 7, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !994, file: !90, line: 51, baseType: !52, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !994, file: !90, line: 54, baseType: !44, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !994, file: !90, line: 55, baseType: !44, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !994, file: !90, line: 56, baseType: !44, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !994, file: !90, line: 57, baseType: !44, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !994, file: !90, line: 58, baseType: !44, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !994, file: !90, line: 59, baseType: !44, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !994, file: !90, line: 60, baseType: !44, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !994, file: !90, line: 61, baseType: !44, size: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !994, file: !90, line: 64, baseType: !44, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !994, file: !90, line: 65, baseType: !44, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !994, file: !90, line: 66, baseType: !44, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !994, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !994, file: !90, line: 70, baseType: !1010, size: 64, offset: 832)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !994, file: !90, line: 72, baseType: !52, size: 32, offset: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !994, file: !90, line: 73, baseType: !52, size: 32, offset: 928)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !994, file: !90, line: 74, baseType: !112, size: 64, offset: 960)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !994, file: !90, line: 77, baseType: !53, size: 16, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !994, file: !90, line: 78, baseType: !116, size: 8, offset: 1040)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !994, file: !90, line: 79, baseType: !118, size: 8, offset: 1048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !994, file: !90, line: 81, baseType: !122, size: 64, offset: 1088)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !994, file: !90, line: 89, baseType: !125, size: 64, offset: 1152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !994, file: !90, line: 91, baseType: !127, size: 64, offset: 1216)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !994, file: !90, line: 92, baseType: !130, size: 64, offset: 1280)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !994, file: !90, line: 93, baseType: !1010, size: 64, offset: 1344)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !994, file: !90, line: 94, baseType: !46, size: 64, offset: 1408)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !994, file: !90, line: 95, baseType: !54, size: 64, offset: 1472)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !994, file: !90, line: 96, baseType: !52, size: 32, offset: 1536)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !994, file: !90, line: 98, baseType: !137, size: 160, offset: 1568)
!1026 = !{!986, !1027, !1028}
!1027 = !DILocalVariable(name: "__fmt", arg: 2, scope: !987, file: !988, line: 133, type: !554)
!1028 = !DILocalVariable(name: "__ap", arg: 3, scope: !987, file: !988, line: 133, type: !183)
!1029 = !DILocation(line: 0, scope: !987, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 229, column: 3, scope: !976)
!1031 = !DILocation(line: 135, column: 10, scope: !987, inlinedAt: !1030)
!1032 = !{!1033, !1035}
!1033 = distinct !{!1033, !1034, !"vfprintf.inline: argument 0"}
!1034 = distinct !{!1034, !"vfprintf.inline"}
!1035 = distinct !{!1035, !1034, !"vfprintf.inline: argument 1"}
!1036 = !DILocation(line: 232, column: 3, scope: !976)
!1037 = !DILocation(line: 233, column: 7, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !976, file: !173, line: 233, column: 7)
!1039 = !DILocation(line: 233, column: 7, scope: !976)
!1040 = !DILocalVariable(name: "errnum", arg: 1, scope: !1041, file: !173, line: 188, type: !52)
!1041 = distinct !DISubprogram(name: "print_errno_message", scope: !173, file: !173, line: 188, type: !453, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1042)
!1042 = !{!1040, !1043, !1044}
!1043 = !DILocalVariable(name: "s", scope: !1041, file: !173, line: 190, type: !56)
!1044 = !DILocalVariable(name: "errbuf", scope: !1041, file: !173, line: 193, type: !1045)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8192, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 1024)
!1048 = !DILocation(line: 0, scope: !1041, inlinedAt: !1049)
!1049 = distinct !DILocation(line: 234, column: 5, scope: !1038)
!1050 = !DILocation(line: 193, column: 3, scope: !1041, inlinedAt: !1049)
!1051 = !DILocation(line: 193, column: 8, scope: !1041, inlinedAt: !1049)
!1052 = !DILocation(line: 195, column: 7, scope: !1041, inlinedAt: !1049)
!1053 = !DILocation(line: 207, column: 9, scope: !1054, inlinedAt: !1049)
!1054 = distinct !DILexicalBlock(scope: !1041, file: !173, line: 207, column: 7)
!1055 = !DILocation(line: 207, column: 7, scope: !1041, inlinedAt: !1049)
!1056 = !DILocation(line: 208, column: 9, scope: !1054, inlinedAt: !1049)
!1057 = !DILocation(line: 208, column: 5, scope: !1054, inlinedAt: !1049)
!1058 = !DILocation(line: 214, column: 3, scope: !1041, inlinedAt: !1049)
!1059 = !DILocation(line: 216, column: 1, scope: !1041, inlinedAt: !1049)
!1060 = !DILocation(line: 234, column: 5, scope: !1038)
!1061 = !DILocation(line: 238, column: 3, scope: !976)
!1062 = !DILocalVariable(name: "__c", arg: 1, scope: !1063, file: !1064, line: 101, type: !52)
!1063 = distinct !DISubprogram(name: "putc_unlocked", scope: !1064, file: !1064, line: 101, type: !1065, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1067)
!1064 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!52, !52, !992}
!1067 = !{!1062, !1068}
!1068 = !DILocalVariable(name: "__stream", arg: 2, scope: !1063, file: !1064, line: 101, type: !992)
!1069 = !DILocation(line: 0, scope: !1063, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 238, column: 3, scope: !976)
!1071 = !DILocation(line: 103, column: 10, scope: !1063, inlinedAt: !1070)
!1072 = !{!1073, !464, i64 40}
!1073 = !{!"_IO_FILE", !559, i64 0, !464, i64 8, !464, i64 16, !464, i64 24, !464, i64 32, !464, i64 40, !464, i64 48, !464, i64 56, !464, i64 64, !464, i64 72, !464, i64 80, !464, i64 88, !464, i64 96, !464, i64 104, !559, i64 112, !559, i64 116, !822, i64 120, !593, i64 128, !465, i64 130, !465, i64 131, !464, i64 136, !822, i64 144, !464, i64 152, !464, i64 160, !464, i64 168, !464, i64 176, !822, i64 184, !559, i64 192, !465, i64 196}
!1074 = !{!1073, !464, i64 48}
!1075 = !{!"branch_weights", i32 2000, i32 1}
!1076 = !DILocation(line: 240, column: 3, scope: !976)
!1077 = !DILocation(line: 241, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !976, file: !173, line: 241, column: 7)
!1079 = !DILocation(line: 241, column: 7, scope: !976)
!1080 = !DILocation(line: 242, column: 5, scope: !1078)
!1081 = !DILocation(line: 243, column: 1, scope: !976)
!1082 = !DISubprogram(name: "strerror_r", scope: !1083, file: !1083, line: 444, type: !1084, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!1083 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!44, !52, !44, !54}
!1086 = !DISubprogram(name: "fflush_unlocked", scope: !182, file: !182, line: 239, type: !1087, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!52, !992}
!1089 = !DISubprogram(name: "fcntl", scope: !1090, file: !1090, line: 149, type: !1091, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!1090 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!52, !52, !52, null}
!1093 = distinct !DISubprogram(name: "error", scope: !173, file: !173, line: 285, type: !1094, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1096)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{null, !52, !52, !56, null}
!1096 = !{!1097, !1098, !1099, !1100}
!1097 = !DILocalVariable(name: "status", arg: 1, scope: !1093, file: !173, line: 285, type: !52)
!1098 = !DILocalVariable(name: "errnum", arg: 2, scope: !1093, file: !173, line: 285, type: !52)
!1099 = !DILocalVariable(name: "message", arg: 3, scope: !1093, file: !173, line: 285, type: !56)
!1100 = !DILocalVariable(name: "ap", scope: !1093, file: !173, line: 287, type: !181)
!1101 = !DILocation(line: 0, scope: !1093)
!1102 = !DILocation(line: 287, column: 3, scope: !1093)
!1103 = !DILocation(line: 287, column: 11, scope: !1093)
!1104 = !DILocation(line: 288, column: 3, scope: !1093)
!1105 = !DILocation(line: 289, column: 3, scope: !1093)
!1106 = !DILocation(line: 290, column: 3, scope: !1093)
!1107 = !DILocation(line: 291, column: 1, scope: !1093)
!1108 = !DILocation(line: 0, scope: !178)
!1109 = !DILocation(line: 298, column: 1, scope: !178)
!1110 = !DILocation(line: 302, column: 7, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !178, file: !173, line: 302, column: 7)
!1112 = !DILocation(line: 302, column: 7, scope: !178)
!1113 = !DILocation(line: 307, column: 11, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !173, line: 307, column: 11)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !173, line: 303, column: 5)
!1116 = !DILocation(line: 307, column: 27, scope: !1114)
!1117 = !DILocation(line: 308, column: 11, scope: !1114)
!1118 = !DILocation(line: 308, column: 28, scope: !1114)
!1119 = !DILocation(line: 308, column: 25, scope: !1114)
!1120 = !DILocation(line: 309, column: 15, scope: !1114)
!1121 = !DILocation(line: 309, column: 33, scope: !1114)
!1122 = !DILocation(line: 310, column: 19, scope: !1114)
!1123 = !DILocation(line: 311, column: 22, scope: !1114)
!1124 = !DILocation(line: 311, column: 56, scope: !1114)
!1125 = !DILocation(line: 307, column: 11, scope: !1115)
!1126 = !DILocation(line: 316, column: 21, scope: !1115)
!1127 = !DILocation(line: 317, column: 23, scope: !1115)
!1128 = !DILocation(line: 318, column: 5, scope: !1115)
!1129 = !DILocation(line: 327, column: 3, scope: !178)
!1130 = !DILocation(line: 331, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !178, file: !173, line: 331, column: 7)
!1132 = !DILocation(line: 331, column: 7, scope: !178)
!1133 = !DILocation(line: 332, column: 5, scope: !1131)
!1134 = !DILocation(line: 338, column: 7, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1131, file: !173, line: 334, column: 5)
!1136 = !DILocation(line: 346, column: 3, scope: !178)
!1137 = !DILocation(line: 350, column: 3, scope: !178)
!1138 = !DILocation(line: 356, column: 1, scope: !178)
!1139 = distinct !DISubprogram(name: "error_at_line", scope: !173, file: !173, line: 359, type: !1140, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !1142)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !52, !52, !56, !7, !56, null}
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148}
!1143 = !DILocalVariable(name: "status", arg: 1, scope: !1139, file: !173, line: 359, type: !52)
!1144 = !DILocalVariable(name: "errnum", arg: 2, scope: !1139, file: !173, line: 359, type: !52)
!1145 = !DILocalVariable(name: "file_name", arg: 3, scope: !1139, file: !173, line: 359, type: !56)
!1146 = !DILocalVariable(name: "line_number", arg: 4, scope: !1139, file: !173, line: 360, type: !7)
!1147 = !DILocalVariable(name: "message", arg: 5, scope: !1139, file: !173, line: 360, type: !56)
!1148 = !DILocalVariable(name: "ap", scope: !1139, file: !173, line: 362, type: !181)
!1149 = !DILocation(line: 0, scope: !1139)
!1150 = !DILocation(line: 362, column: 3, scope: !1139)
!1151 = !DILocation(line: 362, column: 11, scope: !1139)
!1152 = !DILocation(line: 363, column: 3, scope: !1139)
!1153 = !DILocation(line: 364, column: 3, scope: !1139)
!1154 = !DILocation(line: 366, column: 3, scope: !1139)
!1155 = !DILocation(line: 367, column: 1, scope: !1139)
!1156 = distinct !DISubprogram(name: "getprogname", scope: !361, file: !361, line: 54, type: !1157, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !472)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!56}
!1159 = !DILocation(line: 58, column: 10, scope: !1156)
!1160 = !DILocation(line: 58, column: 3, scope: !1156)
!1161 = distinct !DISubprogram(name: "rpl_mknod", scope: !363, file: !363, line: 47, type: !1162, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !362, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!52, !56, !693, !47}
!1164 = !{!1165, !1166, !1167}
!1165 = !DILocalVariable(name: "name", arg: 1, scope: !1161, file: !363, line: 47, type: !56)
!1166 = !DILocalVariable(name: "mode", arg: 2, scope: !1161, file: !363, line: 47, type: !693)
!1167 = !DILocalVariable(name: "dev", arg: 3, scope: !1161, file: !363, line: 47, type: !47)
!1168 = !DILocation(line: 0, scope: !1161)
!1169 = !DILocation(line: 68, column: 7, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1161, file: !363, line: 68, column: 7)
!1171 = !DILocation(line: 68, column: 23, scope: !1170)
!1172 = !DILocation(line: 69, column: 31, scope: !1170)
!1173 = !DILocation(line: 69, column: 12, scope: !1170)
!1174 = !DILocation(line: 69, column: 5, scope: !1170)
!1175 = !DILocation(line: 71, column: 10, scope: !1161)
!1176 = !DILocation(line: 71, column: 3, scope: !1161)
!1177 = !DILocation(line: 72, column: 1, scope: !1161)
!1178 = !DISubprogram(name: "mknod", scope: !883, file: !883, line: 404, type: !1179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !472)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!52, !56, !694, !49}
!1181 = distinct !DISubprogram(name: "mode_compile", scope: !365, file: !365, line: 134, type: !1182, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !1192)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1184, !56}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !365, line: 98, size: 128, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1185, file: !365, line: 100, baseType: !45, size: 8)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1185, file: !365, line: 101, baseType: !45, size: 8, offset: 8)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "affected", scope: !1185, file: !365, line: 102, baseType: !693, size: 32, offset: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1185, file: !365, line: 103, baseType: !693, size: 32, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "mentioned", scope: !1185, file: !365, line: 104, baseType: !693, size: 32, offset: 96)
!1192 = !{!1193, !1194, !1197, !1198, !1199, !1200, !1201, !1203, !1205, !1206, !1207, !1211, !1213, !1214, !1215, !1216, !1219, !1220, !1221, !1222}
!1193 = !DILocalVariable(name: "mode_string", arg: 1, scope: !1181, file: !365, line: 134, type: !56)
!1194 = !DILocalVariable(name: "p", scope: !1195, file: !365, line: 138, type: !56)
!1195 = distinct !DILexicalBlock(scope: !1196, file: !365, line: 137, column: 5)
!1196 = distinct !DILexicalBlock(scope: !1181, file: !365, line: 136, column: 7)
!1197 = !DILocalVariable(name: "octal_mode", scope: !1195, file: !365, line: 139, type: !7)
!1198 = !DILocalVariable(name: "mode", scope: !1195, file: !365, line: 140, type: !693)
!1199 = !DILocalVariable(name: "mentioned", scope: !1195, file: !365, line: 141, type: !693)
!1200 = !DILocalVariable(name: "mc", scope: !1181, file: !365, line: 163, type: !1184)
!1201 = !DILocalVariable(name: "needed", scope: !1202, file: !365, line: 167, type: !54)
!1202 = distinct !DILexicalBlock(scope: !1181, file: !365, line: 166, column: 3)
!1203 = !DILocalVariable(name: "p", scope: !1204, file: !365, line: 168, type: !56)
!1204 = distinct !DILexicalBlock(scope: !1202, file: !365, line: 168, column: 5)
!1205 = !DILocalVariable(name: "used", scope: !1181, file: !365, line: 175, type: !54)
!1206 = !DILocalVariable(name: "p", scope: !1181, file: !365, line: 176, type: !56)
!1207 = !DILocalVariable(name: "affected", scope: !1208, file: !365, line: 180, type: !693)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !365, line: 178, column: 5)
!1209 = distinct !DILexicalBlock(scope: !1210, file: !365, line: 177, column: 3)
!1210 = distinct !DILexicalBlock(scope: !1181, file: !365, line: 177, column: 3)
!1211 = !DILocalVariable(name: "op", scope: !1212, file: !365, line: 207, type: !45)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !365, line: 206, column: 9)
!1213 = !DILocalVariable(name: "value", scope: !1212, file: !365, line: 208, type: !693)
!1214 = !DILocalVariable(name: "mentioned", scope: !1212, file: !365, line: 209, type: !693)
!1215 = !DILocalVariable(name: "flag", scope: !1212, file: !365, line: 210, type: !45)
!1216 = !DILocalVariable(name: "octal_mode", scope: !1217, file: !365, line: 217, type: !7)
!1217 = distinct !DILexicalBlock(scope: !1218, file: !365, line: 216, column: 15)
!1218 = distinct !DILexicalBlock(scope: !1212, file: !365, line: 213, column: 13)
!1219 = !DILocalVariable(name: "change", scope: !1212, file: !365, line: 287, type: !1184)
!1220 = !DILabel(scope: !1208, name: "no_more_affected", file: !365, line: 203)
