; ModuleID = 'src/mktemp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [34 x i8] c"Usage: %s [OPTION]... [TEMPLATE]\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 46, type: !125, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/mktemp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de5003826bec9e5f9730c511d0b9293f")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !{!22, !24, !25, !26, !27, !30, !32}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !28, line: 46, baseType: !29)
!28 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!29 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34, !37, !0, !123}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "stdout_closed", scope: !2, file: !3, line: 138, type: !36, isLocal: true, isDefinition: true)
!36 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !39, file: !40, line: 575, type: !25, isLocal: true, isDefinition: true)
!39 = distinct !DISubprogram(name: "oputs_", scope: !40, file: !40, line: 573, type: !41, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !43)
!40 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!41 = !DISubroutineType(types: !42)
!42 = !{null, !30, !30}
!43 = !{!44, !45, !46, !49, !50, !51, !52, !56, !57, !58, !59, !61, !117, !118, !119, !121, !122}
!44 = !DILocalVariable(name: "program", arg: 1, scope: !39, file: !40, line: 573, type: !30)
!45 = !DILocalVariable(name: "option", arg: 2, scope: !39, file: !40, line: 573, type: !30)
!46 = !DILocalVariable(name: "term", scope: !47, file: !40, line: 585, type: !30)
!47 = distinct !DILexicalBlock(scope: !48, file: !40, line: 582, column: 5)
!48 = distinct !DILexicalBlock(scope: !39, file: !40, line: 581, column: 7)
!49 = !DILocalVariable(name: "double_space", scope: !39, file: !40, line: 594, type: !36)
!50 = !DILocalVariable(name: "first_word", scope: !39, file: !40, line: 595, type: !30)
!51 = !DILocalVariable(name: "option_text", scope: !39, file: !40, line: 596, type: !30)
!52 = !DILocalVariable(name: "s", scope: !53, file: !40, line: 608, type: !30)
!53 = distinct !DILexicalBlock(scope: !54, file: !40, line: 605, column: 5)
!54 = distinct !DILexicalBlock(scope: !55, file: !40, line: 604, column: 12)
!55 = distinct !DILexicalBlock(scope: !39, file: !40, line: 597, column: 7)
!56 = !DILocalVariable(name: "spaces", scope: !53, file: !40, line: 609, type: !27)
!57 = !DILocalVariable(name: "anchor_len", scope: !39, file: !40, line: 620, type: !27)
!58 = !DILocalVariable(name: "desc_text", scope: !39, file: !40, line: 625, type: !30)
!59 = !DILocalVariable(name: "__ptr", scope: !60, file: !40, line: 644, type: !30)
!60 = distinct !DILexicalBlock(scope: !39, file: !40, line: 644, column: 3)
!61 = !DILocalVariable(name: "__stream", scope: !60, file: !40, line: 644, type: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 7, baseType: !65)
!64 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 49, size: 1728, elements: !67)
!66 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !83, !85, !86, !87, !91, !92, !94, !98, !101, !103, !106, !109, !110, !111, !112, !113}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 51, baseType: !25, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 54, baseType: !22, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 55, baseType: !22, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 56, baseType: !22, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 57, baseType: !22, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 58, baseType: !22, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 59, baseType: !22, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 60, baseType: !22, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 61, baseType: !22, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 64, baseType: !22, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 65, baseType: !22, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 66, baseType: !22, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 68, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 36, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 70, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 72, baseType: !25, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 73, baseType: !25, size: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 74, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 152, baseType: !90)
!89 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!90 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 77, baseType: !26, size: 16, offset: 1024)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 78, baseType: !93, size: 8, offset: 1040)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 79, baseType: !95, size: 8, offset: 1048)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 1)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 81, baseType: !99, size: 64, offset: 1088)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 43, baseType: null)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 89, baseType: !102, size: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 153, baseType: !90)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !65, file: !66, line: 91, baseType: !104, size: 64, offset: 1216)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !66, line: 37, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !65, file: !66, line: 92, baseType: !107, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !66, line: 38, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !65, file: !66, line: 93, baseType: !84, size: 64, offset: 1344)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !65, file: !66, line: 94, baseType: !24, size: 64, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 95, baseType: !27, size: 64, offset: 1472)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 96, baseType: !25, size: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 98, baseType: !114, size: 160, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !DILocalVariable(name: "__cnt", scope: !60, file: !40, line: 644, type: !27)
!118 = !DILocalVariable(name: "url_program", scope: !39, file: !40, line: 648, type: !30)
!119 = !DILocalVariable(name: "__ptr", scope: !120, file: !40, line: 686, type: !30)
!120 = distinct !DILexicalBlock(scope: !39, file: !40, line: 686, column: 3)
!121 = !DILocalVariable(name: "__stream", scope: !120, file: !40, line: 686, type: !62)
!122 = !DILocalVariable(name: "__cnt", scope: !120, file: !40, line: 686, type: !27)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "default_template", scope: !2, file: !3, line: 37, type: !30, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !135)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !128, line: 50, size: 256, elements: !129)
!128 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!129 = !{!130, !131, !132, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !128, line: 52, baseType: !30, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !127, file: !128, line: 55, baseType: !25, size: 32, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !127, file: !128, line: 56, baseType: !133, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !127, file: !128, line: 57, baseType: !25, size: 32, offset: 192)
!135 = !{!136}
!136 = !DISubrange(count: 8)
!137 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "Version", scope: !140, file: !141, line: 3, type: !30, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !142, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!142 = !{!138}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "file_name", scope: !145, file: !146, line: 45, type: !30, isLocal: true, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !147, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!147 = !{!143, !148}
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !145, file: !146, line: 55, type: !36, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !152, file: !153, line: 66, type: !188, isLocal: false, isDefinition: true)
!152 = distinct !DICompileUnit(language: DW_LANG_C99, file: !153, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !154, globals: !155, splitDebugInlining: false, nameTableKind: None)
!153 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!154 = !{!24, !32}
!155 = !{!156, !182, !150, !184, !186}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "old_file_name", scope: !158, file: !153, line: 304, type: !30, isLocal: true, isDefinition: true)
!158 = distinct !DISubprogram(name: "verror_at_line", scope: !153, file: !153, line: 298, type: !159, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !175)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !25, !25, !30, !7, !30, !161}
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !162, line: 52, baseType: !163)
!162 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !164, line: 32, baseType: !165)
!164 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !166, baseType: !167)
!166 = !DIFile(filename: "lib/error.c", directory: "/src")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !168, size: 256, elements: !169)
!168 = !DINamespace(name: "std", scope: null)
!169 = !{!170, !171, !172, !173, !174}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !167, file: !166, baseType: !24, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !167, file: !166, baseType: !24, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !167, file: !166, baseType: !24, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !167, file: !166, baseType: !25, size: 32, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !167, file: !166, baseType: !25, size: 32, offset: 224)
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DILocalVariable(name: "status", arg: 1, scope: !158, file: !153, line: 298, type: !25)
!177 = !DILocalVariable(name: "errnum", arg: 2, scope: !158, file: !153, line: 298, type: !25)
!178 = !DILocalVariable(name: "file_name", arg: 3, scope: !158, file: !153, line: 298, type: !30)
!179 = !DILocalVariable(name: "line_number", arg: 4, scope: !158, file: !153, line: 298, type: !7)
!180 = !DILocalVariable(name: "message", arg: 5, scope: !158, file: !153, line: 298, type: !30)
!181 = !DILocalVariable(name: "args", arg: 6, scope: !158, file: !153, line: 298, type: !161)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "old_line_number", scope: !158, file: !153, line: 305, type: !7, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "error_message_count", scope: !152, file: !153, line: 69, type: !7, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !152, file: !153, line: 295, type: !25, isLocal: false, isDefinition: true)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "program_name", scope: !193, file: !194, line: 31, type: !30, isLocal: false, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !195, globals: !196, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!195 = !{!22}
!196 = !{!191}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "utf07FF", scope: !199, file: !200, line: 46, type: !230, isLocal: true, isDefinition: true)
!199 = distinct !DISubprogram(name: "proper_name_lite", scope: !200, file: !200, line: 38, type: !201, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !203, retainedNodes: !205)
!200 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!201 = !DISubroutineType(types: !202)
!202 = !{!30, !30, !30}
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !204, splitDebugInlining: false, nameTableKind: None)
!204 = !{!197}
!205 = !{!206, !207, !208, !209, !214}
!206 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !199, file: !200, line: 38, type: !30)
!207 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !199, file: !200, line: 38, type: !30)
!208 = !DILocalVariable(name: "translation", scope: !199, file: !200, line: 40, type: !30)
!209 = !DILocalVariable(name: "w", scope: !199, file: !200, line: 47, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !211, line: 37, baseType: !212)
!211 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !89, line: 57, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !89, line: 42, baseType: !7)
!214 = !DILocalVariable(name: "mbs", scope: !199, file: !200, line: 48, type: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !216, line: 6, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !218, line: 21, baseType: !219)
!218 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 13, size: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !219, file: !218, line: 15, baseType: !25, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !219, file: !218, line: 20, baseType: !223, size: 32, offset: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !219, file: !218, line: 16, size: 32, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !223, file: !218, line: 18, baseType: !7, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !223, file: !218, line: 19, baseType: !227, size: 32)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 16, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 2)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !235, file: !236, line: 76, type: !316, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !237, retainedTypes: !257, globals: !258, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!237 = !{!238, !252, !5}
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !239, line: 42, baseType: !7, size: 32, elements: !240)
!239 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!241 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!242 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!243 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!244 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!245 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!246 = !DIEnumerator(name: "c_quoting_style", value: 5)
!247 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!248 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!249 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!250 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!251 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!252 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !239, line: 254, baseType: !7, size: 32, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!255 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!256 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!257 = !{!25, !26, !27}
!258 = !{!233, !259, !265, !275, !277, !282, !305, !312, !314}
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !235, file: !236, line: 92, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 320, elements: !263)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!263 = !{!264}
!264 = !DISubrange(count: 10)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !235, file: !236, line: 1040, type: !267, isLocal: false, isDefinition: true)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !236, line: 56, size: 448, elements: !268)
!268 = !{!269, !270, !271, !273, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !267, file: !236, line: 59, baseType: !238, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !267, file: !236, line: 62, baseType: !25, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !267, file: !236, line: 66, baseType: !272, size: 256, offset: 64)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !135)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !267, file: !236, line: 69, baseType: !30, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !267, file: !236, line: 72, baseType: !30, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !235, file: !236, line: 107, type: !267, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !235, file: !236, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !236, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !236, file: !236, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !235, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!30, !30, !238}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !236, line: 197, type: !30)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !236, line: 197, type: !238)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !236, line: 199, type: !30)
!291 = !DILocalVariable(name: "w", scope: !284, file: !236, line: 229, type: !210)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !236, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !216, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !218, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !218, line: 15, baseType: !25, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !218, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !218, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !218, line: 18, baseType: !7, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !218, line: 19, baseType: !227, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 64, elements: !304)
!304 = !{!232, !229}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !235, file: !236, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !236, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !236, line: 825, baseType: !27, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !236, line: 826, baseType: !22, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !235, file: !236, line: 832, type: !25, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !235, file: !236, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "tryfunc", scope: !322, file: !323, line: 175, type: !339, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "gen_tempname_len", scope: !323, file: !323, line: 172, type: !324, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !326, retainedNodes: !333)
!323 = !DIFile(filename: "lib/tempname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "89467f8095ceec51ae791cc96ec80d48")
!324 = !DISubroutineType(types: !325)
!325 = !{!25, !22, !25, !25, !25, !27}
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !327, splitDebugInlining: false, nameTableKind: None)
!327 = !{!320, !328}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "letters", scope: !326, file: !323, line: 151, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 504, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 63)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DILocalVariable(name: "tmpl", arg: 1, scope: !322, file: !323, line: 172, type: !22)
!335 = !DILocalVariable(name: "suffixlen", arg: 2, scope: !322, file: !323, line: 172, type: !25)
!336 = !DILocalVariable(name: "flags", arg: 3, scope: !322, file: !323, line: 172, type: !25)
!337 = !DILocalVariable(name: "kind", arg: 4, scope: !322, file: !323, line: 172, type: !25)
!338 = !DILocalVariable(name: "x_suffix_len", arg: 5, scope: !322, file: !323, line: 173, type: !27)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 192, elements: !344)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!25, !22, !24}
!344 = !{!345}
!345 = !DISubrange(count: 3)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !348, file: !349, line: 26, type: !351, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !350, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!350 = !{!346}
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 376, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 47)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "exit_failure", scope: !356, file: !357, line: 24, type: !359, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !358, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!358 = !{!354}
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "internal_state", scope: !362, file: !363, line: 97, type: !366, isLocal: true, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, globals: !365, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!364 = !{!24, !27, !32}
!365 = !{!360}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !216, line: 6, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !218, line: 21, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 13, size: 64, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !368, file: !218, line: 15, baseType: !25, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !368, file: !218, line: 20, baseType: !372, size: 32, offset: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !218, line: 16, size: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !372, file: !218, line: 18, baseType: !7, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !372, file: !218, line: 19, baseType: !227, size: 32)
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !195, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!384 = !{!24}
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !395, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!395 = !{!396}
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 40, baseType: !7, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !401, retainedTypes: !432, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!401 = !{!402, !414}
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !403, file: !400, line: 188, baseType: !7, size: 32, elements: !412)
!403 = distinct !DISubprogram(name: "x2nrealloc", scope: !400, file: !400, line: 176, type: !404, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !407)
!404 = !DISubroutineType(types: !405)
!405 = !{!24, !24, !406, !27}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!407 = !{!408, !409, !410, !411}
!408 = !DILocalVariable(name: "p", arg: 1, scope: !403, file: !400, line: 176, type: !24)
!409 = !DILocalVariable(name: "pn", arg: 2, scope: !403, file: !400, line: 176, type: !406)
!410 = !DILocalVariable(name: "s", arg: 3, scope: !403, file: !400, line: 176, type: !27)
!411 = !DILocalVariable(name: "n", scope: !403, file: !400, line: 178, type: !27)
!412 = !{!413}
!413 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !415, file: !400, line: 228, baseType: !7, size: 32, elements: !412)
!415 = distinct !DISubprogram(name: "xpalloc", scope: !400, file: !400, line: 223, type: !416, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !422)
!416 = !DISubroutineType(types: !417)
!417 = !{!24, !24, !418, !419, !421, !419}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !420, line: 130, baseType: !421)
!420 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !28, line: 35, baseType: !90)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DILocalVariable(name: "pa", arg: 1, scope: !415, file: !400, line: 223, type: !24)
!424 = !DILocalVariable(name: "pn", arg: 2, scope: !415, file: !400, line: 223, type: !418)
!425 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !415, file: !400, line: 223, type: !419)
!426 = !DILocalVariable(name: "n_max", arg: 4, scope: !415, file: !400, line: 223, type: !421)
!427 = !DILocalVariable(name: "s", arg: 5, scope: !415, file: !400, line: 223, type: !419)
!428 = !DILocalVariable(name: "n0", scope: !415, file: !400, line: 230, type: !419)
!429 = !DILocalVariable(name: "n", scope: !415, file: !400, line: 237, type: !419)
!430 = !DILocalVariable(name: "nbytes", scope: !415, file: !400, line: 248, type: !419)
!431 = !DILocalVariable(name: "adjusted_nbytes", scope: !415, file: !400, line: 252, type: !419)
!432 = !{!22, !24, !36, !90, !29}
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !437, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!437 = !{!36, !29, !24}
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!444 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!445 = !{i32 7, !"Dwarf Version", i32 5}
!446 = !{i32 2, !"Debug Info Version", i32 3}
!447 = !{i32 1, !"wchar_size", i32 4}
!448 = !{i32 1, !"branch-target-enforcement", i32 0}
!449 = !{i32 1, !"sign-return-address", i32 0}
!450 = !{i32 1, !"sign-return-address-all", i32 0}
!451 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!452 = !{i32 7, !"PIC Level", i32 2}
!453 = !{i32 7, !"PIE Level", i32 2}
!454 = !{i32 7, !"uwtable", i32 1}
!455 = !{i32 7, !"frame-pointer", i32 1}
!456 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 59, type: !457, scopeLine: 60, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !459)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !25}
!459 = !{!460}
!460 = !DILocalVariable(name: "status", arg: 1, scope: !456, file: !3, line: 59, type: !25)
!461 = !DILocation(line: 0, scope: !456)
!462 = !DILocation(line: 61, column: 14, scope: !463)
!463 = distinct !DILexicalBlock(scope: !456, file: !3, line: 61, column: 7)
!464 = !DILocation(line: 61, column: 7, scope: !456)
!465 = !DILocation(line: 62, column: 5, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !3, line: 62, column: 5)
!467 = !{!468, !468, i64 0}
!468 = !{!"any pointer", !469, i64 0}
!469 = !{!"omnipotent char", !470, i64 0}
!470 = !{!"Simple C/C++ TBAA"}
!471 = !DILocation(line: 65, column: 7, scope: !472)
!472 = distinct !DILexicalBlock(scope: !463, file: !3, line: 64, column: 5)
!473 = !DILocation(line: 66, column: 7, scope: !472)
!474 = !DILocation(line: 71, column: 7, scope: !472)
!475 = !DILocation(line: 74, column: 7, scope: !472)
!476 = !DILocation(line: 75, column: 7, scope: !472)
!477 = !DILocation(line: 79, column: 7, scope: !472)
!478 = !DILocation(line: 83, column: 7, scope: !472)
!479 = !DILocation(line: 87, column: 7, scope: !472)
!480 = !DILocation(line: 92, column: 7, scope: !472)
!481 = !DILocation(line: 100, column: 7, scope: !472)
!482 = !DILocation(line: 106, column: 7, scope: !472)
!483 = !DILocation(line: 107, column: 7, scope: !472)
!484 = !DILocalVariable(name: "program", arg: 1, scope: !485, file: !40, line: 836, type: !30)
!485 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !40, file: !40, line: 836, type: !486, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !30}
!488 = !{!484, !489, !498, !499, !501, !502}
!489 = !DILocalVariable(name: "infomap", scope: !485, file: !40, line: 838, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 896, elements: !496)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !485, file: !40, line: 838, size: 128, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !492, file: !40, line: 838, baseType: !30, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !40, line: 838, baseType: !30, size: 64, offset: 64)
!496 = !{!497}
!497 = !DISubrange(count: 7)
!498 = !DILocalVariable(name: "node", scope: !485, file: !40, line: 848, type: !30)
!499 = !DILocalVariable(name: "map_prog", scope: !485, file: !40, line: 849, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!501 = !DILocalVariable(name: "lc_messages", scope: !485, file: !40, line: 861, type: !30)
!502 = !DILocalVariable(name: "url_program", scope: !485, file: !40, line: 874, type: !30)
!503 = !DILocation(line: 0, scope: !485, inlinedAt: !504)
!504 = distinct !DILocation(line: 108, column: 7, scope: !472)
!505 = !DILocation(line: 838, column: 3, scope: !485, inlinedAt: !504)
!506 = !DILocation(line: 838, column: 67, scope: !485, inlinedAt: !504)
!507 = !DILocation(line: 849, column: 36, scope: !485, inlinedAt: !504)
!508 = !DILocation(line: 851, column: 3, scope: !485, inlinedAt: !504)
!509 = !DILocalVariable(name: "__s1", arg: 1, scope: !510, file: !511, line: 1359, type: !30)
!510 = distinct !DISubprogram(name: "streq", scope: !511, file: !511, line: 1359, type: !512, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !514)
!511 = !DIFile(filename: "./lib/string.h", directory: "/src")
!512 = !DISubroutineType(types: !513)
!513 = !{!36, !30, !30}
!514 = !{!509, !515}
!515 = !DILocalVariable(name: "__s2", arg: 2, scope: !510, file: !511, line: 1359, type: !30)
!516 = !DILocation(line: 0, scope: !510, inlinedAt: !517)
!517 = distinct !DILocation(line: 851, column: 33, scope: !485, inlinedAt: !504)
!518 = !DILocation(line: 1361, column: 11, scope: !510, inlinedAt: !517)
!519 = !DILocation(line: 1361, column: 10, scope: !510, inlinedAt: !517)
!520 = !DILocation(line: 852, column: 13, scope: !485, inlinedAt: !504)
!521 = !DILocation(line: 851, column: 20, scope: !485, inlinedAt: !504)
!522 = !{!523, !468, i64 0}
!523 = !{!"infomap", !468, i64 0, !468, i64 8}
!524 = !DILocation(line: 851, column: 10, scope: !485, inlinedAt: !504)
!525 = !DILocation(line: 851, column: 28, scope: !485, inlinedAt: !504)
!526 = distinct !{!526, !508, !520, !527}
!527 = !{!"llvm.loop.mustprogress"}
!528 = !DILocation(line: 854, column: 17, scope: !529, inlinedAt: !504)
!529 = distinct !DILexicalBlock(scope: !485, file: !40, line: 854, column: 7)
!530 = !{!523, !468, i64 8}
!531 = !DILocation(line: 854, column: 7, scope: !529, inlinedAt: !504)
!532 = !DILocation(line: 854, column: 7, scope: !485, inlinedAt: !504)
!533 = !DILocation(line: 857, column: 3, scope: !485, inlinedAt: !504)
!534 = !DILocation(line: 861, column: 29, scope: !485, inlinedAt: !504)
!535 = !DILocation(line: 862, column: 7, scope: !536, inlinedAt: !504)
!536 = distinct !DILexicalBlock(scope: !485, file: !40, line: 862, column: 7)
!537 = !DILocation(line: 862, column: 19, scope: !536, inlinedAt: !504)
!538 = !DILocation(line: 862, column: 22, scope: !536, inlinedAt: !504)
!539 = !DILocation(line: 862, column: 7, scope: !485, inlinedAt: !504)
!540 = !DILocation(line: 868, column: 7, scope: !541, inlinedAt: !504)
!541 = distinct !DILexicalBlock(scope: !536, file: !40, line: 863, column: 5)
!542 = !DILocation(line: 870, column: 5, scope: !541, inlinedAt: !504)
!543 = !DILocation(line: 0, scope: !510, inlinedAt: !544)
!544 = distinct !DILocation(line: 874, column: 29, scope: !485, inlinedAt: !504)
!545 = !DILocation(line: 875, column: 3, scope: !485, inlinedAt: !504)
!546 = !DILocation(line: 877, column: 3, scope: !485, inlinedAt: !504)
!547 = !DILocation(line: 879, column: 1, scope: !485, inlinedAt: !504)
!548 = !DILocation(line: 111, column: 3, scope: !456)
!549 = !DISubprogram(name: "dcgettext", scope: !550, file: !550, line: 51, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!550 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!551 = !DISubroutineType(types: !552)
!552 = !{!22, !30, !30, !25}
!553 = !{}
!554 = !DISubprogram(name: "fputs_unlocked", scope: !162, file: !162, line: 691, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!555 = !DISubroutineType(types: !556)
!556 = !{!25, !557, !558}
!557 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !30)
!558 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !62)
!559 = !DILocation(line: 0, scope: !39)
!560 = !DILocation(line: 581, column: 7, scope: !48)
!561 = !{!562, !562, i64 0}
!562 = !{!"int", !469, i64 0}
!563 = !DILocation(line: 581, column: 19, scope: !48)
!564 = !DILocation(line: 581, column: 7, scope: !39)
!565 = !DILocation(line: 585, column: 26, scope: !47)
!566 = !DILocation(line: 0, scope: !47)
!567 = !DILocation(line: 586, column: 23, scope: !47)
!568 = !DILocation(line: 586, column: 28, scope: !47)
!569 = !DILocation(line: 586, column: 32, scope: !47)
!570 = !{!469, !469, i64 0}
!571 = !DILocation(line: 586, column: 38, scope: !47)
!572 = !DILocation(line: 0, scope: !510, inlinedAt: !573)
!573 = distinct !DILocation(line: 586, column: 41, scope: !47)
!574 = !DILocation(line: 1361, column: 11, scope: !510, inlinedAt: !573)
!575 = !DILocation(line: 1361, column: 10, scope: !510, inlinedAt: !573)
!576 = !DILocation(line: 586, column: 19, scope: !47)
!577 = !DILocation(line: 587, column: 5, scope: !47)
!578 = !DILocation(line: 588, column: 7, scope: !579)
!579 = distinct !DILexicalBlock(scope: !39, file: !40, line: 588, column: 7)
!580 = !DILocation(line: 588, column: 7, scope: !39)
!581 = !DILocation(line: 590, column: 7, scope: !582)
!582 = distinct !DILexicalBlock(scope: !579, file: !40, line: 589, column: 5)
!583 = !DILocation(line: 591, column: 7, scope: !582)
!584 = !DILocation(line: 595, column: 37, scope: !39)
!585 = !DILocation(line: 595, column: 35, scope: !39)
!586 = !DILocation(line: 596, column: 29, scope: !39)
!587 = !DILocation(line: 597, column: 8, scope: !55)
!588 = !DILocation(line: 597, column: 7, scope: !39)
!589 = !DILocation(line: 604, column: 24, scope: !54)
!590 = !DILocation(line: 604, column: 12, scope: !55)
!591 = !DILocation(line: 0, scope: !53)
!592 = !DILocation(line: 610, column: 16, scope: !53)
!593 = !DILocation(line: 610, column: 7, scope: !53)
!594 = !DILocation(line: 611, column: 21, scope: !53)
!595 = !{!596, !596, i64 0}
!596 = !{!"short", !469, i64 0}
!597 = !DILocation(line: 611, column: 19, scope: !53)
!598 = !DILocation(line: 611, column: 16, scope: !53)
!599 = !DILocation(line: 610, column: 30, scope: !53)
!600 = distinct !{!600, !593, !594, !527}
!601 = !DILocation(line: 612, column: 18, scope: !602)
!602 = distinct !DILexicalBlock(scope: !53, file: !40, line: 612, column: 11)
!603 = !DILocation(line: 612, column: 11, scope: !53)
!604 = !DILocation(line: 620, column: 23, scope: !39)
!605 = !DILocation(line: 625, column: 39, scope: !39)
!606 = !DILocation(line: 626, column: 3, scope: !39)
!607 = !DILocation(line: 626, column: 10, scope: !39)
!608 = !DILocation(line: 626, column: 21, scope: !39)
!609 = !DILocation(line: 628, column: 44, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !40, line: 628, column: 11)
!611 = distinct !DILexicalBlock(scope: !39, file: !40, line: 627, column: 5)
!612 = !DILocation(line: 628, column: 32, scope: !610)
!613 = !DILocation(line: 628, column: 49, scope: !610)
!614 = !DILocation(line: 628, column: 11, scope: !611)
!615 = !DILocation(line: 630, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !40, line: 630, column: 11)
!617 = !DILocation(line: 630, column: 11, scope: !611)
!618 = !DILocation(line: 632, column: 26, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !40, line: 632, column: 15)
!620 = distinct !DILexicalBlock(scope: !616, file: !40, line: 631, column: 9)
!621 = !DILocation(line: 632, column: 34, scope: !619)
!622 = !DILocation(line: 632, column: 37, scope: !619)
!623 = !DILocation(line: 632, column: 15, scope: !620)
!624 = !DILocation(line: 636, column: 29, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !40, line: 636, column: 15)
!626 = !DILocation(line: 640, column: 16, scope: !611)
!627 = distinct !{!627, !606, !628, !527}
!628 = !DILocation(line: 641, column: 5, scope: !39)
!629 = !DILocation(line: 644, column: 3, scope: !39)
!630 = !DILocation(line: 0, scope: !510, inlinedAt: !631)
!631 = distinct !DILocation(line: 648, column: 31, scope: !39)
!632 = !DILocation(line: 0, scope: !510, inlinedAt: !633)
!633 = distinct !DILocation(line: 649, column: 31, scope: !39)
!634 = !DILocation(line: 0, scope: !510, inlinedAt: !635)
!635 = distinct !DILocation(line: 650, column: 31, scope: !39)
!636 = !DILocation(line: 0, scope: !510, inlinedAt: !637)
!637 = distinct !DILocation(line: 651, column: 31, scope: !39)
!638 = !DILocation(line: 0, scope: !510, inlinedAt: !639)
!639 = distinct !DILocation(line: 652, column: 31, scope: !39)
!640 = !DILocation(line: 0, scope: !510, inlinedAt: !641)
!641 = distinct !DILocation(line: 653, column: 31, scope: !39)
!642 = !DILocation(line: 0, scope: !510, inlinedAt: !643)
!643 = distinct !DILocation(line: 654, column: 31, scope: !39)
!644 = !DILocation(line: 0, scope: !510, inlinedAt: !645)
!645 = distinct !DILocation(line: 655, column: 31, scope: !39)
!646 = !DILocation(line: 0, scope: !510, inlinedAt: !647)
!647 = distinct !DILocation(line: 656, column: 31, scope: !39)
!648 = !DILocation(line: 0, scope: !510, inlinedAt: !649)
!649 = distinct !DILocation(line: 657, column: 31, scope: !39)
!650 = !DILocation(line: 663, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !39, file: !40, line: 663, column: 7)
!652 = !DILocation(line: 664, column: 7, scope: !651)
!653 = !DILocation(line: 664, column: 10, scope: !651)
!654 = !DILocation(line: 663, column: 7, scope: !39)
!655 = !DILocation(line: 669, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !651, file: !40, line: 665, column: 5)
!657 = !DILocation(line: 671, column: 5, scope: !656)
!658 = !DILocation(line: 676, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !651, file: !40, line: 673, column: 5)
!660 = !DILocation(line: 679, column: 3, scope: !39)
!661 = !DILocation(line: 683, column: 3, scope: !39)
!662 = !DILocation(line: 686, column: 3, scope: !39)
!663 = !DILocation(line: 688, column: 3, scope: !39)
!664 = !DILocation(line: 691, column: 3, scope: !39)
!665 = !DILocation(line: 695, column: 3, scope: !39)
!666 = !DILocation(line: 696, column: 1, scope: !39)
!667 = !DISubprogram(name: "setlocale", scope: !668, file: !668, line: 122, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!668 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!669 = !DISubroutineType(types: !670)
!670 = !{!22, !25, !30}
!671 = !DISubprogram(name: "getenv", scope: !672, file: !672, line: 641, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!672 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!673 = !DISubroutineType(types: !674)
!674 = !{!22, !30}
!675 = !DISubprogram(name: "fwrite_unlocked", scope: !162, file: !162, line: 704, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!676 = !DISubroutineType(types: !677)
!677 = !{!27, !678, !27, !27, !558}
!678 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!681 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 154, type: !682, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!25, !25, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !706, !711, !715, !718, !720}
!686 = !DILocalVariable(name: "argc", arg: 1, scope: !681, file: !3, line: 154, type: !25)
!687 = !DILocalVariable(name: "argv", arg: 2, scope: !681, file: !3, line: 154, type: !684)
!688 = !DILocalVariable(name: "dest_dir", scope: !681, file: !3, line: 156, type: !30)
!689 = !DILocalVariable(name: "dest_dir_arg", scope: !681, file: !3, line: 157, type: !30)
!690 = !DILocalVariable(name: "suppress_file_err", scope: !681, file: !3, line: 158, type: !36)
!691 = !DILocalVariable(name: "c", scope: !681, file: !3, line: 159, type: !25)
!692 = !DILocalVariable(name: "template", scope: !681, file: !3, line: 160, type: !22)
!693 = !DILocalVariable(name: "suffix", scope: !681, file: !3, line: 161, type: !22)
!694 = !DILocalVariable(name: "use_dest_dir", scope: !681, file: !3, line: 162, type: !36)
!695 = !DILocalVariable(name: "deprecated_t_option", scope: !681, file: !3, line: 163, type: !36)
!696 = !DILocalVariable(name: "create_directory", scope: !681, file: !3, line: 164, type: !36)
!697 = !DILocalVariable(name: "dry_run", scope: !681, file: !3, line: 165, type: !36)
!698 = !DILocalVariable(name: "status", scope: !681, file: !3, line: 166, type: !25)
!699 = !DILocalVariable(name: "x_count", scope: !681, file: !3, line: 167, type: !27)
!700 = !DILocalVariable(name: "suffix_len", scope: !681, file: !3, line: 168, type: !27)
!701 = !DILocalVariable(name: "dest_name", scope: !681, file: !3, line: 169, type: !22)
!702 = !DILocalVariable(name: "n_args", scope: !681, file: !3, line: 215, type: !25)
!703 = !DILocalVariable(name: "len", scope: !704, file: !3, line: 234, type: !27)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 233, column: 5)
!705 = distinct !DILexicalBlock(scope: !681, file: !3, line: 232, column: 7)
!706 = !DILocalVariable(name: "env", scope: !707, file: !3, line: 280, type: !22)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 279, column: 9)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 278, column: 11)
!709 = distinct !DILexicalBlock(scope: !710, file: !3, line: 277, column: 5)
!710 = distinct !DILexicalBlock(scope: !681, file: !3, line: 276, column: 7)
!711 = !DILocalVariable(name: "env", scope: !712, file: !3, line: 299, type: !22)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 298, column: 13)
!713 = distinct !DILexicalBlock(scope: !714, file: !3, line: 295, column: 15)
!714 = distinct !DILexicalBlock(scope: !708, file: !3, line: 294, column: 9)
!715 = !DILocalVariable(name: "err", scope: !716, file: !3, line: 321, type: !25)
!716 = distinct !DILexicalBlock(scope: !717, file: !3, line: 320, column: 5)
!717 = distinct !DILexicalBlock(scope: !681, file: !3, line: 319, column: 7)
!718 = !DILocalVariable(name: "fd", scope: !719, file: !3, line: 332, type: !25)
!719 = distinct !DILexicalBlock(scope: !717, file: !3, line: 331, column: 5)
!720 = !DILocalVariable(name: "saved_errno", scope: !721, file: !3, line: 349, type: !25)
!721 = distinct !DILexicalBlock(scope: !722, file: !3, line: 348, column: 9)
!722 = distinct !DILexicalBlock(scope: !723, file: !3, line: 347, column: 11)
!723 = distinct !DILexicalBlock(scope: !724, file: !3, line: 343, column: 5)
!724 = distinct !DILexicalBlock(scope: !681, file: !3, line: 342, column: 7)
!725 = !DILocation(line: 0, scope: !681)
!726 = !DILocation(line: 172, column: 21, scope: !681)
!727 = !DILocation(line: 172, column: 3, scope: !681)
!728 = !DILocation(line: 173, column: 3, scope: !681)
!729 = !DILocation(line: 174, column: 3, scope: !681)
!730 = !DILocation(line: 175, column: 3, scope: !681)
!731 = !DILocation(line: 177, column: 3, scope: !681)
!732 = !DILocation(line: 179, column: 3, scope: !681)
!733 = !DILocation(line: 179, column: 15, scope: !681)
!734 = distinct !{!734, !732, !735, !527}
!735 = !DILocation(line: 213, column: 5, scope: !681)
!736 = !DILocation(line: 187, column: 26, scope: !737)
!737 = distinct !DILexicalBlock(scope: !738, file: !3, line: 182, column: 9)
!738 = distinct !DILexicalBlock(scope: !681, file: !3, line: 180, column: 5)
!739 = !DILocation(line: 189, column: 11, scope: !737)
!740 = !DILocation(line: 202, column: 20, scope: !737)
!741 = !DILocation(line: 203, column: 11, scope: !737)
!742 = !DILocation(line: 205, column: 9, scope: !737)
!743 = !DILocation(line: 209, column: 9, scope: !737)
!744 = !DILocation(line: 211, column: 11, scope: !737)
!745 = !DILocation(line: 215, column: 23, scope: !681)
!746 = !DILocation(line: 215, column: 21, scope: !681)
!747 = !DILocation(line: 216, column: 9, scope: !748)
!748 = distinct !DILexicalBlock(scope: !681, file: !3, line: 216, column: 7)
!749 = !DILocation(line: 216, column: 7, scope: !681)
!750 = !DILocation(line: 218, column: 7, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !3, line: 217, column: 5)
!752 = !DILocation(line: 219, column: 7, scope: !751)
!753 = !DILocation(line: 222, column: 14, scope: !754)
!754 = distinct !DILexicalBlock(scope: !681, file: !3, line: 222, column: 7)
!755 = !DILocation(line: 222, column: 7, scope: !681)
!756 = !DILocation(line: 229, column: 18, scope: !757)
!757 = distinct !DILexicalBlock(scope: !754, file: !3, line: 228, column: 5)
!758 = !DILocation(line: 0, scope: !754)
!759 = !DILocation(line: 232, column: 7, scope: !705)
!760 = !DILocation(line: 232, column: 7, scope: !681)
!761 = !DILocation(line: 234, column: 20, scope: !704)
!762 = !DILocation(line: 0, scope: !704)
!763 = !DILocation(line: 235, column: 12, scope: !764)
!764 = distinct !DILexicalBlock(scope: !704, file: !3, line: 235, column: 11)
!765 = !DILocation(line: 235, column: 16, scope: !764)
!766 = !DILocation(line: 235, column: 32, scope: !764)
!767 = !DILocation(line: 235, column: 19, scope: !764)
!768 = !DILocation(line: 235, column: 37, scope: !764)
!769 = !DILocation(line: 235, column: 11, scope: !704)
!770 = !DILocation(line: 237, column: 11, scope: !771)
!771 = distinct !DILexicalBlock(scope: !764, file: !3, line: 236, column: 9)
!772 = !DILocation(line: 241, column: 20, scope: !704)
!773 = !DILocation(line: 242, column: 35, scope: !704)
!774 = !DILocation(line: 242, column: 48, scope: !704)
!775 = !DILocation(line: 242, column: 19, scope: !704)
!776 = !DILocalVariable(name: "__dest", arg: 1, scope: !777, file: !778, line: 26, type: !781)
!777 = distinct !DISubprogram(name: "memcpy", scope: !778, file: !778, line: 26, type: !779, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !782)
!778 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!779 = !DISubroutineType(types: !780)
!780 = !{!24, !781, !678, !27}
!781 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !24)
!782 = !{!776, !783, !784}
!783 = !DILocalVariable(name: "__src", arg: 2, scope: !777, file: !778, line: 26, type: !678)
!784 = !DILocalVariable(name: "__len", arg: 3, scope: !777, file: !778, line: 26, type: !27)
!785 = !DILocation(line: 0, scope: !777, inlinedAt: !786)
!786 = distinct !DILocation(line: 243, column: 7, scope: !704)
!787 = !DILocation(line: 29, column: 10, scope: !777, inlinedAt: !786)
!788 = !DILocation(line: 244, column: 25, scope: !704)
!789 = !DILocation(line: 0, scope: !777, inlinedAt: !790)
!790 = distinct !DILocation(line: 244, column: 7, scope: !704)
!791 = !DILocation(line: 29, column: 10, scope: !777, inlinedAt: !790)
!792 = !DILocation(line: 247, column: 5, scope: !704)
!793 = !DILocation(line: 250, column: 18, scope: !794)
!794 = distinct !DILexicalBlock(scope: !705, file: !3, line: 249, column: 5)
!795 = !DILocation(line: 251, column: 16, scope: !794)
!796 = !DILocation(line: 252, column: 12, scope: !797)
!797 = distinct !DILexicalBlock(scope: !794, file: !3, line: 252, column: 11)
!798 = !DILocation(line: 252, column: 11, scope: !794)
!799 = !DILocation(line: 253, column: 18, scope: !797)
!800 = !DILocation(line: 253, column: 9, scope: !797)
!801 = !DILocation(line: 255, column: 15, scope: !797)
!802 = !DILocation(line: 0, scope: !797)
!803 = !DILocation(line: 256, column: 20, scope: !794)
!804 = !DILocation(line: 0, scope: !705)
!805 = !DILocation(line: 260, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !681, file: !3, line: 260, column: 7)
!807 = !DILocation(line: 260, column: 18, scope: !806)
!808 = !DILocation(line: 260, column: 21, scope: !806)
!809 = !DILocation(line: 260, column: 45, scope: !806)
!810 = !DILocation(line: 260, column: 7, scope: !681)
!811 = !DILocation(line: 262, column: 7, scope: !812)
!812 = distinct !DILexicalBlock(scope: !806, file: !3, line: 261, column: 5)
!813 = !DILocation(line: 266, column: 53, scope: !681)
!814 = !DILocalVariable(name: "s", arg: 1, scope: !815, file: !3, line: 115, type: !30)
!815 = distinct !DISubprogram(name: "count_consecutive_X_s", scope: !3, file: !3, line: 115, type: !816, scopeLine: 116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{!27, !30, !27}
!818 = !{!814, !819, !820}
!819 = !DILocalVariable(name: "len", arg: 2, scope: !815, file: !3, line: 115, type: !27)
!820 = !DILocalVariable(name: "n", scope: !815, file: !3, line: 117, type: !27)
!821 = !DILocation(line: 0, scope: !815, inlinedAt: !822)
!822 = distinct !DILocation(line: 266, column: 13, scope: !681)
!823 = !DILocation(line: 118, column: 11, scope: !824, inlinedAt: !822)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 118, column: 3)
!825 = distinct !DILexicalBlock(scope: !815, file: !3, line: 118, column: 3)
!826 = !DILocation(line: 118, column: 15, scope: !824, inlinedAt: !822)
!827 = !DILocation(line: 118, column: 24, scope: !824, inlinedAt: !822)
!828 = !DILocation(line: 118, column: 18, scope: !824, inlinedAt: !822)
!829 = !DILocation(line: 118, column: 29, scope: !824, inlinedAt: !822)
!830 = !DILocation(line: 118, column: 3, scope: !825, inlinedAt: !822)
!831 = !DILocation(line: 119, column: 5, scope: !824, inlinedAt: !822)
!832 = distinct !{!832, !830, !833, !527}
!833 = !DILocation(line: 119, column: 7, scope: !825, inlinedAt: !822)
!834 = !DILocation(line: 267, column: 15, scope: !835)
!835 = distinct !DILexicalBlock(scope: !681, file: !3, line: 267, column: 7)
!836 = !DILocation(line: 267, column: 7, scope: !681)
!837 = !DILocation(line: 270, column: 20, scope: !838)
!838 = distinct !DILexicalBlock(scope: !839, file: !3, line: 270, column: 11)
!839 = distinct !DILexicalBlock(scope: !835, file: !3, line: 268, column: 5)
!840 = !DILocation(line: 270, column: 11, scope: !839)
!841 = !DILocation(line: 271, column: 9, scope: !838)
!842 = !DILocation(line: 271, column: 37, scope: !838)
!843 = !DILocation(line: 272, column: 7, scope: !839)
!844 = !DILocation(line: 276, column: 7, scope: !681)
!845 = !DILocation(line: 278, column: 11, scope: !709)
!846 = !DILocation(line: 280, column: 23, scope: !707)
!847 = !DILocation(line: 0, scope: !707)
!848 = !DILocation(line: 281, column: 15, scope: !849)
!849 = distinct !DILexicalBlock(scope: !707, file: !3, line: 281, column: 15)
!850 = !DILocation(line: 281, column: 19, scope: !849)
!851 = !DILocation(line: 281, column: 22, scope: !849)
!852 = !DILocation(line: 281, column: 15, scope: !707)
!853 = !DILocation(line: 283, column: 20, scope: !854)
!854 = distinct !DILexicalBlock(scope: !849, file: !3, line: 283, column: 20)
!855 = !DILocation(line: 283, column: 33, scope: !854)
!856 = !DILocation(line: 283, column: 36, scope: !854)
!857 = !DILocation(line: 283, column: 20, scope: !849)
!858 = !DILocation(line: 0, scope: !849)
!859 = !DILocation(line: 288, column: 15, scope: !860)
!860 = distinct !DILexicalBlock(scope: !707, file: !3, line: 288, column: 15)
!861 = !DILocation(line: 288, column: 41, scope: !860)
!862 = !DILocation(line: 288, column: 15, scope: !707)
!863 = !DILocation(line: 289, column: 13, scope: !860)
!864 = !DILocation(line: 295, column: 15, scope: !713)
!865 = !DILocation(line: 295, column: 28, scope: !713)
!866 = !DILocation(line: 295, column: 31, scope: !713)
!867 = !DILocation(line: 295, column: 15, scope: !714)
!868 = !DILocation(line: 299, column: 27, scope: !712)
!869 = !DILocation(line: 0, scope: !712)
!870 = !DILocation(line: 300, column: 27, scope: !712)
!871 = !DILocation(line: 300, column: 31, scope: !712)
!872 = !DILocation(line: 300, column: 34, scope: !712)
!873 = !DILocation(line: 0, scope: !713)
!874 = !DILocation(line: 302, column: 15, scope: !875)
!875 = distinct !DILexicalBlock(scope: !714, file: !3, line: 302, column: 15)
!876 = !DILocation(line: 302, column: 15, scope: !714)
!877 = !DILocation(line: 303, column: 13, scope: !875)
!878 = !DILocation(line: 0, scope: !708)
!879 = !DILocation(line: 309, column: 19, scope: !709)
!880 = !DILocation(line: 310, column: 7, scope: !709)
!881 = !DILocation(line: 313, column: 5, scope: !709)
!882 = !DILocation(line: 317, column: 15, scope: !681)
!883 = !DILocation(line: 0, scope: !717)
!884 = !DILocation(line: 319, column: 7, scope: !681)
!885 = !DILocalVariable(name: "tmpl", arg: 1, scope: !886, file: !3, line: 131, type: !22)
!886 = distinct !DISubprogram(name: "mkdtemp_len", scope: !3, file: !3, line: 131, type: !887, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!25, !22, !27, !27, !36}
!889 = !{!885, !890, !891, !892}
!890 = !DILocalVariable(name: "suff_len", arg: 2, scope: !886, file: !3, line: 131, type: !27)
!891 = !DILocalVariable(name: "x_len", arg: 3, scope: !886, file: !3, line: 131, type: !27)
!892 = !DILocalVariable(name: "dry_run", arg: 4, scope: !886, file: !3, line: 131, type: !36)
!893 = !DILocation(line: 0, scope: !886, inlinedAt: !894)
!894 = distinct !DILocation(line: 321, column: 17, scope: !716)
!895 = !DILocation(line: 133, column: 47, scope: !886, inlinedAt: !894)
!896 = !DILocation(line: 133, column: 10, scope: !886, inlinedAt: !894)
!897 = !DILocation(line: 0, scope: !716)
!898 = !DILocation(line: 322, column: 15, scope: !899)
!899 = distinct !DILexicalBlock(scope: !716, file: !3, line: 322, column: 11)
!900 = !DILocation(line: 322, column: 11, scope: !716)
!901 = !DILocation(line: 325, column: 13, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 324, column: 15)
!903 = distinct !DILexicalBlock(scope: !899, file: !3, line: 323, column: 9)
!904 = !DILocalVariable(name: "tmpl", arg: 1, scope: !905, file: !3, line: 124, type: !22)
!905 = distinct !DISubprogram(name: "mkstemp_len", scope: !3, file: !3, line: 124, type: !887, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !906)
!906 = !{!904, !907, !908, !909}
!907 = !DILocalVariable(name: "suff_len", arg: 2, scope: !905, file: !3, line: 124, type: !27)
!908 = !DILocalVariable(name: "x_len", arg: 3, scope: !905, file: !3, line: 124, type: !27)
!909 = !DILocalVariable(name: "dry_run", arg: 4, scope: !905, file: !3, line: 124, type: !36)
!910 = !DILocation(line: 0, scope: !905, inlinedAt: !911)
!911 = distinct !DILocation(line: 332, column: 16, scope: !719)
!912 = !DILocation(line: 126, column: 47, scope: !905, inlinedAt: !911)
!913 = !DILocation(line: 126, column: 10, scope: !905, inlinedAt: !911)
!914 = !DILocation(line: 0, scope: !719)
!915 = !DILocation(line: 333, column: 14, scope: !916)
!916 = distinct !DILexicalBlock(scope: !719, file: !3, line: 333, column: 11)
!917 = !DILocation(line: 333, column: 18, scope: !916)
!918 = !DILocation(line: 333, column: 31, scope: !916)
!919 = !DILocation(line: 344, column: 7, scope: !723)
!920 = !DILocation(line: 347, column: 20, scope: !722)
!921 = !DILocation(line: 333, column: 34, scope: !916)
!922 = !DILocation(line: 333, column: 45, scope: !916)
!923 = !DILocation(line: 333, column: 11, scope: !719)
!924 = !DILocation(line: 335, column: 15, scope: !925)
!925 = distinct !DILexicalBlock(scope: !916, file: !3, line: 334, column: 9)
!926 = !DILocation(line: 336, column: 13, scope: !927)
!927 = distinct !DILexicalBlock(scope: !925, file: !3, line: 335, column: 15)
!928 = !DILocation(line: 342, column: 7, scope: !681)
!929 = !DILocation(line: 347, column: 39, scope: !722)
!930 = !DILocation(line: 347, column: 62, scope: !722)
!931 = !DILocation(line: 347, column: 48, scope: !722)
!932 = !DILocation(line: 347, column: 70, scope: !722)
!933 = !DILocation(line: 347, column: 11, scope: !723)
!934 = !DILocation(line: 349, column: 29, scope: !721)
!935 = !DILocation(line: 0, scope: !721)
!936 = !DILocation(line: 350, column: 11, scope: !721)
!937 = !DILocation(line: 351, column: 15, scope: !721)
!938 = !DILocation(line: 352, column: 13, scope: !939)
!939 = distinct !DILexicalBlock(scope: !721, file: !3, line: 351, column: 15)
!940 = !DILocation(line: 358, column: 1, scope: !681)
!941 = !DISubprogram(name: "bindtextdomain", scope: !550, file: !550, line: 86, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!942 = !DISubroutineType(types: !943)
!943 = !{!22, !30, !30}
!944 = !DISubprogram(name: "textdomain", scope: !550, file: !550, line: 82, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!945 = distinct !DISubprogram(name: "maybe_close_stdout", scope: !3, file: !3, line: 145, type: !189, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!946 = !DILocation(line: 147, column: 8, scope: !947)
!947 = distinct !DILexicalBlock(scope: !945, file: !3, line: 147, column: 7)
!948 = !DILocation(line: 147, column: 7, scope: !945)
!949 = !DILocation(line: 148, column: 5, scope: !947)
!950 = !DILocation(line: 149, column: 26, scope: !951)
!951 = distinct !DILexicalBlock(scope: !947, file: !3, line: 149, column: 12)
!952 = !DILocation(line: 149, column: 12, scope: !951)
!953 = !DILocation(line: 149, column: 34, scope: !951)
!954 = !DILocation(line: 149, column: 12, scope: !947)
!955 = !DILocation(line: 150, column: 5, scope: !951)
!956 = !DILocation(line: 151, column: 1, scope: !945)
!957 = !DISubprogram(name: "atexit", scope: !672, file: !672, line: 602, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!958 = !DISubroutineType(types: !959)
!959 = !{!25, !188}
!960 = !DISubprogram(name: "getopt_long", scope: !128, file: !128, line: 66, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!961 = !DISubroutineType(types: !962)
!962 = !{!25, !25, !963, !30, !965, !133}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!966 = !DISubprogram(name: "puts", scope: !162, file: !162, line: 661, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!967 = !DISubroutineType(types: !968)
!968 = !{!25, !30}
!969 = !DISubprogram(name: "close", scope: !970, file: !970, line: 358, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!970 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!971 = !DISubroutineType(types: !972)
!972 = !{!25, !25}
!973 = !DISubprogram(name: "remove", scope: !162, file: !162, line: 152, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!974 = distinct !DISubprogram(name: "last_component", scope: !377, file: !377, line: 29, type: !673, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DILocalVariable(name: "name", arg: 1, scope: !974, file: !377, line: 29, type: !30)
!977 = !DILocalVariable(name: "base", scope: !974, file: !377, line: 31, type: !30)
!978 = !DILocalVariable(name: "last_was_slash", scope: !974, file: !377, line: 35, type: !36)
!979 = !DILocalVariable(name: "p", scope: !980, file: !377, line: 36, type: !30)
!980 = distinct !DILexicalBlock(scope: !974, file: !377, line: 36, column: 3)
!981 = !DILocation(line: 0, scope: !974)
!982 = !DILocation(line: 32, column: 3, scope: !974)
!983 = !DILocation(line: 32, column: 10, scope: !974)
!984 = !DILocation(line: 33, column: 9, scope: !974)
!985 = distinct !{!985, !982, !984, !527}
!986 = !DILocation(line: 36, column: 30, scope: !987)
!987 = distinct !DILexicalBlock(scope: !980, file: !377, line: 36, column: 3)
!988 = !DILocation(line: 31, column: 15, scope: !974)
!989 = !DILocation(line: 0, scope: !980)
!990 = !DILocation(line: 36, column: 3, scope: !980)
!991 = !DILocation(line: 47, column: 3, scope: !974)
!992 = !DILocation(line: 40, column: 16, scope: !993)
!993 = distinct !DILexicalBlock(scope: !994, file: !377, line: 38, column: 11)
!994 = distinct !DILexicalBlock(scope: !987, file: !377, line: 37, column: 5)
!995 = !DILocation(line: 36, column: 35, scope: !987)
!996 = !DILocation(line: 36, column: 3, scope: !987)
!997 = distinct !{!997, !990, !998, !527}
!998 = !DILocation(line: 45, column: 5, scope: !980)
!999 = distinct !DISubprogram(name: "base_len", scope: !377, file: !377, line: 51, type: !1000, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !376, retainedNodes: !1002)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!27, !30}
!1002 = !{!1003, !1004, !1005}
!1003 = !DILocalVariable(name: "name", arg: 1, scope: !999, file: !377, line: 51, type: !30)
!1004 = !DILocalVariable(name: "len", scope: !999, file: !377, line: 53, type: !27)
!1005 = !DILocalVariable(name: "prefix_len", scope: !999, file: !377, line: 61, type: !27)
!1006 = !DILocation(line: 0, scope: !999)
!1007 = !DILocation(line: 54, column: 14, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !999, file: !377, line: 54, column: 3)
!1009 = !DILocation(line: 54, column: 8, scope: !1008)
!1010 = !DILocation(line: 0, scope: !1008)
!1011 = !DILocation(line: 54, column: 32, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !377, line: 54, column: 3)
!1013 = !DILocation(line: 54, column: 38, scope: !1012)
!1014 = !DILocation(line: 54, column: 41, scope: !1012)
!1015 = !DILocation(line: 54, column: 3, scope: !1008)
!1016 = distinct !{!1016, !1015, !1017, !527}
!1017 = !DILocation(line: 55, column: 5, scope: !1008)
!1018 = !DILocation(line: 66, column: 3, scope: !999)
!1019 = distinct !DISubprogram(name: "close_stream", scope: !379, file: !379, line: 55, type: !1020, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1056)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!25, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 7, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 49, size: 1728, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1024, file: !66, line: 51, baseType: !25, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1024, file: !66, line: 54, baseType: !22, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1024, file: !66, line: 55, baseType: !22, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1024, file: !66, line: 56, baseType: !22, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1024, file: !66, line: 57, baseType: !22, size: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1024, file: !66, line: 58, baseType: !22, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1024, file: !66, line: 59, baseType: !22, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1024, file: !66, line: 60, baseType: !22, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1024, file: !66, line: 61, baseType: !22, size: 64, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1024, file: !66, line: 64, baseType: !22, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1024, file: !66, line: 65, baseType: !22, size: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1024, file: !66, line: 66, baseType: !22, size: 64, offset: 704)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1024, file: !66, line: 68, baseType: !81, size: 64, offset: 768)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1024, file: !66, line: 70, baseType: !1040, size: 64, offset: 832)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1024, file: !66, line: 72, baseType: !25, size: 32, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1024, file: !66, line: 73, baseType: !25, size: 32, offset: 928)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1024, file: !66, line: 74, baseType: !88, size: 64, offset: 960)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1024, file: !66, line: 77, baseType: !26, size: 16, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1024, file: !66, line: 78, baseType: !93, size: 8, offset: 1040)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1024, file: !66, line: 79, baseType: !95, size: 8, offset: 1048)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1024, file: !66, line: 81, baseType: !99, size: 64, offset: 1088)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1024, file: !66, line: 89, baseType: !102, size: 64, offset: 1152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1024, file: !66, line: 91, baseType: !104, size: 64, offset: 1216)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1024, file: !66, line: 92, baseType: !107, size: 64, offset: 1280)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1024, file: !66, line: 93, baseType: !1040, size: 64, offset: 1344)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1024, file: !66, line: 94, baseType: !24, size: 64, offset: 1408)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1024, file: !66, line: 95, baseType: !27, size: 64, offset: 1472)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1024, file: !66, line: 96, baseType: !25, size: 32, offset: 1536)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1024, file: !66, line: 98, baseType: !114, size: 160, offset: 1568)
!1056 = !{!1057, !1058, !1060, !1061}
!1057 = !DILocalVariable(name: "stream", arg: 1, scope: !1019, file: !379, line: 55, type: !1022)
!1058 = !DILocalVariable(name: "some_pending", scope: !1019, file: !379, line: 57, type: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!1060 = !DILocalVariable(name: "prev_fail", scope: !1019, file: !379, line: 58, type: !1059)
!1061 = !DILocalVariable(name: "fclose_fail", scope: !1019, file: !379, line: 59, type: !1059)
!1062 = !DILocation(line: 0, scope: !1019)
!1063 = !DILocation(line: 57, column: 30, scope: !1019)
!1064 = !DILocalVariable(name: "__stream", arg: 1, scope: !1065, file: !1066, line: 135, type: !1022)
!1065 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1066, file: !1066, line: 135, type: !1020, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1067)
!1066 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1067 = !{!1064}
!1068 = !DILocation(line: 0, scope: !1065, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 58, column: 27, scope: !1019)
!1070 = !DILocation(line: 137, column: 10, scope: !1065, inlinedAt: !1069)
!1071 = !{!1072, !562, i64 0}
!1072 = !{!"_IO_FILE", !562, i64 0, !468, i64 8, !468, i64 16, !468, i64 24, !468, i64 32, !468, i64 40, !468, i64 48, !468, i64 56, !468, i64 64, !468, i64 72, !468, i64 80, !468, i64 88, !468, i64 96, !468, i64 104, !562, i64 112, !562, i64 116, !1073, i64 120, !596, i64 128, !469, i64 130, !469, i64 131, !468, i64 136, !1073, i64 144, !468, i64 152, !468, i64 160, !468, i64 168, !468, i64 176, !1073, i64 184, !562, i64 192, !469, i64 196}
!1073 = !{!"long", !469, i64 0}
!1074 = !DILocation(line: 58, column: 43, scope: !1019)
!1075 = !DILocation(line: 59, column: 29, scope: !1019)
!1076 = !DILocation(line: 59, column: 45, scope: !1019)
!1077 = !DILocation(line: 69, column: 17, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1019, file: !379, line: 69, column: 7)
!1079 = !DILocation(line: 57, column: 50, scope: !1019)
!1080 = !DILocation(line: 69, column: 33, scope: !1078)
!1081 = !DILocation(line: 69, column: 53, scope: !1078)
!1082 = !DILocation(line: 69, column: 59, scope: !1078)
!1083 = !DILocation(line: 69, column: 7, scope: !1019)
!1084 = !DILocation(line: 71, column: 11, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1078, file: !379, line: 70, column: 5)
!1086 = !DILocation(line: 72, column: 9, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1085, file: !379, line: 71, column: 11)
!1088 = !DILocation(line: 72, column: 15, scope: !1087)
!1089 = !DILocation(line: 77, column: 1, scope: !1019)
!1090 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !146, file: !146, line: 50, type: !486, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !145, retainedNodes: !1091)
!1091 = !{!1092}
!1092 = !DILocalVariable(name: "file", arg: 1, scope: !1090, file: !146, line: 50, type: !30)
!1093 = !DILocation(line: 0, scope: !1090)
!1094 = !DILocation(line: 52, column: 13, scope: !1090)
!1095 = !DILocation(line: 53, column: 1, scope: !1090)
!1096 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !146, file: !146, line: 87, type: !1097, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !145, retainedNodes: !1099)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !36}
!1099 = !{!1100}
!1100 = !DILocalVariable(name: "ignore", arg: 1, scope: !1096, file: !146, line: 87, type: !36)
!1101 = !DILocation(line: 0, scope: !1096)
!1102 = !DILocation(line: 89, column: 16, scope: !1096)
!1103 = !{!1104, !1104, i64 0}
!1104 = !{!"_Bool", !469, i64 0}
!1105 = !DILocation(line: 90, column: 1, scope: !1096)
!1106 = distinct !DISubprogram(name: "close_stdout", scope: !146, file: !146, line: 116, type: !189, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !145, retainedNodes: !1107)
!1107 = !{!1108}
!1108 = !DILocalVariable(name: "write_error", scope: !1109, file: !146, line: 121, type: !30)
!1109 = distinct !DILexicalBlock(scope: !1110, file: !146, line: 120, column: 5)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !146, line: 118, column: 7)
!1111 = !DILocation(line: 118, column: 21, scope: !1110)
!1112 = !DILocation(line: 118, column: 7, scope: !1110)
!1113 = !DILocation(line: 118, column: 29, scope: !1110)
!1114 = !DILocation(line: 119, column: 7, scope: !1110)
!1115 = !DILocation(line: 119, column: 12, scope: !1110)
!1116 = !{i8 0, i8 2}
!1117 = !DILocation(line: 119, column: 25, scope: !1110)
!1118 = !DILocation(line: 119, column: 28, scope: !1110)
!1119 = !DILocation(line: 119, column: 34, scope: !1110)
!1120 = !DILocation(line: 118, column: 7, scope: !1106)
!1121 = !DILocation(line: 121, column: 33, scope: !1109)
!1122 = !DILocation(line: 0, scope: !1109)
!1123 = !DILocation(line: 122, column: 11, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1109, file: !146, line: 122, column: 11)
!1125 = !DILocation(line: 0, scope: !1124)
!1126 = !DILocation(line: 122, column: 11, scope: !1109)
!1127 = !DILocation(line: 123, column: 9, scope: !1124)
!1128 = !DILocation(line: 126, column: 9, scope: !1124)
!1129 = !DILocation(line: 128, column: 14, scope: !1109)
!1130 = !DILocation(line: 128, column: 7, scope: !1109)
!1131 = !DILocation(line: 133, column: 42, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1106, file: !146, line: 133, column: 7)
!1133 = !DILocation(line: 133, column: 28, scope: !1132)
!1134 = !DILocation(line: 133, column: 50, scope: !1132)
!1135 = !DILocation(line: 133, column: 7, scope: !1106)
!1136 = !DILocation(line: 134, column: 12, scope: !1132)
!1137 = !DILocation(line: 134, column: 5, scope: !1132)
!1138 = !DILocation(line: 135, column: 1, scope: !1106)
!1139 = distinct !DISubprogram(name: "verror", scope: !153, file: !153, line: 251, type: !1140, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !1142)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !25, !25, !30, !161}
!1142 = !{!1143, !1144, !1145, !1146}
!1143 = !DILocalVariable(name: "status", arg: 1, scope: !1139, file: !153, line: 251, type: !25)
!1144 = !DILocalVariable(name: "errnum", arg: 2, scope: !1139, file: !153, line: 251, type: !25)
!1145 = !DILocalVariable(name: "message", arg: 3, scope: !1139, file: !153, line: 251, type: !30)
!1146 = !DILocalVariable(name: "args", arg: 4, scope: !1139, file: !153, line: 251, type: !161)
!1147 = !DILocation(line: 0, scope: !1139)
!1148 = !DILocation(line: 251, column: 1, scope: !1139)
!1149 = !DILocation(line: 261, column: 3, scope: !1139)
!1150 = !DILocation(line: 265, column: 7, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1139, file: !153, line: 265, column: 7)
!1152 = !DILocation(line: 265, column: 7, scope: !1139)
!1153 = !DILocation(line: 266, column: 5, scope: !1151)
!1154 = !DILocation(line: 272, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !153, line: 268, column: 5)
!1156 = !DILocation(line: 276, column: 3, scope: !1139)
!1157 = !{i64 0, i64 8, !467, i64 8, i64 8, !467, i64 16, i64 8, !467, i64 24, i64 4, !561, i64 28, i64 4, !561}
!1158 = !DILocation(line: 282, column: 1, scope: !1139)
!1159 = distinct !DISubprogram(name: "flush_stdout", scope: !153, file: !153, line: 163, type: !189, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !1160)
!1160 = !{!1161}
!1161 = !DILocalVariable(name: "stdout_fd", scope: !1159, file: !153, line: 166, type: !25)
!1162 = !DILocation(line: 0, scope: !1159)
!1163 = !DILocalVariable(name: "fd", arg: 1, scope: !1164, file: !153, line: 145, type: !25)
!1164 = distinct !DISubprogram(name: "is_open", scope: !153, file: !153, line: 145, type: !971, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !1165)
!1165 = !{!1163}
!1166 = !DILocation(line: 0, scope: !1164, inlinedAt: !1167)
!1167 = distinct !DILocation(line: 182, column: 25, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1159, file: !153, line: 182, column: 7)
!1169 = !DILocation(line: 157, column: 15, scope: !1164, inlinedAt: !1167)
!1170 = !DILocation(line: 182, column: 25, scope: !1168)
!1171 = !DILocation(line: 182, column: 7, scope: !1159)
!1172 = !DILocation(line: 184, column: 5, scope: !1168)
!1173 = !DILocation(line: 185, column: 1, scope: !1159)
!1174 = distinct !DISubprogram(name: "error_tail", scope: !153, file: !153, line: 219, type: !1140, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !1175)
!1175 = !{!1176, !1177, !1178, !1179}
!1176 = !DILocalVariable(name: "status", arg: 1, scope: !1174, file: !153, line: 219, type: !25)
!1177 = !DILocalVariable(name: "errnum", arg: 2, scope: !1174, file: !153, line: 219, type: !25)
!1178 = !DILocalVariable(name: "message", arg: 3, scope: !1174, file: !153, line: 219, type: !30)
!1179 = !DILocalVariable(name: "args", arg: 4, scope: !1174, file: !153, line: 219, type: !161)
!1180 = !DILocation(line: 0, scope: !1174)
!1181 = !DILocation(line: 219, column: 1, scope: !1174)
!1182 = !DILocation(line: 229, column: 13, scope: !1174)
!1183 = !DILocation(line: 229, column: 3, scope: !1174)
!1184 = !DILocalVariable(name: "__stream", arg: 1, scope: !1185, file: !1186, line: 132, type: !1189)
!1185 = distinct !DISubprogram(name: "vfprintf", scope: !1186, file: !1186, line: 132, type: !1187, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !152, retainedNodes: !1224)
!1186 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!25, !1189, !557, !163}
!1189 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 7, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 49, size: 1728, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1192, file: !66, line: 51, baseType: !25, size: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1192, file: !66, line: 54, baseType: !22, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1192, file: !66, line: 55, baseType: !22, size: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1192, file: !66, line: 56, baseType: !22, size: 64, offset: 192)
