; ModuleID = 'src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.timespec = type { i64, i64 }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.fs_res = type { i64, i32, i8 }
%struct.__mbstate_t = type { i32, %union.anon.87 }
%union.anon.87 = type { i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.selabel_handle*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, %struct.hash_table*, %struct.hash_table* }

!65 = !DIEnumerator(name: "_ISspace", value: 8192)
!66 = !DIEnumerator(name: "_ISprint", value: 16384)
!67 = !DIEnumerator(name: "_ISgraph", value: 32768)
!68 = !DIEnumerator(name: "_ISblank", value: 1)
!69 = !DIEnumerator(name: "_IScntrl", value: 2)
!70 = !DIEnumerator(name: "_ISpunct", value: 4)
!71 = !DIEnumerator(name: "_ISalnum", value: 8)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rm_interactive", file: !73, line: 23, baseType: !7, size: 32, elements: !74)
!73 = !DIFile(filename: "src/remove.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fc0a0c88faec8481849ad8f08e777d96")
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "RMI_ALWAYS", value: 3)
!76 = !DIEnumerator(name: "RMI_SOMETIMES", value: 4)
!77 = !DIEnumerator(name: "RMI_NEVER", value: 5)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RM_status", file: !73, line: 78, baseType: !7, size: 32, elements: !79)
!79 = !{!80, !81, !82, !83, !84}
!80 = !DIEnumerator(name: "RM_OK", value: 2)
!81 = !DIEnumerator(name: "RM_USER_ACCEPTED", value: 3)
!82 = !DIEnumerator(name: "RM_USER_DECLINED", value: 4)
!83 = !DIEnumerator(name: "RM_ERROR", value: 5)
!84 = !DIEnumerator(name: "RM_NONEMPTY_DIR", value: 6)
!85 = !{!86, !88, !90, !91, !92, !93, !96, !98, !99}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!95 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !101, line: 53, flags: DIFlagFwdDecl)
!101 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!102 = !{!103, !0, !190, !196, !202}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !105, file: !106, line: 575, type: !91, isLocal: true, isDefinition: true)
!105 = distinct !DISubprogram(name: "oputs_", scope: !106, file: !106, line: 573, type: !107, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !109)
!106 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!107 = !DISubroutineType(types: !108)
!108 = !{null, !96, !96}
!109 = !{!110, !111, !112, !115, !117, !118, !119, !123, !124, !125, !126, !128, !184, !185, !186, !188, !189}
!110 = !DILocalVariable(name: "program", arg: 1, scope: !105, file: !106, line: 573, type: !96)
!111 = !DILocalVariable(name: "option", arg: 2, scope: !105, file: !106, line: 573, type: !96)
!112 = !DILocalVariable(name: "term", scope: !113, file: !106, line: 585, type: !96)
!113 = distinct !DILexicalBlock(scope: !114, file: !106, line: 582, column: 5)
!114 = distinct !DILexicalBlock(scope: !105, file: !106, line: 581, column: 7)
!115 = !DILocalVariable(name: "double_space", scope: !105, file: !106, line: 594, type: !116)
!116 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!117 = !DILocalVariable(name: "first_word", scope: !105, file: !106, line: 595, type: !96)
!118 = !DILocalVariable(name: "option_text", scope: !105, file: !106, line: 596, type: !96)
!119 = !DILocalVariable(name: "s", scope: !120, file: !106, line: 608, type: !96)
!120 = distinct !DILexicalBlock(scope: !121, file: !106, line: 605, column: 5)
!121 = distinct !DILexicalBlock(scope: !122, file: !106, line: 604, column: 12)
!122 = distinct !DILexicalBlock(scope: !105, file: !106, line: 597, column: 7)
!123 = !DILocalVariable(name: "spaces", scope: !120, file: !106, line: 609, type: !93)
!124 = !DILocalVariable(name: "anchor_len", scope: !105, file: !106, line: 620, type: !93)
!125 = !DILocalVariable(name: "desc_text", scope: !105, file: !106, line: 625, type: !96)
!126 = !DILocalVariable(name: "__ptr", scope: !127, file: !106, line: 644, type: !96)
!127 = distinct !DILexicalBlock(scope: !105, file: !106, line: 644, column: 3)
!128 = !DILocalVariable(name: "__stream", scope: !127, file: !106, line: 644, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !131, line: 7, baseType: !132)
!131 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !133, line: 49, size: 1728, elements: !134)
!133 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !150, !152, !153, !154, !158, !159, !161, !165, !168, !170, !173, !176, !177, !178, !179, !180}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !132, file: !133, line: 51, baseType: !91, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !132, file: !133, line: 54, baseType: !88, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !132, file: !133, line: 55, baseType: !88, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !132, file: !133, line: 56, baseType: !88, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !132, file: !133, line: 57, baseType: !88, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !132, file: !133, line: 58, baseType: !88, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !132, file: !133, line: 59, baseType: !88, size: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !132, file: !133, line: 60, baseType: !88, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !132, file: !133, line: 61, baseType: !88, size: 64, offset: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !132, file: !133, line: 64, baseType: !88, size: 64, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !132, file: !133, line: 65, baseType: !88, size: 64, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !132, file: !133, line: 66, baseType: !88, size: 64, offset: 704)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !132, file: !133, line: 68, baseType: !148, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !133, line: 36, flags: DIFlagFwdDecl)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !132, file: !133, line: 70, baseType: !151, size: 64, offset: 832)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !132, file: !133, line: 72, baseType: !91, size: 32, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !132, file: !133, line: 73, baseType: !91, size: 32, offset: 928)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !132, file: !133, line: 74, baseType: !155, size: 64, offset: 960)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !156, line: 152, baseType: !157)
!156 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!157 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !132, file: !133, line: 77, baseType: !92, size: 16, offset: 1024)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !132, file: !133, line: 78, baseType: !160, size: 8, offset: 1040)
!160 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !132, file: !133, line: 79, baseType: !162, size: 8, offset: 1048)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 8, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 1)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !132, file: !133, line: 81, baseType: !166, size: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !133, line: 43, baseType: null)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !132, file: !133, line: 89, baseType: !169, size: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !156, line: 153, baseType: !157)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !132, file: !133, line: 91, baseType: !171, size: 64, offset: 1216)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !133, line: 37, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !132, file: !133, line: 92, baseType: !174, size: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !133, line: 38, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !132, file: !133, line: 93, baseType: !151, size: 64, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !132, file: !133, line: 94, baseType: !90, size: 64, offset: 1408)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !132, file: !133, line: 95, baseType: !93, size: 64, offset: 1472)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !132, file: !133, line: 96, baseType: !91, size: 32, offset: 1536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !132, file: !133, line: 98, baseType: !181, size: 160, offset: 1568)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 160, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 20)
!184 = !DILocalVariable(name: "__cnt", scope: !127, file: !106, line: 644, type: !93)
!185 = !DILocalVariable(name: "url_program", scope: !105, file: !106, line: 648, type: !96)
!186 = !DILocalVariable(name: "__ptr", scope: !187, file: !106, line: 686, type: !96)
!187 = distinct !DILexicalBlock(scope: !105, file: !106, line: 686, column: 3)
!188 = !DILocalVariable(name: "__stream", scope: !187, file: !106, line: 686, type: !129)
!189 = !DILocalVariable(name: "__cnt", scope: !187, file: !106, line: 686, type: !93)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "update_type", scope: !2, file: !3, line: 60, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 128, elements: !194)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!194 = !{!195}
!195 = !DISubrange(count: 4)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "update_type_string", scope: !2, file: !3, line: 56, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 320, elements: !200)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!200 = !{!201}
!201 = !DISubrange(count: 5)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !204, file: !3, line: 110, type: !217, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "rm_option_init", scope: !3, file: !3, line: 89, type: !205, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !231)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !73, line: 32, size: 256, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !227, !228, !229, !230}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !208, file: !73, line: 35, baseType: !116, size: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !208, file: !73, line: 38, baseType: !72, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !208, file: !73, line: 47, baseType: !116, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !208, file: !73, line: 50, baseType: !116, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !208, file: !73, line: 53, baseType: !116, size: 8, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !208, file: !73, line: 57, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !218, line: 30, size: 128, elements: !219)
!218 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!219 = !{!220, !224}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !217, file: !218, line: 32, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !222, line: 47, baseType: !223)
!222 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !156, line: 148, baseType: !95)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !217, file: !218, line: 33, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !222, line: 59, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !156, line: 145, baseType: !95)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !208, file: !73, line: 61, baseType: !116, size: 8, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !208, file: !73, line: 64, baseType: !116, size: 8, offset: 200)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !208, file: !73, line: 67, baseType: !116, size: 8, offset: 208)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !208, file: !73, line: 75, baseType: !116, size: 8, offset: 216)
!231 = !{!232}
!232 = !DILocalVariable(name: "x", arg: 1, scope: !204, file: !3, line: 89, type: !207)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !234, size: 4352, elements: !243)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !236, line: 50, size: 256, elements: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!237 = !{!238, !239, !240, !242}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !236, line: 52, baseType: !96, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !235, file: !236, line: 55, baseType: !91, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !235, file: !236, line: 56, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !235, file: !236, line: 57, baseType: !91, size: 32, offset: 192)
!243 = !{!244}
!244 = !DISubrange(count: 17)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !247, file: !248, line: 128, type: !96, isLocal: true, isDefinition: true)
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !249, retainedTypes: !270, globals: !271, splitDebugInlining: false, nameTableKind: None)
!248 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!249 = !{!5, !13, !20, !26, !32, !38, !43, !250, !254, !261}
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !251, line: 32, baseType: !7, size: 32, elements: !252)
!251 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!252 = !{!253}
!253 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !255, line: 37, baseType: !7, size: 32, elements: !256)
!255 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!256 = !{!257, !258, !259, !260}
!257 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!258 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!259 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!260 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !14, line: 305, baseType: !7, size: 32, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269}
!263 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!264 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!265 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!266 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!267 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!268 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!269 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!270 = !{!7, !90, !95, !98}
!271 = !{!272, !280, !245, !282, !284}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "mask", scope: !274, file: !248, line: 2890, type: !277, isLocal: true, isDefinition: true)
!274 = distinct !DISubprogram(name: "cached_umask", scope: !248, file: !248, line: 2888, type: !275, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !279)
!275 = !DISubroutineType(types: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !222, line: 69, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !156, line: 150, baseType: !7)
!279 = !{}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "cached", scope: !274, file: !248, line: 2891, type: !116, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !247, file: !248, line: 129, type: !96, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "copy_debug", scope: !247, file: !248, line: 132, type: !286, isLocal: true, isDefinition: true)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !14, line: 317, size: 96, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !286, file: !14, line: 319, baseType: !261, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !286, file: !14, line: 320, baseType: !261, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !286, file: !14, line: 321, baseType: !261, size: 32, offset: 64)
!291 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !294, file: !295, line: 45, type: !301, isLocal: true, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !296, globals: !300, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!296 = !{!90, !88, !297}
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !298, line: 102, baseType: !299)
!298 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !156, line: 73, baseType: !95)
!300 = !{!292}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !303, line: 56, baseType: !304)
!303 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !303, line: 54, flags: DIFlagFwdDecl)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !307, file: !308, line: 38, type: !317, isLocal: true, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, globals: !316, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!309 = !{!310, !313}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !308, line: 39, baseType: !7, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIEnumerator(name: "x_suffix_len", value: 6)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !308, line: 44, baseType: !7, size: 32, elements: !314)
!314 = !{!315}
!315 = !DIEnumerator(name: "smallsize", value: 256)
!316 = !{!305}
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 72, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 9)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "Version", scope: !322, file: !323, line: 3, type: !96, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!324 = !{!320}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !327, file: !328, line: 77, type: !96, isLocal: false, isDefinition: true)
!327 = distinct !DICompileUnit(language: DW_LANG_C99, file: !328, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !329, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!328 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!329 = !{!5, !330, !362, !368}
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !331, file: !328, line: 325, baseType: !7, size: 32, elements: !360)
!331 = distinct !DISubprogram(name: "backupfile_internal", scope: !328, file: !328, line: 312, type: !332, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !327, retainedNodes: !334)
!332 = !DISubroutineType(types: !333)
!333 = !{!88, !91, !96, !5, !116}
!334 = !{!335, !336, !337, !338, !339, !343, !344, !345, !346, !347, !348, !353, !354, !355, !357, !358, !359}
!335 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !331, file: !328, line: 312, type: !91)
!336 = !DILocalVariable(name: "file", arg: 2, scope: !331, file: !328, line: 312, type: !96)
!337 = !DILocalVariable(name: "backup_type", arg: 3, scope: !331, file: !328, line: 313, type: !5)
!338 = !DILocalVariable(name: "rename", arg: 4, scope: !331, file: !328, line: 313, type: !116)
!339 = !DILocalVariable(name: "base_offset", scope: !331, file: !328, line: 315, type: !340)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !341, line: 130, baseType: !342)
!341 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !94, line: 35, baseType: !157)
!343 = !DILocalVariable(name: "filelen", scope: !331, file: !328, line: 316, type: !340)
!344 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !331, file: !328, line: 323, type: !340)
!345 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !331, file: !328, line: 324, type: !340)
!346 = !DILocalVariable(name: "ssize", scope: !331, file: !328, line: 329, type: !340)
!347 = !DILocalVariable(name: "s", scope: !331, file: !328, line: 330, type: !88)
!348 = !DILocalVariable(name: "dirp", scope: !331, file: !328, line: 334, type: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !351, line: 127, baseType: !352)
!351 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !351, line: 127, flags: DIFlagFwdDecl)
!353 = !DILocalVariable(name: "sdir", scope: !331, file: !328, line: 335, type: !91)
!354 = !DILocalVariable(name: "base_max", scope: !331, file: !328, line: 336, type: !340)
!355 = !DILocalVariable(name: "extended", scope: !356, file: !328, line: 339, type: !116)
!356 = distinct !DILexicalBlock(scope: !331, file: !328, line: 338, column: 5)
!357 = !DILocalVariable(name: "offset", scope: !356, file: !328, line: 375, type: !340)
!358 = !DILocalVariable(name: "flags", scope: !356, file: !328, line: 376, type: !7)
!359 = !DILocalVariable(name: "saved_errno", scope: !356, file: !328, line: 379, type: !91)
!360 = !{!361}
!361 = !DIEnumerator(name: "GUESS", value: 9)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !328, line: 171, baseType: !7, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!365 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!366 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!367 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 24, baseType: !7, size: 32, elements: !370)
!369 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!371 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!372 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!373 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!374 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!375 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!376 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!377 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!378 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!379 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!380 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!381 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!382 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!383 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!384 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!385 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!386 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!387 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!388 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!389 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!390 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!391 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!392 = !{!90, !7, !116}
!393 = !{!325}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "backup_types", scope: !396, file: !397, line: 53, type: !404, isLocal: true, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !399, globals: !400, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!398 = !{!5}
!399 = !{!90, !86}
!400 = !{!394, !401}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "backup_args", scope: !396, file: !397, line: 42, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 576, elements: !318)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 256, elements: !406)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!406 = !{!407}
!407 = !DISubrange(count: 8)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !410, file: !411, line: 65, type: !415, isLocal: false, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !412, retainedTypes: !413, globals: !414, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!412 = !{!43}
!413 = !{!90, !96, !98}
!414 = !{!408}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !416, line: 69, baseType: !417)
!416 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{null}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "file_name", scope: !422, file: !423, line: 36, type: !96, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !424, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!424 = !{!420}
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "file_name", scope: !427, file: !428, line: 45, type: !96, isLocal: true, isDefinition: true)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !429, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!429 = !{!425, !430}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !427, file: !428, line: 55, type: !116, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !434, file: !435, line: 66, type: !417, isLocal: false, isDefinition: true)
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !436, globals: !437, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!436 = !{!90, !98}
!437 = !{!438, !464, !432, !466, !468}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "old_file_name", scope: !440, file: !435, line: 304, type: !96, isLocal: true, isDefinition: true)
!440 = distinct !DISubprogram(name: "verror_at_line", scope: !435, file: !435, line: 298, type: !441, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !434, retainedNodes: !457)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !91, !91, !96, !7, !96, !443}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !444, line: 52, baseType: !445)
!444 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !446, line: 32, baseType: !447)
!446 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !448, baseType: !449)
!448 = !DIFile(filename: "lib/error.c", directory: "/src")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !450, size: 256, elements: !451)
!450 = !DINamespace(name: "std", scope: null)
!451 = !{!452, !453, !454, !455, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !449, file: !448, baseType: !90, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !449, file: !448, baseType: !90, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !449, file: !448, baseType: !90, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !449, file: !448, baseType: !91, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !449, file: !448, baseType: !91, size: 32, offset: 224)
!457 = !{!458, !459, !460, !461, !462, !463}
!458 = !DILocalVariable(name: "status", arg: 1, scope: !440, file: !435, line: 298, type: !91)
!459 = !DILocalVariable(name: "errnum", arg: 2, scope: !440, file: !435, line: 298, type: !91)
!460 = !DILocalVariable(name: "file_name", arg: 3, scope: !440, file: !435, line: 298, type: !96)
!461 = !DILocalVariable(name: "line_number", arg: 4, scope: !440, file: !435, line: 298, type: !7)
!462 = !DILocalVariable(name: "message", arg: 5, scope: !440, file: !435, line: 298, type: !96)
!463 = !DILocalVariable(name: "args", arg: 6, scope: !440, file: !435, line: 298, type: !443)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "old_line_number", scope: !440, file: !435, line: 305, type: !7, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_message_count", scope: !434, file: !435, line: 69, type: !7, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !434, file: !435, line: 295, type: !91, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "default_tuning", scope: !472, file: !473, line: 134, type: !477, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, globals: !476, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!474 = !{!95, !90, !475, !93}
!475 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!476 = !{!470}
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !303, line: 52, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !303, line: 40, size: 160, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !479, file: !303, line: 45, baseType: !475, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !479, file: !303, line: 46, baseType: !475, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !479, file: !303, line: 47, baseType: !475, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !479, file: !303, line: 48, baseType: !475, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !479, file: !303, line: 49, baseType: !116, size: 8, offset: 128)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "program_name", scope: !488, file: !489, line: 31, type: !96, isLocal: false, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, globals: !491, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!490 = !{!88}
!491 = !{!486}
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "utf07FF", scope: !494, file: !495, line: 46, type: !523, isLocal: true, isDefinition: true)
!494 = distinct !DISubprogram(name: "proper_name_lite", scope: !495, file: !495, line: 38, type: !496, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !498, retainedNodes: !500)
!495 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!496 = !DISubroutineType(types: !497)
!497 = !{!96, !96, !96}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !499, splitDebugInlining: false, nameTableKind: None)
!499 = !{!492}
!500 = !{!501, !502, !503, !504, !509}
!501 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !494, file: !495, line: 38, type: !96)
!502 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !494, file: !495, line: 38, type: !96)
!503 = !DILocalVariable(name: "translation", scope: !494, file: !495, line: 40, type: !96)
!504 = !DILocalVariable(name: "w", scope: !494, file: !495, line: 47, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !506, line: 37, baseType: !507)
!506 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !156, line: 57, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !156, line: 42, baseType: !7)
!509 = !DILocalVariable(name: "mbs", scope: !494, file: !495, line: 48, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !512)
!511 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !514)
!513 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !514, file: !513, line: 15, baseType: !91, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !514, file: !513, line: 20, baseType: !518, size: 32, offset: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !513, line: 16, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !518, file: !513, line: 18, baseType: !7, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !518, file: !513, line: 19, baseType: !522, size: 32)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !194)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 2)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !528, file: !529, line: 76, type: !595, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, retainedTypes: !536, globals: !537, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!530 = !{!43, !531, !57}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !44, line: 254, baseType: !7, size: 32, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!534 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!535 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!536 = !{!91, !92, !93}
!537 = !{!526, !538, !544, !554, !556, !561, !584, !591, !593}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !528, file: !529, line: 92, type: !540, isLocal: false, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !528, file: !529, line: 1040, type: !546, isLocal: false, isDefinition: true)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !529, line: 56, size: 448, elements: !547)
!547 = !{!548, !549, !550, !552, !553}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !546, file: !529, line: 59, baseType: !43, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !529, line: 62, baseType: !91, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !546, file: !529, line: 66, baseType: !551, size: 256, offset: 64)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !406)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !546, file: !529, line: 69, baseType: !96, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !546, file: !529, line: 72, baseType: !96, size: 64, offset: 384)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !528, file: !529, line: 107, type: !546, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "slot0", scope: !528, file: !529, line: 831, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2048, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 256)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "quote", scope: !563, file: !529, line: 228, type: !582, isLocal: true, isDefinition: true)
!563 = distinct !DISubprogram(name: "gettext_quote", scope: !529, file: !529, line: 197, type: !564, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !528, retainedNodes: !566)
!564 = !DISubroutineType(types: !565)
!565 = !{!96, !96, !43}
!566 = !{!567, !568, !569, !570, !571}
!567 = !DILocalVariable(name: "msgid", arg: 1, scope: !563, file: !529, line: 197, type: !96)
!568 = !DILocalVariable(name: "s", arg: 2, scope: !563, file: !529, line: 197, type: !43)
!569 = !DILocalVariable(name: "translation", scope: !563, file: !529, line: 199, type: !96)
!570 = !DILocalVariable(name: "w", scope: !563, file: !529, line: 229, type: !505)
!571 = !DILocalVariable(name: "mbs", scope: !563, file: !529, line: 230, type: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !574, file: !513, line: 15, baseType: !91, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !574, file: !513, line: 20, baseType: !578, size: 32, offset: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !574, file: !513, line: 16, size: 32, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !578, file: !513, line: 18, baseType: !7, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !578, file: !513, line: 19, baseType: !522, size: 32)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 64, elements: !583)
!583 = !{!525, !195}
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "slotvec", scope: !528, file: !529, line: 834, type: !586, isLocal: true, isDefinition: true)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !529, line: 823, size: 128, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !529, line: 825, baseType: !93, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !587, file: !529, line: 826, baseType: !88, size: 64, offset: 64)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "nslots", scope: !528, file: !529, line: 832, type: !91, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "slotvec0", scope: !528, file: !529, line: 833, type: !587, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 704, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 11)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "comparison_function_table", scope: !600, file: !601, line: 88, type: !605, isLocal: true, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !602, retainedTypes: !603, globals: !604, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/savedir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02eab3775a03291323b0c9a53bf5293b")
!602 = !{!254}
!603 = !{!90}
!604 = !{!598}
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 192, elements: !611)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "comparison_function", file: !601, line: 86, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!91, !86, !86, !90}
!611 = !{!612}
!612 = !DISubrange(count: 3)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "tryfunc", scope: !615, file: !616, line: 175, type: !632, isLocal: true, isDefinition: true)
!615 = distinct !DISubprogram(name: "gen_tempname_len", scope: !616, file: !616, line: 172, type: !617, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !626)
!616 = !DIFile(filename: "lib/tempname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "89467f8095ceec51ae791cc96ec80d48")
!617 = !DISubroutineType(types: !618)
!618 = !{!91, !88, !91, !91, !91, !93}
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !620, splitDebugInlining: false, nameTableKind: None)
!620 = !{!613, !621}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "letters", scope: !619, file: !616, line: 151, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 504, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 63)
!626 = !{!627, !628, !629, !630, !631}
!627 = !DILocalVariable(name: "tmpl", arg: 1, scope: !615, file: !616, line: 172, type: !88)
!628 = !DILocalVariable(name: "suffixlen", arg: 2, scope: !615, file: !616, line: 172, type: !91)
!629 = !DILocalVariable(name: "flags", arg: 3, scope: !615, file: !616, line: 172, type: !91)
!630 = !DILocalVariable(name: "kind", arg: 4, scope: !615, file: !616, line: 172, type: !91)
!631 = !DILocalVariable(name: "x_suffix_len", arg: 5, scope: !615, file: !616, line: 173, type: !93)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 192, elements: !611)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!91, !88, !90}
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "ht", scope: !639, file: !640, line: 171, type: !301, isLocal: true, isDefinition: true)
!639 = distinct !DISubprogram(name: "utimecmpat", scope: !640, file: !640, line: 129, type: !641, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !691)
!640 = !DIFile(filename: "lib/utimecmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b33c342642dbf94e8e18e40dfff270d9")
!641 = !DISubroutineType(types: !642)
!642 = !{!91, !91, !96, !643, !643, !91}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !646, line: 44, size: 1024, elements: !647)
!646 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!647 = !{!648, !649, !650, !651, !653, !655, !657, !658, !659, !660, !662, !663, !665, !673, !674, !675}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !645, file: !646, line: 46, baseType: !226, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !645, file: !646, line: 47, baseType: !223, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !645, file: !646, line: 48, baseType: !278, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !645, file: !646, line: 49, baseType: !652, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !156, line: 151, baseType: !7)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !645, file: !646, line: 50, baseType: !654, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !156, line: 146, baseType: !7)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !645, file: !646, line: 51, baseType: !656, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !156, line: 147, baseType: !7)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !645, file: !646, line: 52, baseType: !226, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !645, file: !646, line: 53, baseType: !226, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !645, file: !646, line: 54, baseType: !155, size: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !645, file: !646, line: 55, baseType: !661, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !156, line: 175, baseType: !91)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !645, file: !646, line: 56, baseType: !91, size: 32, offset: 480)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !645, file: !646, line: 57, baseType: !664, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !156, line: 180, baseType: !157)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !645, file: !646, line: 65, baseType: !666, size: 128, offset: 576)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !667, line: 11, size: 128, elements: !668)
!667 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!668 = !{!669, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !666, file: !667, line: 16, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !156, line: 160, baseType: !157)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !666, file: !667, line: 21, baseType: !672, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !156, line: 197, baseType: !157)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !645, file: !646, line: 66, baseType: !666, size: 128, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !645, file: !646, line: 67, baseType: !666, size: 128, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !645, file: !646, line: 79, baseType: !676, size: 64, offset: 960)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !524)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !678, globals: !682, splitDebugInlining: false, nameTableKind: None)
!678 = !{!250, !679}
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !640, line: 47, baseType: !7, size: 32, elements: !680)
!680 = !{!681}
!681 = !DIEnumerator(name: "SYSCALL_RESOLUTION", value: 1)
!682 = !{!637, !683}
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "new_dst_res", scope: !639, file: !640, line: 174, type: !685, isLocal: true, isDefinition: true)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_res", file: !640, line: 63, size: 128, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !686, file: !640, line: 66, baseType: !225, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !686, file: !640, line: 73, baseType: !91, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exact", scope: !686, file: !640, line: 77, baseType: !116, size: 8, offset: 96)
!691 = !{!692, !693, !694, !695, !696, !697, !700, !701, !702, !703, !706, !707, !708, !711, !712, !713, !714, !715, !716, !718, !721, !722, !723, !724, !728, !730, !731, !733, !735, !736}
!692 = !DILocalVariable(name: "dfd", arg: 1, scope: !639, file: !640, line: 129, type: !91)
!693 = !DILocalVariable(name: "dst_name", arg: 2, scope: !639, file: !640, line: 129, type: !96)
!694 = !DILocalVariable(name: "dst_stat", arg: 3, scope: !639, file: !640, line: 130, type: !643)
!695 = !DILocalVariable(name: "src_stat", arg: 4, scope: !639, file: !640, line: 131, type: !643)
!696 = !DILocalVariable(name: "options", arg: 5, scope: !639, file: !640, line: 132, type: !91)
!697 = !DILocalVariable(name: "dst_s", scope: !639, file: !640, line: 150, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !699, line: 10, baseType: !670)
!699 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!700 = !DILocalVariable(name: "src_s", scope: !639, file: !640, line: 151, type: !698)
!701 = !DILocalVariable(name: "dst_ns", scope: !639, file: !640, line: 152, type: !91)
!702 = !DILocalVariable(name: "src_ns", scope: !639, file: !640, line: 153, type: !91)
!703 = !DILocalVariable(name: "dst_res", scope: !704, file: !640, line: 175, type: !685)
!704 = distinct !DILexicalBlock(scope: !705, file: !640, line: 156, column: 5)
!705 = distinct !DILexicalBlock(scope: !639, file: !640, line: 155, column: 7)
!706 = !DILocalVariable(name: "res", scope: !704, file: !640, line: 178, type: !91)
!707 = !DILocalVariable(name: "tmp_dst_res", scope: !704, file: !640, line: 192, type: !686)
!708 = !DILocalVariable(name: "dst_a_s", scope: !709, file: !640, line: 270, type: !698)
!709 = distinct !DILexicalBlock(scope: !710, file: !640, line: 266, column: 9)
!710 = distinct !DILexicalBlock(scope: !704, file: !640, line: 265, column: 11)
!711 = !DILocalVariable(name: "dst_c_s", scope: !709, file: !640, line: 271, type: !698)
!712 = !DILocalVariable(name: "dst_m_s", scope: !709, file: !640, line: 272, type: !698)
!713 = !DILocalVariable(name: "dst_a_ns", scope: !709, file: !640, line: 273, type: !91)
!714 = !DILocalVariable(name: "dst_c_ns", scope: !709, file: !640, line: 274, type: !91)
!715 = !DILocalVariable(name: "dst_m_ns", scope: !709, file: !640, line: 275, type: !91)
!716 = !DILocalVariable(name: "odd_second", scope: !717, file: !640, line: 284, type: !116)
!717 = distinct !DILexicalBlock(scope: !709, file: !640, line: 283, column: 11)
!718 = !DILocalVariable(name: "a", scope: !719, file: !640, line: 293, type: !91)
!719 = distinct !DILexicalBlock(scope: !720, file: !640, line: 292, column: 15)
!720 = distinct !DILexicalBlock(scope: !717, file: !640, line: 286, column: 17)
!721 = !DILocalVariable(name: "c", scope: !719, file: !640, line: 294, type: !91)
!722 = !DILocalVariable(name: "m", scope: !719, file: !640, line: 295, type: !91)
!723 = !DILocalVariable(name: "SR10", scope: !719, file: !640, line: 299, type: !91)
!724 = !DILocalVariable(name: "s", scope: !725, file: !640, line: 329, type: !698)
!725 = distinct !DILexicalBlock(scope: !726, file: !640, line: 328, column: 15)
!726 = distinct !DILexicalBlock(scope: !727, file: !640, line: 320, column: 13)
!727 = distinct !DILexicalBlock(scope: !709, file: !640, line: 319, column: 15)
!728 = !DILocalVariable(name: "timespec", scope: !726, file: !640, line: 343, type: !729)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 256, elements: !524)
!730 = !DILocalVariable(name: "dst_status", scope: !726, file: !640, line: 353, type: !645)
!731 = !DILocalVariable(name: "stat_result", scope: !732, file: !640, line: 357, type: !91)
!732 = distinct !DILexicalBlock(scope: !726, file: !640, line: 356, column: 15)
!733 = !DILocalVariable(name: "old_res", scope: !734, file: !640, line: 378, type: !91)
!734 = distinct !DILexicalBlock(scope: !726, file: !640, line: 377, column: 15)
!735 = !DILocalVariable(name: "a", scope: !734, file: !640, line: 379, type: !91)
!736 = !DILabel(scope: !737, name: "low_memory", file: !640, line: 219)
!737 = distinct !DILexicalBlock(scope: !738, file: !640, line: 218, column: 9)
!738 = distinct !DILexicalBlock(scope: !704, file: !640, line: 195, column: 11)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !741, file: !742, line: 26, type: !744, isLocal: false, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !743, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!743 = !{!739}
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 376, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 47)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!748 = distinct !DIGlobalVariable(name: "initialized", scope: !749, file: !750, line: 41, type: !116, isLocal: true, isDefinition: true)
!749 = distinct !DISubprogram(name: "can_write_any_file", scope: !750, file: !750, line: 39, type: !751, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !753, retainedNodes: !758)
!750 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!751 = !DISubroutineType(types: !752)
!752 = !{!116}
!753 = distinct !DICompileUnit(language: DW_LANG_C99, file: !750, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !754, splitDebugInlining: false, nameTableKind: None)
!754 = !{!755, !756}
!755 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "can_write", scope: !749, file: !750, line: 42, type: !116, isLocal: true, isDefinition: true)
!758 = !{!759}
!759 = !DILocalVariable(name: "can", scope: !760, file: !750, line: 46, type: !116)
!760 = distinct !DILexicalBlock(scope: !761, file: !750, line: 45, column: 5)
!761 = distinct !DILexicalBlock(scope: !749, file: !750, line: 44, column: 7)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "exit_failure", scope: !764, file: !765, line: 24, type: !767, isLocal: false, isDefinition: true)
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !766, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!766 = !{!762}
!767 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !91)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !770, file: !771, line: 506, type: !91, isLocal: true, isDefinition: true)
!770 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !771, file: !771, line: 485, type: !772, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !776)
!771 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!772 = !DISubroutineType(types: !773)
!773 = !{!91, !91, !91}
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !775, splitDebugInlining: false, nameTableKind: None)
!775 = !{!768}
!776 = !{!777, !778, !779, !780, !783}
!777 = !DILocalVariable(name: "fd", arg: 1, scope: !770, file: !771, line: 485, type: !91)
!778 = !DILocalVariable(name: "target", arg: 2, scope: !770, file: !771, line: 485, type: !91)
!779 = !DILocalVariable(name: "result", scope: !770, file: !771, line: 487, type: !91)
!780 = !DILocalVariable(name: "flags", scope: !781, file: !771, line: 530, type: !91)
!781 = distinct !DILexicalBlock(scope: !782, file: !771, line: 529, column: 5)
!782 = distinct !DILexicalBlock(scope: !770, file: !771, line: 528, column: 7)
!783 = !DILocalVariable(name: "saved_errno", scope: !784, file: !771, line: 533, type: !91)
!784 = distinct !DILexicalBlock(scope: !785, file: !771, line: 532, column: 9)
!785 = distinct !DILexicalBlock(scope: !781, file: !771, line: 531, column: 11)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "internal_state", scope: !788, file: !789, line: 97, type: !792, isLocal: true, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !790, globals: !791, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!790 = !{!90, !93, !98}
!791 = !{!786}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !794, file: !513, line: 15, baseType: !91, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !794, file: !513, line: 20, baseType: !798, size: 32, offset: 32)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !513, line: 16, size: 32, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !798, file: !513, line: 18, baseType: !7, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !798, file: !513, line: 19, baseType: !522, size: 32)
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !804, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!804 = !{!78, !72, !805, !43, !810, !814}
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 299, baseType: !91, size: 32, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!808 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!809 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !803, line: 38, baseType: !7, size: 32, elements: !811)
!811 = !{!812, !813}
!812 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!813 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 97, baseType: !7, size: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824}
!816 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!817 = !DIEnumerator(name: "DT_FIFO", value: 1)
!818 = !DIEnumerator(name: "DT_CHR", value: 2)
!819 = !DIEnumerator(name: "DT_DIR", value: 4)
!820 = !DIEnumerator(name: "DT_BLK", value: 6)
!821 = !DIEnumerator(name: "DT_REG", value: 8)
!822 = !DIEnumerator(name: "DT_LNK", value: 10)
!823 = !DIEnumerator(name: "DT_SOCK", value: 12)
!824 = !DIEnumerator(name: "DT_WHT", value: 14)
!825 = distinct !DICompileUnit(language: DW_LANG_C99, file: !826, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !851, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!827 = !{!5, !13, !20, !26, !32, !38, !261, !828, !43, !834, !843, !847}
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "scantype", file: !826, line: 459, baseType: !7, size: 32, elements: !829)
!829 = !{!830, !831, !832, !833}
!830 = !DIEnumerator(name: "ERROR_SCANTYPE", value: 0)
!831 = !DIEnumerator(name: "PLAIN_SCANTYPE", value: 1)
!832 = !DIEnumerator(name: "ZERO_SCANTYPE", value: 2)
!833 = !DIEnumerator(name: "LSEEK_SCANTYPE", value: 3)
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !835, line: 44, baseType: !7, size: 32, elements: !836)
!835 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!836 = !{!837, !838, !839, !840, !841, !842}
!837 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!838 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!839 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!840 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!841 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!842 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !844, line: 79, baseType: !7, size: 32, elements: !845)
!844 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!845 = !{!846}
!846 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !848, line: 36, baseType: !7, size: 32, elements: !849)
!848 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!849 = !{!850}
!850 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!851 = !{!116, !93, !852}
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !222, line: 85, baseType: !155)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !861, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aaac2d7e2e4691c3c7dfceec011d70d1")
!861 = !{!862}
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !863, file: !860, line: 60, baseType: !7, size: 32, elements: !890)
!863 = distinct !DISubprogram(name: "areadlink_with_size", scope: !860, file: !860, line: 49, type: !864, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !859, retainedNodes: !866)
!864 = !DISubroutineType(types: !865)
!865 = !{!88, !96, !93}
!866 = !{!867, !868, !869, !870, !871, !872, !873, !878, !879, !880, !883, !884}
!867 = !DILocalVariable(name: "file", arg: 1, scope: !863, file: !860, line: 49, type: !96)
!868 = !DILocalVariable(name: "size", arg: 2, scope: !863, file: !860, line: 49, type: !93)
!869 = !DILocalVariable(name: "symlink_max", scope: !863, file: !860, line: 54, type: !93)
!870 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !863, file: !860, line: 55, type: !93)
!871 = !DILocalVariable(name: "initial_limit", scope: !863, file: !860, line: 56, type: !93)
!872 = !DILocalVariable(name: "buf_size", scope: !863, file: !860, line: 63, type: !93)
!873 = !DILocalVariable(name: "stackbuf", scope: !874, file: !860, line: 68, type: !875)
!874 = distinct !DILexicalBlock(scope: !863, file: !860, line: 67, column: 5)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 1024, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 128)
!878 = !DILocalVariable(name: "buf", scope: !874, file: !860, line: 69, type: !88)
!879 = !DILocalVariable(name: "buffer", scope: !874, file: !860, line: 70, type: !88)
!880 = !DILocalVariable(name: "r", scope: !874, file: !860, line: 82, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !222, line: 108, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !156, line: 194, baseType: !157)
!883 = !DILocalVariable(name: "link_length", scope: !874, file: !860, line: 89, type: !93)
!884 = !DILocalVariable(name: "shrinked_buffer", scope: !885, file: !860, line: 102, type: !88)
!885 = distinct !DILexicalBlock(scope: !886, file: !860, line: 100, column: 13)
!886 = distinct !DILexicalBlock(scope: !887, file: !860, line: 99, column: 20)
!887 = distinct !DILexicalBlock(scope: !888, file: !860, line: 93, column: 15)
!888 = distinct !DILexicalBlock(scope: !889, file: !860, line: 91, column: 9)
!889 = distinct !DILexicalBlock(scope: !874, file: !860, line: 90, column: 11)
!890 = !{!891}
!891 = !DIEnumerator(name: "stackbuf_size", value: 128)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !894, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "lib/areadlinkat-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "326d53ebd4d51818fba309db538ba252")
!894 = !{!895}
!895 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !896, file: !893, line: 65, baseType: !7, size: 32, elements: !890)
!896 = distinct !DISubprogram(name: "areadlinkat_with_size", scope: !893, file: !893, line: 54, type: !897, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !892, retainedNodes: !899)
!897 = !DISubroutineType(types: !898)
!898 = !{!88, !91, !96, !93}
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !909, !910, !911, !912, !913}
!900 = !DILocalVariable(name: "fd", arg: 1, scope: !896, file: !893, line: 54, type: !91)
!901 = !DILocalVariable(name: "file", arg: 2, scope: !896, file: !893, line: 54, type: !96)
!902 = !DILocalVariable(name: "size", arg: 3, scope: !896, file: !893, line: 54, type: !93)
!903 = !DILocalVariable(name: "symlink_max", scope: !896, file: !893, line: 59, type: !93)
!904 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !896, file: !893, line: 60, type: !93)
!905 = !DILocalVariable(name: "initial_limit", scope: !896, file: !893, line: 61, type: !93)
!906 = !DILocalVariable(name: "buf_size", scope: !896, file: !893, line: 68, type: !93)
!907 = !DILocalVariable(name: "stackbuf", scope: !908, file: !893, line: 73, type: !875)
!908 = distinct !DILexicalBlock(scope: !896, file: !893, line: 72, column: 5)
!909 = !DILocalVariable(name: "buf", scope: !908, file: !893, line: 74, type: !88)
!910 = !DILocalVariable(name: "buffer", scope: !908, file: !893, line: 75, type: !88)
!911 = !DILocalVariable(name: "r", scope: !908, file: !893, line: 86, type: !881)
!912 = !DILocalVariable(name: "link_length", scope: !908, file: !893, line: 93, type: !93)
!913 = !DILocalVariable(name: "shrinked_buffer", scope: !914, file: !893, line: 106, type: !88)
!914 = distinct !DILexicalBlock(scope: !915, file: !893, line: 104, column: 13)
!915 = distinct !DILexicalBlock(scope: !916, file: !893, line: 103, column: 20)
!916 = distinct !DILexicalBlock(scope: !917, file: !893, line: 97, column: 15)
!917 = distinct !DILexicalBlock(scope: !918, file: !893, line: 95, column: 9)
!918 = distinct !DILexicalBlock(scope: !908, file: !893, line: 94, column: 11)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/backup-rename.c", directory: "/src", checksumkind: CSK_MD5, checksum: "88cb9da5a68506185c7e375c65552513")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/buffer-lcm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "204b1d663c06054dea2138b65ef12013")
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !927, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!927 = !{!847}
!928 = distinct !DICompileUnit(language: DW_LANG_C99, file: !929, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!929 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!932 = distinct !DICompileUnit(language: DW_LANG_C99, file: !933, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !936, splitDebugInlining: false, nameTableKind: None)
!935 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!936 = !{!834}
!937 = distinct !DICompileUnit(language: DW_LANG_C99, file: !938, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!938 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !940, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!940 = !DIFile(filename: "lib/fdutimensat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7ed4a56b581c8ad87a015a222c14deba")
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !945, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!945 = !{!90, !88}
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "lib/freadahead.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0335573db6cc583acb894a308e230b2b")
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !603, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !960, retainedTypes: !1088, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!960 = !{!961, !965, !1075, !1078, !814, !1082, !1085}
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !959, line: 159, baseType: !7, size: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!964 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !967, file: !966, line: 54, baseType: !7, size: 32, elements: !1073)
!966 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!967 = distinct !DISubprogram(name: "setup_dir", scope: !966, file: !966, line: 50, type: !968, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !958, retainedNodes: !1071)
!968 = !DISubroutineType(types: !969)
!969 = !{!116, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !972, line: 233, baseType: !973)
!972 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !972, line: 115, size: 1024, elements: !974)
!974 = !{!975, !1024, !1025, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1040, !1041, !1044, !1060}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !973, file: !972, line: 116, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !972, line: 235, size: 1920, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !1020}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !977, file: !972, line: 236, baseType: !976, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !977, file: !972, line: 237, baseType: !976, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !977, file: !972, line: 238, baseType: !976, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !977, file: !972, line: 239, baseType: !349, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !977, file: !972, line: 242, baseType: !157, size: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !977, file: !972, line: 243, baseType: !90, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !977, file: !972, line: 244, baseType: !88, size: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !977, file: !972, line: 245, baseType: !88, size: 64, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !977, file: !972, line: 246, baseType: !91, size: 32, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !977, file: !972, line: 247, baseType: !91, size: 32, offset: 544)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !977, file: !972, line: 248, baseType: !93, size: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !977, file: !972, line: 250, baseType: !970, size: 64, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !977, file: !972, line: 254, baseType: !342, size: 64, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !977, file: !972, line: 256, baseType: !93, size: 64, offset: 768)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !977, file: !972, line: 272, baseType: !92, size: 16, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !977, file: !972, line: 276, baseType: !92, size: 16, offset: 848)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !977, file: !972, line: 282, baseType: !92, size: 16, offset: 864)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !977, file: !972, line: 284, baseType: !997, size: 1024, offset: 896)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 1024, elements: !163)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !646, line: 44, size: 1024, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1017, !1018, !1019}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !998, file: !646, line: 46, baseType: !226, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !998, file: !646, line: 47, baseType: !223, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !998, file: !646, line: 48, baseType: !278, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !998, file: !646, line: 49, baseType: !652, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !998, file: !646, line: 50, baseType: !654, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !998, file: !646, line: 51, baseType: !656, size: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !998, file: !646, line: 52, baseType: !226, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !998, file: !646, line: 53, baseType: !226, size: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !998, file: !646, line: 54, baseType: !155, size: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !998, file: !646, line: 55, baseType: !661, size: 32, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !998, file: !646, line: 56, baseType: !91, size: 32, offset: 480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !998, file: !646, line: 57, baseType: !664, size: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !998, file: !646, line: 65, baseType: !1013, size: 128, offset: 576)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !667, line: 11, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1013, file: !667, line: 16, baseType: !670, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1013, file: !667, line: 21, baseType: !672, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !998, file: !646, line: 66, baseType: !1013, size: 128, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !998, file: !646, line: 67, baseType: !1013, size: 128, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !998, file: !646, line: 79, baseType: !676, size: 64, offset: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !977, file: !972, line: 285, baseType: !1021, offset: 1920)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: -1)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !973, file: !972, line: 117, baseType: !976, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !973, file: !972, line: 118, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !973, file: !972, line: 119, baseType: !225, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !973, file: !972, line: 120, baseType: !88, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !973, file: !972, line: 121, baseType: !91, size: 32, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !973, file: !972, line: 122, baseType: !91, size: 32, offset: 352)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !973, file: !972, line: 124, baseType: !93, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !973, file: !972, line: 125, baseType: !93, size: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !973, file: !972, line: 126, baseType: !1034, size: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!91, !1037, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !973, file: !972, line: 196, baseType: !91, size: 32, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !973, file: !972, line: 205, baseType: !1042, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !972, line: 205, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !973, file: !972, line: 227, baseType: !1045, size: 64, offset: 704)
!1045 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !973, file: !972, line: 207, size: 64, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1045, file: !972, line: 220, baseType: !1042, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1045, file: !972, line: 226, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !1051, line: 32, size: 256, elements: !1052)
!1051 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!1052 = !{!1053, !1058, !1059}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !1050, file: !1051, line: 34, baseType: !1054, size: 128)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !218, line: 30, size: 128, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1054, file: !218, line: 32, baseType: !221, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1054, file: !218, line: 33, baseType: !225, size: 64, offset: 64)
