; ModuleID = 'src/nice.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [39 x i8] c"Usage: %s [OPTION] [COMMAND [ARG]...]\0A\00", align 1
@.str.2 = private unnamed_addr constant [222 x i8] c"Run COMMAND with an adjusted niceness, which affects process scheduling.\0AWith no COMMAND, print the current niceness.  Niceness values range from\0A%d (most favorable to the process) to %d (least favorable to the process).\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"nice\00", align 1

!48 = !DILocalVariable(name: "fake_argv", scope: !45, file: !3, line: 132, type: !26)
!49 = !DILocalVariable(name: "tmp", scope: !50, file: !3, line: 179, type: !52)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 167, column: 5)
!51 = distinct !DILexicalBlock(scope: !22, file: !3, line: 166, column: 7)
!52 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!53 = !DILocalVariable(name: "__errstatus", scope: !54, file: !3, line: 240, type: !57)
!54 = distinct !DILexicalBlock(scope: !55, file: !3, line: 240, column: 7)
!55 = distinct !DILexicalBlock(scope: !56, file: !3, line: 239, column: 5)
!56 = distinct !DILexicalBlock(scope: !22, file: !3, line: 238, column: 7)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!58 = !DILocalVariable(name: "exit_status", scope: !22, file: !3, line: 253, type: !25)
!59 = !{!60, !61}
!60 = !DIEnumerator(name: "MIN_ADJUSTMENT", value: -39)
!61 = !DIEnumerator(name: "MAX_ADJUSTMENT", value: 39)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__priority_which", file: !63, line: 187, baseType: !7, size: 32, elements: !64)
!63 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "PRIO_PROCESS", value: 0)
!66 = !DIEnumerator(name: "PRIO_PGRP", value: 1)
!67 = !DIEnumerator(name: "PRIO_USER", value: 2)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 46, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!71 = !DIEnumerator(name: "_ISupper", value: 256)
!72 = !DIEnumerator(name: "_ISlower", value: 512)
!73 = !DIEnumerator(name: "_ISalpha", value: 1024)
!74 = !DIEnumerator(name: "_ISdigit", value: 2048)
!75 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!76 = !DIEnumerator(name: "_ISspace", value: 8192)
!77 = !DIEnumerator(name: "_ISprint", value: 16384)
!78 = !DIEnumerator(name: "_ISgraph", value: 32768)
!79 = !DIEnumerator(name: "_ISblank", value: 1)
!80 = !DIEnumerator(name: "_IScntrl", value: 2)
!81 = !DIEnumerator(name: "_ISpunct", value: 4)
!82 = !DIEnumerator(name: "_ISalnum", value: 8)
!83 = !{!27, !84, !25, !85, !86, !35, !89}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 46, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!88 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !{!91, !0}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !93, file: !6, line: 575, type: !25, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "oputs_", scope: !6, file: !6, line: 573, type: !94, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !96)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !35, !35}
!96 = !{!97, !98, !99, !102, !103, !104, !105, !109, !110, !111, !112, !114, !169, !170, !171, !173, !174}
!97 = !DILocalVariable(name: "program", arg: 1, scope: !93, file: !6, line: 573, type: !35)
!98 = !DILocalVariable(name: "option", arg: 2, scope: !93, file: !6, line: 573, type: !35)
!99 = !DILocalVariable(name: "term", scope: !100, file: !6, line: 585, type: !35)
!100 = distinct !DILexicalBlock(scope: !101, file: !6, line: 582, column: 5)
!101 = distinct !DILexicalBlock(scope: !93, file: !6, line: 581, column: 7)
!102 = !DILocalVariable(name: "double_space", scope: !93, file: !6, line: 594, type: !38)
!103 = !DILocalVariable(name: "first_word", scope: !93, file: !6, line: 595, type: !35)
!104 = !DILocalVariable(name: "option_text", scope: !93, file: !6, line: 596, type: !35)
!105 = !DILocalVariable(name: "s", scope: !106, file: !6, line: 608, type: !35)
!106 = distinct !DILexicalBlock(scope: !107, file: !6, line: 605, column: 5)
!107 = distinct !DILexicalBlock(scope: !108, file: !6, line: 604, column: 12)
!108 = distinct !DILexicalBlock(scope: !93, file: !6, line: 597, column: 7)
!109 = !DILocalVariable(name: "spaces", scope: !106, file: !6, line: 609, type: !86)
!110 = !DILocalVariable(name: "anchor_len", scope: !93, file: !6, line: 620, type: !86)
!111 = !DILocalVariable(name: "desc_text", scope: !93, file: !6, line: 625, type: !35)
!112 = !DILocalVariable(name: "__ptr", scope: !113, file: !6, line: 644, type: !35)
!113 = distinct !DILexicalBlock(scope: !93, file: !6, line: 644, column: 3)
!114 = !DILocalVariable(name: "__stream", scope: !113, file: !6, line: 644, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 7, baseType: !118)
!117 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 49, size: 1728, elements: !120)
!119 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !136, !138, !139, !140, !143, !144, !146, !150, !153, !155, !158, !161, !162, !163, !164, !165}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !119, line: 51, baseType: !25, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !118, file: !119, line: 54, baseType: !27, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !118, file: !119, line: 55, baseType: !27, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !118, file: !119, line: 56, baseType: !27, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !118, file: !119, line: 57, baseType: !27, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !118, file: !119, line: 58, baseType: !27, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !118, file: !119, line: 59, baseType: !27, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !118, file: !119, line: 60, baseType: !27, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !118, file: !119, line: 61, baseType: !27, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !118, file: !119, line: 64, baseType: !27, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !118, file: !119, line: 65, baseType: !27, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !118, file: !119, line: 66, baseType: !27, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !118, file: !119, line: 68, baseType: !134, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !119, line: 36, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !118, file: !119, line: 70, baseType: !137, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !118, file: !119, line: 72, baseType: !25, size: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !119, line: 73, baseType: !25, size: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !118, file: !119, line: 74, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 152, baseType: !52)
!142 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !118, file: !119, line: 77, baseType: !85, size: 16, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !118, file: !119, line: 78, baseType: !145, size: 8, offset: 1040)
!145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !118, file: !119, line: 79, baseType: !147, size: 8, offset: 1048)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !119, line: 81, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !119, line: 43, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !119, line: 89, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 153, baseType: !52)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !118, file: !119, line: 91, baseType: !156, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !119, line: 37, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !118, file: !119, line: 92, baseType: !159, size: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !119, line: 38, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !118, file: !119, line: 93, baseType: !137, size: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !118, file: !119, line: 94, baseType: !84, size: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !118, file: !119, line: 95, baseType: !86, size: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !118, file: !119, line: 96, baseType: !25, size: 32, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !118, file: !119, line: 98, baseType: !166, size: 160, offset: 1568)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 20)
!169 = !DILocalVariable(name: "__cnt", scope: !113, file: !6, line: 644, type: !86)
!170 = !DILocalVariable(name: "url_program", scope: !93, file: !6, line: 648, type: !35)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !6, line: 686, type: !35)
!172 = distinct !DILexicalBlock(scope: !93, file: !6, line: 686, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !6, line: 686, type: !115)
!174 = !DILocalVariable(name: "__cnt", scope: !172, file: !6, line: 686, type: !86)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 1024, elements: !185)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !178, line: 50, size: 256, elements: !179)
!178 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!179 = !{!180, !181, !182, !184}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !178, line: 52, baseType: !35, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !177, file: !178, line: 55, baseType: !25, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !177, file: !178, line: 56, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !177, file: !178, line: 57, baseType: !25, size: 32, offset: 192)
!185 = !{!186}
!186 = !DISubrange(count: 4)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "Version", scope: !189, file: !190, line: 3, type: !35, isLocal: false, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !191, splitDebugInlining: false, nameTableKind: None)
!190 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!191 = !{!187}
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "file_name", scope: !194, file: !195, line: 45, type: !35, isLocal: true, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !196, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!196 = !{!192, !197}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !194, file: !195, line: 55, type: !38, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !201, file: !202, line: 66, type: !237, isLocal: false, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !203, globals: !204, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!203 = !{!84, !89}
!204 = !{!205, !231, !199, !233, !235}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "old_file_name", scope: !207, file: !202, line: 304, type: !35, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "verror_at_line", scope: !202, file: !202, line: 298, type: !208, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !224)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !25, !25, !35, !7, !35, !210}
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !211, line: 52, baseType: !212)
!211 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !213, line: 32, baseType: !214)
!213 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !215, baseType: !216)
!215 = !DIFile(filename: "lib/error.c", directory: "/src")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !217, size: 256, elements: !218)
!217 = !DINamespace(name: "std", scope: null)
!218 = !{!219, !220, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !216, file: !215, baseType: !84, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !216, file: !215, baseType: !84, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !216, file: !215, baseType: !84, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !216, file: !215, baseType: !25, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !216, file: !215, baseType: !25, size: 32, offset: 224)
!224 = !{!225, !226, !227, !228, !229, !230}
!225 = !DILocalVariable(name: "status", arg: 1, scope: !207, file: !202, line: 298, type: !25)
!226 = !DILocalVariable(name: "errnum", arg: 2, scope: !207, file: !202, line: 298, type: !25)
!227 = !DILocalVariable(name: "file_name", arg: 3, scope: !207, file: !202, line: 298, type: !35)
!228 = !DILocalVariable(name: "line_number", arg: 4, scope: !207, file: !202, line: 298, type: !7)
!229 = !DILocalVariable(name: "message", arg: 5, scope: !207, file: !202, line: 298, type: !35)
!230 = !DILocalVariable(name: "args", arg: 6, scope: !207, file: !202, line: 298, type: !210)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "old_line_number", scope: !207, file: !202, line: 305, type: !7, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "error_message_count", scope: !201, file: !202, line: 69, type: !7, isLocal: false, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !201, file: !202, line: 295, type: !25, isLocal: false, isDefinition: true)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null}
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "program_name", scope: !242, file: !243, line: 31, type: !35, isLocal: false, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !244, globals: !245, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!244 = !{!27}
!245 = !{!240}
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "utf07FF", scope: !248, file: !249, line: 46, type: !277, isLocal: true, isDefinition: true)
!248 = distinct !DISubprogram(name: "proper_name_lite", scope: !249, file: !249, line: 38, type: !250, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !254)
!249 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!250 = !DISubroutineType(types: !251)
!251 = !{!35, !35, !35}
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !253, splitDebugInlining: false, nameTableKind: None)
!253 = !{!246}
!254 = !{!255, !256, !257, !258, !263}
!255 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !248, file: !249, line: 38, type: !35)
!256 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !248, file: !249, line: 38, type: !35)
!257 = !DILocalVariable(name: "translation", scope: !248, file: !249, line: 40, type: !35)
!258 = !DILocalVariable(name: "w", scope: !248, file: !249, line: 47, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !260, line: 37, baseType: !261)
!260 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !142, line: 57, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !142, line: 42, baseType: !7)
!263 = !DILocalVariable(name: "mbs", scope: !248, file: !249, line: 48, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !265, line: 6, baseType: !266)
!265 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !267, line: 21, baseType: !268)
!267 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 13, size: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !268, file: !267, line: 15, baseType: !25, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !268, file: !267, line: 20, baseType: !272, size: 32, offset: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !268, file: !267, line: 16, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !272, file: !267, line: 18, baseType: !7, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !272, file: !267, line: 19, baseType: !276, size: 32)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !185)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 16, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 2)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !282, file: !283, line: 76, type: !365, isLocal: false, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !284, retainedTypes: !304, globals: !305, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!284 = !{!285, !299, !68}
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !286, line: 42, baseType: !7, size: 32, elements: !287)
!286 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!288 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!289 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!290 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!291 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!292 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!293 = !DIEnumerator(name: "c_quoting_style", value: 5)
!294 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!295 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!296 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!297 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!298 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!299 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !286, line: 254, baseType: !7, size: 32, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!302 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!303 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!304 = !{!25, !85, !86}
!305 = !{!280, !306, !312, !324, !326, !331, !354, !361, !363}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !282, file: !283, line: 92, type: !308, isLocal: false, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 320, elements: !310)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!310 = !{!311}
!311 = !DISubrange(count: 10)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !282, file: !283, line: 1040, type: !314, isLocal: false, isDefinition: true)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !283, line: 56, size: 448, elements: !315)
!315 = !{!316, !317, !318, !322, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !314, file: !283, line: 59, baseType: !285, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !283, line: 62, baseType: !25, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !314, file: !283, line: 66, baseType: !319, size: 256, offset: 64)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !314, file: !283, line: 69, baseType: !35, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !314, file: !283, line: 72, baseType: !35, size: 64, offset: 384)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !282, file: !283, line: 107, type: !314, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "slot0", scope: !282, file: !283, line: 831, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 2048, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 256)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "quote", scope: !333, file: !283, line: 228, type: !352, isLocal: true, isDefinition: true)
!333 = distinct !DISubprogram(name: "gettext_quote", scope: !283, file: !283, line: 197, type: !334, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !336)
!334 = !DISubroutineType(types: !335)
!335 = !{!35, !35, !285}
!336 = !{!337, !338, !339, !340, !341}
!337 = !DILocalVariable(name: "msgid", arg: 1, scope: !333, file: !283, line: 197, type: !35)
!338 = !DILocalVariable(name: "s", arg: 2, scope: !333, file: !283, line: 197, type: !285)
!339 = !DILocalVariable(name: "translation", scope: !333, file: !283, line: 199, type: !35)
!340 = !DILocalVariable(name: "w", scope: !333, file: !283, line: 229, type: !259)
!341 = !DILocalVariable(name: "mbs", scope: !333, file: !283, line: 230, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !265, line: 6, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !267, line: 21, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 13, size: 64, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !344, file: !267, line: 15, baseType: !25, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !344, file: !267, line: 20, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !267, line: 16, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !348, file: !267, line: 18, baseType: !7, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !348, file: !267, line: 19, baseType: !276, size: 32)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !353)
!353 = !{!279, !186}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "slotvec", scope: !282, file: !283, line: 834, type: !356, isLocal: true, isDefinition: true)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !283, line: 823, size: 128, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !283, line: 825, baseType: !86, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !357, file: !283, line: 826, baseType: !27, size: 64, offset: 64)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "nslots", scope: !282, file: !283, line: 832, type: !25, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "slotvec0", scope: !282, file: !283, line: 833, type: !357, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 704, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!367 = !{!368}
!368 = !DISubrange(count: 11)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !371, file: !372, line: 26, type: !374, isLocal: false, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !373, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!373 = !{!369}
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 376, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 47)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "exit_failure", scope: !379, file: !380, line: 24, type: !382, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !381, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!381 = !{!377}
!382 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "internal_state", scope: !385, file: !386, line: 97, type: !389, isLocal: true, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !387, globals: !388, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!387 = !{!84, !86, !89}
!388 = !{!383}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !265, line: 6, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !267, line: 21, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !267, line: 13, size: 64, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !391, file: !267, line: 15, baseType: !25, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !391, file: !267, line: 20, baseType: !395, size: 32, offset: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !391, file: !267, line: 16, size: 32, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !395, file: !267, line: 18, baseType: !7, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !395, file: !267, line: 19, baseType: !276, size: 32)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !407, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!403 = !{!404}
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !402, line: 40, baseType: !7, size: 32, elements: !405)
!405 = !{!406}
!406 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!407 = !{!84}
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !441, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!410 = !{!411, !423}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !412, file: !409, line: 188, baseType: !7, size: 32, elements: !421)
!412 = distinct !DISubprogram(name: "x2nrealloc", scope: !409, file: !409, line: 176, type: !413, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !416)
!413 = !DISubroutineType(types: !414)
!414 = !{!84, !84, !415, !86}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!416 = !{!417, !418, !419, !420}
!417 = !DILocalVariable(name: "p", arg: 1, scope: !412, file: !409, line: 176, type: !84)
!418 = !DILocalVariable(name: "pn", arg: 2, scope: !412, file: !409, line: 176, type: !415)
!419 = !DILocalVariable(name: "s", arg: 3, scope: !412, file: !409, line: 176, type: !86)
!420 = !DILocalVariable(name: "n", scope: !412, file: !409, line: 178, type: !86)
!421 = !{!422}
!422 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !424, file: !409, line: 228, baseType: !7, size: 32, elements: !421)
!424 = distinct !DISubprogram(name: "xpalloc", scope: !409, file: !409, line: 223, type: !425, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !431)
!425 = !DISubroutineType(types: !426)
!426 = !{!84, !84, !427, !428, !430, !428}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !429, line: 130, baseType: !430)
!429 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !87, line: 35, baseType: !52)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440}
!432 = !DILocalVariable(name: "pa", arg: 1, scope: !424, file: !409, line: 223, type: !84)
!433 = !DILocalVariable(name: "pn", arg: 2, scope: !424, file: !409, line: 223, type: !427)
!434 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !424, file: !409, line: 223, type: !428)
!435 = !DILocalVariable(name: "n_max", arg: 4, scope: !424, file: !409, line: 223, type: !430)
!436 = !DILocalVariable(name: "s", arg: 5, scope: !424, file: !409, line: 223, type: !428)
!437 = !DILocalVariable(name: "n0", scope: !424, file: !409, line: 230, type: !428)
!438 = !DILocalVariable(name: "n", scope: !424, file: !409, line: 237, type: !428)
!439 = !DILocalVariable(name: "nbytes", scope: !424, file: !409, line: 248, type: !428)
!440 = !DILocalVariable(name: "adjusted_nbytes", scope: !424, file: !409, line: 252, type: !428)
!441 = !{!27, !84, !38, !52, !88}
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !447, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "lib/xstrtol.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a1112be551b7ea11a9f6293a4923a73")
!446 = !{!13}
!447 = !{!38, !52, !88}
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!458 = !{!38, !88, !84}
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!465 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!466 = !{i32 7, !"Dwarf Version", i32 5}
!467 = !{i32 2, !"Debug Info Version", i32 3}
!468 = !{i32 1, !"wchar_size", i32 4}
!469 = !{i32 1, !"branch-target-enforcement", i32 0}
!470 = !{i32 1, !"sign-return-address", i32 0}
!471 = !{i32 1, !"sign-return-address-all", i32 0}
!472 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!473 = !{i32 7, !"PIC Level", i32 2}
!474 = !{i32 7, !"PIE Level", i32 2}
!475 = !{i32 7, !"uwtable", i32 1}
!476 = !{i32 7, !"frame-pointer", i32 1}
!477 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 66, type: !478, scopeLine: 67, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !25}
!480 = !{!481}
!481 = !DILocalVariable(name: "status", arg: 1, scope: !477, file: !3, line: 66, type: !25)
!482 = !DILocation(line: 0, scope: !477)
!483 = !DILocation(line: 68, column: 14, scope: !484)
!484 = distinct !DILexicalBlock(scope: !477, file: !3, line: 68, column: 7)
!485 = !DILocation(line: 68, column: 7, scope: !477)
!486 = !DILocation(line: 69, column: 5, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !3, line: 69, column: 5)
!488 = !{!489, !489, i64 0}
!489 = !{!"any pointer", !490, i64 0}
!490 = !{!"omnipotent char", !491, i64 0}
!491 = !{!"Simple C/C++ TBAA"}
!492 = !DILocation(line: 72, column: 7, scope: !493)
!493 = distinct !DILexicalBlock(scope: !484, file: !3, line: 71, column: 5)
!494 = !DILocation(line: 73, column: 7, scope: !493)
!495 = !DILocation(line: 736, column: 3, scope: !496, inlinedAt: !498)
!496 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 734, type: !238, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !497)
!497 = !{}
!498 = distinct !DILocation(line: 80, column: 7, scope: !493)
!499 = !DILocation(line: 82, column: 7, scope: !493)
!500 = !DILocation(line: 86, column: 7, scope: !493)
!501 = !DILocation(line: 87, column: 7, scope: !493)
!502 = !DILocation(line: 88, column: 7, scope: !493)
!503 = !DILocalVariable(name: "program", arg: 1, scope: !504, file: !6, line: 824, type: !35)
!504 = distinct !DISubprogram(name: "emit_exec_status", scope: !6, file: !6, line: 824, type: !505, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !35}
!507 = !{!503}
!508 = !DILocation(line: 0, scope: !504, inlinedAt: !509)
!509 = distinct !DILocation(line: 89, column: 7, scope: !493)
!510 = !DILocation(line: 826, column: 7, scope: !504, inlinedAt: !509)
!511 = !DILocalVariable(name: "program", arg: 1, scope: !512, file: !6, line: 836, type: !35)
!512 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 836, type: !505, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !513)
!513 = !{!511, !514, !523, !524, !526, !527}
!514 = !DILocalVariable(name: "infomap", scope: !512, file: !6, line: 838, type: !515)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 896, elements: !521)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !512, file: !6, line: 838, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !517, file: !6, line: 838, baseType: !35, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !517, file: !6, line: 838, baseType: !35, size: 64, offset: 64)
!521 = !{!522}
!522 = !DISubrange(count: 7)
!523 = !DILocalVariable(name: "node", scope: !512, file: !6, line: 848, type: !35)
!524 = !DILocalVariable(name: "map_prog", scope: !512, file: !6, line: 849, type: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!526 = !DILocalVariable(name: "lc_messages", scope: !512, file: !6, line: 861, type: !35)
!527 = !DILocalVariable(name: "url_program", scope: !512, file: !6, line: 874, type: !35)
!528 = !DILocation(line: 0, scope: !512, inlinedAt: !529)
!529 = distinct !DILocation(line: 90, column: 7, scope: !493)
!530 = !DILocation(line: 838, column: 3, scope: !512, inlinedAt: !529)
!531 = !DILocation(line: 838, column: 67, scope: !512, inlinedAt: !529)
!532 = !DILocation(line: 849, column: 36, scope: !512, inlinedAt: !529)
!533 = !DILocation(line: 851, column: 3, scope: !512, inlinedAt: !529)
!534 = !DILocalVariable(name: "__s1", arg: 1, scope: !535, file: !536, line: 1359, type: !35)
!535 = distinct !DISubprogram(name: "streq", scope: !536, file: !536, line: 1359, type: !537, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !539)
!536 = !DIFile(filename: "./lib/string.h", directory: "/src")
!537 = !DISubroutineType(types: !538)
!538 = !{!38, !35, !35}
!539 = !{!534, !540}
!540 = !DILocalVariable(name: "__s2", arg: 2, scope: !535, file: !536, line: 1359, type: !35)
!541 = !DILocation(line: 0, scope: !535, inlinedAt: !542)
!542 = distinct !DILocation(line: 851, column: 33, scope: !512, inlinedAt: !529)
!543 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !542)
!544 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !542)
!545 = !DILocation(line: 852, column: 13, scope: !512, inlinedAt: !529)
!546 = !DILocation(line: 851, column: 20, scope: !512, inlinedAt: !529)
!547 = !{!548, !489, i64 0}
!548 = !{!"infomap", !489, i64 0, !489, i64 8}
!549 = !DILocation(line: 851, column: 10, scope: !512, inlinedAt: !529)
!550 = !DILocation(line: 851, column: 28, scope: !512, inlinedAt: !529)
!551 = distinct !{!551, !533, !545, !552}
!552 = !{!"llvm.loop.mustprogress"}
!553 = !DILocation(line: 854, column: 17, scope: !554, inlinedAt: !529)
!554 = distinct !DILexicalBlock(scope: !512, file: !6, line: 854, column: 7)
!555 = !{!548, !489, i64 8}
!556 = !DILocation(line: 854, column: 7, scope: !554, inlinedAt: !529)
!557 = !DILocation(line: 854, column: 7, scope: !512, inlinedAt: !529)
!558 = !DILocation(line: 857, column: 3, scope: !512, inlinedAt: !529)
!559 = !DILocation(line: 861, column: 29, scope: !512, inlinedAt: !529)
!560 = !DILocation(line: 862, column: 7, scope: !561, inlinedAt: !529)
!561 = distinct !DILexicalBlock(scope: !512, file: !6, line: 862, column: 7)
!562 = !DILocation(line: 862, column: 19, scope: !561, inlinedAt: !529)
!563 = !DILocation(line: 862, column: 22, scope: !561, inlinedAt: !529)
!564 = !DILocation(line: 862, column: 7, scope: !512, inlinedAt: !529)
!565 = !DILocation(line: 868, column: 7, scope: !566, inlinedAt: !529)
!566 = distinct !DILexicalBlock(scope: !561, file: !6, line: 863, column: 5)
!567 = !DILocation(line: 870, column: 5, scope: !566, inlinedAt: !529)
!568 = !DILocation(line: 0, scope: !535, inlinedAt: !569)
!569 = distinct !DILocation(line: 874, column: 29, scope: !512, inlinedAt: !529)
!570 = !DILocation(line: 875, column: 3, scope: !512, inlinedAt: !529)
!571 = !DILocation(line: 877, column: 3, scope: !512, inlinedAt: !529)
!572 = !DILocation(line: 879, column: 1, scope: !512, inlinedAt: !529)
!573 = !DILocation(line: 92, column: 3, scope: !477)
!574 = !DISubprogram(name: "dcgettext", scope: !575, file: !575, line: 51, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!575 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!576 = !DISubroutineType(types: !577)
!577 = !{!27, !35, !35, !25}
!578 = !DISubprogram(name: "fputs_unlocked", scope: !211, file: !211, line: 691, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!579 = !DISubroutineType(types: !580)
!580 = !{!25, !581, !582}
!581 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !35)
!582 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!583 = !DILocation(line: 0, scope: !93)
!584 = !DILocation(line: 581, column: 7, scope: !101)
!585 = !{!586, !586, i64 0}
!586 = !{!"int", !490, i64 0}
!587 = !DILocation(line: 581, column: 19, scope: !101)
!588 = !DILocation(line: 581, column: 7, scope: !93)
!589 = !DILocation(line: 585, column: 26, scope: !100)
!590 = !DILocation(line: 0, scope: !100)
!591 = !DILocation(line: 586, column: 23, scope: !100)
!592 = !DILocation(line: 586, column: 28, scope: !100)
!593 = !DILocation(line: 586, column: 32, scope: !100)
!594 = !{!490, !490, i64 0}
!595 = !DILocation(line: 586, column: 38, scope: !100)
!596 = !DILocation(line: 0, scope: !535, inlinedAt: !597)
!597 = distinct !DILocation(line: 586, column: 41, scope: !100)
!598 = !DILocation(line: 1361, column: 11, scope: !535, inlinedAt: !597)
!599 = !DILocation(line: 1361, column: 10, scope: !535, inlinedAt: !597)
!600 = !DILocation(line: 586, column: 19, scope: !100)
!601 = !DILocation(line: 587, column: 5, scope: !100)
!602 = !DILocation(line: 588, column: 7, scope: !603)
!603 = distinct !DILexicalBlock(scope: !93, file: !6, line: 588, column: 7)
!604 = !DILocation(line: 588, column: 7, scope: !93)
!605 = !DILocation(line: 590, column: 7, scope: !606)
!606 = distinct !DILexicalBlock(scope: !603, file: !6, line: 589, column: 5)
!607 = !DILocation(line: 591, column: 7, scope: !606)
!608 = !DILocation(line: 595, column: 37, scope: !93)
!609 = !DILocation(line: 595, column: 35, scope: !93)
!610 = !DILocation(line: 596, column: 29, scope: !93)
!611 = !DILocation(line: 597, column: 8, scope: !108)
!612 = !DILocation(line: 597, column: 7, scope: !93)
!613 = !DILocation(line: 604, column: 24, scope: !107)
!614 = !DILocation(line: 604, column: 12, scope: !108)
!615 = !DILocation(line: 0, scope: !106)
!616 = !DILocation(line: 610, column: 16, scope: !106)
!617 = !DILocation(line: 610, column: 7, scope: !106)
!618 = !DILocation(line: 611, column: 21, scope: !106)
!619 = !{!620, !620, i64 0}
!620 = !{!"short", !490, i64 0}
!621 = !DILocation(line: 611, column: 19, scope: !106)
!622 = !DILocation(line: 611, column: 16, scope: !106)
!623 = !DILocation(line: 610, column: 30, scope: !106)
!624 = distinct !{!624, !617, !618, !552}
!625 = !DILocation(line: 612, column: 18, scope: !626)
!626 = distinct !DILexicalBlock(scope: !106, file: !6, line: 612, column: 11)
!627 = !DILocation(line: 612, column: 11, scope: !106)
!628 = !DILocation(line: 620, column: 23, scope: !93)
!629 = !DILocation(line: 625, column: 39, scope: !93)
!630 = !DILocation(line: 626, column: 3, scope: !93)
!631 = !DILocation(line: 626, column: 10, scope: !93)
!632 = !DILocation(line: 626, column: 21, scope: !93)
!633 = !DILocation(line: 628, column: 44, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !6, line: 628, column: 11)
!635 = distinct !DILexicalBlock(scope: !93, file: !6, line: 627, column: 5)
!636 = !DILocation(line: 628, column: 32, scope: !634)
!637 = !DILocation(line: 628, column: 49, scope: !634)
!638 = !DILocation(line: 628, column: 11, scope: !635)
!639 = !DILocation(line: 630, column: 11, scope: !640)
!640 = distinct !DILexicalBlock(scope: !635, file: !6, line: 630, column: 11)
!641 = !DILocation(line: 630, column: 11, scope: !635)
!642 = !DILocation(line: 632, column: 26, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !6, line: 632, column: 15)
!644 = distinct !DILexicalBlock(scope: !640, file: !6, line: 631, column: 9)
!645 = !DILocation(line: 632, column: 34, scope: !643)
!646 = !DILocation(line: 632, column: 37, scope: !643)
!647 = !DILocation(line: 632, column: 15, scope: !644)
!648 = !DILocation(line: 636, column: 29, scope: !649)
!649 = distinct !DILexicalBlock(scope: !644, file: !6, line: 636, column: 15)
!650 = !DILocation(line: 640, column: 16, scope: !635)
!651 = distinct !{!651, !630, !652, !552}
!652 = !DILocation(line: 641, column: 5, scope: !93)
!653 = !DILocation(line: 644, column: 3, scope: !93)
!654 = !DILocation(line: 0, scope: !535, inlinedAt: !655)
!655 = distinct !DILocation(line: 648, column: 31, scope: !93)
!656 = !DILocation(line: 0, scope: !535, inlinedAt: !657)
!657 = distinct !DILocation(line: 649, column: 31, scope: !93)
!658 = !DILocation(line: 0, scope: !535, inlinedAt: !659)
!659 = distinct !DILocation(line: 650, column: 31, scope: !93)
!660 = !DILocation(line: 0, scope: !535, inlinedAt: !661)
!661 = distinct !DILocation(line: 651, column: 31, scope: !93)
!662 = !DILocation(line: 0, scope: !535, inlinedAt: !663)
!663 = distinct !DILocation(line: 652, column: 31, scope: !93)
!664 = !DILocation(line: 0, scope: !535, inlinedAt: !665)
!665 = distinct !DILocation(line: 653, column: 31, scope: !93)
!666 = !DILocation(line: 0, scope: !535, inlinedAt: !667)
!667 = distinct !DILocation(line: 654, column: 31, scope: !93)
!668 = !DILocation(line: 0, scope: !535, inlinedAt: !669)
!669 = distinct !DILocation(line: 655, column: 31, scope: !93)
!670 = !DILocation(line: 0, scope: !535, inlinedAt: !671)
!671 = distinct !DILocation(line: 656, column: 31, scope: !93)
!672 = !DILocation(line: 0, scope: !535, inlinedAt: !673)
!673 = distinct !DILocation(line: 657, column: 31, scope: !93)
!674 = !DILocation(line: 663, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !93, file: !6, line: 663, column: 7)
!676 = !DILocation(line: 664, column: 7, scope: !675)
!677 = !DILocation(line: 664, column: 10, scope: !675)
!678 = !DILocation(line: 663, column: 7, scope: !93)
!679 = !DILocation(line: 669, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !675, file: !6, line: 665, column: 5)
!681 = !DILocation(line: 671, column: 5, scope: !680)
!682 = !DILocation(line: 676, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !675, file: !6, line: 673, column: 5)
!684 = !DILocation(line: 679, column: 3, scope: !93)
!685 = !DILocation(line: 683, column: 3, scope: !93)
!686 = !DILocation(line: 686, column: 3, scope: !93)
!687 = !DILocation(line: 688, column: 3, scope: !93)
!688 = !DILocation(line: 691, column: 3, scope: !93)
!689 = !DILocation(line: 695, column: 3, scope: !93)
!690 = !DILocation(line: 696, column: 1, scope: !93)
!691 = !DISubprogram(name: "setlocale", scope: !692, file: !692, line: 122, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!692 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!693 = !DISubroutineType(types: !694)
!694 = !{!27, !25, !35}
!695 = !DISubprogram(name: "getenv", scope: !696, file: !696, line: 641, type: !697, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!696 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!697 = !DISubroutineType(types: !698)
!698 = !{!27, !35}
!699 = !DISubprogram(name: "fwrite_unlocked", scope: !211, file: !211, line: 704, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!700 = !DISubroutineType(types: !701)
!701 = !{!86, !702, !86, !86, !582}
!702 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!705 = !DILocation(line: 0, scope: !22)
!706 = !DILocation(line: 111, column: 21, scope: !22)
!707 = !DILocation(line: 111, column: 3, scope: !22)
!708 = !DILocation(line: 112, column: 3, scope: !22)
!709 = !DILocation(line: 113, column: 3, scope: !22)
!710 = !DILocation(line: 114, column: 3, scope: !22)
!711 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !6, line: 102, type: !25)
!712 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 102, type: !478, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !713)
!713 = !{!711}
!714 = !DILocation(line: 0, scope: !712, inlinedAt: !715)
!715 = distinct !DILocation(line: 116, column: 3, scope: !22)
!716 = !DILocation(line: 105, column: 18, scope: !717, inlinedAt: !715)
!717 = distinct !DILexicalBlock(scope: !712, file: !6, line: 104, column: 7)
!718 = !DILocation(line: 117, column: 3, scope: !22)
!719 = !DILocation(line: 119, column: 17, scope: !42)
!720 = !DILocation(line: 119, column: 3, scope: !43)
!721 = !DILocation(line: 121, column: 23, scope: !41)
!722 = !DILocation(line: 0, scope: !41)
!723 = !DILocation(line: 123, column: 11, scope: !46)
!724 = !DILocation(line: 123, column: 16, scope: !46)
!725 = !DILocation(line: 123, column: 23, scope: !46)
!726 = !DILocation(line: 123, column: 44, scope: !46)
!727 = !DILocation(line: 123, column: 49, scope: !46)
!728 = !DILocation(line: 123, column: 56, scope: !46)
!729 = !DILocation(line: 123, column: 41, scope: !46)
!730 = !DILocation(line: 123, column: 37, scope: !46)
!731 = !DILocalVariable(name: "c", arg: 1, scope: !732, file: !733, line: 233, type: !25)
!732 = distinct !DISubprogram(name: "c_isdigit", scope: !733, file: !733, line: 233, type: !734, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !736)
!733 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!734 = !DISubroutineType(types: !735)
!735 = !{!38, !25}
!736 = !{!731}
!737 = !DILocation(line: 0, scope: !732, inlinedAt: !738)
!738 = distinct !DILocation(line: 123, column: 26, scope: !46)
!739 = !DILocation(line: 235, column: 3, scope: !732, inlinedAt: !738)
!740 = !DILocation(line: 123, column: 11, scope: !41)
!741 = !DILocation(line: 126, column: 11, scope: !742)
!742 = distinct !DILexicalBlock(scope: !46, file: !3, line: 124, column: 9)
!743 = !DILocation(line: 127, column: 9, scope: !742)
!744 = !DILocation(line: 131, column: 37, scope: !45)
!745 = !DILocation(line: 131, column: 32, scope: !45)
!746 = !DILocation(line: 0, scope: !45)
!747 = !DILocation(line: 132, column: 35, scope: !45)
!748 = !DILocation(line: 135, column: 26, scope: !45)
!749 = !DILocation(line: 135, column: 24, scope: !45)
!750 = !DILocation(line: 138, column: 18, scope: !45)
!751 = !DILocation(line: 140, column: 15, scope: !45)
!752 = !DILocation(line: 141, column: 16, scope: !45)
!753 = !DILocation(line: 141, column: 13, scope: !45)
!754 = !DILocation(line: 143, column: 11, scope: !45)
!755 = !DILocation(line: 152, column: 13, scope: !756)
!756 = distinct !DILexicalBlock(scope: !45, file: !3, line: 144, column: 13)
!757 = !DILocation(line: 154, column: 13, scope: !756)
!758 = !DILocation(line: 157, column: 15, scope: !756)
!759 = !DILocation(line: 146, column: 34, scope: !756)
!760 = !DILocation(line: 0, scope: !46)
!761 = !DILocation(line: 0, scope: !43)
!762 = !DILocation(line: 166, column: 7, scope: !51)
!763 = !DILocation(line: 166, column: 7, scope: !22)
!764 = !DILocation(line: 179, column: 7, scope: !50)
!765 = !DILocation(line: 0, scope: !50)
!766 = !DILocation(line: 180, column: 30, scope: !767)
!767 = distinct !DILexicalBlock(scope: !50, file: !3, line: 180, column: 11)
!768 = !DILocation(line: 180, column: 28, scope: !767)
!769 = !DILocation(line: 180, column: 11, scope: !50)
!770 = !DILocation(line: 181, column: 9, scope: !767)
!771 = !DILocation(line: 213, column: 9, scope: !772)
!772 = distinct !DILexicalBlock(scope: !22, file: !3, line: 213, column: 7)
!773 = !DILocation(line: 213, column: 7, scope: !22)
!774 = !DILocation(line: 209, column: 20, scope: !50)
!775 = !{!776, !776, i64 0}
!776 = !{!"long", !490, i64 0}
!777 = !DILocation(line: 211, column: 5, scope: !51)
!778 = !DILocation(line: 217, column: 11, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !3, line: 216, column: 9)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 215, column: 11)
!781 = distinct !DILexicalBlock(scope: !772, file: !3, line: 214, column: 5)
!782 = !DILocation(line: 218, column: 11, scope: !779)
!783 = !DILocation(line: 221, column: 7, scope: !781)
!784 = !DILocation(line: 221, column: 13, scope: !781)
!785 = !DILocation(line: 222, column: 26, scope: !781)
!786 = !DILocation(line: 223, column: 28, scope: !787)
!787 = distinct !DILexicalBlock(scope: !781, file: !3, line: 223, column: 11)
!788 = !DILocation(line: 223, column: 34, scope: !787)
!789 = !DILocation(line: 223, column: 37, scope: !787)
!790 = !DILocation(line: 223, column: 43, scope: !787)
!791 = !DILocation(line: 223, column: 11, scope: !781)
!792 = !DILocation(line: 224, column: 9, scope: !787)
!793 = !DILocation(line: 225, column: 7, scope: !781)
!794 = !DILocation(line: 226, column: 7, scope: !781)
!795 = !DILocation(line: 229, column: 3, scope: !22)
!796 = !DILocation(line: 229, column: 9, scope: !22)
!797 = !DILocation(line: 233, column: 22, scope: !22)
!798 = !DILocation(line: 234, column: 24, scope: !799)
!799 = distinct !DILexicalBlock(scope: !22, file: !3, line: 234, column: 7)
!800 = !DILocation(line: 234, column: 30, scope: !799)
!801 = !DILocation(line: 234, column: 33, scope: !799)
!802 = !DILocation(line: 234, column: 39, scope: !799)
!803 = !DILocation(line: 234, column: 7, scope: !22)
!804 = !DILocation(line: 235, column: 5, scope: !799)
!805 = !DILocation(line: 236, column: 56, scope: !22)
!806 = !DILocation(line: 236, column: 9, scope: !22)
!807 = !DILocation(line: 236, column: 70, scope: !22)
!808 = !DILocation(line: 238, column: 7, scope: !22)
!809 = !DILocation(line: 240, column: 7, scope: !54)
!810 = !DILocalVariable(name: "err", arg: 1, scope: !811, file: !3, line: 96, type: !25)
!811 = distinct !DISubprogram(name: "perm_related_errno", scope: !3, file: !3, line: 96, type: !734, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !812)
!812 = !{!810}
!813 = !DILocation(line: 0, scope: !811, inlinedAt: !814)
!814 = distinct !DILocation(line: 240, column: 7, scope: !54)
!815 = !DILocation(line: 98, column: 14, scope: !811, inlinedAt: !814)
!816 = !DILocation(line: 98, column: 24, scope: !811, inlinedAt: !814)
!817 = !DILocation(line: 0, scope: !54)
!818 = !DILocation(line: 247, column: 11, scope: !819)
!819 = distinct !DILexicalBlock(scope: !55, file: !3, line: 247, column: 11)
!820 = !DILocalVariable(name: "__stream", arg: 1, scope: !821, file: !822, line: 135, type: !115)
!821 = distinct !DISubprogram(name: "ferror_unlocked", scope: !822, file: !822, line: 135, type: !823, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !825)
!822 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!823 = !DISubroutineType(types: !824)
!824 = !{!25, !115}
!825 = !{!820}
!826 = !DILocation(line: 0, scope: !821, inlinedAt: !827)
!827 = distinct !DILocation(line: 247, column: 11, scope: !819)
!828 = !DILocation(line: 137, column: 10, scope: !821, inlinedAt: !827)
!829 = !{!830, !586, i64 0}
!830 = !{!"_IO_FILE", !586, i64 0, !489, i64 8, !489, i64 16, !489, i64 24, !489, i64 32, !489, i64 40, !489, i64 48, !489, i64 56, !489, i64 64, !489, i64 72, !489, i64 80, !489, i64 88, !489, i64 96, !489, i64 104, !586, i64 112, !586, i64 116, !776, i64 120, !620, i64 128, !490, i64 130, !490, i64 131, !489, i64 136, !776, i64 144, !489, i64 152, !489, i64 160, !489, i64 168, !489, i64 176, !776, i64 184, !586, i64 192, !490, i64 196}
!831 = !DILocation(line: 247, column: 11, scope: !55)
!832 = !DILocation(line: 251, column: 11, scope: !22)
!833 = !DILocation(line: 251, column: 3, scope: !22)
!834 = !DILocation(line: 253, column: 21, scope: !22)
!835 = !DILocation(line: 253, column: 27, scope: !22)
!836 = !DILocation(line: 254, column: 3, scope: !22)
!837 = !DILocation(line: 256, column: 1, scope: !22)
!838 = !DISubprogram(name: "bindtextdomain", scope: !575, file: !575, line: 86, type: !839, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!839 = !DISubroutineType(types: !840)
!840 = !{!27, !35, !35}
!841 = !DISubprogram(name: "textdomain", scope: !575, file: !575, line: 82, type: !697, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!842 = !DISubprogram(name: "atexit", scope: !696, file: !696, line: 602, type: !843, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!843 = !DISubroutineType(types: !844)
!844 = !{!25, !237}
!845 = !DISubprogram(name: "getopt_long", scope: !178, file: !178, line: 66, type: !846, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!846 = !DISubroutineType(types: !847)
!847 = !{!25, !25, !848, !35, !850, !183}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!851 = !DISubprogram(name: "getpriority", scope: !852, file: !852, line: 105, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!852 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "e55940cb1bf33174af2c45f02cd69e8a")
!853 = !DISubroutineType(types: !854)
!854 = !{!25, !855, !856}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "__priority_which_t", file: !852, line: 40, baseType: !62)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !857, line: 103, baseType: !858)
!857 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__id_t", file: !142, line: 159, baseType: !7)
!859 = !DISubprogram(name: "setpriority", scope: !852, file: !852, line: 109, type: !860, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!860 = !DISubroutineType(types: !861)
!861 = !{!25, !855, !856, !25}
!862 = !DISubprogram(name: "execvp", scope: !863, file: !863, line: 599, type: !864, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!863 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!864 = !DISubroutineType(types: !865)
!865 = !{!25, !35, !848}
!866 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !195, file: !195, line: 50, type: !505, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !867)
!867 = !{!868}
!868 = !DILocalVariable(name: "file", arg: 1, scope: !866, file: !195, line: 50, type: !35)
!869 = !DILocation(line: 0, scope: !866)
!870 = !DILocation(line: 52, column: 13, scope: !866)
!871 = !DILocation(line: 53, column: 1, scope: !866)
!872 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !195, file: !195, line: 87, type: !873, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !875)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !38}
!875 = !{!876}
!876 = !DILocalVariable(name: "ignore", arg: 1, scope: !872, file: !195, line: 87, type: !38)
!877 = !DILocation(line: 0, scope: !872)
!878 = !DILocation(line: 89, column: 16, scope: !872)
!879 = !{!880, !880, i64 0}
!880 = !{!"_Bool", !490, i64 0}
!881 = !DILocation(line: 90, column: 1, scope: !872)
!882 = distinct !DISubprogram(name: "close_stdout", scope: !195, file: !195, line: 116, type: !238, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !883)
!883 = !{!884}
!884 = !DILocalVariable(name: "write_error", scope: !885, file: !195, line: 121, type: !35)
!885 = distinct !DILexicalBlock(scope: !886, file: !195, line: 120, column: 5)
!886 = distinct !DILexicalBlock(scope: !882, file: !195, line: 118, column: 7)
!887 = !DILocation(line: 118, column: 21, scope: !886)
!888 = !DILocation(line: 118, column: 7, scope: !886)
!889 = !DILocation(line: 118, column: 29, scope: !886)
!890 = !DILocation(line: 119, column: 7, scope: !886)
!891 = !DILocation(line: 119, column: 12, scope: !886)
!892 = !{i8 0, i8 2}
!893 = !DILocation(line: 119, column: 25, scope: !886)
!894 = !DILocation(line: 119, column: 28, scope: !886)
!895 = !DILocation(line: 119, column: 34, scope: !886)
!896 = !DILocation(line: 118, column: 7, scope: !882)
!897 = !DILocation(line: 121, column: 33, scope: !885)
!898 = !DILocation(line: 0, scope: !885)
!899 = !DILocation(line: 122, column: 11, scope: !900)
!900 = distinct !DILexicalBlock(scope: !885, file: !195, line: 122, column: 11)
!901 = !DILocation(line: 0, scope: !900)
!902 = !DILocation(line: 122, column: 11, scope: !885)
!903 = !DILocation(line: 123, column: 9, scope: !900)
!904 = !DILocation(line: 126, column: 9, scope: !900)
!905 = !DILocation(line: 128, column: 14, scope: !885)
!906 = !DILocation(line: 128, column: 7, scope: !885)
!907 = !DILocation(line: 133, column: 42, scope: !908)
!908 = distinct !DILexicalBlock(scope: !882, file: !195, line: 133, column: 7)
!909 = !DILocation(line: 133, column: 28, scope: !908)
!910 = !DILocation(line: 133, column: 50, scope: !908)
!911 = !DILocation(line: 133, column: 7, scope: !882)
!912 = !DILocation(line: 134, column: 12, scope: !908)
!913 = !DILocation(line: 134, column: 5, scope: !908)
!914 = !DILocation(line: 135, column: 1, scope: !882)
!915 = distinct !DISubprogram(name: "verror", scope: !202, file: !202, line: 251, type: !916, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !918)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !25, !25, !35, !210}
!918 = !{!919, !920, !921, !922}
!919 = !DILocalVariable(name: "status", arg: 1, scope: !915, file: !202, line: 251, type: !25)
!920 = !DILocalVariable(name: "errnum", arg: 2, scope: !915, file: !202, line: 251, type: !25)
!921 = !DILocalVariable(name: "message", arg: 3, scope: !915, file: !202, line: 251, type: !35)
!922 = !DILocalVariable(name: "args", arg: 4, scope: !915, file: !202, line: 251, type: !210)
!923 = !DILocation(line: 0, scope: !915)
!924 = !DILocation(line: 251, column: 1, scope: !915)
!925 = !DILocation(line: 261, column: 3, scope: !915)
!926 = !DILocation(line: 265, column: 7, scope: !927)
!927 = distinct !DILexicalBlock(scope: !915, file: !202, line: 265, column: 7)
!928 = !DILocation(line: 265, column: 7, scope: !915)
!929 = !DILocation(line: 266, column: 5, scope: !927)
!930 = !DILocation(line: 272, column: 7, scope: !931)
!931 = distinct !DILexicalBlock(scope: !927, file: !202, line: 268, column: 5)
!932 = !DILocation(line: 276, column: 3, scope: !915)
!933 = !{i64 0, i64 8, !488, i64 8, i64 8, !488, i64 16, i64 8, !488, i64 24, i64 4, !585, i64 28, i64 4, !585}
!934 = !DILocation(line: 282, column: 1, scope: !915)
!935 = distinct !DISubprogram(name: "flush_stdout", scope: !202, file: !202, line: 163, type: !238, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !936)
!936 = !{!937}
!937 = !DILocalVariable(name: "stdout_fd", scope: !935, file: !202, line: 166, type: !25)
!938 = !DILocation(line: 0, scope: !935)
!939 = !DILocalVariable(name: "fd", arg: 1, scope: !940, file: !202, line: 145, type: !25)
!940 = distinct !DISubprogram(name: "is_open", scope: !202, file: !202, line: 145, type: !941, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{!25, !25}
!943 = !{!939}
!944 = !DILocation(line: 0, scope: !940, inlinedAt: !945)
!945 = distinct !DILocation(line: 182, column: 25, scope: !946)
!946 = distinct !DILexicalBlock(scope: !935, file: !202, line: 182, column: 7)
!947 = !DILocation(line: 157, column: 15, scope: !940, inlinedAt: !945)
!948 = !DILocation(line: 182, column: 25, scope: !946)
!949 = !DILocation(line: 182, column: 7, scope: !935)
!950 = !DILocation(line: 184, column: 5, scope: !946)
!951 = !DILocation(line: 185, column: 1, scope: !935)
!952 = distinct !DISubprogram(name: "error_tail", scope: !202, file: !202, line: 219, type: !916, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DILocalVariable(name: "status", arg: 1, scope: !952, file: !202, line: 219, type: !25)
!955 = !DILocalVariable(name: "errnum", arg: 2, scope: !952, file: !202, line: 219, type: !25)
!956 = !DILocalVariable(name: "message", arg: 3, scope: !952, file: !202, line: 219, type: !35)
!957 = !DILocalVariable(name: "args", arg: 4, scope: !952, file: !202, line: 219, type: !210)
!958 = !DILocation(line: 0, scope: !952)
!959 = !DILocation(line: 219, column: 1, scope: !952)
!960 = !DILocation(line: 229, column: 13, scope: !952)
!961 = !DILocation(line: 229, column: 3, scope: !952)
!962 = !DILocalVariable(name: "__stream", arg: 1, scope: !963, file: !964, line: 132, type: !967)
!963 = distinct !DISubprogram(name: "vfprintf", scope: !964, file: !964, line: 132, type: !965, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1002)
!964 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!965 = !DISubroutineType(types: !966)
!966 = !{!25, !967, !581, !212}
!967 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 7, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 49, size: 1728, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !970, file: !119, line: 51, baseType: !25, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !970, file: !119, line: 54, baseType: !27, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !970, file: !119, line: 55, baseType: !27, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !970, file: !119, line: 56, baseType: !27, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !970, file: !119, line: 57, baseType: !27, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !970, file: !119, line: 58, baseType: !27, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !970, file: !119, line: 59, baseType: !27, size: 64, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !970, file: !119, line: 60, baseType: !27, size: 64, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !970, file: !119, line: 61, baseType: !27, size: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !970, file: !119, line: 64, baseType: !27, size: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !970, file: !119, line: 65, baseType: !27, size: 64, offset: 640)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !970, file: !119, line: 66, baseType: !27, size: 64, offset: 704)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !970, file: !119, line: 68, baseType: !134, size: 64, offset: 768)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !970, file: !119, line: 70, baseType: !986, size: 64, offset: 832)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !970, file: !119, line: 72, baseType: !25, size: 32, offset: 896)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !970, file: !119, line: 73, baseType: !25, size: 32, offset: 928)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !970, file: !119, line: 74, baseType: !141, size: 64, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !970, file: !119, line: 77, baseType: !85, size: 16, offset: 1024)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !970, file: !119, line: 78, baseType: !145, size: 8, offset: 1040)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !970, file: !119, line: 79, baseType: !147, size: 8, offset: 1048)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !970, file: !119, line: 81, baseType: !151, size: 64, offset: 1088)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !970, file: !119, line: 89, baseType: !154, size: 64, offset: 1152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !970, file: !119, line: 91, baseType: !156, size: 64, offset: 1216)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !970, file: !119, line: 92, baseType: !159, size: 64, offset: 1280)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !970, file: !119, line: 93, baseType: !986, size: 64, offset: 1344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !970, file: !119, line: 94, baseType: !84, size: 64, offset: 1408)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !970, file: !119, line: 95, baseType: !86, size: 64, offset: 1472)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !970, file: !119, line: 96, baseType: !25, size: 32, offset: 1536)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !970, file: !119, line: 98, baseType: !166, size: 160, offset: 1568)
!1002 = !{!962, !1003, !1004}
!1003 = !DILocalVariable(name: "__fmt", arg: 2, scope: !963, file: !964, line: 133, type: !581)
!1004 = !DILocalVariable(name: "__ap", arg: 3, scope: !963, file: !964, line: 133, type: !212)
!1005 = !DILocation(line: 0, scope: !963, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 229, column: 3, scope: !952)
!1007 = !DILocation(line: 135, column: 10, scope: !963, inlinedAt: !1006)
!1008 = !{!1009, !1011}
!1009 = distinct !{!1009, !1010, !"vfprintf.inline: argument 0"}
!1010 = distinct !{!1010, !"vfprintf.inline"}
!1011 = distinct !{!1011, !1010, !"vfprintf.inline: argument 1"}
!1012 = !DILocation(line: 232, column: 3, scope: !952)
!1013 = !DILocation(line: 233, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !952, file: !202, line: 233, column: 7)
!1015 = !DILocation(line: 233, column: 7, scope: !952)
!1016 = !DILocalVariable(name: "errnum", arg: 1, scope: !1017, file: !202, line: 188, type: !25)
!1017 = distinct !DISubprogram(name: "print_errno_message", scope: !202, file: !202, line: 188, type: !478, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1018)
!1018 = !{!1016, !1019, !1020}
!1019 = !DILocalVariable(name: "s", scope: !1017, file: !202, line: 190, type: !35)
!1020 = !DILocalVariable(name: "errbuf", scope: !1017, file: !202, line: 193, type: !1021)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 1024)
!1024 = !DILocation(line: 0, scope: !1017, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 234, column: 5, scope: !1014)
!1026 = !DILocation(line: 193, column: 3, scope: !1017, inlinedAt: !1025)
!1027 = !DILocation(line: 193, column: 8, scope: !1017, inlinedAt: !1025)
!1028 = !DILocation(line: 195, column: 7, scope: !1017, inlinedAt: !1025)
!1029 = !DILocation(line: 207, column: 9, scope: !1030, inlinedAt: !1025)
!1030 = distinct !DILexicalBlock(scope: !1017, file: !202, line: 207, column: 7)
!1031 = !DILocation(line: 207, column: 7, scope: !1017, inlinedAt: !1025)
!1032 = !DILocation(line: 208, column: 9, scope: !1030, inlinedAt: !1025)
!1033 = !DILocation(line: 208, column: 5, scope: !1030, inlinedAt: !1025)
!1034 = !DILocation(line: 214, column: 3, scope: !1017, inlinedAt: !1025)
!1035 = !DILocation(line: 216, column: 1, scope: !1017, inlinedAt: !1025)
!1036 = !DILocation(line: 234, column: 5, scope: !1014)
!1037 = !DILocation(line: 238, column: 3, scope: !952)
!1038 = !DILocalVariable(name: "__c", arg: 1, scope: !1039, file: !822, line: 101, type: !25)
!1039 = distinct !DISubprogram(name: "putc_unlocked", scope: !822, file: !822, line: 101, type: !1040, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1042)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!25, !25, !968}
!1042 = !{!1038, !1043}
!1043 = !DILocalVariable(name: "__stream", arg: 2, scope: !1039, file: !822, line: 101, type: !968)
!1044 = !DILocation(line: 0, scope: !1039, inlinedAt: !1045)
!1045 = distinct !DILocation(line: 238, column: 3, scope: !952)
!1046 = !DILocation(line: 103, column: 10, scope: !1039, inlinedAt: !1045)
!1047 = !{!830, !489, i64 40}
!1048 = !{!830, !489, i64 48}
!1049 = !{!"branch_weights", i32 2000, i32 1}
!1050 = !DILocation(line: 240, column: 3, scope: !952)
!1051 = !DILocation(line: 241, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !952, file: !202, line: 241, column: 7)
!1053 = !DILocation(line: 241, column: 7, scope: !952)
!1054 = !DILocation(line: 242, column: 5, scope: !1052)
!1055 = !DILocation(line: 243, column: 1, scope: !952)
!1056 = !DISubprogram(name: "strerror_r", scope: !1057, file: !1057, line: 444, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!1057 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!27, !25, !27, !86}
!1060 = !DISubprogram(name: "fflush_unlocked", scope: !211, file: !211, line: 239, type: !1061, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!25, !968}
!1063 = !DISubprogram(name: "fcntl", scope: !1064, file: !1064, line: 149, type: !1065, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!1064 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!25, !25, !25, null}
!1067 = distinct !DISubprogram(name: "error", scope: !202, file: !202, line: 285, type: !1068, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !25, !25, !35, null}
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DILocalVariable(name: "status", arg: 1, scope: !1067, file: !202, line: 285, type: !25)
!1072 = !DILocalVariable(name: "errnum", arg: 2, scope: !1067, file: !202, line: 285, type: !25)
!1073 = !DILocalVariable(name: "message", arg: 3, scope: !1067, file: !202, line: 285, type: !35)
!1074 = !DILocalVariable(name: "ap", scope: !1067, file: !202, line: 287, type: !210)
!1075 = !DILocation(line: 0, scope: !1067)
!1076 = !DILocation(line: 287, column: 3, scope: !1067)
!1077 = !DILocation(line: 287, column: 11, scope: !1067)
!1078 = !DILocation(line: 288, column: 3, scope: !1067)
!1079 = !DILocation(line: 289, column: 3, scope: !1067)
!1080 = !DILocation(line: 290, column: 3, scope: !1067)
!1081 = !DILocation(line: 291, column: 1, scope: !1067)
!1082 = !DILocation(line: 0, scope: !207)
!1083 = !DILocation(line: 298, column: 1, scope: !207)
!1084 = !DILocation(line: 302, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !207, file: !202, line: 302, column: 7)
!1086 = !DILocation(line: 302, column: 7, scope: !207)
!1087 = !DILocation(line: 307, column: 11, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !202, line: 307, column: 11)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !202, line: 303, column: 5)
!1090 = !DILocation(line: 307, column: 27, scope: !1088)
!1091 = !DILocation(line: 308, column: 11, scope: !1088)
!1092 = !DILocation(line: 308, column: 28, scope: !1088)
!1093 = !DILocation(line: 308, column: 25, scope: !1088)
!1094 = !DILocation(line: 309, column: 15, scope: !1088)
!1095 = !DILocation(line: 309, column: 33, scope: !1088)
!1096 = !DILocation(line: 310, column: 19, scope: !1088)
!1097 = !DILocation(line: 311, column: 22, scope: !1088)
!1098 = !DILocation(line: 311, column: 56, scope: !1088)
!1099 = !DILocation(line: 307, column: 11, scope: !1089)
!1100 = !DILocation(line: 316, column: 21, scope: !1089)
!1101 = !DILocation(line: 317, column: 23, scope: !1089)
!1102 = !DILocation(line: 318, column: 5, scope: !1089)
!1103 = !DILocation(line: 327, column: 3, scope: !207)
!1104 = !DILocation(line: 331, column: 7, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !207, file: !202, line: 331, column: 7)
!1106 = !DILocation(line: 331, column: 7, scope: !207)
!1107 = !DILocation(line: 332, column: 5, scope: !1105)
!1108 = !DILocation(line: 338, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !202, line: 334, column: 5)
!1110 = !DILocation(line: 346, column: 3, scope: !207)
!1111 = !DILocation(line: 350, column: 3, scope: !207)
!1112 = !DILocation(line: 356, column: 1, scope: !207)
!1113 = distinct !DISubprogram(name: "error_at_line", scope: !202, file: !202, line: 359, type: !1114, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{null, !25, !25, !35, !7, !35, null}
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122}
!1117 = !DILocalVariable(name: "status", arg: 1, scope: !1113, file: !202, line: 359, type: !25)
!1118 = !DILocalVariable(name: "errnum", arg: 2, scope: !1113, file: !202, line: 359, type: !25)
!1119 = !DILocalVariable(name: "file_name", arg: 3, scope: !1113, file: !202, line: 359, type: !35)
!1120 = !DILocalVariable(name: "line_number", arg: 4, scope: !1113, file: !202, line: 360, type: !7)
!1121 = !DILocalVariable(name: "message", arg: 5, scope: !1113, file: !202, line: 360, type: !35)
!1122 = !DILocalVariable(name: "ap", scope: !1113, file: !202, line: 362, type: !210)
!1123 = !DILocation(line: 0, scope: !1113)
!1124 = !DILocation(line: 362, column: 3, scope: !1113)
!1125 = !DILocation(line: 362, column: 11, scope: !1113)
!1126 = !DILocation(line: 363, column: 3, scope: !1113)
!1127 = !DILocation(line: 364, column: 3, scope: !1113)
!1128 = !DILocation(line: 366, column: 3, scope: !1113)
!1129 = !DILocation(line: 367, column: 1, scope: !1113)
!1130 = distinct !DISubprogram(name: "getprogname", scope: !400, file: !400, line: 54, type: !1131, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !497)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!35}
!1133 = !DILocation(line: 58, column: 10, scope: !1130)
!1134 = !DILocation(line: 58, column: 3, scope: !1130)
!1135 = distinct !DISubprogram(name: "set_program_name", scope: !243, file: !243, line: 37, type: !505, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !242, retainedNodes: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DILocalVariable(name: "argv0", arg: 1, scope: !1135, file: !243, line: 37, type: !35)
!1138 = !DILocalVariable(name: "slash", scope: !1135, file: !243, line: 44, type: !35)
!1139 = !DILocalVariable(name: "base", scope: !1135, file: !243, line: 45, type: !35)
!1140 = !DILocation(line: 0, scope: !1135)
!1141 = !DILocation(line: 44, column: 23, scope: !1135)
!1142 = !DILocation(line: 45, column: 22, scope: !1135)
!1143 = !DILocation(line: 46, column: 17, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1135, file: !243, line: 46, column: 7)
!1145 = !DILocation(line: 46, column: 9, scope: !1144)
!1146 = !DILocation(line: 46, column: 25, scope: !1144)
!1147 = !DILocation(line: 46, column: 40, scope: !1144)
!1148 = !DILocalVariable(name: "__s1", arg: 1, scope: !1149, file: !536, line: 974, type: !703)
!1149 = distinct !DISubprogram(name: "memeq", scope: !536, file: !536, line: 974, type: !1150, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !242, retainedNodes: !1152)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!38, !703, !703, !86}
!1152 = !{!1148, !1153, !1154}
!1153 = !DILocalVariable(name: "__s2", arg: 2, scope: !1149, file: !536, line: 974, type: !703)
!1154 = !DILocalVariable(name: "__n", arg: 3, scope: !1149, file: !536, line: 974, type: !86)
!1155 = !DILocation(line: 0, scope: !1149, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 46, column: 28, scope: !1144)
!1157 = !DILocation(line: 976, column: 11, scope: !1149, inlinedAt: !1156)
!1158 = !DILocation(line: 976, column: 10, scope: !1149, inlinedAt: !1156)
!1159 = !DILocation(line: 46, column: 7, scope: !1135)
!1160 = !DILocation(line: 49, column: 11, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !243, line: 49, column: 11)
!1162 = distinct !DILexicalBlock(scope: !1144, file: !243, line: 47, column: 5)
!1163 = !DILocation(line: 49, column: 36, scope: !1161)
!1164 = !DILocation(line: 49, column: 11, scope: !1162)
!1165 = !DILocation(line: 65, column: 16, scope: !1135)
!1166 = !DILocation(line: 71, column: 27, scope: !1135)
!1167 = !DILocation(line: 74, column: 33, scope: !1135)
!1168 = !DILocation(line: 76, column: 1, scope: !1135)
!1169 = !DILocation(line: 0, scope: !248)
!1170 = !DILocation(line: 40, column: 29, scope: !248)
!1171 = !DILocation(line: 41, column: 19, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !248, file: !249, line: 41, column: 7)
!1173 = !DILocation(line: 41, column: 7, scope: !248)
!1174 = !DILocation(line: 47, column: 3, scope: !248)
!1175 = !DILocation(line: 48, column: 3, scope: !248)
!1176 = !DILocation(line: 48, column: 13, scope: !248)
!1177 = !DILocalVariable(name: "ps", arg: 1, scope: !1178, file: !1179, line: 1135, type: !1182)
!1178 = distinct !DISubprogram(name: "mbszero", scope: !1179, file: !1179, line: 1135, type: !1180, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1183)
!1179 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1180 = !DISubroutineType(types: !1181)
!1181 = !{null, !1182}
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!1183 = !{!1177}
!1184 = !DILocation(line: 0, scope: !1178, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 48, column: 18, scope: !248)
!1186 = !DILocalVariable(name: "__dest", arg: 1, scope: !1187, file: !1188, line: 57, type: !84)
!1187 = distinct !DISubprogram(name: "memset", scope: !1188, file: !1188, line: 57, type: !1189, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !1191)
!1188 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!84, !84, !25, !86}
!1191 = !{!1186, !1192, !1193}
!1192 = !DILocalVariable(name: "__ch", arg: 2, scope: !1187, file: !1188, line: 57, type: !25)
!1193 = !DILocalVariable(name: "__len", arg: 3, scope: !1187, file: !1188, line: 57, type: !86)
!1194 = !DILocation(line: 0, scope: !1187, inlinedAt: !1195)
!1195 = distinct !DILocation(line: 1137, column: 3, scope: !1178, inlinedAt: !1185)
!1196 = !DILocation(line: 59, column: 10, scope: !1187, inlinedAt: !1195)
!1197 = !DILocation(line: 49, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !248, file: !249, line: 49, column: 7)
!1199 = !DILocation(line: 49, column: 39, scope: !1198)
!1200 = !DILocation(line: 49, column: 44, scope: !1198)
!1201 = !DILocation(line: 54, column: 1, scope: !248)
!1202 = !DISubprogram(name: "mbrtoc32", scope: !260, file: !260, line: 57, type: !1203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !497)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!86, !1205, !581, !86, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1182)
!1208 = distinct !DISubprogram(name: "clone_quoting_options", scope: !283, file: !283, line: 113, type: !1209, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !1212)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1211, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!1212 = !{!1213, !1214, !1215}
!1213 = !DILocalVariable(name: "o", arg: 1, scope: !1208, file: !283, line: 113, type: !1211)
!1214 = !DILocalVariable(name: "saved_errno", scope: !1208, file: !283, line: 115, type: !25)
!1215 = !DILocalVariable(name: "p", scope: !1208, file: !283, line: 116, type: !1211)
!1216 = !DILocation(line: 0, scope: !1208)
!1217 = !DILocation(line: 115, column: 21, scope: !1208)
!1218 = !DILocation(line: 116, column: 40, scope: !1208)
!1219 = !DILocation(line: 116, column: 31, scope: !1208)
!1220 = !DILocation(line: 118, column: 9, scope: !1208)
!1221 = !DILocation(line: 119, column: 3, scope: !1208)
!1222 = distinct !DISubprogram(name: "get_quoting_style", scope: !283, file: !283, line: 124, type: !1223, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !1227)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!285, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!1227 = !{!1228}
!1228 = !DILocalVariable(name: "o", arg: 1, scope: !1222, file: !283, line: 124, type: !1225)
!1229 = !DILocation(line: 0, scope: !1222)
!1230 = !DILocation(line: 126, column: 11, scope: !1222)
!1231 = !DILocation(line: 126, column: 46, scope: !1222)
!1232 = !{!1233, !490, i64 0}
!1233 = !{!"quoting_options", !490, i64 0, !586, i64 4, !490, i64 8, !489, i64 40, !489, i64 48}
!1234 = !DILocation(line: 126, column: 3, scope: !1222)
!1235 = distinct !DISubprogram(name: "set_quoting_style", scope: !283, file: !283, line: 132, type: !1236, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !1238)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !1211, !285}
!1238 = !{!1239, !1240}
!1239 = !DILocalVariable(name: "o", arg: 1, scope: !1235, file: !283, line: 132, type: !1211)
!1240 = !DILocalVariable(name: "s", arg: 2, scope: !1235, file: !283, line: 132, type: !285)
!1241 = !DILocation(line: 0, scope: !1235)
!1242 = !DILocation(line: 134, column: 4, scope: !1235)
!1243 = !DILocation(line: 134, column: 39, scope: !1235)
!1244 = !DILocation(line: 134, column: 45, scope: !1235)
!1245 = !DILocation(line: 135, column: 1, scope: !1235)
!1246 = distinct !DISubprogram(name: "set_char_quoting", scope: !283, file: !283, line: 143, type: !1247, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !1249)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!25, !1211, !28, !25}
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1256, !1257}
!1250 = !DILocalVariable(name: "o", arg: 1, scope: !1246, file: !283, line: 143, type: !1211)
!1251 = !DILocalVariable(name: "c", arg: 2, scope: !1246, file: !283, line: 143, type: !28)
!1252 = !DILocalVariable(name: "i", arg: 3, scope: !1246, file: !283, line: 143, type: !25)
!1253 = !DILocalVariable(name: "uc", scope: !1246, file: !283, line: 145, type: !89)
!1254 = !DILocalVariable(name: "p", scope: !1246, file: !283, line: 146, type: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1256 = !DILocalVariable(name: "shift", scope: !1246, file: !283, line: 148, type: !25)
