; ModuleID = 'src/nl.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.linebuffer = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.re_registers = type { i32, i32*, i32* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [62 x i8] c"Write each FILE to standard output, with line numbers added.\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"nl\00", align 1

!11 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!12 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 46, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 131, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!30 = !{!31}
!31 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 127, baseType: !7, size: 32, elements: !33)
!33 = !{!34}
!34 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 130, baseType: !7, size: 32, elements: !36)
!36 = !{!37}
!37 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !39, line: 42, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51}
!41 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!42 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!43 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!44 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!45 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!46 = !DIEnumerator(name: "c_quoting_style", value: 5)
!47 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!48 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!49 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!50 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!51 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !53, line: 44, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!54 = !{!55, !56, !57, !58, !59, !60}
!55 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!56 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!57 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!58 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!59 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!60 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "section", file: !3, line: 60, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIEnumerator(name: "Header", value: 0)
!64 = !DIEnumerator(name: "Body", value: 1)
!65 = !DIEnumerator(name: "Footer", value: 2)
!66 = !DIEnumerator(name: "Text", value: 3)
!67 = !{!68, !70, !71, !72, !73, !76, !78, !79}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!75 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!80 = !{!81, !83, !107, !109, !111, !116, !118, !120, !122, !124, !126, !128, !140, !146, !148, !0, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !255, !257, !262, !264, !266, !271, !273, !275, !277, !279, !282, !284}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "current_type", scope: !2, file: !3, line: 75, type: !76, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "body_regex", scope: !2, file: !3, line: 78, type: !85, isLocal: true, isDefinition: true)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !86, line: 413, size: 512, elements: !87)
!86 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!87 = !{!88, !91, !93, !94, !96, !97, !99, !100, !101, !102, !103, !104, !105, !106}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !85, file: !86, line: 417, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !86, line: 417, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !85, file: !86, line: 420, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !86, line: 56, baseType: !75)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !85, file: !86, line: 423, baseType: !92, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !85, file: !86, line: 426, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !86, line: 71, baseType: !75)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !85, file: !86, line: 431, baseType: !68, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !85, file: !86, line: 437, baseType: !98, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !85, file: !86, line: 440, baseType: !73, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !85, file: !86, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !85, file: !86, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !85, file: !86, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !85, file: !86, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !85, file: !86, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !85, file: !86, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !85, file: !86, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "header_regex", scope: !2, file: !3, line: 81, type: !85, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "footer_regex", scope: !2, file: !3, line: 84, type: !85, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !2, file: !3, line: 87, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 2048, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 256)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !2, file: !3, line: 88, type: !113, isLocal: true, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !2, file: !3, line: 89, type: !113, isLocal: true, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "section_del_len", scope: !2, file: !3, line: 101, type: !73, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "header_del_len", scope: !2, file: !3, line: 107, type: !73, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "body_del_len", scope: !2, file: !3, line: 113, type: !73, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !2, file: !3, line: 119, type: !73, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "line_buf", scope: !2, file: !3, line: 122, type: !130, isLocal: true, isDefinition: true)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !131, line: 32, size: 192, elements: !132)
!131 = !DIFile(filename: "./lib/linebuffer.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a0b4e97fdade8fc6fdf94c5a34c83419")
!132 = !{!133, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !130, file: !131, line: 34, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !135, line: 130, baseType: !136)
!135 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !74, line: 35, baseType: !137)
!137 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !130, file: !131, line: 35, baseType: !134, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !130, file: !131, line: 36, baseType: !68, size: 64, offset: 128)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "line_no", scope: !2, file: !3, line: 146, type: !142, isLocal: true, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !143, line: 101, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !145, line: 72, baseType: !137)
!145 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 152, type: !79, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !150, file: !151, line: 575, type: !71, isLocal: true, isDefinition: true)
!150 = distinct !DISubprogram(name: "oputs_", scope: !151, file: !151, line: 573, type: !152, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!151 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!152 = !DISubroutineType(types: !153)
!153 = !{null, !76, !76}
!154 = !{!155, !156, !157, !160, !161, !162, !163, !167, !168, !169, !170, !172, !226, !227, !228, !230, !231}
!155 = !DILocalVariable(name: "program", arg: 1, scope: !150, file: !151, line: 573, type: !76)
!156 = !DILocalVariable(name: "option", arg: 2, scope: !150, file: !151, line: 573, type: !76)
!157 = !DILocalVariable(name: "term", scope: !158, file: !151, line: 585, type: !76)
!158 = distinct !DILexicalBlock(scope: !159, file: !151, line: 582, column: 5)
!159 = distinct !DILexicalBlock(scope: !150, file: !151, line: 581, column: 7)
!160 = !DILocalVariable(name: "double_space", scope: !150, file: !151, line: 594, type: !79)
!161 = !DILocalVariable(name: "first_word", scope: !150, file: !151, line: 595, type: !76)
!162 = !DILocalVariable(name: "option_text", scope: !150, file: !151, line: 596, type: !76)
!163 = !DILocalVariable(name: "s", scope: !164, file: !151, line: 608, type: !76)
!164 = distinct !DILexicalBlock(scope: !165, file: !151, line: 605, column: 5)
!165 = distinct !DILexicalBlock(scope: !166, file: !151, line: 604, column: 12)
!166 = distinct !DILexicalBlock(scope: !150, file: !151, line: 597, column: 7)
!167 = !DILocalVariable(name: "spaces", scope: !164, file: !151, line: 609, type: !73)
!168 = !DILocalVariable(name: "anchor_len", scope: !150, file: !151, line: 620, type: !73)
!169 = !DILocalVariable(name: "desc_text", scope: !150, file: !151, line: 625, type: !76)
!170 = !DILocalVariable(name: "__ptr", scope: !171, file: !151, line: 644, type: !76)
!171 = distinct !DILexicalBlock(scope: !150, file: !151, line: 644, column: 3)
!172 = !DILocalVariable(name: "__stream", scope: !171, file: !151, line: 644, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !175, line: 7, baseType: !176)
!175 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !177, line: 49, size: 1728, elements: !178)
!177 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !200, !201, !203, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !176, file: !177, line: 51, baseType: !71, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !176, file: !177, line: 54, baseType: !68, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !176, file: !177, line: 55, baseType: !68, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !176, file: !177, line: 56, baseType: !68, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !176, file: !177, line: 57, baseType: !68, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !176, file: !177, line: 58, baseType: !68, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !176, file: !177, line: 59, baseType: !68, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !176, file: !177, line: 60, baseType: !68, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !176, file: !177, line: 61, baseType: !68, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !176, file: !177, line: 64, baseType: !68, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !176, file: !177, line: 65, baseType: !68, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !176, file: !177, line: 66, baseType: !68, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !176, file: !177, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !177, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !176, file: !177, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !176, file: !177, line: 72, baseType: !71, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !176, file: !177, line: 73, baseType: !71, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !176, file: !177, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !145, line: 152, baseType: !137)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !176, file: !177, line: 77, baseType: !72, size: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !176, file: !177, line: 78, baseType: !202, size: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !176, file: !177, line: 79, baseType: !204, size: 8, offset: 1048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !176, file: !177, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !177, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !176, file: !177, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !145, line: 153, baseType: !137)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !176, file: !177, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !177, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !176, file: !177, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !177, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !176, file: !177, line: 93, baseType: !195, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !176, file: !177, line: 94, baseType: !70, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !176, file: !177, line: 95, baseType: !73, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !176, file: !177, line: 96, baseType: !71, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !176, file: !177, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DILocalVariable(name: "__cnt", scope: !171, file: !151, line: 644, type: !73)
!227 = !DILocalVariable(name: "url_program", scope: !150, file: !151, line: 648, type: !76)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !151, line: 686, type: !76)
!229 = distinct !DILexicalBlock(scope: !150, file: !151, line: 686, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !151, line: 686, type: !173)
!231 = !DILocalVariable(name: "__cnt", scope: !229, file: !151, line: 686, type: !73)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "header_type", scope: !2, file: !3, line: 69, type: !76, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "body_type", scope: !2, file: !3, line: 66, type: !76, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "footer_type", scope: !2, file: !3, line: 72, type: !76, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !2, file: !3, line: 128, type: !142, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "page_incr", scope: !2, file: !3, line: 131, type: !142, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !2, file: !3, line: 134, type: !79, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "blank_join", scope: !2, file: !3, line: 137, type: !142, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "separator_str", scope: !2, file: !3, line: 95, type: !76, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "lineno_width", scope: !2, file: !3, line: 140, type: !71, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !2, file: !3, line: 53, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 8)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "lineno_format", scope: !2, file: !3, line: 143, type: !76, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !2, file: !3, line: 47, type: !259, isLocal: true, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 56, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 7)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !2, file: !3, line: 50, type: !252, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "section_del", scope: !2, file: !3, line: 98, type: !68, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !2, file: !3, line: 56, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 72, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 9)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "header_del", scope: !2, file: !3, line: 104, type: !68, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "body_del", scope: !2, file: !3, line: 110, type: !68, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "footer_del", scope: !2, file: !3, line: 116, type: !68, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !2, file: !3, line: 125, type: !68, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "current_regex", scope: !2, file: !3, line: 92, type: !281, isLocal: true, isDefinition: true)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "line_no_overflow", scope: !2, file: !3, line: 149, type: !79, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "blank_lines", scope: !286, file: !3, line: 358, type: !142, isLocal: true, isDefinition: true)
!286 = distinct !DISubprogram(name: "proc_text", scope: !3, file: !3, line: 356, type: !287, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !289)
!287 = !DISubroutineType(types: !288)
!288 = !{null}
!289 = !{!290, !292, !293}
!290 = !DILocalVariable(name: "__ptr", scope: !291, file: !3, line: 401, type: !76)
!291 = distinct !DILexicalBlock(scope: !286, file: !3, line: 401, column: 3)
!292 = !DILocalVariable(name: "__stream", scope: !291, file: !3, line: 401, type: !173)
!293 = !DILocalVariable(name: "__cnt", scope: !291, file: !3, line: 401, type: !73)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 3584, elements: !304)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !297, line: 50, size: 256, elements: !298)
!297 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!298 = !{!299, !300, !301, !303}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !296, file: !297, line: 52, baseType: !76, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !296, file: !297, line: 55, baseType: !71, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !297, line: 56, baseType: !302, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !296, file: !297, line: 57, baseType: !71, size: 32, offset: 192)
!304 = !{!305}
!305 = !DISubrange(count: 14)
!306 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!307 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!308 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "Version", scope: !311, file: !312, line: 3, type: !76, isLocal: false, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !313, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!313 = !{!309}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "file_name", scope: !316, file: !317, line: 45, type: !76, isLocal: true, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !318, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!318 = !{!314, !319}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !316, file: !317, line: 55, type: !79, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !323, file: !324, line: 66, type: !359, isLocal: false, isDefinition: true)
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !325, globals: !326, splitDebugInlining: false, nameTableKind: None)
!324 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!325 = !{!70, !78}
!326 = !{!327, !353, !321, !355, !357}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "old_file_name", scope: !329, file: !324, line: 304, type: !76, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "verror_at_line", scope: !324, file: !324, line: 298, type: !330, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !323, retainedNodes: !346)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !71, !71, !76, !7, !76, !332}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !333, line: 52, baseType: !334)
!333 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !335, line: 32, baseType: !336)
!335 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !337, baseType: !338)
!337 = !DIFile(filename: "lib/error.c", directory: "/src")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !339, size: 256, elements: !340)
!339 = !DINamespace(name: "std", scope: null)
!340 = !{!341, !342, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !338, file: !337, baseType: !70, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !338, file: !337, baseType: !70, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !338, file: !337, baseType: !70, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !338, file: !337, baseType: !71, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !338, file: !337, baseType: !71, size: 32, offset: 224)
!346 = !{!347, !348, !349, !350, !351, !352}
!347 = !DILocalVariable(name: "status", arg: 1, scope: !329, file: !324, line: 298, type: !71)
!348 = !DILocalVariable(name: "errnum", arg: 2, scope: !329, file: !324, line: 298, type: !71)
!349 = !DILocalVariable(name: "file_name", arg: 3, scope: !329, file: !324, line: 298, type: !76)
!350 = !DILocalVariable(name: "line_number", arg: 4, scope: !329, file: !324, line: 298, type: !7)
!351 = !DILocalVariable(name: "message", arg: 5, scope: !329, file: !324, line: 298, type: !76)
!352 = !DILocalVariable(name: "args", arg: 6, scope: !329, file: !324, line: 298, type: !332)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "old_line_number", scope: !329, file: !324, line: 305, type: !7, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "error_message_count", scope: !323, file: !324, line: 69, type: !7, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !323, file: !324, line: 295, type: !71, isLocal: false, isDefinition: true)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "program_name", scope: !362, file: !363, line: 31, type: !76, isLocal: false, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, globals: !365, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!364 = !{!68}
!365 = !{!360}
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "utf07FF", scope: !368, file: !369, line: 46, type: !399, isLocal: true, isDefinition: true)
!368 = distinct !DISubprogram(name: "proper_name_lite", scope: !369, file: !369, line: 38, type: !370, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !374)
!369 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!370 = !DISubroutineType(types: !371)
!371 = !{!76, !76, !76}
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !373, splitDebugInlining: false, nameTableKind: None)
!373 = !{!366}
!374 = !{!375, !376, !377, !378, !383}
!375 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !368, file: !369, line: 38, type: !76)
!376 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !368, file: !369, line: 38, type: !76)
!377 = !DILocalVariable(name: "translation", scope: !368, file: !369, line: 40, type: !76)
!378 = !DILocalVariable(name: "w", scope: !368, file: !369, line: 47, type: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !380, line: 37, baseType: !381)
!380 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !145, line: 57, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !145, line: 42, baseType: !7)
!383 = !DILocalVariable(name: "mbs", scope: !368, file: !369, line: 48, type: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !385, line: 6, baseType: !386)
!385 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !387, line: 21, baseType: !388)
!387 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 13, size: 64, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !388, file: !387, line: 15, baseType: !71, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !388, file: !387, line: 20, baseType: !392, size: 32, offset: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !388, file: !387, line: 16, size: 32, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !392, file: !387, line: 18, baseType: !7, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !392, file: !387, line: 19, baseType: !396, size: 32)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 32, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 16, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 2)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !404, file: !405, line: 76, type: !468, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !406, retainedTypes: !412, globals: !413, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!406 = !{!38, !407, !13}
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !39, line: 254, baseType: !7, size: 32, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!410 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!411 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!412 = !{!71, !72, !73}
!413 = !{!402, !414, !420, !430, !432, !434, !457, !464, !466}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !404, file: !405, line: 92, type: !416, isLocal: false, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 320, elements: !418)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!418 = !{!419}
!419 = !DISubrange(count: 10)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !404, file: !405, line: 1040, type: !422, isLocal: false, isDefinition: true)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !405, line: 56, size: 448, elements: !423)
!423 = !{!424, !425, !426, !428, !429}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !422, file: !405, line: 59, baseType: !38, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !422, file: !405, line: 62, baseType: !71, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !422, file: !405, line: 66, baseType: !427, size: 256, offset: 64)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !253)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !422, file: !405, line: 69, baseType: !76, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !422, file: !405, line: 72, baseType: !76, size: 64, offset: 384)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !404, file: !405, line: 107, type: !422, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "slot0", scope: !404, file: !405, line: 831, type: !113, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "quote", scope: !436, file: !405, line: 228, type: !455, isLocal: true, isDefinition: true)
!436 = distinct !DISubprogram(name: "gettext_quote", scope: !405, file: !405, line: 197, type: !437, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !439)
!437 = !DISubroutineType(types: !438)
!438 = !{!76, !76, !38}
!439 = !{!440, !441, !442, !443, !444}
!440 = !DILocalVariable(name: "msgid", arg: 1, scope: !436, file: !405, line: 197, type: !76)
!441 = !DILocalVariable(name: "s", arg: 2, scope: !436, file: !405, line: 197, type: !38)
!442 = !DILocalVariable(name: "translation", scope: !436, file: !405, line: 199, type: !76)
!443 = !DILocalVariable(name: "w", scope: !436, file: !405, line: 229, type: !379)
!444 = !DILocalVariable(name: "mbs", scope: !436, file: !405, line: 230, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !385, line: 6, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !387, line: 21, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 13, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !447, file: !387, line: 15, baseType: !71, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !447, file: !387, line: 20, baseType: !451, size: 32, offset: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !447, file: !387, line: 16, size: 32, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !451, file: !387, line: 18, baseType: !7, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !451, file: !387, line: 19, baseType: !396, size: 32)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !456)
!456 = !{!401, !398}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "slotvec", scope: !404, file: !405, line: 834, type: !459, isLocal: true, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !405, line: 823, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !405, line: 825, baseType: !73, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !460, file: !405, line: 826, baseType: !68, size: 64, offset: 64)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "nslots", scope: !404, file: !405, line: 832, type: !71, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "slotvec0", scope: !404, file: !405, line: 833, type: !460, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 704, elements: !470)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!470 = !{!471}
!471 = !DISubrange(count: 11)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !474, file: !475, line: 26, type: !477, isLocal: false, isDefinition: true)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !476, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!476 = !{!472}
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 376, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 47)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "exit_failure", scope: !482, file: !483, line: 24, type: !485, isLocal: false, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !484, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!484 = !{!480}
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "internal_state", scope: !488, file: !489, line: 97, type: !492, isLocal: true, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, globals: !491, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!490 = !{!70, !73, !78}
!491 = !{!486}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !385, line: 6, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !387, line: 21, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 13, size: 64, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !494, file: !387, line: 15, baseType: !71, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !494, file: !387, line: 20, baseType: !498, size: 32, offset: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !494, file: !387, line: 16, size: 32, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !498, file: !387, line: 18, baseType: !7, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !498, file: !387, line: 19, baseType: !396, size: 32)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !504, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!504 = !{!52}
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!509 = !{!70}
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!513 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!518 = !{!98}
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !521, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!521 = !{!522}
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !520, line: 40, baseType: !7, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !527, retainedTypes: !555, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!527 = !{!528, !540}
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !529, file: !526, line: 188, baseType: !7, size: 32, elements: !538)
!529 = distinct !DISubprogram(name: "x2nrealloc", scope: !526, file: !526, line: 176, type: !530, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !525, retainedNodes: !533)
!530 = !DISubroutineType(types: !531)
!531 = !{!70, !70, !532, !73}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!533 = !{!534, !535, !536, !537}
!534 = !DILocalVariable(name: "p", arg: 1, scope: !529, file: !526, line: 176, type: !70)
!535 = !DILocalVariable(name: "pn", arg: 2, scope: !529, file: !526, line: 176, type: !532)
!536 = !DILocalVariable(name: "s", arg: 3, scope: !529, file: !526, line: 176, type: !73)
!537 = !DILocalVariable(name: "n", scope: !529, file: !526, line: 178, type: !73)
!538 = !{!539}
!539 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !541, file: !526, line: 228, baseType: !7, size: 32, elements: !538)
!541 = distinct !DISubprogram(name: "xpalloc", scope: !526, file: !526, line: 223, type: !542, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !525, retainedNodes: !545)
!542 = !DISubroutineType(types: !543)
!543 = !{!70, !70, !544, !134, !136, !134}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554}
!546 = !DILocalVariable(name: "pa", arg: 1, scope: !541, file: !526, line: 223, type: !70)
!547 = !DILocalVariable(name: "pn", arg: 2, scope: !541, file: !526, line: 223, type: !544)
!548 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !541, file: !526, line: 223, type: !134)
!549 = !DILocalVariable(name: "n_max", arg: 4, scope: !541, file: !526, line: 223, type: !136)
!550 = !DILocalVariable(name: "s", arg: 5, scope: !541, file: !526, line: 223, type: !134)
!551 = !DILocalVariable(name: "n0", scope: !541, file: !526, line: 230, type: !134)
!552 = !DILocalVariable(name: "n", scope: !541, file: !526, line: 237, type: !134)
!553 = !DILocalVariable(name: "nbytes", scope: !541, file: !526, line: 248, type: !134)
!554 = !DILocalVariable(name: "adjusted_nbytes", scope: !541, file: !526, line: 252, type: !134)
!555 = !{!68, !70, !79, !137, !75}
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!560 = !{!561, !5}
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !562, line: 30, baseType: !7, size: 32, elements: !563)
!562 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!563 = !{!564, !565, !566, !567, !568}
!564 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!565 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!566 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!567 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!568 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !571, retainedTypes: !572, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!571 = !{!561}
!572 = !{!79, !137, !75, !142}
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !579, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!579 = !{!79, !75, !70}
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!582 = distinct !DICompileUnit(language: DW_LANG_C99, file: !583, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!583 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !509, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!586 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!587 = !{i32 7, !"Dwarf Version", i32 5}
!588 = !{i32 2, !"Debug Info Version", i32 3}
!589 = !{i32 1, !"wchar_size", i32 4}
!590 = !{i32 1, !"branch-target-enforcement", i32 0}
!591 = !{i32 1, !"sign-return-address", i32 0}
!592 = !{i32 1, !"sign-return-address-all", i32 0}
!593 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!594 = !{i32 7, !"PIC Level", i32 2}
!595 = !{i32 7, !"PIE Level", i32 2}
!596 = !{i32 7, !"uwtable", i32 1}
!597 = !{i32 7, !"frame-pointer", i32 1}
!598 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 175, type: !599, scopeLine: 176, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !71}
!601 = !{!602}
!602 = !DILocalVariable(name: "status", arg: 1, scope: !598, file: !3, line: 175, type: !71)
!603 = !DILocation(line: 0, scope: !598)
!604 = !DILocation(line: 177, column: 14, scope: !605)
!605 = distinct !DILexicalBlock(scope: !598, file: !3, line: 177, column: 7)
!606 = !DILocation(line: 177, column: 7, scope: !598)
!607 = !DILocation(line: 178, column: 5, scope: !608)
!608 = distinct !DILexicalBlock(scope: !605, file: !3, line: 178, column: 5)
!609 = !{!610, !610, i64 0}
!610 = !{!"any pointer", !611, i64 0}
!611 = !{!"omnipotent char", !612, i64 0}
!612 = !{!"Simple C/C++ TBAA"}
!613 = !DILocation(line: 181, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !605, file: !3, line: 180, column: 5)
!615 = !DILocation(line: 185, column: 7, scope: !614)
!616 = !DILocation(line: 729, column: 3, scope: !617, inlinedAt: !619)
!617 = distinct !DISubprogram(name: "emit_stdin_note", scope: !151, file: !151, line: 727, type: !287, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !618)
!618 = !{}
!619 = distinct !DILocation(line: 189, column: 7, scope: !614)
!620 = !DILocation(line: 736, column: 3, scope: !621, inlinedAt: !622)
!621 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !151, file: !151, line: 734, type: !287, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !618)
!622 = distinct !DILocation(line: 190, column: 7, scope: !614)
!623 = !DILocation(line: 192, column: 7, scope: !614)
!624 = !DILocation(line: 195, column: 7, scope: !614)
!625 = !DILocation(line: 198, column: 7, scope: !614)
!626 = !DILocation(line: 201, column: 7, scope: !614)
!627 = !DILocation(line: 204, column: 7, scope: !614)
!628 = !DILocation(line: 207, column: 7, scope: !614)
!629 = !DILocation(line: 210, column: 7, scope: !614)
!630 = !DILocation(line: 213, column: 7, scope: !614)
!631 = !DILocation(line: 216, column: 7, scope: !614)
!632 = !DILocation(line: 219, column: 7, scope: !614)
!633 = !DILocation(line: 222, column: 7, scope: !614)
!634 = !DILocation(line: 225, column: 7, scope: !614)
!635 = !DILocation(line: 226, column: 7, scope: !614)
!636 = !DILocation(line: 227, column: 7, scope: !614)
!637 = !DILocation(line: 236, column: 7, scope: !614)
!638 = !DILocation(line: 246, column: 7, scope: !614)
!639 = !DILocalVariable(name: "program", arg: 1, scope: !640, file: !151, line: 836, type: !76)
!640 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !151, file: !151, line: 836, type: !641, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !76}
!643 = !{!639, !644, !651, !652, !654, !655}
!644 = !DILocalVariable(name: "infomap", scope: !640, file: !151, line: 838, type: !645)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 896, elements: !260)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !640, file: !151, line: 838, size: 128, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !647, file: !151, line: 838, baseType: !76, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !647, file: !151, line: 838, baseType: !76, size: 64, offset: 64)
!651 = !DILocalVariable(name: "node", scope: !640, file: !151, line: 848, type: !76)
!652 = !DILocalVariable(name: "map_prog", scope: !640, file: !151, line: 849, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!654 = !DILocalVariable(name: "lc_messages", scope: !640, file: !151, line: 861, type: !76)
!655 = !DILocalVariable(name: "url_program", scope: !640, file: !151, line: 874, type: !76)
!656 = !DILocation(line: 0, scope: !640, inlinedAt: !657)
!657 = distinct !DILocation(line: 255, column: 7, scope: !614)
!658 = !DILocation(line: 838, column: 3, scope: !640, inlinedAt: !657)
!659 = !DILocation(line: 838, column: 67, scope: !640, inlinedAt: !657)
!660 = !DILocation(line: 849, column: 36, scope: !640, inlinedAt: !657)
!661 = !DILocation(line: 851, column: 3, scope: !640, inlinedAt: !657)
!662 = !DILocalVariable(name: "__s1", arg: 1, scope: !663, file: !664, line: 1359, type: !76)
!663 = distinct !DISubprogram(name: "streq", scope: !664, file: !664, line: 1359, type: !665, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !667)
!664 = !DIFile(filename: "./lib/string.h", directory: "/src")
!665 = !DISubroutineType(types: !666)
!666 = !{!79, !76, !76}
!667 = !{!662, !668}
!668 = !DILocalVariable(name: "__s2", arg: 2, scope: !663, file: !664, line: 1359, type: !76)
!669 = !DILocation(line: 0, scope: !663, inlinedAt: !670)
!670 = distinct !DILocation(line: 851, column: 33, scope: !640, inlinedAt: !657)
!671 = !DILocation(line: 1361, column: 11, scope: !663, inlinedAt: !670)
!672 = !DILocation(line: 1361, column: 10, scope: !663, inlinedAt: !670)
!673 = !DILocation(line: 852, column: 13, scope: !640, inlinedAt: !657)
!674 = !DILocation(line: 851, column: 20, scope: !640, inlinedAt: !657)
!675 = !{!676, !610, i64 0}
!676 = !{!"infomap", !610, i64 0, !610, i64 8}
!677 = !DILocation(line: 851, column: 10, scope: !640, inlinedAt: !657)
!678 = !DILocation(line: 851, column: 28, scope: !640, inlinedAt: !657)
!679 = distinct !{!679, !661, !673, !680}
!680 = !{!"llvm.loop.mustprogress"}
!681 = !DILocation(line: 854, column: 17, scope: !682, inlinedAt: !657)
!682 = distinct !DILexicalBlock(scope: !640, file: !151, line: 854, column: 7)
!683 = !{!676, !610, i64 8}
!684 = !DILocation(line: 854, column: 7, scope: !682, inlinedAt: !657)
!685 = !DILocation(line: 854, column: 7, scope: !640, inlinedAt: !657)
!686 = !DILocation(line: 857, column: 3, scope: !640, inlinedAt: !657)
!687 = !DILocation(line: 861, column: 29, scope: !640, inlinedAt: !657)
!688 = !DILocation(line: 862, column: 7, scope: !689, inlinedAt: !657)
!689 = distinct !DILexicalBlock(scope: !640, file: !151, line: 862, column: 7)
!690 = !DILocation(line: 862, column: 19, scope: !689, inlinedAt: !657)
!691 = !DILocation(line: 862, column: 22, scope: !689, inlinedAt: !657)
!692 = !DILocation(line: 862, column: 7, scope: !640, inlinedAt: !657)
!693 = !DILocation(line: 868, column: 7, scope: !694, inlinedAt: !657)
!694 = distinct !DILexicalBlock(scope: !689, file: !151, line: 863, column: 5)
!695 = !DILocation(line: 870, column: 5, scope: !694, inlinedAt: !657)
!696 = !DILocation(line: 0, scope: !663, inlinedAt: !697)
!697 = distinct !DILocation(line: 874, column: 29, scope: !640, inlinedAt: !657)
!698 = !DILocation(line: 875, column: 3, scope: !640, inlinedAt: !657)
!699 = !DILocation(line: 877, column: 3, scope: !640, inlinedAt: !657)
!700 = !DILocation(line: 879, column: 1, scope: !640, inlinedAt: !657)
!701 = !DILocation(line: 257, column: 3, scope: !598)
!702 = !DISubprogram(name: "dcgettext", scope: !703, file: !703, line: 51, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!703 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!704 = !DISubroutineType(types: !705)
!705 = !{!68, !76, !76, !71}
!706 = !DISubprogram(name: "fputs_unlocked", scope: !333, file: !333, line: 691, type: !707, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!707 = !DISubroutineType(types: !708)
!708 = !{!71, !709, !710}
!709 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !76)
!710 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !173)
!711 = !DILocation(line: 0, scope: !150)
!712 = !DILocation(line: 581, column: 7, scope: !159)
!713 = !{!714, !714, i64 0}
!714 = !{!"int", !611, i64 0}
!715 = !DILocation(line: 581, column: 19, scope: !159)
!716 = !DILocation(line: 581, column: 7, scope: !150)
!717 = !DILocation(line: 585, column: 26, scope: !158)
!718 = !DILocation(line: 0, scope: !158)
!719 = !DILocation(line: 586, column: 23, scope: !158)
!720 = !DILocation(line: 586, column: 28, scope: !158)
!721 = !DILocation(line: 586, column: 32, scope: !158)
!722 = !{!611, !611, i64 0}
!723 = !DILocation(line: 586, column: 38, scope: !158)
!724 = !DILocation(line: 0, scope: !663, inlinedAt: !725)
!725 = distinct !DILocation(line: 586, column: 41, scope: !158)
!726 = !DILocation(line: 1361, column: 11, scope: !663, inlinedAt: !725)
!727 = !DILocation(line: 1361, column: 10, scope: !663, inlinedAt: !725)
!728 = !DILocation(line: 586, column: 19, scope: !158)
!729 = !DILocation(line: 587, column: 5, scope: !158)
!730 = !DILocation(line: 588, column: 7, scope: !731)
!731 = distinct !DILexicalBlock(scope: !150, file: !151, line: 588, column: 7)
!732 = !DILocation(line: 588, column: 7, scope: !150)
!733 = !DILocation(line: 590, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !731, file: !151, line: 589, column: 5)
!735 = !DILocation(line: 591, column: 7, scope: !734)
!736 = !DILocation(line: 595, column: 37, scope: !150)
!737 = !DILocation(line: 595, column: 35, scope: !150)
!738 = !DILocation(line: 596, column: 29, scope: !150)
!739 = !DILocation(line: 597, column: 8, scope: !166)
!740 = !DILocation(line: 597, column: 7, scope: !150)
!741 = !DILocation(line: 604, column: 24, scope: !165)
!742 = !DILocation(line: 604, column: 12, scope: !166)
!743 = !DILocation(line: 0, scope: !164)
!744 = !DILocation(line: 610, column: 16, scope: !164)
!745 = !DILocation(line: 610, column: 7, scope: !164)
!746 = !DILocation(line: 611, column: 21, scope: !164)
!747 = !{!748, !748, i64 0}
!748 = !{!"short", !611, i64 0}
!749 = !DILocation(line: 611, column: 19, scope: !164)
!750 = !DILocation(line: 611, column: 16, scope: !164)
!751 = !DILocation(line: 610, column: 30, scope: !164)
!752 = distinct !{!752, !745, !746, !680}
!753 = !DILocation(line: 612, column: 18, scope: !754)
!754 = distinct !DILexicalBlock(scope: !164, file: !151, line: 612, column: 11)
!755 = !DILocation(line: 612, column: 11, scope: !164)
!756 = !DILocation(line: 620, column: 23, scope: !150)
!757 = !DILocation(line: 625, column: 39, scope: !150)
!758 = !DILocation(line: 626, column: 3, scope: !150)
!759 = !DILocation(line: 626, column: 10, scope: !150)
!760 = !DILocation(line: 626, column: 21, scope: !150)
!761 = !DILocation(line: 628, column: 44, scope: !762)
!762 = distinct !DILexicalBlock(scope: !763, file: !151, line: 628, column: 11)
!763 = distinct !DILexicalBlock(scope: !150, file: !151, line: 627, column: 5)
!764 = !DILocation(line: 628, column: 32, scope: !762)
!765 = !DILocation(line: 628, column: 49, scope: !762)
!766 = !DILocation(line: 628, column: 11, scope: !763)
!767 = !DILocation(line: 630, column: 11, scope: !768)
!768 = distinct !DILexicalBlock(scope: !763, file: !151, line: 630, column: 11)
!769 = !DILocation(line: 630, column: 11, scope: !763)
!770 = !DILocation(line: 632, column: 26, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !151, line: 632, column: 15)
!772 = distinct !DILexicalBlock(scope: !768, file: !151, line: 631, column: 9)
!773 = !DILocation(line: 632, column: 34, scope: !771)
!774 = !DILocation(line: 632, column: 37, scope: !771)
!775 = !DILocation(line: 632, column: 15, scope: !772)
!776 = !DILocation(line: 636, column: 29, scope: !777)
!777 = distinct !DILexicalBlock(scope: !772, file: !151, line: 636, column: 15)
!778 = !DILocation(line: 640, column: 16, scope: !763)
!779 = distinct !{!779, !758, !780, !680}
!780 = !DILocation(line: 641, column: 5, scope: !150)
!781 = !DILocation(line: 644, column: 3, scope: !150)
!782 = !DILocation(line: 0, scope: !663, inlinedAt: !783)
!783 = distinct !DILocation(line: 648, column: 31, scope: !150)
!784 = !DILocation(line: 0, scope: !663, inlinedAt: !785)
!785 = distinct !DILocation(line: 649, column: 31, scope: !150)
!786 = !DILocation(line: 0, scope: !663, inlinedAt: !787)
!787 = distinct !DILocation(line: 650, column: 31, scope: !150)
!788 = !DILocation(line: 0, scope: !663, inlinedAt: !789)
!789 = distinct !DILocation(line: 651, column: 31, scope: !150)
!790 = !DILocation(line: 0, scope: !663, inlinedAt: !791)
!791 = distinct !DILocation(line: 652, column: 31, scope: !150)
!792 = !DILocation(line: 0, scope: !663, inlinedAt: !793)
!793 = distinct !DILocation(line: 653, column: 31, scope: !150)
!794 = !DILocation(line: 0, scope: !663, inlinedAt: !795)
!795 = distinct !DILocation(line: 654, column: 31, scope: !150)
!796 = !DILocation(line: 0, scope: !663, inlinedAt: !797)
!797 = distinct !DILocation(line: 655, column: 31, scope: !150)
!798 = !DILocation(line: 0, scope: !663, inlinedAt: !799)
!799 = distinct !DILocation(line: 656, column: 31, scope: !150)
!800 = !DILocation(line: 0, scope: !663, inlinedAt: !801)
!801 = distinct !DILocation(line: 657, column: 31, scope: !150)
!802 = !DILocation(line: 663, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !150, file: !151, line: 663, column: 7)
!804 = !DILocation(line: 664, column: 7, scope: !803)
!805 = !DILocation(line: 664, column: 10, scope: !803)
!806 = !DILocation(line: 663, column: 7, scope: !150)
!807 = !DILocation(line: 669, column: 7, scope: !808)
!808 = distinct !DILexicalBlock(scope: !803, file: !151, line: 665, column: 5)
!809 = !DILocation(line: 671, column: 5, scope: !808)
!810 = !DILocation(line: 676, column: 7, scope: !811)
!811 = distinct !DILexicalBlock(scope: !803, file: !151, line: 673, column: 5)
!812 = !DILocation(line: 679, column: 3, scope: !150)
!813 = !DILocation(line: 683, column: 3, scope: !150)
!814 = !DILocation(line: 686, column: 3, scope: !150)
!815 = !DILocation(line: 688, column: 3, scope: !150)
!816 = !DILocation(line: 691, column: 3, scope: !150)
!817 = !DILocation(line: 695, column: 3, scope: !150)
!818 = !DILocation(line: 696, column: 1, scope: !150)
!819 = !DISubprogram(name: "setlocale", scope: !820, file: !820, line: 122, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!820 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!821 = !DISubroutineType(types: !822)
!822 = !{!68, !71, !76}
!823 = !DISubprogram(name: "getenv", scope: !824, file: !824, line: 641, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!824 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!825 = !DISubroutineType(types: !826)
!826 = !{!68, !76}
!827 = !DISubprogram(name: "fwrite_unlocked", scope: !333, file: !333, line: 704, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!828 = !DISubroutineType(types: !829)
!829 = !{!73, !830, !73, !73, !710}
!830 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!833 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 498, type: !834, scopeLine: 499, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !837)
!834 = !DISubroutineType(types: !835)
!835 = !{!71, !71, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!837 = !{!838, !839, !840, !841, !842, !843, !848, !849}
!838 = !DILocalVariable(name: "argc", arg: 1, scope: !833, file: !3, line: 498, type: !71)
!839 = !DILocalVariable(name: "argv", arg: 2, scope: !833, file: !3, line: 498, type: !836)
!840 = !DILocalVariable(name: "c", scope: !833, file: !3, line: 500, type: !71)
!841 = !DILocalVariable(name: "len", scope: !833, file: !3, line: 501, type: !73)
!842 = !DILocalVariable(name: "ok", scope: !833, file: !3, line: 502, type: !79)
!843 = !DILocalVariable(name: "p", scope: !844, file: !3, line: 585, type: !76)
!844 = distinct !DILexicalBlock(scope: !845, file: !3, line: 584, column: 13)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 583, column: 15)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 517, column: 9)
!847 = distinct !DILexicalBlock(scope: !833, file: !3, line: 515, column: 5)
!848 = !DILocalVariable(name: "lim", scope: !844, file: !3, line: 586, type: !76)
!849 = !DILocalVariable(name: "n_chars", scope: !844, file: !3, line: 587, type: !71)
!850 = !DILocation(line: 0, scope: !833)
!851 = !DILocation(line: 505, column: 21, scope: !833)
!852 = !DILocation(line: 505, column: 3, scope: !833)
!853 = !DILocation(line: 506, column: 3, scope: !833)
!854 = !DILocation(line: 507, column: 3, scope: !833)
!855 = !DILocation(line: 508, column: 3, scope: !833)
!856 = !DILocation(line: 510, column: 3, scope: !833)
!857 = !DILocation(line: 512, column: 3, scope: !833)
!858 = !DILocation(line: 512, column: 15, scope: !833)
!859 = distinct !{!859, !857, !860, !680}
!860 = !DILocation(line: 609, column: 5, scope: !833)
!861 = !DILocation(line: 519, column: 17, scope: !862)
!862 = distinct !DILexicalBlock(scope: !846, file: !3, line: 519, column: 15)
!863 = !DILocation(line: 519, column: 15, scope: !846)
!864 = !DILocation(line: 521, column: 15, scope: !865)
!865 = distinct !DILexicalBlock(scope: !862, file: !3, line: 520, column: 13)
!866 = !DILocation(line: 524, column: 13, scope: !865)
!867 = !DILocation(line: 527, column: 17, scope: !868)
!868 = distinct !DILexicalBlock(scope: !846, file: !3, line: 527, column: 15)
!869 = !DILocation(line: 527, column: 15, scope: !846)
!870 = !DILocation(line: 529, column: 15, scope: !871)
!871 = distinct !DILexicalBlock(scope: !868, file: !3, line: 528, column: 13)
!872 = !DILocation(line: 532, column: 13, scope: !871)
!873 = !DILocation(line: 535, column: 17, scope: !874)
!874 = distinct !DILexicalBlock(scope: !846, file: !3, line: 535, column: 15)
!875 = !DILocation(line: 535, column: 15, scope: !846)
!876 = !DILocation(line: 537, column: 15, scope: !877)
!877 = distinct !DILexicalBlock(scope: !874, file: !3, line: 536, column: 13)
!878 = !DILocation(line: 540, column: 13, scope: !877)
!879 = !DILocation(line: 543, column: 46, scope: !846)
!880 = !DILocation(line: 544, column: 46, scope: !846)
!881 = !DILocation(line: 543, column: 34, scope: !846)
!882 = !DILocation(line: 543, column: 32, scope: !846)
!883 = !{!884, !884, i64 0}
!884 = !{!"long", !611, i64 0}
!885 = !DILocation(line: 546, column: 11, scope: !846)
!886 = !DILocation(line: 548, column: 35, scope: !846)
!887 = !DILocation(line: 549, column: 35, scope: !846)
!888 = !DILocation(line: 548, column: 23, scope: !846)
!889 = !DILocation(line: 548, column: 21, scope: !846)
!890 = !DILocation(line: 550, column: 11, scope: !846)
!891 = !DILocation(line: 552, column: 25, scope: !846)
!892 = !DILocation(line: 553, column: 11, scope: !846)
!893 = !DILocation(line: 555, column: 36, scope: !846)
!894 = !DILocation(line: 556, column: 36, scope: !846)
!895 = !DILocation(line: 555, column: 24, scope: !846)
!896 = !DILocation(line: 555, column: 22, scope: !846)
!897 = !DILocation(line: 558, column: 11, scope: !846)
!898 = !DILocation(line: 560, column: 27, scope: !846)
!899 = !DILocation(line: 560, column: 25, scope: !846)
!900 = !DILocation(line: 561, column: 11, scope: !846)
!901 = !DILocation(line: 563, column: 38, scope: !846)
!902 = !DILocation(line: 564, column: 38, scope: !846)
!903 = !DILocation(line: 563, column: 26, scope: !846)
!904 = !DILocation(line: 563, column: 24, scope: !846)
!905 = !DILocation(line: 566, column: 11, scope: !846)
!906 = !DILocation(line: 568, column: 22, scope: !907)
!907 = distinct !DILexicalBlock(scope: !846, file: !3, line: 568, column: 15)
!908 = !DILocation(line: 0, scope: !663, inlinedAt: !909)
!909 = distinct !DILocation(line: 568, column: 15, scope: !907)
!910 = !DILocation(line: 1361, column: 11, scope: !663, inlinedAt: !909)
!911 = !DILocation(line: 1361, column: 10, scope: !663, inlinedAt: !909)
!912 = !DILocation(line: 568, column: 15, scope: !846)
!913 = !DILocation(line: 569, column: 27, scope: !907)
!914 = !DILocation(line: 569, column: 13, scope: !907)
!915 = !DILocation(line: 0, scope: !663, inlinedAt: !916)
!916 = distinct !DILocation(line: 570, column: 20, scope: !917)
!917 = distinct !DILexicalBlock(scope: !907, file: !3, line: 570, column: 20)
!918 = !DILocation(line: 1361, column: 11, scope: !663, inlinedAt: !916)
!919 = !DILocation(line: 1361, column: 10, scope: !663, inlinedAt: !916)
!920 = !DILocation(line: 570, column: 20, scope: !907)
!921 = !DILocation(line: 571, column: 27, scope: !917)
!922 = !DILocation(line: 571, column: 13, scope: !917)
!923 = !DILocation(line: 0, scope: !663, inlinedAt: !924)
!924 = distinct !DILocation(line: 572, column: 20, scope: !925)
!925 = distinct !DILexicalBlock(scope: !917, file: !3, line: 572, column: 20)
!926 = !DILocation(line: 1361, column: 11, scope: !663, inlinedAt: !924)
!927 = !DILocation(line: 1361, column: 10, scope: !663, inlinedAt: !924)
!928 = !DILocation(line: 572, column: 20, scope: !917)
!929 = !DILocation(line: 573, column: 27, scope: !925)
!930 = !DILocation(line: 573, column: 13, scope: !925)
!931 = !DILocation(line: 576, column: 15, scope: !932)
!932 = distinct !DILexicalBlock(scope: !925, file: !3, line: 575, column: 13)
!933 = !DILocation(line: 582, column: 25, scope: !846)
!934 = !DILocation(line: 582, column: 17, scope: !846)
!935 = !DILocation(line: 583, column: 19, scope: !845)
!936 = !DILocation(line: 583, column: 17, scope: !845)
!937 = !DILocation(line: 583, column: 15, scope: !846)
!938 = !DILocation(line: 585, column: 31, scope: !844)
!939 = !DILocation(line: 0, scope: !844)
!940 = !DILocation(line: 588, column: 24, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 588, column: 15)
!942 = distinct !DILexicalBlock(scope: !844, file: !3, line: 588, column: 15)
!943 = !DILocation(line: 588, column: 15, scope: !942)
!944 = !DILocation(line: 586, column: 35, scope: !844)
!945 = !DILocalVariable(name: "p", arg: 1, scope: !946, file: !29, line: 230, type: !76)
!946 = distinct !DISubprogram(name: "mcel_scan", scope: !29, file: !29, line: 230, type: !947, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!947 = !DISubroutineType(types: !948)
!948 = !{!949, !76, !76}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !29, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 138, size: 64, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !950, file: !29, line: 140, baseType: !379, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !950, file: !29, line: 141, baseType: !78, size: 8, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !950, file: !29, line: 142, baseType: !78, size: 8, offset: 40)
!955 = !{!945, !956, !957, !958, !969, !970}
!956 = !DILocalVariable(name: "lim", arg: 2, scope: !946, file: !29, line: 230, type: !76)
!957 = !DILocalVariable(name: "c", scope: !946, file: !29, line: 235, type: !69)
!958 = !DILocalVariable(name: "mbs", scope: !946, file: !29, line: 244, type: !959)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !385, line: 6, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !387, line: 21, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 13, size: 64, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !961, file: !387, line: 15, baseType: !71, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !961, file: !387, line: 20, baseType: !965, size: 32, offset: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !961, file: !387, line: 16, size: 32, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !965, file: !387, line: 18, baseType: !7, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !965, file: !387, line: 19, baseType: !396, size: 32)
!969 = !DILocalVariable(name: "ch", scope: !946, file: !29, line: 267, type: !379)
!970 = !DILocalVariable(name: "len", scope: !946, file: !29, line: 268, type: !73)
!971 = !DILocation(line: 0, scope: !946, inlinedAt: !972)
!972 = distinct !DILocation(line: 589, column: 24, scope: !941)
!973 = !DILocation(line: 235, column: 12, scope: !946, inlinedAt: !972)
!974 = !DILocalVariable(name: "c", arg: 1, scope: !975, file: !29, line: 215, type: !69)
!975 = distinct !DISubprogram(name: "mcel_isbasic", scope: !29, file: !29, line: 215, type: !976, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !978)
!976 = !DISubroutineType(types: !977)
!977 = !{!79, !69}
!978 = !{!974}
!979 = !DILocation(line: 0, scope: !975, inlinedAt: !980)
!980 = distinct !DILocation(line: 236, column: 7, scope: !981, inlinedAt: !972)
!981 = distinct !DILexicalBlock(scope: !946, file: !29, line: 236, column: 7)
!982 = !DILocation(line: 217, column: 10, scope: !975, inlinedAt: !980)
!983 = !DILocation(line: 236, column: 7, scope: !946, inlinedAt: !972)
!984 = !DILocation(line: 244, column: 3, scope: !946, inlinedAt: !972)
!985 = !DILocation(line: 244, column: 13, scope: !946, inlinedAt: !972)
!986 = !DILocation(line: 244, column: 30, scope: !946, inlinedAt: !972)
!987 = !{!988, !714, i64 0}
!988 = !{!"", !714, i64 0, !611, i64 4}
!989 = !DILocation(line: 267, column: 3, scope: !946, inlinedAt: !972)
!990 = !DILocation(line: 268, column: 16, scope: !946, inlinedAt: !972)
!991 = !DILocation(line: 274, column: 7, scope: !992, inlinedAt: !972)
!992 = distinct !DILexicalBlock(scope: !946, file: !29, line: 274, column: 7)
!993 = !DILocation(line: 274, column: 7, scope: !946, inlinedAt: !972)
!994 = !{!"branch_weights", i32 1, i32 2000}
!995 = !DILocation(line: 279, column: 19, scope: !946, inlinedAt: !972)
!996 = !DILocalVariable(name: "ch", arg: 1, scope: !997, file: !29, line: 167, type: !379)
!997 = distinct !DISubprogram(name: "mcel_ch", scope: !29, file: !29, line: 167, type: !998, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1000)
!998 = !DISubroutineType(types: !999)
!999 = !{!949, !379, !73}
!1000 = !{!996, !1001}
!1001 = !DILocalVariable(name: "len", arg: 2, scope: !997, file: !29, line: 167, type: !73)
!1002 = !DILocation(line: 0, scope: !997, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 279, column: 10, scope: !946, inlinedAt: !972)
!1004 = !DILocation(line: 169, column: 3, scope: !997, inlinedAt: !1003)
!1005 = !DILocation(line: 170, column: 3, scope: !997, inlinedAt: !1003)
!1006 = !DILocation(line: 171, column: 3, scope: !997, inlinedAt: !1003)
!1007 = !DILocation(line: 279, column: 3, scope: !946, inlinedAt: !972)
!1008 = !DILocation(line: 280, column: 1, scope: !946, inlinedAt: !972)
!1009 = !DILocation(line: 589, column: 21, scope: !941)
!1010 = distinct !{!1010, !943, !1011, !680}
!1011 = !DILocation(line: 589, column: 43, scope: !942)
!1012 = !DILocation(line: 268, column: 38, scope: !946, inlinedAt: !972)
!1013 = !DILocation(line: 590, column: 19, scope: !844)
!1014 = !DILocation(line: 591, column: 34, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !844, file: !3, line: 590, column: 19)
!1016 = !DILocation(line: 591, column: 47, scope: !1015)
!1017 = !DILocalVariable(name: "__dest", arg: 1, scope: !1018, file: !1019, line: 42, type: !1022)
!1018 = distinct !DISubprogram(name: "mempcpy", scope: !1019, file: !1019, line: 42, type: !1020, scopeLine: 44, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1023)
!1019 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!70, !1022, !830, !73}
!1022 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!1023 = !{!1017, !1024, !1025}
!1024 = !DILocalVariable(name: "__src", arg: 2, scope: !1018, file: !1019, line: 42, type: !830)
!1025 = !DILocalVariable(name: "__len", arg: 3, scope: !1018, file: !1019, line: 42, type: !73)
!1026 = !DILocation(line: 0, scope: !1018, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 591, column: 25, scope: !1015)
!1028 = !DILocation(line: 45, column: 10, scope: !1018, inlinedAt: !1027)
!1029 = !DILocalVariable(name: "__dest", arg: 1, scope: !1030, file: !1019, line: 26, type: !1022)
!1030 = distinct !DISubprogram(name: "memcpy", scope: !1019, file: !1019, line: 26, type: !1020, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1031)
!1031 = !{!1029, !1032, !1033}
!1032 = !DILocalVariable(name: "__src", arg: 2, scope: !1030, file: !1019, line: 26, type: !830)
!1033 = !DILocalVariable(name: "__len", arg: 3, scope: !1030, file: !1019, line: 26, type: !73)
!1034 = !DILocation(line: 0, scope: !1030, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 591, column: 17, scope: !1015)
!1036 = !DILocation(line: 29, column: 10, scope: !1030, inlinedAt: !1035)
!1037 = !DILocation(line: 591, column: 17, scope: !1015)
!1038 = !DILocation(line: 593, column: 31, scope: !1015)
!1039 = !DILocation(line: 593, column: 29, scope: !1015)
!1040 = !DILocation(line: 597, column: 23, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 597, column: 19)
!1042 = distinct !DILexicalBlock(scope: !845, file: !3, line: 596, column: 13)
!1043 = !DILocation(line: 0, scope: !1041)
!1044 = !DILocation(line: 597, column: 19, scope: !1042)
!1045 = !DILocation(line: 598, column: 32, scope: !1041)
!1046 = !DILocation(line: 598, column: 18, scope: !1041)
!1047 = !DILocation(line: 598, column: 30, scope: !1041)
!1048 = !DILocation(line: 598, column: 17, scope: !1041)
!1049 = !DILocation(line: 600, column: 29, scope: !1041)
!1050 = !DILocation(line: 603, column: 9, scope: !846)
!1051 = !DILocation(line: 604, column: 9, scope: !846)
!1052 = !DILocation(line: 611, column: 7, scope: !833)
!1053 = !DILocation(line: 612, column: 5, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !833, file: !3, line: 611, column: 7)
!1055 = !DILocation(line: 615, column: 35, scope: !833)
!1056 = !DILocation(line: 615, column: 27, scope: !833)
!1057 = !DILocation(line: 615, column: 19, scope: !833)
!1058 = !DILocation(line: 617, column: 24, scope: !833)
!1059 = !DILocation(line: 617, column: 18, scope: !833)
!1060 = !DILocation(line: 618, column: 40, scope: !833)
!1061 = !DILocation(line: 618, column: 16, scope: !833)
!1062 = !DILocation(line: 618, column: 14, scope: !833)
!1063 = !DILocation(line: 619, column: 39, scope: !833)
!1064 = !DILocalVariable(name: "__dest", arg: 1, scope: !1065, file: !1019, line: 84, type: !1068)
!1065 = distinct !DISubprogram(name: "stpcpy", scope: !1019, file: !1019, line: 84, type: !1066, scopeLine: 85, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1069)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!68, !1068, !709}
!1068 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!1069 = !{!1064, !1070}
!1070 = !DILocalVariable(name: "__src", arg: 2, scope: !1065, file: !1019, line: 84, type: !709)
!1071 = !DILocation(line: 0, scope: !1065, inlinedAt: !1072)
!1072 = distinct !DILocation(line: 619, column: 19, scope: !833)
!1073 = !DILocation(line: 86, column: 10, scope: !1065, inlinedAt: !1072)
!1074 = !DILocation(line: 0, scope: !1065, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 619, column: 11, scope: !833)
!1076 = !DILocation(line: 86, column: 10, scope: !1065, inlinedAt: !1075)
!1077 = !DILocation(line: 0, scope: !1065, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 619, column: 3, scope: !833)
!1079 = !DILocation(line: 86, column: 10, scope: !1065, inlinedAt: !1078)
!1080 = !DILocation(line: 621, column: 22, scope: !833)
!1081 = !DILocation(line: 621, column: 16, scope: !833)
!1082 = !DILocation(line: 622, column: 14, scope: !833)
!1083 = !DILocation(line: 622, column: 25, scope: !833)
!1084 = !DILocation(line: 622, column: 12, scope: !833)
!1085 = !DILocation(line: 624, column: 18, scope: !833)
!1086 = !DILocation(line: 625, column: 25, scope: !833)
!1087 = !DILocation(line: 625, column: 14, scope: !833)
!1088 = !DILocation(line: 628, column: 3, scope: !833)
!1089 = !DILocation(line: 631, column: 17, scope: !833)
!1090 = !DILocation(line: 631, column: 9, scope: !833)
!1091 = !DILocation(line: 632, column: 32, scope: !833)
!1092 = !DILocation(line: 632, column: 45, scope: !833)
!1093 = !DILocation(line: 632, column: 51, scope: !833)
!1094 = !DILocation(line: 632, column: 23, scope: !833)
!1095 = !DILocation(line: 632, column: 21, scope: !833)
!1096 = !DILocation(line: 633, column: 35, scope: !833)
!1097 = !DILocation(line: 633, column: 48, scope: !833)
!1098 = !DILocalVariable(name: "__dest", arg: 1, scope: !1099, file: !1019, line: 57, type: !70)
!1099 = distinct !DISubprogram(name: "memset", scope: !1019, file: !1019, line: 57, type: !1100, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!70, !70, !71, !73}
!1102 = !{!1098, !1103, !1104}
!1103 = !DILocalVariable(name: "__ch", arg: 2, scope: !1099, file: !1019, line: 57, type: !71)
!1104 = !DILocalVariable(name: "__len", arg: 3, scope: !1099, file: !1019, line: 57, type: !73)
!1105 = !DILocation(line: 0, scope: !1099, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 633, column: 3, scope: !833)
!1107 = !DILocation(line: 59, column: 10, scope: !1099, inlinedAt: !1106)
!1108 = !DILocation(line: 634, column: 3, scope: !833)
!1109 = !DILocation(line: 634, column: 41, scope: !833)
!1110 = !DILocation(line: 636, column: 13, scope: !833)
!1111 = !DILocation(line: 636, column: 11, scope: !833)
!1112 = !DILocation(line: 637, column: 18, scope: !833)
!1113 = !DILocation(line: 637, column: 16, scope: !833)
!1114 = !DILocation(line: 638, column: 17, scope: !833)
!1115 = !DILocation(line: 642, column: 7, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !833, file: !3, line: 642, column: 7)
!1117 = !DILocation(line: 642, column: 14, scope: !1116)
!1118 = !DILocation(line: 642, column: 7, scope: !833)
!1119 = !DILocation(line: 645, column: 19, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !3, line: 645, column: 5)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 645, column: 5)
!1122 = !DILocation(line: 645, column: 5, scope: !1121)
!1123 = !DILocation(line: 643, column: 10, scope: !1116)
!1124 = !DILocation(line: 643, column: 5, scope: !1116)
!1125 = !DILocation(line: 646, column: 22, scope: !1120)
!1126 = !DILocation(line: 646, column: 13, scope: !1120)
!1127 = !DILocation(line: 646, column: 10, scope: !1120)
!1128 = !DILocation(line: 645, column: 33, scope: !1120)
!1129 = distinct !{!1129, !1122, !1130, !680}
!1130 = !DILocation(line: 646, column: 34, scope: !1121)
!1131 = !DILocation(line: 648, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !833, file: !3, line: 648, column: 7)
!1133 = !DILocation(line: 648, column: 23, scope: !1132)
!1134 = !DILocation(line: 648, column: 34, scope: !1132)
!1135 = !DILocation(line: 648, column: 26, scope: !1132)
!1136 = !DILocation(line: 648, column: 41, scope: !1132)
!1137 = !DILocation(line: 648, column: 7, scope: !833)
!1138 = !DILocation(line: 649, column: 5, scope: !1132)
!1139 = !DILocation(line: 651, column: 10, scope: !833)
!1140 = !DILocation(line: 651, column: 3, scope: !833)
!1141 = !DISubprogram(name: "bindtextdomain", scope: !703, file: !703, line: 86, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!68, !76, !76}
!1144 = !DISubprogram(name: "textdomain", scope: !703, file: !703, line: 82, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!1145 = !DISubprogram(name: "atexit", scope: !824, file: !824, line: 602, type: !1146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!71, !359}
!1148 = !DISubprogram(name: "getopt_long", scope: !297, file: !297, line: 66, type: !1149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !618)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!71, !71, !1151, !76, !1153, !302}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!1154 = distinct !DISubprogram(name: "build_type_arg", scope: !3, file: !3, line: 264, type: !1155, scopeLine: 266, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1158)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!79, !1157, !281, !68}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DILocalVariable(name: "typep", arg: 1, scope: !1154, file: !3, line: 264, type: !1157)
!1160 = !DILocalVariable(name: "regexp", arg: 2, scope: !1154, file: !3, line: 265, type: !281)
!1161 = !DILocalVariable(name: "fastmap", arg: 3, scope: !1154, file: !3, line: 265, type: !68)
!1162 = !DILocalVariable(name: "errmsg", scope: !1154, file: !3, line: 267, type: !76)
!1163 = !DILocalVariable(name: "rval", scope: !1154, file: !3, line: 268, type: !79)
!1164 = !DILocation(line: 0, scope: !1154)
!1165 = !DILocation(line: 270, column: 12, scope: !1154)
!1166 = !DILocation(line: 270, column: 11, scope: !1154)
!1167 = !DILocation(line: 270, column: 3, scope: !1154)
!1168 = !DILocation(line: 275, column: 14, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1154, file: !3, line: 271, column: 5)
!1170 = !DILocation(line: 276, column: 7, scope: !1169)
!1171 = !DILocation(line: 278, column: 22, scope: !1169)
!1172 = !DILocation(line: 278, column: 14, scope: !1169)
!1173 = !DILocation(line: 281, column: 15, scope: !1169)
!1174 = !DILocation(line: 281, column: 23, scope: !1169)
!1175 = !DILocation(line: 280, column: 25, scope: !1169)
!1176 = !{!1177, !610, i64 32}
!1177 = !{!"re_pattern_buffer", !610, i64 0, !884, i64 8, !884, i64 16, !884, i64 24, !610, i64 32, !610, i64 40, !884, i64 48, !714, i64 56, !714, i64 56, !714, i64 56, !714, i64 56, !714, i64 56, !714, i64 56, !714, i64 56}
!1178 = !DILocation(line: 282, column: 15, scope: !1169)
!1179 = !DILocation(line: 282, column: 25, scope: !1169)
!1180 = !{!1177, !610, i64 40}
!1181 = !DILocation(line: 283, column: 25, scope: !1169)
!1182 = !DILocation(line: 285, column: 36, scope: !1169)
!1183 = !DILocation(line: 285, column: 44, scope: !1169)
!1184 = !DILocation(line: 285, column: 16, scope: !1169)
!1185 = !DILocation(line: 286, column: 11, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 286, column: 11)
!1187 = !DILocation(line: 286, column: 11, scope: !1169)
!1188 = !DILocation(line: 287, column: 9, scope: !1186)
!1189 = !DILocation(line: 293, column: 3, scope: !1154)
