; ModuleID = 'src/nohup.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [45 x i8] c"Usage: %s COMMAND [ARG]...\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [40 x i8] c"Run COMMAND, ignoring hangup signals.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"nohup\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1

!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !{!15}
!15 = !DIEnumerator(name: "POSIX_NOHUP_FAILURE", value: 127)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 90, baseType: !13, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124)
!19 = !DIEnumerator(name: "EXIT_CANCELED", value: 125)
!20 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126)
!21 = !DIEnumerator(name: "EXIT_ENOENT", value: 127)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !23, line: 42, baseType: !13, size: 32, elements: !24)
!23 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!24 = !{!25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!25 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!26 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!27 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!28 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!29 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!30 = !DIEnumerator(name: "c_quoting_style", value: 5)
!31 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!32 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!33 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!34 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!35 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !13, size: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!39 = !DIEnumerator(name: "_ISupper", value: 256)
!40 = !DIEnumerator(name: "_ISlower", value: 512)
!41 = !DIEnumerator(name: "_ISalpha", value: 1024)
!42 = !DIEnumerator(name: "_ISdigit", value: 2048)
!43 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!44 = !DIEnumerator(name: "_ISspace", value: 8192)
!45 = !DIEnumerator(name: "_ISprint", value: 16384)
!46 = !DIEnumerator(name: "_ISgraph", value: 32768)
!47 = !DIEnumerator(name: "_ISblank", value: 1)
!48 = !DIEnumerator(name: "_IScntrl", value: 2)
!49 = !DIEnumerator(name: "_ISpunct", value: 4)
!50 = !DIEnumerator(name: "_ISalnum", value: 8)
!51 = !{!6, !52, !53, !58, !59, !60, !63}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !54, line: 72, baseType: !55)
!54 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58}
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!62 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!0}
!65 = !{!66, !67, !68, !71, !73, !74, !75, !79, !80, !81, !82, !84, !141, !142, !143, !145, !146}
!66 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!67 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!68 = !DILocalVariable(name: "term", scope: !69, file: !3, line: 585, type: !6)
!69 = distinct !DILexicalBlock(scope: !70, file: !3, line: 582, column: 5)
!70 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!71 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !72)
!72 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!73 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!74 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!75 = !DILocalVariable(name: "s", scope: !76, file: !3, line: 608, type: !6)
!76 = distinct !DILexicalBlock(scope: !77, file: !3, line: 605, column: 5)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 604, column: 12)
!78 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!79 = !DILocalVariable(name: "spaces", scope: !76, file: !3, line: 609, type: !60)
!80 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !60)
!81 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!82 = !DILocalVariable(name: "__ptr", scope: !83, file: !3, line: 644, type: !6)
!83 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!84 = !DILocalVariable(name: "__stream", scope: !83, file: !3, line: 644, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !88)
!87 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !90)
!89 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!90 = !{!91, !92, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !107, !109, !110, !111, !115, !116, !118, !122, !125, !127, !130, !133, !134, !135, !136, !137}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 51, baseType: !58, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 54, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 55, baseType: !93, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 56, baseType: !93, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 57, baseType: !93, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 58, baseType: !93, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 59, baseType: !93, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 60, baseType: !93, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 61, baseType: !93, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 64, baseType: !93, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 65, baseType: !93, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 66, baseType: !93, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 68, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 36, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 70, baseType: !108, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 72, baseType: !58, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 73, baseType: !58, size: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 74, baseType: !112, size: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !113, line: 152, baseType: !114)
!113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!114 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 77, baseType: !59, size: 16, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 78, baseType: !117, size: 8, offset: 1040)
!117 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 79, baseType: !119, size: 8, offset: 1048)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 81, baseType: !123, size: 64, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 43, baseType: null)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 89, baseType: !126, size: 64, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !113, line: 153, baseType: !114)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !88, file: !89, line: 91, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !89, line: 37, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !88, file: !89, line: 92, baseType: !131, size: 64, offset: 1280)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !89, line: 38, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !88, file: !89, line: 93, baseType: !108, size: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !88, file: !89, line: 94, baseType: !52, size: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 95, baseType: !60, size: 64, offset: 1472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 96, baseType: !58, size: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 98, baseType: !138, size: 160, offset: 1568)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = !DILocalVariable(name: "__cnt", scope: !83, file: !3, line: 644, type: !60)
!142 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!143 = !DILocalVariable(name: "__ptr", scope: !144, file: !3, line: 686, type: !6)
!144 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!145 = !DILocalVariable(name: "__stream", scope: !144, file: !3, line: 686, type: !85)
!146 = !DILocalVariable(name: "__cnt", scope: !144, file: !3, line: 686, type: !60)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "Version", scope: !149, file: !150, line: 3, type: !6, isLocal: false, isDefinition: true)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !151, splitDebugInlining: false, nameTableKind: None)
!150 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!151 = !{!147}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "file_name", scope: !154, file: !155, line: 45, type: !6, isLocal: true, isDefinition: true)
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !156, splitDebugInlining: false, nameTableKind: None)
!155 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!156 = !{!152, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !154, file: !155, line: 55, type: !72, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !161, file: !162, line: 66, type: !197, isLocal: false, isDefinition: true)
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !163, globals: !164, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!163 = !{!52, !63}
!164 = !{!165, !191, !159, !193, !195}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "old_file_name", scope: !167, file: !162, line: 304, type: !6, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "verror_at_line", scope: !162, file: !162, line: 298, type: !168, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !184)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !58, !58, !6, !13, !6, !170}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !171, line: 52, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !173, line: 32, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !175, baseType: !176)
!175 = !DIFile(filename: "lib/error.c", directory: "/src")
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !177, size: 256, elements: !178)
!177 = !DINamespace(name: "std", scope: null)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !176, file: !175, baseType: !52, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !176, file: !175, baseType: !52, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !176, file: !175, baseType: !52, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !176, file: !175, baseType: !58, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !176, file: !175, baseType: !58, size: 32, offset: 224)
!184 = !{!185, !186, !187, !188, !189, !190}
!185 = !DILocalVariable(name: "status", arg: 1, scope: !167, file: !162, line: 298, type: !58)
!186 = !DILocalVariable(name: "errnum", arg: 2, scope: !167, file: !162, line: 298, type: !58)
!187 = !DILocalVariable(name: "file_name", arg: 3, scope: !167, file: !162, line: 298, type: !6)
!188 = !DILocalVariable(name: "line_number", arg: 4, scope: !167, file: !162, line: 298, type: !13)
!189 = !DILocalVariable(name: "message", arg: 5, scope: !167, file: !162, line: 298, type: !6)
!190 = !DILocalVariable(name: "args", arg: 6, scope: !167, file: !162, line: 298, type: !170)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "old_line_number", scope: !167, file: !162, line: 305, type: !13, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "error_message_count", scope: !161, file: !162, line: 69, type: !13, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !161, file: !162, line: 295, type: !58, isLocal: false, isDefinition: true)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{null}
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !202, file: !203, line: 506, type: !58, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !203, file: !203, line: 485, type: !204, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !206, retainedNodes: !208)
!203 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!204 = !DISubroutineType(types: !205)
!205 = !{!58, !58, !58}
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !207, splitDebugInlining: false, nameTableKind: None)
!207 = !{!200}
!208 = !{!209, !210, !211, !212, !215}
!209 = !DILocalVariable(name: "fd", arg: 1, scope: !202, file: !203, line: 485, type: !58)
!210 = !DILocalVariable(name: "target", arg: 2, scope: !202, file: !203, line: 485, type: !58)
!211 = !DILocalVariable(name: "result", scope: !202, file: !203, line: 487, type: !58)
!212 = !DILocalVariable(name: "flags", scope: !213, file: !203, line: 530, type: !58)
!213 = distinct !DILexicalBlock(scope: !214, file: !203, line: 529, column: 5)
!214 = distinct !DILexicalBlock(scope: !202, file: !203, line: 528, column: 7)
!215 = !DILocalVariable(name: "saved_errno", scope: !216, file: !203, line: 533, type: !58)
!216 = distinct !DILexicalBlock(scope: !217, file: !203, line: 532, column: 9)
!217 = distinct !DILexicalBlock(scope: !213, file: !203, line: 531, column: 11)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "long_options", scope: !220, file: !221, line: 34, type: !223, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !222, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!222 = !{!218}
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 768, elements: !233)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !226, line: 50, size: 256, elements: !227)
!226 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!227 = !{!228, !229, !230, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !226, line: 52, baseType: !6, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !225, file: !226, line: 55, baseType: !58, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !225, file: !226, line: 56, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !225, file: !226, line: 57, baseType: !58, size: 32, offset: 192)
!233 = !{!234}
!234 = !DISubrange(count: 3)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "program_name", scope: !237, file: !238, line: 31, type: !6, isLocal: false, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !239, globals: !240, splitDebugInlining: false, nameTableKind: None)
!238 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!239 = !{!93}
!240 = !{!235}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "utf07FF", scope: !243, file: !244, line: 46, type: !274, isLocal: true, isDefinition: true)
!243 = distinct !DISubprogram(name: "proper_name_lite", scope: !244, file: !244, line: 38, type: !245, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !247, retainedNodes: !249)
!244 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!245 = !DISubroutineType(types: !246)
!246 = !{!6, !6, !6}
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !248, splitDebugInlining: false, nameTableKind: None)
!248 = !{!241}
!249 = !{!250, !251, !252, !253, !258}
!250 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !243, file: !244, line: 38, type: !6)
!251 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !243, file: !244, line: 38, type: !6)
!252 = !DILocalVariable(name: "translation", scope: !243, file: !244, line: 40, type: !6)
!253 = !DILocalVariable(name: "w", scope: !243, file: !244, line: 47, type: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !255, line: 37, baseType: !256)
!255 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !113, line: 57, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !113, line: 42, baseType: !13)
!258 = !DILocalVariable(name: "mbs", scope: !243, file: !244, line: 48, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !260, line: 6, baseType: !261)
!260 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !262, line: 21, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 13, size: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !263, file: !262, line: 15, baseType: !58, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !263, file: !262, line: 20, baseType: !267, size: 32, offset: 32)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !263, file: !262, line: 16, size: 32, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !267, file: !262, line: 18, baseType: !13, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !267, file: !262, line: 19, baseType: !271, size: 32)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 4)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 2)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !279, file: !280, line: 76, type: !348, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !281, retainedTypes: !287, globals: !288, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!281 = !{!22, !282, !36}
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !23, line: 254, baseType: !13, size: 32, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!285 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!286 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!287 = !{!58, !59, !60}
!288 = !{!277, !289, !295, !307, !309, !314, !337, !344, !346}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !279, file: !280, line: 92, type: !291, isLocal: false, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 320, elements: !293)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!293 = !{!294}
!294 = !DISubrange(count: 10)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !279, file: !280, line: 1040, type: !297, isLocal: false, isDefinition: true)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !280, line: 56, size: 448, elements: !298)
!298 = !{!299, !300, !301, !305, !306}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !297, file: !280, line: 59, baseType: !22, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !280, line: 62, baseType: !58, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !297, file: !280, line: 66, baseType: !302, size: 256, offset: 64)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !297, file: !280, line: 69, baseType: !6, size: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !297, file: !280, line: 72, baseType: !6, size: 64, offset: 384)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !279, file: !280, line: 107, type: !297, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "slot0", scope: !279, file: !280, line: 831, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 256)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "quote", scope: !316, file: !280, line: 228, type: !335, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "gettext_quote", scope: !280, file: !280, line: 197, type: !317, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !279, retainedNodes: !319)
!317 = !DISubroutineType(types: !318)
!318 = !{!6, !6, !22}
!319 = !{!320, !321, !322, !323, !324}
!320 = !DILocalVariable(name: "msgid", arg: 1, scope: !316, file: !280, line: 197, type: !6)
!321 = !DILocalVariable(name: "s", arg: 2, scope: !316, file: !280, line: 197, type: !22)
!322 = !DILocalVariable(name: "translation", scope: !316, file: !280, line: 199, type: !6)
!323 = !DILocalVariable(name: "w", scope: !316, file: !280, line: 229, type: !254)
!324 = !DILocalVariable(name: "mbs", scope: !316, file: !280, line: 230, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !260, line: 6, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !262, line: 21, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 13, size: 64, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !327, file: !262, line: 15, baseType: !58, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !327, file: !262, line: 20, baseType: !331, size: 32, offset: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !262, line: 16, size: 32, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !331, file: !262, line: 18, baseType: !13, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !331, file: !262, line: 19, baseType: !271, size: 32)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !336)
!336 = !{!276, !273}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "slotvec", scope: !279, file: !280, line: 834, type: !339, isLocal: true, isDefinition: true)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !280, line: 823, size: 128, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !340, file: !280, line: 825, baseType: !60, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !340, file: !280, line: 826, baseType: !93, size: 64, offset: 64)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "nslots", scope: !279, file: !280, line: 832, type: !58, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "slotvec0", scope: !279, file: !280, line: 833, type: !340, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 704, elements: !350)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!350 = !{!351}
!351 = !DISubrange(count: 11)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !354, file: !355, line: 26, type: !357, isLocal: false, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !356, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!356 = !{!352}
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 47)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "exit_failure", scope: !362, file: !363, line: 24, type: !365, isLocal: false, isDefinition: true)
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !364, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!364 = !{!360}
!365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "internal_state", scope: !368, file: !369, line: 97, type: !372, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!370 = !{!52, !60, !63}
!371 = !{!366}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !260, line: 6, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !262, line: 21, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 13, size: 64, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !374, file: !262, line: 15, baseType: !58, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !374, file: !262, line: 20, baseType: !378, size: 32, offset: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !262, line: 16, size: 32, elements: !379)
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !378, file: !262, line: 18, baseType: !13, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !378, file: !262, line: 19, baseType: !271, size: 32)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!386 = !{!52}
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !393, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!393 = !{!394}
!394 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !392, line: 40, baseType: !13, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !399, retainedTypes: !430, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!399 = !{!400, !412}
!400 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !401, file: !398, line: 188, baseType: !13, size: 32, elements: !410)
!401 = distinct !DISubprogram(name: "x2nrealloc", scope: !398, file: !398, line: 176, type: !402, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !397, retainedNodes: !405)
!402 = !DISubroutineType(types: !403)
!403 = !{!52, !52, !404, !60}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!405 = !{!406, !407, !408, !409}
!406 = !DILocalVariable(name: "p", arg: 1, scope: !401, file: !398, line: 176, type: !52)
!407 = !DILocalVariable(name: "pn", arg: 2, scope: !401, file: !398, line: 176, type: !404)
!408 = !DILocalVariable(name: "s", arg: 3, scope: !401, file: !398, line: 176, type: !60)
!409 = !DILocalVariable(name: "n", scope: !401, file: !398, line: 178, type: !60)
!410 = !{!411}
!411 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !413, file: !398, line: 228, baseType: !13, size: 32, elements: !410)
!413 = distinct !DISubprogram(name: "xpalloc", scope: !398, file: !398, line: 223, type: !414, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !397, retainedNodes: !420)
!414 = !DISubroutineType(types: !415)
!415 = !{!52, !52, !416, !417, !419, !417}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !418, line: 130, baseType: !419)
!418 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !61, line: 35, baseType: !114)
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428, !429}
!421 = !DILocalVariable(name: "pa", arg: 1, scope: !413, file: !398, line: 223, type: !52)
!422 = !DILocalVariable(name: "pn", arg: 2, scope: !413, file: !398, line: 223, type: !416)
!423 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !413, file: !398, line: 223, type: !417)
!424 = !DILocalVariable(name: "n_max", arg: 4, scope: !413, file: !398, line: 223, type: !419)
!425 = !DILocalVariable(name: "s", arg: 5, scope: !413, file: !398, line: 223, type: !417)
!426 = !DILocalVariable(name: "n0", scope: !413, file: !398, line: 230, type: !417)
!427 = !DILocalVariable(name: "n", scope: !413, file: !398, line: 237, type: !417)
!428 = !DILocalVariable(name: "nbytes", scope: !413, file: !398, line: 248, type: !417)
!429 = !DILocalVariable(name: "adjusted_nbytes", scope: !413, file: !398, line: 252, type: !417)
!430 = !{!93, !52, !72, !114, !62}
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !239, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!445 = !{!72, !62, !52}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !386, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!452 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!453 = !{i32 7, !"Dwarf Version", i32 5}
!454 = !{i32 2, !"Debug Info Version", i32 3}
!455 = !{i32 1, !"wchar_size", i32 4}
!456 = !{i32 1, !"branch-target-enforcement", i32 0}
!457 = !{i32 1, !"sign-return-address", i32 0}
!458 = !{i32 1, !"sign-return-address-all", i32 0}
!459 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!460 = !{i32 7, !"PIC Level", i32 2}
!461 = !{i32 7, !"PIE Level", i32 2}
!462 = !{i32 7, !"uwtable", i32 1}
!463 = !{i32 7, !"frame-pointer", i32 1}
!464 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 43, type: !56, scopeLine: 44, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !465)
!465 = !{!466}
!466 = !DILocalVariable(name: "status", arg: 1, scope: !464, file: !10, line: 43, type: !58)
!467 = !DILocation(line: 0, scope: !464)
!468 = !DILocation(line: 45, column: 14, scope: !469)
!469 = distinct !DILexicalBlock(scope: !464, file: !10, line: 45, column: 7)
!470 = !DILocation(line: 45, column: 7, scope: !464)
!471 = !DILocation(line: 46, column: 5, scope: !472)
!472 = distinct !DILexicalBlock(scope: !469, file: !10, line: 46, column: 5)
!473 = !{!474, !474, i64 0}
!474 = !{!"any pointer", !475, i64 0}
!475 = !{!"omnipotent char", !476, i64 0}
!476 = !{!"Simple C/C++ TBAA"}
!477 = !DILocation(line: 49, column: 7, scope: !478)
!478 = distinct !DILexicalBlock(scope: !469, file: !10, line: 48, column: 5)
!479 = !DILocation(line: 55, column: 7, scope: !478)
!480 = !DILocation(line: 59, column: 7, scope: !478)
!481 = !DILocation(line: 60, column: 7, scope: !478)
!482 = !DILocation(line: 61, column: 7, scope: !478)
!483 = !DILocation(line: 68, column: 7, scope: !478)
!484 = !DILocalVariable(name: "program", arg: 1, scope: !485, file: !3, line: 824, type: !6)
!485 = distinct !DISubprogram(name: "emit_exec_status", scope: !3, file: !3, line: 824, type: !486, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !6}
!488 = !{!484}
!489 = !DILocation(line: 0, scope: !485, inlinedAt: !490)
!490 = distinct !DILocation(line: 69, column: 7, scope: !478)
!491 = !DILocation(line: 826, column: 7, scope: !485, inlinedAt: !490)
!492 = !DILocalVariable(name: "program", arg: 1, scope: !493, file: !3, line: 836, type: !6)
!493 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !486, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !494)
!494 = !{!492, !495, !504, !505, !507, !508}
!495 = !DILocalVariable(name: "infomap", scope: !493, file: !3, line: 838, type: !496)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 896, elements: !502)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !493, file: !3, line: 838, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !498, file: !3, line: 838, baseType: !6, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!502 = !{!503}
!503 = !DISubrange(count: 7)
!504 = !DILocalVariable(name: "node", scope: !493, file: !3, line: 848, type: !6)
!505 = !DILocalVariable(name: "map_prog", scope: !493, file: !3, line: 849, type: !506)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!507 = !DILocalVariable(name: "lc_messages", scope: !493, file: !3, line: 861, type: !6)
!508 = !DILocalVariable(name: "url_program", scope: !493, file: !3, line: 874, type: !6)
!509 = !DILocation(line: 0, scope: !493, inlinedAt: !510)
!510 = distinct !DILocation(line: 70, column: 7, scope: !478)
!511 = !DILocation(line: 838, column: 3, scope: !493, inlinedAt: !510)
!512 = !DILocation(line: 838, column: 67, scope: !493, inlinedAt: !510)
!513 = !DILocation(line: 849, column: 36, scope: !493, inlinedAt: !510)
!514 = !DILocation(line: 851, column: 3, scope: !493, inlinedAt: !510)
!515 = !DILocalVariable(name: "__s1", arg: 1, scope: !516, file: !517, line: 1359, type: !6)
!516 = distinct !DISubprogram(name: "streq", scope: !517, file: !517, line: 1359, type: !518, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !520)
!517 = !DIFile(filename: "./lib/string.h", directory: "/src")
!518 = !DISubroutineType(types: !519)
!519 = !{!72, !6, !6}
!520 = !{!515, !521}
!521 = !DILocalVariable(name: "__s2", arg: 2, scope: !516, file: !517, line: 1359, type: !6)
!522 = !DILocation(line: 0, scope: !516, inlinedAt: !523)
!523 = distinct !DILocation(line: 851, column: 33, scope: !493, inlinedAt: !510)
!524 = !DILocation(line: 1361, column: 11, scope: !516, inlinedAt: !523)
!525 = !DILocation(line: 1361, column: 10, scope: !516, inlinedAt: !523)
!526 = !DILocation(line: 852, column: 13, scope: !493, inlinedAt: !510)
!527 = !DILocation(line: 851, column: 20, scope: !493, inlinedAt: !510)
!528 = !{!529, !474, i64 0}
!529 = !{!"infomap", !474, i64 0, !474, i64 8}
!530 = !DILocation(line: 851, column: 10, scope: !493, inlinedAt: !510)
!531 = !DILocation(line: 851, column: 28, scope: !493, inlinedAt: !510)
!532 = distinct !{!532, !514, !526, !533}
!533 = !{!"llvm.loop.mustprogress"}
!534 = !DILocation(line: 854, column: 17, scope: !535, inlinedAt: !510)
!535 = distinct !DILexicalBlock(scope: !493, file: !3, line: 854, column: 7)
!536 = !{!529, !474, i64 8}
!537 = !DILocation(line: 854, column: 7, scope: !535, inlinedAt: !510)
!538 = !DILocation(line: 854, column: 7, scope: !493, inlinedAt: !510)
!539 = !DILocation(line: 857, column: 3, scope: !493, inlinedAt: !510)
!540 = !DILocation(line: 861, column: 29, scope: !493, inlinedAt: !510)
!541 = !DILocation(line: 862, column: 7, scope: !542, inlinedAt: !510)
!542 = distinct !DILexicalBlock(scope: !493, file: !3, line: 862, column: 7)
!543 = !DILocation(line: 862, column: 19, scope: !542, inlinedAt: !510)
!544 = !DILocation(line: 862, column: 22, scope: !542, inlinedAt: !510)
!545 = !DILocation(line: 862, column: 7, scope: !493, inlinedAt: !510)
!546 = !DILocation(line: 868, column: 7, scope: !547, inlinedAt: !510)
!547 = distinct !DILexicalBlock(scope: !542, file: !3, line: 863, column: 5)
!548 = !DILocation(line: 870, column: 5, scope: !547, inlinedAt: !510)
!549 = !DILocation(line: 0, scope: !516, inlinedAt: !550)
!550 = distinct !DILocation(line: 874, column: 29, scope: !493, inlinedAt: !510)
!551 = !DILocation(line: 875, column: 3, scope: !493, inlinedAt: !510)
!552 = !DILocation(line: 877, column: 3, scope: !493, inlinedAt: !510)
!553 = !DILocation(line: 879, column: 1, scope: !493, inlinedAt: !510)
!554 = !DILocation(line: 72, column: 3, scope: !464)
!555 = !DISubprogram(name: "dcgettext", scope: !556, file: !556, line: 51, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!556 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!557 = !DISubroutineType(types: !558)
!558 = !{!93, !6, !6, !58}
!559 = !{}
!560 = !DISubprogram(name: "fputs_unlocked", scope: !171, file: !171, line: 691, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!561 = !DISubroutineType(types: !562)
!562 = !{!58, !563, !564}
!563 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!564 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!565 = !DILocation(line: 0, scope: !2)
!566 = !DILocation(line: 581, column: 7, scope: !70)
!567 = !{!568, !568, i64 0}
!568 = !{!"int", !475, i64 0}
!569 = !DILocation(line: 581, column: 19, scope: !70)
!570 = !DILocation(line: 581, column: 7, scope: !2)
!571 = !DILocation(line: 585, column: 26, scope: !69)
!572 = !DILocation(line: 0, scope: !69)
!573 = !DILocation(line: 586, column: 23, scope: !69)
!574 = !DILocation(line: 586, column: 28, scope: !69)
!575 = !DILocation(line: 586, column: 32, scope: !69)
!576 = !{!475, !475, i64 0}
!577 = !DILocation(line: 586, column: 38, scope: !69)
!578 = !DILocation(line: 0, scope: !516, inlinedAt: !579)
!579 = distinct !DILocation(line: 586, column: 41, scope: !69)
!580 = !DILocation(line: 1361, column: 11, scope: !516, inlinedAt: !579)
!581 = !DILocation(line: 1361, column: 10, scope: !516, inlinedAt: !579)
!582 = !DILocation(line: 586, column: 19, scope: !69)
!583 = !DILocation(line: 587, column: 5, scope: !69)
!584 = !DILocation(line: 588, column: 7, scope: !585)
!585 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!586 = !DILocation(line: 588, column: 7, scope: !2)
!587 = !DILocation(line: 590, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !585, file: !3, line: 589, column: 5)
!589 = !DILocation(line: 591, column: 7, scope: !588)
!590 = !DILocation(line: 595, column: 37, scope: !2)
!591 = !DILocation(line: 595, column: 35, scope: !2)
!592 = !DILocation(line: 596, column: 29, scope: !2)
!593 = !DILocation(line: 597, column: 8, scope: !78)
!594 = !DILocation(line: 597, column: 7, scope: !2)
!595 = !DILocation(line: 604, column: 24, scope: !77)
!596 = !DILocation(line: 604, column: 12, scope: !78)
!597 = !DILocation(line: 0, scope: !76)
!598 = !DILocation(line: 610, column: 16, scope: !76)
!599 = !DILocation(line: 610, column: 7, scope: !76)
!600 = !DILocation(line: 611, column: 21, scope: !76)
!601 = !{!602, !602, i64 0}
!602 = !{!"short", !475, i64 0}
!603 = !DILocation(line: 611, column: 19, scope: !76)
!604 = !DILocation(line: 611, column: 16, scope: !76)
!605 = !DILocation(line: 610, column: 30, scope: !76)
!606 = distinct !{!606, !599, !600, !533}
!607 = !DILocation(line: 612, column: 18, scope: !608)
!608 = distinct !DILexicalBlock(scope: !76, file: !3, line: 612, column: 11)
!609 = !DILocation(line: 612, column: 11, scope: !76)
!610 = !DILocation(line: 620, column: 23, scope: !2)
!611 = !DILocation(line: 625, column: 39, scope: !2)
!612 = !DILocation(line: 626, column: 3, scope: !2)
!613 = !DILocation(line: 626, column: 10, scope: !2)
!614 = !DILocation(line: 626, column: 21, scope: !2)
!615 = !DILocation(line: 628, column: 44, scope: !616)
!616 = distinct !DILexicalBlock(scope: !617, file: !3, line: 628, column: 11)
!617 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!618 = !DILocation(line: 628, column: 32, scope: !616)
!619 = !DILocation(line: 628, column: 49, scope: !616)
!620 = !DILocation(line: 628, column: 11, scope: !617)
!621 = !DILocation(line: 630, column: 11, scope: !622)
!622 = distinct !DILexicalBlock(scope: !617, file: !3, line: 630, column: 11)
!623 = !DILocation(line: 630, column: 11, scope: !617)
!624 = !DILocation(line: 632, column: 26, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !3, line: 632, column: 15)
!626 = distinct !DILexicalBlock(scope: !622, file: !3, line: 631, column: 9)
!627 = !DILocation(line: 632, column: 34, scope: !625)
!628 = !DILocation(line: 632, column: 37, scope: !625)
!629 = !DILocation(line: 632, column: 15, scope: !626)
!630 = !DILocation(line: 636, column: 29, scope: !631)
!631 = distinct !DILexicalBlock(scope: !626, file: !3, line: 636, column: 15)
!632 = !DILocation(line: 640, column: 16, scope: !617)
!633 = distinct !{!633, !612, !634, !533}
!634 = !DILocation(line: 641, column: 5, scope: !2)
!635 = !DILocation(line: 644, column: 3, scope: !2)
!636 = !DILocation(line: 0, scope: !516, inlinedAt: !637)
!637 = distinct !DILocation(line: 648, column: 31, scope: !2)
!638 = !DILocation(line: 0, scope: !516, inlinedAt: !639)
!639 = distinct !DILocation(line: 649, column: 31, scope: !2)
!640 = !DILocation(line: 0, scope: !516, inlinedAt: !641)
!641 = distinct !DILocation(line: 650, column: 31, scope: !2)
!642 = !DILocation(line: 0, scope: !516, inlinedAt: !643)
!643 = distinct !DILocation(line: 651, column: 31, scope: !2)
!644 = !DILocation(line: 0, scope: !516, inlinedAt: !645)
!645 = distinct !DILocation(line: 652, column: 31, scope: !2)
!646 = !DILocation(line: 0, scope: !516, inlinedAt: !647)
!647 = distinct !DILocation(line: 653, column: 31, scope: !2)
!648 = !DILocation(line: 0, scope: !516, inlinedAt: !649)
!649 = distinct !DILocation(line: 654, column: 31, scope: !2)
!650 = !DILocation(line: 0, scope: !516, inlinedAt: !651)
!651 = distinct !DILocation(line: 655, column: 31, scope: !2)
!652 = !DILocation(line: 0, scope: !516, inlinedAt: !653)
!653 = distinct !DILocation(line: 656, column: 31, scope: !2)
!654 = !DILocation(line: 0, scope: !516, inlinedAt: !655)
!655 = distinct !DILocation(line: 657, column: 31, scope: !2)
!656 = !DILocation(line: 663, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!658 = !DILocation(line: 664, column: 7, scope: !657)
!659 = !DILocation(line: 664, column: 10, scope: !657)
!660 = !DILocation(line: 663, column: 7, scope: !2)
!661 = !DILocation(line: 669, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !3, line: 665, column: 5)
!663 = !DILocation(line: 671, column: 5, scope: !662)
!664 = !DILocation(line: 676, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !657, file: !3, line: 673, column: 5)
!666 = !DILocation(line: 679, column: 3, scope: !2)
!667 = !DILocation(line: 683, column: 3, scope: !2)
!668 = !DILocation(line: 686, column: 3, scope: !2)
!669 = !DILocation(line: 688, column: 3, scope: !2)
!670 = !DILocation(line: 691, column: 3, scope: !2)
!671 = !DILocation(line: 695, column: 3, scope: !2)
!672 = !DILocation(line: 696, column: 1, scope: !2)
!673 = !DISubprogram(name: "setlocale", scope: !674, file: !674, line: 122, type: !675, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!674 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!675 = !DISubroutineType(types: !676)
!676 = !{!93, !58, !6}
!677 = !DISubprogram(name: "getenv", scope: !678, file: !678, line: 641, type: !679, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!678 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!679 = !DISubroutineType(types: !680)
!680 = !{!93, !6}
!681 = !DISubprogram(name: "fwrite_unlocked", scope: !171, file: !171, line: 704, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!682 = !DISubroutineType(types: !683)
!683 = !{!60, !684, !60, !60, !564}
!684 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!687 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 82, type: !688, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !691)
!688 = !DISubroutineType(types: !689)
!689 = !{!58, !58, !690}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !705, !706, !709, !710, !711, !715, !716, !719, !720, !723, !724, !729, !730, !731}
!692 = !DILocalVariable(name: "argc", arg: 1, scope: !687, file: !10, line: 82, type: !58)
!693 = !DILocalVariable(name: "argv", arg: 2, scope: !687, file: !10, line: 82, type: !690)
!694 = !DILocalVariable(name: "exit_internal_failure", scope: !687, file: !10, line: 94, type: !58)
!695 = !DILocalVariable(name: "ignoring_input", scope: !687, file: !10, line: 109, type: !72)
!696 = !DILocalVariable(name: "redirecting_stdout", scope: !687, file: !10, line: 110, type: !72)
!697 = !DILocalVariable(name: "stdout_is_closed", scope: !687, file: !10, line: 111, type: !72)
!698 = !DILocalVariable(name: "redirecting_stderr", scope: !687, file: !10, line: 112, type: !72)
!699 = !DILocalVariable(name: "__errstatus", scope: !700, file: !10, line: 120, type: !704)
!700 = distinct !DILexicalBlock(scope: !701, file: !10, line: 120, column: 9)
!701 = distinct !DILexicalBlock(scope: !702, file: !10, line: 119, column: 11)
!702 = distinct !DILexicalBlock(scope: !703, file: !10, line: 118, column: 5)
!703 = distinct !DILexicalBlock(scope: !687, file: !10, line: 117, column: 7)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!705 = !DILocalVariable(name: "out_fd", scope: !687, file: !10, line: 130, type: !58)
!706 = !DILocalVariable(name: "in_home", scope: !707, file: !10, line: 133, type: !93)
!707 = distinct !DILexicalBlock(scope: !708, file: !10, line: 132, column: 5)
!708 = distinct !DILexicalBlock(scope: !687, file: !10, line: 131, column: 7)
!709 = !DILocalVariable(name: "file", scope: !707, file: !10, line: 134, type: !6)
!710 = !DILocalVariable(name: "flags", scope: !707, file: !10, line: 135, type: !58)
!711 = !DILocalVariable(name: "mode", scope: !707, file: !10, line: 136, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !713, line: 69, baseType: !714)
!713 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !113, line: 150, baseType: !13)
!715 = !DILocalVariable(name: "umask_value", scope: !707, file: !10, line: 137, type: !712)
!716 = !DILocalVariable(name: "saved_errno", scope: !717, file: !10, line: 144, type: !58)
!717 = distinct !DILexicalBlock(scope: !718, file: !10, line: 143, column: 9)
!718 = distinct !DILexicalBlock(scope: !707, file: !10, line: 142, column: 11)
!719 = !DILocalVariable(name: "home", scope: !717, file: !10, line: 145, type: !6)
!720 = !DILocalVariable(name: "saved_errno2", scope: !721, file: !10, line: 155, type: !58)
!721 = distinct !DILexicalBlock(scope: !722, file: !10, line: 154, column: 13)
!722 = distinct !DILexicalBlock(scope: !717, file: !10, line: 153, column: 15)
!723 = !DILocalVariable(name: "saved_stderr_fd", scope: !687, file: !10, line: 175, type: !58)
!724 = !DILocalVariable(name: "__errstatus", scope: !725, file: !10, line: 193, type: !704)
!725 = distinct !DILexicalBlock(scope: !726, file: !10, line: 193, column: 9)
!726 = distinct !DILexicalBlock(scope: !727, file: !10, line: 192, column: 11)
!727 = distinct !DILexicalBlock(scope: !728, file: !10, line: 177, column: 5)
!728 = distinct !DILexicalBlock(scope: !687, file: !10, line: 176, column: 7)
!729 = !DILocalVariable(name: "cmd", scope: !687, file: !10, line: 211, type: !690)
!730 = !DILocalVariable(name: "exit_status", scope: !687, file: !10, line: 213, type: !58)
!731 = !DILocalVariable(name: "saved_errno", scope: !687, file: !10, line: 214, type: !58)
!732 = !DILocation(line: 0, scope: !687)
!733 = !DILocation(line: 85, column: 21, scope: !687)
!734 = !DILocation(line: 85, column: 3, scope: !687)
!735 = !DILocation(line: 86, column: 3, scope: !687)
!736 = !DILocation(line: 87, column: 3, scope: !687)
!737 = !DILocation(line: 88, column: 3, scope: !687)
!738 = !DILocation(line: 94, column: 32, scope: !687)
!739 = !DILocalVariable(name: "status", arg: 1, scope: !740, file: !3, line: 102, type: !58)
!740 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !3, file: !3, line: 102, type: !56, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !741)
!741 = !{!739}
!742 = !DILocation(line: 0, scope: !740, inlinedAt: !743)
!743 = distinct !DILocation(line: 96, column: 3, scope: !687)
!744 = !DILocation(line: 105, column: 18, scope: !745, inlinedAt: !743)
!745 = distinct !DILexicalBlock(scope: !740, file: !3, line: 104, column: 7)
!746 = !DILocation(line: 97, column: 3, scope: !687)
!747 = !DILocation(line: 100, column: 36, scope: !687)
!748 = !DILocation(line: 100, column: 59, scope: !687)
!749 = !DILocation(line: 99, column: 3, scope: !687)
!750 = !DILocation(line: 103, column: 15, scope: !751)
!751 = distinct !DILexicalBlock(scope: !687, file: !10, line: 103, column: 7)
!752 = !DILocation(line: 103, column: 12, scope: !751)
!753 = !DILocation(line: 103, column: 7, scope: !687)
!754 = !DILocation(line: 105, column: 7, scope: !755)
!755 = distinct !DILexicalBlock(scope: !751, file: !10, line: 104, column: 5)
!756 = !DILocation(line: 106, column: 7, scope: !755)
!757 = !DILocation(line: 109, column: 25, scope: !687)
!758 = !DILocation(line: 110, column: 29, scope: !687)
!759 = !DILocation(line: 111, column: 48, scope: !687)
!760 = !DILocation(line: 111, column: 51, scope: !687)
!761 = !DILocation(line: 111, column: 57, scope: !687)
!762 = !DILocation(line: 112, column: 29, scope: !687)
!763 = !DILocation(line: 117, column: 7, scope: !687)
!764 = !DILocation(line: 119, column: 11, scope: !701)
!765 = !DILocation(line: 119, column: 62, scope: !701)
!766 = !DILocation(line: 119, column: 11, scope: !702)
!767 = !DILocation(line: 0, scope: !701)
!768 = !DILocation(line: 122, column: 31, scope: !769)
!769 = distinct !DILexicalBlock(scope: !702, file: !10, line: 122, column: 11)
!770 = !DILocation(line: 123, column: 9, scope: !769)
!771 = !DILocation(line: 131, column: 26, scope: !708)
!772 = !DILocation(line: 131, column: 49, scope: !708)
!773 = !DILocation(line: 0, scope: !707)
!774 = !DILocation(line: 137, column: 28, scope: !707)
!775 = !DILocation(line: 139, column: 19, scope: !707)
!776 = !DILocation(line: 138, column: 17, scope: !707)
!777 = !DILocation(line: 140, column: 19, scope: !707)
!778 = !DILocation(line: 142, column: 18, scope: !718)
!779 = !DILocation(line: 142, column: 11, scope: !707)
!780 = !DILocation(line: 144, column: 29, scope: !717)
!781 = !DILocation(line: 0, scope: !717)
!782 = !DILocation(line: 145, column: 30, scope: !717)
!783 = !DILocation(line: 146, column: 15, scope: !784)
!784 = distinct !DILexicalBlock(scope: !717, file: !10, line: 146, column: 15)
!785 = !DILocation(line: 146, column: 15, scope: !717)
!786 = !DILocation(line: 148, column: 25, scope: !787)
!787 = distinct !DILexicalBlock(scope: !784, file: !10, line: 147, column: 13)
!788 = !DILocation(line: 149, column: 25, scope: !787)
!789 = !DILocation(line: 150, column: 27, scope: !787)
!790 = !DILocation(line: 151, column: 27, scope: !787)
!791 = !DILocation(line: 153, column: 22, scope: !722)
!792 = !DILocation(line: 153, column: 15, scope: !717)
!793 = !DILocation(line: 155, column: 34, scope: !721)
!794 = !DILocation(line: 0, scope: !721)
!795 = !DILocation(line: 156, column: 15, scope: !721)
!796 = !DILocation(line: 157, column: 19, scope: !797)
!797 = distinct !DILexicalBlock(scope: !721, file: !10, line: 157, column: 19)
!798 = !DILocation(line: 157, column: 19, scope: !721)
!799 = !DILocation(line: 158, column: 17, scope: !797)
!800 = !DILocation(line: 134, column: 19, scope: !707)
!801 = !DILocation(line: 165, column: 7, scope: !707)
!802 = !DILocation(line: 166, column: 7, scope: !707)
!803 = !DILocation(line: 171, column: 7, scope: !707)
!804 = !DILocation(line: 176, column: 7, scope: !687)
!805 = !DILocation(line: 182, column: 25, scope: !727)
!806 = !DILocation(line: 185, column: 11, scope: !727)
!807 = !DILocation(line: 186, column: 9, scope: !808)
!808 = distinct !DILexicalBlock(scope: !727, file: !10, line: 185, column: 11)
!809 = !DILocation(line: 192, column: 11, scope: !726)
!810 = !DILocation(line: 192, column: 40, scope: !726)
!811 = !DILocation(line: 192, column: 11, scope: !727)
!812 = !DILocation(line: 0, scope: !726)
!813 = !DILocation(line: 196, column: 11, scope: !727)
!814 = !DILocation(line: 197, column: 9, scope: !815)
!815 = distinct !DILexicalBlock(scope: !727, file: !10, line: 196, column: 11)
!816 = !DILocation(line: 206, column: 7, scope: !817)
!817 = distinct !DILexicalBlock(scope: !687, file: !10, line: 206, column: 7)
!818 = !DILocalVariable(name: "__stream", arg: 1, scope: !819, file: !820, line: 135, type: !85)
!819 = distinct !DISubprogram(name: "ferror_unlocked", scope: !820, file: !820, line: 135, type: !821, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !823)
!820 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!821 = !DISubroutineType(types: !822)
!822 = !{!58, !85}
!823 = !{!818}
!824 = !DILocation(line: 0, scope: !819, inlinedAt: !825)
!825 = distinct !DILocation(line: 206, column: 7, scope: !817)
!826 = !DILocation(line: 137, column: 10, scope: !819, inlinedAt: !825)
!827 = !{!828, !568, i64 0}
!828 = !{!"_IO_FILE", !568, i64 0, !474, i64 8, !474, i64 16, !474, i64 24, !474, i64 32, !474, i64 40, !474, i64 48, !474, i64 56, !474, i64 64, !474, i64 72, !474, i64 80, !474, i64 88, !474, i64 96, !474, i64 104, !568, i64 112, !568, i64 116, !829, i64 120, !602, i64 128, !475, i64 130, !475, i64 131, !474, i64 136, !829, i64 144, !474, i64 152, !474, i64 160, !474, i64 168, !474, i64 176, !829, i64 184, !568, i64 192, !475, i64 196}
!829 = !{!"long", !475, i64 0}
!830 = !DILocation(line: 206, column: 7, scope: !687)
!831 = !DILocation(line: 209, column: 3, scope: !687)
!832 = !DILocation(line: 211, column: 23, scope: !687)
!833 = !DILocation(line: 211, column: 21, scope: !687)
!834 = !DILocation(line: 212, column: 11, scope: !687)
!835 = !DILocation(line: 212, column: 3, scope: !687)
!836 = !DILocation(line: 213, column: 21, scope: !687)
!837 = !DILocation(line: 213, column: 27, scope: !687)
!838 = !DILocation(line: 222, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !687, file: !10, line: 222, column: 7)
!840 = !DILocation(line: 222, column: 45, scope: !839)
!841 = !DILocation(line: 222, column: 7, scope: !687)
!842 = !DILocation(line: 223, column: 5, scope: !839)
!843 = !DILocation(line: 226, column: 1, scope: !687)
!844 = !DISubprogram(name: "bindtextdomain", scope: !556, file: !556, line: 86, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!845 = !DISubroutineType(types: !846)
!846 = !{!93, !6, !6}
!847 = !DISubprogram(name: "textdomain", scope: !556, file: !556, line: 82, type: !679, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!848 = !DISubprogram(name: "atexit", scope: !678, file: !678, line: 602, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!849 = !DISubroutineType(types: !850)
!850 = !{!58, !197}
!851 = !DISubprogram(name: "isatty", scope: !852, file: !852, line: 809, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!852 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!853 = !DISubroutineType(types: !854)
!854 = !{!58, !58}
!855 = !DISubprogram(name: "umask", scope: !856, file: !856, line: 380, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!856 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!857 = !DISubroutineType(types: !858)
!858 = !{!714, !714}
!859 = !DISubprogram(name: "open", scope: !860, file: !860, line: 181, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!860 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!861 = !DISubroutineType(types: !862)
!862 = !{!58, !6, !58, null}
!863 = !DISubprogram(name: "dup2", scope: !852, file: !852, line: 555, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!864 = !DISubprogram(name: "close", scope: !852, file: !852, line: 358, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!865 = !DISubprogram(name: "signal", scope: !54, file: !54, line: 88, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!866 = !DISubroutineType(types: !867)
!867 = !{!53, !58, !53}
!868 = !DISubprogram(name: "execvp", scope: !852, file: !852, line: 599, type: !869, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!869 = !DISubroutineType(types: !870)
!870 = !{!58, !6, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!873 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !155, file: !155, line: 50, type: !486, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !874)
!874 = !{!875}
!875 = !DILocalVariable(name: "file", arg: 1, scope: !873, file: !155, line: 50, type: !6)
!876 = !DILocation(line: 0, scope: !873)
!877 = !DILocation(line: 52, column: 13, scope: !873)
!878 = !DILocation(line: 53, column: 1, scope: !873)
!879 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !155, file: !155, line: 87, type: !880, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !72}
!882 = !{!883}
!883 = !DILocalVariable(name: "ignore", arg: 1, scope: !879, file: !155, line: 87, type: !72)
!884 = !DILocation(line: 0, scope: !879)
!885 = !DILocation(line: 89, column: 16, scope: !879)
!886 = !{!887, !887, i64 0}
!887 = !{!"_Bool", !475, i64 0}
!888 = !DILocation(line: 90, column: 1, scope: !879)
!889 = distinct !DISubprogram(name: "close_stdout", scope: !155, file: !155, line: 116, type: !198, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !154, retainedNodes: !890)
!890 = !{!891}
!891 = !DILocalVariable(name: "write_error", scope: !892, file: !155, line: 121, type: !6)
!892 = distinct !DILexicalBlock(scope: !893, file: !155, line: 120, column: 5)
!893 = distinct !DILexicalBlock(scope: !889, file: !155, line: 118, column: 7)
!894 = !DILocation(line: 118, column: 21, scope: !893)
!895 = !DILocation(line: 118, column: 7, scope: !893)
!896 = !DILocation(line: 118, column: 29, scope: !893)
!897 = !DILocation(line: 119, column: 7, scope: !893)
!898 = !DILocation(line: 119, column: 12, scope: !893)
!899 = !{i8 0, i8 2}
!900 = !DILocation(line: 119, column: 25, scope: !893)
!901 = !DILocation(line: 119, column: 28, scope: !893)
!902 = !DILocation(line: 119, column: 34, scope: !893)
!903 = !DILocation(line: 118, column: 7, scope: !889)
!904 = !DILocation(line: 121, column: 33, scope: !892)
!905 = !DILocation(line: 0, scope: !892)
!906 = !DILocation(line: 122, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !892, file: !155, line: 122, column: 11)
!908 = !DILocation(line: 0, scope: !907)
!909 = !DILocation(line: 122, column: 11, scope: !892)
!910 = !DILocation(line: 123, column: 9, scope: !907)
!911 = !DILocation(line: 126, column: 9, scope: !907)
!912 = !DILocation(line: 128, column: 14, scope: !892)
!913 = !DILocation(line: 128, column: 7, scope: !892)
!914 = !DILocation(line: 133, column: 42, scope: !915)
!915 = distinct !DILexicalBlock(scope: !889, file: !155, line: 133, column: 7)
!916 = !DILocation(line: 133, column: 28, scope: !915)
!917 = !DILocation(line: 133, column: 50, scope: !915)
!918 = !DILocation(line: 133, column: 7, scope: !889)
!919 = !DILocation(line: 134, column: 12, scope: !915)
!920 = !DILocation(line: 134, column: 5, scope: !915)
!921 = !DILocation(line: 135, column: 1, scope: !889)
!922 = distinct !DISubprogram(name: "verror", scope: !162, file: !162, line: 251, type: !923, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !925)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !58, !58, !6, !170}
!925 = !{!926, !927, !928, !929}
!926 = !DILocalVariable(name: "status", arg: 1, scope: !922, file: !162, line: 251, type: !58)
!927 = !DILocalVariable(name: "errnum", arg: 2, scope: !922, file: !162, line: 251, type: !58)
!928 = !DILocalVariable(name: "message", arg: 3, scope: !922, file: !162, line: 251, type: !6)
!929 = !DILocalVariable(name: "args", arg: 4, scope: !922, file: !162, line: 251, type: !170)
!930 = !DILocation(line: 0, scope: !922)
!931 = !DILocation(line: 251, column: 1, scope: !922)
!932 = !DILocation(line: 261, column: 3, scope: !922)
!933 = !DILocation(line: 265, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !922, file: !162, line: 265, column: 7)
!935 = !DILocation(line: 265, column: 7, scope: !922)
!936 = !DILocation(line: 266, column: 5, scope: !934)
!937 = !DILocation(line: 272, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !934, file: !162, line: 268, column: 5)
!939 = !DILocation(line: 276, column: 3, scope: !922)
!940 = !{i64 0, i64 8, !473, i64 8, i64 8, !473, i64 16, i64 8, !473, i64 24, i64 4, !567, i64 28, i64 4, !567}
!941 = !DILocation(line: 282, column: 1, scope: !922)
!942 = distinct !DISubprogram(name: "flush_stdout", scope: !162, file: !162, line: 163, type: !198, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !943)
!943 = !{!944}
!944 = !DILocalVariable(name: "stdout_fd", scope: !942, file: !162, line: 166, type: !58)
!945 = !DILocation(line: 0, scope: !942)
!946 = !DILocalVariable(name: "fd", arg: 1, scope: !947, file: !162, line: 145, type: !58)
!947 = distinct !DISubprogram(name: "is_open", scope: !162, file: !162, line: 145, type: !853, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !948)
!948 = !{!946}
!949 = !DILocation(line: 0, scope: !947, inlinedAt: !950)
!950 = distinct !DILocation(line: 182, column: 25, scope: !951)
!951 = distinct !DILexicalBlock(scope: !942, file: !162, line: 182, column: 7)
!952 = !DILocation(line: 157, column: 15, scope: !947, inlinedAt: !950)
!953 = !DILocation(line: 182, column: 25, scope: !951)
!954 = !DILocation(line: 182, column: 7, scope: !942)
!955 = !DILocation(line: 184, column: 5, scope: !951)
!956 = !DILocation(line: 185, column: 1, scope: !942)
!957 = distinct !DISubprogram(name: "error_tail", scope: !162, file: !162, line: 219, type: !923, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DILocalVariable(name: "status", arg: 1, scope: !957, file: !162, line: 219, type: !58)
!960 = !DILocalVariable(name: "errnum", arg: 2, scope: !957, file: !162, line: 219, type: !58)
!961 = !DILocalVariable(name: "message", arg: 3, scope: !957, file: !162, line: 219, type: !6)
!962 = !DILocalVariable(name: "args", arg: 4, scope: !957, file: !162, line: 219, type: !170)
!963 = !DILocation(line: 0, scope: !957)
!964 = !DILocation(line: 219, column: 1, scope: !957)
!965 = !DILocation(line: 229, column: 13, scope: !957)
!966 = !DILocation(line: 229, column: 3, scope: !957)
!967 = !DILocalVariable(name: "__stream", arg: 1, scope: !968, file: !969, line: 132, type: !972)
!968 = distinct !DISubprogram(name: "vfprintf", scope: !969, file: !969, line: 132, type: !970, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1007)
!969 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!970 = !DISubroutineType(types: !971)
!971 = !{!58, !972, !563, !172}
!972 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !975, file: !89, line: 51, baseType: !58, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !975, file: !89, line: 54, baseType: !93, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !975, file: !89, line: 55, baseType: !93, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !975, file: !89, line: 56, baseType: !93, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !975, file: !89, line: 57, baseType: !93, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !975, file: !89, line: 58, baseType: !93, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !975, file: !89, line: 59, baseType: !93, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !975, file: !89, line: 60, baseType: !93, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !975, file: !89, line: 61, baseType: !93, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !975, file: !89, line: 64, baseType: !93, size: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !975, file: !89, line: 65, baseType: !93, size: 64, offset: 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !975, file: !89, line: 66, baseType: !93, size: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !975, file: !89, line: 68, baseType: !105, size: 64, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !975, file: !89, line: 70, baseType: !991, size: 64, offset: 832)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !975, file: !89, line: 72, baseType: !58, size: 32, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !975, file: !89, line: 73, baseType: !58, size: 32, offset: 928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !975, file: !89, line: 74, baseType: !112, size: 64, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !975, file: !89, line: 77, baseType: !59, size: 16, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !975, file: !89, line: 78, baseType: !117, size: 8, offset: 1040)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !975, file: !89, line: 79, baseType: !119, size: 8, offset: 1048)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !975, file: !89, line: 81, baseType: !123, size: 64, offset: 1088)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !975, file: !89, line: 89, baseType: !126, size: 64, offset: 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !975, file: !89, line: 91, baseType: !128, size: 64, offset: 1216)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !975, file: !89, line: 92, baseType: !131, size: 64, offset: 1280)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !975, file: !89, line: 93, baseType: !991, size: 64, offset: 1344)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !975, file: !89, line: 94, baseType: !52, size: 64, offset: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !975, file: !89, line: 95, baseType: !60, size: 64, offset: 1472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !975, file: !89, line: 96, baseType: !58, size: 32, offset: 1536)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !975, file: !89, line: 98, baseType: !138, size: 160, offset: 1568)
!1007 = !{!967, !1008, !1009}
!1008 = !DILocalVariable(name: "__fmt", arg: 2, scope: !968, file: !969, line: 133, type: !563)
!1009 = !DILocalVariable(name: "__ap", arg: 3, scope: !968, file: !969, line: 133, type: !172)
!1010 = !DILocation(line: 0, scope: !968, inlinedAt: !1011)
!1011 = distinct !DILocation(line: 229, column: 3, scope: !957)
!1012 = !DILocation(line: 135, column: 10, scope: !968, inlinedAt: !1011)
!1013 = !{!1014, !1016}
!1014 = distinct !{!1014, !1015, !"vfprintf.inline: argument 0"}
!1015 = distinct !{!1015, !"vfprintf.inline"}
!1016 = distinct !{!1016, !1015, !"vfprintf.inline: argument 1"}
!1017 = !DILocation(line: 232, column: 3, scope: !957)
!1018 = !DILocation(line: 233, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !957, file: !162, line: 233, column: 7)
!1020 = !DILocation(line: 233, column: 7, scope: !957)
!1021 = !DILocalVariable(name: "errnum", arg: 1, scope: !1022, file: !162, line: 188, type: !58)
!1022 = distinct !DISubprogram(name: "print_errno_message", scope: !162, file: !162, line: 188, type: !56, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1023)
!1023 = !{!1021, !1024, !1025}
!1024 = !DILocalVariable(name: "s", scope: !1022, file: !162, line: 190, type: !6)
!1025 = !DILocalVariable(name: "errbuf", scope: !1022, file: !162, line: 193, type: !1026)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 1024)
!1029 = !DILocation(line: 0, scope: !1022, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 234, column: 5, scope: !1019)
!1031 = !DILocation(line: 193, column: 3, scope: !1022, inlinedAt: !1030)
!1032 = !DILocation(line: 193, column: 8, scope: !1022, inlinedAt: !1030)
!1033 = !DILocation(line: 195, column: 7, scope: !1022, inlinedAt: !1030)
!1034 = !DILocation(line: 207, column: 9, scope: !1035, inlinedAt: !1030)
!1035 = distinct !DILexicalBlock(scope: !1022, file: !162, line: 207, column: 7)
!1036 = !DILocation(line: 207, column: 7, scope: !1022, inlinedAt: !1030)
!1037 = !DILocation(line: 208, column: 9, scope: !1035, inlinedAt: !1030)
!1038 = !DILocation(line: 208, column: 5, scope: !1035, inlinedAt: !1030)
!1039 = !DILocation(line: 214, column: 3, scope: !1022, inlinedAt: !1030)
!1040 = !DILocation(line: 216, column: 1, scope: !1022, inlinedAt: !1030)
!1041 = !DILocation(line: 234, column: 5, scope: !1019)
!1042 = !DILocation(line: 238, column: 3, scope: !957)
!1043 = !DILocalVariable(name: "__c", arg: 1, scope: !1044, file: !820, line: 101, type: !58)
!1044 = distinct !DISubprogram(name: "putc_unlocked", scope: !820, file: !820, line: 101, type: !1045, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1047)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!58, !58, !973}
!1047 = !{!1043, !1048}
!1048 = !DILocalVariable(name: "__stream", arg: 2, scope: !1044, file: !820, line: 101, type: !973)
!1049 = !DILocation(line: 0, scope: !1044, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 238, column: 3, scope: !957)
!1051 = !DILocation(line: 103, column: 10, scope: !1044, inlinedAt: !1050)
!1052 = !{!828, !474, i64 40}
!1053 = !{!828, !474, i64 48}
!1054 = !{!"branch_weights", i32 2000, i32 1}
!1055 = !DILocation(line: 240, column: 3, scope: !957)
!1056 = !DILocation(line: 241, column: 7, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !957, file: !162, line: 241, column: 7)
!1058 = !DILocation(line: 241, column: 7, scope: !957)
!1059 = !DILocation(line: 242, column: 5, scope: !1057)
!1060 = !DILocation(line: 243, column: 1, scope: !957)
!1061 = !DISubprogram(name: "strerror_r", scope: !1062, file: !1062, line: 444, type: !1063, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!1062 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!93, !58, !93, !60}
!1065 = !DISubprogram(name: "fflush_unlocked", scope: !171, file: !171, line: 239, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!58, !973}
!1068 = !DISubprogram(name: "fcntl", scope: !860, file: !860, line: 149, type: !1069, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !559)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!58, !58, !58, null}
!1071 = distinct !DISubprogram(name: "error", scope: !162, file: !162, line: 285, type: !1072, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !58, !58, !6, null}
!1074 = !{!1075, !1076, !1077, !1078}
!1075 = !DILocalVariable(name: "status", arg: 1, scope: !1071, file: !162, line: 285, type: !58)
!1076 = !DILocalVariable(name: "errnum", arg: 2, scope: !1071, file: !162, line: 285, type: !58)
!1077 = !DILocalVariable(name: "message", arg: 3, scope: !1071, file: !162, line: 285, type: !6)
!1078 = !DILocalVariable(name: "ap", scope: !1071, file: !162, line: 287, type: !170)
!1079 = !DILocation(line: 0, scope: !1071)
!1080 = !DILocation(line: 287, column: 3, scope: !1071)
!1081 = !DILocation(line: 287, column: 11, scope: !1071)
!1082 = !DILocation(line: 288, column: 3, scope: !1071)
!1083 = !DILocation(line: 289, column: 3, scope: !1071)
!1084 = !DILocation(line: 290, column: 3, scope: !1071)
!1085 = !DILocation(line: 291, column: 1, scope: !1071)
!1086 = !DILocation(line: 0, scope: !167)
!1087 = !DILocation(line: 298, column: 1, scope: !167)
!1088 = !DILocation(line: 302, column: 7, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !167, file: !162, line: 302, column: 7)
!1090 = !DILocation(line: 302, column: 7, scope: !167)
!1091 = !DILocation(line: 307, column: 11, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !162, line: 307, column: 11)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !162, line: 303, column: 5)
!1094 = !DILocation(line: 307, column: 27, scope: !1092)
!1095 = !DILocation(line: 308, column: 11, scope: !1092)
!1096 = !DILocation(line: 308, column: 28, scope: !1092)
!1097 = !DILocation(line: 308, column: 25, scope: !1092)
!1098 = !DILocation(line: 309, column: 15, scope: !1092)
!1099 = !DILocation(line: 309, column: 33, scope: !1092)
!1100 = !DILocation(line: 310, column: 19, scope: !1092)
!1101 = !DILocation(line: 311, column: 22, scope: !1092)
!1102 = !DILocation(line: 311, column: 56, scope: !1092)
!1103 = !DILocation(line: 307, column: 11, scope: !1093)
!1104 = !DILocation(line: 316, column: 21, scope: !1093)
!1105 = !DILocation(line: 317, column: 23, scope: !1093)
!1106 = !DILocation(line: 318, column: 5, scope: !1093)
!1107 = !DILocation(line: 327, column: 3, scope: !167)
!1108 = !DILocation(line: 331, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !167, file: !162, line: 331, column: 7)
!1110 = !DILocation(line: 331, column: 7, scope: !167)
!1111 = !DILocation(line: 332, column: 5, scope: !1109)
!1112 = !DILocation(line: 338, column: 7, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1109, file: !162, line: 334, column: 5)
!1114 = !DILocation(line: 346, column: 3, scope: !167)
!1115 = !DILocation(line: 350, column: 3, scope: !167)
!1116 = !DILocation(line: 356, column: 1, scope: !167)
!1117 = distinct !DISubprogram(name: "error_at_line", scope: !162, file: !162, line: 359, type: !1118, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !58, !58, !6, !13, !6, null}
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126}
!1121 = !DILocalVariable(name: "status", arg: 1, scope: !1117, file: !162, line: 359, type: !58)
!1122 = !DILocalVariable(name: "errnum", arg: 2, scope: !1117, file: !162, line: 359, type: !58)
!1123 = !DILocalVariable(name: "file_name", arg: 3, scope: !1117, file: !162, line: 359, type: !6)
!1124 = !DILocalVariable(name: "line_number", arg: 4, scope: !1117, file: !162, line: 360, type: !13)
!1125 = !DILocalVariable(name: "message", arg: 5, scope: !1117, file: !162, line: 360, type: !6)
!1126 = !DILocalVariable(name: "ap", scope: !1117, file: !162, line: 362, type: !170)
!1127 = !DILocation(line: 0, scope: !1117)
!1128 = !DILocation(line: 362, column: 3, scope: !1117)
!1129 = !DILocation(line: 362, column: 11, scope: !1117)
!1130 = !DILocation(line: 363, column: 3, scope: !1117)
!1131 = !DILocation(line: 364, column: 3, scope: !1117)
!1132 = !DILocation(line: 366, column: 3, scope: !1117)
!1133 = !DILocation(line: 367, column: 1, scope: !1117)
!1134 = distinct !DISubprogram(name: "rpl_fcntl", scope: !203, file: !203, line: 202, type: !1069, scopeLine: 207, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !206, retainedNodes: !1135)
!1135 = !{!1136, !1137, !1138, !1149, !1150, !1153, !1155, !1159}
!1136 = !DILocalVariable(name: "fd", arg: 1, scope: !1134, file: !203, line: 202, type: !58)
!1137 = !DILocalVariable(name: "action", arg: 2, scope: !1134, file: !203, line: 202, type: !58)
!1138 = !DILocalVariable(name: "arg", scope: !1134, file: !203, line: 208, type: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !173, line: 14, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1141, baseType: !1142)
!1141 = !DIFile(filename: "lib/fcntl.c", directory: "/src")
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !177, size: 256, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1142, file: !1141, line: 208, baseType: !52, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1142, file: !1141, line: 208, baseType: !52, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1142, file: !1141, line: 208, baseType: !52, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1142, file: !1141, line: 208, baseType: !58, size: 32, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1142, file: !1141, line: 208, baseType: !58, size: 32, offset: 224)
!1149 = !DILocalVariable(name: "result", scope: !1134, file: !203, line: 211, type: !58)
!1150 = !DILocalVariable(name: "target", scope: !1151, file: !203, line: 216, type: !58)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !203, line: 215, column: 7)
!1152 = distinct !DILexicalBlock(scope: !1134, file: !203, line: 213, column: 5)
!1153 = !DILocalVariable(name: "target", scope: !1154, file: !203, line: 223, type: !58)
!1154 = distinct !DILexicalBlock(scope: !1152, file: !203, line: 222, column: 7)
!1155 = !DILocalVariable(name: "x", scope: !1156, file: !203, line: 418, type: !58)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !203, line: 417, column: 13)
!1157 = distinct !DILexicalBlock(scope: !1158, file: !203, line: 261, column: 11)
!1158 = distinct !DILexicalBlock(scope: !1152, file: !203, line: 258, column: 7)
!1159 = !DILocalVariable(name: "p", scope: !1160, file: !203, line: 426, type: !52)
!1160 = distinct !DILexicalBlock(scope: !1157, file: !203, line: 425, column: 13)
!1161 = !DILocation(line: 0, scope: !1134)
!1162 = !DILocation(line: 208, column: 3, scope: !1134)
!1163 = !DILocation(line: 208, column: 11, scope: !1134)
!1164 = !DILocation(line: 209, column: 3, scope: !1134)
!1165 = !DILocation(line: 212, column: 3, scope: !1134)
!1166 = !DILocation(line: 216, column: 22, scope: !1151)
!1167 = !DILocation(line: 0, scope: !1151)
!1168 = !DILocalVariable(name: "fd", arg: 1, scope: !1169, file: !203, line: 444, type: !58)
!1169 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD", scope: !203, file: !203, line: 444, type: !204, scopeLine: 445, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !206, retainedNodes: !1170)
!1170 = !{!1168, !1171, !1172}
!1171 = !DILocalVariable(name: "target", arg: 2, scope: !1169, file: !203, line: 444, type: !58)
!1172 = !DILocalVariable(name: "result", scope: !1169, file: !203, line: 446, type: !58)
!1173 = !DILocation(line: 0, scope: !1169, inlinedAt: !1174)
!1174 = distinct !DILocation(line: 217, column: 18, scope: !1151)
!1175 = !DILocation(line: 479, column: 12, scope: !1169, inlinedAt: !1174)
!1176 = !DILocation(line: 223, column: 22, scope: !1154)
!1177 = !DILocation(line: 0, scope: !1154)
!1178 = !DILocation(line: 0, scope: !202, inlinedAt: !1179)
!1179 = distinct !DILocation(line: 224, column: 18, scope: !1154)
!1180 = !DILocation(line: 507, column: 12, scope: !1181, inlinedAt: !1179)
!1181 = distinct !DILexicalBlock(scope: !202, file: !203, line: 507, column: 7)
!1182 = !DILocation(line: 507, column: 9, scope: !1181, inlinedAt: !1179)
!1183 = !DILocation(line: 507, column: 7, scope: !202, inlinedAt: !1179)
!1184 = !DILocation(line: 509, column: 16, scope: !1185, inlinedAt: !1179)
!1185 = distinct !DILexicalBlock(scope: !1181, file: !203, line: 508, column: 5)
!1186 = !DILocation(line: 510, column: 13, scope: !1187, inlinedAt: !1179)
!1187 = distinct !DILexicalBlock(scope: !1185, file: !203, line: 510, column: 11)
!1188 = !DILocation(line: 510, column: 23, scope: !1187, inlinedAt: !1179)
!1189 = !DILocation(line: 510, column: 26, scope: !1187, inlinedAt: !1179)
!1190 = !DILocation(line: 510, column: 32, scope: !1187, inlinedAt: !1179)
!1191 = !DILocation(line: 510, column: 11, scope: !1185, inlinedAt: !1179)
!1192 = !DILocation(line: 512, column: 30, scope: !1193, inlinedAt: !1179)
!1193 = distinct !DILexicalBlock(scope: !1187, file: !203, line: 511, column: 9)
!1194 = !DILocation(line: 528, column: 19, scope: !214, inlinedAt: !1179)
!1195 = !DILocation(line: 0, scope: !1169, inlinedAt: !1196)
!1196 = distinct !DILocation(line: 520, column: 20, scope: !1197, inlinedAt: !1179)
!1197 = distinct !DILexicalBlock(scope: !1187, file: !203, line: 519, column: 9)
