; ModuleID = 'src/nproc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.mntent = type { i8*, i8*, i8*, i8*, i32, i32 }
%struct.cpu_set_t = type { [16 x i64] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!6 = !DIFile(filename: "./lib/nproc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dd1b9803a99598e46cd95fdfb7d0bf6e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "NPROC_ALL", value: 0)
!10 = !DIEnumerator(name: "NPROC_CURRENT", value: 1)
!11 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 24, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!16 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!17 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!18 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 46, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!22 = !DIEnumerator(name: "_ISupper", value: 256)
!23 = !DIEnumerator(name: "_ISlower", value: 512)
!24 = !DIEnumerator(name: "_ISalpha", value: 1024)
!25 = !DIEnumerator(name: "_ISdigit", value: 2048)
!26 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!27 = !DIEnumerator(name: "_ISspace", value: 8192)
!28 = !DIEnumerator(name: "_ISprint", value: 16384)
!29 = !DIEnumerator(name: "_ISgraph", value: 32768)
!30 = !DIEnumerator(name: "_ISblank", value: 1)
!31 = !DIEnumerator(name: "_IScntrl", value: 2)
!32 = !DIEnumerator(name: "_ISpunct", value: 4)
!33 = !DIEnumerator(name: "_ISalnum", value: 8)
!34 = !{!35, !37, !38, !39, !40, !43, !45}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 46, baseType: !42)
!41 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!42 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !{!47, !0}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !49, file: !50, line: 575, type: !38, isLocal: true, isDefinition: true)
!49 = distinct !DISubprogram(name: "oputs_", scope: !50, file: !50, line: 573, type: !51, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !53)
!50 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!51 = !DISubroutineType(types: !52)
!52 = !{null, !43, !43}
!53 = !{!54, !55, !56, !59, !61, !62, !63, !67, !68, !69, !70, !72, !128, !129, !130, !132, !133}
!54 = !DILocalVariable(name: "program", arg: 1, scope: !49, file: !50, line: 573, type: !43)
!55 = !DILocalVariable(name: "option", arg: 2, scope: !49, file: !50, line: 573, type: !43)
!56 = !DILocalVariable(name: "term", scope: !57, file: !50, line: 585, type: !43)
!57 = distinct !DILexicalBlock(scope: !58, file: !50, line: 582, column: 5)
!58 = distinct !DILexicalBlock(scope: !49, file: !50, line: 581, column: 7)
!59 = !DILocalVariable(name: "double_space", scope: !49, file: !50, line: 594, type: !60)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DILocalVariable(name: "first_word", scope: !49, file: !50, line: 595, type: !43)
!62 = !DILocalVariable(name: "option_text", scope: !49, file: !50, line: 596, type: !43)
!63 = !DILocalVariable(name: "s", scope: !64, file: !50, line: 608, type: !43)
!64 = distinct !DILexicalBlock(scope: !65, file: !50, line: 605, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !50, line: 604, column: 12)
!66 = distinct !DILexicalBlock(scope: !49, file: !50, line: 597, column: 7)
!67 = !DILocalVariable(name: "spaces", scope: !64, file: !50, line: 609, type: !40)
!68 = !DILocalVariable(name: "anchor_len", scope: !49, file: !50, line: 620, type: !40)
!69 = !DILocalVariable(name: "desc_text", scope: !49, file: !50, line: 625, type: !43)
!70 = !DILocalVariable(name: "__ptr", scope: !71, file: !50, line: 644, type: !43)
!71 = distinct !DILexicalBlock(scope: !49, file: !50, line: 644, column: 3)
!72 = !DILocalVariable(name: "__stream", scope: !71, file: !50, line: 644, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !38, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !35, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !35, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !35, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !35, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !35, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !35, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !35, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !35, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !35, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !35, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !35, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !38, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !38, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!101 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !39, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !37, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !40, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !38, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocalVariable(name: "__cnt", scope: !71, file: !50, line: 644, type: !40)
!129 = !DILocalVariable(name: "url_program", scope: !49, file: !50, line: 648, type: !43)
!130 = !DILocalVariable(name: "__ptr", scope: !131, file: !50, line: 686, type: !43)
!131 = distinct !DILexicalBlock(scope: !49, file: !50, line: 686, column: 3)
!132 = !DILocalVariable(name: "__stream", scope: !131, file: !50, line: 686, type: !73)
!133 = !DILocalVariable(name: "__cnt", scope: !131, file: !50, line: 686, type: !40)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1280, elements: !144)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !137, line: 50, size: 256, elements: !138)
!137 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!138 = !{!139, !140, !141, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 52, baseType: !43, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !136, file: !137, line: 55, baseType: !38, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !136, file: !137, line: 56, baseType: !142, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !136, file: !137, line: 57, baseType: !38, size: 32, offset: 192)
!144 = !{!145}
!145 = !DISubrange(count: 5)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "Version", scope: !148, file: !149, line: 3, type: !43, isLocal: false, isDefinition: true)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !150, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!150 = !{!146}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "file_name", scope: !153, file: !154, line: 45, type: !43, isLocal: true, isDefinition: true)
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !155, splitDebugInlining: false, nameTableKind: None)
!154 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!155 = !{!151, !156}
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !153, file: !154, line: 55, type: !60, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !160, file: !161, line: 66, type: !196, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !162, globals: !163, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!162 = !{!37, !45}
!163 = !{!164, !190, !158, !192, !194}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "old_file_name", scope: !166, file: !161, line: 304, type: !43, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "verror_at_line", scope: !161, file: !161, line: 298, type: !167, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !183)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !38, !38, !43, !7, !43, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !170, line: 52, baseType: !171)
!170 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !172, line: 32, baseType: !173)
!172 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !174, baseType: !175)
!174 = !DIFile(filename: "lib/error.c", directory: "/src")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !176, size: 256, elements: !177)
!176 = !DINamespace(name: "std", scope: null)
!177 = !{!178, !179, !180, !181, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !175, file: !174, baseType: !37, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !175, file: !174, baseType: !37, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !175, file: !174, baseType: !37, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !175, file: !174, baseType: !38, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !175, file: !174, baseType: !38, size: 32, offset: 224)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DILocalVariable(name: "status", arg: 1, scope: !166, file: !161, line: 298, type: !38)
!185 = !DILocalVariable(name: "errnum", arg: 2, scope: !166, file: !161, line: 298, type: !38)
!186 = !DILocalVariable(name: "file_name", arg: 3, scope: !166, file: !161, line: 298, type: !43)
!187 = !DILocalVariable(name: "line_number", arg: 4, scope: !166, file: !161, line: 298, type: !7)
!188 = !DILocalVariable(name: "message", arg: 5, scope: !166, file: !161, line: 298, type: !43)
!189 = !DILocalVariable(name: "args", arg: 6, scope: !166, file: !161, line: 298, type: !169)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "old_line_number", scope: !166, file: !161, line: 305, type: !7, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "error_message_count", scope: !160, file: !161, line: 69, type: !7, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !160, file: !161, line: 295, type: !38, isLocal: false, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "program_name", scope: !201, file: !202, line: 31, type: !43, isLocal: false, isDefinition: true)
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !202, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !203, globals: !204, splitDebugInlining: false, nameTableKind: None)
!202 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!203 = !{!35}
!204 = !{!199}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "utf07FF", scope: !207, file: !208, line: 46, type: !238, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "proper_name_lite", scope: !208, file: !208, line: 38, type: !209, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !211, retainedNodes: !213)
!208 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!209 = !DISubroutineType(types: !210)
!210 = !{!43, !43, !43}
!211 = distinct !DICompileUnit(language: DW_LANG_C99, file: !208, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !212, splitDebugInlining: false, nameTableKind: None)
!212 = !{!205}
!213 = !{!214, !215, !216, !217, !222}
!214 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !207, file: !208, line: 38, type: !43)
!215 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !207, file: !208, line: 38, type: !43)
!216 = !DILocalVariable(name: "translation", scope: !207, file: !208, line: 40, type: !43)
!217 = !DILocalVariable(name: "w", scope: !207, file: !208, line: 47, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !219, line: 37, baseType: !220)
!219 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !100, line: 57, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !100, line: 42, baseType: !7)
!222 = !DILocalVariable(name: "mbs", scope: !207, file: !208, line: 48, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !224, line: 6, baseType: !225)
!224 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !226, line: 21, baseType: !227)
!226 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 13, size: 64, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !227, file: !226, line: 15, baseType: !38, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !227, file: !226, line: 20, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !226, line: 16, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !231, file: !226, line: 18, baseType: !7, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !231, file: !226, line: 19, baseType: !235, size: 32)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 4)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 16, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 2)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !243, file: !244, line: 76, type: !326, isLocal: false, isDefinition: true)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !245, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!245 = !{!246, !260, !19}
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !247, line: 42, baseType: !7, size: 32, elements: !248)
!247 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!249 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!250 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!251 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!252 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!253 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!254 = !DIEnumerator(name: "c_quoting_style", value: 5)
!255 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!256 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!257 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!258 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!259 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !247, line: 254, baseType: !7, size: 32, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!263 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!264 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!265 = !{!38, !39, !40}
!266 = !{!241, !267, !273, !285, !287, !292, !315, !322, !324}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !243, file: !244, line: 92, type: !269, isLocal: false, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 320, elements: !271)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!271 = !{!272}
!272 = !DISubrange(count: 10)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !243, file: !244, line: 1040, type: !275, isLocal: false, isDefinition: true)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !244, line: 56, size: 448, elements: !276)
!276 = !{!277, !278, !279, !283, !284}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !275, file: !244, line: 59, baseType: !246, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !244, line: 62, baseType: !38, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !275, file: !244, line: 66, baseType: !280, size: 256, offset: 64)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !275, file: !244, line: 69, baseType: !43, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !275, file: !244, line: 72, baseType: !43, size: 64, offset: 384)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !243, file: !244, line: 107, type: !275, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "slot0", scope: !243, file: !244, line: 831, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 2048, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 256)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "quote", scope: !294, file: !244, line: 228, type: !313, isLocal: true, isDefinition: true)
!294 = distinct !DISubprogram(name: "gettext_quote", scope: !244, file: !244, line: 197, type: !295, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !297)
!295 = !DISubroutineType(types: !296)
!296 = !{!43, !43, !246}
!297 = !{!298, !299, !300, !301, !302}
!298 = !DILocalVariable(name: "msgid", arg: 1, scope: !294, file: !244, line: 197, type: !43)
!299 = !DILocalVariable(name: "s", arg: 2, scope: !294, file: !244, line: 197, type: !246)
!300 = !DILocalVariable(name: "translation", scope: !294, file: !244, line: 199, type: !43)
!301 = !DILocalVariable(name: "w", scope: !294, file: !244, line: 229, type: !218)
!302 = !DILocalVariable(name: "mbs", scope: !294, file: !244, line: 230, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !224, line: 6, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !226, line: 21, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 13, size: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !305, file: !226, line: 15, baseType: !38, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !305, file: !226, line: 20, baseType: !309, size: 32, offset: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !305, file: !226, line: 16, size: 32, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !309, file: !226, line: 18, baseType: !7, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !309, file: !226, line: 19, baseType: !235, size: 32)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !314)
!314 = !{!240, !237}
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "slotvec", scope: !243, file: !244, line: 834, type: !317, isLocal: true, isDefinition: true)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !244, line: 823, size: 128, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !244, line: 825, baseType: !40, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !318, file: !244, line: 826, baseType: !35, size: 64, offset: 64)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "nslots", scope: !243, file: !244, line: 832, type: !38, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "slotvec0", scope: !243, file: !244, line: 833, type: !318, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 704, elements: !328)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!328 = !{!329}
!329 = !DISubrange(count: 11)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !332, file: !333, line: 26, type: !335, isLocal: false, isDefinition: true)
!332 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !334, splitDebugInlining: false, nameTableKind: None)
!333 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!334 = !{!330}
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 47)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "exit_failure", scope: !340, file: !341, line: 24, type: !343, isLocal: false, isDefinition: true)
!340 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !342, splitDebugInlining: false, nameTableKind: None)
!341 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!342 = !{!338}
!343 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "internal_state", scope: !346, file: !347, line: 97, type: !350, isLocal: true, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !347, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !348, globals: !349, splitDebugInlining: false, nameTableKind: None)
!347 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!348 = !{!37, !40, !45}
!349 = !{!344}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !224, line: 6, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !226, line: 21, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 13, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !352, file: !226, line: 15, baseType: !38, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !352, file: !226, line: 20, baseType: !356, size: 32, offset: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !352, file: !226, line: 16, size: 32, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !356, file: !226, line: 18, baseType: !7, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !356, file: !226, line: 19, baseType: !235, size: 32)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !585, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/nproc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8ed3d3246f48dd170075371c80925eac")
!364 = !{!5, !365}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !366, line: 71, baseType: !7, size: 32, elements: !367)
!366 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!368 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!369 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!370 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!371 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!372 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!373 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!374 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!375 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!376 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!377 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!378 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!379 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!380 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!381 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!382 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!383 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!384 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!385 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!386 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!387 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!388 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!389 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!390 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!391 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!392 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!393 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!394 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!395 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!396 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!397 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!398 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!399 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!400 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!401 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!402 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!403 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!404 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!405 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!406 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!407 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!408 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!409 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!410 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!411 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!412 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!413 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!414 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!415 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!416 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!417 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!418 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!419 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!420 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!421 = !DIEnumerator(name: "_SC_PII", value: 53)
!422 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!423 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!424 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!425 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!426 = !DIEnumerator(name: "_SC_POLL", value: 58)
!427 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!428 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!429 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!430 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!431 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!432 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!433 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!434 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!435 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!436 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!437 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!438 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!439 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!440 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!441 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!442 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!443 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!444 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!445 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!446 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!447 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!448 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!449 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!450 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!451 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!452 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!453 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!454 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!455 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!456 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!457 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!458 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!459 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!460 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!461 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!462 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!463 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!464 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!465 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!466 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!467 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!468 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!469 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!470 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!471 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!472 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!473 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!474 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!475 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!476 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!477 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!478 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!479 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!480 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!481 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!482 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!483 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!484 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!485 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!486 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!487 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!488 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!489 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!490 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!491 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!492 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!493 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!494 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!495 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!496 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!497 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!498 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!499 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!500 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!501 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!502 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!503 = !DIEnumerator(name: "_SC_BASE", value: 134)
!504 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!505 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!506 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!507 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!508 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!509 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!510 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!511 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!512 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!513 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!514 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!515 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!516 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!517 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!518 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!519 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!520 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!521 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!522 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!523 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!524 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!525 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!526 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!527 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!528 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!529 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!530 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!531 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!532 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!533 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!534 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!535 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!536 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!537 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!538 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!539 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!540 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!541 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!542 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!543 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!544 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!545 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!546 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!547 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!548 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!549 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!550 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!551 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!552 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!553 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!554 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!555 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!556 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!557 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!558 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!559 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!560 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!561 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!562 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!563 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!564 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!565 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!566 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!567 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!568 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!569 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!570 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!571 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!572 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!573 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!574 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!575 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!576 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!577 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!578 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!579 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!580 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!581 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!582 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!583 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!584 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!585 = !{!37, !586, !101}
!586 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !589, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!589 = !{!590}
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !588, line: 40, baseType: !7, size: 32, elements: !591)
!591 = !{!592}
!592 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!593 = !{!37}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !596, retainedTypes: !627, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!596 = !{!597, !609}
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !598, file: !595, line: 188, baseType: !7, size: 32, elements: !607)
!598 = distinct !DISubprogram(name: "x2nrealloc", scope: !595, file: !595, line: 176, type: !599, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !602)
!599 = !DISubroutineType(types: !600)
!600 = !{!37, !37, !601, !40}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!602 = !{!603, !604, !605, !606}
!603 = !DILocalVariable(name: "p", arg: 1, scope: !598, file: !595, line: 176, type: !37)
!604 = !DILocalVariable(name: "pn", arg: 2, scope: !598, file: !595, line: 176, type: !601)
!605 = !DILocalVariable(name: "s", arg: 3, scope: !598, file: !595, line: 176, type: !40)
!606 = !DILocalVariable(name: "n", scope: !598, file: !595, line: 178, type: !40)
!607 = !{!608}
!608 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!609 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !610, file: !595, line: 228, baseType: !7, size: 32, elements: !607)
!610 = distinct !DISubprogram(name: "xpalloc", scope: !595, file: !595, line: 223, type: !611, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !617)
!611 = !DISubroutineType(types: !612)
!612 = !{!37, !37, !613, !614, !616, !614}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !615, line: 130, baseType: !616)
!615 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !41, line: 35, baseType: !101)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626}
!618 = !DILocalVariable(name: "pa", arg: 1, scope: !610, file: !595, line: 223, type: !37)
!619 = !DILocalVariable(name: "pn", arg: 2, scope: !610, file: !595, line: 223, type: !613)
!620 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !610, file: !595, line: 223, type: !614)
!621 = !DILocalVariable(name: "n_max", arg: 4, scope: !610, file: !595, line: 223, type: !616)
!622 = !DILocalVariable(name: "s", arg: 5, scope: !610, file: !595, line: 223, type: !614)
!623 = !DILocalVariable(name: "n0", scope: !610, file: !595, line: 230, type: !614)
!624 = !DILocalVariable(name: "n", scope: !610, file: !595, line: 237, type: !614)
!625 = !DILocalVariable(name: "nbytes", scope: !610, file: !595, line: 248, type: !614)
!626 = !DILocalVariable(name: "adjusted_nbytes", scope: !610, file: !595, line: 252, type: !614)
!627 = !{!35, !37, !60, !101, !42}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!632 = !{!633, !12}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !634, line: 30, baseType: !7, size: 32, elements: !635)
!634 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!635 = !{!636, !637, !638, !639, !640}
!636 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!637 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!638 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!639 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!640 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !643, retainedTypes: !644, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!643 = !{!633, !19}
!644 = !{!38, !39, !35, !60, !42, !645}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !646, line: 102, baseType: !647)
!646 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !100, line: 73, baseType: !42)
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !660, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!660 = !{!60, !42, !37}
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!667 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!668 = !{i32 7, !"Dwarf Version", i32 5}
!669 = !{i32 2, !"Debug Info Version", i32 3}
!670 = !{i32 1, !"wchar_size", i32 4}
!671 = !{i32 1, !"branch-target-enforcement", i32 0}
!672 = !{i32 1, !"sign-return-address", i32 0}
!673 = !{i32 1, !"sign-return-address-all", i32 0}
!674 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!675 = !{i32 7, !"PIC Level", i32 2}
!676 = !{i32 7, !"PIE Level", i32 2}
!677 = !{i32 7, !"uwtable", i32 1}
!678 = !{i32 7, !"frame-pointer", i32 1}
!679 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 50, type: !680, scopeLine: 51, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !682)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !38}
!682 = !{!683}
!683 = !DILocalVariable(name: "status", arg: 1, scope: !679, file: !3, line: 50, type: !38)
!684 = !DILocation(line: 0, scope: !679)
!685 = !DILocation(line: 52, column: 14, scope: !686)
!686 = distinct !DILexicalBlock(scope: !679, file: !3, line: 52, column: 7)
!687 = !DILocation(line: 52, column: 7, scope: !679)
!688 = !DILocation(line: 53, column: 5, scope: !689)
!689 = distinct !DILexicalBlock(scope: !686, file: !3, line: 53, column: 5)
!690 = !{!691, !691, i64 0}
!691 = !{!"any pointer", !692, i64 0}
!692 = !{!"omnipotent char", !693, i64 0}
!693 = !{!"Simple C/C++ TBAA"}
!694 = !DILocation(line: 56, column: 7, scope: !695)
!695 = distinct !DILexicalBlock(scope: !686, file: !3, line: 55, column: 5)
!696 = !DILocation(line: 57, column: 7, scope: !695)
!697 = !DILocation(line: 64, column: 7, scope: !695)
!698 = !DILocation(line: 69, column: 7, scope: !695)
!699 = !DILocation(line: 75, column: 7, scope: !695)
!700 = !DILocation(line: 76, column: 7, scope: !695)
!701 = !DILocalVariable(name: "program", arg: 1, scope: !702, file: !50, line: 836, type: !43)
!702 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !50, file: !50, line: 836, type: !703, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !705)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !43}
!705 = !{!701, !706, !715, !716, !718, !719}
!706 = !DILocalVariable(name: "infomap", scope: !702, file: !50, line: 838, type: !707)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 896, elements: !713)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !702, file: !50, line: 838, size: 128, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !709, file: !50, line: 838, baseType: !43, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !709, file: !50, line: 838, baseType: !43, size: 64, offset: 64)
!713 = !{!714}
!714 = !DISubrange(count: 7)
!715 = !DILocalVariable(name: "node", scope: !702, file: !50, line: 848, type: !43)
!716 = !DILocalVariable(name: "map_prog", scope: !702, file: !50, line: 849, type: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!718 = !DILocalVariable(name: "lc_messages", scope: !702, file: !50, line: 861, type: !43)
!719 = !DILocalVariable(name: "url_program", scope: !702, file: !50, line: 874, type: !43)
!720 = !DILocation(line: 0, scope: !702, inlinedAt: !721)
!721 = distinct !DILocation(line: 77, column: 7, scope: !695)
!722 = !DILocation(line: 838, column: 3, scope: !702, inlinedAt: !721)
!723 = !DILocation(line: 838, column: 67, scope: !702, inlinedAt: !721)
!724 = !DILocation(line: 849, column: 36, scope: !702, inlinedAt: !721)
!725 = !DILocation(line: 851, column: 3, scope: !702, inlinedAt: !721)
!726 = !DILocalVariable(name: "__s1", arg: 1, scope: !727, file: !728, line: 1359, type: !43)
!727 = distinct !DISubprogram(name: "streq", scope: !728, file: !728, line: 1359, type: !729, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !731)
!728 = !DIFile(filename: "./lib/string.h", directory: "/src")
!729 = !DISubroutineType(types: !730)
!730 = !{!60, !43, !43}
!731 = !{!726, !732}
!732 = !DILocalVariable(name: "__s2", arg: 2, scope: !727, file: !728, line: 1359, type: !43)
!733 = !DILocation(line: 0, scope: !727, inlinedAt: !734)
!734 = distinct !DILocation(line: 851, column: 33, scope: !702, inlinedAt: !721)
!735 = !DILocation(line: 1361, column: 11, scope: !727, inlinedAt: !734)
!736 = !DILocation(line: 1361, column: 10, scope: !727, inlinedAt: !734)
!737 = !DILocation(line: 852, column: 13, scope: !702, inlinedAt: !721)
!738 = !DILocation(line: 851, column: 20, scope: !702, inlinedAt: !721)
!739 = !{!740, !691, i64 0}
!740 = !{!"infomap", !691, i64 0, !691, i64 8}
!741 = !DILocation(line: 851, column: 10, scope: !702, inlinedAt: !721)
!742 = !DILocation(line: 851, column: 28, scope: !702, inlinedAt: !721)
!743 = distinct !{!743, !725, !737, !744}
!744 = !{!"llvm.loop.mustprogress"}
!745 = !DILocation(line: 854, column: 17, scope: !746, inlinedAt: !721)
!746 = distinct !DILexicalBlock(scope: !702, file: !50, line: 854, column: 7)
!747 = !{!740, !691, i64 8}
!748 = !DILocation(line: 854, column: 7, scope: !746, inlinedAt: !721)
!749 = !DILocation(line: 854, column: 7, scope: !702, inlinedAt: !721)
!750 = !DILocation(line: 857, column: 3, scope: !702, inlinedAt: !721)
!751 = !DILocation(line: 861, column: 29, scope: !702, inlinedAt: !721)
!752 = !DILocation(line: 862, column: 7, scope: !753, inlinedAt: !721)
!753 = distinct !DILexicalBlock(scope: !702, file: !50, line: 862, column: 7)
!754 = !DILocation(line: 862, column: 19, scope: !753, inlinedAt: !721)
!755 = !DILocation(line: 862, column: 22, scope: !753, inlinedAt: !721)
!756 = !DILocation(line: 862, column: 7, scope: !702, inlinedAt: !721)
!757 = !DILocation(line: 868, column: 7, scope: !758, inlinedAt: !721)
!758 = distinct !DILexicalBlock(scope: !753, file: !50, line: 863, column: 5)
!759 = !DILocation(line: 870, column: 5, scope: !758, inlinedAt: !721)
!760 = !DILocation(line: 0, scope: !727, inlinedAt: !761)
!761 = distinct !DILocation(line: 874, column: 29, scope: !702, inlinedAt: !721)
!762 = !DILocation(line: 875, column: 3, scope: !702, inlinedAt: !721)
!763 = !DILocation(line: 877, column: 3, scope: !702, inlinedAt: !721)
!764 = !DILocation(line: 879, column: 1, scope: !702, inlinedAt: !721)
!765 = !DILocation(line: 79, column: 3, scope: !679)
!766 = !DISubprogram(name: "dcgettext", scope: !767, file: !767, line: 51, type: !768, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!767 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!768 = !DISubroutineType(types: !769)
!769 = !{!35, !43, !43, !38}
!770 = !{}
!771 = !DISubprogram(name: "fputs_unlocked", scope: !170, file: !170, line: 691, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!772 = !DISubroutineType(types: !773)
!773 = !{!38, !774, !775}
!774 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!775 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!776 = !DILocation(line: 0, scope: !49)
!777 = !DILocation(line: 581, column: 7, scope: !58)
!778 = !{!779, !779, i64 0}
!779 = !{!"int", !692, i64 0}
!780 = !DILocation(line: 581, column: 19, scope: !58)
!781 = !DILocation(line: 581, column: 7, scope: !49)
!782 = !DILocation(line: 585, column: 26, scope: !57)
!783 = !DILocation(line: 0, scope: !57)
!784 = !DILocation(line: 586, column: 23, scope: !57)
!785 = !DILocation(line: 586, column: 28, scope: !57)
!786 = !DILocation(line: 586, column: 32, scope: !57)
!787 = !{!692, !692, i64 0}
!788 = !DILocation(line: 586, column: 38, scope: !57)
!789 = !DILocation(line: 0, scope: !727, inlinedAt: !790)
!790 = distinct !DILocation(line: 586, column: 41, scope: !57)
!791 = !DILocation(line: 1361, column: 11, scope: !727, inlinedAt: !790)
!792 = !DILocation(line: 1361, column: 10, scope: !727, inlinedAt: !790)
!793 = !DILocation(line: 586, column: 19, scope: !57)
!794 = !DILocation(line: 587, column: 5, scope: !57)
!795 = !DILocation(line: 588, column: 7, scope: !796)
!796 = distinct !DILexicalBlock(scope: !49, file: !50, line: 588, column: 7)
!797 = !DILocation(line: 588, column: 7, scope: !49)
!798 = !DILocation(line: 590, column: 7, scope: !799)
!799 = distinct !DILexicalBlock(scope: !796, file: !50, line: 589, column: 5)
!800 = !DILocation(line: 591, column: 7, scope: !799)
!801 = !DILocation(line: 595, column: 37, scope: !49)
!802 = !DILocation(line: 595, column: 35, scope: !49)
!803 = !DILocation(line: 596, column: 29, scope: !49)
!804 = !DILocation(line: 597, column: 8, scope: !66)
!805 = !DILocation(line: 597, column: 7, scope: !49)
!806 = !DILocation(line: 604, column: 24, scope: !65)
!807 = !DILocation(line: 604, column: 12, scope: !66)
!808 = !DILocation(line: 0, scope: !64)
!809 = !DILocation(line: 610, column: 16, scope: !64)
!810 = !DILocation(line: 610, column: 7, scope: !64)
!811 = !DILocation(line: 611, column: 21, scope: !64)
!812 = !{!813, !813, i64 0}
!813 = !{!"short", !692, i64 0}
!814 = !DILocation(line: 611, column: 19, scope: !64)
!815 = !DILocation(line: 611, column: 16, scope: !64)
!816 = !DILocation(line: 610, column: 30, scope: !64)
!817 = distinct !{!817, !810, !811, !744}
!818 = !DILocation(line: 612, column: 18, scope: !819)
!819 = distinct !DILexicalBlock(scope: !64, file: !50, line: 612, column: 11)
!820 = !DILocation(line: 612, column: 11, scope: !64)
!821 = !DILocation(line: 620, column: 23, scope: !49)
!822 = !DILocation(line: 625, column: 39, scope: !49)
!823 = !DILocation(line: 626, column: 3, scope: !49)
!824 = !DILocation(line: 626, column: 10, scope: !49)
!825 = !DILocation(line: 626, column: 21, scope: !49)
!826 = !DILocation(line: 628, column: 44, scope: !827)
!827 = distinct !DILexicalBlock(scope: !828, file: !50, line: 628, column: 11)
!828 = distinct !DILexicalBlock(scope: !49, file: !50, line: 627, column: 5)
!829 = !DILocation(line: 628, column: 32, scope: !827)
!830 = !DILocation(line: 628, column: 49, scope: !827)
!831 = !DILocation(line: 628, column: 11, scope: !828)
!832 = !DILocation(line: 630, column: 11, scope: !833)
!833 = distinct !DILexicalBlock(scope: !828, file: !50, line: 630, column: 11)
!834 = !DILocation(line: 630, column: 11, scope: !828)
!835 = !DILocation(line: 632, column: 26, scope: !836)
!836 = distinct !DILexicalBlock(scope: !837, file: !50, line: 632, column: 15)
!837 = distinct !DILexicalBlock(scope: !833, file: !50, line: 631, column: 9)
!838 = !DILocation(line: 632, column: 34, scope: !836)
!839 = !DILocation(line: 632, column: 37, scope: !836)
!840 = !DILocation(line: 632, column: 15, scope: !837)
!841 = !DILocation(line: 636, column: 29, scope: !842)
!842 = distinct !DILexicalBlock(scope: !837, file: !50, line: 636, column: 15)
!843 = !DILocation(line: 640, column: 16, scope: !828)
!844 = distinct !{!844, !823, !845, !744}
!845 = !DILocation(line: 641, column: 5, scope: !49)
!846 = !DILocation(line: 644, column: 3, scope: !49)
!847 = !DILocation(line: 0, scope: !727, inlinedAt: !848)
!848 = distinct !DILocation(line: 648, column: 31, scope: !49)
!849 = !DILocation(line: 0, scope: !727, inlinedAt: !850)
!850 = distinct !DILocation(line: 649, column: 31, scope: !49)
!851 = !DILocation(line: 0, scope: !727, inlinedAt: !852)
!852 = distinct !DILocation(line: 650, column: 31, scope: !49)
!853 = !DILocation(line: 0, scope: !727, inlinedAt: !854)
!854 = distinct !DILocation(line: 651, column: 31, scope: !49)
!855 = !DILocation(line: 0, scope: !727, inlinedAt: !856)
!856 = distinct !DILocation(line: 652, column: 31, scope: !49)
!857 = !DILocation(line: 0, scope: !727, inlinedAt: !858)
!858 = distinct !DILocation(line: 653, column: 31, scope: !49)
!859 = !DILocation(line: 0, scope: !727, inlinedAt: !860)
!860 = distinct !DILocation(line: 654, column: 31, scope: !49)
!861 = !DILocation(line: 0, scope: !727, inlinedAt: !862)
!862 = distinct !DILocation(line: 655, column: 31, scope: !49)
!863 = !DILocation(line: 0, scope: !727, inlinedAt: !864)
!864 = distinct !DILocation(line: 656, column: 31, scope: !49)
!865 = !DILocation(line: 0, scope: !727, inlinedAt: !866)
!866 = distinct !DILocation(line: 657, column: 31, scope: !49)
!867 = !DILocation(line: 663, column: 7, scope: !868)
!868 = distinct !DILexicalBlock(scope: !49, file: !50, line: 663, column: 7)
!869 = !DILocation(line: 664, column: 7, scope: !868)
!870 = !DILocation(line: 664, column: 10, scope: !868)
!871 = !DILocation(line: 663, column: 7, scope: !49)
!872 = !DILocation(line: 669, column: 7, scope: !873)
!873 = distinct !DILexicalBlock(scope: !868, file: !50, line: 665, column: 5)
!874 = !DILocation(line: 671, column: 5, scope: !873)
!875 = !DILocation(line: 676, column: 7, scope: !876)
!876 = distinct !DILexicalBlock(scope: !868, file: !50, line: 673, column: 5)
!877 = !DILocation(line: 679, column: 3, scope: !49)
!878 = !DILocation(line: 683, column: 3, scope: !49)
!879 = !DILocation(line: 686, column: 3, scope: !49)
!880 = !DILocation(line: 688, column: 3, scope: !49)
!881 = !DILocation(line: 691, column: 3, scope: !49)
!882 = !DILocation(line: 695, column: 3, scope: !49)
!883 = !DILocation(line: 696, column: 1, scope: !49)
!884 = !DISubprogram(name: "setlocale", scope: !885, file: !885, line: 122, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!885 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!886 = !DISubroutineType(types: !887)
!887 = !{!35, !38, !43}
!888 = !DISubprogram(name: "getenv", scope: !889, file: !889, line: 641, type: !890, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!889 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!890 = !DISubroutineType(types: !891)
!891 = !{!35, !43}
!892 = !DISubprogram(name: "fwrite_unlocked", scope: !170, file: !170, line: 704, type: !893, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!893 = !DISubroutineType(types: !894)
!894 = !{!40, !895, !40, !40, !775}
!895 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!898 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 83, type: !899, scopeLine: 84, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !902)
!899 = !DISubroutineType(types: !900)
!900 = !{!38, !38, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!902 = !{!903, !904, !905, !906, !907, !909}
!903 = !DILocalVariable(name: "argc", arg: 1, scope: !898, file: !3, line: 83, type: !38)
!904 = !DILocalVariable(name: "argv", arg: 2, scope: !898, file: !3, line: 83, type: !901)
!905 = !DILocalVariable(name: "ignore", scope: !898, file: !3, line: 85, type: !42)
!906 = !DILocalVariable(name: "mode", scope: !898, file: !3, line: 94, type: !5)
!907 = !DILocalVariable(name: "c", scope: !908, file: !3, line: 98, type: !38)
!908 = distinct !DILexicalBlock(scope: !898, file: !3, line: 97, column: 5)
!909 = !DILocalVariable(name: "nproc", scope: !898, file: !3, line: 127, type: !42)
!910 = !DILocation(line: 0, scope: !898)
!911 = !DILocation(line: 87, column: 21, scope: !898)
!912 = !DILocation(line: 87, column: 3, scope: !898)
!913 = !DILocation(line: 88, column: 3, scope: !898)
!914 = !DILocation(line: 89, column: 3, scope: !898)
!915 = !DILocation(line: 90, column: 3, scope: !898)
!916 = !DILocation(line: 92, column: 3, scope: !898)
!917 = !DILocation(line: 96, column: 3, scope: !898)
!918 = !DILocation(line: 99, column: 11, scope: !908)
!919 = !DILocation(line: 94, column: 20, scope: !898)
!920 = !DILocation(line: 98, column: 15, scope: !908)
!921 = !DILocation(line: 0, scope: !908)
!922 = !DILocation(line: 103, column: 9, scope: !923)
!923 = distinct !DILexicalBlock(scope: !908, file: !3, line: 102, column: 9)
!924 = !DILocation(line: 105, column: 9, scope: !923)
!925 = !DILocation(line: 112, column: 32, scope: !923)
!926 = !DILocation(line: 113, column: 32, scope: !923)
!927 = !DILocation(line: 112, column: 20, scope: !923)
!928 = !DILocation(line: 114, column: 11, scope: !923)
!929 = !DILocation(line: 117, column: 11, scope: !923)
!930 = !DILocation(line: 121, column: 15, scope: !931)
!931 = distinct !DILexicalBlock(scope: !898, file: !3, line: 121, column: 7)
!932 = !DILocation(line: 121, column: 12, scope: !931)
!933 = !DILocation(line: 121, column: 7, scope: !898)
!934 = !DILocation(line: 123, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !931, file: !3, line: 122, column: 5)
!936 = !DILocation(line: 124, column: 7, scope: !935)
!937 = !DILocation(line: 127, column: 25, scope: !898)
!938 = !DILocation(line: 129, column: 14, scope: !939)
!939 = distinct !DILexicalBlock(scope: !898, file: !3, line: 129, column: 7)
!940 = !DILocation(line: 129, column: 7, scope: !898)
!941 = !DILocation(line: 134, column: 3, scope: !898)
!942 = !DILocation(line: 137, column: 1, scope: !898)
!943 = !DISubprogram(name: "bindtextdomain", scope: !767, file: !767, line: 86, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!944 = !DISubroutineType(types: !945)
!945 = !{!35, !43, !43}
!946 = !DISubprogram(name: "textdomain", scope: !767, file: !767, line: 82, type: !890, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!947 = !DISubprogram(name: "atexit", scope: !889, file: !889, line: 602, type: !948, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!948 = !DISubroutineType(types: !949)
!949 = !{!38, !196}
!950 = !DISubprogram(name: "getopt_long", scope: !137, file: !137, line: 66, type: !951, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!951 = !DISubroutineType(types: !952)
!952 = !{!38, !38, !953, !43, !955, !142}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!956 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !154, file: !154, line: 50, type: !703, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !153, retainedNodes: !957)
!957 = !{!958}
!958 = !DILocalVariable(name: "file", arg: 1, scope: !956, file: !154, line: 50, type: !43)
!959 = !DILocation(line: 0, scope: !956)
!960 = !DILocation(line: 52, column: 13, scope: !956)
!961 = !DILocation(line: 53, column: 1, scope: !956)
!962 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !154, file: !154, line: 87, type: !963, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !153, retainedNodes: !965)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !60}
!965 = !{!966}
!966 = !DILocalVariable(name: "ignore", arg: 1, scope: !962, file: !154, line: 87, type: !60)
!967 = !DILocation(line: 0, scope: !962)
!968 = !DILocation(line: 89, column: 16, scope: !962)
!969 = !{!970, !970, i64 0}
!970 = !{!"_Bool", !692, i64 0}
!971 = !DILocation(line: 90, column: 1, scope: !962)
!972 = distinct !DISubprogram(name: "close_stdout", scope: !154, file: !154, line: 116, type: !197, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !153, retainedNodes: !973)
!973 = !{!974}
!974 = !DILocalVariable(name: "write_error", scope: !975, file: !154, line: 121, type: !43)
!975 = distinct !DILexicalBlock(scope: !976, file: !154, line: 120, column: 5)
!976 = distinct !DILexicalBlock(scope: !972, file: !154, line: 118, column: 7)
!977 = !DILocation(line: 118, column: 21, scope: !976)
!978 = !DILocation(line: 118, column: 7, scope: !976)
!979 = !DILocation(line: 118, column: 29, scope: !976)
!980 = !DILocation(line: 119, column: 7, scope: !976)
!981 = !DILocation(line: 119, column: 12, scope: !976)
!982 = !{i8 0, i8 2}
!983 = !DILocation(line: 119, column: 25, scope: !976)
!984 = !DILocation(line: 119, column: 28, scope: !976)
!985 = !DILocation(line: 119, column: 34, scope: !976)
!986 = !DILocation(line: 118, column: 7, scope: !972)
!987 = !DILocation(line: 121, column: 33, scope: !975)
!988 = !DILocation(line: 0, scope: !975)
!989 = !DILocation(line: 122, column: 11, scope: !990)
!990 = distinct !DILexicalBlock(scope: !975, file: !154, line: 122, column: 11)
!991 = !DILocation(line: 0, scope: !990)
!992 = !DILocation(line: 122, column: 11, scope: !975)
!993 = !DILocation(line: 123, column: 9, scope: !990)
!994 = !DILocation(line: 126, column: 9, scope: !990)
!995 = !DILocation(line: 128, column: 14, scope: !975)
!996 = !DILocation(line: 128, column: 7, scope: !975)
!997 = !DILocation(line: 133, column: 42, scope: !998)
!998 = distinct !DILexicalBlock(scope: !972, file: !154, line: 133, column: 7)
!999 = !DILocation(line: 133, column: 28, scope: !998)
!1000 = !DILocation(line: 133, column: 50, scope: !998)
!1001 = !DILocation(line: 133, column: 7, scope: !972)
!1002 = !DILocation(line: 134, column: 12, scope: !998)
!1003 = !DILocation(line: 134, column: 5, scope: !998)
!1004 = !DILocation(line: 135, column: 1, scope: !972)
!1005 = distinct !DISubprogram(name: "verror", scope: !161, file: !161, line: 251, type: !1006, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1008)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !38, !38, !43, !169}
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DILocalVariable(name: "status", arg: 1, scope: !1005, file: !161, line: 251, type: !38)
!1010 = !DILocalVariable(name: "errnum", arg: 2, scope: !1005, file: !161, line: 251, type: !38)
!1011 = !DILocalVariable(name: "message", arg: 3, scope: !1005, file: !161, line: 251, type: !43)
!1012 = !DILocalVariable(name: "args", arg: 4, scope: !1005, file: !161, line: 251, type: !169)
!1013 = !DILocation(line: 0, scope: !1005)
!1014 = !DILocation(line: 251, column: 1, scope: !1005)
!1015 = !DILocation(line: 261, column: 3, scope: !1005)
!1016 = !DILocation(line: 265, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1005, file: !161, line: 265, column: 7)
!1018 = !DILocation(line: 265, column: 7, scope: !1005)
!1019 = !DILocation(line: 266, column: 5, scope: !1017)
!1020 = !DILocation(line: 272, column: 7, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !161, line: 268, column: 5)
!1022 = !DILocation(line: 276, column: 3, scope: !1005)
!1023 = !{i64 0, i64 8, !690, i64 8, i64 8, !690, i64 16, i64 8, !690, i64 24, i64 4, !778, i64 28, i64 4, !778}
!1024 = !DILocation(line: 282, column: 1, scope: !1005)
!1025 = distinct !DISubprogram(name: "flush_stdout", scope: !161, file: !161, line: 163, type: !197, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1026)
!1026 = !{!1027}
!1027 = !DILocalVariable(name: "stdout_fd", scope: !1025, file: !161, line: 166, type: !38)
!1028 = !DILocation(line: 0, scope: !1025)
!1029 = !DILocalVariable(name: "fd", arg: 1, scope: !1030, file: !161, line: 145, type: !38)
!1030 = distinct !DISubprogram(name: "is_open", scope: !161, file: !161, line: 145, type: !1031, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!38, !38}
!1033 = !{!1029}
!1034 = !DILocation(line: 0, scope: !1030, inlinedAt: !1035)
!1035 = distinct !DILocation(line: 182, column: 25, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1025, file: !161, line: 182, column: 7)
!1037 = !DILocation(line: 157, column: 15, scope: !1030, inlinedAt: !1035)
!1038 = !DILocation(line: 182, column: 25, scope: !1036)
!1039 = !DILocation(line: 182, column: 7, scope: !1025)
!1040 = !DILocation(line: 184, column: 5, scope: !1036)
!1041 = !DILocation(line: 185, column: 1, scope: !1025)
!1042 = distinct !DISubprogram(name: "error_tail", scope: !161, file: !161, line: 219, type: !1006, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1043)
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DILocalVariable(name: "status", arg: 1, scope: !1042, file: !161, line: 219, type: !38)
!1045 = !DILocalVariable(name: "errnum", arg: 2, scope: !1042, file: !161, line: 219, type: !38)
!1046 = !DILocalVariable(name: "message", arg: 3, scope: !1042, file: !161, line: 219, type: !43)
!1047 = !DILocalVariable(name: "args", arg: 4, scope: !1042, file: !161, line: 219, type: !169)
!1048 = !DILocation(line: 0, scope: !1042)
!1049 = !DILocation(line: 219, column: 1, scope: !1042)
!1050 = !DILocation(line: 229, column: 13, scope: !1042)
!1051 = !DILocation(line: 229, column: 3, scope: !1042)
!1052 = !DILocalVariable(name: "__stream", arg: 1, scope: !1053, file: !1054, line: 132, type: !1057)
!1053 = distinct !DISubprogram(name: "vfprintf", scope: !1054, file: !1054, line: 132, type: !1055, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1092)
!1054 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!38, !1057, !774, !171}
!1057 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1060, file: !77, line: 51, baseType: !38, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1060, file: !77, line: 54, baseType: !35, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1060, file: !77, line: 55, baseType: !35, size: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1060, file: !77, line: 56, baseType: !35, size: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1060, file: !77, line: 57, baseType: !35, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1060, file: !77, line: 58, baseType: !35, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1060, file: !77, line: 59, baseType: !35, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1060, file: !77, line: 60, baseType: !35, size: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1060, file: !77, line: 61, baseType: !35, size: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1060, file: !77, line: 64, baseType: !35, size: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1060, file: !77, line: 65, baseType: !35, size: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1060, file: !77, line: 66, baseType: !35, size: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1060, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1060, file: !77, line: 70, baseType: !1076, size: 64, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1060, file: !77, line: 72, baseType: !38, size: 32, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1060, file: !77, line: 73, baseType: !38, size: 32, offset: 928)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1060, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1060, file: !77, line: 77, baseType: !39, size: 16, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1060, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1060, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1060, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1060, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1060, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1060, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1060, file: !77, line: 93, baseType: !1076, size: 64, offset: 1344)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1060, file: !77, line: 94, baseType: !37, size: 64, offset: 1408)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1060, file: !77, line: 95, baseType: !40, size: 64, offset: 1472)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1060, file: !77, line: 96, baseType: !38, size: 32, offset: 1536)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1060, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!1092 = !{!1052, !1093, !1094}
!1093 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1053, file: !1054, line: 133, type: !774)
!1094 = !DILocalVariable(name: "__ap", arg: 3, scope: !1053, file: !1054, line: 133, type: !171)
!1095 = !DILocation(line: 0, scope: !1053, inlinedAt: !1096)
!1096 = distinct !DILocation(line: 229, column: 3, scope: !1042)
!1097 = !DILocation(line: 135, column: 10, scope: !1053, inlinedAt: !1096)
!1098 = !{!1099, !1101}
!1099 = distinct !{!1099, !1100, !"vfprintf.inline: argument 0"}
!1100 = distinct !{!1100, !"vfprintf.inline"}
!1101 = distinct !{!1101, !1100, !"vfprintf.inline: argument 1"}
!1102 = !DILocation(line: 232, column: 3, scope: !1042)
!1103 = !DILocation(line: 233, column: 7, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1042, file: !161, line: 233, column: 7)
!1105 = !DILocation(line: 233, column: 7, scope: !1042)
!1106 = !DILocalVariable(name: "errnum", arg: 1, scope: !1107, file: !161, line: 188, type: !38)
!1107 = distinct !DISubprogram(name: "print_errno_message", scope: !161, file: !161, line: 188, type: !680, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1108)
!1108 = !{!1106, !1109, !1110}
!1109 = !DILocalVariable(name: "s", scope: !1107, file: !161, line: 190, type: !43)
!1110 = !DILocalVariable(name: "errbuf", scope: !1107, file: !161, line: 193, type: !1111)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8192, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 1024)
!1114 = !DILocation(line: 0, scope: !1107, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 234, column: 5, scope: !1104)
!1116 = !DILocation(line: 193, column: 3, scope: !1107, inlinedAt: !1115)
!1117 = !DILocation(line: 193, column: 8, scope: !1107, inlinedAt: !1115)
!1118 = !DILocation(line: 195, column: 7, scope: !1107, inlinedAt: !1115)
!1119 = !DILocation(line: 207, column: 9, scope: !1120, inlinedAt: !1115)
!1120 = distinct !DILexicalBlock(scope: !1107, file: !161, line: 207, column: 7)
!1121 = !DILocation(line: 207, column: 7, scope: !1107, inlinedAt: !1115)
!1122 = !DILocation(line: 208, column: 9, scope: !1120, inlinedAt: !1115)
!1123 = !DILocation(line: 208, column: 5, scope: !1120, inlinedAt: !1115)
!1124 = !DILocation(line: 214, column: 3, scope: !1107, inlinedAt: !1115)
!1125 = !DILocation(line: 216, column: 1, scope: !1107, inlinedAt: !1115)
!1126 = !DILocation(line: 234, column: 5, scope: !1104)
!1127 = !DILocation(line: 238, column: 3, scope: !1042)
!1128 = !DILocalVariable(name: "__c", arg: 1, scope: !1129, file: !1130, line: 101, type: !38)
!1129 = distinct !DISubprogram(name: "putc_unlocked", scope: !1130, file: !1130, line: 101, type: !1131, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1133)
!1130 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!38, !38, !1058}
!1133 = !{!1128, !1134}
!1134 = !DILocalVariable(name: "__stream", arg: 2, scope: !1129, file: !1130, line: 101, type: !1058)
!1135 = !DILocation(line: 0, scope: !1129, inlinedAt: !1136)
!1136 = distinct !DILocation(line: 238, column: 3, scope: !1042)
!1137 = !DILocation(line: 103, column: 10, scope: !1129, inlinedAt: !1136)
!1138 = !{!1139, !691, i64 40}
!1139 = !{!"_IO_FILE", !779, i64 0, !691, i64 8, !691, i64 16, !691, i64 24, !691, i64 32, !691, i64 40, !691, i64 48, !691, i64 56, !691, i64 64, !691, i64 72, !691, i64 80, !691, i64 88, !691, i64 96, !691, i64 104, !779, i64 112, !779, i64 116, !1140, i64 120, !813, i64 128, !692, i64 130, !692, i64 131, !691, i64 136, !1140, i64 144, !691, i64 152, !691, i64 160, !691, i64 168, !691, i64 176, !1140, i64 184, !779, i64 192, !692, i64 196}
!1140 = !{!"long", !692, i64 0}
!1141 = !{!1139, !691, i64 48}
!1142 = !{!"branch_weights", i32 2000, i32 1}
!1143 = !DILocation(line: 240, column: 3, scope: !1042)
!1144 = !DILocation(line: 241, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1042, file: !161, line: 241, column: 7)
!1146 = !DILocation(line: 241, column: 7, scope: !1042)
!1147 = !DILocation(line: 242, column: 5, scope: !1145)
!1148 = !DILocation(line: 243, column: 1, scope: !1042)
!1149 = !DISubprogram(name: "strerror_r", scope: !1150, file: !1150, line: 444, type: !1151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!1150 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!35, !38, !35, !40}
!1153 = !DISubprogram(name: "fflush_unlocked", scope: !170, file: !170, line: 239, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!38, !1058}
!1156 = !DISubprogram(name: "fcntl", scope: !1157, file: !1157, line: 149, type: !1158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !770)
!1157 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!38, !38, !38, null}
!1160 = distinct !DISubprogram(name: "error", scope: !161, file: !161, line: 285, type: !1161, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1163)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{null, !38, !38, !43, null}
!1163 = !{!1164, !1165, !1166, !1167}
!1164 = !DILocalVariable(name: "status", arg: 1, scope: !1160, file: !161, line: 285, type: !38)
!1165 = !DILocalVariable(name: "errnum", arg: 2, scope: !1160, file: !161, line: 285, type: !38)
!1166 = !DILocalVariable(name: "message", arg: 3, scope: !1160, file: !161, line: 285, type: !43)
!1167 = !DILocalVariable(name: "ap", scope: !1160, file: !161, line: 287, type: !169)
!1168 = !DILocation(line: 0, scope: !1160)
!1169 = !DILocation(line: 287, column: 3, scope: !1160)
!1170 = !DILocation(line: 287, column: 11, scope: !1160)
!1171 = !DILocation(line: 288, column: 3, scope: !1160)
!1172 = !DILocation(line: 289, column: 3, scope: !1160)
!1173 = !DILocation(line: 290, column: 3, scope: !1160)
!1174 = !DILocation(line: 291, column: 1, scope: !1160)
!1175 = !DILocation(line: 0, scope: !166)
!1176 = !DILocation(line: 298, column: 1, scope: !166)
!1177 = !DILocation(line: 302, column: 7, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !166, file: !161, line: 302, column: 7)
!1179 = !DILocation(line: 302, column: 7, scope: !166)
!1180 = !DILocation(line: 307, column: 11, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !161, line: 307, column: 11)
!1182 = distinct !DILexicalBlock(scope: !1178, file: !161, line: 303, column: 5)
!1183 = !DILocation(line: 307, column: 27, scope: !1181)
!1184 = !DILocation(line: 308, column: 11, scope: !1181)
!1185 = !DILocation(line: 308, column: 28, scope: !1181)
!1186 = !DILocation(line: 308, column: 25, scope: !1181)
!1187 = !DILocation(line: 309, column: 15, scope: !1181)
!1188 = !DILocation(line: 309, column: 33, scope: !1181)
!1189 = !DILocation(line: 310, column: 19, scope: !1181)
!1190 = !DILocation(line: 311, column: 22, scope: !1181)
!1191 = !DILocation(line: 311, column: 56, scope: !1181)
!1192 = !DILocation(line: 307, column: 11, scope: !1182)
!1193 = !DILocation(line: 316, column: 21, scope: !1182)
!1194 = !DILocation(line: 317, column: 23, scope: !1182)
!1195 = !DILocation(line: 318, column: 5, scope: !1182)
!1196 = !DILocation(line: 327, column: 3, scope: !166)
!1197 = !DILocation(line: 331, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !166, file: !161, line: 331, column: 7)
!1199 = !DILocation(line: 331, column: 7, scope: !166)
!1200 = !DILocation(line: 332, column: 5, scope: !1198)
!1201 = !DILocation(line: 338, column: 7, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !161, line: 334, column: 5)
!1203 = !DILocation(line: 346, column: 3, scope: !166)
!1204 = !DILocation(line: 350, column: 3, scope: !166)
!1205 = !DILocation(line: 356, column: 1, scope: !166)
!1206 = distinct !DISubprogram(name: "error_at_line", scope: !161, file: !161, line: 359, type: !1207, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !1209)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{null, !38, !38, !43, !7, !43, null}
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215}
!1210 = !DILocalVariable(name: "status", arg: 1, scope: !1206, file: !161, line: 359, type: !38)
!1211 = !DILocalVariable(name: "errnum", arg: 2, scope: !1206, file: !161, line: 359, type: !38)
!1212 = !DILocalVariable(name: "file_name", arg: 3, scope: !1206, file: !161, line: 359, type: !43)
!1213 = !DILocalVariable(name: "line_number", arg: 4, scope: !1206, file: !161, line: 360, type: !7)
!1214 = !DILocalVariable(name: "message", arg: 5, scope: !1206, file: !161, line: 360, type: !43)
!1215 = !DILocalVariable(name: "ap", scope: !1206, file: !161, line: 362, type: !169)
!1216 = !DILocation(line: 0, scope: !1206)
!1217 = !DILocation(line: 362, column: 3, scope: !1206)
!1218 = !DILocation(line: 362, column: 11, scope: !1206)
!1219 = !DILocation(line: 363, column: 3, scope: !1206)
!1220 = !DILocation(line: 364, column: 3, scope: !1206)
!1221 = !DILocation(line: 366, column: 3, scope: !1206)
!1222 = !DILocation(line: 367, column: 1, scope: !1206)
!1223 = distinct !DISubprogram(name: "getprogname", scope: !361, file: !361, line: 54, type: !1224, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !770)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!43}
!1226 = !DILocation(line: 58, column: 10, scope: !1223)
!1227 = !DILocation(line: 58, column: 3, scope: !1223)
!1228 = distinct !DISubprogram(name: "num_processors", scope: !363, file: !363, line: 544, type: !1229, scopeLine: 545, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !362, retainedNodes: !1231)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!42, !5}
