; ModuleID = 'src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.tspec = type { i32, i32, void (i64, i64, i8*, i8*, i32, i64)*, [18 x i8], i8, i32, i64 }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }

!53 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!54 = !DIEnumerator(name: "_ISspace", value: 8192)
!55 = !DIEnumerator(name: "_ISprint", value: 16384)
!56 = !DIEnumerator(name: "_ISgraph", value: 32768)
!57 = !DIEnumerator(name: "_ISblank", value: 1)
!58 = !DIEnumerator(name: "_IScntrl", value: 2)
!59 = !DIEnumerator(name: "_ISpunct", value: 4)
!60 = !DIEnumerator(name: "_ISalnum", value: 8)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "endian_type", file: !3, line: 317, baseType: !14, size: 32, elements: !62)
!62 = !{!63, !64}
!63 = !DIEnumerator(name: "endian_little", value: 0)
!64 = !DIEnumerator(name: "endian_big", value: 1)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !66, line: 42, baseType: !14, size: 32, elements: !67)
!66 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!68 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!69 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!70 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!71 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!72 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!73 = !DIEnumerator(name: "c_quoting_style", value: 5)
!74 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!75 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!76 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!77 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!78 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!79 = !{!80, !81, !82, !8, !84, !6, !88, !89, !86, !92, !93, !14, !100, !91, !101}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 46, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!91 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_function_type", file: !3, line: 116, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !97, !97, !82, !86, !6, !97}
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !98, line: 130, baseType: !99)
!98 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !90, line: 35, baseType: !100)
!100 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!102 = !{!0, !103, !105, !107, !109, !111, !117, !119, !134, !136, !138, !140, !195, !197, !199, !230, !235, !249, !254, !256, !258, !260, !266, !271, !277, !279, !285, !290, !292, !295, !297, !301, !326}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "string_min", scope: !10, file: !3, line: 193, type: !97, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !10, file: !3, line: 196, type: !81, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "traditional", scope: !10, file: !3, line: 201, type: !81, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !10, file: !3, line: 204, type: !81, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !10, file: !3, line: 208, type: !113, isLocal: true, isDefinition: true)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !114, line: 101, baseType: !115)
!114 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !116, line: 72, baseType: !100)
!116 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !10, file: !3, line: 216, type: !113, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "spec", scope: !10, file: !3, line: 228, type: !121, isLocal: true, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !3, line: 122, size: 384, elements: !123)
!123 = !{!124, !125, !126, !127, !131, !132, !133}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !122, file: !3, line: 124, baseType: !21, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !122, file: !3, line: 125, baseType: !32, size: 32, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !122, file: !3, line: 126, baseType: !93, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !122, file: !3, line: 127, baseType: !128, size: 144, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 144, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 18)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !122, file: !3, line: 128, baseType: !81, size: 8, offset: 272)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !122, file: !3, line: 129, baseType: !6, size: 32, offset: 288)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !122, file: !3, line: 130, baseType: !97, size: 64, offset: 320)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "n_specs", scope: !10, file: !3, line: 231, type: !97, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !10, file: !3, line: 240, type: !97, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "file_list", scope: !10, file: !3, line: 247, type: !84, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "in_stream", scope: !10, file: !3, line: 254, type: !142, isLocal: true, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 7, baseType: !145)
!144 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 49, size: 1728, elements: !147)
!146 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !163, !165, !166, !167, !169, !170, !172, !176, !179, !181, !184, !187, !188, !189, !190, !191}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 51, baseType: !6, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 54, baseType: !8, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 55, baseType: !8, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 56, baseType: !8, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 57, baseType: !8, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 58, baseType: !8, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 59, baseType: !8, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 60, baseType: !8, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 61, baseType: !8, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 64, baseType: !8, size: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 65, baseType: !8, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 66, baseType: !8, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 68, baseType: !161, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 36, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 70, baseType: !164, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 72, baseType: !6, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 73, baseType: !6, size: 32, offset: 928)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 74, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 152, baseType: !100)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 77, baseType: !88, size: 16, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 78, baseType: !171, size: 8, offset: 1040)
!171 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 79, baseType: !173, size: 8, offset: 1048)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 1)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 81, baseType: !177, size: 64, offset: 1088)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 43, baseType: null)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 89, baseType: !180, size: 64, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 153, baseType: !100)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !145, file: !146, line: 91, baseType: !182, size: 64, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !146, line: 37, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !145, file: !146, line: 92, baseType: !185, size: 64, offset: 1280)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !146, line: 38, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !145, file: !146, line: 93, baseType: !164, size: 64, offset: 1344)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !145, file: !146, line: 94, baseType: !80, size: 64, offset: 1408)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 95, baseType: !89, size: 64, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 96, baseType: !6, size: 32, offset: 1536)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 98, baseType: !192, size: 160, offset: 1568)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 20)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !10, file: !3, line: 257, type: !81, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "input_swap", scope: !10, file: !3, line: 305, type: !81, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !201, file: !202, line: 575, type: !6, isLocal: true, isDefinition: true)
!201 = distinct !DISubprogram(name: "oputs_", scope: !202, file: !202, line: 573, type: !203, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !205)
!202 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!203 = !DISubroutineType(types: !204)
!204 = !{null, !86, !86}
!205 = !{!206, !207, !208, !211, !212, !213, !214, !218, !219, !220, !221, !223, !224, !225, !226, !228, !229}
!206 = !DILocalVariable(name: "program", arg: 1, scope: !201, file: !202, line: 573, type: !86)
!207 = !DILocalVariable(name: "option", arg: 2, scope: !201, file: !202, line: 573, type: !86)
!208 = !DILocalVariable(name: "term", scope: !209, file: !202, line: 585, type: !86)
!209 = distinct !DILexicalBlock(scope: !210, file: !202, line: 582, column: 5)
!210 = distinct !DILexicalBlock(scope: !201, file: !202, line: 581, column: 7)
!211 = !DILocalVariable(name: "double_space", scope: !201, file: !202, line: 594, type: !81)
!212 = !DILocalVariable(name: "first_word", scope: !201, file: !202, line: 595, type: !86)
!213 = !DILocalVariable(name: "option_text", scope: !201, file: !202, line: 596, type: !86)
!214 = !DILocalVariable(name: "s", scope: !215, file: !202, line: 608, type: !86)
!215 = distinct !DILexicalBlock(scope: !216, file: !202, line: 605, column: 5)
!216 = distinct !DILexicalBlock(scope: !217, file: !202, line: 604, column: 12)
!217 = distinct !DILexicalBlock(scope: !201, file: !202, line: 597, column: 7)
!218 = !DILocalVariable(name: "spaces", scope: !215, file: !202, line: 609, type: !89)
!219 = !DILocalVariable(name: "anchor_len", scope: !201, file: !202, line: 620, type: !89)
!220 = !DILocalVariable(name: "desc_text", scope: !201, file: !202, line: 625, type: !86)
!221 = !DILocalVariable(name: "__ptr", scope: !222, file: !202, line: 644, type: !86)
!222 = distinct !DILexicalBlock(scope: !201, file: !202, line: 644, column: 3)
!223 = !DILocalVariable(name: "__stream", scope: !222, file: !202, line: 644, type: !142)
!224 = !DILocalVariable(name: "__cnt", scope: !222, file: !202, line: 644, type: !89)
!225 = !DILocalVariable(name: "url_program", scope: !201, file: !202, line: 648, type: !86)
!226 = !DILocalVariable(name: "__ptr", scope: !227, file: !202, line: 686, type: !86)
!227 = distinct !DILexicalBlock(scope: !201, file: !202, line: 686, column: 3)
!228 = !DILocalVariable(name: "__stream", scope: !227, file: !202, line: 686, type: !142)
!229 = !DILocalVariable(name: "__cnt", scope: !227, file: !202, line: 686, type: !89)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "short_options", scope: !10, file: !3, line: 307, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 280, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 35)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "long_options", scope: !10, file: !3, line: 333, type: !237, isLocal: true, isDefinition: true)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 3072, elements: !247)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !240, line: 50, size: 256, elements: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!241 = !{!242, !243, !244, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !240, line: 52, baseType: !86, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !239, file: !240, line: 55, baseType: !6, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !239, file: !240, line: 56, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !239, file: !240, line: 57, baseType: !6, size: 32, offset: 192)
!247 = !{!248}
!248 = !DISubrange(count: 12)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "format_address", scope: !10, file: !3, line: 213, type: !251, isLocal: true, isDefinition: true)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !113, !9}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "address_base", scope: !10, file: !3, line: 182, type: !6, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !10, file: !3, line: 190, type: !6, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !10, file: !3, line: 234, type: !97, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !10, file: !3, line: 265, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 288, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!264 = !{!265}
!265 = !DISubrange(count: 9)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !10, file: !3, line: 288, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 544, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 17)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "charname", scope: !10, file: !3, line: 172, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1056, elements: !274)
!274 = !{!275, !276}
!275 = !DISubrange(count: 33)
!276 = !DISubrange(count: 4)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !10, file: !3, line: 225, type: !81, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "endian_types", scope: !10, file: !3, line: 328, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 64, elements: !283)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!283 = !{!284}
!284 = !DISubrange(count: 2)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "endian_args", scope: !10, file: !3, line: 323, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 192, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 3)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "end_offset", scope: !10, file: !3, line: 220, type: !113, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "default_file_list", scope: !10, file: !3, line: 251, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 128, elements: !283)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "input_filename", scope: !10, file: !3, line: 244, type: !86, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "width_bytes", scope: !10, file: !3, line: 134, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 288, elements: !264)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "first", scope: !303, file: !3, line: 1313, type: !81, isLocal: true, isDefinition: true)
!303 = distinct !DISubprogram(name: "write_block", scope: !3, file: !3, line: 1310, type: !304, scopeLine: 1312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !306)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !113, !97, !86, !86}
!306 = !{!307, !308, !309, !310, !311, !315, !318, !319, !320, !323, !325}
!307 = !DILocalVariable(name: "current_offset", arg: 1, scope: !303, file: !3, line: 1310, type: !113)
!308 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !303, file: !3, line: 1310, type: !97)
!309 = !DILocalVariable(name: "prev_block", arg: 3, scope: !303, file: !3, line: 1311, type: !86)
!310 = !DILocalVariable(name: "curr_block", arg: 4, scope: !303, file: !3, line: 1311, type: !86)
!311 = !DILocalVariable(name: "i", scope: !312, file: !3, line: 1334, type: !97)
!312 = distinct !DILexicalBlock(scope: !313, file: !3, line: 1334, column: 7)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 1332, column: 5)
!314 = distinct !DILexicalBlock(scope: !303, file: !3, line: 1316, column: 7)
!315 = !DILocalVariable(name: "datum_width", scope: !316, file: !3, line: 1336, type: !6)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 1335, column: 9)
!317 = distinct !DILexicalBlock(scope: !312, file: !3, line: 1334, column: 7)
!318 = !DILocalVariable(name: "fields_per_block", scope: !316, file: !3, line: 1337, type: !97)
!319 = !DILocalVariable(name: "blank_fields", scope: !316, file: !3, line: 1338, type: !97)
!320 = !DILocalVariable(name: "field_width", scope: !321, file: !3, line: 1349, type: !6)
!321 = distinct !DILexicalBlock(scope: !322, file: !3, line: 1347, column: 13)
!322 = distinct !DILexicalBlock(scope: !316, file: !3, line: 1346, column: 15)
!323 = !DILocalVariable(name: "f", scope: !324, file: !3, line: 1350, type: !97)
!324 = distinct !DILexicalBlock(scope: !321, file: !3, line: 1350, column: 15)
!325 = !DILocalVariable(name: "pad_width", scope: !321, file: !3, line: 1352, type: !97)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !303, file: !3, line: 1314, type: !81, isLocal: true, isDefinition: true)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !341, !342, !343, !344, !348, !351, !354, !355, !357, !360, !361, !363, !366, !367}
!329 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 1677, type: !6)
!330 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 1677, type: !7)
!331 = !DILocalVariable(name: "n_files", scope: !2, file: !3, line: 1679, type: !6)
!332 = !DILocalVariable(name: "l_c_m", scope: !2, file: !3, line: 1680, type: !6)
!333 = !DILocalVariable(name: "desired_width", scope: !2, file: !3, line: 1681, type: !97)
!334 = !DILocalVariable(name: "modern", scope: !2, file: !3, line: 1682, type: !81)
!335 = !DILocalVariable(name: "ok", scope: !2, file: !3, line: 1683, type: !81)
!336 = !DILocalVariable(name: "width_per_block", scope: !2, file: !3, line: 1684, type: !97)
!337 = !DILocalVariable(name: "max_bytes_to_format", scope: !2, file: !3, line: 1689, type: !113)
!338 = !DILocalVariable(name: "pseudo_start", scope: !2, file: !3, line: 1693, type: !113)
!339 = !DILocalVariable(name: "tmp", scope: !340, file: !3, line: 1705, type: !113)
!340 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1704, column: 5)
!341 = !DILocalVariable(name: "s_err", scope: !340, file: !3, line: 1706, type: !12)
!342 = !DILocalVariable(name: "oi", scope: !340, file: !3, line: 1707, type: !6)
!343 = !DILocalVariable(name: "c", scope: !340, file: !3, line: 1708, type: !6)
!344 = !DILocalVariable(name: "i", scope: !345, file: !3, line: 1769, type: !97)
!345 = distinct !DILexicalBlock(scope: !346, file: !3, line: 1765, column: 13)
!346 = distinct !DILexicalBlock(scope: !347, file: !3, line: 1762, column: 15)
!347 = distinct !DILexicalBlock(scope: !340, file: !3, line: 1713, column: 9)
!348 = !DILocalVariable(name: "w_tmp", scope: !349, file: !3, line: 1847, type: !113)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 1846, column: 13)
!350 = distinct !DILexicalBlock(scope: !347, file: !3, line: 1841, column: 15)
!351 = !DILocalVariable(name: "o1", scope: !352, file: !3, line: 1894, type: !113)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 1893, column: 5)
!353 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1892, column: 7)
!354 = !DILocalVariable(name: "o2", scope: !352, file: !3, line: 1895, type: !113)
!355 = !DILocalVariable(name: "i", scope: !356, file: !3, line: 2027, type: !97)
!356 = distinct !DILexicalBlock(scope: !2, file: !3, line: 2027, column: 3)
!357 = !DILocalVariable(name: "fields_per_block", scope: !358, file: !3, line: 2029, type: !97)
!358 = distinct !DILexicalBlock(scope: !359, file: !3, line: 2028, column: 5)
!359 = distinct !DILexicalBlock(scope: !356, file: !3, line: 2027, column: 3)
!360 = !DILocalVariable(name: "block_width", scope: !358, file: !3, line: 2032, type: !97)
!361 = !DILocalVariable(name: "i", scope: !362, file: !3, line: 2036, type: !97)
!362 = distinct !DILexicalBlock(scope: !2, file: !3, line: 2036, column: 3)
!363 = !DILocalVariable(name: "fields_per_block", scope: !364, file: !3, line: 2038, type: !97)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 2037, column: 5)
!365 = distinct !DILexicalBlock(scope: !362, file: !3, line: 2036, column: 3)
!366 = !DILocalVariable(name: "block_width", scope: !364, file: !3, line: 2039, type: !97)
!367 = !DILabel(scope: !2, name: "cleanup", file: !3, line: 2058)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 120, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 15)
!371 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!372 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!373 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!374 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!375 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!376 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!377 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!378 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "Version", scope: !381, file: !382, line: 3, type: !86, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !383, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!383 = !{!379}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !386, file: !387, line: 65, type: !391, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!388 = !{!65}
!389 = !{!80, !86, !92}
!390 = !{!384}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !392, line: 69, baseType: !393)
!392 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "file_name", scope: !398, file: !399, line: 45, type: !86, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !400, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!400 = !{!396, !401}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !398, file: !399, line: 55, type: !81, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !405, file: !406, line: 66, type: !393, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!407 = !{!80, !92}
!408 = !{!409, !435, !403, !437, !439}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "old_file_name", scope: !411, file: !406, line: 304, type: !86, isLocal: true, isDefinition: true)
!411 = distinct !DISubprogram(name: "verror_at_line", scope: !406, file: !406, line: 298, type: !412, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !428)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !6, !6, !86, !14, !86, !414}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !415, line: 52, baseType: !416)
!415 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !417, line: 32, baseType: !418)
!417 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !419, baseType: !420)
!419 = !DIFile(filename: "lib/error.c", directory: "/src")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !421, size: 256, elements: !422)
!421 = !DINamespace(name: "std", scope: null)
!422 = !{!423, !424, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !420, file: !419, baseType: !80, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !420, file: !419, baseType: !80, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !420, file: !419, baseType: !80, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !420, file: !419, baseType: !6, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !420, file: !419, baseType: !6, size: 32, offset: 224)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DILocalVariable(name: "status", arg: 1, scope: !411, file: !406, line: 298, type: !6)
!430 = !DILocalVariable(name: "errnum", arg: 2, scope: !411, file: !406, line: 298, type: !6)
!431 = !DILocalVariable(name: "file_name", arg: 3, scope: !411, file: !406, line: 298, type: !86)
!432 = !DILocalVariable(name: "line_number", arg: 4, scope: !411, file: !406, line: 298, type: !14)
!433 = !DILocalVariable(name: "message", arg: 5, scope: !411, file: !406, line: 298, type: !86)
!434 = !DILocalVariable(name: "args", arg: 6, scope: !411, file: !406, line: 298, type: !414)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "old_line_number", scope: !411, file: !406, line: 305, type: !14, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "error_message_count", scope: !405, file: !406, line: 69, type: !14, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !405, file: !406, line: 295, type: !6, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "program_name", scope: !443, file: !444, line: 31, type: !86, isLocal: false, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !445, globals: !446, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!445 = !{!8}
!446 = !{!441}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "utf07FF", scope: !449, file: !450, line: 46, type: !479, isLocal: true, isDefinition: true)
!449 = distinct !DISubprogram(name: "proper_name_lite", scope: !450, file: !450, line: 38, type: !451, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !453, retainedNodes: !455)
!450 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!451 = !DISubroutineType(types: !452)
!452 = !{!86, !86, !86}
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !454, splitDebugInlining: false, nameTableKind: None)
!454 = !{!447}
!455 = !{!456, !457, !458, !459, !464}
!456 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !449, file: !450, line: 38, type: !86)
!457 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !449, file: !450, line: 38, type: !86)
!458 = !DILocalVariable(name: "translation", scope: !449, file: !450, line: 40, type: !86)
!459 = !DILocalVariable(name: "w", scope: !449, file: !450, line: 47, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !461, line: 37, baseType: !462)
!461 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !116, line: 57, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 42, baseType: !14)
!464 = !DILocalVariable(name: "mbs", scope: !449, file: !450, line: 48, type: !465)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !466, line: 6, baseType: !467)
!466 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !468, line: 21, baseType: !469)
!468 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 13, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !469, file: !468, line: 15, baseType: !6, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !469, file: !468, line: 20, baseType: !473, size: 32, offset: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !468, line: 16, size: 32, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !473, file: !468, line: 18, baseType: !14, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !473, file: !468, line: 19, baseType: !477, size: 32)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !478)
!478 = !{!276}
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 16, elements: !283)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !482, file: !483, line: 76, type: !551, isLocal: false, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !490, globals: !491, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!484 = !{!65, !485, !46}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !66, line: 254, baseType: !14, size: 32, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!488 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!489 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!490 = !{!6, !88, !89}
!491 = !{!480, !492, !498, !510, !512, !517, !540, !547, !549}
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !482, file: !483, line: 92, type: !494, isLocal: false, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 320, elements: !496)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!496 = !{!497}
!497 = !DISubrange(count: 10)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !482, file: !483, line: 1040, type: !500, isLocal: false, isDefinition: true)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !483, line: 56, size: 448, elements: !501)
!501 = !{!502, !503, !504, !508, !509}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !500, file: !483, line: 59, baseType: !65, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !483, line: 62, baseType: !6, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !500, file: !483, line: 66, baseType: !505, size: 256, offset: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !500, file: !483, line: 69, baseType: !86, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !500, file: !483, line: 72, baseType: !86, size: 64, offset: 384)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !482, file: !483, line: 107, type: !500, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "slot0", scope: !482, file: !483, line: 831, type: !514, isLocal: true, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 256)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "quote", scope: !519, file: !483, line: 228, type: !538, isLocal: true, isDefinition: true)
!519 = distinct !DISubprogram(name: "gettext_quote", scope: !483, file: !483, line: 197, type: !520, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !482, retainedNodes: !522)
!520 = !DISubroutineType(types: !521)
!521 = !{!86, !86, !65}
!522 = !{!523, !524, !525, !526, !527}
!523 = !DILocalVariable(name: "msgid", arg: 1, scope: !519, file: !483, line: 197, type: !86)
!524 = !DILocalVariable(name: "s", arg: 2, scope: !519, file: !483, line: 197, type: !65)
!525 = !DILocalVariable(name: "translation", scope: !519, file: !483, line: 199, type: !86)
!526 = !DILocalVariable(name: "w", scope: !519, file: !483, line: 229, type: !460)
!527 = !DILocalVariable(name: "mbs", scope: !519, file: !483, line: 230, type: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !466, line: 6, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !468, line: 21, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 13, size: 64, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !530, file: !468, line: 15, baseType: !6, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !530, file: !468, line: 20, baseType: !534, size: 32, offset: 32)
!534 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !468, line: 16, size: 32, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !534, file: !468, line: 18, baseType: !14, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !534, file: !468, line: 19, baseType: !477, size: 32)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 64, elements: !539)
!539 = !{!284, !276}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "slotvec", scope: !482, file: !483, line: 834, type: !542, isLocal: true, isDefinition: true)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !483, line: 823, size: 128, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !543, file: !483, line: 825, baseType: !89, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !543, file: !483, line: 826, baseType: !8, size: 64, offset: 64)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "nslots", scope: !482, file: !483, line: 832, type: !6, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "slotvec0", scope: !482, file: !483, line: 833, type: !543, isLocal: true, isDefinition: true)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 704, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 11)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !556, file: !557, line: 26, type: !559, isLocal: false, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !558, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!558 = !{!554}
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 376, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 47)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "exit_failure", scope: !564, file: !565, line: 24, type: !567, isLocal: false, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !566, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!566 = !{!562}
!567 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "internal_state", scope: !570, file: !571, line: 97, type: !574, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !572, globals: !573, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!572 = !{!80, !89, !92}
!573 = !{!568}
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !466, line: 6, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !468, line: 21, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 13, size: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !576, file: !468, line: 15, baseType: !6, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !576, file: !468, line: 20, baseType: !580, size: 32, offset: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !576, file: !468, line: 16, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !580, file: !468, line: 18, baseType: !14, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !580, file: !468, line: 19, baseType: !477, size: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !586, file: !587, line: 211, type: !773, isLocal: true, isDefinition: true)
!586 = distinct !DISubprogram(name: "printf_fetchargs", scope: !587, file: !587, line: 42, type: !588, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !764, retainedNodes: !768)
!587 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!588 = !DISubroutineType(types: !589)
!589 = !{!6, !590, !600}
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !417, line: 14, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !592, baseType: !593)
!592 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !421, size: 256, elements: !594)
!594 = !{!595, !596, !597, !598, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !593, file: !592, baseType: !80, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !593, file: !592, baseType: !80, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !593, file: !592, baseType: !80, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !593, file: !592, baseType: !6, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !593, file: !592, baseType: !6, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !602, line: 185, baseType: !603)
!602 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 179, size: 1920, elements: !604)
!604 = !{!605, !606, !760}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !603, file: !602, line: 181, baseType: !89, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !603, file: !602, line: 182, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !602, line: 174, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 111, size: 256, elements: !610)
!610 = !{!611, !662}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !609, file: !602, line: 113, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !602, line: 108, baseType: !613)
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !602, line: 47, baseType: !14, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661}
!615 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!616 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!617 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!618 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!619 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!620 = !DIEnumerator(name: "TYPE_INT", value: 5)
!621 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!622 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!623 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!624 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!625 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!626 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!627 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!628 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!629 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!630 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!631 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!632 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!633 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!634 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!635 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!636 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!637 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!638 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!639 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!640 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!641 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!642 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!643 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!644 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!645 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!646 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!647 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!648 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!649 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!650 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!651 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!652 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!653 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!654 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!655 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!656 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!657 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!658 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!659 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!660 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!661 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !609, file: !602, line: 172, baseType: !663, size: 128, offset: 128)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !609, file: !602, line: 114, size: 128, elements: !664)
!664 = !{!665, !666, !667, !669, !670, !671, !672, !673, !674, !676, !678, !682, !686, !689, !692, !695, !697, !700, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !725, !726, !729, !730, !734, !735, !737, !739, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !663, file: !602, line: 116, baseType: !171, size: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !663, file: !602, line: 117, baseType: !92, size: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !663, file: !602, line: 118, baseType: !668, size: 16)
!668 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !663, file: !602, line: 119, baseType: !88, size: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !663, file: !602, line: 120, baseType: !6, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !663, file: !602, line: 121, baseType: !14, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !663, file: !602, line: 122, baseType: !100, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !663, file: !602, line: 123, baseType: !91, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !663, file: !602, line: 124, baseType: !675, size: 64)
!675 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !663, file: !602, line: 125, baseType: !677, size: 64)
!677 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !663, file: !602, line: 126, baseType: !679, size: 8)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !680, line: 24, baseType: !681)
!680 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !116, line: 37, baseType: !171)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !663, file: !602, line: 127, baseType: !683, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !684, line: 24, baseType: !685)
!684 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !116, line: 38, baseType: !92)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !663, file: !602, line: 128, baseType: !687, size: 16)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !680, line: 25, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !116, line: 39, baseType: !668)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !663, file: !602, line: 129, baseType: !690, size: 16)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !684, line: 25, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !116, line: 40, baseType: !88)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !663, file: !602, line: 130, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !680, line: 26, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !116, line: 41, baseType: !6)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !663, file: !602, line: 131, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !684, line: 26, baseType: !463)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !663, file: !602, line: 132, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !680, line: 27, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !116, line: 44, baseType: !100)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !663, file: !602, line: 133, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !684, line: 27, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !116, line: 45, baseType: !91)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !663, file: !602, line: 134, baseType: !704, size: 8)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !114, line: 58, baseType: !171)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !663, file: !602, line: 135, baseType: !706, size: 8)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !114, line: 71, baseType: !92)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !663, file: !602, line: 136, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !114, line: 60, baseType: !100)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !663, file: !602, line: 137, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !114, line: 73, baseType: !91)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !663, file: !602, line: 138, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !114, line: 61, baseType: !100)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !663, file: !602, line: 139, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !114, line: 74, baseType: !91)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !663, file: !602, line: 140, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !114, line: 62, baseType: !100)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !663, file: !602, line: 141, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !114, line: 75, baseType: !91)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !663, file: !602, line: 142, baseType: !720, size: 32)
!720 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !663, file: !602, line: 143, baseType: !722, size: 64)
!722 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !663, file: !602, line: 144, baseType: !724, size: 128)
!724 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !663, file: !602, line: 145, baseType: !6, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !663, file: !602, line: 147, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !728, line: 20, baseType: !14)
!728 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !663, file: !602, line: 149, baseType: !86, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !663, file: !602, line: 150, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !90, line: 74, baseType: !14)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !663, file: !602, line: 151, baseType: !80, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !663, file: !602, line: 152, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !663, file: !602, line: 153, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !663, file: !602, line: 154, baseType: !245, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !663, file: !602, line: 155, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !663, file: !602, line: 156, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !663, file: !602, line: 157, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !663, file: !602, line: 158, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !663, file: !602, line: 159, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !663, file: !602, line: 160, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !663, file: !602, line: 161, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !663, file: !602, line: 162, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !663, file: !602, line: 163, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !663, file: !602, line: 164, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !603, file: !602, line: 183, baseType: !761, size: 1792, offset: 128)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 1792, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 7)
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !765, retainedTypes: !766, globals: !767, splitDebugInlining: false, nameTableKind: None)
!765 = !{!613}
!766 = !{!80}
!767 = !{!584}
!768 = !{!769, !770, !771, !772}
!769 = !DILocalVariable(name: "args", arg: 1, scope: !586, file: !587, line: 42, type: !590)
!770 = !DILocalVariable(name: "a", arg: 2, scope: !586, file: !587, line: 42, type: !600)
!771 = !DILocalVariable(name: "i", scope: !586, file: !587, line: 44, type: !89)
!772 = !DILocalVariable(name: "ap", scope: !586, file: !587, line: 45, type: !607)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 224, elements: !762)
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/dtoastr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "367e58fad54b60d82e990a7817df6f7e")
!776 = !{!777}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !778, line: 64, baseType: !14, size: 32, elements: !779)
!778 = !DIFile(filename: "./lib/ftoastr.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d8852edab60e1bfe07894c612610ce33")
!779 = !{!780, !781, !782, !783, !784}
!780 = !DIEnumerator(name: "FTOASTR_LEFT_JUSTIFY", value: 1)
!781 = !DIEnumerator(name: "FTOASTR_ALWAYS_SIGNED", value: 2)
!782 = !DIEnumerator(name: "FTOASTR_SPACE_POSITIVE", value: 4)
!783 = !DIEnumerator(name: "FTOASTR_ZERO_PAD", value: 8)
!784 = !DIEnumerator(name: "FTOASTR_UPPER_E", value: 16)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !766, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !766, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/ftoastr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "70bb2ecb9a59521192f153bc763df3dd")
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/ldtoastr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0ed53b0dc1afc729b2798d210ca78543")
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !799, retainedTypes: !766, splitDebugInlining: false, nameTableKind: None)
!798 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!799 = !{!800}
!800 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !798, line: 40, baseType: !14, size: 32, elements: !801)
!801 = !{!802}
!802 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !805, retainedTypes: !833, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!805 = !{!806, !818}
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !807, file: !804, line: 188, baseType: !14, size: 32, elements: !816)
!807 = distinct !DISubprogram(name: "x2nrealloc", scope: !804, file: !804, line: 176, type: !808, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !803, retainedNodes: !811)
!808 = !DISubroutineType(types: !809)
!809 = !{!80, !80, !810, !89}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(name: "p", arg: 1, scope: !807, file: !804, line: 176, type: !80)
!813 = !DILocalVariable(name: "pn", arg: 2, scope: !807, file: !804, line: 176, type: !810)
!814 = !DILocalVariable(name: "s", arg: 3, scope: !807, file: !804, line: 176, type: !89)
!815 = !DILocalVariable(name: "n", scope: !807, file: !804, line: 178, type: !89)
!816 = !{!817}
!817 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !819, file: !804, line: 228, baseType: !14, size: 32, elements: !816)
!819 = distinct !DISubprogram(name: "xpalloc", scope: !804, file: !804, line: 223, type: !820, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !803, retainedNodes: !823)
!820 = !DISubroutineType(types: !821)
!821 = !{!80, !80, !822, !97, !99, !97}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832}
!824 = !DILocalVariable(name: "pa", arg: 1, scope: !819, file: !804, line: 223, type: !80)
!825 = !DILocalVariable(name: "pn", arg: 2, scope: !819, file: !804, line: 223, type: !822)
!826 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !819, file: !804, line: 223, type: !97)
!827 = !DILocalVariable(name: "n_max", arg: 4, scope: !819, file: !804, line: 223, type: !99)
!828 = !DILocalVariable(name: "s", arg: 5, scope: !819, file: !804, line: 223, type: !97)
!829 = !DILocalVariable(name: "n0", scope: !819, file: !804, line: 230, type: !97)
!830 = !DILocalVariable(name: "n", scope: !819, file: !804, line: 237, type: !97)
!831 = !DILocalVariable(name: "nbytes", scope: !819, file: !804, line: 248, type: !97)
!832 = !DILocalVariable(name: "adjusted_nbytes", scope: !819, file: !804, line: 252, type: !97)
!833 = !{!8, !80, !81, !100, !91}
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!837 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, retainedTypes: !841, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!840 = !{!12}
!841 = !{!81, !100, !91, !113}
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !766, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !850, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!850 = !{!81, !91, !80}
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !853, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "lib/vfzprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "641ad3c8eb652aaa6eacd294d7088ef5")
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !415, line: 70, baseType: !180)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/vzprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5245eb1f3c2cf890c3d9ecb05bb944ac")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !765, retainedTypes: !859, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!859 = !{!8, !89, !80, !86, !14}
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/fseterr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "69fa068b6477603dbe10e7ff5edd6701")
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !766, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !765, retainedTypes: !870, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!870 = !{!89, !871, !80, !926}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !602, line: 174, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 111, size: 256, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !873, file: !602, line: 113, baseType: !612, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !873, file: !602, line: 172, baseType: !877, size: 128, offset: 128)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !873, file: !602, line: 114, size: 128, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !877, file: !602, line: 116, baseType: !171, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !877, file: !602, line: 117, baseType: !92, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !877, file: !602, line: 118, baseType: !668, size: 16)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !877, file: !602, line: 119, baseType: !88, size: 16)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !877, file: !602, line: 120, baseType: !6, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !877, file: !602, line: 121, baseType: !14, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !877, file: !602, line: 122, baseType: !100, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !877, file: !602, line: 123, baseType: !91, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !877, file: !602, line: 124, baseType: !675, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !877, file: !602, line: 125, baseType: !677, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !877, file: !602, line: 126, baseType: !679, size: 8)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !877, file: !602, line: 127, baseType: !683, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !877, file: !602, line: 128, baseType: !687, size: 16)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !877, file: !602, line: 129, baseType: !690, size: 16)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !877, file: !602, line: 130, baseType: !693, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !877, file: !602, line: 131, baseType: !696, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !877, file: !602, line: 132, baseType: !698, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !877, file: !602, line: 133, baseType: !701, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !877, file: !602, line: 134, baseType: !704, size: 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !877, file: !602, line: 135, baseType: !706, size: 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !877, file: !602, line: 136, baseType: !708, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !877, file: !602, line: 137, baseType: !710, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !877, file: !602, line: 138, baseType: !712, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !877, file: !602, line: 139, baseType: !714, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !877, file: !602, line: 140, baseType: !716, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !877, file: !602, line: 141, baseType: !718, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !877, file: !602, line: 142, baseType: !720, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !877, file: !602, line: 143, baseType: !722, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !877, file: !602, line: 144, baseType: !724, size: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !877, file: !602, line: 145, baseType: !6, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !877, file: !602, line: 147, baseType: !727, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !877, file: !602, line: 149, baseType: !86, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !877, file: !602, line: 150, baseType: !731, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !877, file: !602, line: 151, baseType: !80, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !877, file: !602, line: 152, baseType: !736, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !877, file: !602, line: 153, baseType: !738, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !877, file: !602, line: 154, baseType: !245, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !877, file: !602, line: 155, baseType: !741, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !877, file: !602, line: 156, baseType: !743, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !877, file: !602, line: 157, baseType: !745, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !877, file: !602, line: 158, baseType: !747, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !877, file: !602, line: 159, baseType: !749, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !877, file: !602, line: 160, baseType: !751, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !877, file: !602, line: 161, baseType: !753, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !877, file: !602, line: 162, baseType: !755, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !877, file: !602, line: 163, baseType: !757, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !877, file: !602, line: 164, baseType: !759, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !928, line: 67, baseType: !929)
!928 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !928, line: 53, size: 704, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !929, file: !928, line: 55, baseType: !86, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !929, file: !928, line: 56, baseType: !86, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !929, file: !928, line: 57, baseType: !6, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !929, file: !928, line: 58, baseType: !86, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !929, file: !928, line: 59, baseType: !86, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !929, file: !928, line: 60, baseType: !89, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !929, file: !928, line: 61, baseType: !86, size: 64, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !929, file: !928, line: 62, baseType: !86, size: 64, offset: 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !929, file: !928, line: 63, baseType: !89, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !929, file: !928, line: 64, baseType: !9, size: 8, offset: 576)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !929, file: !928, line: 65, baseType: !89, size: 64, offset: 640)
!942 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!943 = !{i32 7, !"Dwarf Version", i32 5}
!944 = !{i32 2, !"Debug Info Version", i32 3}
!945 = !{i32 1, !"wchar_size", i32 4}
!946 = !{i32 1, !"branch-target-enforcement", i32 0}
!947 = !{i32 1, !"sign-return-address", i32 0}
!948 = !{i32 1, !"sign-return-address-all", i32 0}
!949 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!950 = !{i32 7, !"PIC Level", i32 2}
!951 = !{i32 7, !"PIE Level", i32 2}
!952 = !{i32 7, !"uwtable", i32 1}
!953 = !{i32 7, !"frame-pointer", i32 1}
!954 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 351, type: !955, scopeLine: 352, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !957)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !6}
!957 = !{!958}
!958 = !DILocalVariable(name: "status", arg: 1, scope: !954, file: !3, line: 351, type: !6)
!959 = !DILocation(line: 0, scope: !954)
!960 = !DILocation(line: 353, column: 14, scope: !961)
!961 = distinct !DILexicalBlock(scope: !954, file: !3, line: 353, column: 7)
!962 = !DILocation(line: 353, column: 7, scope: !954)
!963 = !DILocation(line: 354, column: 5, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !3, line: 354, column: 5)
!965 = !{!966, !966, i64 0}
!966 = !{!"any pointer", !967, i64 0}
!967 = !{!"omnipotent char", !968, i64 0}
!968 = !{!"Simple C/C++ TBAA"}
!969 = !DILocation(line: 357, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !961, file: !3, line: 356, column: 5)
!971 = !DILocation(line: 363, column: 7, scope: !970)
!972 = !DILocation(line: 729, column: 3, scope: !973, inlinedAt: !975)
!973 = distinct !DISubprogram(name: "emit_stdin_note", scope: !202, file: !202, line: 727, type: !394, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !974)
!974 = !{}
!975 = distinct !DILocation(line: 369, column: 7, scope: !970)
!976 = !DILocation(line: 371, column: 7, scope: !970)
!977 = !DILocation(line: 736, column: 3, scope: !978, inlinedAt: !979)
!978 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !202, file: !202, line: 734, type: !394, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !974)
!979 = distinct !DILocation(line: 381, column: 7, scope: !970)
!980 = !DILocation(line: 383, column: 7, scope: !970)
!981 = !DILocation(line: 388, column: 7, scope: !970)
!982 = !DILocation(line: 392, column: 7, scope: !970)
!983 = !DILocation(line: 396, column: 7, scope: !970)
!984 = !DILocation(line: 400, column: 7, scope: !970)
!985 = !DILocation(line: 405, column: 7, scope: !970)
!986 = !DILocation(line: 409, column: 7, scope: !970)
!987 = !DILocation(line: 413, column: 7, scope: !970)
!988 = !DILocation(line: 418, column: 7, scope: !970)
!989 = !DILocation(line: 422, column: 7, scope: !970)
!990 = !DILocation(line: 423, column: 7, scope: !970)
!991 = !DILocation(line: 424, column: 7, scope: !970)
!992 = !DILocation(line: 429, column: 7, scope: !970)
!993 = !DILocation(line: 432, column: 7, scope: !970)
!994 = !DILocation(line: 435, column: 7, scope: !970)
!995 = !DILocation(line: 438, column: 7, scope: !970)
!996 = !DILocation(line: 441, column: 7, scope: !970)
!997 = !DILocation(line: 444, column: 7, scope: !970)
!998 = !DILocation(line: 447, column: 7, scope: !970)
!999 = !DILocation(line: 450, column: 7, scope: !970)
!1000 = !DILocation(line: 453, column: 7, scope: !970)
!1001 = !DILocation(line: 456, column: 7, scope: !970)
!1002 = !DILocation(line: 459, column: 7, scope: !970)
!1003 = !DILocation(line: 466, column: 7, scope: !970)
!1004 = !DILocation(line: 473, column: 7, scope: !970)
!1005 = !DILocation(line: 481, column: 7, scope: !970)
!1006 = !DILocation(line: 486, column: 7, scope: !970)
!1007 = !DILocalVariable(name: "program", arg: 1, scope: !1008, file: !202, line: 836, type: !86)
!1008 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !202, file: !202, line: 836, type: !1009, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !86}
!1011 = !{!1007, !1012, !1019, !1020, !1022, !1023}
!1012 = !DILocalVariable(name: "infomap", scope: !1008, file: !202, line: 838, type: !1013)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 896, elements: !762)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1008, file: !202, line: 838, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1015, file: !202, line: 838, baseType: !86, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1015, file: !202, line: 838, baseType: !86, size: 64, offset: 64)
!1019 = !DILocalVariable(name: "node", scope: !1008, file: !202, line: 848, type: !86)
!1020 = !DILocalVariable(name: "map_prog", scope: !1008, file: !202, line: 849, type: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1022 = !DILocalVariable(name: "lc_messages", scope: !1008, file: !202, line: 861, type: !86)
!1023 = !DILocalVariable(name: "url_program", scope: !1008, file: !202, line: 874, type: !86)
!1024 = !DILocation(line: 0, scope: !1008, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 498, column: 7, scope: !970)
!1026 = !DILocation(line: 838, column: 3, scope: !1008, inlinedAt: !1025)
!1027 = !DILocation(line: 838, column: 67, scope: !1008, inlinedAt: !1025)
!1028 = !DILocation(line: 849, column: 36, scope: !1008, inlinedAt: !1025)
!1029 = !DILocation(line: 851, column: 3, scope: !1008, inlinedAt: !1025)
!1030 = !DILocalVariable(name: "__s1", arg: 1, scope: !1031, file: !1032, line: 1359, type: !86)
!1031 = distinct !DISubprogram(name: "streq", scope: !1032, file: !1032, line: 1359, type: !1033, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1035)
!1032 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!81, !86, !86}
!1035 = !{!1030, !1036}
!1036 = !DILocalVariable(name: "__s2", arg: 2, scope: !1031, file: !1032, line: 1359, type: !86)
!1037 = !DILocation(line: 0, scope: !1031, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 851, column: 33, scope: !1008, inlinedAt: !1025)
!1039 = !DILocation(line: 1361, column: 11, scope: !1031, inlinedAt: !1038)
!1040 = !DILocation(line: 1361, column: 10, scope: !1031, inlinedAt: !1038)
!1041 = !DILocation(line: 852, column: 13, scope: !1008, inlinedAt: !1025)
!1042 = !DILocation(line: 851, column: 20, scope: !1008, inlinedAt: !1025)
!1043 = !{!1044, !966, i64 0}
!1044 = !{!"infomap", !966, i64 0, !966, i64 8}
!1045 = !DILocation(line: 851, column: 10, scope: !1008, inlinedAt: !1025)
!1046 = !DILocation(line: 851, column: 28, scope: !1008, inlinedAt: !1025)
!1047 = distinct !{!1047, !1029, !1041, !1048}
!1048 = !{!"llvm.loop.mustprogress"}
!1049 = !DILocation(line: 854, column: 17, scope: !1050, inlinedAt: !1025)
!1050 = distinct !DILexicalBlock(scope: !1008, file: !202, line: 854, column: 7)
!1051 = !{!1044, !966, i64 8}
!1052 = !DILocation(line: 854, column: 7, scope: !1050, inlinedAt: !1025)
!1053 = !DILocation(line: 854, column: 7, scope: !1008, inlinedAt: !1025)
!1054 = !DILocation(line: 857, column: 3, scope: !1008, inlinedAt: !1025)
!1055 = !DILocation(line: 861, column: 29, scope: !1008, inlinedAt: !1025)
!1056 = !DILocation(line: 862, column: 7, scope: !1057, inlinedAt: !1025)
!1057 = distinct !DILexicalBlock(scope: !1008, file: !202, line: 862, column: 7)
!1058 = !DILocation(line: 862, column: 19, scope: !1057, inlinedAt: !1025)
!1059 = !DILocation(line: 862, column: 22, scope: !1057, inlinedAt: !1025)
!1060 = !DILocation(line: 862, column: 7, scope: !1008, inlinedAt: !1025)
!1061 = !DILocation(line: 868, column: 7, scope: !1062, inlinedAt: !1025)
!1062 = distinct !DILexicalBlock(scope: !1057, file: !202, line: 863, column: 5)
!1063 = !DILocation(line: 870, column: 5, scope: !1062, inlinedAt: !1025)
!1064 = !DILocation(line: 0, scope: !1031, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 874, column: 29, scope: !1008, inlinedAt: !1025)
!1066 = !DILocation(line: 875, column: 3, scope: !1008, inlinedAt: !1025)
!1067 = !DILocation(line: 877, column: 3, scope: !1008, inlinedAt: !1025)
!1068 = !DILocation(line: 879, column: 1, scope: !1008, inlinedAt: !1025)
!1069 = !DILocation(line: 500, column: 3, scope: !954)
