; ModuleID = 'src/pathchk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1
@.str.2 = private unnamed_addr constant [47 x i8] c"Diagnose invalid or non-portable file names.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"pathchk\00", align 1

!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 24, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!38 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!39 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!40 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!41 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!42 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!43 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!44 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!45 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!46 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!47 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!48 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!49 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!50 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!51 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!52 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!53 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!54 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!55 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!56 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!57 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!58 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!59 = !{!60, !62, !63, !64, !65, !68, !70}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!67 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !{!72, !0}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !74, file: !75, line: 575, type: !63, isLocal: true, isDefinition: true)
!74 = distinct !DISubprogram(name: "oputs_", scope: !75, file: !75, line: 573, type: !76, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !78)
!75 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!76 = !DISubroutineType(types: !77)
!77 = !{null, !68, !68}
!78 = !{!79, !80, !81, !84, !86, !87, !88, !92, !93, !94, !95, !97, !153, !154, !155, !157, !158}
!79 = !DILocalVariable(name: "program", arg: 1, scope: !74, file: !75, line: 573, type: !68)
!80 = !DILocalVariable(name: "option", arg: 2, scope: !74, file: !75, line: 573, type: !68)
!81 = !DILocalVariable(name: "term", scope: !82, file: !75, line: 585, type: !68)
!82 = distinct !DILexicalBlock(scope: !83, file: !75, line: 582, column: 5)
!83 = distinct !DILexicalBlock(scope: !74, file: !75, line: 581, column: 7)
!84 = !DILocalVariable(name: "double_space", scope: !74, file: !75, line: 594, type: !85)
!85 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!86 = !DILocalVariable(name: "first_word", scope: !74, file: !75, line: 595, type: !68)
!87 = !DILocalVariable(name: "option_text", scope: !74, file: !75, line: 596, type: !68)
!88 = !DILocalVariable(name: "s", scope: !89, file: !75, line: 608, type: !68)
!89 = distinct !DILexicalBlock(scope: !90, file: !75, line: 605, column: 5)
!90 = distinct !DILexicalBlock(scope: !91, file: !75, line: 604, column: 12)
!91 = distinct !DILexicalBlock(scope: !74, file: !75, line: 597, column: 7)
!92 = !DILocalVariable(name: "spaces", scope: !89, file: !75, line: 609, type: !65)
!93 = !DILocalVariable(name: "anchor_len", scope: !74, file: !75, line: 620, type: !65)
!94 = !DILocalVariable(name: "desc_text", scope: !74, file: !75, line: 625, type: !68)
!95 = !DILocalVariable(name: "__ptr", scope: !96, file: !75, line: 644, type: !68)
!96 = distinct !DILexicalBlock(scope: !74, file: !75, line: 644, column: 3)
!97 = !DILocalVariable(name: "__stream", scope: !96, file: !75, line: 644, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !100, line: 7, baseType: !101)
!100 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !102, line: 49, size: 1728, elements: !103)
!102 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !119, !121, !122, !123, !127, !128, !130, !134, !137, !139, !142, !145, !146, !147, !148, !149}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !101, file: !102, line: 51, baseType: !63, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !101, file: !102, line: 54, baseType: !60, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !101, file: !102, line: 55, baseType: !60, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !101, file: !102, line: 56, baseType: !60, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !101, file: !102, line: 57, baseType: !60, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !101, file: !102, line: 58, baseType: !60, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !101, file: !102, line: 59, baseType: !60, size: 64, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !101, file: !102, line: 60, baseType: !60, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !101, file: !102, line: 61, baseType: !60, size: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !101, file: !102, line: 64, baseType: !60, size: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !101, file: !102, line: 65, baseType: !60, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !101, file: !102, line: 66, baseType: !60, size: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !101, file: !102, line: 68, baseType: !117, size: 64, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !102, line: 36, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !101, file: !102, line: 70, baseType: !120, size: 64, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !101, file: !102, line: 72, baseType: !63, size: 32, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !101, file: !102, line: 73, baseType: !63, size: 32, offset: 928)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !101, file: !102, line: 74, baseType: !124, size: 64, offset: 960)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !125, line: 152, baseType: !126)
!125 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!126 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !101, file: !102, line: 77, baseType: !64, size: 16, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !101, file: !102, line: 78, baseType: !129, size: 8, offset: 1040)
!129 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !101, file: !102, line: 79, baseType: !131, size: 8, offset: 1048)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !101, file: !102, line: 81, baseType: !135, size: 64, offset: 1088)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !102, line: 43, baseType: null)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !101, file: !102, line: 89, baseType: !138, size: 64, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !125, line: 153, baseType: !126)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !101, file: !102, line: 91, baseType: !140, size: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !102, line: 37, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !101, file: !102, line: 92, baseType: !143, size: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !102, line: 38, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !101, file: !102, line: 93, baseType: !120, size: 64, offset: 1344)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !101, file: !102, line: 94, baseType: !62, size: 64, offset: 1408)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !101, file: !102, line: 95, baseType: !65, size: 64, offset: 1472)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !101, file: !102, line: 96, baseType: !63, size: 32, offset: 1536)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !101, file: !102, line: 98, baseType: !150, size: 160, offset: 1568)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 20)
!153 = !DILocalVariable(name: "__cnt", scope: !96, file: !75, line: 644, type: !65)
!154 = !DILocalVariable(name: "url_program", scope: !74, file: !75, line: 648, type: !68)
!155 = !DILocalVariable(name: "__ptr", scope: !156, file: !75, line: 686, type: !68)
!156 = distinct !DILexicalBlock(scope: !74, file: !75, line: 686, column: 3)
!157 = !DILocalVariable(name: "__stream", scope: !156, file: !75, line: 686, type: !98)
!158 = !DILocalVariable(name: "__cnt", scope: !156, file: !75, line: 686, type: !65)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1024, elements: !169)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !162, line: 50, size: 256, elements: !163)
!162 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!163 = !{!164, !165, !166, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !162, line: 52, baseType: !68, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !161, file: !162, line: 55, baseType: !63, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !161, file: !162, line: 56, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !161, file: !162, line: 57, baseType: !63, size: 32, offset: 192)
!169 = !{!170}
!170 = !DISubrange(count: 4)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "Version", scope: !173, file: !174, line: 3, type: !68, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !175, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!175 = !{!171}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "file_name", scope: !178, file: !179, line: 45, type: !68, isLocal: true, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !180, splitDebugInlining: false, nameTableKind: None)
!179 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!180 = !{!176, !181}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !178, file: !179, line: 55, type: !85, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !185, file: !186, line: 66, type: !221, isLocal: false, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !187, globals: !188, splitDebugInlining: false, nameTableKind: None)
!186 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!187 = !{!62, !70}
!188 = !{!189, !215, !183, !217, !219}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "old_file_name", scope: !191, file: !186, line: 304, type: !68, isLocal: true, isDefinition: true)
!191 = distinct !DISubprogram(name: "verror_at_line", scope: !186, file: !186, line: 298, type: !192, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !208)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !63, !63, !68, !7, !68, !194}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !195, line: 52, baseType: !196)
!195 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !197, line: 32, baseType: !198)
!197 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !199, baseType: !200)
!199 = !DIFile(filename: "lib/error.c", directory: "/src")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !201, size: 256, elements: !202)
!201 = !DINamespace(name: "std", scope: null)
!202 = !{!203, !204, !205, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !200, file: !199, baseType: !62, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !200, file: !199, baseType: !62, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !200, file: !199, baseType: !62, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !200, file: !199, baseType: !63, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !200, file: !199, baseType: !63, size: 32, offset: 224)
!208 = !{!209, !210, !211, !212, !213, !214}
!209 = !DILocalVariable(name: "status", arg: 1, scope: !191, file: !186, line: 298, type: !63)
!210 = !DILocalVariable(name: "errnum", arg: 2, scope: !191, file: !186, line: 298, type: !63)
!211 = !DILocalVariable(name: "file_name", arg: 3, scope: !191, file: !186, line: 298, type: !68)
!212 = !DILocalVariable(name: "line_number", arg: 4, scope: !191, file: !186, line: 298, type: !7)
!213 = !DILocalVariable(name: "message", arg: 5, scope: !191, file: !186, line: 298, type: !68)
!214 = !DILocalVariable(name: "args", arg: 6, scope: !191, file: !186, line: 298, type: !194)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "old_line_number", scope: !191, file: !186, line: 305, type: !7, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "error_message_count", scope: !185, file: !186, line: 69, type: !7, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !185, file: !186, line: 295, type: !63, isLocal: false, isDefinition: true)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null}
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "internal_state", scope: !226, file: !227, line: 24, type: !230, isLocal: true, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, globals: !229, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/mbrlen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c924d5b17c62ecd87f5e0fdbef8c37ec")
!228 = !{!62}
!229 = !{!224}
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !231, line: 6, baseType: !232)
!231 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !233, line: 21, baseType: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !234, file: !233, line: 15, baseType: !63, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !234, file: !233, line: 20, baseType: !238, size: 32, offset: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 16, size: 32, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !238, file: !233, line: 18, baseType: !7, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !238, file: !233, line: 19, baseType: !242, size: 32)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !169)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "program_name", scope: !245, file: !246, line: 31, type: !68, isLocal: false, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !247, globals: !248, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!247 = !{!60}
!248 = !{!243}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "utf07FF", scope: !251, file: !252, line: 46, type: !277, isLocal: true, isDefinition: true)
!251 = distinct !DISubprogram(name: "proper_name_lite", scope: !252, file: !252, line: 38, type: !253, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !257)
!252 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!253 = !DISubroutineType(types: !254)
!254 = !{!68, !68, !68}
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !256, splitDebugInlining: false, nameTableKind: None)
!256 = !{!249}
!257 = !{!258, !259, !260, !261, !266}
!258 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !251, file: !252, line: 38, type: !68)
!259 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !251, file: !252, line: 38, type: !68)
!260 = !DILocalVariable(name: "translation", scope: !251, file: !252, line: 40, type: !68)
!261 = !DILocalVariable(name: "w", scope: !251, file: !252, line: 47, type: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !263, line: 37, baseType: !264)
!263 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !125, line: 57, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !125, line: 42, baseType: !7)
!266 = !DILocalVariable(name: "mbs", scope: !251, file: !252, line: 48, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !231, line: 6, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !233, line: 21, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !269, file: !233, line: 15, baseType: !63, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !269, file: !233, line: 20, baseType: !273, size: 32, offset: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !269, file: !233, line: 16, size: 32, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !273, file: !233, line: 18, baseType: !7, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !273, file: !233, line: 19, baseType: !242, size: 32)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 2)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !282, file: !283, line: 76, type: !351, isLocal: false, isDefinition: true)
!282 = distinct !DICompileUnit(language: DW_LANG_C99, file: !283, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !284, retainedTypes: !290, globals: !291, splitDebugInlining: false, nameTableKind: None)
!283 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!284 = !{!21, !285, !5}
!285 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 254, baseType: !7, size: 32, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!288 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!289 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!290 = !{!63, !64, !65}
!291 = !{!280, !292, !298, !310, !312, !317, !340, !347, !349}
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !282, file: !283, line: 92, type: !294, isLocal: false, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 320, elements: !296)
!295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !282, file: !283, line: 1040, type: !300, isLocal: false, isDefinition: true)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !283, line: 56, size: 448, elements: !301)
!301 = !{!302, !303, !304, !308, !309}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !300, file: !283, line: 59, baseType: !21, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !283, line: 62, baseType: !63, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !300, file: !283, line: 66, baseType: !305, size: 256, offset: 64)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !300, file: !283, line: 69, baseType: !68, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !300, file: !283, line: 72, baseType: !68, size: 64, offset: 384)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !282, file: !283, line: 107, type: !300, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "slot0", scope: !282, file: !283, line: 831, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 256)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "quote", scope: !319, file: !283, line: 228, type: !338, isLocal: true, isDefinition: true)
!319 = distinct !DISubprogram(name: "gettext_quote", scope: !283, file: !283, line: 197, type: !320, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !282, retainedNodes: !322)
!320 = !DISubroutineType(types: !321)
!321 = !{!68, !68, !21}
!322 = !{!323, !324, !325, !326, !327}
!323 = !DILocalVariable(name: "msgid", arg: 1, scope: !319, file: !283, line: 197, type: !68)
!324 = !DILocalVariable(name: "s", arg: 2, scope: !319, file: !283, line: 197, type: !21)
!325 = !DILocalVariable(name: "translation", scope: !319, file: !283, line: 199, type: !68)
!326 = !DILocalVariable(name: "w", scope: !319, file: !283, line: 229, type: !262)
!327 = !DILocalVariable(name: "mbs", scope: !319, file: !283, line: 230, type: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !231, line: 6, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !233, line: 21, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !330, file: !233, line: 15, baseType: !63, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !330, file: !233, line: 20, baseType: !334, size: 32, offset: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !330, file: !233, line: 16, size: 32, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !334, file: !233, line: 18, baseType: !7, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !334, file: !233, line: 19, baseType: !242, size: 32)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !339)
!339 = !{!279, !170}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "slotvec", scope: !282, file: !283, line: 834, type: !342, isLocal: true, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !283, line: 823, size: 128, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !343, file: !283, line: 825, baseType: !65, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !343, file: !283, line: 826, baseType: !60, size: 64, offset: 64)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "nslots", scope: !282, file: !283, line: 832, type: !63, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "slotvec0", scope: !282, file: !283, line: 833, type: !343, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 704, elements: !353)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!353 = !{!354}
!354 = !DISubrange(count: 11)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !357, file: !358, line: 26, type: !360, isLocal: false, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !359, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!359 = !{!355}
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 47)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "exit_failure", scope: !365, file: !366, line: 24, type: !368, isLocal: false, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !367, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!367 = !{!363}
!368 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "internal_state", scope: !371, file: !372, line: 97, type: !375, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !373, globals: !374, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!373 = !{!62, !65, !70}
!374 = !{!369}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !231, line: 6, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !233, line: 21, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !377, file: !233, line: 15, baseType: !63, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !377, file: !233, line: 20, baseType: !381, size: 32, offset: 32)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !233, line: 16, size: 32, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !381, file: !233, line: 18, baseType: !7, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !381, file: !233, line: 19, baseType: !242, size: 32)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!386 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!389 = !{!65}
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !228, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!392 = !{!393}
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 40, baseType: !7, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !398, retainedTypes: !429, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!398 = !{!399, !411}
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !400, file: !397, line: 188, baseType: !7, size: 32, elements: !409)
!400 = distinct !DISubprogram(name: "x2nrealloc", scope: !397, file: !397, line: 176, type: !401, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !404)
!401 = !DISubroutineType(types: !402)
!402 = !{!62, !62, !403, !65}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!404 = !{!405, !406, !407, !408}
!405 = !DILocalVariable(name: "p", arg: 1, scope: !400, file: !397, line: 176, type: !62)
!406 = !DILocalVariable(name: "pn", arg: 2, scope: !400, file: !397, line: 176, type: !403)
!407 = !DILocalVariable(name: "s", arg: 3, scope: !400, file: !397, line: 176, type: !65)
!408 = !DILocalVariable(name: "n", scope: !400, file: !397, line: 178, type: !65)
!409 = !{!410}
!410 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !412, file: !397, line: 228, baseType: !7, size: 32, elements: !409)
!412 = distinct !DISubprogram(name: "xpalloc", scope: !397, file: !397, line: 223, type: !413, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !396, retainedNodes: !419)
!413 = !DISubroutineType(types: !414)
!414 = !{!62, !62, !415, !416, !418, !416}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !417, line: 130, baseType: !418)
!417 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !66, line: 35, baseType: !126)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428}
!420 = !DILocalVariable(name: "pa", arg: 1, scope: !412, file: !397, line: 223, type: !62)
!421 = !DILocalVariable(name: "pn", arg: 2, scope: !412, file: !397, line: 223, type: !415)
!422 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !412, file: !397, line: 223, type: !416)
!423 = !DILocalVariable(name: "n_max", arg: 4, scope: !412, file: !397, line: 223, type: !418)
!424 = !DILocalVariable(name: "s", arg: 5, scope: !412, file: !397, line: 223, type: !416)
!425 = !DILocalVariable(name: "n0", scope: !412, file: !397, line: 230, type: !416)
!426 = !DILocalVariable(name: "n", scope: !412, file: !397, line: 237, type: !416)
!427 = !DILocalVariable(name: "nbytes", scope: !412, file: !397, line: 248, type: !416)
!428 = !DILocalVariable(name: "adjusted_nbytes", scope: !412, file: !397, line: 252, type: !416)
!429 = !{!60, !62, !85, !126, !67}
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !444, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!444 = !{!85, !67, !62}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!449 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!450 = !{i32 7, !"Dwarf Version", i32 5}
!451 = !{i32 2, !"Debug Info Version", i32 3}
!452 = !{i32 1, !"wchar_size", i32 4}
!453 = !{i32 1, !"branch-target-enforcement", i32 0}
!454 = !{i32 1, !"sign-return-address", i32 0}
!455 = !{i32 1, !"sign-return-address-all", i32 0}
!456 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!457 = !{i32 7, !"PIC Level", i32 2}
!458 = !{i32 7, !"PIE Level", i32 2}
!459 = !{i32 7, !"uwtable", i32 1}
!460 = !{i32 7, !"frame-pointer", i32 1}
!461 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 81, type: !462, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !63}
!464 = !{!465}
!465 = !DILocalVariable(name: "status", arg: 1, scope: !461, file: !3, line: 81, type: !63)
!466 = !DILocation(line: 0, scope: !461)
!467 = !DILocation(line: 83, column: 14, scope: !468)
!468 = distinct !DILexicalBlock(scope: !461, file: !3, line: 83, column: 7)
!469 = !DILocation(line: 83, column: 7, scope: !461)
!470 = !DILocation(line: 84, column: 5, scope: !471)
!471 = distinct !DILexicalBlock(scope: !468, file: !3, line: 84, column: 5)
!472 = !{!473, !473, i64 0}
!473 = !{!"any pointer", !474, i64 0}
!474 = !{!"omnipotent char", !475, i64 0}
!475 = !{!"Simple C/C++ TBAA"}
!476 = !DILocation(line: 87, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !468, file: !3, line: 86, column: 5)
!478 = !DILocation(line: 88, column: 7, scope: !477)
!479 = !DILocation(line: 92, column: 7, scope: !477)
!480 = !DILocation(line: 95, column: 7, scope: !477)
!481 = !DILocation(line: 98, column: 7, scope: !477)
!482 = !DILocation(line: 102, column: 7, scope: !477)
!483 = !DILocation(line: 103, column: 7, scope: !477)
!484 = !DILocalVariable(name: "program", arg: 1, scope: !485, file: !75, line: 836, type: !68)
!485 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !75, file: !75, line: 836, type: !486, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !68}
!488 = !{!484, !489, !498, !499, !501, !502}
!489 = !DILocalVariable(name: "infomap", scope: !485, file: !75, line: 838, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 896, elements: !496)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !485, file: !75, line: 838, size: 128, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !492, file: !75, line: 838, baseType: !68, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !75, line: 838, baseType: !68, size: 64, offset: 64)
!496 = !{!497}
!497 = !DISubrange(count: 7)
!498 = !DILocalVariable(name: "node", scope: !485, file: !75, line: 848, type: !68)
!499 = !DILocalVariable(name: "map_prog", scope: !485, file: !75, line: 849, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!501 = !DILocalVariable(name: "lc_messages", scope: !485, file: !75, line: 861, type: !68)
!502 = !DILocalVariable(name: "url_program", scope: !485, file: !75, line: 874, type: !68)
!503 = !DILocation(line: 0, scope: !485, inlinedAt: !504)
!504 = distinct !DILocation(line: 104, column: 7, scope: !477)
!505 = !DILocation(line: 838, column: 3, scope: !485, inlinedAt: !504)
!506 = !DILocation(line: 838, column: 67, scope: !485, inlinedAt: !504)
!507 = !DILocation(line: 849, column: 36, scope: !485, inlinedAt: !504)
!508 = !DILocation(line: 851, column: 3, scope: !485, inlinedAt: !504)
!509 = !DILocalVariable(name: "__s1", arg: 1, scope: !510, file: !511, line: 1359, type: !68)
!510 = distinct !DISubprogram(name: "streq", scope: !511, file: !511, line: 1359, type: !512, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !514)
!511 = !DIFile(filename: "./lib/string.h", directory: "/src")
!512 = !DISubroutineType(types: !513)
!513 = !{!85, !68, !68}
!514 = !{!509, !515}
!515 = !DILocalVariable(name: "__s2", arg: 2, scope: !510, file: !511, line: 1359, type: !68)
!516 = !DILocation(line: 0, scope: !510, inlinedAt: !517)
!517 = distinct !DILocation(line: 851, column: 33, scope: !485, inlinedAt: !504)
!518 = !DILocation(line: 1361, column: 11, scope: !510, inlinedAt: !517)
!519 = !DILocation(line: 1361, column: 10, scope: !510, inlinedAt: !517)
!520 = !DILocation(line: 852, column: 13, scope: !485, inlinedAt: !504)
!521 = !DILocation(line: 851, column: 20, scope: !485, inlinedAt: !504)
!522 = !{!523, !473, i64 0}
!523 = !{!"infomap", !473, i64 0, !473, i64 8}
!524 = !DILocation(line: 851, column: 10, scope: !485, inlinedAt: !504)
!525 = !DILocation(line: 851, column: 28, scope: !485, inlinedAt: !504)
!526 = distinct !{!526, !508, !520, !527}
!527 = !{!"llvm.loop.mustprogress"}
!528 = !DILocation(line: 854, column: 17, scope: !529, inlinedAt: !504)
!529 = distinct !DILexicalBlock(scope: !485, file: !75, line: 854, column: 7)
!530 = !{!523, !473, i64 8}
!531 = !DILocation(line: 854, column: 7, scope: !529, inlinedAt: !504)
!532 = !DILocation(line: 854, column: 7, scope: !485, inlinedAt: !504)
!533 = !DILocation(line: 857, column: 3, scope: !485, inlinedAt: !504)
!534 = !DILocation(line: 861, column: 29, scope: !485, inlinedAt: !504)
!535 = !DILocation(line: 862, column: 7, scope: !536, inlinedAt: !504)
!536 = distinct !DILexicalBlock(scope: !485, file: !75, line: 862, column: 7)
!537 = !DILocation(line: 862, column: 19, scope: !536, inlinedAt: !504)
!538 = !DILocation(line: 862, column: 22, scope: !536, inlinedAt: !504)
!539 = !DILocation(line: 862, column: 7, scope: !485, inlinedAt: !504)
!540 = !DILocation(line: 868, column: 7, scope: !541, inlinedAt: !504)
!541 = distinct !DILexicalBlock(scope: !536, file: !75, line: 863, column: 5)
!542 = !DILocation(line: 870, column: 5, scope: !541, inlinedAt: !504)
!543 = !DILocation(line: 0, scope: !510, inlinedAt: !544)
!544 = distinct !DILocation(line: 874, column: 29, scope: !485, inlinedAt: !504)
!545 = !DILocation(line: 875, column: 3, scope: !485, inlinedAt: !504)
!546 = !DILocation(line: 877, column: 3, scope: !485, inlinedAt: !504)
!547 = !DILocation(line: 879, column: 1, scope: !485, inlinedAt: !504)
!548 = !DILocation(line: 106, column: 3, scope: !461)
!549 = !DISubprogram(name: "dcgettext", scope: !550, file: !550, line: 51, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!550 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!551 = !DISubroutineType(types: !552)
!552 = !{!60, !68, !68, !63}
!553 = !{}
!554 = !DISubprogram(name: "fputs_unlocked", scope: !195, file: !195, line: 691, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!555 = !DISubroutineType(types: !556)
!556 = !{!63, !557, !558}
!557 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!558 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !98)
!559 = !DILocation(line: 0, scope: !74)
!560 = !DILocation(line: 581, column: 7, scope: !83)
!561 = !{!562, !562, i64 0}
!562 = !{!"int", !474, i64 0}
!563 = !DILocation(line: 581, column: 19, scope: !83)
!564 = !DILocation(line: 581, column: 7, scope: !74)
!565 = !DILocation(line: 585, column: 26, scope: !82)
!566 = !DILocation(line: 0, scope: !82)
!567 = !DILocation(line: 586, column: 23, scope: !82)
!568 = !DILocation(line: 586, column: 28, scope: !82)
!569 = !DILocation(line: 586, column: 32, scope: !82)
!570 = !{!474, !474, i64 0}
!571 = !DILocation(line: 586, column: 38, scope: !82)
!572 = !DILocation(line: 0, scope: !510, inlinedAt: !573)
!573 = distinct !DILocation(line: 586, column: 41, scope: !82)
!574 = !DILocation(line: 1361, column: 11, scope: !510, inlinedAt: !573)
!575 = !DILocation(line: 1361, column: 10, scope: !510, inlinedAt: !573)
!576 = !DILocation(line: 586, column: 19, scope: !82)
!577 = !DILocation(line: 587, column: 5, scope: !82)
!578 = !DILocation(line: 588, column: 7, scope: !579)
!579 = distinct !DILexicalBlock(scope: !74, file: !75, line: 588, column: 7)
!580 = !DILocation(line: 588, column: 7, scope: !74)
!581 = !DILocation(line: 590, column: 7, scope: !582)
!582 = distinct !DILexicalBlock(scope: !579, file: !75, line: 589, column: 5)
!583 = !DILocation(line: 591, column: 7, scope: !582)
!584 = !DILocation(line: 595, column: 37, scope: !74)
!585 = !DILocation(line: 595, column: 35, scope: !74)
!586 = !DILocation(line: 596, column: 29, scope: !74)
!587 = !DILocation(line: 597, column: 8, scope: !91)
!588 = !DILocation(line: 597, column: 7, scope: !74)
!589 = !DILocation(line: 604, column: 24, scope: !90)
!590 = !DILocation(line: 604, column: 12, scope: !91)
!591 = !DILocation(line: 0, scope: !89)
!592 = !DILocation(line: 610, column: 16, scope: !89)
!593 = !DILocation(line: 610, column: 7, scope: !89)
!594 = !DILocation(line: 611, column: 21, scope: !89)
!595 = !{!596, !596, i64 0}
!596 = !{!"short", !474, i64 0}
!597 = !DILocation(line: 611, column: 19, scope: !89)
!598 = !DILocation(line: 611, column: 16, scope: !89)
!599 = !DILocation(line: 610, column: 30, scope: !89)
!600 = distinct !{!600, !593, !594, !527}
!601 = !DILocation(line: 612, column: 18, scope: !602)
!602 = distinct !DILexicalBlock(scope: !89, file: !75, line: 612, column: 11)
!603 = !DILocation(line: 612, column: 11, scope: !89)
!604 = !DILocation(line: 620, column: 23, scope: !74)
!605 = !DILocation(line: 625, column: 39, scope: !74)
!606 = !DILocation(line: 626, column: 3, scope: !74)
!607 = !DILocation(line: 626, column: 10, scope: !74)
!608 = !DILocation(line: 626, column: 21, scope: !74)
!609 = !DILocation(line: 628, column: 44, scope: !610)
!610 = distinct !DILexicalBlock(scope: !611, file: !75, line: 628, column: 11)
!611 = distinct !DILexicalBlock(scope: !74, file: !75, line: 627, column: 5)
!612 = !DILocation(line: 628, column: 32, scope: !610)
!613 = !DILocation(line: 628, column: 49, scope: !610)
!614 = !DILocation(line: 628, column: 11, scope: !611)
!615 = !DILocation(line: 630, column: 11, scope: !616)
!616 = distinct !DILexicalBlock(scope: !611, file: !75, line: 630, column: 11)
!617 = !DILocation(line: 630, column: 11, scope: !611)
!618 = !DILocation(line: 632, column: 26, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !75, line: 632, column: 15)
!620 = distinct !DILexicalBlock(scope: !616, file: !75, line: 631, column: 9)
!621 = !DILocation(line: 632, column: 34, scope: !619)
!622 = !DILocation(line: 632, column: 37, scope: !619)
!623 = !DILocation(line: 632, column: 15, scope: !620)
!624 = !DILocation(line: 636, column: 29, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !75, line: 636, column: 15)
!626 = !DILocation(line: 640, column: 16, scope: !611)
!627 = distinct !{!627, !606, !628, !527}
!628 = !DILocation(line: 641, column: 5, scope: !74)
!629 = !DILocation(line: 644, column: 3, scope: !74)
!630 = !DILocation(line: 0, scope: !510, inlinedAt: !631)
!631 = distinct !DILocation(line: 648, column: 31, scope: !74)
!632 = !DILocation(line: 0, scope: !510, inlinedAt: !633)
!633 = distinct !DILocation(line: 649, column: 31, scope: !74)
!634 = !DILocation(line: 0, scope: !510, inlinedAt: !635)
!635 = distinct !DILocation(line: 650, column: 31, scope: !74)
!636 = !DILocation(line: 0, scope: !510, inlinedAt: !637)
!637 = distinct !DILocation(line: 651, column: 31, scope: !74)
!638 = !DILocation(line: 0, scope: !510, inlinedAt: !639)
!639 = distinct !DILocation(line: 652, column: 31, scope: !74)
!640 = !DILocation(line: 0, scope: !510, inlinedAt: !641)
!641 = distinct !DILocation(line: 653, column: 31, scope: !74)
!642 = !DILocation(line: 0, scope: !510, inlinedAt: !643)
!643 = distinct !DILocation(line: 654, column: 31, scope: !74)
!644 = !DILocation(line: 0, scope: !510, inlinedAt: !645)
!645 = distinct !DILocation(line: 655, column: 31, scope: !74)
!646 = !DILocation(line: 0, scope: !510, inlinedAt: !647)
!647 = distinct !DILocation(line: 656, column: 31, scope: !74)
!648 = !DILocation(line: 0, scope: !510, inlinedAt: !649)
!649 = distinct !DILocation(line: 657, column: 31, scope: !74)
!650 = !DILocation(line: 663, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !74, file: !75, line: 663, column: 7)
!652 = !DILocation(line: 664, column: 7, scope: !651)
!653 = !DILocation(line: 664, column: 10, scope: !651)
!654 = !DILocation(line: 663, column: 7, scope: !74)
!655 = !DILocation(line: 669, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !651, file: !75, line: 665, column: 5)
!657 = !DILocation(line: 671, column: 5, scope: !656)
!658 = !DILocation(line: 676, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !651, file: !75, line: 673, column: 5)
!660 = !DILocation(line: 679, column: 3, scope: !74)
!661 = !DILocation(line: 683, column: 3, scope: !74)
!662 = !DILocation(line: 686, column: 3, scope: !74)
!663 = !DILocation(line: 688, column: 3, scope: !74)
!664 = !DILocation(line: 691, column: 3, scope: !74)
!665 = !DILocation(line: 695, column: 3, scope: !74)
!666 = !DILocation(line: 696, column: 1, scope: !74)
!667 = !DISubprogram(name: "setlocale", scope: !668, file: !668, line: 122, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!668 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!669 = !DISubroutineType(types: !670)
!670 = !{!60, !63, !68}
!671 = !DISubprogram(name: "getenv", scope: !672, file: !672, line: 641, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!672 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!673 = !DISubroutineType(types: !674)
!674 = !{!60, !68}
!675 = !DISubprogram(name: "fwrite_unlocked", scope: !195, file: !195, line: 704, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!676 = !DISubroutineType(types: !677)
!677 = !{!65, !678, !65, !65, !558}
!678 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!681 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 110, type: !682, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!63, !63, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!685 = !{!686, !687, !688, !689, !690, !691}
!686 = !DILocalVariable(name: "argc", arg: 1, scope: !681, file: !3, line: 110, type: !63)
!687 = !DILocalVariable(name: "argv", arg: 2, scope: !681, file: !3, line: 110, type: !684)
!688 = !DILocalVariable(name: "ok", scope: !681, file: !3, line: 112, type: !85)
!689 = !DILocalVariable(name: "check_basic_portability", scope: !681, file: !3, line: 113, type: !85)
!690 = !DILocalVariable(name: "check_extra_portability", scope: !681, file: !3, line: 114, type: !85)
!691 = !DILocalVariable(name: "optc", scope: !681, file: !3, line: 115, type: !63)
!692 = !DILocation(line: 0, scope: !681)
!693 = !DILocation(line: 118, column: 21, scope: !681)
!694 = !DILocation(line: 118, column: 3, scope: !681)
!695 = !DILocation(line: 119, column: 3, scope: !681)
!696 = !DILocation(line: 120, column: 3, scope: !681)
!697 = !DILocation(line: 121, column: 3, scope: !681)
!698 = !DILocation(line: 123, column: 3, scope: !681)
!699 = !DILocation(line: 125, column: 3, scope: !681)
!700 = !DILocation(line: 125, column: 18, scope: !681)
!701 = distinct !{!701, !699, !702, !527}
!702 = !DILocation(line: 149, column: 5, scope: !681)
!703 = !DILocation(line: 136, column: 11, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 128, column: 9)
!705 = distinct !DILexicalBlock(scope: !681, file: !3, line: 126, column: 5)
!706 = !DILocation(line: 142, column: 9, scope: !704)
!707 = !DILocation(line: 144, column: 9, scope: !704)
!708 = !DILocation(line: 147, column: 11, scope: !704)
!709 = !DILocation(line: 151, column: 7, scope: !710)
!710 = distinct !DILexicalBlock(scope: !681, file: !3, line: 151, column: 7)
!711 = !DILocation(line: 151, column: 14, scope: !710)
!712 = !DILocation(line: 151, column: 7, scope: !681)
!713 = !DILocation(line: 157, column: 17, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !3, line: 157, column: 3)
!715 = distinct !DILexicalBlock(scope: !681, file: !3, line: 157, column: 3)
!716 = !DILocation(line: 157, column: 3, scope: !715)
!717 = !DILocation(line: 153, column: 7, scope: !718)
!718 = distinct !DILexicalBlock(scope: !710, file: !3, line: 152, column: 5)
!719 = !DILocation(line: 154, column: 7, scope: !718)
!720 = !DILocation(line: 158, column: 31, scope: !714)
!721 = !DILocalVariable(name: "file", arg: 1, scope: !722, file: !3, line: 253, type: !60)
!722 = distinct !DISubprogram(name: "validate_file_name", scope: !3, file: !3, line: 253, type: !723, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !725)
!723 = !DISubroutineType(types: !724)
!724 = !{!85, !60, !85, !85}
!725 = !{!721, !726, !727, !728, !729, !730, !731, !769, !772, !775, !776, !780, !783, !786, !787, !789, !792, !795, !796, !797}
!726 = !DILocalVariable(name: "check_basic_portability", arg: 2, scope: !722, file: !3, line: 253, type: !85)
!727 = !DILocalVariable(name: "check_extra_portability", arg: 3, scope: !722, file: !3, line: 254, type: !85)
!728 = !DILocalVariable(name: "filelen", scope: !722, file: !3, line: 256, type: !416)
!729 = !DILocalVariable(name: "check_component_lengths", scope: !722, file: !3, line: 259, type: !85)
!730 = !DILocalVariable(name: "file_exists", scope: !722, file: !3, line: 262, type: !85)
!731 = !DILocalVariable(name: "st", scope: !732, file: !3, line: 290, type: !734)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 284, column: 5)
!733 = distinct !DILexicalBlock(scope: !722, file: !3, line: 278, column: 7)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !735, line: 44, size: 1024, elements: !736)
!735 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!736 = !{!737, !739, !741, !743, !745, !747, !749, !750, !751, !752, !754, !755, !757, !765, !766, !767}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !734, file: !735, line: 46, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !125, line: 145, baseType: !67)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !734, file: !735, line: 47, baseType: !740, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !125, line: 148, baseType: !67)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !734, file: !735, line: 48, baseType: !742, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !125, line: 150, baseType: !7)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !734, file: !735, line: 49, baseType: !744, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !125, line: 151, baseType: !7)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !734, file: !735, line: 50, baseType: !746, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !125, line: 146, baseType: !7)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !734, file: !735, line: 51, baseType: !748, size: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !125, line: 147, baseType: !7)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !734, file: !735, line: 52, baseType: !738, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !734, file: !735, line: 53, baseType: !738, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !734, file: !735, line: 54, baseType: !124, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !734, file: !735, line: 55, baseType: !753, size: 32, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !125, line: 175, baseType: !63)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !734, file: !735, line: 56, baseType: !63, size: 32, offset: 480)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !734, file: !735, line: 57, baseType: !756, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !125, line: 180, baseType: !126)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !734, file: !735, line: 65, baseType: !758, size: 128, offset: 576)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !759, line: 11, size: 128, elements: !760)
!759 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!760 = !{!761, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !758, file: !759, line: 16, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !125, line: 160, baseType: !126)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !758, file: !759, line: 21, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !125, line: 197, baseType: !126)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !734, file: !735, line: 66, baseType: !758, size: 128, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !734, file: !735, line: 67, baseType: !758, size: 128, offset: 832)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !734, file: !735, line: 79, baseType: !768, size: 64, offset: 960)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 64, elements: !278)
!769 = !DILocalVariable(name: "maxsize", scope: !770, file: !3, line: 303, type: !416)
!770 = distinct !DILexicalBlock(scope: !771, file: !3, line: 302, column: 5)
!771 = distinct !DILexicalBlock(scope: !722, file: !3, line: 300, column: 7)
!772 = !DILocalVariable(name: "size", scope: !773, file: !3, line: 309, type: !126)
!773 = distinct !DILexicalBlock(scope: !774, file: !3, line: 308, column: 9)
!774 = distinct !DILexicalBlock(scope: !770, file: !3, line: 305, column: 11)
!775 = !DILocalVariable(name: "dir", scope: !773, file: !3, line: 310, type: !68)
!776 = !DILocalVariable(name: "start", scope: !777, file: !3, line: 339, type: !60)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 339, column: 7)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 338, column: 5)
!779 = distinct !DILexicalBlock(scope: !722, file: !3, line: 337, column: 7)
!780 = !DILocalVariable(name: "length", scope: !781, file: !3, line: 341, type: !65)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 340, column: 9)
!782 = distinct !DILexicalBlock(scope: !777, file: !3, line: 339, column: 7)
!783 = !DILocalVariable(name: "name_max", scope: !784, file: !3, line: 359, type: !416)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 354, column: 5)
!785 = distinct !DILexicalBlock(scope: !722, file: !3, line: 353, column: 7)
!786 = !DILocalVariable(name: "known_name_max", scope: !784, file: !3, line: 362, type: !416)
!787 = !DILocalVariable(name: "start", scope: !788, file: !3, line: 364, type: !60)
!788 = distinct !DILexicalBlock(scope: !784, file: !3, line: 364, column: 7)
!789 = !DILocalVariable(name: "length", scope: !790, file: !3, line: 366, type: !416)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 365, column: 9)
!791 = distinct !DILexicalBlock(scope: !788, file: !3, line: 364, column: 7)
!792 = !DILocalVariable(name: "len", scope: !793, file: !3, line: 372, type: !126)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 371, column: 13)
!794 = distinct !DILexicalBlock(scope: !790, file: !3, line: 368, column: 15)
!795 = !DILocalVariable(name: "dir", scope: !793, file: !3, line: 373, type: !68)
!796 = !DILocalVariable(name: "c", scope: !793, file: !3, line: 374, type: !61)
!797 = !DILocalVariable(name: "c", scope: !798, file: !3, line: 406, type: !61)
!798 = distinct !DILexicalBlock(scope: !799, file: !3, line: 405, column: 13)
!799 = distinct !DILexicalBlock(scope: !790, file: !3, line: 404, column: 15)
!800 = !DILocation(line: 0, scope: !722, inlinedAt: !801)
!801 = distinct !DILocation(line: 158, column: 11, scope: !714)
!802 = !DILocation(line: 256, column: 19, scope: !722, inlinedAt: !801)
!803 = !DILocation(line: 264, column: 31, scope: !804, inlinedAt: !801)
!804 = distinct !DILexicalBlock(scope: !722, file: !3, line: 264, column: 7)
!805 = !DILocalVariable(name: "file", arg: 1, scope: !806, file: !3, line: 168, type: !68)
!806 = distinct !DISubprogram(name: "no_leading_hyphen", scope: !3, file: !3, line: 168, type: !807, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{!85, !68}
!809 = !{!805, !810}
!810 = !DILocalVariable(name: "p", scope: !811, file: !3, line: 170, type: !68)
!811 = distinct !DILexicalBlock(scope: !806, file: !3, line: 170, column: 3)
!812 = !DILocation(line: 0, scope: !806, inlinedAt: !813)
!813 = distinct !DILocation(line: 264, column: 36, scope: !804, inlinedAt: !801)
!814 = !DILocation(line: 0, scope: !811, inlinedAt: !813)
!815 = !DILocation(line: 170, column: 36, scope: !816, inlinedAt: !813)
!816 = distinct !DILexicalBlock(scope: !811, file: !3, line: 170, column: 3)
!817 = !DILocation(line: 170, column: 3, scope: !811, inlinedAt: !813)
!818 = !DILocation(line: 170, column: 56, scope: !816, inlinedAt: !813)
!819 = distinct !{!819, !817, !820, !527}
!820 = !DILocation(line: 176, column: 7, scope: !811, inlinedAt: !813)
!821 = !DILocation(line: 171, column: 11, scope: !822, inlinedAt: !813)
!822 = distinct !DILexicalBlock(scope: !816, file: !3, line: 171, column: 9)
!823 = !DILocation(line: 171, column: 19, scope: !822, inlinedAt: !813)
!824 = !DILocation(line: 171, column: 22, scope: !822, inlinedAt: !813)
!825 = !DILocation(line: 171, column: 28, scope: !822, inlinedAt: !813)
!826 = !DILocation(line: 171, column: 9, scope: !816, inlinedAt: !813)
!827 = !DILocation(line: 173, column: 9, scope: !828, inlinedAt: !813)
!828 = distinct !DILexicalBlock(scope: !822, file: !3, line: 172, column: 7)
!829 = !DILocation(line: 264, column: 7, scope: !722, inlinedAt: !801)
!830 = !DILocation(line: 267, column: 32, scope: !831, inlinedAt: !801)
!831 = distinct !DILexicalBlock(scope: !722, file: !3, line: 267, column: 7)
!832 = !DILocation(line: 268, column: 7, scope: !831, inlinedAt: !801)
!833 = !DILocation(line: 267, column: 7, scope: !722, inlinedAt: !801)
!834 = !DILocation(line: 274, column: 7, scope: !835, inlinedAt: !801)
!835 = distinct !DILexicalBlock(scope: !831, file: !3, line: 269, column: 5)
!836 = !DILocation(line: 275, column: 7, scope: !835, inlinedAt: !801)
!837 = !DILocalVariable(name: "file", arg: 1, scope: !838, file: !3, line: 185, type: !68)
!838 = distinct !DISubprogram(name: "portable_chars_only", scope: !3, file: !3, line: 185, type: !839, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !841)
!839 = !DISubroutineType(types: !840)
!840 = !{!85, !68, !65}
!841 = !{!837, !842, !843, !844, !845, !858}
!842 = !DILocalVariable(name: "filelen", arg: 2, scope: !838, file: !3, line: 185, type: !65)
!843 = !DILocalVariable(name: "validlen", scope: !838, file: !3, line: 187, type: !65)
!844 = !DILocalVariable(name: "invalid", scope: !838, file: !3, line: 192, type: !68)
!845 = !DILocalVariable(name: "mbstate", scope: !846, file: !3, line: 196, type: !848)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 195, column: 5)
!847 = distinct !DILexicalBlock(scope: !838, file: !3, line: 194, column: 7)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !231, line: 6, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !233, line: 21, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 13, size: 64, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !850, file: !233, line: 15, baseType: !63, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !850, file: !233, line: 20, baseType: !854, size: 32, offset: 32)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !850, file: !233, line: 16, size: 32, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !854, file: !233, line: 18, baseType: !7, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !854, file: !233, line: 19, baseType: !242, size: 32)
!858 = !DILocalVariable(name: "charlen", scope: !846, file: !3, line: 197, type: !65)
!859 = !DILocation(line: 0, scope: !838, inlinedAt: !860)
!860 = distinct !DILocation(line: 280, column: 13, scope: !861, inlinedAt: !801)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 280, column: 11)
!862 = distinct !DILexicalBlock(scope: !733, file: !3, line: 279, column: 5)
!863 = !DILocation(line: 187, column: 21, scope: !838, inlinedAt: !860)
!864 = !DILocation(line: 192, column: 30, scope: !838, inlinedAt: !860)
!865 = !DILocation(line: 194, column: 7, scope: !847, inlinedAt: !860)
!866 = !DILocation(line: 194, column: 7, scope: !838, inlinedAt: !860)
!867 = !DILocation(line: 196, column: 7, scope: !846, inlinedAt: !860)
!868 = !DILocation(line: 196, column: 17, scope: !846, inlinedAt: !860)
!869 = !DILocalVariable(name: "ps", arg: 1, scope: !870, file: !871, line: 1135, type: !874)
!870 = distinct !DISubprogram(name: "mbszero", scope: !871, file: !871, line: 1135, type: !872, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!871 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!872 = !DISubroutineType(types: !873)
!873 = !{null, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!875 = !{!869}
!876 = !DILocation(line: 0, scope: !870, inlinedAt: !877)
!877 = distinct !DILocation(line: 196, column: 26, scope: !846, inlinedAt: !860)
!878 = !DILocalVariable(name: "__dest", arg: 1, scope: !879, file: !880, line: 57, type: !62)
!879 = distinct !DISubprogram(name: "memset", scope: !880, file: !880, line: 57, type: !881, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !883)
!880 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!881 = !DISubroutineType(types: !882)
!882 = !{!62, !62, !63, !65}
!883 = !{!878, !884, !885}
!884 = !DILocalVariable(name: "__ch", arg: 2, scope: !879, file: !880, line: 57, type: !63)
!885 = !DILocalVariable(name: "__len", arg: 3, scope: !879, file: !880, line: 57, type: !65)
!886 = !DILocation(line: 0, scope: !879, inlinedAt: !887)
!887 = distinct !DILocation(line: 1137, column: 3, scope: !870, inlinedAt: !877)
!888 = !DILocation(line: 59, column: 10, scope: !879, inlinedAt: !887)
!889 = !DILocation(line: 197, column: 49, scope: !846, inlinedAt: !860)
!890 = !DILocation(line: 197, column: 24, scope: !846, inlinedAt: !860)
!891 = !DILocation(line: 0, scope: !846, inlinedAt: !860)
!892 = !DILocation(line: 198, column: 7, scope: !846, inlinedAt: !860)
!893 = !DILocation(line: 204, column: 5, scope: !847, inlinedAt: !860)
!894 = !DILocation(line: 280, column: 11, scope: !862, inlinedAt: !801)
!895 = !DILocation(line: 290, column: 7, scope: !732, inlinedAt: !801)
!896 = !DILocation(line: 290, column: 19, scope: !732, inlinedAt: !801)
!897 = !DILocation(line: 291, column: 11, scope: !898, inlinedAt: !801)
!898 = distinct !DILexicalBlock(scope: !732, file: !3, line: 291, column: 11)
!899 = !DILocation(line: 291, column: 29, scope: !898, inlinedAt: !801)
!900 = !DILocation(line: 291, column: 11, scope: !732, inlinedAt: !801)
!901 = !DILocation(line: 298, column: 5, scope: !733, inlinedAt: !801)
!902 = !DILocation(line: 353, column: 7, scope: !722, inlinedAt: !801)
!903 = !DILocation(line: 293, column: 16, scope: !904, inlinedAt: !801)
!904 = distinct !DILexicalBlock(scope: !898, file: !3, line: 293, column: 16)
!905 = !DILocation(line: 293, column: 22, scope: !904, inlinedAt: !801)
!906 = !DILocation(line: 293, column: 32, scope: !904, inlinedAt: !801)
!907 = !DILocation(line: 295, column: 11, scope: !908, inlinedAt: !801)
!908 = distinct !DILexicalBlock(scope: !904, file: !3, line: 294, column: 9)
!909 = !DILocation(line: 301, column: 25, scope: !771, inlinedAt: !801)
!910 = !DILocation(line: 310, column: 30, scope: !773, inlinedAt: !801)
!911 = !DILocation(line: 310, column: 36, scope: !773, inlinedAt: !801)
!912 = !DILocation(line: 0, scope: !773, inlinedAt: !801)
!913 = !DILocation(line: 311, column: 17, scope: !773, inlinedAt: !801)
!914 = !DILocation(line: 312, column: 18, scope: !773, inlinedAt: !801)
!915 = !DILocation(line: 313, column: 20, scope: !916, inlinedAt: !801)
!916 = distinct !DILexicalBlock(scope: !773, file: !3, line: 313, column: 15)
!917 = !DILocation(line: 313, column: 24, scope: !916, inlinedAt: !801)
!918 = !DILocation(line: 313, column: 27, scope: !916, inlinedAt: !801)
!919 = !DILocation(line: 313, column: 33, scope: !916, inlinedAt: !801)
!920 = !DILocation(line: 313, column: 15, scope: !773, inlinedAt: !801)
!921 = !DILocation(line: 315, column: 15, scope: !922, inlinedAt: !801)
!922 = distinct !DILexicalBlock(scope: !916, file: !3, line: 314, column: 13)
!923 = !DILocation(line: 0, scope: !770, inlinedAt: !801)
!924 = !DILocation(line: 323, column: 19, scope: !925, inlinedAt: !801)
!925 = distinct !DILexicalBlock(scope: !770, file: !3, line: 323, column: 11)
!926 = !DILocation(line: 323, column: 11, scope: !770, inlinedAt: !801)
!927 = !DILocation(line: 215, column: 3, scope: !928, inlinedAt: !933)
!928 = distinct !DISubprogram(name: "component_start", scope: !3, file: !3, line: 213, type: !929, scopeLine: 214, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !931)
!929 = !DISubroutineType(types: !930)
!930 = !{!60, !60}
!931 = !{!932}
!932 = !DILocalVariable(name: "f", arg: 1, scope: !928, file: !3, line: 213, type: !60)
!933 = distinct !DILocation(line: 339, column: 42, scope: !782, inlinedAt: !801)
!934 = !DILocation(line: 325, column: 11, scope: !935, inlinedAt: !801)
!935 = distinct !DILexicalBlock(scope: !925, file: !3, line: 324, column: 9)
!936 = !DILocation(line: 0, scope: !928, inlinedAt: !933)
!937 = !DILocation(line: 215, column: 10, scope: !928, inlinedAt: !933)
!938 = !DILocation(line: 216, column: 6, scope: !928, inlinedAt: !933)
!939 = distinct !{!939, !940, !941, !527}
!940 = !DILocation(line: 339, column: 7, scope: !777, inlinedAt: !801)
!941 = !DILocation(line: 350, column: 9, scope: !777, inlinedAt: !801)
!942 = !DILocation(line: 0, scope: !943, inlinedAt: !950)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 227, column: 3)
!944 = distinct !DISubprogram(name: "component_len", scope: !3, file: !3, line: 224, type: !945, scopeLine: 225, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{!65, !68}
!947 = !{!948, !949}
!948 = !DILocalVariable(name: "f", arg: 1, scope: !944, file: !3, line: 224, type: !68)
!949 = !DILocalVariable(name: "len", scope: !944, file: !3, line: 226, type: !65)
!950 = distinct !DILocation(line: 341, column: 27, scope: !781, inlinedAt: !801)
!951 = !DILocation(line: 0, scope: !944, inlinedAt: !950)
!952 = !DILocation(line: 227, column: 17, scope: !953, inlinedAt: !950)
!953 = distinct !DILexicalBlock(scope: !943, file: !3, line: 227, column: 3)
!954 = !DILocation(line: 227, column: 31, scope: !953, inlinedAt: !950)
!955 = !DILocation(line: 227, column: 45, scope: !953, inlinedAt: !950)
!956 = !DILocation(line: 227, column: 3, scope: !953, inlinedAt: !950)
!957 = distinct !{!957, !958, !959, !527}
!958 = !DILocation(line: 227, column: 3, scope: !943, inlinedAt: !950)
!959 = !DILocation(line: 228, column: 5, scope: !943, inlinedAt: !950)
!960 = !DILocation(line: 0, scope: !781, inlinedAt: !801)
!961 = !DILocation(line: 343, column: 32, scope: !962, inlinedAt: !801)
!962 = distinct !DILexicalBlock(scope: !781, file: !3, line: 343, column: 15)
!963 = !DILocation(line: 0, scope: !777, inlinedAt: !801)
!964 = !DILocation(line: 364, column: 7, scope: !788, inlinedAt: !801)
!965 = !DILocation(line: 0, scope: !784, inlinedAt: !801)
!966 = !DILocation(line: 362, column: 13, scope: !784, inlinedAt: !801)
!967 = !DILocation(line: 0, scope: !788, inlinedAt: !801)
!968 = !DILocation(line: 0, scope: !928, inlinedAt: !969)
!969 = distinct !DILocation(line: 364, column: 42, scope: !791, inlinedAt: !801)
!970 = !DILocation(line: 215, column: 3, scope: !928, inlinedAt: !969)
!971 = !DILocation(line: 215, column: 10, scope: !928, inlinedAt: !969)
!972 = !DILocation(line: 216, column: 6, scope: !928, inlinedAt: !969)
!973 = !DILocation(line: 368, column: 15, scope: !794, inlinedAt: !801)
!974 = !DILocation(line: 368, column: 15, scope: !790, inlinedAt: !801)
!975 = !DILocation(line: 373, column: 40, scope: !793, inlinedAt: !801)
!976 = !DILocation(line: 373, column: 34, scope: !793, inlinedAt: !801)
!977 = !DILocation(line: 0, scope: !793, inlinedAt: !801)
!978 = !DILocation(line: 375, column: 15, scope: !793, inlinedAt: !801)
!979 = !DILocation(line: 375, column: 21, scope: !793, inlinedAt: !801)
!980 = !DILocation(line: 376, column: 22, scope: !793, inlinedAt: !801)
!981 = !DILocation(line: 377, column: 21, scope: !793, inlinedAt: !801)
!982 = !DILocation(line: 378, column: 22, scope: !793, inlinedAt: !801)
!983 = !DILocation(line: 379, column: 21, scope: !984, inlinedAt: !801)
!984 = distinct !DILexicalBlock(scope: !793, file: !3, line: 379, column: 19)
!985 = !DILocation(line: 379, column: 19, scope: !793, inlinedAt: !801)
!986 = !DILocation(line: 382, column: 25, scope: !984, inlinedAt: !801)
!987 = !DILocation(line: 382, column: 17, scope: !984, inlinedAt: !801)
!988 = !DILocation(line: 392, column: 21, scope: !989, inlinedAt: !801)
!989 = distinct !DILexicalBlock(scope: !984, file: !3, line: 383, column: 19)
!990 = !DILocation(line: 395, column: 28, scope: !989, inlinedAt: !801)
!991 = !DILocation(line: 396, column: 21, scope: !989, inlinedAt: !801)
!992 = !DILocation(line: 397, column: 28, scope: !989, inlinedAt: !801)
!993 = !DILocation(line: 0, scope: !794, inlinedAt: !801)
!994 = !DILocation(line: 0, scope: !944, inlinedAt: !995)
!995 = distinct !DILocation(line: 402, column: 20, scope: !790, inlinedAt: !801)
!996 = !DILocation(line: 227, column: 8, scope: !943, inlinedAt: !995)
!997 = !DILocation(line: 0, scope: !943, inlinedAt: !995)
!998 = !DILocation(line: 227, column: 17, scope: !953, inlinedAt: !995)
!999 = !DILocation(line: 227, column: 31, scope: !953, inlinedAt: !995)
!1000 = !DILocation(line: 227, column: 45, scope: !953, inlinedAt: !995)
!1001 = !DILocation(line: 227, column: 3, scope: !953, inlinedAt: !995)
!1002 = distinct !{!1002, !1003, !1004, !527}
!1003 = !DILocation(line: 227, column: 3, scope: !943, inlinedAt: !995)
!1004 = !DILocation(line: 228, column: 5, scope: !943, inlinedAt: !995)
!1005 = !DILocation(line: 0, scope: !790, inlinedAt: !801)
!1006 = !DILocation(line: 404, column: 24, scope: !799, inlinedAt: !801)
!1007 = !DILocation(line: 404, column: 15, scope: !790, inlinedAt: !801)
!1008 = distinct !{!1008, !964, !1009, !527}
!1009 = !DILocation(line: 417, column: 9, scope: !788, inlinedAt: !801)
!1010 = !DILocation(line: 0, scope: !798, inlinedAt: !801)
!1011 = !DILocation(line: 407, column: 29, scope: !798, inlinedAt: !801)
!1012 = !DILocation(line: 408, column: 15, scope: !798, inlinedAt: !801)
!1013 = !DILocation(line: 412, column: 29, scope: !798, inlinedAt: !801)
!1014 = !DILocation(line: 158, column: 8, scope: !714)
!1015 = !DILocation(line: 157, column: 25, scope: !714)
!1016 = distinct !{!1016, !716, !1017, !527}
!1017 = !DILocation(line: 159, column: 79, scope: !715)
!1018 = !DILocation(line: 161, column: 10, scope: !681)
!1019 = !DILocation(line: 162, column: 1, scope: !681)
!1020 = !DISubprogram(name: "bindtextdomain", scope: !550, file: !550, line: 86, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!60, !68, !68}
!1023 = !DISubprogram(name: "textdomain", scope: !550, file: !550, line: 82, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1024 = !DISubprogram(name: "atexit", scope: !672, file: !672, line: 602, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!63, !221}
!1027 = !DISubprogram(name: "getopt_long", scope: !162, file: !162, line: 66, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!63, !63, !1030, !68, !1032, !167}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!1033 = !DISubprogram(name: "lstat", scope: !1034, file: !1034, line: 313, type: !1035, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1034 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!63, !557, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!1039 = !DISubprogram(name: "pathconf", scope: !1040, file: !1040, line: 633, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !553)
!1040 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!126, !68, !63}
!1043 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !179, file: !179, line: 50, type: !486, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !178, retainedNodes: !1044)
!1044 = !{!1045}
!1045 = !DILocalVariable(name: "file", arg: 1, scope: !1043, file: !179, line: 50, type: !68)
!1046 = !DILocation(line: 0, scope: !1043)
!1047 = !DILocation(line: 52, column: 13, scope: !1043)
!1048 = !DILocation(line: 53, column: 1, scope: !1043)
!1049 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !179, file: !179, line: 87, type: !1050, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !178, retainedNodes: !1052)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{null, !85}
!1052 = !{!1053}
!1053 = !DILocalVariable(name: "ignore", arg: 1, scope: !1049, file: !179, line: 87, type: !85)
!1054 = !DILocation(line: 0, scope: !1049)
!1055 = !DILocation(line: 89, column: 16, scope: !1049)
!1056 = !{!1057, !1057, i64 0}
!1057 = !{!"_Bool", !474, i64 0}
!1058 = !DILocation(line: 90, column: 1, scope: !1049)
!1059 = distinct !DISubprogram(name: "close_stdout", scope: !179, file: !179, line: 116, type: !222, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !178, retainedNodes: !1060)
!1060 = !{!1061}
!1061 = !DILocalVariable(name: "write_error", scope: !1062, file: !179, line: 121, type: !68)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !179, line: 120, column: 5)
!1063 = distinct !DILexicalBlock(scope: !1059, file: !179, line: 118, column: 7)
!1064 = !DILocation(line: 118, column: 21, scope: !1063)
!1065 = !DILocation(line: 118, column: 7, scope: !1063)
!1066 = !DILocation(line: 118, column: 29, scope: !1063)
!1067 = !DILocation(line: 119, column: 7, scope: !1063)
!1068 = !DILocation(line: 119, column: 12, scope: !1063)
!1069 = !{i8 0, i8 2}
!1070 = !DILocation(line: 119, column: 25, scope: !1063)
!1071 = !DILocation(line: 119, column: 28, scope: !1063)
!1072 = !DILocation(line: 119, column: 34, scope: !1063)
!1073 = !DILocation(line: 118, column: 7, scope: !1059)
!1074 = !DILocation(line: 121, column: 33, scope: !1062)
!1075 = !DILocation(line: 0, scope: !1062)
!1076 = !DILocation(line: 122, column: 11, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1062, file: !179, line: 122, column: 11)
!1078 = !DILocation(line: 0, scope: !1077)
!1079 = !DILocation(line: 122, column: 11, scope: !1062)
!1080 = !DILocation(line: 123, column: 9, scope: !1077)
!1081 = !DILocation(line: 126, column: 9, scope: !1077)
!1082 = !DILocation(line: 128, column: 14, scope: !1062)
!1083 = !DILocation(line: 128, column: 7, scope: !1062)
!1084 = !DILocation(line: 133, column: 42, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1059, file: !179, line: 133, column: 7)
!1086 = !DILocation(line: 133, column: 28, scope: !1085)
!1087 = !DILocation(line: 133, column: 50, scope: !1085)
!1088 = !DILocation(line: 133, column: 7, scope: !1059)
!1089 = !DILocation(line: 134, column: 12, scope: !1085)
!1090 = !DILocation(line: 134, column: 5, scope: !1085)
!1091 = !DILocation(line: 135, column: 1, scope: !1059)
!1092 = distinct !DISubprogram(name: "verror", scope: !186, file: !186, line: 251, type: !1093, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !63, !63, !68, !194}
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DILocalVariable(name: "status", arg: 1, scope: !1092, file: !186, line: 251, type: !63)
!1097 = !DILocalVariable(name: "errnum", arg: 2, scope: !1092, file: !186, line: 251, type: !63)
!1098 = !DILocalVariable(name: "message", arg: 3, scope: !1092, file: !186, line: 251, type: !68)
!1099 = !DILocalVariable(name: "args", arg: 4, scope: !1092, file: !186, line: 251, type: !194)
!1100 = !DILocation(line: 0, scope: !1092)
!1101 = !DILocation(line: 251, column: 1, scope: !1092)
!1102 = !DILocation(line: 261, column: 3, scope: !1092)
!1103 = !DILocation(line: 265, column: 7, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1092, file: !186, line: 265, column: 7)
!1105 = !DILocation(line: 265, column: 7, scope: !1092)
!1106 = !DILocation(line: 266, column: 5, scope: !1104)
!1107 = !DILocation(line: 272, column: 7, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1104, file: !186, line: 268, column: 5)
!1109 = !DILocation(line: 276, column: 3, scope: !1092)
!1110 = !{i64 0, i64 8, !472, i64 8, i64 8, !472, i64 16, i64 8, !472, i64 24, i64 4, !561, i64 28, i64 4, !561}
!1111 = !DILocation(line: 282, column: 1, scope: !1092)
!1112 = distinct !DISubprogram(name: "flush_stdout", scope: !186, file: !186, line: 163, type: !222, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !1113)
!1113 = !{!1114}
!1114 = !DILocalVariable(name: "stdout_fd", scope: !1112, file: !186, line: 166, type: !63)
!1115 = !DILocation(line: 0, scope: !1112)
!1116 = !DILocalVariable(name: "fd", arg: 1, scope: !1117, file: !186, line: 145, type: !63)
!1117 = distinct !DISubprogram(name: "is_open", scope: !186, file: !186, line: 145, type: !1118, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!63, !63}
!1120 = !{!1116}
!1121 = !DILocation(line: 0, scope: !1117, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 182, column: 25, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1112, file: !186, line: 182, column: 7)
!1124 = !DILocation(line: 157, column: 15, scope: !1117, inlinedAt: !1122)
!1125 = !DILocation(line: 182, column: 25, scope: !1123)
!1126 = !DILocation(line: 182, column: 7, scope: !1112)
!1127 = !DILocation(line: 184, column: 5, scope: !1123)
!1128 = !DILocation(line: 185, column: 1, scope: !1112)
!1129 = distinct !DISubprogram(name: "error_tail", scope: !186, file: !186, line: 219, type: !1093, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !1130)
!1130 = !{!1131, !1132, !1133, !1134}
!1131 = !DILocalVariable(name: "status", arg: 1, scope: !1129, file: !186, line: 219, type: !63)
!1132 = !DILocalVariable(name: "errnum", arg: 2, scope: !1129, file: !186, line: 219, type: !63)
!1133 = !DILocalVariable(name: "message", arg: 3, scope: !1129, file: !186, line: 219, type: !68)
!1134 = !DILocalVariable(name: "args", arg: 4, scope: !1129, file: !186, line: 219, type: !194)
!1135 = !DILocation(line: 0, scope: !1129)
!1136 = !DILocation(line: 219, column: 1, scope: !1129)
!1137 = !DILocation(line: 229, column: 13, scope: !1129)
!1138 = !DILocation(line: 229, column: 3, scope: !1129)
!1139 = !DILocalVariable(name: "__stream", arg: 1, scope: !1140, file: !1141, line: 132, type: !1144)
!1140 = distinct !DISubprogram(name: "vfprintf", scope: !1141, file: !1141, line: 132, type: !1142, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !185, retainedNodes: !1179)
!1141 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!63, !1144, !557, !196}
!1144 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !100, line: 7, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !102, line: 49, size: 1728, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1147, file: !102, line: 51, baseType: !63, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1147, file: !102, line: 54, baseType: !60, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1147, file: !102, line: 55, baseType: !60, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1147, file: !102, line: 56, baseType: !60, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1147, file: !102, line: 57, baseType: !60, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1147, file: !102, line: 58, baseType: !60, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1147, file: !102, line: 59, baseType: !60, size: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1147, file: !102, line: 60, baseType: !60, size: 64, offset: 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1147, file: !102, line: 61, baseType: !60, size: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1147, file: !102, line: 64, baseType: !60, size: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1147, file: !102, line: 65, baseType: !60, size: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1147, file: !102, line: 66, baseType: !60, size: 64, offset: 704)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1147, file: !102, line: 68, baseType: !117, size: 64, offset: 768)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1147, file: !102, line: 70, baseType: !1163, size: 64, offset: 832)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1147, file: !102, line: 72, baseType: !63, size: 32, offset: 896)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1147, file: !102, line: 73, baseType: !63, size: 32, offset: 928)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1147, file: !102, line: 74, baseType: !124, size: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1147, file: !102, line: 77, baseType: !64, size: 16, offset: 1024)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1147, file: !102, line: 78, baseType: !129, size: 8, offset: 1040)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1147, file: !102, line: 79, baseType: !131, size: 8, offset: 1048)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1147, file: !102, line: 81, baseType: !135, size: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1147, file: !102, line: 89, baseType: !138, size: 64, offset: 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1147, file: !102, line: 91, baseType: !140, size: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1147, file: !102, line: 92, baseType: !143, size: 64, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1147, file: !102, line: 93, baseType: !1163, size: 64, offset: 1344)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1147, file: !102, line: 94, baseType: !62, size: 64, offset: 1408)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1147, file: !102, line: 95, baseType: !65, size: 64, offset: 1472)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1147, file: !102, line: 96, baseType: !63, size: 32, offset: 1536)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1147, file: !102, line: 98, baseType: !150, size: 160, offset: 1568)
!1179 = !{!1139, !1180, !1181}
!1180 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1140, file: !1141, line: 133, type: !557)
!1181 = !DILocalVariable(name: "__ap", arg: 3, scope: !1140, file: !1141, line: 133, type: !196)
!1182 = !DILocation(line: 0, scope: !1140, inlinedAt: !1183)
!1183 = distinct !DILocation(line: 229, column: 3, scope: !1129)
!1184 = !DILocation(line: 135, column: 10, scope: !1140, inlinedAt: !1183)
!1185 = !{!1186, !1188}
!1186 = distinct !{!1186, !1187, !"vfprintf.inline: argument 0"}
!1187 = distinct !{!1187, !"vfprintf.inline"}
!1188 = distinct !{!1188, !1187, !"vfprintf.inline: argument 1"}
!1189 = !DILocation(line: 232, column: 3, scope: !1129)
!1190 = !DILocation(line: 233, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1129, file: !186, line: 233, column: 7)
!1192 = !DILocation(line: 233, column: 7, scope: !1129)
!1193 = !DILocalVariable(name: "errnum", arg: 1, scope: !1194, file: !186, line: 188, type: !63)
