; ModuleID = 'src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { i8*, i8*, i8*, i8*, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

!32 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!33 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!34 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!35 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!36 = !DIEnumerator(name: "c_quoting_style", value: 5)
!37 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!38 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!39 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!40 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!41 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 110, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!44 = !{!45}
!45 = !DIEnumerator(name: "O_PATHSEARCH", value: 2097152)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 44, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!48 = !{!49, !50, !51, !52, !53, !54}
!49 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!50 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!51 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!52 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!53 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!54 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!55 = !{!56, !58, !59, !60, !61, !64, !66, !67, !68, !63}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!63 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!66 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!69 = !{!70, !72, !0, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !275, !292, !297}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 68, type: !67, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !74, file: !43, line: 575, type: !59, isLocal: true, isDefinition: true)
!74 = distinct !DISubprogram(name: "oputs_", scope: !43, file: !43, line: 573, type: !75, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !77)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !64, !64}
!77 = !{!78, !79, !80, !83, !84, !85, !86, !90, !91, !92, !93, !95, !150, !151, !152, !154, !155}
!78 = !DILocalVariable(name: "program", arg: 1, scope: !74, file: !43, line: 573, type: !64)
!79 = !DILocalVariable(name: "option", arg: 2, scope: !74, file: !43, line: 573, type: !64)
!80 = !DILocalVariable(name: "term", scope: !81, file: !43, line: 585, type: !64)
!81 = distinct !DILexicalBlock(scope: !82, file: !43, line: 582, column: 5)
!82 = distinct !DILexicalBlock(scope: !74, file: !43, line: 581, column: 7)
!83 = !DILocalVariable(name: "double_space", scope: !74, file: !43, line: 594, type: !67)
!84 = !DILocalVariable(name: "first_word", scope: !74, file: !43, line: 595, type: !64)
!85 = !DILocalVariable(name: "option_text", scope: !74, file: !43, line: 596, type: !64)
!86 = !DILocalVariable(name: "s", scope: !87, file: !43, line: 608, type: !64)
!87 = distinct !DILexicalBlock(scope: !88, file: !43, line: 605, column: 5)
!88 = distinct !DILexicalBlock(scope: !89, file: !43, line: 604, column: 12)
!89 = distinct !DILexicalBlock(scope: !74, file: !43, line: 597, column: 7)
!90 = !DILocalVariable(name: "spaces", scope: !87, file: !43, line: 609, type: !61)
!91 = !DILocalVariable(name: "anchor_len", scope: !74, file: !43, line: 620, type: !61)
!92 = !DILocalVariable(name: "desc_text", scope: !74, file: !43, line: 625, type: !64)
!93 = !DILocalVariable(name: "__ptr", scope: !94, file: !43, line: 644, type: !64)
!94 = distinct !DILexicalBlock(scope: !74, file: !43, line: 644, column: 3)
!95 = !DILocalVariable(name: "__stream", scope: !94, file: !43, line: 644, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !98, line: 7, baseType: !99)
!98 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !100, line: 49, size: 1728, elements: !101)
!100 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !117, !119, !120, !121, !124, !125, !127, !131, !134, !136, !139, !142, !143, !144, !145, !146}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !99, file: !100, line: 51, baseType: !59, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !99, file: !100, line: 54, baseType: !56, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !99, file: !100, line: 55, baseType: !56, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !99, file: !100, line: 56, baseType: !56, size: 64, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !99, file: !100, line: 57, baseType: !56, size: 64, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !99, file: !100, line: 58, baseType: !56, size: 64, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !99, file: !100, line: 59, baseType: !56, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !99, file: !100, line: 60, baseType: !56, size: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !99, file: !100, line: 61, baseType: !56, size: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !99, file: !100, line: 64, baseType: !56, size: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !99, file: !100, line: 65, baseType: !56, size: 64, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !99, file: !100, line: 66, baseType: !56, size: 64, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !99, file: !100, line: 68, baseType: !115, size: 64, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !100, line: 36, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !99, file: !100, line: 70, baseType: !118, size: 64, offset: 832)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !99, file: !100, line: 72, baseType: !59, size: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !99, file: !100, line: 73, baseType: !59, size: 32, offset: 928)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !99, file: !100, line: 74, baseType: !122, size: 64, offset: 960)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !123, line: 152, baseType: !68)
!123 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !99, file: !100, line: 77, baseType: !60, size: 16, offset: 1024)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !99, file: !100, line: 78, baseType: !126, size: 8, offset: 1040)
!126 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !99, file: !100, line: 79, baseType: !128, size: 8, offset: 1048)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !99, file: !100, line: 81, baseType: !132, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !100, line: 43, baseType: null)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !99, file: !100, line: 89, baseType: !135, size: 64, offset: 1152)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !123, line: 153, baseType: !68)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !99, file: !100, line: 91, baseType: !137, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !100, line: 37, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !99, file: !100, line: 92, baseType: !140, size: 64, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !100, line: 38, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !99, file: !100, line: 93, baseType: !118, size: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !99, file: !100, line: 94, baseType: !58, size: 64, offset: 1408)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !99, file: !100, line: 95, baseType: !61, size: 64, offset: 1472)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !99, file: !100, line: 96, baseType: !59, size: 32, offset: 1536)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !99, file: !100, line: 98, baseType: !147, size: 160, offset: 1568)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 20)
!150 = !DILocalVariable(name: "__cnt", scope: !94, file: !43, line: 644, type: !61)
!151 = !DILocalVariable(name: "url_program", scope: !74, file: !43, line: 648, type: !64)
!152 = !DILocalVariable(name: "__ptr", scope: !153, file: !43, line: 686, type: !64)
!153 = distinct !DILexicalBlock(scope: !74, file: !43, line: 686, column: 3)
!154 = !DILocalVariable(name: "__stream", scope: !153, file: !43, line: 686, type: !96)
!155 = !DILocalVariable(name: "__cnt", scope: !153, file: !43, line: 686, type: !61)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "do_short_format", scope: !2, file: !3, line: 65, type: !67, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 49, type: !67, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "include_fullname", scope: !2, file: !3, line: 52, type: !67, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "include_where", scope: !2, file: !3, line: 72, type: !67, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 46, type: !67, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "include_project", scope: !2, file: !3, line: 55, type: !67, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "include_plan", scope: !2, file: !3, line: 58, type: !67, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !2, file: !3, line: 62, type: !67, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 77, type: !64, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 78, type: !59, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !178, file: !3, line: 212, type: !59, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "print_entry", scope: !3, file: !3, line: 200, type: !179, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !210)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !22, line: 92, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !22, line: 65, size: 576, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !198, !202, !203, !205}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !184, file: !22, line: 69, baseType: !56, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !184, file: !22, line: 70, baseType: !56, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !184, file: !22, line: 71, baseType: !56, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !184, file: !22, line: 72, baseType: !56, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !184, file: !22, line: 74, baseType: !191, size: 128, offset: 256)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !192, line: 11, size: 128, elements: !193)
!192 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !191, file: !192, line: 16, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !123, line: 160, baseType: !68)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !191, file: !192, line: 21, baseType: !197, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !123, line: 197, baseType: !68)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !184, file: !22, line: 75, baseType: !199, size: 32, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !200, line: 97, baseType: !201)
!200 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !123, line: 154, baseType: !59)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !184, file: !22, line: 76, baseType: !199, size: 32, offset: 416)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !184, file: !22, line: 77, baseType: !204, size: 16, offset: 448)
!204 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !184, file: !22, line: 79, baseType: !206, size: 64, offset: 480)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !22, line: 79, size: 64, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !206, file: !22, line: 79, baseType: !59, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !206, file: !22, line: 79, baseType: !59, size: 32, offset: 32)
!210 = !{!211, !212, !213, !214, !215, !246, !249, !250, !251, !265, !269, !270, !273, !274}
!211 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !178, file: !3, line: 200, type: !181)
!212 = !DILocalVariable(name: "line", scope: !178, file: !3, line: 203, type: !56)
!213 = !DILocalVariable(name: "space", scope: !178, file: !3, line: 204, type: !56)
!214 = !DILocalVariable(name: "dirfd", scope: !178, file: !3, line: 207, type: !59)
!215 = !DILocalVariable(name: "stats", scope: !178, file: !3, line: 222, type: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !217, line: 44, size: 1024, elements: !218)
!217 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!218 = !{!219, !221, !223, !225, !227, !229, !231, !232, !233, !234, !236, !237, !239, !240, !241, !242}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !216, file: !217, line: 46, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !123, line: 145, baseType: !63)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !216, file: !217, line: 47, baseType: !222, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !123, line: 148, baseType: !63)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !216, file: !217, line: 48, baseType: !224, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !123, line: 150, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !216, file: !217, line: 49, baseType: !226, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !123, line: 151, baseType: !7)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !216, file: !217, line: 50, baseType: !228, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !123, line: 146, baseType: !7)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !216, file: !217, line: 51, baseType: !230, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !123, line: 147, baseType: !7)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !216, file: !217, line: 52, baseType: !220, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !216, file: !217, line: 53, baseType: !220, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !216, file: !217, line: 54, baseType: !122, size: 64, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !216, file: !217, line: 55, baseType: !235, size: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !123, line: 175, baseType: !59)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !216, file: !217, line: 56, baseType: !59, size: 32, offset: 480)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !216, file: !217, line: 57, baseType: !238, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !123, line: 180, baseType: !68)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !216, file: !217, line: 65, baseType: !191, size: 128, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !216, file: !217, line: 66, baseType: !191, size: 128, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !216, file: !217, line: 67, baseType: !191, size: 128, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !216, file: !217, line: 79, baseType: !243, size: 64, offset: 960)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DILocalVariable(name: "last_change", scope: !178, file: !3, line: 223, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !248, line: 10, baseType: !195)
!248 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!249 = !DILocalVariable(name: "mesg", scope: !178, file: !3, line: 224, type: !57)
!250 = !DILocalVariable(name: "ut_user", scope: !178, file: !3, line: 236, type: !56)
!251 = !DILocalVariable(name: "pw", scope: !252, file: !3, line: 244, type: !254)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 243, column: 5)
!253 = distinct !DILexicalBlock(scope: !178, file: !3, line: 242, column: 7)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !256, line: 49, size: 384, elements: !257)
!256 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!257 = !{!258, !259, !260, !261, !262, !263, !264}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !255, file: !256, line: 51, baseType: !56, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !255, file: !256, line: 52, baseType: !56, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !255, file: !256, line: 54, baseType: !228, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !255, file: !256, line: 55, baseType: !230, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !255, file: !256, line: 56, baseType: !56, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !255, file: !256, line: 57, baseType: !56, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !255, file: !256, line: 58, baseType: !56, size: 64, offset: 320)
!265 = !DILocalVariable(name: "comma", scope: !266, file: !3, line: 250, type: !268)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 249, column: 9)
!267 = distinct !DILexicalBlock(scope: !252, file: !3, line: 245, column: 11)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!269 = !DILocalVariable(name: "result", scope: !266, file: !3, line: 255, type: !56)
!270 = !DILocalVariable(name: "ut_host", scope: !271, file: !3, line: 282, type: !56)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 281, column: 5)
!272 = distinct !DILexicalBlock(scope: !178, file: !3, line: 280, column: 7)
!273 = !DILocalVariable(name: "display", scope: !271, file: !3, line: 285, type: !56)
!274 = !DILocalVariable(name: "host", scope: !271, file: !3, line: 289, type: !56)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "now", scope: !277, file: !3, line: 158, type: !247, isLocal: true, isDefinition: true)
!277 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 156, type: !278, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !280)
!278 = !DISubroutineType(types: !279)
!279 = !{!64, !247}
!280 = !{!281, !282, !283, !286, !287}
!281 = !DILocalVariable(name: "when", arg: 1, scope: !277, file: !3, line: 156, type: !247)
!282 = !DILocalVariable(name: "seconds_idle", scope: !277, file: !3, line: 164, type: !247)
!283 = !DILocalVariable(name: "hours", scope: !284, file: !3, line: 169, type: !59)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 168, column: 5)
!285 = distinct !DILexicalBlock(scope: !277, file: !3, line: 167, column: 7)
!286 = !DILocalVariable(name: "minutes", scope: !284, file: !3, line: 170, type: !59)
!287 = !DILocalVariable(name: "days", scope: !288, file: !3, line: 175, type: !289)
!288 = distinct !DILexicalBlock(scope: !285, file: !3, line: 174, column: 5)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !290, line: 101, baseType: !291)
!290 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !123, line: 72, baseType: !68)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "buf", scope: !277, file: !3, line: 159, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 176, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 22)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "buf", scope: !299, file: !3, line: 185, type: !320, isLocal: true, isDefinition: true)
!299 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 183, type: !300, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!300 = !DISubroutineType(types: !301)
!301 = !{!64, !181}
!302 = !{!303, !304}
!303 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !299, file: !3, line: 183, type: !181)
!304 = !DILocalVariable(name: "tmp", scope: !299, file: !3, line: 186, type: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !307, line: 7, size: 448, elements: !308)
!307 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !306, file: !307, line: 9, baseType: !59, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !306, file: !307, line: 10, baseType: !59, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !306, file: !307, line: 11, baseType: !59, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !306, file: !307, line: 12, baseType: !59, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !306, file: !307, line: 13, baseType: !59, size: 32, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !306, file: !307, line: 14, baseType: !59, size: 32, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !306, file: !307, line: 15, baseType: !59, size: 32, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !306, file: !307, line: 16, baseType: !59, size: 32, offset: 224)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !306, file: !307, line: 17, baseType: !59, size: 32, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !306, file: !307, line: 20, baseType: !68, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !306, file: !307, line: 21, baseType: !64, size: 64, offset: 384)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 264, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 33)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 1024, elements: !333)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !326, line: 50, size: 256, elements: !327)
!326 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!327 = !{!328, !329, !330, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !326, line: 52, baseType: !64, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !325, file: !326, line: 55, baseType: !59, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !325, file: !326, line: 56, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !325, file: !326, line: 57, baseType: !59, size: 32, offset: 192)
!333 = !{!334}
!334 = !DISubrange(count: 4)
!335 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!336 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!337 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!338 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!339 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!340 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!341 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!342 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "Version", scope: !346, file: !347, line: 3, type: !64, isLocal: false, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C99, file: !347, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !348, splitDebugInlining: false, nameTableKind: None)
!347 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!348 = !{!344}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "last_cherror", scope: !351, file: !352, line: 28, type: !59, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !353, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!353 = !{!354, !349}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "hints", scope: !356, file: !352, line: 63, type: !364, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "canon_host_r", scope: !352, file: !352, line: 61, type: !357, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !351, retainedNodes: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{!56, !64, !331}
!359 = !{!360, !361, !362, !388, !389}
!360 = !DILocalVariable(name: "host", arg: 1, scope: !356, file: !352, line: 61, type: !64)
!361 = !DILocalVariable(name: "cherror", arg: 2, scope: !356, file: !352, line: 61, type: !331)
!362 = !DILocalVariable(name: "res", scope: !356, file: !352, line: 66, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !365, line: 565, size: 384, elements: !366)
!365 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!366 = !{!367, !368, !369, !370, !371, !375, !386, !387}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !364, file: !365, line: 567, baseType: !59, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !364, file: !365, line: 568, baseType: !59, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !364, file: !365, line: 569, baseType: !59, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !364, file: !365, line: 570, baseType: !59, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !364, file: !365, line: 571, baseType: !372, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !373, line: 33, baseType: !374)
!373 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !123, line: 210, baseType: !7)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !364, file: !365, line: 572, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !373, line: 180, size: 128, elements: !378)
!378 = !{!379, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !377, file: !373, line: 182, baseType: !380, size: 16)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !381, line: 28, baseType: !60)
!381 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !377, file: !373, line: 183, baseType: !383, size: 112, offset: 16)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 112, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 14)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !364, file: !365, line: 573, baseType: !56, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !364, file: !365, line: 574, baseType: !363, size: 64, offset: 320)
!388 = !DILocalVariable(name: "status", scope: !356, file: !352, line: 67, type: !59)
!389 = !DILocalVariable(name: "retval", scope: !356, file: !352, line: 69, type: !56)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "file_name", scope: !392, file: !393, line: 45, type: !64, isLocal: true, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !394, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!394 = !{!390, !395}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !392, file: !393, line: 55, type: !67, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !399, file: !400, line: 66, type: !435, isLocal: false, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !401, globals: !402, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!401 = !{!58, !66}
!402 = !{!403, !429, !397, !431, !433}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "old_file_name", scope: !405, file: !400, line: 304, type: !64, isLocal: true, isDefinition: true)
!405 = distinct !DISubprogram(name: "verror_at_line", scope: !400, file: !400, line: 298, type: !406, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !422)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !59, !59, !64, !7, !64, !408}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !409, line: 52, baseType: !410)
!409 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !411, line: 32, baseType: !412)
!411 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !413, baseType: !414)
!413 = !DIFile(filename: "lib/error.c", directory: "/src")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !415, size: 256, elements: !416)
!415 = !DINamespace(name: "std", scope: null)
!416 = !{!417, !418, !419, !420, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !414, file: !413, baseType: !58, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !414, file: !413, baseType: !58, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !414, file: !413, baseType: !58, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !414, file: !413, baseType: !59, size: 32, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !414, file: !413, baseType: !59, size: 32, offset: 224)
!422 = !{!423, !424, !425, !426, !427, !428}
!423 = !DILocalVariable(name: "status", arg: 1, scope: !405, file: !400, line: 298, type: !59)
!424 = !DILocalVariable(name: "errnum", arg: 2, scope: !405, file: !400, line: 298, type: !59)
!425 = !DILocalVariable(name: "file_name", arg: 3, scope: !405, file: !400, line: 298, type: !64)
!426 = !DILocalVariable(name: "line_number", arg: 4, scope: !405, file: !400, line: 298, type: !7)
!427 = !DILocalVariable(name: "message", arg: 5, scope: !405, file: !400, line: 298, type: !64)
!428 = !DILocalVariable(name: "args", arg: 6, scope: !405, file: !400, line: 298, type: !408)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "old_line_number", scope: !405, file: !400, line: 305, type: !7, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "error_message_count", scope: !399, file: !400, line: 69, type: !7, isLocal: false, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !399, file: !400, line: 295, type: !59, isLocal: false, isDefinition: true)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null}
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "program_name", scope: !440, file: !441, line: 31, type: !64, isLocal: false, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !442, globals: !443, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!442 = !{!56}
!443 = !{!438}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "utf07FF", scope: !446, file: !447, line: 46, type: !475, isLocal: true, isDefinition: true)
!446 = distinct !DISubprogram(name: "proper_name_lite", scope: !447, file: !447, line: 38, type: !448, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !450, retainedNodes: !452)
!447 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!448 = !DISubroutineType(types: !449)
!449 = !{!64, !64, !64}
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !451, splitDebugInlining: false, nameTableKind: None)
!451 = !{!444}
!452 = !{!453, !454, !455, !456, !461}
!453 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !446, file: !447, line: 38, type: !64)
!454 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !446, file: !447, line: 38, type: !64)
!455 = !DILocalVariable(name: "translation", scope: !446, file: !447, line: 40, type: !64)
!456 = !DILocalVariable(name: "w", scope: !446, file: !447, line: 47, type: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !458, line: 37, baseType: !459)
!458 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !123, line: 57, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !123, line: 42, baseType: !7)
!461 = !DILocalVariable(name: "mbs", scope: !446, file: !447, line: 48, type: !462)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !463, line: 6, baseType: !464)
!463 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !465, line: 21, baseType: !466)
!465 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 13, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !466, file: !465, line: 15, baseType: !59, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !466, file: !465, line: 20, baseType: !470, size: 32, offset: 32)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !466, file: !465, line: 16, size: 32, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !470, file: !465, line: 18, baseType: !7, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !470, file: !465, line: 19, baseType: !474, size: 32)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !333)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 16, elements: !244)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !478, file: !479, line: 76, type: !547, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !480, retainedTypes: !486, globals: !487, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!480 = !{!28, !481, !5}
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !29, line: 254, baseType: !7, size: 32, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!484 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!485 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!486 = !{!59, !60, !61}
!487 = !{!476, !488, !494, !506, !508, !513, !536, !543, !545}
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !478, file: !479, line: 92, type: !490, isLocal: false, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 320, elements: !492)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!492 = !{!493}
!493 = !DISubrange(count: 10)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !478, file: !479, line: 1040, type: !496, isLocal: false, isDefinition: true)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !479, line: 56, size: 448, elements: !497)
!497 = !{!498, !499, !500, !504, !505}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !496, file: !479, line: 59, baseType: !28, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !479, line: 62, baseType: !59, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !496, file: !479, line: 66, baseType: !501, size: 256, offset: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !496, file: !479, line: 69, baseType: !64, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !496, file: !479, line: 72, baseType: !64, size: 64, offset: 384)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !478, file: !479, line: 107, type: !496, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "slot0", scope: !478, file: !479, line: 831, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 256)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "quote", scope: !515, file: !479, line: 228, type: !534, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "gettext_quote", scope: !479, file: !479, line: 197, type: !516, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !478, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{!64, !64, !28}
!518 = !{!519, !520, !521, !522, !523}
!519 = !DILocalVariable(name: "msgid", arg: 1, scope: !515, file: !479, line: 197, type: !64)
!520 = !DILocalVariable(name: "s", arg: 2, scope: !515, file: !479, line: 197, type: !28)
!521 = !DILocalVariable(name: "translation", scope: !515, file: !479, line: 199, type: !64)
!522 = !DILocalVariable(name: "w", scope: !515, file: !479, line: 229, type: !457)
!523 = !DILocalVariable(name: "mbs", scope: !515, file: !479, line: 230, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !463, line: 6, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !465, line: 21, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 13, size: 64, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !526, file: !465, line: 15, baseType: !59, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !526, file: !465, line: 20, baseType: !530, size: 32, offset: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !526, file: !465, line: 16, size: 32, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !530, file: !465, line: 18, baseType: !7, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !530, file: !465, line: 19, baseType: !474, size: 32)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !535)
!535 = !{!245, !334}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "slotvec", scope: !478, file: !479, line: 834, type: !538, isLocal: true, isDefinition: true)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !479, line: 823, size: 128, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !479, line: 825, baseType: !61, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !539, file: !479, line: 826, baseType: !56, size: 64, offset: 64)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "nslots", scope: !478, file: !479, line: 832, type: !59, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "slotvec0", scope: !478, file: !479, line: 833, type: !539, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 704, elements: !549)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!549 = !{!550}
!550 = !DISubrange(count: 11)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !553, file: !554, line: 26, type: !556, isLocal: false, isDefinition: true)
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !555, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!555 = !{!551}
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 376, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 47)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "exit_failure", scope: !561, file: !562, line: 24, type: !564, isLocal: false, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !563, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!563 = !{!559}
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !59)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "internal_state", scope: !567, file: !568, line: 97, type: !571, isLocal: true, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !569, globals: !570, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!569 = !{!58, !61, !66}
!570 = !{!565}
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !463, line: 6, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !465, line: 21, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 13, size: 64, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !573, file: !465, line: 15, baseType: !59, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !573, file: !465, line: 20, baseType: !577, size: 32, offset: 32)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !573, file: !465, line: 16, size: 32, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !577, file: !465, line: 18, baseType: !7, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !577, file: !465, line: 19, baseType: !474, size: 32)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !583, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!583 = !{!46}
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!586 = !{!58}
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!593 = !{!64}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !600, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!600 = !{!289}
!601 = distinct !DICompileUnit(language: DW_LANG_C99, file: !602, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !604, splitDebugInlining: false, nameTableKind: None)
!602 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!603 = !{!21}
!604 = !{!56, !58, !605, !636, !61}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !608, line: 55, size: 3200, elements: !609)
!608 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!609 = !{!610, !611, !612, !616, !617, !618, !619, !624, !625, !632, !635}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !607, file: !608, line: 57, baseType: !204, size: 16)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !607, file: !608, line: 58, baseType: !201, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !607, file: !608, line: 59, baseType: !613, size: 256, offset: 64)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !607, file: !608, line: 61, baseType: !474, size: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !607, file: !608, line: 63, baseType: !613, size: 256, offset: 352)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !607, file: !608, line: 65, baseType: !510, size: 2048, offset: 608)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !607, file: !608, line: 67, baseType: !620, size: 32, offset: 2656)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !608, line: 42, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !620, file: !608, line: 45, baseType: !204, size: 16)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !620, file: !608, line: 46, baseType: !204, size: 16, offset: 16)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !607, file: !608, line: 81, baseType: !68, size: 64, offset: 2688)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !607, file: !608, line: 82, baseType: !626, size: 128, offset: 2752)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !627, line: 8, size: 128, elements: !628)
!627 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !626, file: !627, line: 14, baseType: !195, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !626, file: !627, line: 15, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !123, line: 162, baseType: !68)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !607, file: !608, line: 84, baseType: !633, size: 128, offset: 2880)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !333)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !123, line: 41, baseType: !59)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !607, file: !608, line: 85, baseType: !147, size: 160, offset: 3008)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !290, line: 87, baseType: !68)
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !639, retainedTypes: !644, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!639 = !{!640}
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !641, line: 36, baseType: !7, size: 32, elements: !642)
!641 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!642 = !{!643}
!643 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!644 = !{!61}
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/time.c", directory: "/src", checksumkind: CSK_MD5, checksum: "402c2ccc7a3a90dfc8381b5d9f8bcf84")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !653, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!653 = !{!654}
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !652, line: 40, baseType: !7, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, retainedTypes: !690, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!659 = !{!660, !672}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !661, file: !658, line: 188, baseType: !7, size: 32, elements: !670)
!661 = distinct !DISubprogram(name: "x2nrealloc", scope: !658, file: !658, line: 176, type: !662, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !657, retainedNodes: !665)
!662 = !DISubroutineType(types: !663)
!663 = !{!58, !58, !664, !61}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!665 = !{!666, !667, !668, !669}
!666 = !DILocalVariable(name: "p", arg: 1, scope: !661, file: !658, line: 176, type: !58)
!667 = !DILocalVariable(name: "pn", arg: 2, scope: !661, file: !658, line: 176, type: !664)
!668 = !DILocalVariable(name: "s", arg: 3, scope: !661, file: !658, line: 176, type: !61)
!669 = !DILocalVariable(name: "n", scope: !661, file: !658, line: 178, type: !61)
!670 = !{!671}
!671 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !673, file: !658, line: 228, baseType: !7, size: 32, elements: !670)
!673 = distinct !DISubprogram(name: "xpalloc", scope: !658, file: !658, line: 223, type: !674, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !657, retainedNodes: !680)
!674 = !DISubroutineType(types: !675)
!675 = !{!58, !58, !676, !677, !679, !677}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !678, line: 130, baseType: !679)
!678 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !62, line: 35, baseType: !68)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689}
!681 = !DILocalVariable(name: "pa", arg: 1, scope: !673, file: !658, line: 223, type: !58)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !673, file: !658, line: 223, type: !676)
!683 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !673, file: !658, line: 223, type: !677)
!684 = !DILocalVariable(name: "n_max", arg: 4, scope: !673, file: !658, line: 223, type: !679)
!685 = !DILocalVariable(name: "s", arg: 5, scope: !673, file: !658, line: 223, type: !677)
!686 = !DILocalVariable(name: "n0", scope: !673, file: !658, line: 230, type: !677)
!687 = !DILocalVariable(name: "n", scope: !673, file: !658, line: 237, type: !677)
!688 = !DILocalVariable(name: "nbytes", scope: !673, file: !658, line: 248, type: !677)
!689 = !DILocalVariable(name: "adjusted_nbytes", scope: !673, file: !658, line: 252, type: !677)
!690 = !{!56, !58, !67, !68, !63}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !442, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!707 = !{!67, !63, !58}
!708 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!709 = !{i32 7, !"Dwarf Version", i32 5}
!710 = !{i32 2, !"Debug Info Version", i32 3}
!711 = !{i32 1, !"wchar_size", i32 4}
!712 = !{i32 1, !"branch-target-enforcement", i32 0}
!713 = !{i32 1, !"sign-return-address", i32 0}
!714 = !{i32 1, !"sign-return-address-all", i32 0}
!715 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!716 = !{i32 7, !"PIC Level", i32 2}
!717 = !{i32 7, !"PIE Level", i32 2}
!718 = !{i32 7, !"uwtable", i32 1}
!719 = !{i32 7, !"frame-pointer", i32 1}
!720 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 477, type: !721, scopeLine: 478, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !723)
!721 = !DISubroutineType(types: !722)
!722 = !{null, !59}
!723 = !{!724}
!724 = !DILocalVariable(name: "status", arg: 1, scope: !720, file: !3, line: 477, type: !59)
!725 = !DILocation(line: 0, scope: !720)
!726 = !DILocation(line: 479, column: 14, scope: !727)
!727 = distinct !DILexicalBlock(scope: !720, file: !3, line: 479, column: 7)
!728 = !DILocation(line: 479, column: 7, scope: !720)
!729 = !DILocation(line: 480, column: 5, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !3, line: 480, column: 5)
!731 = !{!732, !732, i64 0}
!732 = !{!"any pointer", !733, i64 0}
!733 = !{!"omnipotent char", !734, i64 0}
!734 = !{!"Simple C/C++ TBAA"}
!735 = !DILocation(line: 483, column: 7, scope: !736)
!736 = distinct !DILexicalBlock(scope: !727, file: !3, line: 482, column: 5)
!737 = !DILocation(line: 484, column: 7, scope: !736)
!738 = !DILocation(line: 487, column: 7, scope: !736)
!739 = !DILocation(line: 490, column: 7, scope: !736)
!740 = !DILocation(line: 493, column: 7, scope: !736)
!741 = !DILocation(line: 496, column: 7, scope: !736)
!742 = !DILocation(line: 499, column: 7, scope: !736)
!743 = !DILocation(line: 502, column: 7, scope: !736)
!744 = !DILocation(line: 505, column: 7, scope: !736)
!745 = !DILocation(line: 508, column: 7, scope: !736)
!746 = !DILocation(line: 511, column: 7, scope: !736)
!747 = !DILocation(line: 514, column: 7, scope: !736)
!748 = !DILocation(line: 518, column: 7, scope: !736)
!749 = !DILocation(line: 519, column: 7, scope: !736)
!750 = !DILocation(line: 520, column: 7, scope: !736)
!751 = !DILocalVariable(name: "program", arg: 1, scope: !752, file: !43, line: 836, type: !64)
!752 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !43, file: !43, line: 836, type: !753, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !755)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !64}
!755 = !{!751, !756, !765, !766, !768, !769}
!756 = !DILocalVariable(name: "infomap", scope: !752, file: !43, line: 838, type: !757)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 896, elements: !763)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !752, file: !43, line: 838, size: 128, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !759, file: !43, line: 838, baseType: !64, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !759, file: !43, line: 838, baseType: !64, size: 64, offset: 64)
!763 = !{!764}
!764 = !DISubrange(count: 7)
!765 = !DILocalVariable(name: "node", scope: !752, file: !43, line: 848, type: !64)
!766 = !DILocalVariable(name: "map_prog", scope: !752, file: !43, line: 849, type: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!768 = !DILocalVariable(name: "lc_messages", scope: !752, file: !43, line: 861, type: !64)
!769 = !DILocalVariable(name: "url_program", scope: !752, file: !43, line: 874, type: !64)
!770 = !DILocation(line: 0, scope: !752, inlinedAt: !771)
!771 = distinct !DILocation(line: 525, column: 7, scope: !736)
!772 = !DILocation(line: 838, column: 3, scope: !752, inlinedAt: !771)
!773 = !DILocation(line: 838, column: 67, scope: !752, inlinedAt: !771)
!774 = !DILocation(line: 849, column: 36, scope: !752, inlinedAt: !771)
!775 = !DILocation(line: 851, column: 3, scope: !752, inlinedAt: !771)
!776 = !DILocalVariable(name: "__s1", arg: 1, scope: !777, file: !778, line: 1359, type: !64)
!777 = distinct !DISubprogram(name: "streq", scope: !778, file: !778, line: 1359, type: !779, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !781)
!778 = !DIFile(filename: "./lib/string.h", directory: "/src")
!779 = !DISubroutineType(types: !780)
!780 = !{!67, !64, !64}
!781 = !{!776, !782}
!782 = !DILocalVariable(name: "__s2", arg: 2, scope: !777, file: !778, line: 1359, type: !64)
!783 = !DILocation(line: 0, scope: !777, inlinedAt: !784)
!784 = distinct !DILocation(line: 851, column: 33, scope: !752, inlinedAt: !771)
!785 = !DILocation(line: 1361, column: 11, scope: !777, inlinedAt: !784)
!786 = !DILocation(line: 1361, column: 10, scope: !777, inlinedAt: !784)
!787 = !DILocation(line: 852, column: 13, scope: !752, inlinedAt: !771)
!788 = !DILocation(line: 851, column: 20, scope: !752, inlinedAt: !771)
!789 = !{!790, !732, i64 0}
!790 = !{!"infomap", !732, i64 0, !732, i64 8}
!791 = !DILocation(line: 851, column: 10, scope: !752, inlinedAt: !771)
!792 = !DILocation(line: 851, column: 28, scope: !752, inlinedAt: !771)
!793 = distinct !{!793, !775, !787, !794}
!794 = !{!"llvm.loop.mustprogress"}
!795 = !DILocation(line: 854, column: 17, scope: !796, inlinedAt: !771)
!796 = distinct !DILexicalBlock(scope: !752, file: !43, line: 854, column: 7)
!797 = !{!790, !732, i64 8}
!798 = !DILocation(line: 854, column: 7, scope: !796, inlinedAt: !771)
!799 = !DILocation(line: 854, column: 7, scope: !752, inlinedAt: !771)
!800 = !DILocation(line: 857, column: 3, scope: !752, inlinedAt: !771)
!801 = !DILocation(line: 861, column: 29, scope: !752, inlinedAt: !771)
!802 = !DILocation(line: 862, column: 7, scope: !803, inlinedAt: !771)
!803 = distinct !DILexicalBlock(scope: !752, file: !43, line: 862, column: 7)
!804 = !DILocation(line: 862, column: 19, scope: !803, inlinedAt: !771)
!805 = !DILocation(line: 862, column: 22, scope: !803, inlinedAt: !771)
!806 = !DILocation(line: 862, column: 7, scope: !752, inlinedAt: !771)
!807 = !DILocation(line: 868, column: 7, scope: !808, inlinedAt: !771)
!808 = distinct !DILexicalBlock(scope: !803, file: !43, line: 863, column: 5)
!809 = !DILocation(line: 870, column: 5, scope: !808, inlinedAt: !771)
!810 = !DILocation(line: 0, scope: !777, inlinedAt: !811)
!811 = distinct !DILocation(line: 874, column: 29, scope: !752, inlinedAt: !771)
!812 = !DILocation(line: 875, column: 3, scope: !752, inlinedAt: !771)
!813 = !DILocation(line: 877, column: 3, scope: !752, inlinedAt: !771)
!814 = !DILocation(line: 879, column: 1, scope: !752, inlinedAt: !771)
!815 = !DILocation(line: 527, column: 3, scope: !720)
!816 = !DISubprogram(name: "dcgettext", scope: !817, file: !817, line: 51, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !820)
!817 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!818 = !DISubroutineType(types: !819)
!819 = !{!56, !64, !64, !59}
!820 = !{}
!821 = !DISubprogram(name: "fputs_unlocked", scope: !409, file: !409, line: 691, type: !822, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !820)
!822 = !DISubroutineType(types: !823)
!823 = !{!59, !824, !825}
!824 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !64)
!825 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !96)
!826 = !DILocation(line: 0, scope: !74)
!827 = !DILocation(line: 581, column: 7, scope: !82)
!828 = !{!829, !829, i64 0}
!829 = !{!"int", !733, i64 0}
!830 = !DILocation(line: 581, column: 19, scope: !82)
!831 = !DILocation(line: 581, column: 7, scope: !74)
!832 = !DILocation(line: 585, column: 26, scope: !81)
!833 = !DILocation(line: 0, scope: !81)
!834 = !DILocation(line: 586, column: 23, scope: !81)
!835 = !DILocation(line: 586, column: 28, scope: !81)
!836 = !DILocation(line: 586, column: 32, scope: !81)
!837 = !{!733, !733, i64 0}
!838 = !DILocation(line: 586, column: 38, scope: !81)
!839 = !DILocation(line: 0, scope: !777, inlinedAt: !840)
!840 = distinct !DILocation(line: 586, column: 41, scope: !81)
!841 = !DILocation(line: 1361, column: 11, scope: !777, inlinedAt: !840)
!842 = !DILocation(line: 1361, column: 10, scope: !777, inlinedAt: !840)
!843 = !DILocation(line: 586, column: 19, scope: !81)
!844 = !DILocation(line: 587, column: 5, scope: !81)
!845 = !DILocation(line: 588, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !74, file: !43, line: 588, column: 7)
!847 = !DILocation(line: 588, column: 7, scope: !74)
!848 = !DILocation(line: 590, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !43, line: 589, column: 5)
!850 = !DILocation(line: 591, column: 7, scope: !849)
!851 = !DILocation(line: 595, column: 37, scope: !74)
!852 = !DILocation(line: 595, column: 35, scope: !74)
!853 = !DILocation(line: 596, column: 29, scope: !74)
!854 = !DILocation(line: 597, column: 8, scope: !89)
!855 = !DILocation(line: 597, column: 7, scope: !74)
!856 = !DILocation(line: 604, column: 24, scope: !88)
!857 = !DILocation(line: 604, column: 12, scope: !89)
!858 = !DILocation(line: 0, scope: !87)
!859 = !DILocation(line: 610, column: 16, scope: !87)
!860 = !DILocation(line: 610, column: 7, scope: !87)
!861 = !DILocation(line: 611, column: 21, scope: !87)
!862 = !{!863, !863, i64 0}
!863 = !{!"short", !733, i64 0}
!864 = !DILocation(line: 611, column: 19, scope: !87)
!865 = !DILocation(line: 611, column: 16, scope: !87)
!866 = !DILocation(line: 610, column: 30, scope: !87)
!867 = distinct !{!867, !860, !861, !794}
!868 = !DILocation(line: 612, column: 18, scope: !869)
!869 = distinct !DILexicalBlock(scope: !87, file: !43, line: 612, column: 11)
!870 = !DILocation(line: 612, column: 11, scope: !87)
!871 = !DILocation(line: 620, column: 23, scope: !74)
!872 = !DILocation(line: 625, column: 39, scope: !74)
!873 = !DILocation(line: 626, column: 3, scope: !74)
!874 = !DILocation(line: 626, column: 10, scope: !74)
!875 = !DILocation(line: 626, column: 21, scope: !74)
!876 = !DILocation(line: 628, column: 44, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !43, line: 628, column: 11)
!878 = distinct !DILexicalBlock(scope: !74, file: !43, line: 627, column: 5)
!879 = !DILocation(line: 628, column: 32, scope: !877)
!880 = !DILocation(line: 628, column: 49, scope: !877)
!881 = !DILocation(line: 628, column: 11, scope: !878)
!882 = !DILocation(line: 630, column: 11, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !43, line: 630, column: 11)
!884 = !DILocation(line: 630, column: 11, scope: !878)
!885 = !DILocation(line: 632, column: 26, scope: !886)
!886 = distinct !DILexicalBlock(scope: !887, file: !43, line: 632, column: 15)
!887 = distinct !DILexicalBlock(scope: !883, file: !43, line: 631, column: 9)
!888 = !DILocation(line: 632, column: 34, scope: !886)
!889 = !DILocation(line: 632, column: 37, scope: !886)
!890 = !DILocation(line: 632, column: 15, scope: !887)
!891 = !DILocation(line: 636, column: 29, scope: !892)
!892 = distinct !DILexicalBlock(scope: !887, file: !43, line: 636, column: 15)
!893 = !DILocation(line: 640, column: 16, scope: !878)
!894 = distinct !{!894, !873, !895, !794}
!895 = !DILocation(line: 641, column: 5, scope: !74)
!896 = !DILocation(line: 644, column: 3, scope: !74)
!897 = !DILocation(line: 0, scope: !777, inlinedAt: !898)
!898 = distinct !DILocation(line: 648, column: 31, scope: !74)
!899 = !DILocation(line: 0, scope: !777, inlinedAt: !900)
!900 = distinct !DILocation(line: 649, column: 31, scope: !74)
!901 = !DILocation(line: 0, scope: !777, inlinedAt: !902)
!902 = distinct !DILocation(line: 650, column: 31, scope: !74)
!903 = !DILocation(line: 0, scope: !777, inlinedAt: !904)
!904 = distinct !DILocation(line: 651, column: 31, scope: !74)
!905 = !DILocation(line: 0, scope: !777, inlinedAt: !906)
!906 = distinct !DILocation(line: 652, column: 31, scope: !74)
!907 = !DILocation(line: 0, scope: !777, inlinedAt: !908)
!908 = distinct !DILocation(line: 653, column: 31, scope: !74)
!909 = !DILocation(line: 0, scope: !777, inlinedAt: !910)
!910 = distinct !DILocation(line: 654, column: 31, scope: !74)
!911 = !DILocation(line: 0, scope: !777, inlinedAt: !912)
!912 = distinct !DILocation(line: 655, column: 31, scope: !74)
!913 = !DILocation(line: 0, scope: !777, inlinedAt: !914)
!914 = distinct !DILocation(line: 656, column: 31, scope: !74)
!915 = !DILocation(line: 0, scope: !777, inlinedAt: !916)
!916 = distinct !DILocation(line: 657, column: 31, scope: !74)
!917 = !DILocation(line: 663, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !74, file: !43, line: 663, column: 7)
!919 = !DILocation(line: 664, column: 7, scope: !918)
!920 = !DILocation(line: 664, column: 10, scope: !918)
!921 = !DILocation(line: 663, column: 7, scope: !74)
!922 = !DILocation(line: 669, column: 7, scope: !923)
!923 = distinct !DILexicalBlock(scope: !918, file: !43, line: 665, column: 5)
!924 = !DILocation(line: 671, column: 5, scope: !923)
!925 = !DILocation(line: 676, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !918, file: !43, line: 673, column: 5)
!927 = !DILocation(line: 679, column: 3, scope: !74)
!928 = !DILocation(line: 683, column: 3, scope: !74)
!929 = !DILocation(line: 686, column: 3, scope: !74)
!930 = !DILocation(line: 688, column: 3, scope: !74)
!931 = !DILocation(line: 691, column: 3, scope: !74)
!932 = !DILocation(line: 695, column: 3, scope: !74)
!933 = !DILocation(line: 696, column: 1, scope: !74)
!934 = !DISubprogram(name: "setlocale", scope: !935, file: !935, line: 122, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !820)
!935 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!936 = !DISubroutineType(types: !937)
!937 = !{!56, !59, !64}
!938 = !DISubprogram(name: "getenv", scope: !939, file: !939, line: 641, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !820)
!939 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!940 = !DISubroutineType(types: !941)
!941 = !{!56, !64}
!942 = !DISubprogram(name: "fwrite_unlocked", scope: !409, file: !409, line: 704, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !820)
!943 = !DISubroutineType(types: !944)
!944 = !{!61, !945, !61, !61, !825}
!945 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!948 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 531, type: !949, scopeLine: 532, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !952)
!949 = !DISubroutineType(types: !950)
!950 = !{!59, !59, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!952 = !{!953, !954, !955, !956}
!953 = !DILocalVariable(name: "argc", arg: 1, scope: !948, file: !3, line: 531, type: !59)
!954 = !DILocalVariable(name: "argv", arg: 2, scope: !948, file: !3, line: 531, type: !951)
!955 = !DILocalVariable(name: "optc", scope: !948, file: !3, line: 541, type: !59)
!956 = !DILocalVariable(name: "n_users", scope: !948, file: !3, line: 603, type: !59)
!957 = !DILocation(line: 0, scope: !948)
!958 = !DILocation(line: 534, column: 21, scope: !948)
!959 = !DILocation(line: 534, column: 3, scope: !948)
!960 = !DILocation(line: 535, column: 3, scope: !948)
!961 = !DILocation(line: 536, column: 3, scope: !948)
!962 = !DILocation(line: 537, column: 3, scope: !948)
!963 = !DILocation(line: 539, column: 3, scope: !948)
!964 = !DILocation(line: 542, column: 3, scope: !948)
!965 = !DILocation(line: 542, column: 18, scope: !948)
!966 = !DILocation(line: 548, column: 27, scope: !967)
!967 = distinct !DILexicalBlock(scope: !968, file: !3, line: 546, column: 9)
!968 = distinct !DILexicalBlock(scope: !948, file: !3, line: 544, column: 5)
!969 = !DILocation(line: 549, column: 11, scope: !967)
!970 = !DILocation(line: 552, column: 27, scope: !967)
!971 = !DILocation(line: 553, column: 11, scope: !967)
!972 = !DILocation(line: 556, column: 27, scope: !967)
!973 = !DILocation(line: 557, column: 11, scope: !967)
!974 = !DILocation(line: 560, column: 28, scope: !967)
!975 = !DILocation(line: 561, column: 11, scope: !967)
!976 = !DILocation(line: 564, column: 28, scope: !967)
!977 = !DILocation(line: 566, column: 25, scope: !967)
!978 = !DILocation(line: 568, column: 11, scope: !967)
!979 = !DILocation(line: 571, column: 28, scope: !967)
!980 = !DILocation(line: 573, column: 25, scope: !967)
!981 = !DILocation(line: 575, column: 24, scope: !967)
!982 = !DILocation(line: 576, column: 11, scope: !967)
!983 = !DILocation(line: 579, column: 27, scope: !967)
!984 = !DILocation(line: 580, column: 11, scope: !967)
!985 = !DILocation(line: 583, column: 24, scope: !967)
!986 = !DILocation(line: 584, column: 11, scope: !967)
!987 = !DILocation(line: 587, column: 34, scope: !967)
!988 = !DILocation(line: 588, column: 11, scope: !967)
!989 = !DILocation(line: 591, column: 21, scope: !967)
!990 = !DILocation(line: 592, column: 11, scope: !967)
!991 = distinct !{!991, !964, !992, !794}
!992 = !DILocation(line: 601, column: 5, scope: !948)
!993 = !DILocation(line: 594, column: 9, scope: !967)
!994 = !DILocation(line: 596, column: 9, scope: !967)
!995 = !DILocation(line: 599, column: 11, scope: !967)
!996 = !DILocation(line: 603, column: 24, scope: !948)
!997 = !DILocation(line: 603, column: 22, scope: !948)
!998 = !DILocation(line: 605, column: 8, scope: !999)
!999 = distinct !DILexicalBlock(scope: !948, file: !3, line: 605, column: 7)
!1000 = !DILocation(line: 605, column: 24, scope: !999)
!1001 = !DILocation(line: 607, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !999, file: !3, line: 606, column: 5)
!1003 = !DILocation(line: 609, column: 7, scope: !1002)
!1004 = !DILocation(line: 612, column: 7, scope: !948)
!1005 = !DILocalVariable(name: "filename", arg: 1, scope: !1006, file: !3, line: 457, type: !64)
!1006 = distinct !DISubprogram(name: "short_pinky", scope: !3, file: !3, line: 457, type: !1007, scopeLine: 459, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1011)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !64, !1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!1011 = !{!1005, !1012, !1013, !1014, !1015}
!1012 = !DILocalVariable(name: "argc_names", arg: 2, scope: !1006, file: !3, line: 458, type: !1009)
!1013 = !DILocalVariable(name: "argv_names", arg: 3, scope: !1006, file: !3, line: 458, type: !1010)
!1014 = !DILocalVariable(name: "n_users", scope: !1006, file: !3, line: 460, type: !677)
!1015 = !DILocalVariable(name: "utmp_buf", scope: !1006, file: !3, line: 461, type: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!1017 = !DILocation(line: 0, scope: !1006, inlinedAt: !1018)
!1018 = distinct !DILocation(line: 613, column: 5, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !948, file: !3, line: 612, column: 7)
!1020 = !DILocation(line: 460, column: 3, scope: !1006, inlinedAt: !1018)
!1021 = !DILocation(line: 461, column: 3, scope: !1006, inlinedAt: !1018)
!1022 = !DILocation(line: 462, column: 7, scope: !1023, inlinedAt: !1018)
!1023 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 462, column: 7)
!1024 = !DILocation(line: 462, column: 73, scope: !1023, inlinedAt: !1018)
!1025 = !DILocation(line: 462, column: 7, scope: !1006, inlinedAt: !1018)
!1026 = !DILocation(line: 463, column: 5, scope: !1023, inlinedAt: !1018)
!1027 = !DILocation(line: 613, column: 43, scope: !1019)
!1028 = !DILocation(line: 465, column: 17, scope: !1006, inlinedAt: !1018)
!1029 = !{!1030, !1030, i64 0}
!1030 = !{!"long", !733, i64 0}
!1031 = !DILocation(line: 465, column: 26, scope: !1006, inlinedAt: !1018)
!1032 = !DILocation(line: 465, column: 3, scope: !1006, inlinedAt: !1018)
!1033 = !DILocation(line: 466, column: 3, scope: !1006, inlinedAt: !1018)
!1034 = !DILocation(line: 615, column: 31, scope: !1019)
!1035 = !DILocalVariable(name: "argc_names", arg: 1, scope: !1036, file: !3, line: 470, type: !1009)
!1036 = distinct !DISubprogram(name: "long_pinky", scope: !3, file: !3, line: 470, type: !1037, scopeLine: 471, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1039)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !1009, !1010}
!1039 = !{!1035, !1040, !1041}
!1040 = !DILocalVariable(name: "argv_names", arg: 2, scope: !1036, file: !3, line: 470, type: !1010)
!1041 = !DILocalVariable(name: "i", scope: !1042, file: !3, line: 472, type: !59)
!1042 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 472, column: 3)
!1043 = !DILocation(line: 0, scope: !1036, inlinedAt: !1044)
!1044 = distinct !DILocation(line: 615, column: 5, scope: !1019)
!1045 = !DILocation(line: 0, scope: !1042, inlinedAt: !1044)
!1046 = !DILocation(line: 472, column: 21, scope: !1047, inlinedAt: !1044)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 472, column: 3)
!1048 = !DILocation(line: 472, column: 3, scope: !1042, inlinedAt: !1044)
!1049 = !DILocation(line: 473, column: 23, scope: !1047, inlinedAt: !1044)
!1050 = !DILocalVariable(name: "name", arg: 1, scope: !1051, file: !3, line: 345, type: !64)
!1051 = distinct !DISubprogram(name: "print_long_entry", scope: !3, file: !3, line: 345, type: !753, scopeLine: 346, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1052)
!1052 = !{!1050, !1053, !1054, !1057}
!1053 = !DILocalVariable(name: "pw", scope: !1051, file: !3, line: 347, type: !254)
!1054 = !DILocalVariable(name: "comma", scope: !1055, file: !3, line: 361, type: !268)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 360, column: 5)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 353, column: 7)
!1057 = !DILocalVariable(name: "result", scope: !1055, file: !3, line: 366, type: !56)
!1058 = !DILocation(line: 0, scope: !1051, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 473, column: 5, scope: !1047, inlinedAt: !1044)
!1060 = !DILocation(line: 347, column: 23, scope: !1051, inlinedAt: !1059)
!1061 = !DILocation(line: 349, column: 3, scope: !1051, inlinedAt: !1059)
!1062 = !DILocation(line: 350, column: 3, scope: !1051, inlinedAt: !1059)
!1063 = !DILocation(line: 352, column: 3, scope: !1051, inlinedAt: !1059)
!1064 = !DILocation(line: 353, column: 10, scope: !1056, inlinedAt: !1059)
!1065 = !DILocation(line: 353, column: 7, scope: !1051, inlinedAt: !1059)
!1066 = !DILocation(line: 356, column: 7, scope: !1067, inlinedAt: !1059)
!1067 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 354, column: 5)
!1068 = !DILocation(line: 357, column: 7, scope: !1067, inlinedAt: !1059)
!1069 = !DILocation(line: 361, column: 39, scope: !1055, inlinedAt: !1059)
!1070 = !{!1071, !732, i64 24}
!1071 = !{!"passwd", !732, i64 0, !732, i64 8, !829, i64 16, !829, i64 20, !732, i64 24, !732, i64 32, !732, i64 40}
!1072 = !DILocation(line: 361, column: 27, scope: !1055, inlinedAt: !1059)
!1073 = !DILocation(line: 0, scope: !1055, inlinedAt: !1059)
!1074 = !DILocation(line: 363, column: 11, scope: !1075, inlinedAt: !1059)
!1075 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 363, column: 11)
!1076 = !DILocation(line: 363, column: 11, scope: !1055, inlinedAt: !1059)
!1077 = !DILocation(line: 364, column: 16, scope: !1075, inlinedAt: !1059)
!1078 = !DILocation(line: 366, column: 43, scope: !1055, inlinedAt: !1059)
!1079 = !DILocation(line: 364, column: 9, scope: !1075, inlinedAt: !1059)
!1080 = !DILocation(line: 366, column: 57, scope: !1055, inlinedAt: !1059)
!1081 = !{!1071, !732, i64 0}
!1082 = !DILocation(line: 366, column: 22, scope: !1055, inlinedAt: !1059)
!1083 = !DILocation(line: 367, column: 7, scope: !1055, inlinedAt: !1059)
!1084 = !DILocation(line: 368, column: 7, scope: !1055, inlinedAt: !1059)
!1085 = !DILocalVariable(name: "__c", arg: 1, scope: !1086, file: !1087, line: 108, type: !59)
!1086 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1087, file: !1087, line: 108, type: !1088, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1090)
!1087 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!59, !59}
!1090 = !{!1085}
!1091 = !DILocation(line: 0, scope: !1086, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 371, column: 3, scope: !1051, inlinedAt: !1059)
!1093 = !DILocation(line: 110, column: 10, scope: !1086, inlinedAt: !1092)
!1094 = !{!1095, !732, i64 40}
!1095 = !{!"_IO_FILE", !829, i64 0, !732, i64 8, !732, i64 16, !732, i64 24, !732, i64 32, !732, i64 40, !732, i64 48, !732, i64 56, !732, i64 64, !732, i64 72, !732, i64 80, !732, i64 88, !732, i64 96, !732, i64 104, !829, i64 112, !829, i64 116, !1030, i64 120, !863, i64 128, !733, i64 130, !733, i64 131, !732, i64 136, !1030, i64 144, !732, i64 152, !732, i64 160, !732, i64 168, !732, i64 176, !1030, i64 184, !829, i64 192, !733, i64 196}
!1096 = !{!1095, !732, i64 48}
!1097 = !{!"branch_weights", i32 2000, i32 1}
!1098 = !DILocation(line: 373, column: 7, scope: !1099, inlinedAt: !1059)
!1099 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 373, column: 7)
!1100 = !DILocation(line: 373, column: 7, scope: !1051, inlinedAt: !1059)
!1101 = !DILocation(line: 375, column: 7, scope: !1102, inlinedAt: !1059)
!1102 = distinct !DILexicalBlock(scope: !1099, file: !3, line: 374, column: 5)
!1103 = !DILocation(line: 376, column: 7, scope: !1102, inlinedAt: !1059)
!1104 = !{!1071, !732, i64 32}
!1105 = !DILocation(line: 377, column: 7, scope: !1102, inlinedAt: !1059)
!1106 = !DILocation(line: 378, column: 7, scope: !1102, inlinedAt: !1059)
!1107 = !{!1071, !732, i64 40}
!1108 = !DILocation(line: 0, scope: !1086, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 379, column: 7, scope: !1102, inlinedAt: !1059)
!1110 = !DILocation(line: 110, column: 10, scope: !1086, inlinedAt: !1109)
!1111 = !DILocation(line: 382, column: 7, scope: !1112, inlinedAt: !1059)
!1112 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 382, column: 7)
!1113 = !DILocation(line: 382, column: 7, scope: !1051, inlinedAt: !1059)
!1114 = !DILocation(line: 383, column: 15, scope: !1112, inlinedAt: !1059)
!1115 = !DILocation(line: 383, column: 35, scope: !1112, inlinedAt: !1059)
!1116 = !DILocation(line: 383, column: 5, scope: !1112, inlinedAt: !1059)
!1117 = !DILocation(line: 385, column: 7, scope: !1118, inlinedAt: !1059)
!1118 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 385, column: 7)
!1119 = !DILocation(line: 385, column: 7, scope: !1051, inlinedAt: !1059)
!1120 = !DILocation(line: 386, column: 15, scope: !1118, inlinedAt: !1059)
!1121 = !DILocation(line: 386, column: 33, scope: !1118, inlinedAt: !1059)
