; ModuleID = 'src/pr.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.COLUMN = type { %struct._IO_FILE*, i8*, i32, i1 (%struct.COLUMN*)*, void (i8)*, i32, i32, i32, i32, i8, i8 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct.calendar = type { i32 (%struct.calendar_date*, i32, i32, i32)*, i8*, i32 }
%struct.calendar_date = type { i32, i32, i32, %struct.infomap* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 739, type: !435, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !157, globals: !160, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/pr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "27d8badc8ebadb1bf01f07d9b3f9f5ef")
!4 = !{!5, !14, !21, !24, !27, !119, !133, !142}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 24, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!16 = !{!17, !18, !19, !20}
!17 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!18 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!19 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!20 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 536, baseType: !7, size: 32, elements: !22)
!22 = !{!23}
!23 = !DIEnumerator(name: "lines_per_header", value: 5)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 538, baseType: !7, size: 32, elements: !25)
!25 = !{!26}
!26 = !DIEnumerator(name: "lines_per_footer", value: 5)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !28, file: !3, line: 388, baseType: !7, size: 32, elements: !114)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "COLUMN", file: !3, line: 384, size: 512, elements: !29)
!29 = !{!30, !94, !97, !98, !104, !108, !109, !110, !111, !112, !113}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !28, file: !3, line: 386, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !33, line: 7, baseType: !34)
!33 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !35, line: 49, size: 1728, elements: !36)
!35 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!36 = !{!37, !39, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !55, !57, !58, !59, !63, !65, !67, !71, !74, !76, !79, !82, !83, !85, !89, !90}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !34, file: !35, line: 51, baseType: !38, size: 32)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !34, file: !35, line: 54, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !34, file: !35, line: 55, baseType: !40, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !34, file: !35, line: 56, baseType: !40, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !34, file: !35, line: 57, baseType: !40, size: 64, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !34, file: !35, line: 58, baseType: !40, size: 64, offset: 320)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !34, file: !35, line: 59, baseType: !40, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !34, file: !35, line: 60, baseType: !40, size: 64, offset: 448)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !34, file: !35, line: 61, baseType: !40, size: 64, offset: 512)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !34, file: !35, line: 64, baseType: !40, size: 64, offset: 576)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !34, file: !35, line: 65, baseType: !40, size: 64, offset: 640)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !34, file: !35, line: 66, baseType: !40, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !34, file: !35, line: 68, baseType: !53, size: 64, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !35, line: 36, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !34, file: !35, line: 70, baseType: !56, size: 64, offset: 832)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !34, file: !35, line: 72, baseType: !38, size: 32, offset: 896)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !34, file: !35, line: 73, baseType: !38, size: 32, offset: 928)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !34, file: !35, line: 74, baseType: !60, size: 64, offset: 960)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 152, baseType: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!62 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !34, file: !35, line: 77, baseType: !64, size: 16, offset: 1024)
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !34, file: !35, line: 78, baseType: !66, size: 8, offset: 1040)
!66 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !34, file: !35, line: 79, baseType: !68, size: 8, offset: 1048)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !34, file: !35, line: 81, baseType: !72, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !35, line: 43, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !34, file: !35, line: 89, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 153, baseType: !62)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !34, file: !35, line: 91, baseType: !77, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !35, line: 37, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !34, file: !35, line: 92, baseType: !80, size: 64, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !35, line: 38, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !34, file: !35, line: 93, baseType: !56, size: 64, offset: 1344)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !34, file: !35, line: 94, baseType: !84, size: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !34, file: !35, line: 95, baseType: !86, size: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 46, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!88 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !34, file: !35, line: 96, baseType: !38, size: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !34, file: !35, line: 98, baseType: !91, size: 160, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !3, line: 387, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !28, file: !3, line: 396, baseType: !27, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "print_func", scope: !28, file: !3, line: 399, baseType: !99, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !103}
!102 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "char_func", scope: !28, file: !3, line: 402, baseType: !105, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !41}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "current_line", scope: !28, file: !3, line: 404, baseType: !38, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "lines_stored", scope: !28, file: !3, line: 405, baseType: !38, size: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "lines_to_print", scope: !28, file: !3, line: 406, baseType: !38, size: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "start_position", scope: !28, file: !3, line: 407, baseType: !38, size: 32, offset: 416)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !28, file: !3, line: 408, baseType: !102, size: 8, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "full_page_printed", scope: !28, file: !3, line: 409, baseType: !102, size: 8, offset: 456)
!114 = !{!115, !116, !117, !118}
!115 = !DIEnumerator(name: "OPEN", value: 0)
!116 = !DIEnumerator(name: "FF_FOUND", value: 1)
!117 = !DIEnumerator(name: "ON_HOLD", value: 2)
!118 = !DIEnumerator(name: "CLOSED", value: 3)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !120, line: 42, baseType: !7, size: 32, elements: !121)
!120 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!122 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!123 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!124 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!125 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!126 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!127 = !DIEnumerator(name: "c_quoting_style", value: 5)
!128 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!129 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!130 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!131 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!132 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !134, line: 44, baseType: !7, size: 32, elements: !135)
!134 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!137 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!138 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!139 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!140 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!141 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!142 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 46, baseType: !7, size: 32, elements: !144)
!143 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!145 = !DIEnumerator(name: "_ISupper", value: 256)
!146 = !DIEnumerator(name: "_ISlower", value: 512)
!147 = !DIEnumerator(name: "_ISalpha", value: 1024)
!148 = !DIEnumerator(name: "_ISdigit", value: 2048)
!149 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!150 = !DIEnumerator(name: "_ISspace", value: 8192)
!151 = !DIEnumerator(name: "_ISprint", value: 16384)
!152 = !DIEnumerator(name: "_ISgraph", value: 32768)
!153 = !DIEnumerator(name: "_ISblank", value: 1)
!154 = !DIEnumerator(name: "_IScntrl", value: 2)
!155 = !DIEnumerator(name: "_ISpunct", value: 4)
!156 = !DIEnumerator(name: "_ISalnum", value: 8)
!157 = !{!84, !40, !102, !38, !7, !62, !88, !158, !159, !64, !86, !95}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !{!161, !163, !165, !0, !171, !185, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !280, !354, !356, !358, !360, !362, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404}
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "custom_header", scope: !2, file: !3, line: 708, type: !40, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "date_format", scope: !2, file: !3, line: 711, type: !95, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "localtz", scope: !2, file: !3, line: 714, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !168, line: 1039, baseType: !169)
!168 = !DIFile(filename: "./lib/time.h", directory: "/src")
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !168, line: 1039, flags: DIFlagFwdDecl)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 742, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 6912, elements: !183)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !176, line: 50, size: 256, elements: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!177 = !{!178, !179, !180, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 52, baseType: !95, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !175, file: !176, line: 55, baseType: !38, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !176, line: 56, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !176, line: 57, baseType: !38, size: 32, offset: 192)
!183 = !{!184}
!184 = !DISubrange(count: 27)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "first_page_number", scope: !2, file: !3, line: 611, type: !187, isLocal: true, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !188, line: 102, baseType: !189)
!188 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !61, line: 73, baseType: !88)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "last_page_number", scope: !2, file: !3, line: 612, type: !187, isLocal: true, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "columns", scope: !2, file: !3, line: 607, type: !38, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "print_across_flag", scope: !2, file: !3, line: 520, type: !102, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "storing_columns", scope: !2, file: !3, line: 523, type: !102, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "balance_columns", scope: !2, file: !3, line: 529, type: !102, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "use_cntrl_prefix", scope: !2, file: !3, line: 671, type: !102, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "double_space", scope: !2, file: !3, line: 674, type: !102, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "input_tab_char", scope: !2, file: !3, line: 559, type: !41, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "chars_per_input_tab", scope: !2, file: !3, line: 563, type: !38, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "untabify_input", scope: !2, file: !3, line: 556, type: !102, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "use_form_feed", scope: !2, file: !3, line: 514, type: !102, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "output_tab_char", scope: !2, file: !3, line: 569, type: !41, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "chars_per_output_tab", scope: !2, file: !3, line: 572, type: !38, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "tabify_output", scope: !2, file: !3, line: 566, type: !102, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "join_lines", scope: !2, file: !3, line: 549, type: !102, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "lines_per_page", scope: !2, file: !3, line: 532, type: !38, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "parallel_files", scope: !2, file: !3, line: 479, type: !102, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "numbered_lines", scope: !2, file: !3, line: 636, type: !102, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "number_separator", scope: !2, file: !3, line: 639, type: !41, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "chars_per_number", scope: !2, file: !3, line: 655, type: !38, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "skip_count", scope: !2, file: !3, line: 648, type: !102, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "start_line_num", scope: !2, file: !3, line: 652, type: !38, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "chars_per_margin", scope: !2, file: !3, line: 580, type: !38, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "ignore_failed_opens", scope: !2, file: !3, line: 681, type: !102, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "use_col_separator", scope: !2, file: !3, line: 685, type: !102, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "col_sep_string", scope: !2, file: !3, line: 690, type: !95, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "col_sep_length", scope: !2, file: !3, line: 691, type: !38, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "extremities", scope: !2, file: !3, line: 502, type: !102, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "keep_FF", scope: !2, file: !3, line: 506, type: !102, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "use_esc_sequence", scope: !2, file: !3, line: 667, type: !102, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "truncate_lines", scope: !2, file: !3, line: 545, type: !102, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "chars_per_line", scope: !2, file: !3, line: 542, type: !38, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "explicit_columns", scope: !2, file: !3, line: 499, type: !102, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 517, type: !102, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "failed_opens", scope: !2, file: !3, line: 596, type: !102, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "lines_per_body", scope: !2, file: !3, line: 537, type: !38, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "line_separator", scope: !2, file: !3, line: 693, type: !40, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "column_separator", scope: !2, file: !3, line: 692, type: !40, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 660, type: !38, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "chars_per_column", scope: !2, file: !3, line: 553, type: !38, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "number_buff", scope: !2, file: !3, line: 663, type: !40, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "clump_buff", scope: !2, file: !3, line: 723, type: !40, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "total_files", scope: !2, file: !3, line: 678, type: !38, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "column_vector", scope: !2, file: !3, line: 449, type: !278, isLocal: true, isDefinition: true)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "COLUMN", file: !3, line: 417, baseType: !28)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "timespec", scope: !282, file: !3, line: 1662, type: !314, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "init_header", scope: !3, file: !3, line: 1647, type: !283, scopeLine: 1648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !95, !38}
!285 = !{!286, !287, !288, !289, !327, !328, !329, !344, !348}
!286 = !DILocalVariable(name: "filename", arg: 1, scope: !282, file: !3, line: 1647, type: !95)
!287 = !DILocalVariable(name: "desc", arg: 2, scope: !282, file: !3, line: 1647, type: !38)
!288 = !DILocalVariable(name: "buf", scope: !282, file: !3, line: 1649, type: !40)
!289 = !DILocalVariable(name: "st", scope: !282, file: !3, line: 1650, type: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !291, line: 44, size: 1024, elements: !292)
!291 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!292 = !{!293, !295, !297, !299, !301, !303, !305, !306, !307, !308, !310, !311, !313, !321, !322, !323}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !290, file: !291, line: 46, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !61, line: 145, baseType: !88)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !290, file: !291, line: 47, baseType: !296, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !61, line: 148, baseType: !88)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !290, file: !291, line: 48, baseType: !298, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !61, line: 150, baseType: !7)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !290, file: !291, line: 49, baseType: !300, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !61, line: 151, baseType: !7)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !290, file: !291, line: 50, baseType: !302, size: 32, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !61, line: 146, baseType: !7)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !290, file: !291, line: 51, baseType: !304, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !61, line: 147, baseType: !7)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !290, file: !291, line: 52, baseType: !294, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !290, file: !291, line: 53, baseType: !294, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !290, file: !291, line: 54, baseType: !60, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !290, file: !291, line: 55, baseType: !309, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !61, line: 175, baseType: !38)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !290, file: !291, line: 56, baseType: !38, size: 32, offset: 480)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !290, file: !291, line: 57, baseType: !312, size: 64, offset: 512)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !61, line: 180, baseType: !62)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !290, file: !291, line: 65, baseType: !314, size: 128, offset: 576)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !315, line: 11, size: 128, elements: !316)
!315 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!316 = !{!317, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !314, file: !315, line: 16, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !61, line: 160, baseType: !62)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !314, file: !315, line: 21, baseType: !320, size: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !61, line: 197, baseType: !62)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !290, file: !291, line: 66, baseType: !314, size: 128, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !290, file: !291, line: 67, baseType: !314, size: 128, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !290, file: !291, line: 79, baseType: !324, size: 64, offset: 960)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 64, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 2)
!327 = !DILocalVariable(name: "t", scope: !282, file: !3, line: 1651, type: !314)
!328 = !DILocalVariable(name: "ns", scope: !282, file: !3, line: 1652, type: !38)
!329 = !DILocalVariable(name: "tm", scope: !282, file: !3, line: 1653, type: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !331, line: 7, size: 448, elements: !332)
!331 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !330, file: !331, line: 9, baseType: !38, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !330, file: !331, line: 10, baseType: !38, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !330, file: !331, line: 11, baseType: !38, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !330, file: !331, line: 12, baseType: !38, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !330, file: !331, line: 13, baseType: !38, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !330, file: !331, line: 14, baseType: !38, size: 32, offset: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !330, file: !331, line: 15, baseType: !38, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !330, file: !331, line: 16, baseType: !38, size: 32, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !330, file: !331, line: 17, baseType: !38, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !330, file: !331, line: 20, baseType: !62, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !330, file: !331, line: 21, baseType: !95, size: 64, offset: 384)
!344 = !DILocalVariable(name: "len", scope: !345, file: !3, line: 1671, type: !347)
!345 = distinct !DILexicalBlock(scope: !346, file: !3, line: 1670, column: 5)
!346 = distinct !DILexicalBlock(scope: !282, file: !3, line: 1669, column: 7)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !87, line: 35, baseType: !62)
!348 = !DILocalVariable(name: "secbuf", scope: !349, file: !3, line: 1681, type: !351)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 1680, column: 5)
!350 = distinct !DILexicalBlock(scope: !282, file: !3, line: 1679, column: 7)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 168, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 21)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "date_text", scope: !2, file: !3, line: 717, type: !40, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "file_text", scope: !2, file: !3, line: 718, type: !95, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "header_width_available", scope: !2, file: !3, line: 721, type: !38, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "files_ready_to_read", scope: !2, file: !3, line: 615, type: !38, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "buff_allocated", scope: !2, file: !3, line: 463, type: !364, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !365, line: 130, baseType: !347)
!365 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "line_vector", scope: !2, file: !3, line: 469, type: !181, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "end_vector", scope: !2, file: !3, line: 476, type: !181, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "buff", scope: !2, file: !3, line: 455, type: !40, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "last_line", scope: !2, file: !3, line: 729, type: !102, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "page_number", scope: !2, file: !3, line: 618, type: !187, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "buff_current", scope: !2, file: !3, line: 459, type: !7, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "pad_vertically", scope: !2, file: !3, line: 705, type: !102, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "print_a_header", scope: !2, file: !3, line: 511, type: !102, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "padding_not_printed", scope: !2, file: !3, line: 701, type: !38, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "separators_not_printed", scope: !2, file: !3, line: 697, type: !38, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "spaces_not_printed", scope: !2, file: !3, line: 577, type: !38, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "output_position", scope: !2, file: !3, line: 586, type: !38, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "input_position", scope: !2, file: !3, line: 592, type: !38, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "FF_only", scope: !2, file: !3, line: 494, type: !102, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "print_a_FF", scope: !2, file: !3, line: 507, type: !102, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "align_empty_cols", scope: !2, file: !3, line: 483, type: !102, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "empty_line", scope: !2, file: !3, line: 487, type: !102, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "line_count", scope: !2, file: !3, line: 643, type: !38, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "line_number", scope: !2, file: !3, line: 633, type: !38, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !406, file: !407, line: 575, type: !38, isLocal: true, isDefinition: true)
!406 = distinct !DISubprogram(name: "oputs_", scope: !407, file: !407, line: 573, type: !408, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!407 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!408 = !DISubroutineType(types: !409)
!409 = !{null, !95, !95}
!410 = !{!411, !412, !413, !416, !417, !418, !419, !423, !424, !425, !426, !428, !429, !430, !431, !433, !434}
!411 = !DILocalVariable(name: "program", arg: 1, scope: !406, file: !407, line: 573, type: !95)
!412 = !DILocalVariable(name: "option", arg: 2, scope: !406, file: !407, line: 573, type: !95)
!413 = !DILocalVariable(name: "term", scope: !414, file: !407, line: 585, type: !95)
!414 = distinct !DILexicalBlock(scope: !415, file: !407, line: 582, column: 5)
!415 = distinct !DILexicalBlock(scope: !406, file: !407, line: 581, column: 7)
!416 = !DILocalVariable(name: "double_space", scope: !406, file: !407, line: 594, type: !102)
!417 = !DILocalVariable(name: "first_word", scope: !406, file: !407, line: 595, type: !95)
!418 = !DILocalVariable(name: "option_text", scope: !406, file: !407, line: 596, type: !95)
!419 = !DILocalVariable(name: "s", scope: !420, file: !407, line: 608, type: !95)
!420 = distinct !DILexicalBlock(scope: !421, file: !407, line: 605, column: 5)
!421 = distinct !DILexicalBlock(scope: !422, file: !407, line: 604, column: 12)
!422 = distinct !DILexicalBlock(scope: !406, file: !407, line: 597, column: 7)
!423 = !DILocalVariable(name: "spaces", scope: !420, file: !407, line: 609, type: !86)
!424 = !DILocalVariable(name: "anchor_len", scope: !406, file: !407, line: 620, type: !86)
!425 = !DILocalVariable(name: "desc_text", scope: !406, file: !407, line: 625, type: !95)
!426 = !DILocalVariable(name: "__ptr", scope: !427, file: !407, line: 644, type: !95)
!427 = distinct !DILexicalBlock(scope: !406, file: !407, line: 644, column: 3)
!428 = !DILocalVariable(name: "__stream", scope: !427, file: !407, line: 644, type: !31)
!429 = !DILocalVariable(name: "__cnt", scope: !427, file: !407, line: 644, type: !86)
!430 = !DILocalVariable(name: "url_program", scope: !406, file: !407, line: 648, type: !95)
!431 = !DILocalVariable(name: "__ptr", scope: !432, file: !407, line: 686, type: !95)
!432 = distinct !DILexicalBlock(scope: !406, file: !407, line: 686, column: 3)
!433 = !DILocalVariable(name: "__stream", scope: !432, file: !407, line: 686, type: !31)
!434 = !DILocalVariable(name: "__cnt", scope: !432, file: !407, line: 686, type: !86)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 424, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 53)
!438 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!439 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!440 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!441 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!442 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!443 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!444 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!445 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!446 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!447 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!448 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!449 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!450 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!451 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!452 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!453 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!454 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!455 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!456 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!457 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!458 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!459 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!460 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!461 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!462 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!463 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!464 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "Version", scope: !467, file: !468, line: 3, type: !95, isLocal: false, isDefinition: true)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !469, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!469 = !{!465}
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "file_name", scope: !472, file: !473, line: 45, type: !95, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !474, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!474 = !{!470, !475}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !472, file: !473, line: 55, type: !102, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !479, file: !480, line: 66, type: !515, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!481 = !{!84, !159}
!482 = !{!483, !509, !477, !511, !513}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "old_file_name", scope: !485, file: !480, line: 304, type: !95, isLocal: true, isDefinition: true)
!485 = distinct !DISubprogram(name: "verror_at_line", scope: !480, file: !480, line: 298, type: !486, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !502)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !38, !38, !95, !7, !95, !488}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !489, line: 52, baseType: !490)
!489 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !491, line: 32, baseType: !492)
!491 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !493, baseType: !494)
!493 = !DIFile(filename: "lib/error.c", directory: "/src")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !495, size: 256, elements: !496)
!495 = !DINamespace(name: "std", scope: null)
!496 = !{!497, !498, !499, !500, !501}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !494, file: !493, baseType: !84, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !494, file: !493, baseType: !84, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !494, file: !493, baseType: !84, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !494, file: !493, baseType: !38, size: 32, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !494, file: !493, baseType: !38, size: 32, offset: 224)
!502 = !{!503, !504, !505, !506, !507, !508}
!503 = !DILocalVariable(name: "status", arg: 1, scope: !485, file: !480, line: 298, type: !38)
!504 = !DILocalVariable(name: "errnum", arg: 2, scope: !485, file: !480, line: 298, type: !38)
!505 = !DILocalVariable(name: "file_name", arg: 3, scope: !485, file: !480, line: 298, type: !95)
!506 = !DILocalVariable(name: "line_number", arg: 4, scope: !485, file: !480, line: 298, type: !7)
!507 = !DILocalVariable(name: "message", arg: 5, scope: !485, file: !480, line: 298, type: !95)
!508 = !DILocalVariable(name: "args", arg: 6, scope: !485, file: !480, line: 298, type: !488)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "old_line_number", scope: !485, file: !480, line: 305, type: !7, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "error_message_count", scope: !479, file: !480, line: 69, type: !7, isLocal: false, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !479, file: !480, line: 295, type: !38, isLocal: false, isDefinition: true)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !520, file: !548, line: 75, type: !561, isLocal: true, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, retainedTypes: !531, globals: !545, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/nstrftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1a46cf0b441bf81ebaa8e46decf753ed")
!522 = !{!523}
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !524, line: 163, baseType: !7, size: 32, elements: !525)
!524 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!525 = !{!526, !527, !528, !529, !530}
!526 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!527 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!528 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!529 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!530 = !DIEnumerator(name: "NO_PAD", value: 4)
!531 = !{!84, !7, !102, !62, !88, !532, !86, !38, !159, !534}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !168, line: 1039, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !537, line: 24, size: 128, elements: !538)
!537 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!538 = !{!539, !540, !541}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !537, line: 28, baseType: !535, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !536, file: !537, line: 33, baseType: !41, size: 8, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !536, file: !537, line: 45, baseType: !542, offset: 72)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: -1)
!545 = !{!518, !546, !558, !578, !583, !586}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !520, file: !548, line: 21, type: !549, isLocal: true, isDefinition: true)
!548 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1920, elements: !556)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !552, line: 19, size: 128, elements: !553)
!552 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !551, file: !552, line: 21, baseType: !95, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !551, file: !552, line: 22, baseType: !95, size: 64, offset: 64)
!556 = !{!557}
!557 = !DISubrange(count: 15)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !520, file: !560, line: 131, type: !561, isLocal: true, isDefinition: true)
!560 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !552, line: 33, size: 192, elements: !563)
!563 = !{!564, !576, !577}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !562, file: !552, line: 39, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!38, !568, !38, !38, !38}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !552, line: 25, size: 192, elements: !570)
!570 = !{!571, !572, !573, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !569, file: !552, line: 27, baseType: !38, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !569, file: !552, line: 28, baseType: !38, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !569, file: !552, line: 29, baseType: !38, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !569, file: !552, line: 30, baseType: !575, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !562, file: !552, line: 42, baseType: !95, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !562, file: !552, line: 44, baseType: !7, size: 32, offset: 128)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !520, file: !560, line: 37, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1536, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 12)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !520, file: !585, line: 76, type: !561, isLocal: true, isDefinition: true)
!585 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !520, file: !585, line: 21, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1664, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 13)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "program_name", scope: !593, file: !594, line: 31, type: !95, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, globals: !596, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!595 = !{!40}
!596 = !{!591}
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "utf07FF", scope: !599, file: !600, line: 46, type: !630, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "proper_name_lite", scope: !600, file: !600, line: 38, type: !601, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !603, retainedNodes: !605)
!600 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!601 = !DISubroutineType(types: !602)
!602 = !{!95, !95, !95}
!603 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !604, splitDebugInlining: false, nameTableKind: None)
!604 = !{!597}
!605 = !{!606, !607, !608, !609, !614}
!606 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !599, file: !600, line: 38, type: !95)
!607 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !599, file: !600, line: 38, type: !95)
!608 = !DILocalVariable(name: "translation", scope: !599, file: !600, line: 40, type: !95)
!609 = !DILocalVariable(name: "w", scope: !599, file: !600, line: 47, type: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !611, line: 37, baseType: !612)
!611 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !61, line: 57, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !61, line: 42, baseType: !7)
!614 = !DILocalVariable(name: "mbs", scope: !599, file: !600, line: 48, type: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !616, line: 6, baseType: !617)
!616 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !618, line: 21, baseType: !619)
!618 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 13, size: 64, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !619, file: !618, line: 15, baseType: !38, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !619, file: !618, line: 20, baseType: !623, size: 32, offset: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !618, line: 16, size: 32, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !623, file: !618, line: 18, baseType: !7, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !623, file: !618, line: 19, baseType: !627, size: 32)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 4)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !325)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !633, file: !634, line: 76, type: !702, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !634, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !641, globals: !642, splitDebugInlining: false, nameTableKind: None)
!634 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!635 = !{!119, !636, !142}
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !120, line: 254, baseType: !7, size: 32, elements: !637)
!637 = !{!638, !639, !640}
!638 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!639 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!640 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!641 = !{!38, !64, !86}
!642 = !{!631, !643, !649, !661, !663, !668, !691, !698, !700}
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !633, file: !634, line: 92, type: !645, isLocal: false, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 320, elements: !647)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!647 = !{!648}
!648 = !DISubrange(count: 10)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !633, file: !634, line: 1040, type: !651, isLocal: false, isDefinition: true)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !634, line: 56, size: 448, elements: !652)
!652 = !{!653, !654, !655, !659, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !651, file: !634, line: 59, baseType: !119, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !651, file: !634, line: 62, baseType: !38, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !651, file: !634, line: 66, baseType: !656, size: 256, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 8)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !651, file: !634, line: 69, baseType: !95, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !651, file: !634, line: 72, baseType: !95, size: 64, offset: 384)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !633, file: !634, line: 107, type: !651, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "slot0", scope: !633, file: !634, line: 831, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 256)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "quote", scope: !670, file: !634, line: 228, type: !689, isLocal: true, isDefinition: true)
!670 = distinct !DISubprogram(name: "gettext_quote", scope: !634, file: !634, line: 197, type: !671, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{!95, !95, !119}
!673 = !{!674, !675, !676, !677, !678}
!674 = !DILocalVariable(name: "msgid", arg: 1, scope: !670, file: !634, line: 197, type: !95)
!675 = !DILocalVariable(name: "s", arg: 2, scope: !670, file: !634, line: 197, type: !119)
!676 = !DILocalVariable(name: "translation", scope: !670, file: !634, line: 199, type: !95)
!677 = !DILocalVariable(name: "w", scope: !670, file: !634, line: 229, type: !610)
!678 = !DILocalVariable(name: "mbs", scope: !670, file: !634, line: 230, type: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !616, line: 6, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !618, line: 21, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 13, size: 64, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !681, file: !618, line: 15, baseType: !38, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !681, file: !618, line: 20, baseType: !685, size: 32, offset: 32)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !681, file: !618, line: 16, size: 32, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !685, file: !618, line: 18, baseType: !7, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !685, file: !618, line: 19, baseType: !627, size: 32)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 64, elements: !690)
!690 = !{!326, !629}
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "slotvec", scope: !633, file: !634, line: 834, type: !693, isLocal: true, isDefinition: true)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !634, line: 823, size: 128, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !694, file: !634, line: 825, baseType: !86, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !694, file: !634, line: 826, baseType: !40, size: 64, offset: 64)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "nslots", scope: !633, file: !634, line: 832, type: !38, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "slotvec0", scope: !633, file: !634, line: 833, type: !694, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 704, elements: !704)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!704 = !{!705}
!705 = !DISubrange(count: 11)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !708, file: !709, line: 26, type: !711, isLocal: false, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !710, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!710 = !{!706}
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 376, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 47)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "exit_failure", scope: !716, file: !717, line: 24, type: !719, isLocal: false, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!718 = !{!714}
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !722, file: !723, line: 506, type: !38, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !723, file: !723, line: 485, type: !724, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !726, retainedNodes: !728)
!723 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!724 = !DISubroutineType(types: !725)
!725 = !{!38, !38, !38}
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !727, splitDebugInlining: false, nameTableKind: None)
!727 = !{!720}
!728 = !{!729, !730, !731, !732, !735}
!729 = !DILocalVariable(name: "fd", arg: 1, scope: !722, file: !723, line: 485, type: !38)
!730 = !DILocalVariable(name: "target", arg: 2, scope: !722, file: !723, line: 485, type: !38)
!731 = !DILocalVariable(name: "result", scope: !722, file: !723, line: 487, type: !38)
!732 = !DILocalVariable(name: "flags", scope: !733, file: !723, line: 530, type: !38)
!733 = distinct !DILexicalBlock(scope: !734, file: !723, line: 529, column: 5)
!734 = distinct !DILexicalBlock(scope: !722, file: !723, line: 528, column: 7)
!735 = !DILocalVariable(name: "saved_errno", scope: !736, file: !723, line: 533, type: !38)
!736 = distinct !DILexicalBlock(scope: !737, file: !723, line: 532, column: 9)
!737 = distinct !DILexicalBlock(scope: !733, file: !723, line: 531, column: 11)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "internal_state", scope: !740, file: !741, line: 97, type: !744, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !742, globals: !743, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!742 = !{!84, !86, !159}
!743 = !{!738}
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !616, line: 6, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !618, line: 21, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !618, line: 13, size: 64, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !746, file: !618, line: 15, baseType: !38, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !746, file: !618, line: 20, baseType: !750, size: 32, offset: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !746, file: !618, line: 16, size: 32, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !750, file: !618, line: 18, baseType: !7, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !750, file: !618, line: 19, baseType: !627, size: 32)
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !756, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!756 = !{!133}
!757 = distinct !DICompileUnit(language: DW_LANG_C99, file: !758, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!761 = !{!84}
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !776, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !188, line: 101, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !61, line: 72, baseType: !62)
!779 = distinct !DICompileUnit(language: DW_LANG_C99, file: !780, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !781, retainedTypes: !782, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "lib/mbswidth.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5547599ee8935b5c6a098eaefb8b2ab0")
!781 = !{!142}
!782 = !{!86, !159, !38, !64}
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !789, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/time_rz.c", directory: "/src", checksumkind: CSK_MD5, checksum: "77903e6b2ced3335152eaec7e7af65ee")
!789 = !{!790}
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !788, line: 82, baseType: !7, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!793 = !{!794, !40}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !168, line: 1039, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !537, line: 24, size: 128, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !537, line: 28, baseType: !795, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !796, file: !537, line: 33, baseType: !41, size: 8, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !796, file: !537, line: 45, baseType: !542, offset: 72)
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !804, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !805, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!805 = !{!806}
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !804, line: 40, baseType: !7, size: 32, elements: !807)
!807 = !{!808}
!808 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!811 = !{!812, !824}
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !813, file: !810, line: 188, baseType: !7, size: 32, elements: !822)
!813 = distinct !DISubprogram(name: "x2nrealloc", scope: !810, file: !810, line: 176, type: !814, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !809, retainedNodes: !817)
!814 = !DISubroutineType(types: !815)
!815 = !{!84, !84, !816, !86}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!817 = !{!818, !819, !820, !821}
!818 = !DILocalVariable(name: "p", arg: 1, scope: !813, file: !810, line: 176, type: !84)
!819 = !DILocalVariable(name: "pn", arg: 2, scope: !813, file: !810, line: 176, type: !816)
!820 = !DILocalVariable(name: "s", arg: 3, scope: !813, file: !810, line: 176, type: !86)
!821 = !DILocalVariable(name: "n", scope: !813, file: !810, line: 178, type: !86)
!822 = !{!823}
!823 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !825, file: !810, line: 228, baseType: !7, size: 32, elements: !822)
!825 = distinct !DISubprogram(name: "xpalloc", scope: !810, file: !810, line: 223, type: !826, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !809, retainedNodes: !829)
!826 = !DISubroutineType(types: !827)
!827 = !{!84, !84, !828, !364, !347, !364}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838}
!830 = !DILocalVariable(name: "pa", arg: 1, scope: !825, file: !810, line: 223, type: !84)
!831 = !DILocalVariable(name: "pn", arg: 2, scope: !825, file: !810, line: 223, type: !828)
!832 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !825, file: !810, line: 223, type: !364)
!833 = !DILocalVariable(name: "n_max", arg: 4, scope: !825, file: !810, line: 223, type: !347)
!834 = !DILocalVariable(name: "s", arg: 5, scope: !825, file: !810, line: 223, type: !364)
!835 = !DILocalVariable(name: "n0", scope: !825, file: !810, line: 230, type: !364)
!836 = !DILocalVariable(name: "n", scope: !825, file: !810, line: 237, type: !364)
!837 = !DILocalVariable(name: "nbytes", scope: !825, file: !810, line: 248, type: !364)
!838 = !DILocalVariable(name: "adjusted_nbytes", scope: !825, file: !810, line: 252, type: !364)
!839 = !{!40, !84, !102, !62, !88}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !844, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!844 = !{!5, !14}
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !847, retainedTypes: !848, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!847 = !{!5}
!848 = !{!102, !62, !88, !777}
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !847, retainedTypes: !851, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "lib/xstrtol.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a1112be551b7ea11a9f6293a4923a73")
!851 = !{!102, !62, !88}
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !847, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, retainedTypes: !857, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!856 = !{!5, !142}
!857 = !{!38, !64, !40, !102, !88, !187}
!858 = distinct !DICompileUnit(language: DW_LANG_C99, file: !859, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!864 = !{!865}
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !866, line: 41, baseType: !7, size: 32, elements: !867)
!866 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!868 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!869 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!870 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!871 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!872 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!873 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!874 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!875 = !DIEnumerator(name: "DAY_1", value: 131079)
!876 = !DIEnumerator(name: "DAY_2", value: 131080)
!877 = !DIEnumerator(name: "DAY_3", value: 131081)
!878 = !DIEnumerator(name: "DAY_4", value: 131082)
!879 = !DIEnumerator(name: "DAY_5", value: 131083)
!880 = !DIEnumerator(name: "DAY_6", value: 131084)
!881 = !DIEnumerator(name: "DAY_7", value: 131085)
!882 = !DIEnumerator(name: "ABMON_1", value: 131086)
!883 = !DIEnumerator(name: "ABMON_2", value: 131087)
!884 = !DIEnumerator(name: "ABMON_3", value: 131088)
!885 = !DIEnumerator(name: "ABMON_4", value: 131089)
!886 = !DIEnumerator(name: "ABMON_5", value: 131090)
!887 = !DIEnumerator(name: "ABMON_6", value: 131091)
!888 = !DIEnumerator(name: "ABMON_7", value: 131092)
!889 = !DIEnumerator(name: "ABMON_8", value: 131093)
!890 = !DIEnumerator(name: "ABMON_9", value: 131094)
!891 = !DIEnumerator(name: "ABMON_10", value: 131095)
!892 = !DIEnumerator(name: "ABMON_11", value: 131096)
!893 = !DIEnumerator(name: "ABMON_12", value: 131097)
!894 = !DIEnumerator(name: "MON_1", value: 131098)
!895 = !DIEnumerator(name: "MON_2", value: 131099)
!896 = !DIEnumerator(name: "MON_3", value: 131100)
!897 = !DIEnumerator(name: "MON_4", value: 131101)
!898 = !DIEnumerator(name: "MON_5", value: 131102)
!899 = !DIEnumerator(name: "MON_6", value: 131103)
!900 = !DIEnumerator(name: "MON_7", value: 131104)
!901 = !DIEnumerator(name: "MON_8", value: 131105)
!902 = !DIEnumerator(name: "MON_9", value: 131106)
!903 = !DIEnumerator(name: "MON_10", value: 131107)
!904 = !DIEnumerator(name: "MON_11", value: 131108)
!905 = !DIEnumerator(name: "MON_12", value: 131109)
!906 = !DIEnumerator(name: "AM_STR", value: 131110)
!907 = !DIEnumerator(name: "PM_STR", value: 131111)
!908 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!909 = !DIEnumerator(name: "D_FMT", value: 131113)
!910 = !DIEnumerator(name: "T_FMT", value: 131114)
!911 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!912 = !DIEnumerator(name: "ERA", value: 131116)
!913 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!914 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!915 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!916 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!917 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!918 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!919 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!920 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!921 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!922 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!923 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!924 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!925 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!926 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!927 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!928 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!929 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!930 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!931 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!932 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!933 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!934 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!935 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!936 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!937 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!938 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!939 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!940 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!941 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!942 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!943 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!944 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!945 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!946 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!947 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!948 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!949 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!950 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!951 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!952 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!953 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!954 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!955 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!956 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!957 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!958 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!959 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!960 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!961 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!962 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!963 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!964 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!965 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!966 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!967 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!968 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!969 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!970 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!971 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!972 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!973 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!974 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!975 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!976 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!977 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!978 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!979 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!980 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!981 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!982 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!983 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!984 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!985 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!986 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!987 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!988 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!989 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!990 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!991 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!992 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!993 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!994 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!995 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
