; ModuleID = 'src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }
%struct.arguments = type { i64, %struct.argument*, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.57 }
%union.anon.57 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !22, line: 42, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !{!36, !37, !39, !40, !41, !44, !46, !47, !7}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !42, line: 46, baseType: !43)
!42 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!43 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!46 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!48 = !{!49, !0, !51, !137}
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "exit_status", scope: !2, file: !3, line: 36, type: !39, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !53, file: !54, line: 575, type: !39, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "oputs_", scope: !54, file: !54, line: 573, type: !55, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !57)
!54 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!55 = !DISubroutineType(types: !56)
!56 = !{null, !44, !44}
!57 = !{!58, !59, !60, !63, !64, !65, !66, !70, !71, !72, !73, !75, !131, !132, !133, !135, !136}
!58 = !DILocalVariable(name: "program", arg: 1, scope: !53, file: !54, line: 573, type: !44)
!59 = !DILocalVariable(name: "option", arg: 2, scope: !53, file: !54, line: 573, type: !44)
!60 = !DILocalVariable(name: "term", scope: !61, file: !54, line: 585, type: !44)
!61 = distinct !DILexicalBlock(scope: !62, file: !54, line: 582, column: 5)
!62 = distinct !DILexicalBlock(scope: !53, file: !54, line: 581, column: 7)
!63 = !DILocalVariable(name: "double_space", scope: !53, file: !54, line: 594, type: !47)
!64 = !DILocalVariable(name: "first_word", scope: !53, file: !54, line: 595, type: !44)
!65 = !DILocalVariable(name: "option_text", scope: !53, file: !54, line: 596, type: !44)
!66 = !DILocalVariable(name: "s", scope: !67, file: !54, line: 608, type: !44)
!67 = distinct !DILexicalBlock(scope: !68, file: !54, line: 605, column: 5)
!68 = distinct !DILexicalBlock(scope: !69, file: !54, line: 604, column: 12)
!69 = distinct !DILexicalBlock(scope: !53, file: !54, line: 597, column: 7)
!70 = !DILocalVariable(name: "spaces", scope: !67, file: !54, line: 609, type: !41)
!71 = !DILocalVariable(name: "anchor_len", scope: !53, file: !54, line: 620, type: !41)
!72 = !DILocalVariable(name: "desc_text", scope: !53, file: !54, line: 625, type: !44)
!73 = !DILocalVariable(name: "__ptr", scope: !74, file: !54, line: 644, type: !44)
!74 = distinct !DILexicalBlock(scope: !53, file: !54, line: 644, column: 3)
!75 = !DILocalVariable(name: "__stream", scope: !74, file: !54, line: 644, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !39, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !37, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !37, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !37, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !37, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !37, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !37, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !37, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !37, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !37, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !37, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !37, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !39, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !39, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!104 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !40, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !36, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !41, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !39, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocalVariable(name: "__cnt", scope: !74, file: !54, line: 644, type: !41)
!132 = !DILocalVariable(name: "url_program", scope: !53, file: !54, line: 648, type: !44)
!133 = !DILocalVariable(name: "__ptr", scope: !134, file: !54, line: 686, type: !44)
!134 = distinct !DILexicalBlock(scope: !53, file: !54, line: 686, column: 3)
!135 = !DILocalVariable(name: "__stream", scope: !134, file: !54, line: 686, type: !76)
!136 = !DILocalVariable(name: "__cnt", scope: !134, file: !54, line: 686, type: !41)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !2, file: !3, line: 43, type: !139, isLocal: true, isDefinition: true)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!140 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "Version", scope: !143, file: !144, line: 3, type: !44, isLocal: false, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !145, splitDebugInlining: false, nameTableKind: None)
!144 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!145 = !{!141}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "file_name", scope: !148, file: !149, line: 45, type: !44, isLocal: true, isDefinition: true)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !150, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!150 = !{!146, !151}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !148, file: !149, line: 55, type: !47, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !155, file: !156, line: 66, type: !191, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !157, globals: !158, splitDebugInlining: false, nameTableKind: None)
!156 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!157 = !{!36, !46}
!158 = !{!159, !185, !153, !187, !189}
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "old_file_name", scope: !161, file: !156, line: 304, type: !44, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "verror_at_line", scope: !156, file: !156, line: 298, type: !162, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !178)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !39, !39, !44, !7, !44, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !165, line: 52, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !167, line: 32, baseType: !168)
!167 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !169, baseType: !170)
!169 = !DIFile(filename: "lib/error.c", directory: "/src")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !171, size: 256, elements: !172)
!171 = !DINamespace(name: "std", scope: null)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !170, file: !169, baseType: !36, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !170, file: !169, baseType: !36, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !170, file: !169, baseType: !36, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !170, file: !169, baseType: !39, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !170, file: !169, baseType: !39, size: 32, offset: 224)
!178 = !{!179, !180, !181, !182, !183, !184}
!179 = !DILocalVariable(name: "status", arg: 1, scope: !161, file: !156, line: 298, type: !39)
!180 = !DILocalVariable(name: "errnum", arg: 2, scope: !161, file: !156, line: 298, type: !39)
!181 = !DILocalVariable(name: "file_name", arg: 3, scope: !161, file: !156, line: 298, type: !44)
!182 = !DILocalVariable(name: "line_number", arg: 4, scope: !161, file: !156, line: 298, type: !7)
!183 = !DILocalVariable(name: "message", arg: 5, scope: !161, file: !156, line: 298, type: !44)
!184 = !DILocalVariable(name: "args", arg: 6, scope: !161, file: !156, line: 298, type: !164)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "old_line_number", scope: !161, file: !156, line: 305, type: !7, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "error_message_count", scope: !155, file: !156, line: 69, type: !7, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !155, file: !156, line: 295, type: !39, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "program_name", scope: !196, file: !197, line: 31, type: !44, isLocal: false, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !198, globals: !199, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!198 = !{!37}
!199 = !{!194}
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "utf07FF", scope: !202, file: !203, line: 46, type: !233, isLocal: true, isDefinition: true)
!202 = distinct !DISubprogram(name: "proper_name_lite", scope: !203, file: !203, line: 38, type: !204, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !206, retainedNodes: !208)
!203 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!204 = !DISubroutineType(types: !205)
!205 = !{!44, !44, !44}
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !207, splitDebugInlining: false, nameTableKind: None)
!207 = !{!200}
!208 = !{!209, !210, !211, !212, !217}
!209 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !202, file: !203, line: 38, type: !44)
!210 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !202, file: !203, line: 38, type: !44)
!211 = !DILocalVariable(name: "translation", scope: !202, file: !203, line: 40, type: !44)
!212 = !DILocalVariable(name: "w", scope: !202, file: !203, line: 47, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !214, line: 37, baseType: !215)
!214 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !103, line: 57, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !103, line: 42, baseType: !7)
!217 = !DILocalVariable(name: "mbs", scope: !202, file: !203, line: 48, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !219, line: 6, baseType: !220)
!219 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !221, line: 21, baseType: !222)
!221 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 13, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !222, file: !221, line: 15, baseType: !39, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !222, file: !221, line: 20, baseType: !226, size: 32, offset: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 16, size: 32, elements: !227)
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !226, file: !221, line: 18, baseType: !7, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !226, file: !221, line: 19, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 4)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 2)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !238, file: !239, line: 76, type: !307, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !246, globals: !247, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!240 = !{!21, !241, !5}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 254, baseType: !7, size: 32, elements: !242)
!242 = !{!243, !244, !245}
!243 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!244 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!245 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!246 = !{!39, !40, !41}
!247 = !{!236, !248, !254, !266, !268, !273, !296, !303, !305}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !238, file: !239, line: 92, type: !250, isLocal: false, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !252)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!252 = !{!253}
!253 = !DISubrange(count: 10)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !238, file: !239, line: 1040, type: !256, isLocal: false, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !239, line: 56, size: 448, elements: !257)
!257 = !{!258, !259, !260, !264, !265}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !256, file: !239, line: 59, baseType: !21, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !239, line: 62, baseType: !39, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !256, file: !239, line: 66, baseType: !261, size: 256, offset: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !256, file: !239, line: 69, baseType: !44, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !256, file: !239, line: 72, baseType: !44, size: 64, offset: 384)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !238, file: !239, line: 107, type: !256, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "slot0", scope: !238, file: !239, line: 831, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 256)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "quote", scope: !275, file: !239, line: 228, type: !294, isLocal: true, isDefinition: true)
!275 = distinct !DISubprogram(name: "gettext_quote", scope: !239, file: !239, line: 197, type: !276, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !238, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{!44, !44, !21}
!278 = !{!279, !280, !281, !282, !283}
!279 = !DILocalVariable(name: "msgid", arg: 1, scope: !275, file: !239, line: 197, type: !44)
!280 = !DILocalVariable(name: "s", arg: 2, scope: !275, file: !239, line: 197, type: !21)
!281 = !DILocalVariable(name: "translation", scope: !275, file: !239, line: 199, type: !44)
!282 = !DILocalVariable(name: "w", scope: !275, file: !239, line: 229, type: !213)
!283 = !DILocalVariable(name: "mbs", scope: !275, file: !239, line: 230, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !219, line: 6, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !221, line: 21, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 13, size: 64, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !286, file: !221, line: 15, baseType: !39, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !286, file: !221, line: 20, baseType: !290, size: 32, offset: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !286, file: !221, line: 16, size: 32, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !290, file: !221, line: 18, baseType: !7, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !290, file: !221, line: 19, baseType: !230, size: 32)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 64, elements: !295)
!295 = !{!235, !232}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "slotvec", scope: !238, file: !239, line: 834, type: !298, isLocal: true, isDefinition: true)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !239, line: 823, size: 128, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !239, line: 825, baseType: !41, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !299, file: !239, line: 826, baseType: !37, size: 64, offset: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "nslots", scope: !238, file: !239, line: 832, type: !39, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec0", scope: !238, file: !239, line: 833, type: !299, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 704, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 11)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!311 = distinct !DIGlobalVariable(name: "initialized", scope: !312, file: !313, line: 71, type: !39, isLocal: true, isDefinition: true)
!312 = distinct !DISubprogram(name: "unicode_to_mb", scope: !313, file: !313, line: 64, type: !314, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !322, retainedNodes: !368)
!313 = !DIFile(filename: "lib/unicodeio.c", directory: "/src", checksumkind: CSK_MD5, checksum: "34bd73d3f6fd35e045c925e67e34cd2b")
!314 = !DISubroutineType(types: !315)
!315 = !{!104, !7, !316, !319, !36}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{!104, !44, !41, !36}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!104, !7, !44, !36}
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !323, globals: !362, splitDebugInlining: false, nameTableKind: None)
!323 = !{!324, !326, !327, !41, !328, !36}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !325, line: 29, baseType: !36)
!325 = !DIFile(filename: "/usr/include/iconv.h", directory: "", checksumkind: CSK_MD5, checksum: "694d7c23a6e081413ae05832107726a3")
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !330, file: !80, line: 51, baseType: !39, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !330, file: !80, line: 54, baseType: !37, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !330, file: !80, line: 55, baseType: !37, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !330, file: !80, line: 56, baseType: !37, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !330, file: !80, line: 57, baseType: !37, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !330, file: !80, line: 58, baseType: !37, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !330, file: !80, line: 59, baseType: !37, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !330, file: !80, line: 60, baseType: !37, size: 64, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !330, file: !80, line: 61, baseType: !37, size: 64, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !330, file: !80, line: 64, baseType: !37, size: 64, offset: 576)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !330, file: !80, line: 65, baseType: !37, size: 64, offset: 640)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !330, file: !80, line: 66, baseType: !37, size: 64, offset: 704)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !330, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !330, file: !80, line: 70, baseType: !346, size: 64, offset: 832)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !330, file: !80, line: 72, baseType: !39, size: 32, offset: 896)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !330, file: !80, line: 73, baseType: !39, size: 32, offset: 928)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !330, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !330, file: !80, line: 77, baseType: !40, size: 16, offset: 1024)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !330, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !330, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !330, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !330, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !330, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !330, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !330, file: !80, line: 93, baseType: !346, size: 64, offset: 1344)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !330, file: !80, line: 94, baseType: !36, size: 64, offset: 1408)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !330, file: !80, line: 95, baseType: !41, size: 64, offset: 1472)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !330, file: !80, line: 96, baseType: !39, size: 32, offset: 1536)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !330, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!362 = !{!363, !364, !366}
!363 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "is_utf8", scope: !312, file: !313, line: 72, type: !39, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !312, file: !313, line: 74, type: !324, isLocal: true, isDefinition: true)
!368 = !{!369, !370, !371, !372, !373, !376, !380, !381, !387, !388, !389, !390, !391}
!369 = !DILocalVariable(name: "code", arg: 1, scope: !312, file: !313, line: 64, type: !7)
!370 = !DILocalVariable(name: "success", arg: 2, scope: !312, file: !313, line: 65, type: !316)
!371 = !DILocalVariable(name: "failure", arg: 3, scope: !312, file: !313, line: 67, type: !319)
!372 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !312, file: !313, line: 69, type: !36)
!373 = !DILocalVariable(name: "charset", scope: !374, file: !313, line: 79, type: !44)
!374 = distinct !DILexicalBlock(scope: !375, file: !313, line: 78, column: 5)
!375 = distinct !DILexicalBlock(scope: !312, file: !313, line: 77, column: 7)
!376 = !DILocalVariable(name: "inbuf", scope: !312, file: !313, line: 106, type: !377)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 48, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 6)
!380 = !DILocalVariable(name: "count", scope: !312, file: !313, line: 107, type: !39)
!381 = !DILocalVariable(name: "outbuf", scope: !382, file: !313, line: 114, type: !384)
!382 = distinct !DILexicalBlock(scope: !383, file: !313, line: 113, column: 5)
!383 = distinct !DILexicalBlock(scope: !312, file: !313, line: 112, column: 7)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 200, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 25)
!387 = !DILocalVariable(name: "inptr", scope: !382, file: !313, line: 115, type: !44)
!388 = !DILocalVariable(name: "inbytesleft", scope: !382, file: !313, line: 116, type: !41)
!389 = !DILocalVariable(name: "outptr", scope: !382, file: !313, line: 117, type: !37)
!390 = !DILocalVariable(name: "outbytesleft", scope: !382, file: !313, line: 118, type: !41)
!391 = !DILocalVariable(name: "res", scope: !382, file: !313, line: 121, type: !41)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !394, file: !395, line: 26, type: !397, isLocal: false, isDefinition: true)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !396, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!396 = !{!392}
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 376, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 47)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "exit_failure", scope: !402, file: !403, line: 24, type: !405, isLocal: false, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !404, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!404 = !{!400}
!405 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !39)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !408, file: !434, line: 58, type: !435, isLocal: true, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !433, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!410 = !{!37, !411}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !412, line: 24, baseType: !413)
!412 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !414, line: 41, baseType: !415)
!414 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !414, line: 27, size: 1856, elements: !417)
!417 = !{!418, !424, !427, !430, !431}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !416, file: !414, line: 30, baseType: !419, size: 832)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 832, elements: !422)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !414, line: 30, flags: DIFlagFwdDecl)
!422 = !{!423}
!423 = !DISubrange(count: 13)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !416, file: !414, line: 33, baseType: !425, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !416, file: !414, line: 34, baseType: !428, size: 64, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !416, file: !414, line: 35, baseType: !428, size: 64, offset: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !416, file: !414, line: 38, baseType: !432, size: 832, offset: 1024)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 832, elements: !422)
!433 = !{!406}
!434 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!435 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "internal_state", scope: !438, file: !439, line: 97, type: !442, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!440 = !{!36, !41, !46}
!441 = !{!436}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !219, line: 6, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !221, line: 21, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 13, size: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !444, file: !221, line: 15, baseType: !39, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !444, file: !221, line: 20, baseType: !448, size: 32, offset: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !444, file: !221, line: 16, size: 32, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !448, file: !221, line: 18, baseType: !7, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !448, file: !221, line: 19, baseType: !230, size: 32)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !454, file: !455, line: 211, type: !643, isLocal: true, isDefinition: true)
!454 = distinct !DISubprogram(name: "printf_fetchargs", scope: !455, file: !455, line: 42, type: !456, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !634, retainedNodes: !638)
!455 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!456 = !DISubroutineType(types: !457)
!457 = !{!39, !458, !468}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !167, line: 14, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !460, baseType: !461)
!460 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !171, size: 256, elements: !462)
!462 = !{!463, !464, !465, !466, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !461, file: !460, baseType: !36, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !461, file: !460, baseType: !36, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !461, file: !460, baseType: !36, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !461, file: !460, baseType: !39, size: 32, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !461, file: !460, baseType: !39, size: 32, offset: 224)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !470, line: 185, baseType: !471)
!470 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 179, size: 1920, elements: !472)
!472 = !{!473, !474, !630}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !470, line: 181, baseType: !41, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !471, file: !470, line: 182, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !470, line: 174, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !470, line: 111, size: 256, elements: !478)
!478 = !{!479, !530}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !470, line: 113, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !470, line: 108, baseType: !481)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 47, baseType: !7, size: 32, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!483 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!484 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!485 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!486 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!487 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!488 = !DIEnumerator(name: "TYPE_INT", value: 5)
!489 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!490 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!491 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!492 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!493 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!494 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!495 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!496 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!497 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!498 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!499 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!500 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!501 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!502 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!503 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!504 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!505 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!506 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!507 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!508 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!509 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!510 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!511 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!512 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!513 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!514 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!515 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!516 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!517 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!518 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!519 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!520 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!521 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!522 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!523 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!524 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!525 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!526 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!527 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!528 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!529 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !477, file: !470, line: 172, baseType: !531, size: 128, offset: 128)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !477, file: !470, line: 114, size: 128, elements: !532)
!532 = !{!533, !534, !535, !537, !538, !539, !540, !541, !542, !544, !546, !550, !554, !557, !560, !563, !565, !568, !571, !574, !576, !578, !580, !582, !584, !586, !588, !590, !592, !594, !595, !598, !599, !603, !604, !606, !608, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !531, file: !470, line: 116, baseType: !107, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !531, file: !470, line: 117, baseType: !46, size: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !531, file: !470, line: 118, baseType: !536, size: 16)
!536 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !531, file: !470, line: 119, baseType: !40, size: 16)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !531, file: !470, line: 120, baseType: !39, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !531, file: !470, line: 121, baseType: !7, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !531, file: !470, line: 122, baseType: !104, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !531, file: !470, line: 123, baseType: !43, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !531, file: !470, line: 124, baseType: !543, size: 64)
!543 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !531, file: !470, line: 125, baseType: !545, size: 64)
!545 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !531, file: !470, line: 126, baseType: !547, size: 8)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !548, line: 24, baseType: !549)
!548 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !103, line: 37, baseType: !107)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !531, file: !470, line: 127, baseType: !551, size: 8)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !552, line: 24, baseType: !553)
!552 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !103, line: 38, baseType: !46)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !531, file: !470, line: 128, baseType: !555, size: 16)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !548, line: 25, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !103, line: 39, baseType: !536)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !531, file: !470, line: 129, baseType: !558, size: 16)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !552, line: 25, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !103, line: 40, baseType: !40)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !531, file: !470, line: 130, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !548, line: 26, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !103, line: 41, baseType: !39)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !531, file: !470, line: 131, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !552, line: 26, baseType: !216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !531, file: !470, line: 132, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !548, line: 27, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 44, baseType: !104)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !531, file: !470, line: 133, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !552, line: 27, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !103, line: 45, baseType: !43)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !531, file: !470, line: 134, baseType: !572, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !573, line: 58, baseType: !107)
!573 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!574 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !531, file: !470, line: 135, baseType: !575, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !573, line: 71, baseType: !46)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !531, file: !470, line: 136, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !573, line: 60, baseType: !104)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !531, file: !470, line: 137, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !573, line: 73, baseType: !43)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !531, file: !470, line: 138, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !573, line: 61, baseType: !104)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !531, file: !470, line: 139, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !573, line: 74, baseType: !43)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !531, file: !470, line: 140, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !573, line: 62, baseType: !104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !531, file: !470, line: 141, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !573, line: 75, baseType: !43)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !531, file: !470, line: 142, baseType: !589, size: 32)
!589 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !531, file: !470, line: 143, baseType: !591, size: 64)
!591 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !531, file: !470, line: 144, baseType: !593, size: 128)
!593 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !531, file: !470, line: 145, baseType: !39, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !531, file: !470, line: 147, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !597, line: 20, baseType: !7)
!597 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !531, file: !470, line: 149, baseType: !44, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !531, file: !470, line: 150, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !42, line: 74, baseType: !7)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !531, file: !470, line: 151, baseType: !36, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !531, file: !470, line: 152, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !531, file: !470, line: 153, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !531, file: !470, line: 154, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !531, file: !470, line: 155, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !531, file: !470, line: 156, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !531, file: !470, line: 157, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !531, file: !470, line: 158, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !531, file: !470, line: 159, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !531, file: !470, line: 160, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !531, file: !470, line: 161, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !531, file: !470, line: 162, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !531, file: !470, line: 163, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !531, file: !470, line: 164, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !471, file: !470, line: 183, baseType: !631, size: 1792, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 1792, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 7)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !636, globals: !637, splitDebugInlining: false, nameTableKind: None)
!635 = !{!481}
!636 = !{!36}
!637 = !{!452}
!638 = !{!639, !640, !641, !642}
!639 = !DILocalVariable(name: "args", arg: 1, scope: !454, file: !455, line: 42, type: !458)
!640 = !DILocalVariable(name: "a", arg: 2, scope: !454, file: !455, line: 42, type: !468)
!641 = !DILocalVariable(name: "i", scope: !454, file: !455, line: 44, type: !41)
!642 = !DILocalVariable(name: "ap", scope: !454, file: !455, line: 45, type: !475)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 224, elements: !632)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !650, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!650 = !{!41}
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/unistr/u8-uctomb-aux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "80f3a7ceaaa6337897c5977a21445312")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !655, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!655 = !{!656}
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !654, line: 40, baseType: !7, size: 32, elements: !657)
!657 = !{!658}
!658 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!659 = distinct !DICompileUnit(language: DW_LANG_C99, file: !660, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !661, retainedTypes: !692, splitDebugInlining: false, nameTableKind: None)
!660 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!661 = !{!662, !674}
!662 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !663, file: !660, line: 188, baseType: !7, size: 32, elements: !672)
!663 = distinct !DISubprogram(name: "x2nrealloc", scope: !660, file: !660, line: 176, type: !664, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !659, retainedNodes: !667)
!664 = !DISubroutineType(types: !665)
!665 = !{!36, !36, !666, !41}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!667 = !{!668, !669, !670, !671}
!668 = !DILocalVariable(name: "p", arg: 1, scope: !663, file: !660, line: 176, type: !36)
!669 = !DILocalVariable(name: "pn", arg: 2, scope: !663, file: !660, line: 176, type: !666)
!670 = !DILocalVariable(name: "s", arg: 3, scope: !663, file: !660, line: 176, type: !41)
!671 = !DILocalVariable(name: "n", scope: !663, file: !660, line: 178, type: !41)
!672 = !{!673}
!673 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !675, file: !660, line: 228, baseType: !7, size: 32, elements: !672)
!675 = distinct !DISubprogram(name: "xpalloc", scope: !660, file: !660, line: 223, type: !676, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !659, retainedNodes: !682)
!676 = !DISubroutineType(types: !677)
!677 = !{!36, !36, !678, !679, !681, !679}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !680, line: 130, baseType: !681)
!680 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !42, line: 35, baseType: !104)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691}
!683 = !DILocalVariable(name: "pa", arg: 1, scope: !675, file: !660, line: 223, type: !36)
!684 = !DILocalVariable(name: "pn", arg: 2, scope: !675, file: !660, line: 223, type: !678)
!685 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !675, file: !660, line: 223, type: !679)
!686 = !DILocalVariable(name: "n_max", arg: 4, scope: !675, file: !660, line: 223, type: !681)
!687 = !DILocalVariable(name: "s", arg: 5, scope: !675, file: !660, line: 223, type: !679)
!688 = !DILocalVariable(name: "n0", scope: !675, file: !660, line: 230, type: !679)
!689 = !DILocalVariable(name: "n", scope: !675, file: !660, line: 237, type: !679)
!690 = !DILocalVariable(name: "nbytes", scope: !675, file: !660, line: 248, type: !679)
!691 = !DILocalVariable(name: "adjusted_nbytes", scope: !675, file: !660, line: 252, type: !679)
!692 = !{!37, !36, !47, !104, !43}
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!709 = !{!710}
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 41, baseType: !7, size: 32, elements: !712)
!711 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095}
!713 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!714 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!715 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!716 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!717 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!718 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!719 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!720 = !DIEnumerator(name: "DAY_1", value: 131079)
!721 = !DIEnumerator(name: "DAY_2", value: 131080)
!722 = !DIEnumerator(name: "DAY_3", value: 131081)
!723 = !DIEnumerator(name: "DAY_4", value: 131082)
!724 = !DIEnumerator(name: "DAY_5", value: 131083)
!725 = !DIEnumerator(name: "DAY_6", value: 131084)
!726 = !DIEnumerator(name: "DAY_7", value: 131085)
!727 = !DIEnumerator(name: "ABMON_1", value: 131086)
!728 = !DIEnumerator(name: "ABMON_2", value: 131087)
!729 = !DIEnumerator(name: "ABMON_3", value: 131088)
!730 = !DIEnumerator(name: "ABMON_4", value: 131089)
!731 = !DIEnumerator(name: "ABMON_5", value: 131090)
!732 = !DIEnumerator(name: "ABMON_6", value: 131091)
!733 = !DIEnumerator(name: "ABMON_7", value: 131092)
!734 = !DIEnumerator(name: "ABMON_8", value: 131093)
!735 = !DIEnumerator(name: "ABMON_9", value: 131094)
!736 = !DIEnumerator(name: "ABMON_10", value: 131095)
!737 = !DIEnumerator(name: "ABMON_11", value: 131096)
!738 = !DIEnumerator(name: "ABMON_12", value: 131097)
!739 = !DIEnumerator(name: "MON_1", value: 131098)
!740 = !DIEnumerator(name: "MON_2", value: 131099)
!741 = !DIEnumerator(name: "MON_3", value: 131100)
!742 = !DIEnumerator(name: "MON_4", value: 131101)
!743 = !DIEnumerator(name: "MON_5", value: 131102)
!744 = !DIEnumerator(name: "MON_6", value: 131103)
!745 = !DIEnumerator(name: "MON_7", value: 131104)
!746 = !DIEnumerator(name: "MON_8", value: 131105)
!747 = !DIEnumerator(name: "MON_9", value: 131106)
!748 = !DIEnumerator(name: "MON_10", value: 131107)
!749 = !DIEnumerator(name: "MON_11", value: 131108)
!750 = !DIEnumerator(name: "MON_12", value: 131109)
!751 = !DIEnumerator(name: "AM_STR", value: 131110)
!752 = !DIEnumerator(name: "PM_STR", value: 131111)
!753 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!754 = !DIEnumerator(name: "D_FMT", value: 131113)
!755 = !DIEnumerator(name: "T_FMT", value: 131114)
!756 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!757 = !DIEnumerator(name: "ERA", value: 131116)
!758 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!759 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!760 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!761 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!762 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!763 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!764 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!765 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!766 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!767 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!768 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!769 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!770 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!771 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!772 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!773 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!774 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!775 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!776 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!777 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!778 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!779 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!780 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!781 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!782 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!783 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!784 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!785 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!786 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!787 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!788 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!789 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!790 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!791 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!792 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!793 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!794 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!795 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!796 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!797 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!798 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!799 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!800 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!801 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!802 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!803 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!804 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!805 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!806 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!807 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!808 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!809 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!810 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!811 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!812 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!813 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!814 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!815 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!816 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!817 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!818 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!819 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!820 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!821 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!822 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!823 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!824 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!825 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!826 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!827 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!828 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!829 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!830 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!831 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!832 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!833 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!834 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!835 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!836 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!837 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!838 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!839 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!840 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!841 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!842 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!843 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!844 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!845 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!846 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!847 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!848 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!849 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!850 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!851 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!852 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!853 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!854 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!855 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!856 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!857 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!858 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!859 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!860 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!861 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!862 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!863 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!864 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!865 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!866 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!867 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!868 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!869 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!870 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!871 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!872 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!873 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!874 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!875 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!876 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!877 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!878 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!879 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!880 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!881 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!882 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!883 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!884 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!885 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!886 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!887 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!888 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!889 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!890 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!891 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!892 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!893 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!894 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!895 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!896 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!897 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!898 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!899 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!900 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!901 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!902 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!903 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!904 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!905 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!906 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!907 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!908 = !DIEnumerator(name: "CODESET", value: 14)
!909 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!910 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!911 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!912 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!913 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!914 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!915 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!916 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!917 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!918 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!919 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!920 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!921 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!922 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!923 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!924 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!925 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!926 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!927 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!928 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!929 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!930 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!931 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!932 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!933 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!934 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!935 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!936 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!937 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!938 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!939 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!940 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!941 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!942 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!943 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!944 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!945 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!946 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!947 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!948 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!949 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!950 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!951 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!952 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!953 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!954 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!955 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!956 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!957 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!958 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!959 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!960 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!961 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!962 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!963 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!964 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!965 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!966 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!967 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!968 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!969 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!970 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!971 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!972 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!973 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!974 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!975 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!976 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!977 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!978 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!979 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!980 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!981 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!982 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!983 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!984 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!985 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!986 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!987 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!988 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!989 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!990 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!991 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!992 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!993 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!994 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!995 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!996 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!997 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!998 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!999 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!1000 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!1001 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!1002 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!1003 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!1004 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!1005 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!1006 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!1007 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!1008 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!1009 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!1010 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!1011 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!1012 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!1013 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!1014 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!1015 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!1016 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!1017 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!1018 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!1019 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!1020 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!1021 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!1022 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!1023 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!1024 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!1025 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!1026 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!1027 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!1028 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!1029 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!1030 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!1031 = !DIEnumerator(name: "THOUSEP", value: 65537)
!1032 = !DIEnumerator(name: "__GROUPING", value: 65538)
!1033 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!1034 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!1035 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!1036 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!1037 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!1038 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!1039 = !DIEnumerator(name: "__YESSTR", value: 327682)
!1040 = !DIEnumerator(name: "__NOSTR", value: 327683)
!1041 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!1042 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!1043 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!1044 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!1045 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!1046 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!1047 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!1048 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!1049 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!1050 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!1051 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!1052 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!1053 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!1054 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!1055 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!1056 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!1057 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!1058 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!1059 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!1060 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!1061 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!1062 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!1063 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!1064 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!1065 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!1066 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!1067 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!1068 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!1069 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!1070 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!1071 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!1072 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!1073 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!1074 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!1075 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!1076 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!1077 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!1078 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!1079 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!1080 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!1081 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!1082 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!1083 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!1084 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!1085 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!1086 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!1087 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!1088 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!1089 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!1090 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!1091 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!1092 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!1093 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!1094 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!1095 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!1096 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1097, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1097 = !DIFile(filename: "lib/nl_langinfo.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0f236ddfc4cfa77b5ef8ffc62e15ffca")
!1098 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1099, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1100, splitDebugInlining: false, nameTableKind: None)
!1099 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1100 = !{!47, !43, !36}
!1101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1102, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1102 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1104, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!1104 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1106, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1107, splitDebugInlining: false, nameTableKind: None)
!1106 = !DIFile(filename: "lib/vfzprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "641ad3c8eb652aaa6eacd294d7088ef5")
!1107 = !{!1108}
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !165, line: 70, baseType: !116)
!1109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1110, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1110 = !DIFile(filename: "lib/vzprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5245eb1f3c2cf890c3d9ecb05bb944ac")
!1111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1112, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !1113, splitDebugInlining: false, nameTableKind: None)
