; ModuleID = 'src/printenv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [164 x i8] c"Usage: %s [OPTION] [VARIABLE]...\0APrint the values of the specified environment VARIABLE(s).\0AIf no VARIABLE is specified, print name and value pairs for them all.\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"printenv\00", align 1
@.str.3 = private unnamed_addr constant [66 x i8] c"  -0, --null\0A         end each output line with NUL, not newline\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 47, type: !124, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/printenv.c", directory: "/src", checksumkind: CSK_MD5, checksum: "639748d46de6a4e4b99d61a9973b15a5")
!4 = !{!5, !9}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 38, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8}
!8 = !DIEnumerator(name: "PRINTENV_FAILURE", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 46, baseType: !6, size: 32, elements: !11)
!10 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!12 = !DIEnumerator(name: "_ISupper", value: 256)
!13 = !DIEnumerator(name: "_ISlower", value: 512)
!14 = !DIEnumerator(name: "_ISalpha", value: 1024)
!15 = !DIEnumerator(name: "_ISdigit", value: 2048)
!16 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!17 = !DIEnumerator(name: "_ISspace", value: 8192)
!18 = !DIEnumerator(name: "_ISprint", value: 16384)
!19 = !DIEnumerator(name: "_ISgraph", value: 32768)
!20 = !DIEnumerator(name: "_ISblank", value: 1)
!21 = !DIEnumerator(name: "_IScntrl", value: 2)
!22 = !DIEnumerator(name: "_ISpunct", value: 4)
!23 = !DIEnumerator(name: "_ISalnum", value: 8)
!24 = !{!25, !27, !28, !29, !30, !33, !35}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!32 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!37, !0}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !39, file: !40, line: 575, type: !28, isLocal: true, isDefinition: true)
!39 = distinct !DISubprogram(name: "oputs_", scope: !40, file: !40, line: 573, type: !41, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !43)
!40 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!41 = !DISubroutineType(types: !42)
!42 = !{null, !33, !33}
!43 = !{!44, !45, !46, !49, !51, !52, !53, !57, !58, !59, !60, !62, !118, !119, !120, !122, !123}
!44 = !DILocalVariable(name: "program", arg: 1, scope: !39, file: !40, line: 573, type: !33)
!45 = !DILocalVariable(name: "option", arg: 2, scope: !39, file: !40, line: 573, type: !33)
!46 = !DILocalVariable(name: "term", scope: !47, file: !40, line: 585, type: !33)
!47 = distinct !DILexicalBlock(scope: !48, file: !40, line: 582, column: 5)
!48 = distinct !DILexicalBlock(scope: !39, file: !40, line: 581, column: 7)
!49 = !DILocalVariable(name: "double_space", scope: !39, file: !40, line: 594, type: !50)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DILocalVariable(name: "first_word", scope: !39, file: !40, line: 595, type: !33)
!52 = !DILocalVariable(name: "option_text", scope: !39, file: !40, line: 596, type: !33)
!53 = !DILocalVariable(name: "s", scope: !54, file: !40, line: 608, type: !33)
!54 = distinct !DILexicalBlock(scope: !55, file: !40, line: 605, column: 5)
!55 = distinct !DILexicalBlock(scope: !56, file: !40, line: 604, column: 12)
!56 = distinct !DILexicalBlock(scope: !39, file: !40, line: 597, column: 7)
!57 = !DILocalVariable(name: "spaces", scope: !54, file: !40, line: 609, type: !30)
!58 = !DILocalVariable(name: "anchor_len", scope: !39, file: !40, line: 620, type: !30)
!59 = !DILocalVariable(name: "desc_text", scope: !39, file: !40, line: 625, type: !33)
!60 = !DILocalVariable(name: "__ptr", scope: !61, file: !40, line: 644, type: !33)
!61 = distinct !DILexicalBlock(scope: !39, file: !40, line: 644, column: 3)
!62 = !DILocalVariable(name: "__stream", scope: !61, file: !40, line: 644, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 7, baseType: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 49, size: 1728, elements: !68)
!67 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !84, !86, !87, !88, !92, !93, !95, !99, !102, !104, !107, !110, !111, !112, !113, !114}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !67, line: 51, baseType: !28, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !66, file: !67, line: 54, baseType: !25, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !66, file: !67, line: 55, baseType: !25, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !66, file: !67, line: 56, baseType: !25, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !66, file: !67, line: 57, baseType: !25, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !66, file: !67, line: 58, baseType: !25, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !66, file: !67, line: 59, baseType: !25, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !66, file: !67, line: 60, baseType: !25, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !66, file: !67, line: 61, baseType: !25, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !66, file: !67, line: 64, baseType: !25, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !66, file: !67, line: 65, baseType: !25, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !66, file: !67, line: 66, baseType: !25, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !66, file: !67, line: 68, baseType: !82, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !67, line: 36, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !66, file: !67, line: 70, baseType: !85, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !66, file: !67, line: 72, baseType: !28, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !67, line: 73, baseType: !28, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !66, file: !67, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !91)
!90 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!91 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !66, file: !67, line: 77, baseType: !29, size: 16, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !66, file: !67, line: 78, baseType: !94, size: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !66, file: !67, line: 79, baseType: !96, size: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !67, line: 81, baseType: !100, size: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !67, line: 43, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !67, line: 89, baseType: !103, size: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !91)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !66, file: !67, line: 91, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !67, line: 37, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !66, file: !67, line: 92, baseType: !108, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !67, line: 38, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !66, file: !67, line: 93, baseType: !85, size: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !66, file: !67, line: 94, baseType: !27, size: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !66, file: !67, line: 95, baseType: !30, size: 64, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !66, file: !67, line: 96, baseType: !28, size: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !66, file: !67, line: 98, baseType: !115, size: 160, offset: 1568)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DILocalVariable(name: "__cnt", scope: !61, file: !40, line: 644, type: !30)
!119 = !DILocalVariable(name: "url_program", scope: !39, file: !40, line: 648, type: !33)
!120 = !DILocalVariable(name: "__ptr", scope: !121, file: !40, line: 686, type: !33)
!121 = distinct !DILexicalBlock(scope: !39, file: !40, line: 686, column: 3)
!122 = !DILocalVariable(name: "__stream", scope: !121, file: !40, line: 686, type: !63)
!123 = !DILocalVariable(name: "__cnt", scope: !121, file: !40, line: 686, type: !30)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 1024, elements: !134)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !127, line: 50, size: 256, elements: !128)
!127 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!128 = !{!129, !130, !131, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 52, baseType: !33, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !126, file: !127, line: 55, baseType: !28, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !126, file: !127, line: 56, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !126, file: !127, line: 57, baseType: !28, size: 32, offset: 192)
!134 = !{!135}
!135 = !DISubrange(count: 4)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "Version", scope: !138, file: !139, line: 3, type: !33, isLocal: false, isDefinition: true)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !140, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!140 = !{!136}
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "file_name", scope: !143, file: !144, line: 45, type: !33, isLocal: true, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !145, splitDebugInlining: false, nameTableKind: None)
!144 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!145 = !{!141, !146}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !143, file: !144, line: 55, type: !50, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !150, file: !151, line: 66, type: !186, isLocal: false, isDefinition: true)
!150 = distinct !DICompileUnit(language: DW_LANG_C99, file: !151, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !152, globals: !153, splitDebugInlining: false, nameTableKind: None)
!151 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!152 = !{!27, !35}
!153 = !{!154, !180, !148, !182, !184}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "old_file_name", scope: !156, file: !151, line: 304, type: !33, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "verror_at_line", scope: !151, file: !151, line: 298, type: !157, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !173)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !28, !28, !33, !6, !33, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !160, line: 52, baseType: !161)
!160 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !162, line: 32, baseType: !163)
!162 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !164, baseType: !165)
!164 = !DIFile(filename: "lib/error.c", directory: "/src")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !166, size: 256, elements: !167)
!166 = !DINamespace(name: "std", scope: null)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !165, file: !164, baseType: !27, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !165, file: !164, baseType: !27, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !165, file: !164, baseType: !27, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !165, file: !164, baseType: !28, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !165, file: !164, baseType: !28, size: 32, offset: 224)
!173 = !{!174, !175, !176, !177, !178, !179}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !156, file: !151, line: 298, type: !28)
!175 = !DILocalVariable(name: "errnum", arg: 2, scope: !156, file: !151, line: 298, type: !28)
!176 = !DILocalVariable(name: "file_name", arg: 3, scope: !156, file: !151, line: 298, type: !33)
!177 = !DILocalVariable(name: "line_number", arg: 4, scope: !156, file: !151, line: 298, type: !6)
!178 = !DILocalVariable(name: "message", arg: 5, scope: !156, file: !151, line: 298, type: !33)
!179 = !DILocalVariable(name: "args", arg: 6, scope: !156, file: !151, line: 298, type: !159)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "old_line_number", scope: !156, file: !151, line: 305, type: !6, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "error_message_count", scope: !150, file: !151, line: 69, type: !6, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !150, file: !151, line: 295, type: !28, isLocal: false, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "program_name", scope: !191, file: !192, line: 31, type: !33, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !193, globals: !194, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!193 = !{!25}
!194 = !{!189}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "utf07FF", scope: !197, file: !198, line: 46, type: !226, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "proper_name_lite", scope: !198, file: !198, line: 38, type: !199, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !203)
!198 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!199 = !DISubroutineType(types: !200)
!200 = !{!33, !33, !33}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !202, splitDebugInlining: false, nameTableKind: None)
!202 = !{!195}
!203 = !{!204, !205, !206, !207, !212}
!204 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !197, file: !198, line: 38, type: !33)
!205 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !197, file: !198, line: 38, type: !33)
!206 = !DILocalVariable(name: "translation", scope: !197, file: !198, line: 40, type: !33)
!207 = !DILocalVariable(name: "w", scope: !197, file: !198, line: 47, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !209, line: 37, baseType: !210)
!209 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !90, line: 57, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !90, line: 42, baseType: !6)
!212 = !DILocalVariable(name: "mbs", scope: !197, file: !198, line: 48, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !217, file: !216, line: 15, baseType: !28, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !217, file: !216, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !216, line: 16, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !216, line: 18, baseType: !6, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !216, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !134)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 16, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !231, file: !232, line: 76, type: !314, isLocal: false, isDefinition: true)
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !233, retainedTypes: !253, globals: !254, splitDebugInlining: false, nameTableKind: None)
!232 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!233 = !{!234, !248, !9}
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !235, line: 42, baseType: !6, size: 32, elements: !236)
!235 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!237 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!238 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!239 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!240 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!241 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!242 = !DIEnumerator(name: "c_quoting_style", value: 5)
!243 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!244 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!245 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!246 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!247 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !235, line: 254, baseType: !6, size: 32, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!251 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!252 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!253 = !{!28, !29, !30}
!254 = !{!229, !255, !261, !273, !275, !280, !303, !310, !312}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !231, file: !232, line: 92, type: !257, isLocal: false, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, size: 320, elements: !259)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!259 = !{!260}
!260 = !DISubrange(count: 10)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !231, file: !232, line: 1040, type: !263, isLocal: false, isDefinition: true)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !232, line: 56, size: 448, elements: !264)
!264 = !{!265, !266, !267, !271, !272}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !263, file: !232, line: 59, baseType: !234, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !263, file: !232, line: 62, baseType: !28, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !263, file: !232, line: 66, baseType: !268, size: 256, offset: 64)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !263, file: !232, line: 69, baseType: !33, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !263, file: !232, line: 72, baseType: !33, size: 64, offset: 384)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !231, file: !232, line: 107, type: !263, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slot0", scope: !231, file: !232, line: 831, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 256)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "quote", scope: !282, file: !232, line: 228, type: !301, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "gettext_quote", scope: !232, file: !232, line: 197, type: !283, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !285)
!283 = !DISubroutineType(types: !284)
!284 = !{!33, !33, !234}
!285 = !{!286, !287, !288, !289, !290}
!286 = !DILocalVariable(name: "msgid", arg: 1, scope: !282, file: !232, line: 197, type: !33)
!287 = !DILocalVariable(name: "s", arg: 2, scope: !282, file: !232, line: 197, type: !234)
!288 = !DILocalVariable(name: "translation", scope: !282, file: !232, line: 199, type: !33)
!289 = !DILocalVariable(name: "w", scope: !282, file: !232, line: 229, type: !208)
!290 = !DILocalVariable(name: "mbs", scope: !282, file: !232, line: 230, type: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !293, file: !216, line: 15, baseType: !28, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !293, file: !216, line: 20, baseType: !297, size: 32, offset: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !293, file: !216, line: 16, size: 32, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !297, file: !216, line: 18, baseType: !6, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !297, file: !216, line: 19, baseType: !225, size: 32)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, elements: !302)
!302 = !{!228, !135}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "slotvec", scope: !231, file: !232, line: 834, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !232, line: 823, size: 128, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !306, file: !232, line: 825, baseType: !30, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !306, file: !232, line: 826, baseType: !25, size: 64, offset: 64)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "nslots", scope: !231, file: !232, line: 832, type: !28, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "slotvec0", scope: !231, file: !232, line: 833, type: !306, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 704, elements: !316)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!316 = !{!317}
!317 = !DISubrange(count: 11)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !320, file: !321, line: 26, type: !323, isLocal: false, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!322 = !{!318}
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 376, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 47)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "exit_failure", scope: !328, file: !329, line: 24, type: !331, isLocal: false, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !330, splitDebugInlining: false, nameTableKind: None)
!329 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!330 = !{!326}
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "internal_state", scope: !334, file: !335, line: 97, type: !338, isLocal: true, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !336, globals: !337, splitDebugInlining: false, nameTableKind: None)
!335 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!336 = !{!27, !30, !35}
!337 = !{!332}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !340, file: !216, line: 15, baseType: !28, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !340, file: !216, line: 20, baseType: !344, size: 32, offset: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !340, file: !216, line: 16, size: 32, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !344, file: !216, line: 18, baseType: !6, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !344, file: !216, line: 19, baseType: !225, size: 32)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !352, retainedTypes: !356, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!352 = !{!353}
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 40, baseType: !6, size: 32, elements: !354)
!354 = !{!355}
!355 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!356 = !{!27}
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !359, retainedTypes: !390, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!359 = !{!360, !372}
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !361, file: !358, line: 188, baseType: !6, size: 32, elements: !370)
!361 = distinct !DISubprogram(name: "x2nrealloc", scope: !358, file: !358, line: 176, type: !362, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !357, retainedNodes: !365)
!362 = !DISubroutineType(types: !363)
!363 = !{!27, !27, !364, !30}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!365 = !{!366, !367, !368, !369}
!366 = !DILocalVariable(name: "p", arg: 1, scope: !361, file: !358, line: 176, type: !27)
!367 = !DILocalVariable(name: "pn", arg: 2, scope: !361, file: !358, line: 176, type: !364)
!368 = !DILocalVariable(name: "s", arg: 3, scope: !361, file: !358, line: 176, type: !30)
!369 = !DILocalVariable(name: "n", scope: !361, file: !358, line: 178, type: !30)
!370 = !{!371}
!371 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !373, file: !358, line: 228, baseType: !6, size: 32, elements: !370)
!373 = distinct !DISubprogram(name: "xpalloc", scope: !358, file: !358, line: 223, type: !374, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !357, retainedNodes: !380)
!374 = !DISubroutineType(types: !375)
!375 = !{!27, !27, !376, !377, !379, !377}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !378, line: 130, baseType: !379)
!378 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !31, line: 35, baseType: !91)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389}
!381 = !DILocalVariable(name: "pa", arg: 1, scope: !373, file: !358, line: 223, type: !27)
!382 = !DILocalVariable(name: "pn", arg: 2, scope: !373, file: !358, line: 223, type: !376)
!383 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !373, file: !358, line: 223, type: !377)
!384 = !DILocalVariable(name: "n_max", arg: 4, scope: !373, file: !358, line: 223, type: !379)
!385 = !DILocalVariable(name: "s", arg: 5, scope: !373, file: !358, line: 223, type: !377)
!386 = !DILocalVariable(name: "n0", scope: !373, file: !358, line: 230, type: !377)
!387 = !DILocalVariable(name: "n", scope: !373, file: !358, line: 237, type: !377)
!388 = !DILocalVariable(name: "nbytes", scope: !373, file: !358, line: 248, type: !377)
!389 = !DILocalVariable(name: "adjusted_nbytes", scope: !373, file: !358, line: 252, type: !377)
!390 = !{!25, !27, !50, !91, !32}
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !356, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !356, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !403, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!403 = !{!50, !32, !27}
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !356, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!410 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!411 = !{i32 7, !"Dwarf Version", i32 5}
!412 = !{i32 2, !"Debug Info Version", i32 3}
!413 = !{i32 1, !"wchar_size", i32 4}
!414 = !{i32 1, !"branch-target-enforcement", i32 0}
!415 = !{i32 1, !"sign-return-address", i32 0}
!416 = !{i32 1, !"sign-return-address-all", i32 0}
!417 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!418 = !{i32 7, !"PIC Level", i32 2}
!419 = !{i32 7, !"PIE Level", i32 2}
!420 = !{i32 7, !"uwtable", i32 1}
!421 = !{i32 7, !"frame-pointer", i32 1}
!422 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 56, type: !423, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !28}
!425 = !{!426}
!426 = !DILocalVariable(name: "status", arg: 1, scope: !422, file: !3, line: 56, type: !28)
!427 = !DILocation(line: 0, scope: !422)
!428 = !DILocation(line: 58, column: 14, scope: !429)
!429 = distinct !DILexicalBlock(scope: !422, file: !3, line: 58, column: 7)
!430 = !DILocation(line: 58, column: 7, scope: !422)
!431 = !DILocation(line: 59, column: 5, scope: !432)
!432 = distinct !DILexicalBlock(scope: !429, file: !3, line: 59, column: 5)
!433 = !{!434, !434, i64 0}
!434 = !{!"any pointer", !435, i64 0}
!435 = !{!"omnipotent char", !436, i64 0}
!436 = !{!"Simple C/C++ TBAA"}
!437 = !DILocation(line: 62, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !429, file: !3, line: 61, column: 5)
!439 = !DILocation(line: 69, column: 7, scope: !438)
!440 = !DILocation(line: 73, column: 7, scope: !438)
!441 = !DILocation(line: 74, column: 7, scope: !438)
!442 = !DILocation(line: 75, column: 7, scope: !438)
!443 = !DILocalVariable(name: "program", arg: 1, scope: !444, file: !40, line: 836, type: !33)
!444 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !40, file: !40, line: 836, type: !445, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !33}
!447 = !{!443, !448, !457, !458, !460, !461}
!448 = !DILocalVariable(name: "infomap", scope: !444, file: !40, line: 838, type: !449)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 896, elements: !455)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !444, file: !40, line: 838, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !451, file: !40, line: 838, baseType: !33, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !451, file: !40, line: 838, baseType: !33, size: 64, offset: 64)
!455 = !{!456}
!456 = !DISubrange(count: 7)
!457 = !DILocalVariable(name: "node", scope: !444, file: !40, line: 848, type: !33)
!458 = !DILocalVariable(name: "map_prog", scope: !444, file: !40, line: 849, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!460 = !DILocalVariable(name: "lc_messages", scope: !444, file: !40, line: 861, type: !33)
!461 = !DILocalVariable(name: "url_program", scope: !444, file: !40, line: 874, type: !33)
!462 = !DILocation(line: 0, scope: !444, inlinedAt: !463)
!463 = distinct !DILocation(line: 76, column: 7, scope: !438)
!464 = !DILocation(line: 838, column: 3, scope: !444, inlinedAt: !463)
!465 = !DILocation(line: 838, column: 67, scope: !444, inlinedAt: !463)
!466 = !DILocation(line: 849, column: 36, scope: !444, inlinedAt: !463)
!467 = !DILocation(line: 851, column: 3, scope: !444, inlinedAt: !463)
!468 = !DILocalVariable(name: "__s1", arg: 1, scope: !469, file: !470, line: 1359, type: !33)
!469 = distinct !DISubprogram(name: "streq", scope: !470, file: !470, line: 1359, type: !471, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !473)
!470 = !DIFile(filename: "./lib/string.h", directory: "/src")
!471 = !DISubroutineType(types: !472)
!472 = !{!50, !33, !33}
!473 = !{!468, !474}
!474 = !DILocalVariable(name: "__s2", arg: 2, scope: !469, file: !470, line: 1359, type: !33)
!475 = !DILocation(line: 0, scope: !469, inlinedAt: !476)
!476 = distinct !DILocation(line: 851, column: 33, scope: !444, inlinedAt: !463)
!477 = !DILocation(line: 1361, column: 11, scope: !469, inlinedAt: !476)
!478 = !DILocation(line: 1361, column: 10, scope: !469, inlinedAt: !476)
!479 = !DILocation(line: 852, column: 13, scope: !444, inlinedAt: !463)
!480 = !DILocation(line: 851, column: 20, scope: !444, inlinedAt: !463)
!481 = !{!482, !434, i64 0}
!482 = !{!"infomap", !434, i64 0, !434, i64 8}
!483 = !DILocation(line: 851, column: 10, scope: !444, inlinedAt: !463)
!484 = !DILocation(line: 851, column: 28, scope: !444, inlinedAt: !463)
!485 = distinct !{!485, !467, !479, !486}
!486 = !{!"llvm.loop.mustprogress"}
!487 = !DILocation(line: 854, column: 17, scope: !488, inlinedAt: !463)
!488 = distinct !DILexicalBlock(scope: !444, file: !40, line: 854, column: 7)
!489 = !{!482, !434, i64 8}
!490 = !DILocation(line: 854, column: 7, scope: !488, inlinedAt: !463)
!491 = !DILocation(line: 854, column: 7, scope: !444, inlinedAt: !463)
!492 = !DILocation(line: 857, column: 3, scope: !444, inlinedAt: !463)
!493 = !DILocation(line: 861, column: 29, scope: !444, inlinedAt: !463)
!494 = !DILocation(line: 862, column: 7, scope: !495, inlinedAt: !463)
!495 = distinct !DILexicalBlock(scope: !444, file: !40, line: 862, column: 7)
!496 = !DILocation(line: 862, column: 19, scope: !495, inlinedAt: !463)
!497 = !DILocation(line: 862, column: 22, scope: !495, inlinedAt: !463)
!498 = !DILocation(line: 862, column: 7, scope: !444, inlinedAt: !463)
!499 = !DILocation(line: 868, column: 7, scope: !500, inlinedAt: !463)
!500 = distinct !DILexicalBlock(scope: !495, file: !40, line: 863, column: 5)
!501 = !DILocation(line: 870, column: 5, scope: !500, inlinedAt: !463)
!502 = !DILocation(line: 0, scope: !469, inlinedAt: !503)
!503 = distinct !DILocation(line: 874, column: 29, scope: !444, inlinedAt: !463)
!504 = !DILocation(line: 875, column: 3, scope: !444, inlinedAt: !463)
!505 = !DILocation(line: 877, column: 3, scope: !444, inlinedAt: !463)
!506 = !DILocation(line: 879, column: 1, scope: !444, inlinedAt: !463)
!507 = !DILocation(line: 78, column: 3, scope: !422)
!508 = !DISubprogram(name: "dcgettext", scope: !509, file: !509, line: 51, type: !510, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!509 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!510 = !DISubroutineType(types: !511)
!511 = !{!25, !33, !33, !28}
!512 = !{}
!513 = !DILocation(line: 0, scope: !39)
!514 = !DILocation(line: 581, column: 7, scope: !48)
!515 = !{!516, !516, i64 0}
!516 = !{!"int", !435, i64 0}
!517 = !DILocation(line: 581, column: 19, scope: !48)
!518 = !DILocation(line: 581, column: 7, scope: !39)
!519 = !DILocation(line: 585, column: 26, scope: !47)
!520 = !DILocation(line: 0, scope: !47)
!521 = !DILocation(line: 586, column: 23, scope: !47)
!522 = !DILocation(line: 586, column: 28, scope: !47)
!523 = !DILocation(line: 586, column: 32, scope: !47)
!524 = !{!435, !435, i64 0}
!525 = !DILocation(line: 586, column: 38, scope: !47)
!526 = !DILocation(line: 0, scope: !469, inlinedAt: !527)
!527 = distinct !DILocation(line: 586, column: 41, scope: !47)
!528 = !DILocation(line: 1361, column: 11, scope: !469, inlinedAt: !527)
!529 = !DILocation(line: 1361, column: 10, scope: !469, inlinedAt: !527)
!530 = !DILocation(line: 586, column: 19, scope: !47)
!531 = !DILocation(line: 587, column: 5, scope: !47)
!532 = !DILocation(line: 588, column: 7, scope: !533)
!533 = distinct !DILexicalBlock(scope: !39, file: !40, line: 588, column: 7)
!534 = !DILocation(line: 588, column: 7, scope: !39)
!535 = !DILocation(line: 590, column: 7, scope: !536)
!536 = distinct !DILexicalBlock(scope: !533, file: !40, line: 589, column: 5)
!537 = !DILocation(line: 591, column: 7, scope: !536)
!538 = !DILocation(line: 595, column: 37, scope: !39)
!539 = !DILocation(line: 595, column: 35, scope: !39)
!540 = !DILocation(line: 596, column: 29, scope: !39)
!541 = !DILocation(line: 597, column: 8, scope: !56)
!542 = !DILocation(line: 597, column: 7, scope: !39)
!543 = !DILocation(line: 604, column: 24, scope: !55)
!544 = !DILocation(line: 604, column: 12, scope: !56)
!545 = !DILocation(line: 0, scope: !54)
!546 = !DILocation(line: 610, column: 16, scope: !54)
!547 = !DILocation(line: 610, column: 7, scope: !54)
!548 = !DILocation(line: 611, column: 21, scope: !54)
!549 = !{!550, !550, i64 0}
!550 = !{!"short", !435, i64 0}
!551 = !DILocation(line: 611, column: 19, scope: !54)
!552 = !DILocation(line: 611, column: 16, scope: !54)
!553 = !DILocation(line: 610, column: 30, scope: !54)
!554 = distinct !{!554, !547, !548, !486}
!555 = !DILocation(line: 612, column: 18, scope: !556)
!556 = distinct !DILexicalBlock(scope: !54, file: !40, line: 612, column: 11)
!557 = !DILocation(line: 612, column: 11, scope: !54)
!558 = !DILocation(line: 620, column: 23, scope: !39)
!559 = !DILocation(line: 625, column: 39, scope: !39)
!560 = !DILocation(line: 626, column: 3, scope: !39)
!561 = !DILocation(line: 626, column: 10, scope: !39)
!562 = !DILocation(line: 626, column: 21, scope: !39)
!563 = !DILocation(line: 628, column: 44, scope: !564)
!564 = distinct !DILexicalBlock(scope: !565, file: !40, line: 628, column: 11)
!565 = distinct !DILexicalBlock(scope: !39, file: !40, line: 627, column: 5)
!566 = !DILocation(line: 628, column: 32, scope: !564)
!567 = !DILocation(line: 628, column: 49, scope: !564)
!568 = !DILocation(line: 628, column: 11, scope: !565)
!569 = !DILocation(line: 630, column: 11, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !40, line: 630, column: 11)
!571 = !DILocation(line: 630, column: 11, scope: !565)
!572 = !DILocation(line: 632, column: 26, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !40, line: 632, column: 15)
!574 = distinct !DILexicalBlock(scope: !570, file: !40, line: 631, column: 9)
!575 = !DILocation(line: 632, column: 34, scope: !573)
!576 = !DILocation(line: 632, column: 37, scope: !573)
!577 = !DILocation(line: 632, column: 15, scope: !574)
!578 = !DILocation(line: 636, column: 29, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !40, line: 636, column: 15)
!580 = !DILocation(line: 640, column: 16, scope: !565)
!581 = distinct !{!581, !560, !582, !486}
!582 = !DILocation(line: 641, column: 5, scope: !39)
!583 = !DILocation(line: 644, column: 3, scope: !39)
!584 = !DILocation(line: 0, scope: !469, inlinedAt: !585)
!585 = distinct !DILocation(line: 648, column: 31, scope: !39)
!586 = !DILocation(line: 0, scope: !469, inlinedAt: !587)
!587 = distinct !DILocation(line: 649, column: 31, scope: !39)
!588 = !DILocation(line: 0, scope: !469, inlinedAt: !589)
!589 = distinct !DILocation(line: 650, column: 31, scope: !39)
!590 = !DILocation(line: 0, scope: !469, inlinedAt: !591)
!591 = distinct !DILocation(line: 651, column: 31, scope: !39)
!592 = !DILocation(line: 0, scope: !469, inlinedAt: !593)
!593 = distinct !DILocation(line: 652, column: 31, scope: !39)
!594 = !DILocation(line: 0, scope: !469, inlinedAt: !595)
!595 = distinct !DILocation(line: 653, column: 31, scope: !39)
!596 = !DILocation(line: 0, scope: !469, inlinedAt: !597)
!597 = distinct !DILocation(line: 654, column: 31, scope: !39)
!598 = !DILocation(line: 0, scope: !469, inlinedAt: !599)
!599 = distinct !DILocation(line: 655, column: 31, scope: !39)
!600 = !DILocation(line: 0, scope: !469, inlinedAt: !601)
!601 = distinct !DILocation(line: 656, column: 31, scope: !39)
!602 = !DILocation(line: 0, scope: !469, inlinedAt: !603)
!603 = distinct !DILocation(line: 657, column: 31, scope: !39)
!604 = !DILocation(line: 663, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !39, file: !40, line: 663, column: 7)
!606 = !DILocation(line: 664, column: 7, scope: !605)
!607 = !DILocation(line: 664, column: 10, scope: !605)
!608 = !DILocation(line: 663, column: 7, scope: !39)
!609 = !DILocation(line: 669, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !605, file: !40, line: 665, column: 5)
!611 = !DILocation(line: 671, column: 5, scope: !610)
!612 = !DILocation(line: 676, column: 7, scope: !613)
!613 = distinct !DILexicalBlock(scope: !605, file: !40, line: 673, column: 5)
!614 = !DILocation(line: 679, column: 3, scope: !39)
!615 = !DILocation(line: 683, column: 3, scope: !39)
!616 = !DILocation(line: 686, column: 3, scope: !39)
!617 = !DILocation(line: 688, column: 3, scope: !39)
!618 = !DILocation(line: 691, column: 3, scope: !39)
!619 = !DILocation(line: 695, column: 3, scope: !39)
!620 = !DILocation(line: 696, column: 1, scope: !39)
!621 = !DISubprogram(name: "setlocale", scope: !622, file: !622, line: 122, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!622 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!623 = !DISubroutineType(types: !624)
!624 = !{!25, !28, !33}
!625 = !DISubprogram(name: "fputs_unlocked", scope: !160, file: !160, line: 691, type: !626, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!626 = !DISubroutineType(types: !627)
!627 = !{!28, !628, !629}
!628 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !33)
!629 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !63)
!630 = !DISubprogram(name: "getenv", scope: !631, file: !631, line: 641, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!631 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!632 = !DISubroutineType(types: !633)
!633 = !{!25, !33}
!634 = !DISubprogram(name: "fwrite_unlocked", scope: !160, file: !160, line: 704, type: !635, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!635 = !DISubroutineType(types: !636)
!636 = !{!30, !637, !30, !30, !629}
!637 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!640 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 82, type: !641, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !644)
!641 = !DISubroutineType(types: !642)
!642 = !{!28, !28, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!644 = !{!645, !646, !647, !648, !649, !650, !654, !656, !658, !661, !663, !666}
!645 = !DILocalVariable(name: "argc", arg: 1, scope: !640, file: !3, line: 82, type: !28)
!646 = !DILocalVariable(name: "argv", arg: 2, scope: !640, file: !3, line: 82, type: !643)
!647 = !DILocalVariable(name: "opt_nul_terminate_output", scope: !640, file: !3, line: 84, type: !50)
!648 = !DILocalVariable(name: "optc", scope: !640, file: !3, line: 95, type: !28)
!649 = !DILocalVariable(name: "ok", scope: !640, file: !3, line: 110, type: !50)
!650 = !DILocalVariable(name: "env", scope: !651, file: !3, line: 113, type: !643)
!651 = distinct !DILexicalBlock(scope: !652, file: !3, line: 113, column: 7)
!652 = distinct !DILexicalBlock(scope: !653, file: !3, line: 112, column: 5)
!653 = distinct !DILexicalBlock(scope: !640, file: !3, line: 111, column: 7)
!654 = !DILocalVariable(name: "matches", scope: !655, file: !3, line: 119, type: !28)
!655 = distinct !DILexicalBlock(scope: !653, file: !3, line: 118, column: 5)
!656 = !DILocalVariable(name: "i", scope: !657, file: !3, line: 121, type: !28)
!657 = distinct !DILexicalBlock(scope: !655, file: !3, line: 121, column: 7)
!658 = !DILocalVariable(name: "matched", scope: !659, file: !3, line: 123, type: !50)
!659 = distinct !DILexicalBlock(scope: !660, file: !3, line: 122, column: 9)
!660 = distinct !DILexicalBlock(scope: !657, file: !3, line: 121, column: 7)
!661 = !DILocalVariable(name: "env", scope: !662, file: !3, line: 129, type: !643)
!662 = distinct !DILexicalBlock(scope: !659, file: !3, line: 129, column: 11)
!663 = !DILocalVariable(name: "ep", scope: !664, file: !3, line: 131, type: !33)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 130, column: 13)
!665 = distinct !DILexicalBlock(scope: !662, file: !3, line: 129, column: 11)
!666 = !DILocalVariable(name: "ap", scope: !664, file: !3, line: 132, type: !33)
!667 = !DILocation(line: 0, scope: !640)
!668 = !DILocation(line: 87, column: 21, scope: !640)
!669 = !DILocation(line: 87, column: 3, scope: !640)
!670 = !DILocation(line: 88, column: 3, scope: !640)
!671 = !DILocation(line: 89, column: 3, scope: !640)
!672 = !DILocation(line: 90, column: 3, scope: !640)
!673 = !DILocalVariable(name: "status", arg: 1, scope: !674, file: !40, line: 102, type: !28)
!674 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !40, file: !40, line: 102, type: !423, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !675)
!675 = !{!673}
!676 = !DILocation(line: 0, scope: !674, inlinedAt: !677)
!677 = distinct !DILocation(line: 92, column: 3, scope: !640)
!678 = !DILocation(line: 105, column: 18, scope: !679, inlinedAt: !677)
!679 = distinct !DILexicalBlock(scope: !674, file: !40, line: 104, column: 7)
!680 = !DILocation(line: 93, column: 3, scope: !640)
!681 = !DILocation(line: 96, column: 3, scope: !640)
!682 = !DILocation(line: 96, column: 18, scope: !640)
!683 = distinct !{!683, !681, !684, !486}
!684 = !DILocation(line: 108, column: 5, scope: !640)
!685 = !DILocation(line: 103, column: 9, scope: !686)
!686 = distinct !DILexicalBlock(scope: !687, file: !3, line: 99, column: 9)
!687 = distinct !DILexicalBlock(scope: !640, file: !3, line: 97, column: 5)
!688 = !DILocation(line: 104, column: 9, scope: !686)
!689 = !DILocation(line: 106, column: 11, scope: !686)
!690 = !DILocation(line: 111, column: 7, scope: !653)
!691 = !DILocation(line: 111, column: 14, scope: !653)
!692 = !DILocation(line: 111, column: 7, scope: !640)
!693 = !DILocation(line: 121, column: 7, scope: !657)
!694 = !DILocation(line: 113, column: 25, scope: !651)
!695 = !DILocation(line: 0, scope: !651)
!696 = !DILocation(line: 113, column: 34, scope: !697)
!697 = distinct !DILexicalBlock(scope: !651, file: !3, line: 113, column: 7)
!698 = !DILocation(line: 113, column: 39, scope: !697)
!699 = !DILocation(line: 113, column: 7, scope: !651)
!700 = !DILocation(line: 114, column: 9, scope: !697)
!701 = !DILocation(line: 113, column: 48, scope: !697)
!702 = distinct !{!702, !699, !703, !486}
!703 = !DILocation(line: 114, column: 9, scope: !651)
!704 = !DILocation(line: 148, column: 31, scope: !655)
!705 = !DILocation(line: 148, column: 29, scope: !655)
!706 = !DILocation(line: 148, column: 21, scope: !655)
!707 = !DILocation(line: 0, scope: !657)
!708 = !DILocation(line: 0, scope: !655)
!709 = !DILocation(line: 0, scope: !659)
!710 = !DILocation(line: 126, column: 23, scope: !711)
!711 = distinct !DILexicalBlock(scope: !659, file: !3, line: 126, column: 15)
!712 = !DILocation(line: 126, column: 15, scope: !711)
!713 = !DILocation(line: 126, column: 15, scope: !659)
!714 = !DILocation(line: 129, column: 29, scope: !662)
!715 = !DILocation(line: 0, scope: !662)
!716 = !DILocation(line: 129, column: 38, scope: !665)
!717 = !DILocation(line: 129, column: 11, scope: !662)
!718 = !DILocation(line: 145, column: 22, scope: !659)
!719 = !DILocation(line: 145, column: 19, scope: !659)
!720 = !DILocation(line: 146, column: 9, scope: !660)
!721 = !DILocation(line: 132, column: 32, scope: !664)
!722 = !DILocation(line: 0, scope: !664)
!723 = !DILocation(line: 133, column: 22, scope: !664)
!724 = !DILocation(line: 133, column: 26, scope: !664)
!725 = !DILocation(line: 133, column: 34, scope: !664)
!726 = !DILocation(line: 133, column: 37, scope: !664)
!727 = !DILocation(line: 133, column: 41, scope: !664)
!728 = !DILocation(line: 133, column: 49, scope: !664)
!729 = !DILocation(line: 133, column: 55, scope: !664)
!730 = !DILocation(line: 133, column: 64, scope: !664)
!731 = !DILocation(line: 133, column: 58, scope: !664)
!732 = !DILocation(line: 133, column: 15, scope: !664)
!733 = !DILocation(line: 135, column: 23, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 135, column: 23)
!735 = distinct !DILexicalBlock(scope: !664, file: !3, line: 134, column: 17)
!736 = !DILocation(line: 135, column: 34, scope: !734)
!737 = !DILocation(line: 135, column: 37, scope: !734)
!738 = !DILocation(line: 135, column: 41, scope: !734)
!739 = !DILocation(line: 135, column: 23, scope: !735)
!740 = !DILocation(line: 137, column: 23, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !3, line: 136, column: 21)
!742 = !DILocation(line: 140, column: 23, scope: !741)
!743 = distinct !{!743, !732, !744, !486}
!744 = !DILocation(line: 142, column: 17, scope: !664)
!745 = !DILocation(line: 129, column: 44, scope: !665)
!746 = distinct !{!746, !717, !747, !486}
!747 = !DILocation(line: 143, column: 13, scope: !662)
!748 = !DILocation(line: 121, column: 38, scope: !660)
!749 = !DILocation(line: 121, column: 30, scope: !660)
!750 = distinct !{!750, !693, !751, !486}
!751 = !DILocation(line: 146, column: 9, scope: !657)
!752 = !DILocation(line: 152, column: 1, scope: !640)
!753 = !DISubprogram(name: "bindtextdomain", scope: !509, file: !509, line: 86, type: !754, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!754 = !DISubroutineType(types: !755)
!755 = !{!25, !33, !33}
!756 = !DISubprogram(name: "textdomain", scope: !509, file: !509, line: 82, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!757 = !DISubprogram(name: "atexit", scope: !631, file: !631, line: 602, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!758 = !DISubroutineType(types: !759)
!759 = !{!28, !186}
!760 = !DISubprogram(name: "getopt_long", scope: !127, file: !127, line: 66, type: !761, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!761 = !DISubroutineType(types: !762)
!762 = !{!28, !28, !763, !33, !765, !132}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!766 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !144, file: !144, line: 50, type: !445, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !767)
!767 = !{!768}
!768 = !DILocalVariable(name: "file", arg: 1, scope: !766, file: !144, line: 50, type: !33)
!769 = !DILocation(line: 0, scope: !766)
!770 = !DILocation(line: 52, column: 13, scope: !766)
!771 = !DILocation(line: 53, column: 1, scope: !766)
!772 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !144, file: !144, line: 87, type: !773, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !50}
!775 = !{!776}
!776 = !DILocalVariable(name: "ignore", arg: 1, scope: !772, file: !144, line: 87, type: !50)
!777 = !DILocation(line: 0, scope: !772)
!778 = !DILocation(line: 89, column: 16, scope: !772)
!779 = !{!780, !780, i64 0}
!780 = !{!"_Bool", !435, i64 0}
!781 = !DILocation(line: 90, column: 1, scope: !772)
!782 = distinct !DISubprogram(name: "close_stdout", scope: !144, file: !144, line: 116, type: !187, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !783)
!783 = !{!784}
!784 = !DILocalVariable(name: "write_error", scope: !785, file: !144, line: 121, type: !33)
!785 = distinct !DILexicalBlock(scope: !786, file: !144, line: 120, column: 5)
!786 = distinct !DILexicalBlock(scope: !782, file: !144, line: 118, column: 7)
!787 = !DILocation(line: 118, column: 21, scope: !786)
!788 = !DILocation(line: 118, column: 7, scope: !786)
!789 = !DILocation(line: 118, column: 29, scope: !786)
!790 = !DILocation(line: 119, column: 7, scope: !786)
!791 = !DILocation(line: 119, column: 12, scope: !786)
!792 = !{i8 0, i8 2}
!793 = !DILocation(line: 119, column: 25, scope: !786)
!794 = !DILocation(line: 119, column: 28, scope: !786)
!795 = !DILocation(line: 119, column: 34, scope: !786)
!796 = !DILocation(line: 118, column: 7, scope: !782)
!797 = !DILocation(line: 121, column: 33, scope: !785)
!798 = !DILocation(line: 0, scope: !785)
!799 = !DILocation(line: 122, column: 11, scope: !800)
!800 = distinct !DILexicalBlock(scope: !785, file: !144, line: 122, column: 11)
!801 = !DILocation(line: 0, scope: !800)
!802 = !DILocation(line: 122, column: 11, scope: !785)
!803 = !DILocation(line: 123, column: 9, scope: !800)
!804 = !DILocation(line: 126, column: 9, scope: !800)
!805 = !DILocation(line: 128, column: 14, scope: !785)
!806 = !DILocation(line: 128, column: 7, scope: !785)
!807 = !DILocation(line: 133, column: 42, scope: !808)
!808 = distinct !DILexicalBlock(scope: !782, file: !144, line: 133, column: 7)
!809 = !DILocation(line: 133, column: 28, scope: !808)
!810 = !DILocation(line: 133, column: 50, scope: !808)
!811 = !DILocation(line: 133, column: 7, scope: !782)
!812 = !DILocation(line: 134, column: 12, scope: !808)
!813 = !DILocation(line: 134, column: 5, scope: !808)
!814 = !DILocation(line: 135, column: 1, scope: !782)
!815 = distinct !DISubprogram(name: "verror", scope: !151, file: !151, line: 251, type: !816, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !28, !28, !33, !159}
!818 = !{!819, !820, !821, !822}
!819 = !DILocalVariable(name: "status", arg: 1, scope: !815, file: !151, line: 251, type: !28)
!820 = !DILocalVariable(name: "errnum", arg: 2, scope: !815, file: !151, line: 251, type: !28)
!821 = !DILocalVariable(name: "message", arg: 3, scope: !815, file: !151, line: 251, type: !33)
!822 = !DILocalVariable(name: "args", arg: 4, scope: !815, file: !151, line: 251, type: !159)
!823 = !DILocation(line: 0, scope: !815)
!824 = !DILocation(line: 251, column: 1, scope: !815)
!825 = !DILocation(line: 261, column: 3, scope: !815)
!826 = !DILocation(line: 265, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !815, file: !151, line: 265, column: 7)
!828 = !DILocation(line: 265, column: 7, scope: !815)
!829 = !DILocation(line: 266, column: 5, scope: !827)
!830 = !DILocation(line: 272, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !827, file: !151, line: 268, column: 5)
!832 = !DILocation(line: 276, column: 3, scope: !815)
!833 = !{i64 0, i64 8, !433, i64 8, i64 8, !433, i64 16, i64 8, !433, i64 24, i64 4, !515, i64 28, i64 4, !515}
!834 = !DILocation(line: 282, column: 1, scope: !815)
!835 = distinct !DISubprogram(name: "flush_stdout", scope: !151, file: !151, line: 163, type: !187, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !836)
!836 = !{!837}
!837 = !DILocalVariable(name: "stdout_fd", scope: !835, file: !151, line: 166, type: !28)
!838 = !DILocation(line: 0, scope: !835)
!839 = !DILocalVariable(name: "fd", arg: 1, scope: !840, file: !151, line: 145, type: !28)
!840 = distinct !DISubprogram(name: "is_open", scope: !151, file: !151, line: 145, type: !841, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!28, !28}
!843 = !{!839}
!844 = !DILocation(line: 0, scope: !840, inlinedAt: !845)
!845 = distinct !DILocation(line: 182, column: 25, scope: !846)
!846 = distinct !DILexicalBlock(scope: !835, file: !151, line: 182, column: 7)
!847 = !DILocation(line: 157, column: 15, scope: !840, inlinedAt: !845)
!848 = !DILocation(line: 182, column: 25, scope: !846)
!849 = !DILocation(line: 182, column: 7, scope: !835)
!850 = !DILocation(line: 184, column: 5, scope: !846)
!851 = !DILocation(line: 185, column: 1, scope: !835)
!852 = distinct !DISubprogram(name: "error_tail", scope: !151, file: !151, line: 219, type: !816, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DILocalVariable(name: "status", arg: 1, scope: !852, file: !151, line: 219, type: !28)
!855 = !DILocalVariable(name: "errnum", arg: 2, scope: !852, file: !151, line: 219, type: !28)
!856 = !DILocalVariable(name: "message", arg: 3, scope: !852, file: !151, line: 219, type: !33)
!857 = !DILocalVariable(name: "args", arg: 4, scope: !852, file: !151, line: 219, type: !159)
!858 = !DILocation(line: 0, scope: !852)
!859 = !DILocation(line: 219, column: 1, scope: !852)
!860 = !DILocation(line: 229, column: 13, scope: !852)
!861 = !DILocation(line: 229, column: 3, scope: !852)
!862 = !DILocalVariable(name: "__stream", arg: 1, scope: !863, file: !864, line: 132, type: !867)
!863 = distinct !DISubprogram(name: "vfprintf", scope: !864, file: !864, line: 132, type: !865, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !902)
!864 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!865 = !DISubroutineType(types: !866)
!866 = !{!28, !867, !628, !161}
!867 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 7, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 49, size: 1728, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !870, file: !67, line: 51, baseType: !28, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !870, file: !67, line: 54, baseType: !25, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !870, file: !67, line: 55, baseType: !25, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !870, file: !67, line: 56, baseType: !25, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !870, file: !67, line: 57, baseType: !25, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !870, file: !67, line: 58, baseType: !25, size: 64, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !870, file: !67, line: 59, baseType: !25, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !870, file: !67, line: 60, baseType: !25, size: 64, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !870, file: !67, line: 61, baseType: !25, size: 64, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !870, file: !67, line: 64, baseType: !25, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !870, file: !67, line: 65, baseType: !25, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !870, file: !67, line: 66, baseType: !25, size: 64, offset: 704)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !870, file: !67, line: 68, baseType: !82, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !870, file: !67, line: 70, baseType: !886, size: 64, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !870, file: !67, line: 72, baseType: !28, size: 32, offset: 896)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !870, file: !67, line: 73, baseType: !28, size: 32, offset: 928)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !870, file: !67, line: 74, baseType: !89, size: 64, offset: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !870, file: !67, line: 77, baseType: !29, size: 16, offset: 1024)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !870, file: !67, line: 78, baseType: !94, size: 8, offset: 1040)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !870, file: !67, line: 79, baseType: !96, size: 8, offset: 1048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !870, file: !67, line: 81, baseType: !100, size: 64, offset: 1088)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !870, file: !67, line: 89, baseType: !103, size: 64, offset: 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !870, file: !67, line: 91, baseType: !105, size: 64, offset: 1216)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !870, file: !67, line: 92, baseType: !108, size: 64, offset: 1280)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !870, file: !67, line: 93, baseType: !886, size: 64, offset: 1344)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !870, file: !67, line: 94, baseType: !27, size: 64, offset: 1408)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !870, file: !67, line: 95, baseType: !30, size: 64, offset: 1472)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !870, file: !67, line: 96, baseType: !28, size: 32, offset: 1536)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !870, file: !67, line: 98, baseType: !115, size: 160, offset: 1568)
!902 = !{!862, !903, !904}
!903 = !DILocalVariable(name: "__fmt", arg: 2, scope: !863, file: !864, line: 133, type: !628)
!904 = !DILocalVariable(name: "__ap", arg: 3, scope: !863, file: !864, line: 133, type: !161)
!905 = !DILocation(line: 0, scope: !863, inlinedAt: !906)
!906 = distinct !DILocation(line: 229, column: 3, scope: !852)
!907 = !DILocation(line: 135, column: 10, scope: !863, inlinedAt: !906)
!908 = !{!909, !911}
!909 = distinct !{!909, !910, !"vfprintf.inline: argument 0"}
!910 = distinct !{!910, !"vfprintf.inline"}
!911 = distinct !{!911, !910, !"vfprintf.inline: argument 1"}
!912 = !DILocation(line: 232, column: 3, scope: !852)
!913 = !DILocation(line: 233, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !852, file: !151, line: 233, column: 7)
!915 = !DILocation(line: 233, column: 7, scope: !852)
!916 = !DILocalVariable(name: "errnum", arg: 1, scope: !917, file: !151, line: 188, type: !28)
!917 = distinct !DISubprogram(name: "print_errno_message", scope: !151, file: !151, line: 188, type: !423, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !918)
!918 = !{!916, !919, !920}
!919 = !DILocalVariable(name: "s", scope: !917, file: !151, line: 190, type: !33)
!920 = !DILocalVariable(name: "errbuf", scope: !917, file: !151, line: 193, type: !921)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 1024)
!924 = !DILocation(line: 0, scope: !917, inlinedAt: !925)
!925 = distinct !DILocation(line: 234, column: 5, scope: !914)
!926 = !DILocation(line: 193, column: 3, scope: !917, inlinedAt: !925)
!927 = !DILocation(line: 193, column: 8, scope: !917, inlinedAt: !925)
!928 = !DILocation(line: 195, column: 7, scope: !917, inlinedAt: !925)
!929 = !DILocation(line: 207, column: 9, scope: !930, inlinedAt: !925)
!930 = distinct !DILexicalBlock(scope: !917, file: !151, line: 207, column: 7)
!931 = !DILocation(line: 207, column: 7, scope: !917, inlinedAt: !925)
!932 = !DILocation(line: 208, column: 9, scope: !930, inlinedAt: !925)
!933 = !DILocation(line: 208, column: 5, scope: !930, inlinedAt: !925)
!934 = !DILocation(line: 214, column: 3, scope: !917, inlinedAt: !925)
!935 = !DILocation(line: 216, column: 1, scope: !917, inlinedAt: !925)
!936 = !DILocation(line: 234, column: 5, scope: !914)
!937 = !DILocation(line: 238, column: 3, scope: !852)
!938 = !DILocalVariable(name: "__c", arg: 1, scope: !939, file: !940, line: 101, type: !28)
!939 = distinct !DISubprogram(name: "putc_unlocked", scope: !940, file: !940, line: 101, type: !941, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !943)
!940 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!941 = !DISubroutineType(types: !942)
!942 = !{!28, !28, !868}
!943 = !{!938, !944}
!944 = !DILocalVariable(name: "__stream", arg: 2, scope: !939, file: !940, line: 101, type: !868)
!945 = !DILocation(line: 0, scope: !939, inlinedAt: !946)
!946 = distinct !DILocation(line: 238, column: 3, scope: !852)
!947 = !DILocation(line: 103, column: 10, scope: !939, inlinedAt: !946)
!948 = !{!949, !434, i64 40}
!949 = !{!"_IO_FILE", !516, i64 0, !434, i64 8, !434, i64 16, !434, i64 24, !434, i64 32, !434, i64 40, !434, i64 48, !434, i64 56, !434, i64 64, !434, i64 72, !434, i64 80, !434, i64 88, !434, i64 96, !434, i64 104, !516, i64 112, !516, i64 116, !950, i64 120, !550, i64 128, !435, i64 130, !435, i64 131, !434, i64 136, !950, i64 144, !434, i64 152, !434, i64 160, !434, i64 168, !434, i64 176, !950, i64 184, !516, i64 192, !435, i64 196}
!950 = !{!"long", !435, i64 0}
!951 = !{!949, !434, i64 48}
!952 = !{!"branch_weights", i32 2000, i32 1}
!953 = !DILocation(line: 240, column: 3, scope: !852)
!954 = !DILocation(line: 241, column: 7, scope: !955)
!955 = distinct !DILexicalBlock(scope: !852, file: !151, line: 241, column: 7)
!956 = !DILocation(line: 241, column: 7, scope: !852)
!957 = !DILocation(line: 242, column: 5, scope: !955)
!958 = !DILocation(line: 243, column: 1, scope: !852)
!959 = !DISubprogram(name: "strerror_r", scope: !960, file: !960, line: 444, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!960 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!961 = !DISubroutineType(types: !962)
!962 = !{!25, !28, !25, !30}
!963 = !DISubprogram(name: "fflush_unlocked", scope: !160, file: !160, line: 239, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!964 = !DISubroutineType(types: !965)
!965 = !{!28, !868}
!966 = !DISubprogram(name: "fcntl", scope: !967, file: !967, line: 149, type: !968, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!967 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!968 = !DISubroutineType(types: !969)
!969 = !{!28, !28, !28, null}
!970 = distinct !DISubprogram(name: "error", scope: !151, file: !151, line: 285, type: !971, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !28, !28, !33, null}
!973 = !{!974, !975, !976, !977}
!974 = !DILocalVariable(name: "status", arg: 1, scope: !970, file: !151, line: 285, type: !28)
!975 = !DILocalVariable(name: "errnum", arg: 2, scope: !970, file: !151, line: 285, type: !28)
!976 = !DILocalVariable(name: "message", arg: 3, scope: !970, file: !151, line: 285, type: !33)
!977 = !DILocalVariable(name: "ap", scope: !970, file: !151, line: 287, type: !159)
!978 = !DILocation(line: 0, scope: !970)
!979 = !DILocation(line: 287, column: 3, scope: !970)
!980 = !DILocation(line: 287, column: 11, scope: !970)
!981 = !DILocation(line: 288, column: 3, scope: !970)
!982 = !DILocation(line: 289, column: 3, scope: !970)
!983 = !DILocation(line: 290, column: 3, scope: !970)
!984 = !DILocation(line: 291, column: 1, scope: !970)
!985 = !DILocation(line: 0, scope: !156)
!986 = !DILocation(line: 298, column: 1, scope: !156)
!987 = !DILocation(line: 302, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !156, file: !151, line: 302, column: 7)
!989 = !DILocation(line: 302, column: 7, scope: !156)
!990 = !DILocation(line: 307, column: 11, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !151, line: 307, column: 11)
!992 = distinct !DILexicalBlock(scope: !988, file: !151, line: 303, column: 5)
!993 = !DILocation(line: 307, column: 27, scope: !991)
!994 = !DILocation(line: 308, column: 11, scope: !991)
!995 = !DILocation(line: 308, column: 28, scope: !991)
!996 = !DILocation(line: 308, column: 25, scope: !991)
!997 = !DILocation(line: 309, column: 15, scope: !991)
!998 = !DILocation(line: 309, column: 33, scope: !991)
!999 = !DILocation(line: 310, column: 19, scope: !991)
!1000 = !DILocation(line: 311, column: 22, scope: !991)
!1001 = !DILocation(line: 311, column: 56, scope: !991)
!1002 = !DILocation(line: 307, column: 11, scope: !992)
!1003 = !DILocation(line: 316, column: 21, scope: !992)
!1004 = !DILocation(line: 317, column: 23, scope: !992)
!1005 = !DILocation(line: 318, column: 5, scope: !992)
!1006 = !DILocation(line: 327, column: 3, scope: !156)
!1007 = !DILocation(line: 331, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !156, file: !151, line: 331, column: 7)
!1009 = !DILocation(line: 331, column: 7, scope: !156)
!1010 = !DILocation(line: 332, column: 5, scope: !1008)
!1011 = !DILocation(line: 338, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1008, file: !151, line: 334, column: 5)
!1013 = !DILocation(line: 346, column: 3, scope: !156)
!1014 = !DILocation(line: 350, column: 3, scope: !156)
!1015 = !DILocation(line: 356, column: 1, scope: !156)
!1016 = distinct !DISubprogram(name: "error_at_line", scope: !151, file: !151, line: 359, type: !1017, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !150, retainedNodes: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !28, !28, !33, !6, !33, null}
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025}
!1020 = !DILocalVariable(name: "status", arg: 1, scope: !1016, file: !151, line: 359, type: !28)
!1021 = !DILocalVariable(name: "errnum", arg: 2, scope: !1016, file: !151, line: 359, type: !28)
!1022 = !DILocalVariable(name: "file_name", arg: 3, scope: !1016, file: !151, line: 359, type: !33)
!1023 = !DILocalVariable(name: "line_number", arg: 4, scope: !1016, file: !151, line: 360, type: !6)
!1024 = !DILocalVariable(name: "message", arg: 5, scope: !1016, file: !151, line: 360, type: !33)
!1025 = !DILocalVariable(name: "ap", scope: !1016, file: !151, line: 362, type: !159)
!1026 = !DILocation(line: 0, scope: !1016)
!1027 = !DILocation(line: 362, column: 3, scope: !1016)
!1028 = !DILocation(line: 362, column: 11, scope: !1016)
!1029 = !DILocation(line: 363, column: 3, scope: !1016)
!1030 = !DILocation(line: 364, column: 3, scope: !1016)
!1031 = !DILocation(line: 366, column: 3, scope: !1016)
!1032 = !DILocation(line: 367, column: 1, scope: !1016)
!1033 = distinct !DISubprogram(name: "getprogname", scope: !349, file: !349, line: 54, type: !1034, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !348, retainedNodes: !512)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!33}
!1036 = !DILocation(line: 58, column: 10, scope: !1033)
!1037 = !DILocation(line: 58, column: 3, scope: !1033)
!1038 = distinct !DISubprogram(name: "set_program_name", scope: !192, file: !192, line: 37, type: !445, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DILocalVariable(name: "argv0", arg: 1, scope: !1038, file: !192, line: 37, type: !33)
!1041 = !DILocalVariable(name: "slash", scope: !1038, file: !192, line: 44, type: !33)
!1042 = !DILocalVariable(name: "base", scope: !1038, file: !192, line: 45, type: !33)
!1043 = !DILocation(line: 0, scope: !1038)
!1044 = !DILocation(line: 44, column: 23, scope: !1038)
!1045 = !DILocation(line: 45, column: 22, scope: !1038)
!1046 = !DILocation(line: 46, column: 17, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1038, file: !192, line: 46, column: 7)
!1048 = !DILocation(line: 46, column: 9, scope: !1047)
!1049 = !DILocation(line: 46, column: 25, scope: !1047)
!1050 = !DILocation(line: 46, column: 40, scope: !1047)
!1051 = !DILocalVariable(name: "__s1", arg: 1, scope: !1052, file: !470, line: 974, type: !638)
!1052 = distinct !DISubprogram(name: "memeq", scope: !470, file: !470, line: 974, type: !1053, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !191, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!50, !638, !638, !30}
!1055 = !{!1051, !1056, !1057}
!1056 = !DILocalVariable(name: "__s2", arg: 2, scope: !1052, file: !470, line: 974, type: !638)
!1057 = !DILocalVariable(name: "__n", arg: 3, scope: !1052, file: !470, line: 974, type: !30)
!1058 = !DILocation(line: 0, scope: !1052, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 46, column: 28, scope: !1047)
!1060 = !DILocation(line: 976, column: 11, scope: !1052, inlinedAt: !1059)
!1061 = !DILocation(line: 976, column: 10, scope: !1052, inlinedAt: !1059)
!1062 = !DILocation(line: 46, column: 7, scope: !1038)
!1063 = !DILocation(line: 49, column: 11, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !192, line: 49, column: 11)
!1065 = distinct !DILexicalBlock(scope: !1047, file: !192, line: 47, column: 5)
!1066 = !DILocation(line: 49, column: 36, scope: !1064)
!1067 = !DILocation(line: 49, column: 11, scope: !1065)
!1068 = !DILocation(line: 65, column: 16, scope: !1038)
!1069 = !DILocation(line: 71, column: 27, scope: !1038)
!1070 = !DILocation(line: 74, column: 33, scope: !1038)
!1071 = !DILocation(line: 76, column: 1, scope: !1038)
!1072 = !DILocation(line: 0, scope: !197)
!1073 = !DILocation(line: 40, column: 29, scope: !197)
!1074 = !DILocation(line: 41, column: 19, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !197, file: !198, line: 41, column: 7)
!1076 = !DILocation(line: 41, column: 7, scope: !197)
!1077 = !DILocation(line: 47, column: 3, scope: !197)
!1078 = !DILocation(line: 48, column: 3, scope: !197)
!1079 = !DILocation(line: 48, column: 13, scope: !197)
!1080 = !DILocalVariable(name: "ps", arg: 1, scope: !1081, file: !1082, line: 1135, type: !1085)
!1081 = distinct !DISubprogram(name: "mbszero", scope: !1082, file: !1082, line: 1135, type: !1083, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1086)
!1082 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1085}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!1086 = !{!1080}
!1087 = !DILocation(line: 0, scope: !1081, inlinedAt: !1088)
!1088 = distinct !DILocation(line: 48, column: 18, scope: !197)
!1089 = !DILocalVariable(name: "__dest", arg: 1, scope: !1090, file: !1091, line: 57, type: !27)
!1090 = distinct !DISubprogram(name: "memset", scope: !1091, file: !1091, line: 57, type: !1092, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !1094)
!1091 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!27, !27, !28, !30}
!1094 = !{!1089, !1095, !1096}
!1095 = !DILocalVariable(name: "__ch", arg: 2, scope: !1090, file: !1091, line: 57, type: !28)
!1096 = !DILocalVariable(name: "__len", arg: 3, scope: !1090, file: !1091, line: 57, type: !30)
!1097 = !DILocation(line: 0, scope: !1090, inlinedAt: !1098)
!1098 = distinct !DILocation(line: 1137, column: 3, scope: !1081, inlinedAt: !1088)
!1099 = !DILocation(line: 59, column: 10, scope: !1090, inlinedAt: !1098)
!1100 = !DILocation(line: 49, column: 7, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !197, file: !198, line: 49, column: 7)
!1102 = !DILocation(line: 49, column: 39, scope: !1101)
!1103 = !DILocation(line: 49, column: 44, scope: !1101)
!1104 = !DILocation(line: 54, column: 1, scope: !197)
!1105 = !DISubprogram(name: "mbrtoc32", scope: !209, file: !209, line: 57, type: !1106, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !512)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!30, !1108, !628, !30, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1085)
!1111 = distinct !DISubprogram(name: "clone_quoting_options", scope: !232, file: !232, line: 113, type: !1112, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1115)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!1114, !1114}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!1115 = !{!1116, !1117, !1118}
!1116 = !DILocalVariable(name: "o", arg: 1, scope: !1111, file: !232, line: 113, type: !1114)
!1117 = !DILocalVariable(name: "saved_errno", scope: !1111, file: !232, line: 115, type: !28)
!1118 = !DILocalVariable(name: "p", scope: !1111, file: !232, line: 116, type: !1114)
!1119 = !DILocation(line: 0, scope: !1111)
!1120 = !DILocation(line: 115, column: 21, scope: !1111)
!1121 = !DILocation(line: 116, column: 40, scope: !1111)
!1122 = !DILocation(line: 116, column: 31, scope: !1111)
!1123 = !DILocation(line: 118, column: 9, scope: !1111)
!1124 = !DILocation(line: 119, column: 3, scope: !1111)
!1125 = distinct !DISubprogram(name: "get_quoting_style", scope: !232, file: !232, line: 124, type: !1126, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1130)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!234, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!1130 = !{!1131}
!1131 = !DILocalVariable(name: "o", arg: 1, scope: !1125, file: !232, line: 124, type: !1128)
!1132 = !DILocation(line: 0, scope: !1125)
!1133 = !DILocation(line: 126, column: 11, scope: !1125)
!1134 = !DILocation(line: 126, column: 46, scope: !1125)
!1135 = !{!1136, !435, i64 0}
!1136 = !{!"quoting_options", !435, i64 0, !516, i64 4, !435, i64 8, !434, i64 40, !434, i64 48}
!1137 = !DILocation(line: 126, column: 3, scope: !1125)
!1138 = distinct !DISubprogram(name: "set_quoting_style", scope: !232, file: !232, line: 132, type: !1139, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1141)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !1114, !234}
!1141 = !{!1142, !1143}
!1142 = !DILocalVariable(name: "o", arg: 1, scope: !1138, file: !232, line: 132, type: !1114)
!1143 = !DILocalVariable(name: "s", arg: 2, scope: !1138, file: !232, line: 132, type: !234)
!1144 = !DILocation(line: 0, scope: !1138)
!1145 = !DILocation(line: 134, column: 4, scope: !1138)
!1146 = !DILocation(line: 134, column: 39, scope: !1138)
!1147 = !DILocation(line: 134, column: 45, scope: !1138)
!1148 = !DILocation(line: 135, column: 1, scope: !1138)
!1149 = distinct !DISubprogram(name: "set_char_quoting", scope: !232, file: !232, line: 143, type: !1150, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1152)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!28, !1114, !26, !28}
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1159, !1160}
!1153 = !DILocalVariable(name: "o", arg: 1, scope: !1149, file: !232, line: 143, type: !1114)
!1154 = !DILocalVariable(name: "c", arg: 2, scope: !1149, file: !232, line: 143, type: !26)
!1155 = !DILocalVariable(name: "i", arg: 3, scope: !1149, file: !232, line: 143, type: !28)
!1156 = !DILocalVariable(name: "uc", scope: !1149, file: !232, line: 145, type: !35)
!1157 = !DILocalVariable(name: "p", scope: !1149, file: !232, line: 146, type: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1159 = !DILocalVariable(name: "shift", scope: !1149, file: !232, line: 148, type: !28)
!1160 = !DILocalVariable(name: "r", scope: !1149, file: !232, line: 149, type: !6)
!1161 = !DILocation(line: 0, scope: !1149)
!1162 = !DILocation(line: 147, column: 6, scope: !1149)
!1163 = !DILocation(line: 147, column: 62, scope: !1149)
!1164 = !DILocation(line: 147, column: 57, scope: !1149)
!1165 = !DILocation(line: 148, column: 15, scope: !1149)
!1166 = !DILocation(line: 149, column: 21, scope: !1149)
!1167 = !DILocation(line: 149, column: 24, scope: !1149)
!1168 = !DILocation(line: 149, column: 34, scope: !1149)
!1169 = !DILocation(line: 150, column: 13, scope: !1149)
!1170 = !DILocation(line: 150, column: 19, scope: !1149)
!1171 = !DILocation(line: 150, column: 24, scope: !1149)
!1172 = !DILocation(line: 150, column: 6, scope: !1149)
!1173 = !DILocation(line: 151, column: 3, scope: !1149)
!1174 = distinct !DISubprogram(name: "set_quoting_flags", scope: !232, file: !232, line: 159, type: !1175, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1177)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!28, !1114, !28}
!1177 = !{!1178, !1179, !1180}
!1178 = !DILocalVariable(name: "o", arg: 1, scope: !1174, file: !232, line: 159, type: !1114)
!1179 = !DILocalVariable(name: "i", arg: 2, scope: !1174, file: !232, line: 159, type: !28)
!1180 = !DILocalVariable(name: "r", scope: !1174, file: !232, line: 163, type: !28)
!1181 = !DILocation(line: 0, scope: !1174)
!1182 = !DILocation(line: 161, column: 8, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1174, file: !232, line: 161, column: 7)
!1184 = !DILocation(line: 161, column: 7, scope: !1174)
!1185 = !DILocation(line: 163, column: 14, scope: !1174)
!1186 = !{!1136, !516, i64 4}
!1187 = !DILocation(line: 164, column: 12, scope: !1174)
!1188 = !DILocation(line: 165, column: 3, scope: !1174)
!1189 = distinct !DISubprogram(name: "set_custom_quoting", scope: !232, file: !232, line: 169, type: !1190, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1192)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{null, !1114, !33, !33}
!1192 = !{!1193, !1194, !1195}
!1193 = !DILocalVariable(name: "o", arg: 1, scope: !1189, file: !232, line: 169, type: !1114)
!1194 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1189, file: !232, line: 170, type: !33)
!1195 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1189, file: !232, line: 170, type: !33)
!1196 = !DILocation(line: 0, scope: !1189)
!1197 = !DILocation(line: 172, column: 8, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1189, file: !232, line: 172, column: 7)
!1199 = !DILocation(line: 172, column: 7, scope: !1189)
!1200 = !DILocation(line: 174, column: 6, scope: !1189)
!1201 = !DILocation(line: 174, column: 12, scope: !1189)
!1202 = !DILocation(line: 175, column: 8, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1189, file: !232, line: 175, column: 7)
!1204 = !DILocation(line: 175, column: 19, scope: !1203)
!1205 = !DILocation(line: 176, column: 5, scope: !1203)
!1206 = !DILocation(line: 177, column: 6, scope: !1189)
!1207 = !DILocation(line: 177, column: 17, scope: !1189)
!1208 = !{!1136, !434, i64 40}
!1209 = !DILocation(line: 178, column: 6, scope: !1189)
!1210 = !DILocation(line: 178, column: 18, scope: !1189)
!1211 = !{!1136, !434, i64 48}
!1212 = !DILocation(line: 179, column: 1, scope: !1189)
!1213 = distinct !DISubprogram(name: "quotearg_buffer", scope: !232, file: !232, line: 774, type: !1214, scopeLine: 777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !231, retainedNodes: !1216)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!30, !25, !30, !33, !30, !1128}
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1217 = !DILocalVariable(name: "buffer", arg: 1, scope: !1213, file: !232, line: 774, type: !25)
!1218 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1213, file: !232, line: 774, type: !30)
!1219 = !DILocalVariable(name: "arg", arg: 3, scope: !1213, file: !232, line: 775, type: !33)
