; ModuleID = 'src/ptx.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.regex_data = type { i8*, %struct.re_pattern_buffer, [256 x i8] }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.infomap = type { i8*, i8* }
%struct.WORD_TABLE = type { %struct.WORD*, i64, i64 }
%struct.WORD = type { i8*, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.re_registers = type { i32, i32*, i32* }
%struct.OCCURS = type { %struct.WORD, i64, i64, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 1755, type: !331, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !49, globals: !86, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/ptx.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cfe1dec8bfd15bb6d7efafdae0f1e83b")
!4 = !{!5, !14, !20, !34}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!10 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!11 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!12 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!13 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Format", file: !3, line: 62, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "UNKNOWN_FORMAT", value: 0)
!17 = !DIEnumerator(name: "DUMB_FORMAT", value: 1)
!18 = !DIEnumerator(name: "ROFF_FORMAT", value: 2)
!19 = !DIEnumerator(name: "TEX_FORMAT", value: 3)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !21, line: 42, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!23 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!24 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!25 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!26 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!27 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!28 = !DIEnumerator(name: "c_quoting_style", value: 5)
!29 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!30 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!31 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!32 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!33 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 46, baseType: !7, size: 32, elements: !36)
!35 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!37 = !DIEnumerator(name: "_ISupper", value: 256)
!38 = !DIEnumerator(name: "_ISlower", value: 512)
!39 = !DIEnumerator(name: "_ISalpha", value: 1024)
!40 = !DIEnumerator(name: "_ISdigit", value: 2048)
!41 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!42 = !DIEnumerator(name: "_ISspace", value: 8192)
!43 = !DIEnumerator(name: "_ISprint", value: 16384)
!44 = !DIEnumerator(name: "_ISgraph", value: 32768)
!45 = !DIEnumerator(name: "_ISblank", value: 1)
!46 = !DIEnumerator(name: "_IScntrl", value: 2)
!47 = !DIEnumerator(name: "_ISpunct", value: 4)
!48 = !DIEnumerator(name: "_ISalnum", value: 8)
!49 = !{!50, !52, !54, !55, !56, !57, !60, !62, !63}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!59 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCCURS", file: !3, line: 230, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 222, size: 384, elements: !67)
!67 = !{!68, !78, !79, !80, !85}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !66, file: !3, line: 224, baseType: !69, size: 128)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !3, line: 117, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 112, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !70, file: !3, line: 114, baseType: !52, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !3, line: 115, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !75, line: 130, baseType: !76)
!75 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !58, line: 35, baseType: !77)
!77 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !66, file: !3, line: 225, baseType: !76, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !66, file: !3, line: 226, baseType: !76, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !66, file: !3, line: 227, baseType: !81, size: 64, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !82, line: 101, baseType: !83)
!82 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !84, line: 72, baseType: !77)
!84 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !66, file: !3, line: 228, baseType: !55, size: 32, offset: 320)
!86 = !{!87, !119, !121, !123, !125, !134, !136, !138, !140, !143, !146, !154, !159, !0, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !274, !280, !283, !285, !295, !297, !299, !303, !305, !307, !309, !311, !313, !315, !317, !319, !321, !323, !325, !327, !329}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "context_regex", scope: !2, file: !3, line: 98, type: !89, isLocal: true, isDefinition: true)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regex_data", file: !3, line: 88, size: 2624, elements: !90)
!90 = !{!91, !92, !115}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !89, file: !3, line: 91, baseType: !60, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !89, file: !3, line: 94, baseType: !93, size: 512, offset: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !94, line: 413, size: 512, elements: !95)
!94 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!95 = !{!96, !99, !101, !102, !104, !105, !107, !108, !109, !110, !111, !112, !113, !114}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 417, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !94, line: 417, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !93, file: !94, line: 420, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !94, line: 56, baseType: !59)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !93, file: !94, line: 423, baseType: !100, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !93, file: !94, line: 426, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !94, line: 71, baseType: !59)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !93, file: !94, line: 431, baseType: !52, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !93, file: !94, line: 437, baseType: !106, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !93, file: !94, line: 440, baseType: !57, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !93, file: !94, line: 446, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !93, file: !94, line: 457, baseType: !7, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !93, file: !94, line: 461, baseType: !7, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !93, file: !94, line: 465, baseType: !7, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !93, file: !94, line: 469, baseType: !7, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !93, file: !94, line: 472, baseType: !7, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !93, file: !94, line: 475, baseType: !7, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !89, file: !3, line: 95, baseType: !116, size: 2048, offset: 576)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 256)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "word_regex", scope: !2, file: !3, line: 99, type: !89, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "maximum_word_length", scope: !2, file: !3, line: 146, type: !74, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "reference_max_width", scope: !2, file: !3, line: 149, type: !74, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "ignore_table", scope: !2, file: !3, line: 153, type: !127, isLocal: true, isDefinition: true)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD_TABLE", file: !3, line: 125, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 119, size: 192, elements: !129)
!129 = !{!130, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !128, file: !3, line: 121, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !128, file: !3, line: 122, baseType: !74, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !128, file: !3, line: 123, baseType: !74, size: 64, offset: 128)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "only_table", scope: !2, file: !3, line: 154, type: !127, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "number_input_files", scope: !2, file: !3, line: 158, type: !55, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "total_line_count", scope: !2, file: !3, line: 159, type: !81, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "input_file_name", scope: !2, file: !3, line: 160, type: !142, isLocal: true, isDefinition: true)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "file_line_count", scope: !2, file: !3, line: 161, type: !145, isLocal: true, isDefinition: true)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "text_buffers", scope: !2, file: !3, line: 163, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !3, line: 110, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 105, size: 128, elements: !151)
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !150, file: !3, line: 107, baseType: !52, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !150, file: !3, line: 108, baseType: !52, size: 64, offset: 64)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "number_of_occurs", scope: !2, file: !3, line: 237, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 1)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !161, file: !162, line: 575, type: !55, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "oputs_", scope: !162, file: !162, line: 573, type: !163, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !165)
!162 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!163 = !DISubroutineType(types: !164)
!164 = !{null, !60, !60}
!165 = !{!166, !167, !168, !171, !173, !174, !175, !179, !180, !181, !182, !184, !236, !237, !238, !240, !241}
!166 = !DILocalVariable(name: "program", arg: 1, scope: !161, file: !162, line: 573, type: !60)
!167 = !DILocalVariable(name: "option", arg: 2, scope: !161, file: !162, line: 573, type: !60)
!168 = !DILocalVariable(name: "term", scope: !169, file: !162, line: 585, type: !60)
!169 = distinct !DILexicalBlock(scope: !170, file: !162, line: 582, column: 5)
!170 = distinct !DILexicalBlock(scope: !161, file: !162, line: 581, column: 7)
!171 = !DILocalVariable(name: "double_space", scope: !161, file: !162, line: 594, type: !172)
!172 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!173 = !DILocalVariable(name: "first_word", scope: !161, file: !162, line: 595, type: !60)
!174 = !DILocalVariable(name: "option_text", scope: !161, file: !162, line: 596, type: !60)
!175 = !DILocalVariable(name: "s", scope: !176, file: !162, line: 608, type: !60)
!176 = distinct !DILexicalBlock(scope: !177, file: !162, line: 605, column: 5)
!177 = distinct !DILexicalBlock(scope: !178, file: !162, line: 604, column: 12)
!178 = distinct !DILexicalBlock(scope: !161, file: !162, line: 597, column: 7)
!179 = !DILocalVariable(name: "spaces", scope: !176, file: !162, line: 609, type: !57)
!180 = !DILocalVariable(name: "anchor_len", scope: !161, file: !162, line: 620, type: !57)
!181 = !DILocalVariable(name: "desc_text", scope: !161, file: !162, line: 625, type: !60)
!182 = !DILocalVariable(name: "__ptr", scope: !183, file: !162, line: 644, type: !60)
!183 = distinct !DILexicalBlock(scope: !161, file: !162, line: 644, column: 3)
!184 = !DILocalVariable(name: "__stream", scope: !183, file: !162, line: 644, type: !185)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !187, line: 7, baseType: !188)
!187 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !189, line: 49, size: 1728, elements: !190)
!189 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !206, !208, !209, !210, !212, !213, !215, !217, !220, !222, !225, !228, !229, !230, !231, !232}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !188, file: !189, line: 51, baseType: !55, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !188, file: !189, line: 54, baseType: !52, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !188, file: !189, line: 55, baseType: !52, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !188, file: !189, line: 56, baseType: !52, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !188, file: !189, line: 57, baseType: !52, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !188, file: !189, line: 58, baseType: !52, size: 64, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !188, file: !189, line: 59, baseType: !52, size: 64, offset: 384)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !188, file: !189, line: 60, baseType: !52, size: 64, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !188, file: !189, line: 61, baseType: !52, size: 64, offset: 512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !188, file: !189, line: 64, baseType: !52, size: 64, offset: 576)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !188, file: !189, line: 65, baseType: !52, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !188, file: !189, line: 66, baseType: !52, size: 64, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !188, file: !189, line: 68, baseType: !204, size: 64, offset: 768)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !189, line: 36, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !188, file: !189, line: 70, baseType: !207, size: 64, offset: 832)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !188, file: !189, line: 72, baseType: !55, size: 32, offset: 896)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !188, file: !189, line: 73, baseType: !55, size: 32, offset: 928)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !188, file: !189, line: 74, baseType: !211, size: 64, offset: 960)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !84, line: 152, baseType: !77)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !188, file: !189, line: 77, baseType: !56, size: 16, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !188, file: !189, line: 78, baseType: !214, size: 8, offset: 1040)
!214 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !188, file: !189, line: 79, baseType: !216, size: 8, offset: 1048)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 8, elements: !157)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !188, file: !189, line: 81, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !189, line: 43, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !188, file: !189, line: 89, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !84, line: 153, baseType: !77)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !188, file: !189, line: 91, baseType: !223, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !189, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !188, file: !189, line: 92, baseType: !226, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !189, line: 38, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !188, file: !189, line: 93, baseType: !207, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !188, file: !189, line: 94, baseType: !54, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !188, file: !189, line: 95, baseType: !57, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !188, file: !189, line: 96, baseType: !55, size: 32, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !188, file: !189, line: 98, baseType: !233, size: 160, offset: 1568)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 20)
!236 = !DILocalVariable(name: "__cnt", scope: !183, file: !162, line: 644, type: !57)
!237 = !DILocalVariable(name: "url_program", scope: !161, file: !162, line: 648, type: !60)
!238 = !DILocalVariable(name: "__ptr", scope: !239, file: !162, line: 686, type: !60)
!239 = distinct !DILexicalBlock(scope: !161, file: !162, line: 686, column: 3)
!240 = !DILocalVariable(name: "__stream", scope: !239, file: !162, line: 686, type: !185)
!241 = !DILocalVariable(name: "__cnt", scope: !239, file: !162, line: 686, type: !57)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "gnu_extensions", scope: !2, file: !3, line: 70, type: !172, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "break_file", scope: !2, file: !3, line: 83, type: !60, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "ignore_case", scope: !2, file: !3, line: 82, type: !172, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "gap_size", scope: !2, file: !3, line: 75, type: !74, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "ignore_file", scope: !2, file: !3, line: 85, type: !60, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "only_file", scope: !2, file: !3, line: 84, type: !60, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "input_reference", scope: !2, file: !3, line: 72, type: !172, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "line_width", scope: !2, file: !3, line: 74, type: !74, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "auto_reference", scope: !2, file: !3, line: 71, type: !172, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "truncation_string", scope: !2, file: !3, line: 76, type: !60, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "macro_name", scope: !2, file: !3, line: 78, type: !60, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "output_format", scope: !2, file: !3, line: 79, type: !14, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "right_reference", scope: !2, file: !3, line: 73, type: !172, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "format_vals", scope: !2, file: !3, line: 1783, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 64, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!272 = !{!273}
!273 = !DISubrange(count: 2)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "format_args", scope: !2, file: !3, line: 1778, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 192, elements: !278)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!278 = !{!279}
!279 = !DISubrange(count: 3)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "folded_chars", scope: !2, file: !3, line: 130, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, elements: !117)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "word_fastmap", scope: !2, file: !3, line: 143, type: !116, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "context_regs", scope: !2, file: !3, line: 133, type: !287, isLocal: true, isDefinition: true)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !94, line: 497, size: 192, elements: !288)
!288 = !{!289, !291, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !287, file: !94, line: 499, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !94, line: 55, baseType: !7)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !287, file: !94, line: 500, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !94, line: 490, baseType: !55)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !287, file: !94, line: 501, baseType: !292, size: 64, offset: 128)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "word_regs", scope: !2, file: !3, line: 136, type: !287, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "occurs_alloc", scope: !2, file: !3, line: 236, type: !156, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "occurs_table", scope: !2, file: !3, line: 235, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 64, elements: !157)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "reference", scope: !2, file: !3, line: 277, type: !149, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "half_line_width", scope: !2, file: !3, line: 246, type: !74, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "before_max_width", scope: !2, file: !3, line: 250, type: !76, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "keyafter_max_width", scope: !2, file: !3, line: 254, type: !76, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "truncation_string_length", scope: !2, file: !3, line: 257, type: !74, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "edited_flag", scope: !2, file: !3, line: 243, type: !116, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "tail", scope: !2, file: !3, line: 265, type: !149, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "tail_truncation", scope: !2, file: !3, line: 266, type: !172, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "head", scope: !2, file: !3, line: 274, type: !149, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "head_truncation", scope: !2, file: !3, line: 275, type: !172, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "keyafter", scope: !2, file: !3, line: 271, type: !149, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "keyafter_truncation", scope: !2, file: !3, line: 272, type: !172, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "before", scope: !2, file: !3, line: 268, type: !149, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "before_truncation", scope: !2, file: !3, line: 269, type: !172, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 4864, elements: !341)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !334, line: 50, size: 256, elements: !335)
!334 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!335 = !{!336, !337, !338, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !334, line: 52, baseType: !60, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !333, file: !334, line: 55, baseType: !55, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !334, line: 56, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !333, file: !334, line: 57, baseType: !55, size: 32, offset: 192)
!341 = !{!342}
!342 = !DISubrange(count: 19)
!343 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!344 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!345 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!346 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!347 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "Version", scope: !350, file: !351, line: 3, type: !60, isLocal: false, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !352, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!352 = !{!348}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !355, file: !356, line: 65, type: !360, isLocal: false, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !357, retainedTypes: !358, globals: !359, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!357 = !{!20}
!358 = !{!54, !60, !62}
!359 = !{!353}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !361, line: 69, baseType: !362)
!361 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "file_name", scope: !367, file: !368, line: 45, type: !60, isLocal: true, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !369, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!369 = !{!365, !370}
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !367, file: !368, line: 55, type: !172, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !374, file: !375, line: 66, type: !362, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C99, file: !375, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !376, globals: !377, splitDebugInlining: false, nameTableKind: None)
!375 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!376 = !{!54, !62}
!377 = !{!378, !404, !372, !406, !408}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "old_file_name", scope: !380, file: !375, line: 304, type: !60, isLocal: true, isDefinition: true)
!380 = distinct !DISubprogram(name: "verror_at_line", scope: !375, file: !375, line: 298, type: !381, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !374, retainedNodes: !397)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !55, !55, !60, !7, !60, !383}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !384, line: 52, baseType: !385)
!384 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !386, line: 32, baseType: !387)
!386 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !388, baseType: !389)
!388 = !DIFile(filename: "lib/error.c", directory: "/src")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !390, size: 256, elements: !391)
!390 = !DINamespace(name: "std", scope: null)
!391 = !{!392, !393, !394, !395, !396}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !389, file: !388, baseType: !54, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !389, file: !388, baseType: !54, size: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !389, file: !388, baseType: !54, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !389, file: !388, baseType: !55, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !389, file: !388, baseType: !55, size: 32, offset: 224)
!397 = !{!398, !399, !400, !401, !402, !403}
!398 = !DILocalVariable(name: "status", arg: 1, scope: !380, file: !375, line: 298, type: !55)
!399 = !DILocalVariable(name: "errnum", arg: 2, scope: !380, file: !375, line: 298, type: !55)
!400 = !DILocalVariable(name: "file_name", arg: 3, scope: !380, file: !375, line: 298, type: !60)
!401 = !DILocalVariable(name: "line_number", arg: 4, scope: !380, file: !375, line: 298, type: !7)
!402 = !DILocalVariable(name: "message", arg: 5, scope: !380, file: !375, line: 298, type: !60)
!403 = !DILocalVariable(name: "args", arg: 6, scope: !380, file: !375, line: 298, type: !383)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "old_line_number", scope: !380, file: !375, line: 305, type: !7, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "error_message_count", scope: !374, file: !375, line: 69, type: !7, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !374, file: !375, line: 295, type: !55, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "program_name", scope: !412, file: !413, line: 31, type: !60, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !414, globals: !415, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!414 = !{!52}
!415 = !{!410}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "utf07FF", scope: !418, file: !419, line: 46, type: !449, isLocal: true, isDefinition: true)
!418 = distinct !DISubprogram(name: "proper_name_lite", scope: !419, file: !419, line: 38, type: !420, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !424)
!419 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!420 = !DISubroutineType(types: !421)
!421 = !{!60, !60, !60}
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !423, splitDebugInlining: false, nameTableKind: None)
!423 = !{!416}
!424 = !{!425, !426, !427, !428, !433}
!425 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !418, file: !419, line: 38, type: !60)
!426 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !418, file: !419, line: 38, type: !60)
!427 = !DILocalVariable(name: "translation", scope: !418, file: !419, line: 40, type: !60)
!428 = !DILocalVariable(name: "w", scope: !418, file: !419, line: 47, type: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !430, line: 37, baseType: !431)
!430 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !84, line: 57, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !84, line: 42, baseType: !7)
!433 = !DILocalVariable(name: "mbs", scope: !418, file: !419, line: 48, type: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !436)
!435 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !438)
!437 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !438, file: !437, line: 15, baseType: !55, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !438, file: !437, line: 20, baseType: !442, size: 32, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !438, file: !437, line: 16, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !442, file: !437, line: 18, baseType: !7, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !442, file: !437, line: 19, baseType: !446, size: 32)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 4)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 16, elements: !272)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !452, file: !453, line: 76, type: !518, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !454, retainedTypes: !460, globals: !461, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!454 = !{!20, !455, !34}
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !21, line: 254, baseType: !7, size: 32, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!458 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!459 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!460 = !{!55, !56, !57}
!461 = !{!450, !462, !468, !480, !482, !484, !507, !514, !516}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !452, file: !453, line: 92, type: !464, isLocal: false, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 320, elements: !466)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!466 = !{!467}
!467 = !DISubrange(count: 10)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !452, file: !453, line: 1040, type: !470, isLocal: false, isDefinition: true)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !453, line: 56, size: 448, elements: !471)
!471 = !{!472, !473, !474, !478, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !470, file: !453, line: 59, baseType: !20, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !453, line: 62, baseType: !55, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !470, file: !453, line: 66, baseType: !475, size: 256, offset: 64)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !470, file: !453, line: 69, baseType: !60, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !470, file: !453, line: 72, baseType: !60, size: 64, offset: 384)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !452, file: !453, line: 107, type: !470, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "slot0", scope: !452, file: !453, line: 831, type: !116, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quote", scope: !486, file: !453, line: 228, type: !505, isLocal: true, isDefinition: true)
!486 = distinct !DISubprogram(name: "gettext_quote", scope: !453, file: !453, line: 197, type: !487, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !452, retainedNodes: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{!60, !60, !20}
!489 = !{!490, !491, !492, !493, !494}
!490 = !DILocalVariable(name: "msgid", arg: 1, scope: !486, file: !453, line: 197, type: !60)
!491 = !DILocalVariable(name: "s", arg: 2, scope: !486, file: !453, line: 197, type: !20)
!492 = !DILocalVariable(name: "translation", scope: !486, file: !453, line: 199, type: !60)
!493 = !DILocalVariable(name: "w", scope: !486, file: !453, line: 229, type: !429)
!494 = !DILocalVariable(name: "mbs", scope: !486, file: !453, line: 230, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !497, file: !437, line: 15, baseType: !55, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !497, file: !437, line: 20, baseType: !501, size: 32, offset: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !437, line: 16, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !501, file: !437, line: 18, baseType: !7, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !501, file: !437, line: 19, baseType: !446, size: 32)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 64, elements: !506)
!506 = !{!273, !448}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "slotvec", scope: !452, file: !453, line: 834, type: !509, isLocal: true, isDefinition: true)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !453, line: 823, size: 128, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !510, file: !453, line: 825, baseType: !57, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !510, file: !453, line: 826, baseType: !52, size: 64, offset: 64)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "nslots", scope: !452, file: !453, line: 832, type: !55, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "slotvec0", scope: !452, file: !453, line: 833, type: !510, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 704, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 11)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !523, file: !524, line: 26, type: !526, isLocal: false, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !525, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!525 = !{!521}
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 376, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 47)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "exit_failure", scope: !531, file: !532, line: 24, type: !534, isLocal: false, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !533, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!533 = !{!529}
!534 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "internal_state", scope: !537, file: !538, line: 97, type: !541, isLocal: true, isDefinition: true)
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !539, globals: !540, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!539 = !{!54, !57, !62}
!540 = !{!535}
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !435, line: 6, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !437, line: 21, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 13, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !543, file: !437, line: 15, baseType: !55, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !543, file: !437, line: 20, baseType: !547, size: 32, offset: 32)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !543, file: !437, line: 16, size: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !547, file: !437, line: 18, baseType: !7, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !547, file: !437, line: 19, baseType: !446, size: 32)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!553 = distinct !DICompileUnit(language: DW_LANG_C99, file: !554, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!554 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !557, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!557 = !{!54, !59}
!558 = distinct !DICompileUnit(language: DW_LANG_C99, file: !559, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !560, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!559 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!560 = !{!561}
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !559, line: 40, baseType: !7, size: 32, elements: !562)
!562 = !{!563}
!563 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!564 = !{!54}
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !567, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!567 = !{!568, !580}
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !569, file: !566, line: 188, baseType: !7, size: 32, elements: !578)
!569 = distinct !DISubprogram(name: "x2nrealloc", scope: !566, file: !566, line: 176, type: !570, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !565, retainedNodes: !573)
!570 = !DISubroutineType(types: !571)
!571 = !{!54, !54, !572, !57}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!573 = !{!574, !575, !576, !577}
!574 = !DILocalVariable(name: "p", arg: 1, scope: !569, file: !566, line: 176, type: !54)
!575 = !DILocalVariable(name: "pn", arg: 2, scope: !569, file: !566, line: 176, type: !572)
!576 = !DILocalVariable(name: "s", arg: 3, scope: !569, file: !566, line: 176, type: !57)
!577 = !DILocalVariable(name: "n", scope: !569, file: !566, line: 178, type: !57)
!578 = !{!579}
!579 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !581, file: !566, line: 228, baseType: !7, size: 32, elements: !578)
!581 = distinct !DISubprogram(name: "xpalloc", scope: !566, file: !566, line: 223, type: !582, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !565, retainedNodes: !585)
!582 = !DISubroutineType(types: !583)
!583 = !{!54, !54, !584, !74, !76, !74}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594}
!586 = !DILocalVariable(name: "pa", arg: 1, scope: !581, file: !566, line: 223, type: !54)
!587 = !DILocalVariable(name: "pn", arg: 2, scope: !581, file: !566, line: 223, type: !584)
!588 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !581, file: !566, line: 223, type: !74)
!589 = !DILocalVariable(name: "n_max", arg: 4, scope: !581, file: !566, line: 223, type: !76)
!590 = !DILocalVariable(name: "s", arg: 5, scope: !581, file: !566, line: 223, type: !74)
!591 = !DILocalVariable(name: "n0", scope: !581, file: !566, line: 230, type: !74)
!592 = !DILocalVariable(name: "n", scope: !581, file: !566, line: 237, type: !74)
!593 = !DILocalVariable(name: "nbytes", scope: !581, file: !566, line: 248, type: !74)
!594 = !DILocalVariable(name: "adjusted_nbytes", scope: !581, file: !566, line: 252, type: !74)
!595 = !{!52, !54, !172, !77, !59}
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !600, retainedTypes: !601, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!600 = !{!5}
!601 = !{!172, !77, !59, !81}
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!606 = distinct !DICompileUnit(language: DW_LANG_C99, file: !607, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !616, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!616 = !{!172, !59, !54}
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !620, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!620 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !564, splitDebugInlining: false, nameTableKind: None)
!622 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!623 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!624 = !{i32 7, !"Dwarf Version", i32 5}
!625 = !{i32 2, !"Debug Info Version", i32 3}
!626 = !{i32 1, !"wchar_size", i32 4}
!627 = !{i32 1, !"branch-target-enforcement", i32 0}
!628 = !{i32 1, !"sign-return-address", i32 0}
!629 = !{i32 1, !"sign-return-address-all", i32 0}
!630 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!631 = !{i32 7, !"PIC Level", i32 2}
!632 = !{i32 7, !"PIE Level", i32 2}
!633 = !{i32 7, !"uwtable", i32 1}
!634 = !{i32 7, !"frame-pointer", i32 1}
!635 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 1666, type: !636, scopeLine: 1667, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{null, !55}
!638 = !{!639}
!639 = !DILocalVariable(name: "status", arg: 1, scope: !635, file: !3, line: 1666, type: !55)
!640 = !DILocation(line: 0, scope: !635)
!641 = !DILocation(line: 1668, column: 14, scope: !642)
!642 = distinct !DILexicalBlock(scope: !635, file: !3, line: 1668, column: 7)
!643 = !DILocation(line: 1668, column: 7, scope: !635)
!644 = !DILocation(line: 1669, column: 5, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !3, line: 1669, column: 5)
!646 = !{!647, !647, i64 0}
!647 = !{!"any pointer", !648, i64 0}
!648 = !{!"omnipotent char", !649, i64 0}
!649 = !{!"Simple C/C++ TBAA"}
!650 = !DILocation(line: 1672, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !642, file: !3, line: 1671, column: 5)
!652 = !DILocation(line: 1676, column: 7, scope: !651)
!653 = !DILocation(line: 729, column: 3, scope: !654, inlinedAt: !656)
!654 = distinct !DISubprogram(name: "emit_stdin_note", scope: !162, file: !162, line: 727, type: !363, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !655)
!655 = !{}
!656 = distinct !DILocation(line: 1680, column: 7, scope: !651)
!657 = !DILocation(line: 736, column: 3, scope: !658, inlinedAt: !659)
!658 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !162, file: !162, line: 734, type: !363, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !655)
!659 = distinct !DILocation(line: 1681, column: 7, scope: !651)
!660 = !DILocation(line: 1683, column: 7, scope: !651)
!661 = !DILocation(line: 1686, column: 7, scope: !651)
!662 = !DILocation(line: 1689, column: 7, scope: !651)
!663 = !DILocation(line: 1693, column: 7, scope: !651)
!664 = !DILocation(line: 1696, column: 7, scope: !651)
!665 = !DILocation(line: 1699, column: 7, scope: !651)
!666 = !DILocation(line: 1702, column: 7, scope: !651)
!667 = !DILocation(line: 1705, column: 7, scope: !651)
!668 = !DILocation(line: 1708, column: 7, scope: !651)
!669 = !DILocation(line: 1711, column: 7, scope: !651)
!670 = !DILocation(line: 1714, column: 7, scope: !651)
!671 = !DILocation(line: 1717, column: 7, scope: !651)
!672 = !DILocation(line: 1720, column: 7, scope: !651)
!673 = !DILocation(line: 1723, column: 7, scope: !651)
!674 = !DILocation(line: 1726, column: 7, scope: !651)
!675 = !DILocation(line: 1729, column: 7, scope: !651)
!676 = !DILocation(line: 1732, column: 7, scope: !651)
!677 = !DILocation(line: 1735, column: 7, scope: !651)
!678 = !DILocation(line: 1736, column: 7, scope: !651)
!679 = !DILocalVariable(name: "program", arg: 1, scope: !680, file: !162, line: 836, type: !60)
!680 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !162, file: !162, line: 836, type: !681, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !60}
!683 = !{!679, !684, !693, !694, !696, !697}
!684 = !DILocalVariable(name: "infomap", scope: !680, file: !162, line: 838, type: !685)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 896, elements: !691)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !680, file: !162, line: 838, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !687, file: !162, line: 838, baseType: !60, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !687, file: !162, line: 838, baseType: !60, size: 64, offset: 64)
!691 = !{!692}
!692 = !DISubrange(count: 7)
!693 = !DILocalVariable(name: "node", scope: !680, file: !162, line: 848, type: !60)
!694 = !DILocalVariable(name: "map_prog", scope: !680, file: !162, line: 849, type: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!696 = !DILocalVariable(name: "lc_messages", scope: !680, file: !162, line: 861, type: !60)
!697 = !DILocalVariable(name: "url_program", scope: !680, file: !162, line: 874, type: !60)
!698 = !DILocation(line: 0, scope: !680, inlinedAt: !699)
!699 = distinct !DILocation(line: 1737, column: 7, scope: !651)
!700 = !DILocation(line: 838, column: 3, scope: !680, inlinedAt: !699)
!701 = !DILocation(line: 838, column: 67, scope: !680, inlinedAt: !699)
!702 = !DILocation(line: 849, column: 36, scope: !680, inlinedAt: !699)
!703 = !DILocation(line: 851, column: 3, scope: !680, inlinedAt: !699)
!704 = !DILocalVariable(name: "__s1", arg: 1, scope: !705, file: !706, line: 1359, type: !60)
!705 = distinct !DISubprogram(name: "streq", scope: !706, file: !706, line: 1359, type: !707, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !709)
!706 = !DIFile(filename: "./lib/string.h", directory: "/src")
!707 = !DISubroutineType(types: !708)
!708 = !{!172, !60, !60}
!709 = !{!704, !710}
!710 = !DILocalVariable(name: "__s2", arg: 2, scope: !705, file: !706, line: 1359, type: !60)
!711 = !DILocation(line: 0, scope: !705, inlinedAt: !712)
!712 = distinct !DILocation(line: 851, column: 33, scope: !680, inlinedAt: !699)
!713 = !DILocation(line: 1361, column: 11, scope: !705, inlinedAt: !712)
!714 = !DILocation(line: 1361, column: 10, scope: !705, inlinedAt: !712)
!715 = !DILocation(line: 852, column: 13, scope: !680, inlinedAt: !699)
!716 = !DILocation(line: 851, column: 20, scope: !680, inlinedAt: !699)
!717 = !{!718, !647, i64 0}
!718 = !{!"infomap", !647, i64 0, !647, i64 8}
!719 = !DILocation(line: 851, column: 10, scope: !680, inlinedAt: !699)
!720 = !DILocation(line: 851, column: 28, scope: !680, inlinedAt: !699)
!721 = distinct !{!721, !703, !715, !722}
!722 = !{!"llvm.loop.mustprogress"}
!723 = !DILocation(line: 854, column: 17, scope: !724, inlinedAt: !699)
!724 = distinct !DILexicalBlock(scope: !680, file: !162, line: 854, column: 7)
!725 = !{!718, !647, i64 8}
!726 = !DILocation(line: 854, column: 7, scope: !724, inlinedAt: !699)
!727 = !DILocation(line: 854, column: 7, scope: !680, inlinedAt: !699)
!728 = !DILocation(line: 857, column: 3, scope: !680, inlinedAt: !699)
!729 = !DILocation(line: 861, column: 29, scope: !680, inlinedAt: !699)
!730 = !DILocation(line: 862, column: 7, scope: !731, inlinedAt: !699)
!731 = distinct !DILexicalBlock(scope: !680, file: !162, line: 862, column: 7)
!732 = !DILocation(line: 862, column: 19, scope: !731, inlinedAt: !699)
!733 = !DILocation(line: 862, column: 22, scope: !731, inlinedAt: !699)
!734 = !DILocation(line: 862, column: 7, scope: !680, inlinedAt: !699)
!735 = !DILocation(line: 868, column: 7, scope: !736, inlinedAt: !699)
!736 = distinct !DILexicalBlock(scope: !731, file: !162, line: 863, column: 5)
!737 = !DILocation(line: 870, column: 5, scope: !736, inlinedAt: !699)
!738 = !DILocation(line: 0, scope: !705, inlinedAt: !739)
!739 = distinct !DILocation(line: 874, column: 29, scope: !680, inlinedAt: !699)
!740 = !DILocation(line: 875, column: 3, scope: !680, inlinedAt: !699)
!741 = !DILocation(line: 877, column: 3, scope: !680, inlinedAt: !699)
!742 = !DILocation(line: 879, column: 1, scope: !680, inlinedAt: !699)
!743 = !DILocation(line: 1739, column: 3, scope: !635)
!744 = !DISubprogram(name: "dcgettext", scope: !745, file: !745, line: 51, type: !746, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!745 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!746 = !DISubroutineType(types: !747)
!747 = !{!52, !60, !60, !55}
!748 = !DISubprogram(name: "fputs_unlocked", scope: !384, file: !384, line: 691, type: !749, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!749 = !DISubroutineType(types: !750)
!750 = !{!55, !751, !752}
!751 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !60)
!752 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !185)
!753 = !DILocation(line: 0, scope: !161)
!754 = !DILocation(line: 581, column: 7, scope: !170)
!755 = !{!756, !756, i64 0}
!756 = !{!"int", !648, i64 0}
!757 = !DILocation(line: 581, column: 19, scope: !170)
!758 = !DILocation(line: 581, column: 7, scope: !161)
!759 = !DILocation(line: 585, column: 26, scope: !169)
!760 = !DILocation(line: 0, scope: !169)
!761 = !DILocation(line: 586, column: 23, scope: !169)
!762 = !DILocation(line: 586, column: 28, scope: !169)
!763 = !DILocation(line: 586, column: 32, scope: !169)
!764 = !{!648, !648, i64 0}
!765 = !DILocation(line: 586, column: 38, scope: !169)
!766 = !DILocation(line: 0, scope: !705, inlinedAt: !767)
!767 = distinct !DILocation(line: 586, column: 41, scope: !169)
!768 = !DILocation(line: 1361, column: 11, scope: !705, inlinedAt: !767)
!769 = !DILocation(line: 1361, column: 10, scope: !705, inlinedAt: !767)
!770 = !DILocation(line: 586, column: 19, scope: !169)
!771 = !DILocation(line: 587, column: 5, scope: !169)
!772 = !DILocation(line: 588, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !161, file: !162, line: 588, column: 7)
!774 = !DILocation(line: 588, column: 7, scope: !161)
!775 = !DILocation(line: 590, column: 7, scope: !776)
!776 = distinct !DILexicalBlock(scope: !773, file: !162, line: 589, column: 5)
!777 = !DILocation(line: 591, column: 7, scope: !776)
!778 = !DILocation(line: 595, column: 37, scope: !161)
!779 = !DILocation(line: 595, column: 35, scope: !161)
!780 = !DILocation(line: 596, column: 29, scope: !161)
!781 = !DILocation(line: 597, column: 8, scope: !178)
!782 = !DILocation(line: 597, column: 7, scope: !161)
!783 = !DILocation(line: 604, column: 24, scope: !177)
!784 = !DILocation(line: 604, column: 12, scope: !178)
!785 = !DILocation(line: 0, scope: !176)
!786 = !DILocation(line: 610, column: 16, scope: !176)
!787 = !DILocation(line: 610, column: 7, scope: !176)
!788 = !DILocation(line: 611, column: 21, scope: !176)
!789 = !{!790, !790, i64 0}
!790 = !{!"short", !648, i64 0}
!791 = !DILocation(line: 611, column: 19, scope: !176)
!792 = !DILocation(line: 611, column: 16, scope: !176)
!793 = !DILocation(line: 610, column: 30, scope: !176)
!794 = distinct !{!794, !787, !788, !722}
!795 = !DILocation(line: 612, column: 18, scope: !796)
!796 = distinct !DILexicalBlock(scope: !176, file: !162, line: 612, column: 11)
!797 = !DILocation(line: 612, column: 11, scope: !176)
!798 = !DILocation(line: 620, column: 23, scope: !161)
!799 = !DILocation(line: 625, column: 39, scope: !161)
!800 = !DILocation(line: 626, column: 3, scope: !161)
!801 = !DILocation(line: 626, column: 10, scope: !161)
!802 = !DILocation(line: 626, column: 21, scope: !161)
!803 = !DILocation(line: 628, column: 44, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !162, line: 628, column: 11)
!805 = distinct !DILexicalBlock(scope: !161, file: !162, line: 627, column: 5)
!806 = !DILocation(line: 628, column: 32, scope: !804)
!807 = !DILocation(line: 628, column: 49, scope: !804)
!808 = !DILocation(line: 628, column: 11, scope: !805)
!809 = !DILocation(line: 630, column: 11, scope: !810)
!810 = distinct !DILexicalBlock(scope: !805, file: !162, line: 630, column: 11)
!811 = !DILocation(line: 630, column: 11, scope: !805)
!812 = !DILocation(line: 632, column: 26, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !162, line: 632, column: 15)
!814 = distinct !DILexicalBlock(scope: !810, file: !162, line: 631, column: 9)
!815 = !DILocation(line: 632, column: 34, scope: !813)
!816 = !DILocation(line: 632, column: 37, scope: !813)
!817 = !DILocation(line: 632, column: 15, scope: !814)
!818 = !DILocation(line: 636, column: 29, scope: !819)
!819 = distinct !DILexicalBlock(scope: !814, file: !162, line: 636, column: 15)
!820 = !DILocation(line: 640, column: 16, scope: !805)
!821 = distinct !{!821, !800, !822, !722}
!822 = !DILocation(line: 641, column: 5, scope: !161)
!823 = !DILocation(line: 644, column: 3, scope: !161)
!824 = !DILocation(line: 0, scope: !705, inlinedAt: !825)
!825 = distinct !DILocation(line: 648, column: 31, scope: !161)
!826 = !DILocation(line: 0, scope: !705, inlinedAt: !827)
!827 = distinct !DILocation(line: 649, column: 31, scope: !161)
!828 = !DILocation(line: 0, scope: !705, inlinedAt: !829)
!829 = distinct !DILocation(line: 650, column: 31, scope: !161)
!830 = !DILocation(line: 0, scope: !705, inlinedAt: !831)
!831 = distinct !DILocation(line: 651, column: 31, scope: !161)
!832 = !DILocation(line: 0, scope: !705, inlinedAt: !833)
!833 = distinct !DILocation(line: 652, column: 31, scope: !161)
!834 = !DILocation(line: 0, scope: !705, inlinedAt: !835)
!835 = distinct !DILocation(line: 653, column: 31, scope: !161)
!836 = !DILocation(line: 0, scope: !705, inlinedAt: !837)
!837 = distinct !DILocation(line: 654, column: 31, scope: !161)
!838 = !DILocation(line: 0, scope: !705, inlinedAt: !839)
!839 = distinct !DILocation(line: 655, column: 31, scope: !161)
!840 = !DILocation(line: 0, scope: !705, inlinedAt: !841)
!841 = distinct !DILocation(line: 656, column: 31, scope: !161)
!842 = !DILocation(line: 0, scope: !705, inlinedAt: !843)
!843 = distinct !DILocation(line: 657, column: 31, scope: !161)
!844 = !DILocation(line: 663, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !161, file: !162, line: 663, column: 7)
!846 = !DILocation(line: 664, column: 7, scope: !845)
!847 = !DILocation(line: 664, column: 10, scope: !845)
!848 = !DILocation(line: 663, column: 7, scope: !161)
!849 = !DILocation(line: 669, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !845, file: !162, line: 665, column: 5)
!851 = !DILocation(line: 671, column: 5, scope: !850)
!852 = !DILocation(line: 676, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !845, file: !162, line: 673, column: 5)
!854 = !DILocation(line: 679, column: 3, scope: !161)
!855 = !DILocation(line: 683, column: 3, scope: !161)
!856 = !DILocation(line: 686, column: 3, scope: !161)
!857 = !DILocation(line: 688, column: 3, scope: !161)
!858 = !DILocation(line: 691, column: 3, scope: !161)
!859 = !DILocation(line: 695, column: 3, scope: !161)
!860 = !DILocation(line: 696, column: 1, scope: !161)
!861 = !DISubprogram(name: "setlocale", scope: !862, file: !862, line: 122, type: !863, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!862 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!863 = !DISubroutineType(types: !864)
!864 = !{!52, !55, !60}
!865 = !DISubprogram(name: "getenv", scope: !866, file: !866, line: 641, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!866 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!867 = !DISubroutineType(types: !868)
!868 = !{!52, !60}
!869 = !DISubprogram(name: "fwrite_unlocked", scope: !384, file: !384, line: 704, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !655)
!870 = !DISubroutineType(types: !871)
!871 = !{!57, !872, !57, !57, !752}
!872 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!873 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1789, type: !874, scopeLine: 1790, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !877)
!874 = !DISubroutineType(types: !875)
!875 = !{!55, !55, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!877 = !{!878, !879, !880, !881, !882, !886, !888}
!878 = !DILocalVariable(name: "argc", arg: 1, scope: !873, file: !3, line: 1789, type: !55)
!879 = !DILocalVariable(name: "argv", arg: 2, scope: !873, file: !3, line: 1789, type: !876)
!880 = !DILocalVariable(name: "optchar", scope: !873, file: !3, line: 1791, type: !55)
!881 = !DILocalVariable(name: "file_index", scope: !873, file: !3, line: 1792, type: !55)
!882 = !DILocalVariable(name: "tmp", scope: !883, file: !3, line: 1827, type: !81)
!883 = distinct !DILexicalBlock(scope: !884, file: !3, line: 1826, column: 11)
!884 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1809, column: 9)
!885 = distinct !DILexicalBlock(scope: !873, file: !3, line: 1807, column: 5)
!886 = !DILocalVariable(name: "tmp", scope: !887, file: !3, line: 1855, type: !81)
!887 = distinct !DILexicalBlock(scope: !884, file: !3, line: 1854, column: 11)
!888 = !DILocalVariable(name: "text_buffer", scope: !889, file: !3, line: 2021, type: !148)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 2020, column: 5)
!890 = distinct !DILexicalBlock(scope: !891, file: !3, line: 2019, column: 3)
!891 = distinct !DILexicalBlock(scope: !873, file: !3, line: 2019, column: 3)
!892 = !DILocation(line: 0, scope: !873)
!893 = !DILocation(line: 1797, column: 21, scope: !873)
!894 = !DILocation(line: 1797, column: 3, scope: !873)
!895 = !DILocation(line: 1798, column: 3, scope: !873)
!896 = !DILocation(line: 1799, column: 3, scope: !873)
!897 = !DILocation(line: 1800, column: 3, scope: !873)
!898 = !DILocation(line: 1802, column: 3, scope: !873)
!899 = !DILocation(line: 1804, column: 3, scope: !873)
!900 = !DILocation(line: 1804, column: 20, scope: !873)
!901 = !DILocation(line: 1811, column: 11, scope: !884)
!902 = !DILocation(line: 1814, column: 26, scope: !884)
!903 = !DILocation(line: 1815, column: 11, scope: !884)
!904 = !DILocation(line: 1818, column: 24, scope: !884)
!905 = !DILocation(line: 1818, column: 22, scope: !884)
!906 = !DILocation(line: 1819, column: 11, scope: !884)
!907 = !DILocation(line: 1822, column: 23, scope: !884)
!908 = !DILocation(line: 1823, column: 11, scope: !884)
!909 = !DILocation(line: 1827, column: 13, scope: !883)
!910 = !DILocation(line: 1828, column: 32, scope: !911)
!911 = distinct !DILexicalBlock(scope: !883, file: !3, line: 1828, column: 17)
!912 = !DILocation(line: 0, scope: !883)
!913 = !DILocation(line: 1828, column: 20, scope: !911)
!914 = !DILocation(line: 1828, column: 59, scope: !911)
!915 = !DILocation(line: 1829, column: 20, scope: !911)
!916 = !DILocation(line: 1830, column: 15, scope: !911)
!917 = !DILocation(line: 1832, column: 22, scope: !883)
!918 = !{!919, !919, i64 0}
!919 = !{!"long", !648, i64 0}
!920 = !DILocation(line: 1834, column: 11, scope: !884)
!921 = !DILocation(line: 1837, column: 25, scope: !884)
!922 = !DILocation(line: 1837, column: 23, scope: !884)
!923 = !DILocation(line: 1838, column: 11, scope: !884)
!924 = !DILocation(line: 1841, column: 23, scope: !884)
!925 = !DILocation(line: 1841, column: 21, scope: !884)
!926 = !DILocation(line: 1842, column: 11, scope: !884)
!927 = !DILocation(line: 1845, column: 27, scope: !884)
!928 = !DILocation(line: 1846, column: 11, scope: !884)
!929 = !DILocation(line: 1849, column: 15, scope: !930)
!930 = distinct !DILexicalBlock(scope: !884, file: !3, line: 1849, column: 15)
!931 = !DILocation(line: 1849, column: 26, scope: !930)
!932 = !DILocation(line: 1849, column: 15, scope: !884)
!933 = !DILocation(line: 1850, column: 24, scope: !930)
!934 = !DILocation(line: 1850, column: 13, scope: !930)
!935 = !DILocation(line: 1855, column: 13, scope: !887)
!936 = !DILocation(line: 1856, column: 32, scope: !937)
!937 = distinct !DILexicalBlock(scope: !887, file: !3, line: 1856, column: 17)
!938 = !DILocation(line: 0, scope: !887)
!939 = !DILocation(line: 1856, column: 20, scope: !937)
!940 = !DILocation(line: 1856, column: 59, scope: !937)
!941 = !DILocation(line: 1857, column: 20, scope: !937)
!942 = !DILocation(line: 1858, column: 15, scope: !937)
!943 = !DILocation(line: 1860, column: 24, scope: !887)
!944 = !DILocation(line: 1862, column: 11, scope: !884)
!945 = !DILocation(line: 1865, column: 26, scope: !884)
!946 = !DILocation(line: 1866, column: 11, scope: !884)
!947 = !DILocation(line: 1869, column: 31, scope: !884)
!948 = !DILocation(line: 1869, column: 29, scope: !884)
!949 = !DILocation(line: 1870, column: 11, scope: !884)
!950 = !DILocation(line: 1871, column: 11, scope: !884)
!951 = !DILocation(line: 1874, column: 24, scope: !884)
!952 = !DILocation(line: 1874, column: 22, scope: !884)
!953 = !DILocation(line: 1875, column: 11, scope: !884)
!954 = !DILocation(line: 1878, column: 25, scope: !884)
!955 = !DILocation(line: 1879, column: 11, scope: !884)
!956 = !DILocation(line: 1882, column: 27, scope: !884)
!957 = !DILocation(line: 1883, column: 11, scope: !884)
!958 = !DILocation(line: 1886, column: 34, scope: !884)
!959 = !DILocation(line: 1886, column: 32, scope: !884)
!960 = !{!961, !647, i64 0}
!961 = !{!"regex_data", !647, i64 0, !962, i64 8, !648, i64 72}
!962 = !{!"re_pattern_buffer", !647, i64 0, !919, i64 8, !919, i64 16, !919, i64 24, !647, i64 32, !647, i64 40, !919, i64 48, !756, i64 56, !756, i64 56, !756, i64 56, !756, i64 56, !756, i64 56, !756, i64 56, !756, i64 56}
!963 = !DILocation(line: 1887, column: 11, scope: !884)
!964 = !DILocation(line: 1888, column: 11, scope: !884)
!965 = !DILocation(line: 1891, column: 25, scope: !884)
!966 = !DILocation(line: 1892, column: 11, scope: !884)
!967 = !DILocation(line: 1895, column: 31, scope: !884)
!968 = !DILocation(line: 1895, column: 29, scope: !884)
!969 = !DILocation(line: 1896, column: 11, scope: !884)
!970 = !DILocation(line: 1897, column: 28, scope: !971)
!971 = distinct !DILexicalBlock(scope: !884, file: !3, line: 1897, column: 15)
!972 = !DILocation(line: 1897, column: 16, scope: !971)
!973 = !DILocation(line: 1897, column: 15, scope: !884)
!974 = distinct !{!974, !899, !975, !722}
!975 = !DILocation(line: 1910, column: 5, scope: !873)
!976 = !DILocation(line: 1898, column: 31, scope: !971)
!977 = !DILocation(line: 1898, column: 13, scope: !971)
!978 = !DILocation(line: 1902, column: 27, scope: !884)
!979 = !DILocation(line: 1902, column: 25, scope: !884)
!980 = !DILocation(line: 1904, column: 11, scope: !884)
!981 = !DILocation(line: 1906, column: 9, scope: !884)
!982 = !DILocation(line: 1908, column: 9, scope: !884)
!983 = !DILocation(line: 1912, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !873, file: !3, line: 1912, column: 7)
!985 = !DILocation(line: 1912, column: 18, scope: !984)
!986 = !DILocation(line: 1912, column: 7, scope: !873)
!987 = !DILocation(line: 1913, column: 16, scope: !984)
!988 = !DILocation(line: 1913, column: 5, scope: !984)
!989 = !DILocation(line: 1919, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !873, file: !3, line: 1919, column: 7)
!991 = !DILocation(line: 1919, column: 14, scope: !990)
!992 = !DILocation(line: 1919, column: 7, scope: !873)
!993 = !DILocation(line: 1924, column: 25, scope: !994)
!994 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1920, column: 5)
!995 = !DILocation(line: 1924, column: 23, scope: !994)
!996 = !DILocation(line: 1925, column: 25, scope: !994)
!997 = !DILocation(line: 1925, column: 23, scope: !994)
!998 = !DILocation(line: 1926, column: 25, scope: !994)
!999 = !DILocation(line: 1926, column: 20, scope: !994)
!1000 = !DILocation(line: 1927, column: 26, scope: !994)
!1001 = !DILocation(line: 1928, column: 7, scope: !994)
!1002 = !DILocation(line: 1928, column: 26, scope: !994)
!1003 = !DILocation(line: 1929, column: 5, scope: !994)
!1004 = !DILocation(line: 1930, column: 12, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1930, column: 12)
!1006 = !DILocation(line: 1930, column: 12, scope: !990)
!1007 = !DILocation(line: 1932, column: 33, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1931, column: 5)
!1009 = !DILocation(line: 1932, column: 26, scope: !1008)
!1010 = !DILocation(line: 1933, column: 35, scope: !1008)
!1011 = !DILocation(line: 1933, column: 25, scope: !1008)
!1012 = !DILocation(line: 1933, column: 23, scope: !1008)
!1013 = !DILocation(line: 1934, column: 35, scope: !1008)
!1014 = !DILocation(line: 1934, column: 25, scope: !1008)
!1015 = !DILocation(line: 1934, column: 23, scope: !1008)
!1016 = !DILocation(line: 1935, column: 35, scope: !1008)
!1017 = !DILocation(line: 1935, column: 25, scope: !1008)
!1018 = !DILocation(line: 1935, column: 23, scope: !1008)
!1019 = !DILocation(line: 1937, column: 39, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 1937, column: 7)
!1021 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 1937, column: 7)
!1022 = !DILocation(line: 1937, column: 7, scope: !1021)
!1023 = !DILocation(line: 1939, column: 22, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 1939, column: 15)
!1025 = distinct !DILexicalBlock(scope: !1020, file: !3, line: 1938, column: 9)
!1026 = !DILocation(line: 1939, column: 17, scope: !1024)
!1027 = !DILocation(line: 1939, column: 16, scope: !1024)
!1028 = !DILocation(line: 1939, column: 30, scope: !1024)
!1029 = !DILocation(line: 0, scope: !705, inlinedAt: !1030)
!1030 = distinct !DILocation(line: 1939, column: 33, scope: !1024)
!1031 = !DILocation(line: 1361, column: 11, scope: !705, inlinedAt: !1030)
!1032 = !DILocation(line: 1361, column: 10, scope: !705, inlinedAt: !1030)
!1033 = !DILocation(line: 1939, column: 15, scope: !1025)
!1034 = !DILocation(line: 0, scope: !1024)
!1035 = !DILocation(line: 1943, column: 17, scope: !1025)
!1036 = !DILocation(line: 1937, column: 71, scope: !1020)
!1037 = distinct !{!1037, !1022, !1038, !722}
!1038 = !DILocation(line: 1944, column: 9, scope: !1021)
!1039 = !DILocation(line: 1951, column: 26, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1005, file: !3, line: 1947, column: 5)
!1041 = !DILocation(line: 1952, column: 25, scope: !1040)
!1042 = !DILocation(line: 1952, column: 23, scope: !1040)
!1043 = !DILocation(line: 1953, column: 25, scope: !1040)
!1044 = !DILocation(line: 1953, column: 23, scope: !1040)
!1045 = !DILocation(line: 1954, column: 25, scope: !1040)
!1046 = !DILocation(line: 1954, column: 23, scope: !1040)
!1047 = !DILocation(line: 1955, column: 18, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 1955, column: 11)
!1049 = !DILocation(line: 1955, column: 13, scope: !1048)
!1050 = !DILocation(line: 1955, column: 12, scope: !1048)
!1051 = !DILocation(line: 1955, column: 26, scope: !1048)
!1052 = !DILocation(line: 0, scope: !705, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 1955, column: 29, scope: !1048)
!1054 = !DILocation(line: 1361, column: 11, scope: !705, inlinedAt: !1053)
!1055 = !DILocation(line: 1361, column: 10, scope: !705, inlinedAt: !1053)
!1056 = !DILocation(line: 1955, column: 11, scope: !1040)
!1057 = !DILocation(line: 0, scope: !1048)
!1058 = !DILocation(line: 1959, column: 13, scope: !1040)
!1059 = !DILocation(line: 1963, column: 18, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 1963, column: 11)
!1061 = !DILocation(line: 1963, column: 11, scope: !1040)
!1062 = !DILocation(line: 1965, column: 26, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !3, line: 1965, column: 15)
!1064 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 1964, column: 9)
!1065 = !DILocation(line: 1965, column: 45, scope: !1063)
!1066 = !DILocation(line: 1965, column: 17, scope: !1063)
!1067 = !DILocation(line: 1965, column: 15, scope: !1064)
!1068 = !DILocation(line: 1966, column: 13, scope: !1063)
!1069 = !DILocation(line: 1967, column: 17, scope: !1064)
!1070 = !DILocation(line: 1968, column: 9, scope: !1064)
!1071 = !DILocation(line: 1972, column: 11, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 1972, column: 11)
!1073 = !DILocation(line: 1972, column: 18, scope: !1072)
!1074 = !DILocation(line: 1972, column: 11, scope: !1040)
!1075 = !DILocation(line: 1974, column: 11, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 1973, column: 9)
!1077 = !DILocation(line: 1975, column: 11, scope: !1076)
!1078 = !DILocation(line: 1982, column: 7, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !873, file: !3, line: 1982, column: 7)
!1080 = !DILocation(line: 1982, column: 21, scope: !1079)
!1081 = !DILocation(line: 1982, column: 7, scope: !873)
!1082 = !DILocation(line: 1983, column: 21, scope: !1079)
!1083 = !DILocation(line: 1983, column: 19, scope: !1079)
!1084 = !DILocation(line: 1983, column: 5, scope: !1079)
!1085 = !DILocation(line: 425, column: 7, scope: !1086, inlinedAt: !1106)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 425, column: 7)
!1087 = distinct !DISubprogram(name: "initialize_regex", scope: !3, file: !3, line: 421, type: !363, scopeLine: 422, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1088)
!1088 = !{!1089, !1091, !1094, !1099}
!1089 = !DILocalVariable(name: "character", scope: !1090, file: !3, line: 426, type: !55)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !3, line: 426, column: 5)
!1091 = !DILocalVariable(name: "__res", scope: !1092, file: !3, line: 427, type: !55)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 427, column: 33)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 426, column: 5)
!1094 = !DILocalVariable(name: "__c", scope: !1095, file: !3, line: 427, type: !55)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 427, column: 33)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 427, column: 33)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 427, column: 33)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !3, line: 427, column: 33)
!1099 = !DILocalVariable(name: "character", scope: !1100, file: !3, line: 466, type: !55)
!1100 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 466, column: 11)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 462, column: 9)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !3, line: 461, column: 11)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !3, line: 460, column: 5)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 459, column: 12)
!1105 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 457, column: 7)
!1106 = distinct !DILocation(line: 1987, column: 3, scope: !873)
!1107 = !DILocation(line: 425, column: 7, scope: !1087, inlinedAt: !1106)
!1108 = !DILocation(line: 426, column: 5, scope: !1090, inlinedAt: !1106)
!1109 = !DILocation(line: 0, scope: !1090, inlinedAt: !1106)
!1110 = !DILocation(line: 0, scope: !1092, inlinedAt: !1106)
!1111 = !DILocation(line: 0, scope: !1096, inlinedAt: !1106)
!1112 = !DILocation(line: 427, column: 33, scope: !1093, inlinedAt: !1106)
!1113 = !DILocation(line: 427, column: 7, scope: !1093, inlinedAt: !1106)
!1114 = !DILocation(line: 427, column: 31, scope: !1093, inlinedAt: !1106)
!1115 = !DILocation(line: 426, column: 65, scope: !1093, inlinedAt: !1106)
!1116 = !DILocation(line: 426, column: 39, scope: !1093, inlinedAt: !1106)
!1117 = distinct !{!1117, !1108, !1118, !722}
!1118 = !DILocation(line: 427, column: 33, scope: !1090, inlinedAt: !1106)
!1119 = !DILocation(line: 436, column: 21, scope: !1120, inlinedAt: !1106)
!1120 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 436, column: 7)
!1121 = !DILocation(line: 436, column: 7, scope: !1120, inlinedAt: !1106)
!1122 = !DILocation(line: 436, column: 7, scope: !1087, inlinedAt: !1106)
!1123 = !DILocation(line: 438, column: 12, scope: !1124, inlinedAt: !1106)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !3, line: 438, column: 11)
!1125 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 437, column: 5)
!1126 = !DILocation(line: 438, column: 11, scope: !1125, inlinedAt: !1106)
!1127 = !DILocation(line: 441, column: 12, scope: !1128, inlinedAt: !1106)
!1128 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 441, column: 12)
!1129 = !DILocation(line: 441, column: 27, scope: !1128, inlinedAt: !1106)
!1130 = !DILocation(line: 441, column: 31, scope: !1128, inlinedAt: !1106)
!1131 = !DILocation(line: 441, column: 12, scope: !1120, inlinedAt: !1106)
!1132 = !DILocation(line: 439, column: 30, scope: !1124, inlinedAt: !1106)
!1133 = !DILocation(line: 446, column: 7, scope: !1087, inlinedAt: !1106)
!1134 = !DILocation(line: 0, scope: !1128, inlinedAt: !1106)
!1135 = !DILocation(line: 447, column: 5, scope: !1136, inlinedAt: !1106)
!1136 = distinct !DILexicalBlock(scope: !1087, file: !3, line: 446, column: 7)
!1137 = !DILocation(line: 457, column: 18, scope: !1105, inlinedAt: !1106)
!1138 = !DILocation(line: 457, column: 7, scope: !1105, inlinedAt: !1106)
!1139 = !DILocation(line: 457, column: 7, scope: !1087, inlinedAt: !1106)
!1140 = !DILocation(line: 459, column: 13, scope: !1104, inlinedAt: !1106)
!1141 = !DILocation(line: 459, column: 12, scope: !1105, inlinedAt: !1106)
!1142 = !DILocation(line: 461, column: 11, scope: !1102, inlinedAt: !1106)
!1143 = !DILocation(line: 461, column: 11, scope: !1103, inlinedAt: !1106)
!1144 = !DILocation(line: 0, scope: !1087, inlinedAt: !1106)
!1145 = !DILocation(line: 0, scope: !1100, inlinedAt: !1106)
!1146 = !DILocation(line: 466, column: 11, scope: !1100, inlinedAt: !1106)
!1147 = !DILocation(line: 467, column: 42, scope: !1148, inlinedAt: !1106)
!1148 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 466, column: 11)
!1149 = !DILocation(line: 467, column: 39, scope: !1148, inlinedAt: !1106)
!1150 = !DILocation(line: 467, column: 13, scope: !1148, inlinedAt: !1106)
!1151 = !DILocation(line: 467, column: 37, scope: !1148, inlinedAt: !1106)
!1152 = !DILocation(line: 466, column: 71, scope: !1148, inlinedAt: !1106)
!1153 = !DILocation(line: 466, column: 45, scope: !1148, inlinedAt: !1106)
!1154 = distinct !{!1154, !1146, !1155, !722}
!1155 = !DILocation(line: 467, column: 42, scope: !1100, inlinedAt: !1106)
!1156 = !DILocalVariable(name: "__dest", arg: 1, scope: !1157, file: !1158, line: 57, type: !54)
!1157 = distinct !DISubprogram(name: "memset", scope: !1158, file: !1158, line: 57, type: !1159, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1161)
