; ModuleID = 'src/readlink.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.27 }
%union.anon.27 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { i8*, i64, %union.anon }
%union.anon = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, fp128 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!19 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!20 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!21 = !DIEnumerator(name: "c_quoting_style", value: 5)
!22 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!23 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!24 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!25 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!26 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 46, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "_ISupper", value: 256)
!31 = !DIEnumerator(name: "_ISlower", value: 512)
!32 = !DIEnumerator(name: "_ISalpha", value: 1024)
!33 = !DIEnumerator(name: "_ISdigit", value: 2048)
!34 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!35 = !DIEnumerator(name: "_ISspace", value: 8192)
!36 = !DIEnumerator(name: "_ISprint", value: 16384)
!37 = !DIEnumerator(name: "_ISgraph", value: 32768)
!38 = !DIEnumerator(name: "_ISblank", value: 1)
!39 = !DIEnumerator(name: "_IScntrl", value: 2)
!40 = !DIEnumerator(name: "_ISpunct", value: 4)
!41 = !DIEnumerator(name: "_ISalnum", value: 8)
!42 = !{!43, !45, !46, !47, !48, !51, !53}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55, !58, !60, !0}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "no_newline", scope: !2, file: !3, line: 34, type: !57, isLocal: true, isDefinition: true)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 37, type: !57, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !62, file: !63, line: 575, type: !46, isLocal: true, isDefinition: true)
!62 = distinct !DISubprogram(name: "oputs_", scope: !63, file: !63, line: 573, type: !64, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!63 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !51, !51}
!66 = !{!67, !68, !69, !72, !73, !74, !75, !79, !80, !81, !82, !84, !140, !141, !142, !144, !145}
!67 = !DILocalVariable(name: "program", arg: 1, scope: !62, file: !63, line: 573, type: !51)
!68 = !DILocalVariable(name: "option", arg: 2, scope: !62, file: !63, line: 573, type: !51)
!69 = !DILocalVariable(name: "term", scope: !70, file: !63, line: 585, type: !51)
!70 = distinct !DILexicalBlock(scope: !71, file: !63, line: 582, column: 5)
!71 = distinct !DILexicalBlock(scope: !62, file: !63, line: 581, column: 7)
!72 = !DILocalVariable(name: "double_space", scope: !62, file: !63, line: 594, type: !57)
!73 = !DILocalVariable(name: "first_word", scope: !62, file: !63, line: 595, type: !51)
!74 = !DILocalVariable(name: "option_text", scope: !62, file: !63, line: 596, type: !51)
!75 = !DILocalVariable(name: "s", scope: !76, file: !63, line: 608, type: !51)
!76 = distinct !DILexicalBlock(scope: !77, file: !63, line: 605, column: 5)
!77 = distinct !DILexicalBlock(scope: !78, file: !63, line: 604, column: 12)
!78 = distinct !DILexicalBlock(scope: !62, file: !63, line: 597, column: 7)
!79 = !DILocalVariable(name: "spaces", scope: !76, file: !63, line: 609, type: !48)
!80 = !DILocalVariable(name: "anchor_len", scope: !62, file: !63, line: 620, type: !48)
!81 = !DILocalVariable(name: "desc_text", scope: !62, file: !63, line: 625, type: !51)
!82 = !DILocalVariable(name: "__ptr", scope: !83, file: !63, line: 644, type: !51)
!83 = distinct !DILexicalBlock(scope: !62, file: !63, line: 644, column: 3)
!84 = !DILocalVariable(name: "__stream", scope: !83, file: !63, line: 644, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !88)
!87 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !90)
!89 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !106, !108, !109, !110, !114, !115, !117, !121, !124, !126, !129, !132, !133, !134, !135, !136}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 51, baseType: !46, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 54, baseType: !43, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 55, baseType: !43, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 56, baseType: !43, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 57, baseType: !43, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 58, baseType: !43, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 59, baseType: !43, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 60, baseType: !43, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 61, baseType: !43, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 64, baseType: !43, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 65, baseType: !43, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 66, baseType: !43, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 68, baseType: !104, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 36, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 70, baseType: !107, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 72, baseType: !46, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 73, baseType: !46, size: 32, offset: 928)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 74, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 77, baseType: !47, size: 16, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 78, baseType: !116, size: 8, offset: 1040)
!116 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 79, baseType: !118, size: 8, offset: 1048)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 81, baseType: !122, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 43, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 89, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !112, line: 153, baseType: !113)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !88, file: !89, line: 91, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !89, line: 37, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !88, file: !89, line: 92, baseType: !130, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !89, line: 38, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !88, file: !89, line: 93, baseType: !107, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !88, file: !89, line: 94, baseType: !45, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 95, baseType: !48, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 96, baseType: !46, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocalVariable(name: "__cnt", scope: !83, file: !63, line: 644, type: !48)
!141 = !DILocalVariable(name: "url_program", scope: !62, file: !63, line: 648, type: !51)
!142 = !DILocalVariable(name: "__ptr", scope: !143, file: !63, line: 686, type: !51)
!143 = distinct !DILexicalBlock(scope: !62, file: !63, line: 686, column: 3)
!144 = !DILocalVariable(name: "__stream", scope: !143, file: !63, line: 686, type: !85)
!145 = !DILocalVariable(name: "__cnt", scope: !143, file: !63, line: 686, type: !48)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 2816, elements: !156)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !149, line: 50, size: 256, elements: !150)
!149 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!150 = !{!151, !152, !153, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 52, baseType: !51, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !148, file: !149, line: 55, baseType: !46, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !149, line: 56, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !148, file: !149, line: 57, baseType: !46, size: 32, offset: 192)
!156 = !{!157}
!157 = !DISubrange(count: 11)
!158 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!159 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "Version", scope: !162, file: !163, line: 3, type: !51, isLocal: false, isDefinition: true)
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !164, splitDebugInlining: false, nameTableKind: None)
!163 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!164 = !{!160}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "file_name", scope: !167, file: !168, line: 45, type: !51, isLocal: true, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !169, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!169 = !{!165, !170}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !167, file: !168, line: 55, type: !57, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !174, file: !175, line: 66, type: !210, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !176, globals: !177, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!176 = !{!45, !53}
!177 = !{!178, !204, !172, !206, !208}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "old_file_name", scope: !180, file: !175, line: 304, type: !51, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "verror_at_line", scope: !175, file: !175, line: 298, type: !181, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !197)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !46, !46, !51, !7, !51, !183}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !184, line: 52, baseType: !185)
!184 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !186, line: 32, baseType: !187)
!186 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !188, baseType: !189)
!188 = !DIFile(filename: "lib/error.c", directory: "/src")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !190, size: 256, elements: !191)
!190 = !DINamespace(name: "std", scope: null)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !189, file: !188, baseType: !45, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !189, file: !188, baseType: !45, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !189, file: !188, baseType: !45, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !189, file: !188, baseType: !46, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !189, file: !188, baseType: !46, size: 32, offset: 224)
!197 = !{!198, !199, !200, !201, !202, !203}
!198 = !DILocalVariable(name: "status", arg: 1, scope: !180, file: !175, line: 298, type: !46)
!199 = !DILocalVariable(name: "errnum", arg: 2, scope: !180, file: !175, line: 298, type: !46)
!200 = !DILocalVariable(name: "file_name", arg: 3, scope: !180, file: !175, line: 298, type: !51)
!201 = !DILocalVariable(name: "line_number", arg: 4, scope: !180, file: !175, line: 298, type: !7)
!202 = !DILocalVariable(name: "message", arg: 5, scope: !180, file: !175, line: 298, type: !51)
!203 = !DILocalVariable(name: "args", arg: 6, scope: !180, file: !175, line: 298, type: !183)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "old_line_number", scope: !180, file: !175, line: 305, type: !7, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "error_message_count", scope: !174, file: !175, line: 69, type: !7, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !174, file: !175, line: 295, type: !46, isLocal: false, isDefinition: true)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "default_tuning", scope: !215, file: !216, line: 134, type: !220, isLocal: true, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !217, globals: !219, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!217 = !{!50, !45, !218, !48}
!218 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!219 = !{!213}
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !222, line: 52, baseType: !223)
!222 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !222, line: 40, size: 160, elements: !224)
!224 = !{!225, !226, !227, !228, !229}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !223, file: !222, line: 45, baseType: !218, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !223, file: !222, line: 46, baseType: !218, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !223, file: !222, line: 47, baseType: !218, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !223, file: !222, line: 48, baseType: !218, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !223, file: !222, line: 49, baseType: !57, size: 8, offset: 128)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "program_name", scope: !232, file: !233, line: 31, type: !51, isLocal: false, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !234, globals: !235, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!234 = !{!43}
!235 = !{!230}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "utf07FF", scope: !238, file: !239, line: 46, type: !269, isLocal: true, isDefinition: true)
!238 = distinct !DISubprogram(name: "proper_name_lite", scope: !239, file: !239, line: 38, type: !240, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !242, retainedNodes: !244)
!239 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!240 = !DISubroutineType(types: !241)
!241 = !{!51, !51, !51}
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !243, splitDebugInlining: false, nameTableKind: None)
!243 = !{!236}
!244 = !{!245, !246, !247, !248, !253}
!245 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !238, file: !239, line: 38, type: !51)
!246 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !238, file: !239, line: 38, type: !51)
!247 = !DILocalVariable(name: "translation", scope: !238, file: !239, line: 40, type: !51)
!248 = !DILocalVariable(name: "w", scope: !238, file: !239, line: 47, type: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !250, line: 37, baseType: !251)
!250 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !112, line: 57, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !112, line: 42, baseType: !7)
!253 = !DILocalVariable(name: "mbs", scope: !238, file: !239, line: 48, type: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !255, line: 6, baseType: !256)
!255 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !257, line: 21, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 13, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !258, file: !257, line: 15, baseType: !46, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !258, file: !257, line: 20, baseType: !262, size: 32, offset: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !258, file: !257, line: 16, size: 32, elements: !263)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !262, file: !257, line: 18, baseType: !7, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !262, file: !257, line: 19, baseType: !266, size: 32)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 2)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !274, file: !275, line: 76, type: !343, isLocal: false, isDefinition: true)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !276, retainedTypes: !282, globals: !283, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!276 = !{!13, !277, !27}
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 254, baseType: !7, size: 32, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!280 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!281 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!282 = !{!46, !47, !48}
!283 = !{!272, !284, !290, !302, !304, !309, !332, !339, !341}
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !274, file: !275, line: 92, type: !286, isLocal: false, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 320, elements: !288)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!288 = !{!289}
!289 = !DISubrange(count: 10)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !274, file: !275, line: 1040, type: !292, isLocal: false, isDefinition: true)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !275, line: 56, size: 448, elements: !293)
!293 = !{!294, !295, !296, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !292, file: !275, line: 59, baseType: !13, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !275, line: 62, baseType: !46, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !292, file: !275, line: 66, baseType: !297, size: 256, offset: 64)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 8)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !292, file: !275, line: 69, baseType: !51, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !292, file: !275, line: 72, baseType: !51, size: 64, offset: 384)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !274, file: !275, line: 107, type: !292, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "slot0", scope: !274, file: !275, line: 831, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 256)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "quote", scope: !311, file: !275, line: 228, type: !330, isLocal: true, isDefinition: true)
!311 = distinct !DISubprogram(name: "gettext_quote", scope: !275, file: !275, line: 197, type: !312, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !274, retainedNodes: !314)
!312 = !DISubroutineType(types: !313)
!313 = !{!51, !51, !13}
!314 = !{!315, !316, !317, !318, !319}
!315 = !DILocalVariable(name: "msgid", arg: 1, scope: !311, file: !275, line: 197, type: !51)
!316 = !DILocalVariable(name: "s", arg: 2, scope: !311, file: !275, line: 197, type: !13)
!317 = !DILocalVariable(name: "translation", scope: !311, file: !275, line: 199, type: !51)
!318 = !DILocalVariable(name: "w", scope: !311, file: !275, line: 229, type: !249)
!319 = !DILocalVariable(name: "mbs", scope: !311, file: !275, line: 230, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !255, line: 6, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !257, line: 21, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 13, size: 64, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !322, file: !257, line: 15, baseType: !46, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !322, file: !257, line: 20, baseType: !326, size: 32, offset: 32)
!326 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !322, file: !257, line: 16, size: 32, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !326, file: !257, line: 18, baseType: !7, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !326, file: !257, line: 19, baseType: !266, size: 32)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !331)
!331 = !{!271, !268}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "slotvec", scope: !274, file: !275, line: 834, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !275, line: 823, size: 128, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !275, line: 825, baseType: !48, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !335, file: !275, line: 826, baseType: !43, size: 64, offset: 64)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "nslots", scope: !274, file: !275, line: 832, type: !46, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "slotvec0", scope: !274, file: !275, line: 833, type: !335, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 704, elements: !156)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !347, file: !348, line: 26, type: !350, isLocal: false, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !349, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!349 = !{!345}
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 47)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "exit_failure", scope: !355, file: !356, line: 24, type: !358, isLocal: false, isDefinition: true)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !357, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!357 = !{!353}
!358 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "internal_state", scope: !361, file: !362, line: 97, type: !365, isLocal: true, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, globals: !364, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!363 = !{!45, !48, !53}
!364 = !{!359}
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !255, line: 6, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !257, line: 21, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !257, line: 13, size: 64, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !367, file: !257, line: 15, baseType: !46, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !367, file: !257, line: 20, baseType: !371, size: 32, offset: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !367, file: !257, line: 16, size: 32, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !371, file: !257, line: 18, baseType: !7, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !371, file: !257, line: 19, baseType: !266, size: 32)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aaac2d7e2e4691c3c7dfceec011d70d1")
!377 = !{!378}
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !379, file: !376, line: 60, baseType: !7, size: 32, elements: !407)
!379 = distinct !DISubprogram(name: "areadlink_with_size", scope: !376, file: !376, line: 49, type: !380, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{!43, !51, !48}
!382 = !{!383, !384, !385, !386, !387, !388, !389, !394, !395, !396, !400, !401}
!383 = !DILocalVariable(name: "file", arg: 1, scope: !379, file: !376, line: 49, type: !51)
!384 = !DILocalVariable(name: "size", arg: 2, scope: !379, file: !376, line: 49, type: !48)
!385 = !DILocalVariable(name: "symlink_max", scope: !379, file: !376, line: 54, type: !48)
!386 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !379, file: !376, line: 55, type: !48)
!387 = !DILocalVariable(name: "initial_limit", scope: !379, file: !376, line: 56, type: !48)
!388 = !DILocalVariable(name: "buf_size", scope: !379, file: !376, line: 63, type: !48)
!389 = !DILocalVariable(name: "stackbuf", scope: !390, file: !376, line: 68, type: !391)
!390 = distinct !DILexicalBlock(scope: !379, file: !376, line: 67, column: 5)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 1024, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 128)
!394 = !DILocalVariable(name: "buf", scope: !390, file: !376, line: 69, type: !43)
!395 = !DILocalVariable(name: "buffer", scope: !390, file: !376, line: 70, type: !43)
!396 = !DILocalVariable(name: "r", scope: !390, file: !376, line: 82, type: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !398, line: 108, baseType: !399)
!398 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !112, line: 194, baseType: !113)
!400 = !DILocalVariable(name: "link_length", scope: !390, file: !376, line: 89, type: !48)
!401 = !DILocalVariable(name: "shrinked_buffer", scope: !402, file: !376, line: 102, type: !43)
!402 = distinct !DILexicalBlock(scope: !403, file: !376, line: 100, column: 13)
!403 = distinct !DILexicalBlock(scope: !404, file: !376, line: 99, column: 20)
!404 = distinct !DILexicalBlock(scope: !405, file: !376, line: 93, column: 15)
!405 = distinct !DILexicalBlock(scope: !406, file: !376, line: 91, column: 9)
!406 = distinct !DILexicalBlock(scope: !390, file: !376, line: 90, column: 11)
!407 = !{!408}
!408 = !DIEnumerator(name: "stackbuf_size", value: 128)
!409 = !{!45}
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !412, retainedTypes: !409, globals: !413, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!412 = !{!5}
!413 = !{!414}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !410, file: !411, line: 110, type: !269, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !418, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!418 = !{!45, !43}
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!435 = !{!436}
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !434, line: 40, baseType: !7, size: 32, elements: !437)
!437 = !{!438}
!438 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !441, retainedTypes: !472, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!441 = !{!442, !454}
!442 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !443, file: !440, line: 188, baseType: !7, size: 32, elements: !452)
!443 = distinct !DISubprogram(name: "x2nrealloc", scope: !440, file: !440, line: 176, type: !444, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !439, retainedNodes: !447)
!444 = !DISubroutineType(types: !445)
!445 = !{!45, !45, !446, !48}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!447 = !{!448, !449, !450, !451}
!448 = !DILocalVariable(name: "p", arg: 1, scope: !443, file: !440, line: 176, type: !45)
!449 = !DILocalVariable(name: "pn", arg: 2, scope: !443, file: !440, line: 176, type: !446)
!450 = !DILocalVariable(name: "s", arg: 3, scope: !443, file: !440, line: 176, type: !48)
!451 = !DILocalVariable(name: "n", scope: !443, file: !440, line: 178, type: !48)
!452 = !{!453}
!453 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !455, file: !440, line: 228, baseType: !7, size: 32, elements: !452)
!455 = distinct !DISubprogram(name: "xpalloc", scope: !440, file: !440, line: 223, type: !456, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !439, retainedNodes: !462)
!456 = !DISubroutineType(types: !457)
!457 = !{!45, !45, !458, !459, !461, !459}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !460, line: 130, baseType: !461)
!460 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !49, line: 35, baseType: !113)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DILocalVariable(name: "pa", arg: 1, scope: !455, file: !440, line: 223, type: !45)
!464 = !DILocalVariable(name: "pn", arg: 2, scope: !455, file: !440, line: 223, type: !458)
!465 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !455, file: !440, line: 223, type: !459)
!466 = !DILocalVariable(name: "n_max", arg: 4, scope: !455, file: !440, line: 223, type: !461)
!467 = !DILocalVariable(name: "s", arg: 5, scope: !455, file: !440, line: 223, type: !459)
!468 = !DILocalVariable(name: "n0", scope: !455, file: !440, line: 230, type: !459)
!469 = !DILocalVariable(name: "n", scope: !455, file: !440, line: 237, type: !459)
!470 = !DILocalVariable(name: "nbytes", scope: !455, file: !440, line: 248, type: !459)
!471 = !DILocalVariable(name: "adjusted_nbytes", scope: !455, file: !440, line: 252, type: !459)
!472 = !{!43, !45, !57, !113, !50}
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!475 = distinct !DICompileUnit(language: DW_LANG_C99, file: !476, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!476 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!477 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!478 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !484, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !485, splitDebugInlining: false, nameTableKind: None)
!484 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!485 = !{!57, !50, !45}
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!492 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!493 = !{i32 7, !"Dwarf Version", i32 5}
!494 = !{i32 2, !"Debug Info Version", i32 3}
!495 = !{i32 1, !"wchar_size", i32 4}
!496 = !{i32 1, !"branch-target-enforcement", i32 0}
!497 = !{i32 1, !"sign-return-address", i32 0}
!498 = !{i32 1, !"sign-return-address-all", i32 0}
!499 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!500 = !{i32 7, !"PIC Level", i32 2}
!501 = !{i32 7, !"PIE Level", i32 2}
!502 = !{i32 7, !"uwtable", i32 1}
!503 = !{i32 7, !"frame-pointer", i32 1}
!504 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 55, type: !505, scopeLine: 56, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !46}
!507 = !{!508}
!508 = !DILocalVariable(name: "status", arg: 1, scope: !504, file: !3, line: 55, type: !46)
!509 = !DILocation(line: 0, scope: !504)
!510 = !DILocation(line: 57, column: 14, scope: !511)
!511 = distinct !DILexicalBlock(scope: !504, file: !3, line: 57, column: 7)
!512 = !DILocation(line: 57, column: 7, scope: !504)
!513 = !DILocation(line: 58, column: 5, scope: !514)
!514 = distinct !DILexicalBlock(scope: !511, file: !3, line: 58, column: 5)
!515 = !{!516, !516, i64 0}
!516 = !{!"any pointer", !517, i64 0}
!517 = !{!"omnipotent char", !518, i64 0}
!518 = !{!"Simple C/C++ TBAA"}
!519 = !DILocation(line: 61, column: 7, scope: !520)
!520 = distinct !DILexicalBlock(scope: !511, file: !3, line: 60, column: 5)
!521 = !DILocation(line: 62, column: 7, scope: !520)
!522 = !DILocation(line: 64, column: 7, scope: !520)
!523 = !DILocation(line: 70, column: 7, scope: !520)
!524 = !DILocation(line: 76, column: 7, scope: !520)
!525 = !DILocation(line: 82, column: 7, scope: !520)
!526 = !DILocation(line: 86, column: 7, scope: !520)
!527 = !DILocation(line: 89, column: 7, scope: !520)
!528 = !DILocation(line: 94, column: 7, scope: !520)
!529 = !DILocation(line: 99, column: 7, scope: !520)
!530 = !DILocation(line: 103, column: 7, scope: !520)
!531 = !DILocation(line: 104, column: 7, scope: !520)
!532 = !DILocalVariable(name: "program", arg: 1, scope: !533, file: !63, line: 836, type: !51)
!533 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !63, file: !63, line: 836, type: !534, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !51}
!536 = !{!532, !537, !546, !547, !549, !550}
!537 = !DILocalVariable(name: "infomap", scope: !533, file: !63, line: 838, type: !538)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 896, elements: !544)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !533, file: !63, line: 838, size: 128, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !540, file: !63, line: 838, baseType: !51, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !540, file: !63, line: 838, baseType: !51, size: 64, offset: 64)
!544 = !{!545}
!545 = !DISubrange(count: 7)
!546 = !DILocalVariable(name: "node", scope: !533, file: !63, line: 848, type: !51)
!547 = !DILocalVariable(name: "map_prog", scope: !533, file: !63, line: 849, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!549 = !DILocalVariable(name: "lc_messages", scope: !533, file: !63, line: 861, type: !51)
!550 = !DILocalVariable(name: "url_program", scope: !533, file: !63, line: 874, type: !51)
!551 = !DILocation(line: 0, scope: !533, inlinedAt: !552)
!552 = distinct !DILocation(line: 105, column: 7, scope: !520)
!553 = !DILocation(line: 838, column: 3, scope: !533, inlinedAt: !552)
!554 = !DILocation(line: 838, column: 67, scope: !533, inlinedAt: !552)
!555 = !DILocation(line: 849, column: 36, scope: !533, inlinedAt: !552)
!556 = !DILocation(line: 851, column: 3, scope: !533, inlinedAt: !552)
!557 = !DILocalVariable(name: "__s1", arg: 1, scope: !558, file: !559, line: 1359, type: !51)
!558 = distinct !DISubprogram(name: "streq", scope: !559, file: !559, line: 1359, type: !560, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !562)
!559 = !DIFile(filename: "./lib/string.h", directory: "/src")
!560 = !DISubroutineType(types: !561)
!561 = !{!57, !51, !51}
!562 = !{!557, !563}
!563 = !DILocalVariable(name: "__s2", arg: 2, scope: !558, file: !559, line: 1359, type: !51)
!564 = !DILocation(line: 0, scope: !558, inlinedAt: !565)
!565 = distinct !DILocation(line: 851, column: 33, scope: !533, inlinedAt: !552)
!566 = !DILocation(line: 1361, column: 11, scope: !558, inlinedAt: !565)
!567 = !DILocation(line: 1361, column: 10, scope: !558, inlinedAt: !565)
!568 = !DILocation(line: 852, column: 13, scope: !533, inlinedAt: !552)
!569 = !DILocation(line: 851, column: 20, scope: !533, inlinedAt: !552)
!570 = !{!571, !516, i64 0}
!571 = !{!"infomap", !516, i64 0, !516, i64 8}
!572 = !DILocation(line: 851, column: 10, scope: !533, inlinedAt: !552)
!573 = !DILocation(line: 851, column: 28, scope: !533, inlinedAt: !552)
!574 = distinct !{!574, !556, !568, !575}
!575 = !{!"llvm.loop.mustprogress"}
!576 = !DILocation(line: 854, column: 17, scope: !577, inlinedAt: !552)
!577 = distinct !DILexicalBlock(scope: !533, file: !63, line: 854, column: 7)
!578 = !{!571, !516, i64 8}
!579 = !DILocation(line: 854, column: 7, scope: !577, inlinedAt: !552)
!580 = !DILocation(line: 854, column: 7, scope: !533, inlinedAt: !552)
!581 = !DILocation(line: 857, column: 3, scope: !533, inlinedAt: !552)
!582 = !DILocation(line: 861, column: 29, scope: !533, inlinedAt: !552)
!583 = !DILocation(line: 862, column: 7, scope: !584, inlinedAt: !552)
!584 = distinct !DILexicalBlock(scope: !533, file: !63, line: 862, column: 7)
!585 = !DILocation(line: 862, column: 19, scope: !584, inlinedAt: !552)
!586 = !DILocation(line: 862, column: 22, scope: !584, inlinedAt: !552)
!587 = !DILocation(line: 862, column: 7, scope: !533, inlinedAt: !552)
!588 = !DILocation(line: 868, column: 7, scope: !589, inlinedAt: !552)
!589 = distinct !DILexicalBlock(scope: !584, file: !63, line: 863, column: 5)
!590 = !DILocation(line: 870, column: 5, scope: !589, inlinedAt: !552)
!591 = !DILocation(line: 0, scope: !558, inlinedAt: !592)
!592 = distinct !DILocation(line: 874, column: 29, scope: !533, inlinedAt: !552)
!593 = !DILocation(line: 875, column: 3, scope: !533, inlinedAt: !552)
!594 = !DILocation(line: 877, column: 3, scope: !533, inlinedAt: !552)
!595 = !DILocation(line: 879, column: 1, scope: !533, inlinedAt: !552)
!596 = !DILocation(line: 107, column: 3, scope: !504)
!597 = !DISubprogram(name: "dcgettext", scope: !598, file: !598, line: 51, type: !599, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!598 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!599 = !DISubroutineType(types: !600)
!600 = !{!43, !51, !51, !46}
!601 = !{}
!602 = !DISubprogram(name: "fputs_unlocked", scope: !184, file: !184, line: 691, type: !603, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!603 = !DISubroutineType(types: !604)
!604 = !{!46, !605, !606}
!605 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!606 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!607 = !DILocation(line: 0, scope: !62)
!608 = !DILocation(line: 581, column: 7, scope: !71)
!609 = !{!610, !610, i64 0}
!610 = !{!"int", !517, i64 0}
!611 = !DILocation(line: 581, column: 19, scope: !71)
!612 = !DILocation(line: 581, column: 7, scope: !62)
!613 = !DILocation(line: 585, column: 26, scope: !70)
!614 = !DILocation(line: 0, scope: !70)
!615 = !DILocation(line: 586, column: 23, scope: !70)
!616 = !DILocation(line: 586, column: 28, scope: !70)
!617 = !DILocation(line: 586, column: 32, scope: !70)
!618 = !{!517, !517, i64 0}
!619 = !DILocation(line: 586, column: 38, scope: !70)
!620 = !DILocation(line: 0, scope: !558, inlinedAt: !621)
!621 = distinct !DILocation(line: 586, column: 41, scope: !70)
!622 = !DILocation(line: 1361, column: 11, scope: !558, inlinedAt: !621)
!623 = !DILocation(line: 1361, column: 10, scope: !558, inlinedAt: !621)
!624 = !DILocation(line: 586, column: 19, scope: !70)
!625 = !DILocation(line: 587, column: 5, scope: !70)
!626 = !DILocation(line: 588, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !62, file: !63, line: 588, column: 7)
!628 = !DILocation(line: 588, column: 7, scope: !62)
!629 = !DILocation(line: 590, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !627, file: !63, line: 589, column: 5)
!631 = !DILocation(line: 591, column: 7, scope: !630)
!632 = !DILocation(line: 595, column: 37, scope: !62)
!633 = !DILocation(line: 595, column: 35, scope: !62)
!634 = !DILocation(line: 596, column: 29, scope: !62)
!635 = !DILocation(line: 597, column: 8, scope: !78)
!636 = !DILocation(line: 597, column: 7, scope: !62)
!637 = !DILocation(line: 604, column: 24, scope: !77)
!638 = !DILocation(line: 604, column: 12, scope: !78)
!639 = !DILocation(line: 0, scope: !76)
!640 = !DILocation(line: 610, column: 16, scope: !76)
!641 = !DILocation(line: 610, column: 7, scope: !76)
!642 = !DILocation(line: 611, column: 21, scope: !76)
!643 = !{!644, !644, i64 0}
!644 = !{!"short", !517, i64 0}
!645 = !DILocation(line: 611, column: 19, scope: !76)
!646 = !DILocation(line: 611, column: 16, scope: !76)
!647 = !DILocation(line: 610, column: 30, scope: !76)
!648 = distinct !{!648, !641, !642, !575}
!649 = !DILocation(line: 612, column: 18, scope: !650)
!650 = distinct !DILexicalBlock(scope: !76, file: !63, line: 612, column: 11)
!651 = !DILocation(line: 612, column: 11, scope: !76)
!652 = !DILocation(line: 620, column: 23, scope: !62)
!653 = !DILocation(line: 625, column: 39, scope: !62)
!654 = !DILocation(line: 626, column: 3, scope: !62)
!655 = !DILocation(line: 626, column: 10, scope: !62)
!656 = !DILocation(line: 626, column: 21, scope: !62)
!657 = !DILocation(line: 628, column: 44, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !63, line: 628, column: 11)
!659 = distinct !DILexicalBlock(scope: !62, file: !63, line: 627, column: 5)
!660 = !DILocation(line: 628, column: 32, scope: !658)
!661 = !DILocation(line: 628, column: 49, scope: !658)
!662 = !DILocation(line: 628, column: 11, scope: !659)
!663 = !DILocation(line: 630, column: 11, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !63, line: 630, column: 11)
!665 = !DILocation(line: 630, column: 11, scope: !659)
!666 = !DILocation(line: 632, column: 26, scope: !667)
!667 = distinct !DILexicalBlock(scope: !668, file: !63, line: 632, column: 15)
!668 = distinct !DILexicalBlock(scope: !664, file: !63, line: 631, column: 9)
!669 = !DILocation(line: 632, column: 34, scope: !667)
!670 = !DILocation(line: 632, column: 37, scope: !667)
!671 = !DILocation(line: 632, column: 15, scope: !668)
!672 = !DILocation(line: 636, column: 29, scope: !673)
!673 = distinct !DILexicalBlock(scope: !668, file: !63, line: 636, column: 15)
!674 = !DILocation(line: 640, column: 16, scope: !659)
!675 = distinct !{!675, !654, !676, !575}
!676 = !DILocation(line: 641, column: 5, scope: !62)
!677 = !DILocation(line: 644, column: 3, scope: !62)
!678 = !DILocation(line: 0, scope: !558, inlinedAt: !679)
!679 = distinct !DILocation(line: 648, column: 31, scope: !62)
!680 = !DILocation(line: 0, scope: !558, inlinedAt: !681)
!681 = distinct !DILocation(line: 649, column: 31, scope: !62)
!682 = !DILocation(line: 0, scope: !558, inlinedAt: !683)
!683 = distinct !DILocation(line: 650, column: 31, scope: !62)
!684 = !DILocation(line: 0, scope: !558, inlinedAt: !685)
!685 = distinct !DILocation(line: 651, column: 31, scope: !62)
!686 = !DILocation(line: 0, scope: !558, inlinedAt: !687)
!687 = distinct !DILocation(line: 652, column: 31, scope: !62)
!688 = !DILocation(line: 0, scope: !558, inlinedAt: !689)
!689 = distinct !DILocation(line: 653, column: 31, scope: !62)
!690 = !DILocation(line: 0, scope: !558, inlinedAt: !691)
!691 = distinct !DILocation(line: 654, column: 31, scope: !62)
!692 = !DILocation(line: 0, scope: !558, inlinedAt: !693)
!693 = distinct !DILocation(line: 655, column: 31, scope: !62)
!694 = !DILocation(line: 0, scope: !558, inlinedAt: !695)
!695 = distinct !DILocation(line: 656, column: 31, scope: !62)
!696 = !DILocation(line: 0, scope: !558, inlinedAt: !697)
!697 = distinct !DILocation(line: 657, column: 31, scope: !62)
!698 = !DILocation(line: 663, column: 7, scope: !699)
!699 = distinct !DILexicalBlock(scope: !62, file: !63, line: 663, column: 7)
!700 = !DILocation(line: 664, column: 7, scope: !699)
!701 = !DILocation(line: 664, column: 10, scope: !699)
!702 = !DILocation(line: 663, column: 7, scope: !62)
!703 = !DILocation(line: 669, column: 7, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !63, line: 665, column: 5)
!705 = !DILocation(line: 671, column: 5, scope: !704)
!706 = !DILocation(line: 676, column: 7, scope: !707)
!707 = distinct !DILexicalBlock(scope: !699, file: !63, line: 673, column: 5)
!708 = !DILocation(line: 679, column: 3, scope: !62)
!709 = !DILocation(line: 683, column: 3, scope: !62)
!710 = !DILocation(line: 686, column: 3, scope: !62)
!711 = !DILocation(line: 688, column: 3, scope: !62)
!712 = !DILocation(line: 691, column: 3, scope: !62)
!713 = !DILocation(line: 695, column: 3, scope: !62)
!714 = !DILocation(line: 696, column: 1, scope: !62)
!715 = !DISubprogram(name: "setlocale", scope: !716, file: !716, line: 122, type: !717, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!716 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!717 = !DISubroutineType(types: !718)
!718 = !{!43, !46, !51}
!719 = !DISubprogram(name: "getenv", scope: !720, file: !720, line: 641, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!720 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!721 = !DISubroutineType(types: !722)
!722 = !{!43, !51}
!723 = !DISubprogram(name: "fwrite_unlocked", scope: !184, file: !184, line: 704, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!724 = !DISubroutineType(types: !725)
!725 = !{!48, !726, !48, !48, !606}
!726 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!729 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 111, type: !730, scopeLine: 112, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !733)
!730 = !DISubroutineType(types: !731)
!731 = !{!46, !46, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !744}
!734 = !DILocalVariable(name: "argc", arg: 1, scope: !729, file: !3, line: 111, type: !46)
!735 = !DILocalVariable(name: "argv", arg: 2, scope: !729, file: !3, line: 111, type: !732)
!736 = !DILocalVariable(name: "can_mode", scope: !729, file: !3, line: 114, type: !46)
!737 = !DILocalVariable(name: "status", scope: !729, file: !3, line: 115, type: !46)
!738 = !DILocalVariable(name: "optc", scope: !729, file: !3, line: 116, type: !46)
!739 = !DILocalVariable(name: "use_nuls", scope: !729, file: !3, line: 117, type: !57)
!740 = !DILocalVariable(name: "fname", scope: !741, file: !3, line: 180, type: !51)
!741 = distinct !DILexicalBlock(scope: !742, file: !3, line: 179, column: 5)
!742 = distinct !DILexicalBlock(scope: !743, file: !3, line: 178, column: 3)
!743 = distinct !DILexicalBlock(scope: !729, file: !3, line: 178, column: 3)
!744 = !DILocalVariable(name: "value", scope: !741, file: !3, line: 181, type: !43)
!745 = !DILocation(line: 0, scope: !729)
!746 = !DILocation(line: 120, column: 21, scope: !729)
!747 = !DILocation(line: 120, column: 3, scope: !729)
!748 = !DILocation(line: 121, column: 3, scope: !729)
!749 = !DILocation(line: 122, column: 3, scope: !729)
!750 = !DILocation(line: 123, column: 3, scope: !729)
!751 = !DILocation(line: 125, column: 3, scope: !729)
!752 = !DILocation(line: 127, column: 3, scope: !729)
!753 = !DILocation(line: 127, column: 18, scope: !729)
!754 = distinct !{!754, !752, !755, !575}
!755 = !DILocation(line: 158, column: 5, scope: !729)
!756 = !DILocation(line: 136, column: 11, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !3, line: 130, column: 9)
!758 = distinct !DILexicalBlock(scope: !729, file: !3, line: 128, column: 5)
!759 = !DILocation(line: 139, column: 11, scope: !757)
!760 = !DILocation(line: 141, column: 22, scope: !757)
!761 = !DILocation(line: 142, column: 11, scope: !757)
!762 = !DILocation(line: 145, column: 19, scope: !757)
!763 = !DILocation(line: 146, column: 11, scope: !757)
!764 = !DILocation(line: 148, column: 19, scope: !757)
!765 = !DILocation(line: 149, column: 11, scope: !757)
!766 = !DILocation(line: 153, column: 9, scope: !757)
!767 = !DILocation(line: 154, column: 9, scope: !757)
!768 = !DILocation(line: 156, column: 11, scope: !757)
!769 = !DILocation(line: 160, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !729, file: !3, line: 160, column: 7)
!771 = !DILocation(line: 160, column: 14, scope: !770)
!772 = !DILocation(line: 160, column: 7, scope: !729)
!773 = !DILocation(line: 162, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !3, line: 161, column: 5)
!775 = !DILocation(line: 163, column: 7, scope: !774)
!776 = !DILocation(line: 166, column: 12, scope: !777)
!777 = distinct !DILexicalBlock(scope: !729, file: !3, line: 166, column: 7)
!778 = !DILocation(line: 166, column: 21, scope: !777)
!779 = !DILocation(line: 166, column: 7, scope: !729)
!780 = !DILocation(line: 168, column: 11, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 168, column: 11)
!782 = distinct !DILexicalBlock(scope: !777, file: !3, line: 167, column: 5)
!783 = !DILocation(line: 168, column: 11, scope: !782)
!784 = !DILocation(line: 169, column: 9, scope: !781)
!785 = !DILocation(line: 170, column: 18, scope: !782)
!786 = !DILocation(line: 171, column: 5, scope: !782)
!787 = !DILocation(line: 175, column: 7, scope: !788)
!788 = distinct !DILexicalBlock(scope: !729, file: !3, line: 175, column: 7)
!789 = !DILocation(line: 175, column: 34, scope: !788)
!790 = !DILocation(line: 175, column: 7, scope: !729)
!791 = !DILocation(line: 176, column: 13, scope: !788)
!792 = !DILocation(line: 176, column: 5, scope: !788)
!793 = !DILocation(line: 178, column: 10, scope: !742)
!794 = !DILocation(line: 178, column: 17, scope: !742)
!795 = !DILocation(line: 178, column: 3, scope: !743)
!796 = !DILocation(line: 180, column: 27, scope: !741)
!797 = !DILocation(line: 0, scope: !741)
!798 = !DILocation(line: 181, column: 22, scope: !741)
!799 = !DILocation(line: 182, column: 24, scope: !741)
!800 = !DILocation(line: 183, column: 24, scope: !741)
!801 = !DILocation(line: 184, column: 11, scope: !802)
!802 = distinct !DILexicalBlock(scope: !741, file: !3, line: 184, column: 11)
!803 = !DILocation(line: 184, column: 11, scope: !741)
!804 = !DILocation(line: 186, column: 11, scope: !805)
!805 = distinct !DILexicalBlock(scope: !802, file: !3, line: 185, column: 9)
!806 = !DILocation(line: 187, column: 17, scope: !807)
!807 = distinct !DILexicalBlock(scope: !805, file: !3, line: 187, column: 15)
!808 = !DILocation(line: 187, column: 15, scope: !805)
!809 = !DILocalVariable(name: "__c", arg: 1, scope: !810, file: !811, line: 108, type: !46)
!810 = distinct !DISubprogram(name: "putchar_unlocked", scope: !811, file: !811, line: 108, type: !812, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !814)
!811 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!812 = !DISubroutineType(types: !813)
!813 = !{!46, !46}
!814 = !{!809}
!815 = !DILocation(line: 0, scope: !810, inlinedAt: !816)
!816 = distinct !DILocation(line: 188, column: 13, scope: !807)
!817 = !DILocation(line: 110, column: 10, scope: !810, inlinedAt: !816)
!818 = !{!819, !516, i64 40}
!819 = !{!"_IO_FILE", !610, i64 0, !516, i64 8, !516, i64 16, !516, i64 24, !516, i64 32, !516, i64 40, !516, i64 48, !516, i64 56, !516, i64 64, !516, i64 72, !516, i64 80, !516, i64 88, !516, i64 96, !516, i64 104, !610, i64 112, !610, i64 116, !820, i64 120, !644, i64 128, !517, i64 130, !517, i64 131, !516, i64 136, !820, i64 144, !516, i64 152, !516, i64 160, !516, i64 168, !516, i64 176, !820, i64 184, !610, i64 192, !517, i64 196}
!820 = !{!"long", !517, i64 0}
!821 = !{!819, !516, i64 48}
!822 = !{!"branch_weights", i32 2000, i32 1}
!823 = !DILocation(line: 189, column: 11, scope: !805)
!824 = !DILocation(line: 190, column: 15, scope: !825)
!825 = distinct !DILexicalBlock(scope: !805, file: !3, line: 190, column: 15)
!826 = !DILocalVariable(name: "__stream", arg: 1, scope: !827, file: !811, line: 135, type: !85)
!827 = distinct !DISubprogram(name: "ferror_unlocked", scope: !811, file: !811, line: 135, type: !828, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !830)
!828 = !DISubroutineType(types: !829)
!829 = !{!46, !85}
!830 = !{!826}
!831 = !DILocation(line: 0, scope: !827, inlinedAt: !832)
!832 = distinct !DILocation(line: 190, column: 15, scope: !825)
!833 = !DILocation(line: 137, column: 10, scope: !827, inlinedAt: !832)
!834 = !{!819, !610, i64 0}
!835 = !DILocation(line: 190, column: 15, scope: !805)
!836 = !DILocation(line: 948, column: 21, scope: !837, inlinedAt: !840)
!837 = distinct !DISubprogram(name: "write_error", scope: !63, file: !63, line: 946, type: !211, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!838 = !{!839}
!839 = !DILocalVariable(name: "saved_errno", scope: !837, file: !63, line: 948, type: !46)
!840 = distinct !DILocation(line: 191, column: 13, scope: !825)
!841 = !DILocation(line: 0, scope: !837, inlinedAt: !840)
!842 = !DILocation(line: 949, column: 3, scope: !837, inlinedAt: !840)
!843 = !DILocation(line: 950, column: 11, scope: !837, inlinedAt: !840)
!844 = !DILocation(line: 950, column: 3, scope: !837, inlinedAt: !840)
!845 = !DILocation(line: 951, column: 3, scope: !837, inlinedAt: !840)
!846 = !DILocation(line: 952, column: 3, scope: !837, inlinedAt: !840)
!847 = !DILocation(line: 196, column: 15, scope: !848)
!848 = distinct !DILexicalBlock(scope: !849, file: !3, line: 196, column: 15)
!849 = distinct !DILexicalBlock(scope: !802, file: !3, line: 194, column: 9)
!850 = !DILocation(line: 196, column: 15, scope: !849)
!851 = !DILocation(line: 197, column: 13, scope: !848)
!852 = !DILocation(line: 178, column: 25, scope: !742)
!853 = distinct !{!853, !795, !854, !575}
!854 = !DILocation(line: 199, column: 5, scope: !743)
!855 = !DILocation(line: 115, column: 7, scope: !729)
!856 = !DILocation(line: 201, column: 3, scope: !729)
!857 = !DISubprogram(name: "bindtextdomain", scope: !598, file: !598, line: 86, type: !858, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!858 = !DISubroutineType(types: !859)
!859 = !{!43, !51, !51}
!860 = !DISubprogram(name: "textdomain", scope: !598, file: !598, line: 82, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!861 = !DISubprogram(name: "atexit", scope: !720, file: !720, line: 602, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!862 = !DISubroutineType(types: !863)
!863 = !{!46, !210}
!864 = !DISubprogram(name: "getopt_long", scope: !149, file: !149, line: 66, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!865 = !DISubroutineType(types: !866)
!866 = !{!46, !46, !867, !51, !869, !154}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!870 = !DISubprogram(name: "fflush_unlocked", scope: !184, file: !184, line: 239, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!871 = !DISubprogram(name: "clearerr_unlocked", scope: !184, file: !184, line: 794, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !601)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !85}
!874 = !DILocation(line: 0, scope: !379)
!875 = !DILocation(line: 63, column: 27, scope: !379)
!876 = !DILocation(line: 63, column: 22, scope: !379)
!877 = !DILocation(line: 66, column: 3, scope: !379)
!878 = !DILocation(line: 63, column: 10, scope: !379)
!879 = !DILocation(line: 68, column: 7, scope: !390)
!880 = !DILocation(line: 68, column: 12, scope: !390)
!881 = !DILocation(line: 0, scope: !390)
!882 = !DILocation(line: 72, column: 24, scope: !883)
!883 = distinct !DILexicalBlock(scope: !390, file: !376, line: 72, column: 11)
!884 = !DILocation(line: 74, column: 26, scope: !885)
!885 = distinct !DILexicalBlock(scope: !883, file: !376, line: 73, column: 9)
!886 = !DILocation(line: 75, column: 16, scope: !887)
!887 = distinct !DILexicalBlock(scope: !885, file: !376, line: 75, column: 15)
!888 = !DILocation(line: 75, column: 15, scope: !885)
!889 = !DILocation(line: 77, column: 15, scope: !890)
!890 = distinct !DILexicalBlock(scope: !887, file: !376, line: 76, column: 13)
!891 = !DILocation(line: 77, column: 21, scope: !890)
!892 = !DILocation(line: 78, column: 15, scope: !890)
!893 = !DILocation(line: 82, column: 19, scope: !390)
!894 = !DILocation(line: 83, column: 13, scope: !895)
!895 = distinct !DILexicalBlock(scope: !390, file: !376, line: 83, column: 11)
!896 = !DILocation(line: 83, column: 11, scope: !390)
!897 = !DILocation(line: 85, column: 11, scope: !898)
!898 = distinct !DILexicalBlock(scope: !895, file: !376, line: 84, column: 9)
!899 = !DILocation(line: 86, column: 11, scope: !898)
!900 = !DILocation(line: 90, column: 23, scope: !406)
!901 = !DILocation(line: 90, column: 11, scope: !390)
!902 = !DILocation(line: 92, column: 11, scope: !405)
!903 = !DILocation(line: 92, column: 28, scope: !405)
!904 = !DILocation(line: 93, column: 16, scope: !404)
!905 = !DILocation(line: 0, scope: !404)
!906 = !DILocation(line: 93, column: 15, scope: !405)
!907 = !DILocation(line: 95, column: 24, scope: !908)
!908 = distinct !DILexicalBlock(scope: !404, file: !376, line: 94, column: 13)
!909 = !DILocation(line: 96, column: 19, scope: !910)
!910 = distinct !DILexicalBlock(scope: !908, file: !376, line: 96, column: 19)
!911 = !DILocation(line: 96, column: 19, scope: !908)
!912 = !DILocalVariable(name: "__dest", arg: 1, scope: !913, file: !914, line: 26, type: !917)
!913 = distinct !DISubprogram(name: "memcpy", scope: !914, file: !914, line: 26, type: !915, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !918)
!914 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!915 = !DISubroutineType(types: !916)
!916 = !{!45, !917, !726, !48}
!917 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!918 = !{!912, !919, !920}
!919 = !DILocalVariable(name: "__src", arg: 2, scope: !913, file: !914, line: 26, type: !726)
!920 = !DILocalVariable(name: "__len", arg: 3, scope: !913, file: !914, line: 26, type: !48)
!921 = !DILocation(line: 0, scope: !913, inlinedAt: !922)
!922 = distinct !DILocation(line: 97, column: 24, scope: !910)
!923 = !DILocation(line: 29, column: 10, scope: !913, inlinedAt: !922)
!924 = !DILocation(line: 97, column: 17, scope: !910)
!925 = !DILocation(line: 99, column: 36, scope: !403)
!926 = !DILocation(line: 99, column: 20, scope: !404)
!927 = !DILocalVariable(name: "ptr", arg: 1, scope: !928, file: !929, line: 2057, type: !45)
!928 = distinct !DISubprogram(name: "rpl_realloc", scope: !929, file: !929, line: 2057, type: !930, scopeLine: 2058, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !932)
!929 = !DIFile(filename: "./lib/stdlib.h", directory: "/src")
!930 = !DISubroutineType(types: !931)
!931 = !{!45, !45, !48}
!932 = !{!927, !933}
!933 = !DILocalVariable(name: "size", arg: 2, scope: !928, file: !929, line: 2057, type: !48)
!934 = !DILocation(line: 0, scope: !928, inlinedAt: !935)
!935 = distinct !DILocation(line: 102, column: 39, scope: !402)
!936 = !DILocation(line: 2059, column: 10, scope: !928, inlinedAt: !935)
!937 = !DILocation(line: 0, scope: !402)
!938 = !DILocation(line: 103, column: 35, scope: !939)
!939 = distinct !DILexicalBlock(scope: !402, file: !376, line: 103, column: 19)
!940 = !DILocation(line: 103, column: 19, scope: !402)
!941 = !DILocation(line: 105, column: 13, scope: !402)
!942 = !DILocation(line: 109, column: 7, scope: !390)
!943 = !DILocation(line: 110, column: 20, scope: !944)
!944 = distinct !DILexicalBlock(scope: !390, file: !376, line: 110, column: 11)
!945 = !DILocation(line: 110, column: 11, scope: !390)
!946 = !DILocation(line: 111, column: 18, scope: !944)
!947 = !DILocation(line: 111, column: 9, scope: !944)
!948 = !DILocation(line: 112, column: 25, scope: !949)
!949 = distinct !DILexicalBlock(scope: !944, file: !376, line: 112, column: 16)
!950 = !DILocation(line: 112, column: 16, scope: !944)
!951 = !DILocation(line: 116, column: 11, scope: !952)
!952 = distinct !DILexicalBlock(scope: !949, file: !376, line: 115, column: 9)
!953 = !DILocation(line: 116, column: 17, scope: !952)
!954 = !DILocation(line: 117, column: 11, scope: !952)
!955 = !DILocation(line: 119, column: 5, scope: !379)
!956 = !DILocation(line: 120, column: 1, scope: !379)
!957 = distinct !DISubprogram(name: "canonicalize_filename_mode", scope: !411, file: !411, line: 472, type: !958, scopeLine: 473, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !961)
!958 = !DISubroutineType(types: !959)
!959 = !{!43, !51, !960}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "canonicalize_mode_t", file: !6, line: 47, baseType: !5)
!961 = !{!962, !963, !964, !991}
!962 = !DILocalVariable(name: "name", arg: 1, scope: !957, file: !411, line: 472, type: !51)
!963 = !DILocalVariable(name: "can_mode", arg: 2, scope: !957, file: !411, line: 472, type: !960)
!964 = !DILocalVariable(name: "bufs", scope: !957, file: !411, line: 474, type: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "realpath_bufs", file: !411, line: 172, size: 24960, elements: !966)
!966 = !{!967, !989, !990}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rname", scope: !965, file: !411, line: 174, baseType: !968, size: 8320)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scratch_buffer", file: !969, line: 67, size: 8320, elements: !970)
!969 = !DIFile(filename: "./lib/malloc/scratch_buffer.gl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b0435d35f6cc1561ce8d59c6f713f596")
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !968, file: !969, line: 68, baseType: !45, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !968, file: !969, line: 69, baseType: !48, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "__space", scope: !968, file: !969, line: 70, baseType: !974, size: 8192, offset: 128)
!974 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !968, file: !969, line: 70, size: 8192, elements: !975)
!975 = !{!976, !985}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !974, file: !969, line: 70, baseType: !977, size: 256)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "max_align_t", file: !978, line: 24, baseType: !979)
!978 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/__stddef_max_align_t.h", directory: "", checksumkind: CSK_MD5, checksum: "48e8e2456f77e6cda35d245130fa7259")
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !978, line: 19, size: 256, elements: !980)
!980 = !{!981, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "__clang_max_align_nonce1", scope: !979, file: !978, line: 20, baseType: !982, size: 64, align: 64)
!982 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__clang_max_align_nonce2", scope: !979, file: !978, line: 22, baseType: !984, size: 128, align: 128, offset: 128)
!984 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__c", scope: !974, file: !969, line: 70, baseType: !986, size: 8192)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8192, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 1024)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !965, file: !411, line: 175, baseType: !968, size: 8320, offset: 8320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !965, file: !411, line: 176, baseType: !968, size: 8320, offset: 16640)
!991 = !DILocalVariable(name: "result", scope: !957, file: !411, line: 479, type: !43)
!992 = !DILocation(line: 0, scope: !957)
!993 = !DILocation(line: 474, column: 3, scope: !957)
!994 = !DILocation(line: 474, column: 24, scope: !957)
!995 = !DILocation(line: 475, column: 30, scope: !957)
!996 = !DILocalVariable(name: "buffer", arg: 1, scope: !997, file: !969, line: 76, type: !1000)
!997 = distinct !DISubprogram(name: "scratch_buffer_init", scope: !969, file: !969, line: 76, type: !998, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !1001)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!1001 = !{!996}
!1002 = !DILocation(line: 0, scope: !997, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 475, column: 3, scope: !957)
!1004 = !DILocation(line: 78, column: 26, scope: !997, inlinedAt: !1003)
!1005 = !DILocation(line: 78, column: 16, scope: !997, inlinedAt: !1003)
!1006 = !{!1007, !516, i64 0}
!1007 = !{!"scratch_buffer", !516, i64 0, !820, i64 8, !517, i64 16}
!1008 = !DILocation(line: 79, column: 11, scope: !997, inlinedAt: !1003)
!1009 = !DILocation(line: 79, column: 18, scope: !997, inlinedAt: !1003)
!1010 = !{!1007, !820, i64 8}
!1011 = !DILocation(line: 476, column: 30, scope: !957)
!1012 = !DILocation(line: 0, scope: !997, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 476, column: 3, scope: !957)
!1014 = !DILocation(line: 78, column: 26, scope: !997, inlinedAt: !1013)
!1015 = !DILocation(line: 78, column: 16, scope: !997, inlinedAt: !1013)
!1016 = !DILocation(line: 79, column: 11, scope: !997, inlinedAt: !1013)
!1017 = !DILocation(line: 79, column: 18, scope: !997, inlinedAt: !1013)
!1018 = !DILocation(line: 477, column: 30, scope: !957)
!1019 = !DILocation(line: 0, scope: !997, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 477, column: 3, scope: !957)
!1021 = !DILocation(line: 78, column: 26, scope: !997, inlinedAt: !1020)
!1022 = !DILocation(line: 78, column: 16, scope: !997, inlinedAt: !1020)
!1023 = !DILocation(line: 79, column: 11, scope: !997, inlinedAt: !1020)
!1024 = !DILocation(line: 79, column: 18, scope: !997, inlinedAt: !1020)
!1025 = !DILocalVariable(name: "name", arg: 1, scope: !1026, file: !411, line: 180, type: !51)
!1026 = distinct !DISubprogram(name: "canonicalize_filename_mode_stk", scope: !411, file: !411, line: 180, type: !1027, scopeLine: 182, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !1030)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!43, !51, !960, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!1030 = !{!1025, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1042, !1043, !1044, !1045, !1046, !1050, !1051, !1057, !1058, !1059, !1063, !1104, !1105, !1106, !1107, !1110, !1111, !1112}
!1031 = !DILocalVariable(name: "can_mode", arg: 2, scope: !1026, file: !411, line: 180, type: !960)
!1032 = !DILocalVariable(name: "bufs", arg: 3, scope: !1026, file: !411, line: 181, type: !1029)
!1033 = !DILocalVariable(name: "can_exist", scope: !1026, file: !411, line: 183, type: !960)
!1034 = !DILocalVariable(name: "rname", scope: !1026, file: !411, line: 202, type: !43)
!1035 = !DILocalVariable(name: "prefix_len", scope: !1026, file: !411, line: 206, type: !459)
!1036 = !DILocalVariable(name: "dest", scope: !1026, file: !411, line: 208, type: !43)
!1037 = !DILocalVariable(name: "start", scope: !1026, file: !411, line: 209, type: !51)
!1038 = !DILocalVariable(name: "ht", scope: !1026, file: !411, line: 211, type: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !222, line: 56, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !222, line: 54, flags: DIFlagFwdDecl)
!1042 = !DILocalVariable(name: "failed", scope: !1026, file: !411, line: 212, type: !57)
!1043 = !DILocalVariable(name: "logical", scope: !1026, file: !411, line: 277, type: !57)
!1044 = !DILocalVariable(name: "num_links", scope: !1026, file: !411, line: 279, type: !46)
!1045 = !DILocalVariable(name: "end_in_extra_buffer", scope: !1026, file: !411, line: 280, type: !57)
!1046 = !DILocalVariable(name: "end", scope: !1047, file: !411, line: 289, type: !51)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !411, line: 283, column: 5)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !411, line: 282, column: 3)
!1049 = distinct !DILexicalBlock(scope: !1026, file: !411, line: 282, column: 3)
!1050 = !DILocalVariable(name: "startlen", scope: !1047, file: !411, line: 295, type: !459)
!1051 = !DILocalVariable(name: "dest_offset", scope: !1052, file: !411, line: 320, type: !459)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !411, line: 319, column: 13)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !411, line: 313, column: 9)
!1054 = distinct !DILexicalBlock(scope: !1055, file: !411, line: 301, column: 16)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !411, line: 299, column: 16)
!1056 = distinct !DILexicalBlock(scope: !1047, file: !411, line: 297, column: 11)
!1057 = !DILocalVariable(name: "buf", scope: !1053, file: !411, line: 330, type: !43)
!1058 = !DILocalVariable(name: "n", scope: !1053, file: !411, line: 331, type: !397)
!1059 = !DILocalVariable(name: "bufsize", scope: !1060, file: !411, line: 337, type: !459)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !411, line: 335, column: 17)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !411, line: 333, column: 13)
!1062 = distinct !DILexicalBlock(scope: !1053, file: !411, line: 332, column: 15)
!1063 = !DILocalVariable(name: "st", scope: !1064, file: !411, line: 358, type: !1069)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !411, line: 352, column: 17)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !411, line: 351, column: 24)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !411, line: 349, column: 19)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !411, line: 346, column: 13)
!1068 = distinct !DILexicalBlock(scope: !1053, file: !411, line: 345, column: 15)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1070, line: 44, size: 1024, elements: !1071)
!1070 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1071 = !{!1072, !1074, !1076, !1078, !1080, !1082, !1084, !1085, !1086, !1087, !1089, !1090, !1092, !1100, !1101, !1102}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1069, file: !1070, line: 46, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !112, line: 145, baseType: !50)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1069, file: !1070, line: 47, baseType: !1075, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !112, line: 148, baseType: !50)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1069, file: !1070, line: 48, baseType: !1077, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !112, line: 150, baseType: !7)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1069, file: !1070, line: 49, baseType: !1079, size: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !112, line: 151, baseType: !7)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1069, file: !1070, line: 50, baseType: !1081, size: 32, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !112, line: 146, baseType: !7)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1069, file: !1070, line: 51, baseType: !1083, size: 32, offset: 224)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !112, line: 147, baseType: !7)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1069, file: !1070, line: 52, baseType: !1073, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1069, file: !1070, line: 53, baseType: !1073, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1069, file: !1070, line: 54, baseType: !111, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1069, file: !1070, line: 55, baseType: !1088, size: 32, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !112, line: 175, baseType: !46)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1069, file: !1070, line: 56, baseType: !46, size: 32, offset: 480)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1069, file: !1070, line: 57, baseType: !1091, size: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !112, line: 180, baseType: !113)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1069, file: !1070, line: 65, baseType: !1093, size: 128, offset: 576)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1094, line: 11, size: 128, elements: !1095)
!1094 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1095 = !{!1096, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1093, file: !1094, line: 16, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !112, line: 160, baseType: !113)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1093, file: !1094, line: 21, baseType: !1099, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !112, line: 197, baseType: !113)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1069, file: !1070, line: 66, baseType: !1093, size: 128, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1069, file: !1070, line: 67, baseType: !1093, size: 128, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1069, file: !1070, line: 79, baseType: !1103, size: 64, offset: 960)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !270)
!1104 = !DILocalVariable(name: "extra_buf", scope: !1067, file: !411, line: 380, type: !43)
!1105 = !DILocalVariable(name: "end_idx", scope: !1067, file: !411, line: 381, type: !459)
!1106 = !DILocalVariable(name: "len", scope: !1067, file: !411, line: 384, type: !48)
!1107 = !DILocalVariable(name: "pfxlen", scope: !1108, file: !411, line: 403, type: !459)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !411, line: 402, column: 17)
!1109 = distinct !DILexicalBlock(scope: !1067, file: !411, line: 401, column: 19)
!1110 = !DILocalVariable(name: "result", scope: !1026, file: !411, line: 458, type: !43)
!1111 = !DILabel(scope: !1047, name: "next_component", file: !411, line: 440)
!1112 = !DILabel(scope: !1026, name: "error", file: !411, line: 450)
!1113 = !DILocation(line: 0, scope: !1026, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 479, column: 18, scope: !957)
!1115 = !DILocation(line: 183, column: 44, scope: !1026, inlinedAt: !1114)
!1116 = !DILocalVariable(name: "i", arg: 1, scope: !1117, file: !411, line: 141, type: !960)
!1117 = distinct !DISubprogram(name: "multiple_bits_set", scope: !411, file: !411, line: 141, type: !1118, scopeLine: 142, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!57, !960}
!1120 = !{!1116}
!1121 = !DILocation(line: 0, scope: !1117, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 184, column: 7, scope: !1123, inlinedAt: !1114)
!1123 = distinct !DILexicalBlock(scope: !1026, file: !411, line: 184, column: 7)
!1124 = !DILocation(line: 143, column: 24, scope: !1117, inlinedAt: !1122)
!1125 = !{i32 0, i32 33}
!1126 = !DILocation(line: 184, column: 7, scope: !1026, inlinedAt: !1114)
!1127 = !DILocation(line: 186, column: 7, scope: !1128, inlinedAt: !1114)
!1128 = distinct !DILexicalBlock(scope: !1123, file: !411, line: 185, column: 5)
!1129 = !DILocation(line: 186, column: 13, scope: !1128, inlinedAt: !1114)
!1130 = !DILocation(line: 187, column: 7, scope: !1128, inlinedAt: !1114)
!1131 = !DILocation(line: 190, column: 12, scope: !1132, inlinedAt: !1114)
!1132 = distinct !DILexicalBlock(scope: !1026, file: !411, line: 190, column: 7)
!1133 = !DILocation(line: 190, column: 7, scope: !1026, inlinedAt: !1114)
!1134 = !DILocation(line: 192, column: 7, scope: !1135, inlinedAt: !1114)
!1135 = distinct !DILexicalBlock(scope: !1132, file: !411, line: 191, column: 5)
!1136 = !DILocation(line: 192, column: 13, scope: !1135, inlinedAt: !1114)
!1137 = !DILocation(line: 193, column: 7, scope: !1135, inlinedAt: !1114)
!1138 = !DILocation(line: 196, column: 7, scope: !1139, inlinedAt: !1114)
!1139 = distinct !DILexicalBlock(scope: !1026, file: !411, line: 196, column: 7)
!1140 = !DILocation(line: 196, column: 15, scope: !1139, inlinedAt: !1114)
!1141 = !DILocation(line: 196, column: 7, scope: !1026, inlinedAt: !1114)
!1142 = !DILocation(line: 198, column: 7, scope: !1143, inlinedAt: !1114)
!1143 = distinct !DILexicalBlock(scope: !1139, file: !411, line: 197, column: 5)
!1144 = !DILocation(line: 198, column: 13, scope: !1143, inlinedAt: !1114)
!1145 = !DILocation(line: 199, column: 7, scope: !1143, inlinedAt: !1114)
!1146 = !DILocation(line: 202, column: 29, scope: !1026, inlinedAt: !1114)
!1147 = !DILocation(line: 214, column: 8, scope: !1148, inlinedAt: !1114)
!1148 = distinct !DILexicalBlock(scope: !1026, file: !411, line: 214, column: 7)
!1149 = !DILocation(line: 214, column: 7, scope: !1026, inlinedAt: !1114)
!1150 = !DILocation(line: 216, column: 15, scope: !1151, inlinedAt: !1114)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !411, line: 215, column: 5)
!1152 = !DILocation(line: 216, column: 14, scope: !1151, inlinedAt: !1114)
!1153 = !DILocation(line: 216, column: 7, scope: !1151, inlinedAt: !1114)
!1154 = !DILocation(line: 218, column: 19, scope: !1155, inlinedAt: !1114)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !411, line: 217, column: 9)
!1156 = !DILocation(line: 218, column: 11, scope: !1155, inlinedAt: !1114)
!1157 = !DILocalVariable(name: "buffer", arg: 1, scope: !1158, file: !969, line: 99, type: !1000)
!1158 = distinct !DISubprogram(name: "scratch_buffer_grow", scope: !969, file: !969, line: 99, type: !1159, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !410, retainedNodes: !1161)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!57, !1000}
!1161 = !{!1157}
!1162 = !DILocation(line: 0, scope: !1158, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 221, column: 19, scope: !1164, inlinedAt: !1114)
!1164 = distinct !DILexicalBlock(scope: !1165, file: !411, line: 221, column: 19)
!1165 = distinct !DILexicalBlock(scope: !1155, file: !411, line: 219, column: 13)
!1166 = !DILocation(line: 101, column: 10, scope: !1158, inlinedAt: !1163)
!1167 = !DILocation(line: 221, column: 19, scope: !1165, inlinedAt: !1114)
!1168 = !DILocation(line: 225, column: 15, scope: !1165, inlinedAt: !1114)
!1169 = !DILocation(line: 231, column: 31, scope: !1155, inlinedAt: !1114)
!1170 = !{!1171, !516, i64 0}
!1171 = !{!"realpath_bufs", !1007, i64 0, !1007, i64 1040, !1007, i64 2080}
!1172 = !DILocation(line: 216, column: 53, scope: !1151, inlinedAt: !1114)
!1173 = !{!1171, !820, i64 8}
!1174 = distinct !{!1174, !1153, !1175, !575}
!1175 = !DILocation(line: 232, column: 9, scope: !1151, inlinedAt: !1114)
!1176 = !DILocation(line: 233, column: 14, scope: !1151, inlinedAt: !1114)
!1177 = !DILocation(line: 236, column: 5, scope: !1151, inlinedAt: !1114)
!1178 = !DILocalVariable(name: "__dest", arg: 1, scope: !1179, file: !914, line: 42, type: !917)
