; ModuleID = 'src/realpath.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon.33 }
%union.anon.33 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { i8*, i64, %union.anon }
%union.anon = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, fp128 }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }

!26 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 46, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!30 = !DIEnumerator(name: "_ISupper", value: 256)
!31 = !DIEnumerator(name: "_ISlower", value: 512)
!32 = !DIEnumerator(name: "_ISalpha", value: 1024)
!33 = !DIEnumerator(name: "_ISdigit", value: 2048)
!34 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!35 = !DIEnumerator(name: "_ISspace", value: 8192)
!36 = !DIEnumerator(name: "_ISprint", value: 16384)
!37 = !DIEnumerator(name: "_ISgraph", value: 32768)
!38 = !DIEnumerator(name: "_ISblank", value: 1)
!39 = !DIEnumerator(name: "_IScntrl", value: 2)
!40 = !DIEnumerator(name: "_ISpunct", value: 4)
!41 = !DIEnumerator(name: "_ISalnum", value: 8)
!42 = !{!43, !45, !46, !47, !48, !51, !53}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !49, line: 46, baseType: !50)
!49 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!50 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !{!55, !58, !60, !62, !64, !0, !150}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "logical", scope: !2, file: !3, line: 40, type: !57, isLocal: true, isDefinition: true)
!57 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "use_nuls", scope: !2, file: !3, line: 41, type: !57, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "can_relative_to", scope: !2, file: !3, line: 42, type: !51, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "can_relative_base", scope: !2, file: !3, line: 43, type: !51, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !66, file: !67, line: 575, type: !46, isLocal: true, isDefinition: true)
!66 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !68, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !70)
!67 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!68 = !DISubroutineType(types: !69)
!69 = !{null, !51, !51}
!70 = !{!71, !72, !73, !76, !77, !78, !79, !83, !84, !85, !86, !88, !144, !145, !146, !148, !149}
!71 = !DILocalVariable(name: "program", arg: 1, scope: !66, file: !67, line: 573, type: !51)
!72 = !DILocalVariable(name: "option", arg: 2, scope: !66, file: !67, line: 573, type: !51)
!73 = !DILocalVariable(name: "term", scope: !74, file: !67, line: 585, type: !51)
!74 = distinct !DILexicalBlock(scope: !75, file: !67, line: 582, column: 5)
!75 = distinct !DILexicalBlock(scope: !66, file: !67, line: 581, column: 7)
!76 = !DILocalVariable(name: "double_space", scope: !66, file: !67, line: 594, type: !57)
!77 = !DILocalVariable(name: "first_word", scope: !66, file: !67, line: 595, type: !51)
!78 = !DILocalVariable(name: "option_text", scope: !66, file: !67, line: 596, type: !51)
!79 = !DILocalVariable(name: "s", scope: !80, file: !67, line: 608, type: !51)
!80 = distinct !DILexicalBlock(scope: !81, file: !67, line: 605, column: 5)
!81 = distinct !DILexicalBlock(scope: !82, file: !67, line: 604, column: 12)
!82 = distinct !DILexicalBlock(scope: !66, file: !67, line: 597, column: 7)
!83 = !DILocalVariable(name: "spaces", scope: !80, file: !67, line: 609, type: !48)
!84 = !DILocalVariable(name: "anchor_len", scope: !66, file: !67, line: 620, type: !48)
!85 = !DILocalVariable(name: "desc_text", scope: !66, file: !67, line: 625, type: !51)
!86 = !DILocalVariable(name: "__ptr", scope: !87, file: !67, line: 644, type: !51)
!87 = distinct !DILexicalBlock(scope: !66, file: !67, line: 644, column: 3)
!88 = !DILocalVariable(name: "__stream", scope: !87, file: !67, line: 644, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !91, line: 7, baseType: !92)
!91 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !93, line: 49, size: 1728, elements: !94)
!93 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !110, !112, !113, !114, !118, !119, !121, !125, !128, !130, !133, !136, !137, !138, !139, !140}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !92, file: !93, line: 51, baseType: !46, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !92, file: !93, line: 54, baseType: !43, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !92, file: !93, line: 55, baseType: !43, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !92, file: !93, line: 56, baseType: !43, size: 64, offset: 192)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !92, file: !93, line: 57, baseType: !43, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !92, file: !93, line: 58, baseType: !43, size: 64, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !92, file: !93, line: 59, baseType: !43, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !92, file: !93, line: 60, baseType: !43, size: 64, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !92, file: !93, line: 61, baseType: !43, size: 64, offset: 512)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !92, file: !93, line: 64, baseType: !43, size: 64, offset: 576)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !92, file: !93, line: 65, baseType: !43, size: 64, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !92, file: !93, line: 66, baseType: !43, size: 64, offset: 704)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !92, file: !93, line: 68, baseType: !108, size: 64, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !93, line: 36, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !92, file: !93, line: 70, baseType: !111, size: 64, offset: 832)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !92, file: !93, line: 72, baseType: !46, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !92, file: !93, line: 73, baseType: !46, size: 32, offset: 928)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !92, file: !93, line: 74, baseType: !115, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !116, line: 152, baseType: !117)
!116 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!117 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !92, file: !93, line: 77, baseType: !47, size: 16, offset: 1024)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !92, file: !93, line: 78, baseType: !120, size: 8, offset: 1040)
!120 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !92, file: !93, line: 79, baseType: !122, size: 8, offset: 1048)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !92, file: !93, line: 81, baseType: !126, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !93, line: 43, baseType: null)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !92, file: !93, line: 89, baseType: !129, size: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !116, line: 153, baseType: !117)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !92, file: !93, line: 91, baseType: !131, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !93, line: 37, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !92, file: !93, line: 92, baseType: !134, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !93, line: 38, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !92, file: !93, line: 93, baseType: !111, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !92, file: !93, line: 94, baseType: !45, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !92, file: !93, line: 95, baseType: !48, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !92, file: !93, line: 96, baseType: !46, size: 32, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !92, file: !93, line: 98, baseType: !141, size: 160, offset: 1568)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 20)
!144 = !DILocalVariable(name: "__cnt", scope: !87, file: !67, line: 644, type: !48)
!145 = !DILocalVariable(name: "url_program", scope: !66, file: !67, line: 648, type: !51)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !67, line: 686, type: !51)
!147 = distinct !DILexicalBlock(scope: !66, file: !67, line: 686, column: 3)
!148 = !DILocalVariable(name: "__stream", scope: !147, file: !67, line: 686, type: !89)
!149 = !DILocalVariable(name: "__cnt", scope: !147, file: !67, line: 686, type: !48)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 39, type: !57, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 3584, elements: !162)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !155, line: 50, size: 256, elements: !156)
!155 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!156 = !{!157, !158, !159, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 52, baseType: !51, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !154, file: !155, line: 55, baseType: !46, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !155, line: 56, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !154, file: !155, line: 57, baseType: !46, size: 32, offset: 192)
!162 = !{!163}
!163 = !DISubrange(count: 14)
!164 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!165 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!166 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "Version", scope: !169, file: !170, line: 3, type: !51, isLocal: false, isDefinition: true)
!169 = distinct !DICompileUnit(language: DW_LANG_C99, file: !170, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !171, splitDebugInlining: false, nameTableKind: None)
!170 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!171 = !{!167}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "file_name", scope: !174, file: !175, line: 45, type: !51, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!176 = !{!172, !177}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !174, file: !175, line: 55, type: !57, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !181, file: !182, line: 66, type: !217, isLocal: false, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !183, globals: !184, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!183 = !{!45, !53}
!184 = !{!185, !211, !179, !213, !215}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "old_file_name", scope: !187, file: !182, line: 304, type: !51, isLocal: true, isDefinition: true)
!187 = distinct !DISubprogram(name: "verror_at_line", scope: !182, file: !182, line: 298, type: !188, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !204)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !46, !46, !51, !7, !51, !190}
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !191, line: 52, baseType: !192)
!191 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !193, line: 32, baseType: !194)
!193 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !195, baseType: !196)
!195 = !DIFile(filename: "lib/error.c", directory: "/src")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !197, size: 256, elements: !198)
!197 = !DINamespace(name: "std", scope: null)
!198 = !{!199, !200, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !196, file: !195, baseType: !45, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !196, file: !195, baseType: !45, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !196, file: !195, baseType: !45, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !196, file: !195, baseType: !46, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !196, file: !195, baseType: !46, size: 32, offset: 224)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DILocalVariable(name: "status", arg: 1, scope: !187, file: !182, line: 298, type: !46)
!206 = !DILocalVariable(name: "errnum", arg: 2, scope: !187, file: !182, line: 298, type: !46)
!207 = !DILocalVariable(name: "file_name", arg: 3, scope: !187, file: !182, line: 298, type: !51)
!208 = !DILocalVariable(name: "line_number", arg: 4, scope: !187, file: !182, line: 298, type: !7)
!209 = !DILocalVariable(name: "message", arg: 5, scope: !187, file: !182, line: 298, type: !51)
!210 = !DILocalVariable(name: "args", arg: 6, scope: !187, file: !182, line: 298, type: !190)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "old_line_number", scope: !187, file: !182, line: 305, type: !7, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "error_message_count", scope: !181, file: !182, line: 69, type: !7, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !181, file: !182, line: 295, type: !46, isLocal: false, isDefinition: true)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "default_tuning", scope: !222, file: !223, line: 134, type: !227, isLocal: true, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !224, globals: !226, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!224 = !{!50, !45, !225, !48}
!225 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!226 = !{!220}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !229, line: 52, baseType: !230)
!229 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !229, line: 40, size: 160, elements: !231)
!231 = !{!232, !233, !234, !235, !236}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !230, file: !229, line: 45, baseType: !225, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !230, file: !229, line: 46, baseType: !225, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !230, file: !229, line: 47, baseType: !225, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !230, file: !229, line: 48, baseType: !225, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !230, file: !229, line: 49, baseType: !57, size: 8, offset: 128)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "program_name", scope: !239, file: !240, line: 31, type: !51, isLocal: false, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !241, globals: !242, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!241 = !{!43}
!242 = !{!237}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "utf07FF", scope: !245, file: !246, line: 46, type: !276, isLocal: true, isDefinition: true)
!245 = distinct !DISubprogram(name: "proper_name_lite", scope: !246, file: !246, line: 38, type: !247, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !249, retainedNodes: !251)
!246 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!247 = !DISubroutineType(types: !248)
!248 = !{!51, !51, !51}
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !250, splitDebugInlining: false, nameTableKind: None)
!250 = !{!243}
!251 = !{!252, !253, !254, !255, !260}
!252 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !245, file: !246, line: 38, type: !51)
!253 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !245, file: !246, line: 38, type: !51)
!254 = !DILocalVariable(name: "translation", scope: !245, file: !246, line: 40, type: !51)
!255 = !DILocalVariable(name: "w", scope: !245, file: !246, line: 47, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !257, line: 37, baseType: !258)
!257 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !116, line: 57, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !116, line: 42, baseType: !7)
!260 = !DILocalVariable(name: "mbs", scope: !245, file: !246, line: 48, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !262, line: 6, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !264, line: 21, baseType: !265)
!264 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 13, size: 64, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !265, file: !264, line: 15, baseType: !46, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !265, file: !264, line: 20, baseType: !269, size: 32, offset: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !265, file: !264, line: 16, size: 32, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !269, file: !264, line: 18, baseType: !7, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !269, file: !264, line: 19, baseType: !273, size: 32)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 4)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 16, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !281, file: !282, line: 76, type: !350, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !283, retainedTypes: !289, globals: !290, splitDebugInlining: false, nameTableKind: None)
!282 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!283 = !{!13, !284, !27}
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !14, line: 254, baseType: !7, size: 32, elements: !285)
!285 = !{!286, !287, !288}
!286 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!287 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!288 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!289 = !{!46, !47, !48}
!290 = !{!279, !291, !297, !309, !311, !316, !339, !346, !348}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !281, file: !282, line: 92, type: !293, isLocal: false, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 320, elements: !295)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!295 = !{!296}
!296 = !DISubrange(count: 10)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !281, file: !282, line: 1040, type: !299, isLocal: false, isDefinition: true)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !282, line: 56, size: 448, elements: !300)
!300 = !{!301, !302, !303, !307, !308}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !299, file: !282, line: 59, baseType: !13, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !282, line: 62, baseType: !46, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !299, file: !282, line: 66, baseType: !304, size: 256, offset: 64)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !299, file: !282, line: 69, baseType: !51, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !299, file: !282, line: 72, baseType: !51, size: 64, offset: 384)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !281, file: !282, line: 107, type: !299, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "slot0", scope: !281, file: !282, line: 831, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 256)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "quote", scope: !318, file: !282, line: 228, type: !337, isLocal: true, isDefinition: true)
!318 = distinct !DISubprogram(name: "gettext_quote", scope: !282, file: !282, line: 197, type: !319, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !281, retainedNodes: !321)
!319 = !DISubroutineType(types: !320)
!320 = !{!51, !51, !13}
!321 = !{!322, !323, !324, !325, !326}
!322 = !DILocalVariable(name: "msgid", arg: 1, scope: !318, file: !282, line: 197, type: !51)
!323 = !DILocalVariable(name: "s", arg: 2, scope: !318, file: !282, line: 197, type: !13)
!324 = !DILocalVariable(name: "translation", scope: !318, file: !282, line: 199, type: !51)
!325 = !DILocalVariable(name: "w", scope: !318, file: !282, line: 229, type: !256)
!326 = !DILocalVariable(name: "mbs", scope: !318, file: !282, line: 230, type: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !262, line: 6, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !264, line: 21, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 13, size: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !329, file: !264, line: 15, baseType: !46, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !329, file: !264, line: 20, baseType: !333, size: 32, offset: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !264, line: 16, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !333, file: !264, line: 18, baseType: !7, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !333, file: !264, line: 19, baseType: !273, size: 32)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, elements: !338)
!338 = !{!278, !275}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "slotvec", scope: !281, file: !282, line: 834, type: !341, isLocal: true, isDefinition: true)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !282, line: 823, size: 128, elements: !343)
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !342, file: !282, line: 825, baseType: !48, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !342, file: !282, line: 826, baseType: !43, size: 64, offset: 64)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "nslots", scope: !281, file: !282, line: 832, type: !46, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "slotvec0", scope: !281, file: !282, line: 833, type: !342, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 704, elements: !352)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!352 = !{!353}
!353 = !DISubrange(count: 11)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !356, file: !357, line: 26, type: !359, isLocal: false, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !358, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!358 = !{!354}
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 376, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 47)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "exit_failure", scope: !364, file: !365, line: 24, type: !367, isLocal: false, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !366, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!366 = !{!362}
!367 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "internal_state", scope: !370, file: !371, line: 97, type: !374, isLocal: true, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !372, globals: !373, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!372 = !{!45, !48, !53}
!373 = !{!368}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !262, line: 6, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !264, line: 21, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 13, size: 64, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !376, file: !264, line: 15, baseType: !46, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !376, file: !264, line: 20, baseType: !380, size: 32, offset: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !264, line: 16, size: 32, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !380, file: !264, line: 18, baseType: !7, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !380, file: !264, line: 19, baseType: !273, size: 32)
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "src/relpath.c", directory: "/src", checksumkind: CSK_MD5, checksum: "16c7701de380a03fd2bfbb50611956cf")
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !389, globals: !390, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!388 = !{!5}
!389 = !{!45}
!390 = !{!391}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !386, file: !387, line: 110, type: !276, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!395 = !{!45, !43}
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !412, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!412 = !{!413}
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !411, line: 40, baseType: !7, size: 32, elements: !414)
!414 = !{!415}
!415 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !449, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!418 = !{!419, !431}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !420, file: !417, line: 188, baseType: !7, size: 32, elements: !429)
!420 = distinct !DISubprogram(name: "x2nrealloc", scope: !417, file: !417, line: 176, type: !421, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !424)
!421 = !DISubroutineType(types: !422)
!422 = !{!45, !45, !423, !48}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(name: "p", arg: 1, scope: !420, file: !417, line: 176, type: !45)
!426 = !DILocalVariable(name: "pn", arg: 2, scope: !420, file: !417, line: 176, type: !423)
!427 = !DILocalVariable(name: "s", arg: 3, scope: !420, file: !417, line: 176, type: !48)
!428 = !DILocalVariable(name: "n", scope: !420, file: !417, line: 178, type: !48)
!429 = !{!430}
!430 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !432, file: !417, line: 228, baseType: !7, size: 32, elements: !429)
!432 = distinct !DISubprogram(name: "xpalloc", scope: !417, file: !417, line: 223, type: !433, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !439)
!433 = !DISubroutineType(types: !434)
!434 = !{!45, !45, !435, !436, !438, !436}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !437, line: 130, baseType: !438)
!437 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !49, line: 35, baseType: !117)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448}
!440 = !DILocalVariable(name: "pa", arg: 1, scope: !432, file: !417, line: 223, type: !45)
!441 = !DILocalVariable(name: "pn", arg: 2, scope: !432, file: !417, line: 223, type: !435)
!442 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !432, file: !417, line: 223, type: !436)
!443 = !DILocalVariable(name: "n_max", arg: 4, scope: !432, file: !417, line: 223, type: !438)
!444 = !DILocalVariable(name: "s", arg: 5, scope: !432, file: !417, line: 223, type: !436)
!445 = !DILocalVariable(name: "n0", scope: !432, file: !417, line: 230, type: !436)
!446 = !DILocalVariable(name: "n", scope: !432, file: !417, line: 237, type: !436)
!447 = !DILocalVariable(name: "nbytes", scope: !432, file: !417, line: 248, type: !436)
!448 = !DILocalVariable(name: "adjusted_nbytes", scope: !432, file: !417, line: 252, type: !436)
!449 = !{!43, !45, !57, !117, !50}
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !462, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!462 = !{!57, !50, !45}
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!469 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!470 = !{i32 7, !"Dwarf Version", i32 5}
!471 = !{i32 2, !"Debug Info Version", i32 3}
!472 = !{i32 1, !"wchar_size", i32 4}
!473 = !{i32 1, !"branch-target-enforcement", i32 0}
!474 = !{i32 1, !"sign-return-address", i32 0}
!475 = !{i32 1, !"sign-return-address-all", i32 0}
!476 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!477 = !{i32 7, !"PIC Level", i32 2}
!478 = !{i32 7, !"PIE Level", i32 2}
!479 = !{i32 7, !"uwtable", i32 1}
!480 = !{i32 7, !"frame-pointer", i32 1}
!481 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 64, type: !482, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !46}
!484 = !{!485}
!485 = !DILocalVariable(name: "status", arg: 1, scope: !481, file: !3, line: 64, type: !46)
!486 = !DILocation(line: 0, scope: !481)
!487 = !DILocation(line: 66, column: 14, scope: !488)
!488 = distinct !DILexicalBlock(scope: !481, file: !3, line: 66, column: 7)
!489 = !DILocation(line: 66, column: 7, scope: !481)
!490 = !DILocation(line: 67, column: 5, scope: !491)
!491 = distinct !DILexicalBlock(scope: !488, file: !3, line: 67, column: 5)
!492 = !{!493, !493, i64 0}
!493 = !{!"any pointer", !494, i64 0}
!494 = !{!"omnipotent char", !495, i64 0}
!495 = !{!"Simple C/C++ TBAA"}
!496 = !DILocation(line: 70, column: 7, scope: !497)
!497 = distinct !DILexicalBlock(scope: !488, file: !3, line: 69, column: 5)
!498 = !DILocation(line: 71, column: 7, scope: !497)
!499 = !DILocation(line: 74, column: 7, scope: !497)
!500 = !DILocation(line: 78, column: 7, scope: !497)
!501 = !DILocation(line: 81, column: 7, scope: !497)
!502 = !DILocation(line: 85, column: 7, scope: !497)
!503 = !DILocation(line: 88, column: 7, scope: !497)
!504 = !DILocation(line: 91, column: 7, scope: !497)
!505 = !DILocation(line: 94, column: 7, scope: !497)
!506 = !DILocation(line: 97, column: 7, scope: !497)
!507 = !DILocation(line: 100, column: 7, scope: !497)
!508 = !DILocation(line: 103, column: 7, scope: !497)
!509 = !DILocation(line: 106, column: 7, scope: !497)
!510 = !DILocation(line: 107, column: 7, scope: !497)
!511 = !DILocalVariable(name: "program", arg: 1, scope: !512, file: !67, line: 836, type: !51)
!512 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !67, file: !67, line: 836, type: !513, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !51}
!515 = !{!511, !516, !525, !526, !528, !529}
!516 = !DILocalVariable(name: "infomap", scope: !512, file: !67, line: 838, type: !517)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 896, elements: !523)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !512, file: !67, line: 838, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !519, file: !67, line: 838, baseType: !51, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !519, file: !67, line: 838, baseType: !51, size: 64, offset: 64)
!523 = !{!524}
!524 = !DISubrange(count: 7)
!525 = !DILocalVariable(name: "node", scope: !512, file: !67, line: 848, type: !51)
!526 = !DILocalVariable(name: "map_prog", scope: !512, file: !67, line: 849, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!528 = !DILocalVariable(name: "lc_messages", scope: !512, file: !67, line: 861, type: !51)
!529 = !DILocalVariable(name: "url_program", scope: !512, file: !67, line: 874, type: !51)
!530 = !DILocation(line: 0, scope: !512, inlinedAt: !531)
!531 = distinct !DILocation(line: 108, column: 7, scope: !497)
!532 = !DILocation(line: 838, column: 3, scope: !512, inlinedAt: !531)
!533 = !DILocation(line: 838, column: 67, scope: !512, inlinedAt: !531)
!534 = !DILocation(line: 849, column: 36, scope: !512, inlinedAt: !531)
!535 = !DILocation(line: 851, column: 3, scope: !512, inlinedAt: !531)
!536 = !DILocalVariable(name: "__s1", arg: 1, scope: !537, file: !538, line: 1359, type: !51)
!537 = distinct !DISubprogram(name: "streq", scope: !538, file: !538, line: 1359, type: !539, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !541)
!538 = !DIFile(filename: "./lib/string.h", directory: "/src")
!539 = !DISubroutineType(types: !540)
!540 = !{!57, !51, !51}
!541 = !{!536, !542}
!542 = !DILocalVariable(name: "__s2", arg: 2, scope: !537, file: !538, line: 1359, type: !51)
!543 = !DILocation(line: 0, scope: !537, inlinedAt: !544)
!544 = distinct !DILocation(line: 851, column: 33, scope: !512, inlinedAt: !531)
!545 = !DILocation(line: 1361, column: 11, scope: !537, inlinedAt: !544)
!546 = !DILocation(line: 1361, column: 10, scope: !537, inlinedAt: !544)
!547 = !DILocation(line: 852, column: 13, scope: !512, inlinedAt: !531)
!548 = !DILocation(line: 851, column: 20, scope: !512, inlinedAt: !531)
!549 = !{!550, !493, i64 0}
!550 = !{!"infomap", !493, i64 0, !493, i64 8}
!551 = !DILocation(line: 851, column: 10, scope: !512, inlinedAt: !531)
!552 = !DILocation(line: 851, column: 28, scope: !512, inlinedAt: !531)
!553 = distinct !{!553, !535, !547, !554}
!554 = !{!"llvm.loop.mustprogress"}
!555 = !DILocation(line: 854, column: 17, scope: !556, inlinedAt: !531)
!556 = distinct !DILexicalBlock(scope: !512, file: !67, line: 854, column: 7)
!557 = !{!550, !493, i64 8}
!558 = !DILocation(line: 854, column: 7, scope: !556, inlinedAt: !531)
!559 = !DILocation(line: 854, column: 7, scope: !512, inlinedAt: !531)
!560 = !DILocation(line: 857, column: 3, scope: !512, inlinedAt: !531)
!561 = !DILocation(line: 861, column: 29, scope: !512, inlinedAt: !531)
!562 = !DILocation(line: 862, column: 7, scope: !563, inlinedAt: !531)
!563 = distinct !DILexicalBlock(scope: !512, file: !67, line: 862, column: 7)
!564 = !DILocation(line: 862, column: 19, scope: !563, inlinedAt: !531)
!565 = !DILocation(line: 862, column: 22, scope: !563, inlinedAt: !531)
!566 = !DILocation(line: 862, column: 7, scope: !512, inlinedAt: !531)
!567 = !DILocation(line: 868, column: 7, scope: !568, inlinedAt: !531)
!568 = distinct !DILexicalBlock(scope: !563, file: !67, line: 863, column: 5)
!569 = !DILocation(line: 870, column: 5, scope: !568, inlinedAt: !531)
!570 = !DILocation(line: 0, scope: !537, inlinedAt: !571)
!571 = distinct !DILocation(line: 874, column: 29, scope: !512, inlinedAt: !531)
!572 = !DILocation(line: 875, column: 3, scope: !512, inlinedAt: !531)
!573 = !DILocation(line: 877, column: 3, scope: !512, inlinedAt: !531)
!574 = !DILocation(line: 879, column: 1, scope: !512, inlinedAt: !531)
!575 = !DILocation(line: 110, column: 3, scope: !481)
!576 = !DISubprogram(name: "dcgettext", scope: !577, file: !577, line: 51, type: !578, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!577 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!578 = !DISubroutineType(types: !579)
!579 = !{!43, !51, !51, !46}
!580 = !{}
!581 = !DISubprogram(name: "fputs_unlocked", scope: !191, file: !191, line: 691, type: !582, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!582 = !DISubroutineType(types: !583)
!583 = !{!46, !584, !585}
!584 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !51)
!585 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!586 = !DILocation(line: 0, scope: !66)
!587 = !DILocation(line: 581, column: 7, scope: !75)
!588 = !{!589, !589, i64 0}
!589 = !{!"int", !494, i64 0}
!590 = !DILocation(line: 581, column: 19, scope: !75)
!591 = !DILocation(line: 581, column: 7, scope: !66)
!592 = !DILocation(line: 585, column: 26, scope: !74)
!593 = !DILocation(line: 0, scope: !74)
!594 = !DILocation(line: 586, column: 23, scope: !74)
!595 = !DILocation(line: 586, column: 28, scope: !74)
!596 = !DILocation(line: 586, column: 32, scope: !74)
!597 = !{!494, !494, i64 0}
!598 = !DILocation(line: 586, column: 38, scope: !74)
!599 = !DILocation(line: 0, scope: !537, inlinedAt: !600)
!600 = distinct !DILocation(line: 586, column: 41, scope: !74)
!601 = !DILocation(line: 1361, column: 11, scope: !537, inlinedAt: !600)
!602 = !DILocation(line: 1361, column: 10, scope: !537, inlinedAt: !600)
!603 = !DILocation(line: 586, column: 19, scope: !74)
!604 = !DILocation(line: 587, column: 5, scope: !74)
!605 = !DILocation(line: 588, column: 7, scope: !606)
!606 = distinct !DILexicalBlock(scope: !66, file: !67, line: 588, column: 7)
!607 = !DILocation(line: 588, column: 7, scope: !66)
!608 = !DILocation(line: 590, column: 7, scope: !609)
!609 = distinct !DILexicalBlock(scope: !606, file: !67, line: 589, column: 5)
!610 = !DILocation(line: 591, column: 7, scope: !609)
!611 = !DILocation(line: 595, column: 37, scope: !66)
!612 = !DILocation(line: 595, column: 35, scope: !66)
!613 = !DILocation(line: 596, column: 29, scope: !66)
!614 = !DILocation(line: 597, column: 8, scope: !82)
!615 = !DILocation(line: 597, column: 7, scope: !66)
!616 = !DILocation(line: 604, column: 24, scope: !81)
!617 = !DILocation(line: 604, column: 12, scope: !82)
!618 = !DILocation(line: 0, scope: !80)
!619 = !DILocation(line: 610, column: 16, scope: !80)
!620 = !DILocation(line: 610, column: 7, scope: !80)
!621 = !DILocation(line: 611, column: 21, scope: !80)
!622 = !{!623, !623, i64 0}
!623 = !{!"short", !494, i64 0}
!624 = !DILocation(line: 611, column: 19, scope: !80)
!625 = !DILocation(line: 611, column: 16, scope: !80)
!626 = !DILocation(line: 610, column: 30, scope: !80)
!627 = distinct !{!627, !620, !621, !554}
!628 = !DILocation(line: 612, column: 18, scope: !629)
!629 = distinct !DILexicalBlock(scope: !80, file: !67, line: 612, column: 11)
!630 = !DILocation(line: 612, column: 11, scope: !80)
!631 = !DILocation(line: 620, column: 23, scope: !66)
!632 = !DILocation(line: 625, column: 39, scope: !66)
!633 = !DILocation(line: 626, column: 3, scope: !66)
!634 = !DILocation(line: 626, column: 10, scope: !66)
!635 = !DILocation(line: 626, column: 21, scope: !66)
!636 = !DILocation(line: 628, column: 44, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !67, line: 628, column: 11)
!638 = distinct !DILexicalBlock(scope: !66, file: !67, line: 627, column: 5)
!639 = !DILocation(line: 628, column: 32, scope: !637)
!640 = !DILocation(line: 628, column: 49, scope: !637)
!641 = !DILocation(line: 628, column: 11, scope: !638)
!642 = !DILocation(line: 630, column: 11, scope: !643)
!643 = distinct !DILexicalBlock(scope: !638, file: !67, line: 630, column: 11)
!644 = !DILocation(line: 630, column: 11, scope: !638)
!645 = !DILocation(line: 632, column: 26, scope: !646)
!646 = distinct !DILexicalBlock(scope: !647, file: !67, line: 632, column: 15)
!647 = distinct !DILexicalBlock(scope: !643, file: !67, line: 631, column: 9)
!648 = !DILocation(line: 632, column: 34, scope: !646)
!649 = !DILocation(line: 632, column: 37, scope: !646)
!650 = !DILocation(line: 632, column: 15, scope: !647)
!651 = !DILocation(line: 636, column: 29, scope: !652)
!652 = distinct !DILexicalBlock(scope: !647, file: !67, line: 636, column: 15)
!653 = !DILocation(line: 640, column: 16, scope: !638)
!654 = distinct !{!654, !633, !655, !554}
!655 = !DILocation(line: 641, column: 5, scope: !66)
!656 = !DILocation(line: 644, column: 3, scope: !66)
!657 = !DILocation(line: 0, scope: !537, inlinedAt: !658)
!658 = distinct !DILocation(line: 648, column: 31, scope: !66)
!659 = !DILocation(line: 0, scope: !537, inlinedAt: !660)
!660 = distinct !DILocation(line: 649, column: 31, scope: !66)
!661 = !DILocation(line: 0, scope: !537, inlinedAt: !662)
!662 = distinct !DILocation(line: 650, column: 31, scope: !66)
!663 = !DILocation(line: 0, scope: !537, inlinedAt: !664)
!664 = distinct !DILocation(line: 651, column: 31, scope: !66)
!665 = !DILocation(line: 0, scope: !537, inlinedAt: !666)
!666 = distinct !DILocation(line: 652, column: 31, scope: !66)
!667 = !DILocation(line: 0, scope: !537, inlinedAt: !668)
!668 = distinct !DILocation(line: 653, column: 31, scope: !66)
!669 = !DILocation(line: 0, scope: !537, inlinedAt: !670)
!670 = distinct !DILocation(line: 654, column: 31, scope: !66)
!671 = !DILocation(line: 0, scope: !537, inlinedAt: !672)
!672 = distinct !DILocation(line: 655, column: 31, scope: !66)
!673 = !DILocation(line: 0, scope: !537, inlinedAt: !674)
!674 = distinct !DILocation(line: 656, column: 31, scope: !66)
!675 = !DILocation(line: 0, scope: !537, inlinedAt: !676)
!676 = distinct !DILocation(line: 657, column: 31, scope: !66)
!677 = !DILocation(line: 663, column: 7, scope: !678)
!678 = distinct !DILexicalBlock(scope: !66, file: !67, line: 663, column: 7)
!679 = !DILocation(line: 664, column: 7, scope: !678)
!680 = !DILocation(line: 664, column: 10, scope: !678)
!681 = !DILocation(line: 663, column: 7, scope: !66)
!682 = !DILocation(line: 669, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !678, file: !67, line: 665, column: 5)
!684 = !DILocation(line: 671, column: 5, scope: !683)
!685 = !DILocation(line: 676, column: 7, scope: !686)
!686 = distinct !DILexicalBlock(scope: !678, file: !67, line: 673, column: 5)
!687 = !DILocation(line: 679, column: 3, scope: !66)
!688 = !DILocation(line: 683, column: 3, scope: !66)
!689 = !DILocation(line: 686, column: 3, scope: !66)
!690 = !DILocation(line: 688, column: 3, scope: !66)
!691 = !DILocation(line: 691, column: 3, scope: !66)
!692 = !DILocation(line: 695, column: 3, scope: !66)
!693 = !DILocation(line: 696, column: 1, scope: !66)
!694 = !DISubprogram(name: "setlocale", scope: !695, file: !695, line: 122, type: !696, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!695 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!696 = !DISubroutineType(types: !697)
!697 = !{!43, !46, !51}
!698 = !DISubprogram(name: "getenv", scope: !699, file: !699, line: 641, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!699 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!700 = !DISubroutineType(types: !701)
!701 = !{!43, !51}
!702 = !DISubprogram(name: "fwrite_unlocked", scope: !191, file: !191, line: 704, type: !703, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!703 = !DISubroutineType(types: !704)
!704 = !{!48, !705, !48, !48, !585}
!705 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!708 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 194, type: !709, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !712)
!709 = !DISubroutineType(types: !710)
!710 = !{!46, !46, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !721, !722}
!713 = !DILocalVariable(name: "argc", arg: 1, scope: !708, file: !3, line: 194, type: !46)
!714 = !DILocalVariable(name: "argv", arg: 2, scope: !708, file: !3, line: 194, type: !711)
!715 = !DILocalVariable(name: "ok", scope: !708, file: !3, line: 196, type: !57)
!716 = !DILocalVariable(name: "can_mode", scope: !708, file: !3, line: 197, type: !46)
!717 = !DILocalVariable(name: "relative_to", scope: !708, file: !3, line: 198, type: !51)
!718 = !DILocalVariable(name: "relative_base", scope: !708, file: !3, line: 199, type: !51)
!719 = !DILocalVariable(name: "c", scope: !720, file: !3, line: 211, type: !46)
!720 = distinct !DILexicalBlock(scope: !708, file: !3, line: 210, column: 5)
!721 = !DILocalVariable(name: "need_dir", scope: !708, file: !3, line: 268, type: !57)
!722 = !DILocalVariable(name: "base", scope: !723, file: !3, line: 281, type: !43)
!723 = distinct !DILexicalBlock(scope: !724, file: !3, line: 280, column: 5)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 279, column: 12)
!725 = distinct !DILexicalBlock(scope: !708, file: !3, line: 277, column: 7)
!726 = !DILocation(line: 0, scope: !708)
!727 = !DILocation(line: 202, column: 21, scope: !708)
!728 = !DILocation(line: 202, column: 3, scope: !708)
!729 = !DILocation(line: 203, column: 3, scope: !708)
!730 = !DILocation(line: 204, column: 3, scope: !708)
!731 = !DILocation(line: 205, column: 3, scope: !708)
!732 = !DILocation(line: 207, column: 3, scope: !708)
!733 = !DILocation(line: 209, column: 3, scope: !708)
!734 = !DILocation(line: 198, column: 15, scope: !708)
!735 = !DILocation(line: 199, column: 15, scope: !708)
!736 = !DILocation(line: 197, column: 7, scope: !708)
!737 = !DILocation(line: 211, column: 15, scope: !720)
!738 = !DILocation(line: 0, scope: !720)
!739 = !DILocation(line: 212, column: 11, scope: !720)
!740 = !DILocation(line: 217, column: 20, scope: !741)
!741 = distinct !DILexicalBlock(scope: !720, file: !3, line: 215, column: 9)
!742 = !DILocation(line: 218, column: 20, scope: !741)
!743 = !DILocation(line: 219, column: 11, scope: !741)
!744 = !DILocation(line: 221, column: 20, scope: !741)
!745 = !DILocation(line: 223, column: 11, scope: !741)
!746 = !DILocation(line: 225, column: 20, scope: !741)
!747 = !DILocation(line: 226, column: 20, scope: !741)
!748 = !DILocation(line: 227, column: 11, scope: !741)
!749 = !DILocation(line: 229, column: 20, scope: !741)
!750 = !DILocation(line: 230, column: 19, scope: !741)
!751 = !DILocation(line: 231, column: 11, scope: !741)
!752 = !DILocation(line: 233, column: 20, scope: !741)
!753 = !DILocation(line: 234, column: 19, scope: !741)
!754 = !DILocation(line: 235, column: 11, scope: !741)
!755 = !DILocation(line: 237, column: 20, scope: !741)
!756 = !DILocation(line: 238, column: 19, scope: !741)
!757 = !DILocation(line: 239, column: 11, scope: !741)
!758 = !DILocation(line: 241, column: 19, scope: !741)
!759 = !DILocation(line: 242, column: 11, scope: !741)
!760 = !DILocation(line: 244, column: 20, scope: !741)
!761 = !DILocation(line: 245, column: 11, scope: !741)
!762 = !DILocation(line: 247, column: 25, scope: !741)
!763 = !DILocation(line: 248, column: 11, scope: !741)
!764 = !DILocation(line: 250, column: 27, scope: !741)
!765 = !DILocation(line: 251, column: 11, scope: !741)
!766 = !DILocation(line: 252, column: 9, scope: !741)
!767 = !DILocation(line: 253, column: 9, scope: !741)
!768 = !DILocation(line: 255, column: 11, scope: !741)
!769 = !DILocation(line: 259, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !708, file: !3, line: 259, column: 7)
!771 = !DILocation(line: 259, column: 14, scope: !770)
!772 = !DILocation(line: 259, column: 7, scope: !708)
!773 = !DILocation(line: 261, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !3, line: 260, column: 5)
!775 = !DILocation(line: 262, column: 7, scope: !774)
!776 = !DILocation(line: 265, column: 7, scope: !777)
!777 = distinct !DILexicalBlock(scope: !708, file: !3, line: 265, column: 7)
!778 = !DILocation(line: 265, column: 21, scope: !777)
!779 = !DILocation(line: 268, column: 29, scope: !708)
!780 = !DILocation(line: 268, column: 46, scope: !708)
!781 = !DILocation(line: 269, column: 7, scope: !782)
!782 = distinct !DILexicalBlock(scope: !708, file: !3, line: 269, column: 7)
!783 = !DILocation(line: 269, column: 7, scope: !708)
!784 = !DILocalVariable(name: "fname", arg: 1, scope: !785, file: !3, line: 116, type: !51)
!785 = distinct !DISubprogram(name: "realpath_canon", scope: !3, file: !3, line: 116, type: !786, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !788)
!786 = !DISubroutineType(types: !787)
!787 = !{!43, !51, !46}
!788 = !{!784, !789, !790, !791}
!789 = !DILocalVariable(name: "can_mode", arg: 2, scope: !785, file: !3, line: 116, type: !46)
!790 = !DILocalVariable(name: "can_fname", scope: !785, file: !3, line: 118, type: !43)
!791 = !DILocalVariable(name: "can_fname2", scope: !792, file: !3, line: 122, type: !43)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 120, column: 5)
!793 = distinct !DILexicalBlock(scope: !785, file: !3, line: 119, column: 7)
!794 = !DILocation(line: 0, scope: !785, inlinedAt: !795)
!795 = distinct !DILocation(line: 271, column: 25, scope: !796)
!796 = distinct !DILexicalBlock(scope: !782, file: !3, line: 270, column: 5)
!797 = !DILocation(line: 118, column: 21, scope: !785, inlinedAt: !795)
!798 = !DILocation(line: 119, column: 7, scope: !793, inlinedAt: !795)
!799 = !DILocation(line: 119, column: 15, scope: !793, inlinedAt: !795)
!800 = !DILocation(line: 121, column: 16, scope: !792, inlinedAt: !795)
!801 = !DILocation(line: 122, column: 26, scope: !792, inlinedAt: !795)
!802 = !DILocation(line: 0, scope: !792, inlinedAt: !795)
!803 = !DILocation(line: 123, column: 7, scope: !792, inlinedAt: !795)
!804 = !DILocation(line: 271, column: 23, scope: !796)
!805 = !DILocation(line: 272, column: 12, scope: !806)
!806 = distinct !DILexicalBlock(scope: !796, file: !3, line: 272, column: 11)
!807 = !DILocation(line: 272, column: 11, scope: !796)
!808 = !DILocation(line: 273, column: 9, scope: !806)
!809 = !DILocation(line: 274, column: 20, scope: !810)
!810 = distinct !DILexicalBlock(scope: !796, file: !3, line: 274, column: 11)
!811 = !DILocalVariable(name: "path", arg: 1, scope: !812, file: !3, line: 159, type: !51)
!812 = distinct !DISubprogram(name: "isdir", scope: !3, file: !3, line: 159, type: !813, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!57, !51}
!815 = !{!811, !816}
!816 = !DILocalVariable(name: "sb", scope: !812, file: !3, line: 161, type: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !818, line: 44, size: 1024, elements: !819)
!818 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!819 = !{!820, !822, !824, !826, !828, !830, !832, !833, !834, !835, !837, !838, !840, !848, !849, !850}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !817, file: !818, line: 46, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !116, line: 145, baseType: !50)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !817, file: !818, line: 47, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !116, line: 148, baseType: !50)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !817, file: !818, line: 48, baseType: !825, size: 32, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !116, line: 150, baseType: !7)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !817, file: !818, line: 49, baseType: !827, size: 32, offset: 160)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !116, line: 151, baseType: !7)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !817, file: !818, line: 50, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !116, line: 146, baseType: !7)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !817, file: !818, line: 51, baseType: !831, size: 32, offset: 224)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !116, line: 147, baseType: !7)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !817, file: !818, line: 52, baseType: !821, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !817, file: !818, line: 53, baseType: !821, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !817, file: !818, line: 54, baseType: !115, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !817, file: !818, line: 55, baseType: !836, size: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !116, line: 175, baseType: !46)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !817, file: !818, line: 56, baseType: !46, size: 32, offset: 480)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !817, file: !818, line: 57, baseType: !839, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !116, line: 180, baseType: !117)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !817, file: !818, line: 65, baseType: !841, size: 128, offset: 576)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !842, line: 11, size: 128, elements: !843)
!842 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!843 = !{!844, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !841, file: !842, line: 16, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !116, line: 160, baseType: !117)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !841, file: !842, line: 21, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !116, line: 197, baseType: !117)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !817, file: !818, line: 66, baseType: !841, size: 128, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !817, file: !818, line: 67, baseType: !841, size: 128, offset: 832)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !817, file: !818, line: 79, baseType: !851, size: 64, offset: 960)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !277)
!852 = !DILocation(line: 0, scope: !812, inlinedAt: !853)
!853 = distinct !DILocation(line: 274, column: 24, scope: !810)
!854 = !DILocation(line: 161, column: 3, scope: !812, inlinedAt: !853)
!855 = !DILocation(line: 161, column: 15, scope: !812, inlinedAt: !853)
!856 = !DILocation(line: 162, column: 7, scope: !857, inlinedAt: !853)
!857 = distinct !DILexicalBlock(scope: !812, file: !3, line: 162, column: 7)
!858 = !DILocation(line: 162, column: 24, scope: !857, inlinedAt: !853)
!859 = !DILocation(line: 162, column: 7, scope: !812, inlinedAt: !853)
!860 = !DILocation(line: 163, column: 5, scope: !857, inlinedAt: !853)
!861 = !DILocation(line: 164, column: 10, scope: !812, inlinedAt: !853)
!862 = !{!863, !589, i64 16}
!863 = !{!"stat", !864, i64 0, !864, i64 8, !589, i64 16, !589, i64 20, !589, i64 24, !589, i64 28, !864, i64 32, !864, i64 40, !864, i64 48, !589, i64 56, !589, i64 60, !864, i64 64, !865, i64 72, !865, i64 88, !865, i64 104, !494, i64 120}
!864 = !{!"long", !494, i64 0}
!865 = !{!"timespec", !864, i64 0, !864, i64 8}
!866 = !DILocation(line: 165, column: 1, scope: !812, inlinedAt: !853)
!867 = !DILocation(line: 274, column: 11, scope: !796)
!868 = !DILocation(line: 275, column: 9, scope: !810)
!869 = !DILocation(line: 277, column: 21, scope: !725)
!870 = !DILocation(line: 277, column: 7, scope: !708)
!871 = !DILocation(line: 278, column: 25, scope: !725)
!872 = !DILocation(line: 278, column: 23, scope: !725)
!873 = !DILocation(line: 278, column: 5, scope: !725)
!874 = !DILocation(line: 279, column: 12, scope: !725)
!875 = !DILocation(line: 0, scope: !785, inlinedAt: !876)
!876 = distinct !DILocation(line: 281, column: 20, scope: !723)
!877 = !DILocation(line: 118, column: 21, scope: !785, inlinedAt: !876)
!878 = !DILocation(line: 119, column: 7, scope: !793, inlinedAt: !876)
!879 = !DILocation(line: 119, column: 15, scope: !793, inlinedAt: !876)
!880 = !DILocation(line: 121, column: 16, scope: !792, inlinedAt: !876)
!881 = !DILocation(line: 122, column: 26, scope: !792, inlinedAt: !876)
!882 = !DILocation(line: 0, scope: !792, inlinedAt: !876)
!883 = !DILocation(line: 123, column: 7, scope: !792, inlinedAt: !876)
!884 = !DILocation(line: 0, scope: !723)
!885 = !DILocation(line: 282, column: 12, scope: !886)
!886 = distinct !DILexicalBlock(scope: !723, file: !3, line: 282, column: 11)
!887 = !DILocation(line: 282, column: 11, scope: !723)
!888 = !DILocation(line: 283, column: 9, scope: !886)
!889 = !DILocation(line: 284, column: 20, scope: !890)
!890 = distinct !DILexicalBlock(scope: !723, file: !3, line: 284, column: 11)
!891 = !DILocation(line: 0, scope: !812, inlinedAt: !892)
!892 = distinct !DILocation(line: 284, column: 24, scope: !890)
!893 = !DILocation(line: 161, column: 3, scope: !812, inlinedAt: !892)
!894 = !DILocation(line: 161, column: 15, scope: !812, inlinedAt: !892)
!895 = !DILocation(line: 162, column: 7, scope: !857, inlinedAt: !892)
!896 = !DILocation(line: 162, column: 24, scope: !857, inlinedAt: !892)
!897 = !DILocation(line: 162, column: 7, scope: !812, inlinedAt: !892)
!898 = !DILocation(line: 163, column: 5, scope: !857, inlinedAt: !892)
!899 = !DILocation(line: 164, column: 10, scope: !812, inlinedAt: !892)
!900 = !DILocation(line: 165, column: 1, scope: !812, inlinedAt: !892)
!901 = !DILocation(line: 284, column: 11, scope: !723)
!902 = !DILocation(line: 285, column: 9, scope: !890)
!903 = !DILocation(line: 288, column: 30, scope: !904)
!904 = distinct !DILexicalBlock(scope: !723, file: !3, line: 288, column: 11)
!905 = !DILocalVariable(name: "prefix", arg: 1, scope: !906, file: !3, line: 132, type: !51)
!906 = distinct !DISubprogram(name: "path_prefix", scope: !3, file: !3, line: 132, type: !539, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !907)
!907 = !{!905, !908}
!908 = !DILocalVariable(name: "path", arg: 2, scope: !906, file: !3, line: 132, type: !51)
!909 = !DILocation(line: 0, scope: !906, inlinedAt: !910)
!910 = distinct !DILocation(line: 288, column: 11, scope: !904)
!911 = !DILocation(line: 135, column: 9, scope: !906, inlinedAt: !910)
!912 = !DILocation(line: 136, column: 7, scope: !906, inlinedAt: !910)
!913 = !DILocation(line: 140, column: 8, scope: !914, inlinedAt: !910)
!914 = distinct !DILexicalBlock(scope: !906, file: !3, line: 140, column: 7)
!915 = !DILocation(line: 140, column: 7, scope: !906, inlinedAt: !910)
!916 = !DILocation(line: 148, column: 3, scope: !906, inlinedAt: !910)
!917 = !DILocation(line: 141, column: 12, scope: !914, inlinedAt: !910)
!918 = !DILocation(line: 141, column: 18, scope: !914, inlinedAt: !910)
!919 = !DILocation(line: 288, column: 11, scope: !723)
!920 = !DILocation(line: 144, column: 26, scope: !921, inlinedAt: !910)
!921 = distinct !DILexicalBlock(scope: !906, file: !3, line: 144, column: 7)
!922 = !DILocation(line: 144, column: 7, scope: !906, inlinedAt: !910)
!923 = !DILocation(line: 145, column: 12, scope: !921, inlinedAt: !910)
!924 = !DILocation(line: 145, column: 18, scope: !921, inlinedAt: !910)
!925 = !DILocation(line: 148, column: 21, scope: !906, inlinedAt: !910)
!926 = !DILocation(line: 148, column: 18, scope: !906, inlinedAt: !910)
!927 = !DILocation(line: 152, column: 13, scope: !928, inlinedAt: !910)
!928 = distinct !DILexicalBlock(scope: !906, file: !3, line: 149, column: 5)
!929 = !DILocation(line: 153, column: 11, scope: !928, inlinedAt: !910)
!930 = !DILocation(line: 148, column: 10, scope: !906, inlinedAt: !910)
!931 = distinct !{!931, !916, !932, !554}
!932 = !DILocation(line: 154, column: 5, scope: !906, inlinedAt: !910)
!933 = !DILocation(line: 155, column: 24, scope: !906, inlinedAt: !910)
!934 = !DILocation(line: 289, column: 27, scope: !904)
!935 = !DILocation(line: 289, column: 9, scope: !904)
!936 = !DILocation(line: 292, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !904, file: !3, line: 291, column: 9)
!938 = !DILocation(line: 293, column: 29, scope: !937)
!939 = !DILocation(line: 294, column: 27, scope: !937)
!940 = !DILocation(line: 298, column: 10, scope: !941)
!941 = distinct !DILexicalBlock(scope: !942, file: !3, line: 298, column: 3)
!942 = distinct !DILexicalBlock(scope: !708, file: !3, line: 298, column: 3)
!943 = !DILocation(line: 298, column: 17, scope: !941)
!944 = !DILocation(line: 298, column: 3, scope: !942)
!945 = !DILocation(line: 299, column: 25, scope: !941)
!946 = !DILocalVariable(name: "fname", arg: 1, scope: !947, file: !3, line: 168, type: !51)
!947 = distinct !DISubprogram(name: "process_path", scope: !3, file: !3, line: 168, type: !948, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !950)
!948 = !DISubroutineType(types: !949)
!949 = !{!57, !51, !46}
!950 = !{!946, !951, !952}
!951 = !DILocalVariable(name: "can_mode", arg: 2, scope: !947, file: !3, line: 168, type: !46)
!952 = !DILocalVariable(name: "can_fname", scope: !947, file: !3, line: 170, type: !43)
!953 = !DILocation(line: 0, scope: !947, inlinedAt: !954)
!954 = distinct !DILocation(line: 299, column: 11, scope: !941)
!955 = !DILocation(line: 0, scope: !785, inlinedAt: !956)
!956 = distinct !DILocation(line: 170, column: 21, scope: !947, inlinedAt: !954)
!957 = !DILocation(line: 118, column: 21, scope: !785, inlinedAt: !956)
!958 = !DILocation(line: 119, column: 7, scope: !793, inlinedAt: !956)
!959 = !DILocation(line: 119, column: 15, scope: !793, inlinedAt: !956)
!960 = !DILocation(line: 122, column: 26, scope: !792, inlinedAt: !956)
!961 = !DILocation(line: 0, scope: !792, inlinedAt: !956)
!962 = !DILocation(line: 123, column: 7, scope: !792, inlinedAt: !956)
!963 = !DILocation(line: 171, column: 8, scope: !964, inlinedAt: !954)
!964 = distinct !DILexicalBlock(scope: !947, file: !3, line: 171, column: 7)
!965 = !DILocation(line: 171, column: 7, scope: !947, inlinedAt: !954)
!966 = !DILocation(line: 173, column: 11, scope: !967, inlinedAt: !954)
!967 = distinct !DILexicalBlock(scope: !968, file: !3, line: 173, column: 11)
!968 = distinct !DILexicalBlock(scope: !964, file: !3, line: 172, column: 5)
!969 = !DILocation(line: 173, column: 11, scope: !968, inlinedAt: !954)
!970 = !DILocation(line: 174, column: 9, scope: !967, inlinedAt: !954)
!971 = !DILocation(line: 178, column: 8, scope: !972, inlinedAt: !954)
!972 = distinct !DILexicalBlock(scope: !947, file: !3, line: 178, column: 7)
!973 = !DILocation(line: 179, column: 7, scope: !972, inlinedAt: !954)
!974 = !DILocation(line: 179, column: 11, scope: !972, inlinedAt: !954)
!975 = !DILocation(line: 179, column: 29, scope: !972, inlinedAt: !954)
!976 = !DILocation(line: 0, scope: !906, inlinedAt: !977)
!977 = distinct !DILocation(line: 179, column: 33, scope: !972, inlinedAt: !954)
!978 = !DILocation(line: 135, column: 9, scope: !906, inlinedAt: !977)
!979 = !DILocation(line: 136, column: 7, scope: !906, inlinedAt: !977)
!980 = !DILocation(line: 140, column: 8, scope: !914, inlinedAt: !977)
!981 = !DILocation(line: 140, column: 7, scope: !906, inlinedAt: !977)
!982 = !DILocation(line: 148, column: 3, scope: !906, inlinedAt: !977)
!983 = !DILocation(line: 141, column: 12, scope: !914, inlinedAt: !977)
!984 = !DILocation(line: 141, column: 18, scope: !914, inlinedAt: !977)
!985 = !DILocation(line: 180, column: 7, scope: !972, inlinedAt: !954)
!986 = !DILocation(line: 144, column: 26, scope: !921, inlinedAt: !977)
!987 = !DILocation(line: 144, column: 7, scope: !906, inlinedAt: !977)
!988 = !DILocation(line: 145, column: 12, scope: !921, inlinedAt: !977)
!989 = !DILocation(line: 145, column: 18, scope: !921, inlinedAt: !977)
!990 = !DILocation(line: 148, column: 21, scope: !906, inlinedAt: !977)
!991 = !DILocation(line: 148, column: 18, scope: !906, inlinedAt: !977)
!992 = !DILocation(line: 152, column: 13, scope: !928, inlinedAt: !977)
!993 = !DILocation(line: 153, column: 11, scope: !928, inlinedAt: !977)
!994 = !DILocation(line: 148, column: 10, scope: !906, inlinedAt: !977)
!995 = distinct !{!995, !982, !996, !554}
!996 = !DILocation(line: 154, column: 5, scope: !906, inlinedAt: !977)
!997 = !DILocation(line: 155, column: 24, scope: !906, inlinedAt: !977)
!998 = !DILocation(line: 180, column: 31, scope: !972, inlinedAt: !954)
!999 = !DILocation(line: 178, column: 7, scope: !947, inlinedAt: !954)
!1000 = !DILocation(line: 181, column: 5, scope: !972, inlinedAt: !954)
!1001 = !DILocation(line: 183, column: 3, scope: !947, inlinedAt: !954)
!1002 = !DILocalVariable(name: "__c", arg: 1, scope: !1003, file: !1004, line: 108, type: !46)
!1003 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1004, file: !1004, line: 108, type: !1005, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1007)
!1004 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!46, !46}
!1007 = !{!1002}
!1008 = !DILocation(line: 0, scope: !1003, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 183, column: 3, scope: !947, inlinedAt: !954)
!1010 = !DILocation(line: 110, column: 10, scope: !1003, inlinedAt: !1009)
!1011 = !{!1012, !493, i64 40}
!1012 = !{!"_IO_FILE", !589, i64 0, !493, i64 8, !493, i64 16, !493, i64 24, !493, i64 32, !493, i64 40, !493, i64 48, !493, i64 56, !493, i64 64, !493, i64 72, !493, i64 80, !493, i64 88, !493, i64 96, !493, i64 104, !589, i64 112, !589, i64 116, !864, i64 120, !623, i64 128, !494, i64 130, !494, i64 131, !493, i64 136, !864, i64 144, !493, i64 152, !493, i64 160, !493, i64 168, !493, i64 176, !864, i64 184, !589, i64 192, !494, i64 196}
!1013 = !{!1012, !493, i64 48}
!1014 = !{!"branch_weights", i32 2000, i32 1}
!1015 = !DILocation(line: 185, column: 3, scope: !947, inlinedAt: !954)
!1016 = !DILocation(line: 187, column: 7, scope: !1017, inlinedAt: !954)
!1017 = distinct !DILexicalBlock(scope: !947, file: !3, line: 187, column: 7)
!1018 = !DILocalVariable(name: "__stream", arg: 1, scope: !1019, file: !1004, line: 135, type: !89)
!1019 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1004, file: !1004, line: 135, type: !1020, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1022)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!46, !89}
!1022 = !{!1018}
!1023 = !DILocation(line: 0, scope: !1019, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 187, column: 7, scope: !1017, inlinedAt: !954)
!1025 = !DILocation(line: 137, column: 10, scope: !1019, inlinedAt: !1024)
!1026 = !{!1012, !589, i64 0}
!1027 = !DILocation(line: 187, column: 7, scope: !947, inlinedAt: !954)
!1028 = !DILocation(line: 948, column: 21, scope: !1029, inlinedAt: !1032)
!1029 = distinct !DISubprogram(name: "write_error", scope: !67, file: !67, line: 946, type: !218, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1030)
!1030 = !{!1031}
!1031 = !DILocalVariable(name: "saved_errno", scope: !1029, file: !67, line: 948, type: !46)
!1032 = distinct !DILocation(line: 188, column: 5, scope: !1017, inlinedAt: !954)
!1033 = !DILocation(line: 0, scope: !1029, inlinedAt: !1032)
!1034 = !DILocation(line: 949, column: 3, scope: !1029, inlinedAt: !1032)
!1035 = !DILocation(line: 950, column: 11, scope: !1029, inlinedAt: !1032)
!1036 = !DILocation(line: 950, column: 3, scope: !1029, inlinedAt: !1032)
!1037 = !DILocation(line: 951, column: 3, scope: !1029, inlinedAt: !1032)
!1038 = !DILocation(line: 952, column: 3, scope: !1029, inlinedAt: !1032)
!1039 = !DILocation(line: 191, column: 1, scope: !947, inlinedAt: !954)
!1040 = !DILocation(line: 299, column: 8, scope: !941)
!1041 = !DILocation(line: 298, column: 25, scope: !941)
!1042 = distinct !{!1042, !944, !1043, !554}
!1043 = !DILocation(line: 299, column: 47, scope: !942)
!1044 = !DILocation(line: 301, column: 10, scope: !708)
!1045 = !DILocation(line: 302, column: 1, scope: !708)
!1046 = !DISubprogram(name: "bindtextdomain", scope: !577, file: !577, line: 86, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!43, !51, !51}
!1049 = !DISubprogram(name: "textdomain", scope: !577, file: !577, line: 82, type: !700, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1050 = !DISubprogram(name: "atexit", scope: !699, file: !699, line: 602, type: !1051, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!46, !217}
!1053 = !DISubprogram(name: "getopt_long", scope: !155, file: !155, line: 66, type: !1054, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!46, !46, !1056, !51, !1058, !160}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!1059 = !DISubprogram(name: "stat", scope: !1060, file: !1060, line: 205, type: !1061, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1060 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!46, !584, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!1065 = !DISubprogram(name: "fflush_unlocked", scope: !191, file: !191, line: 239, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1066 = !DISubprogram(name: "clearerr_unlocked", scope: !191, file: !191, line: 794, type: !1067, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !580)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{null, !89}
!1069 = distinct !DISubprogram(name: "relpath", scope: !385, file: !385, line: 88, type: !1070, scopeLine: 89, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1072)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!57, !51, !51, !43, !48}
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080}
!1073 = !DILocalVariable(name: "can_fname", arg: 1, scope: !1069, file: !385, line: 88, type: !51)
!1074 = !DILocalVariable(name: "can_reldir", arg: 2, scope: !1069, file: !385, line: 88, type: !51)
!1075 = !DILocalVariable(name: "buf", arg: 3, scope: !1069, file: !385, line: 88, type: !43)
!1076 = !DILocalVariable(name: "len", arg: 4, scope: !1069, file: !385, line: 88, type: !48)
!1077 = !DILocalVariable(name: "buf_err", scope: !1069, file: !385, line: 90, type: !57)
!1078 = !DILocalVariable(name: "common_index", scope: !1069, file: !385, line: 93, type: !46)
!1079 = !DILocalVariable(name: "relto_suffix", scope: !1069, file: !385, line: 97, type: !51)
!1080 = !DILocalVariable(name: "fname_suffix", scope: !1069, file: !385, line: 98, type: !51)
!1081 = !DILocation(line: 0, scope: !1069)
!1082 = !DILocalVariable(name: "path1", arg: 1, scope: !1083, file: !385, line: 30, type: !51)
!1083 = distinct !DISubprogram(name: "path_common_prefix", scope: !385, file: !385, line: 30, type: !1084, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1086)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!46, !51, !51}
!1086 = !{!1082, !1087, !1088, !1089}
!1087 = !DILocalVariable(name: "path2", arg: 2, scope: !1083, file: !385, line: 30, type: !51)
!1088 = !DILocalVariable(name: "i", scope: !1083, file: !385, line: 32, type: !46)
!1089 = !DILocalVariable(name: "ret", scope: !1083, file: !385, line: 33, type: !46)
!1090 = !DILocation(line: 0, scope: !1083, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 93, column: 22, scope: !1069)
!1092 = !DILocation(line: 38, column: 8, scope: !1093, inlinedAt: !1091)
!1093 = distinct !DILexicalBlock(scope: !1083, file: !385, line: 38, column: 7)
!1094 = !DILocation(line: 38, column: 17, scope: !1093, inlinedAt: !1091)
!1095 = !DILocation(line: 38, column: 29, scope: !1093, inlinedAt: !1091)
!1096 = !DILocation(line: 38, column: 38, scope: !1093, inlinedAt: !1091)
!1097 = !DILocation(line: 38, column: 25, scope: !1093, inlinedAt: !1091)
!1098 = !DILocation(line: 38, column: 7, scope: !1083, inlinedAt: !1091)
!1099 = !DILocation(line: 41, column: 10, scope: !1083, inlinedAt: !1091)
!1100 = !DILocation(line: 41, column: 17, scope: !1083, inlinedAt: !1091)
!1101 = !DILocation(line: 41, column: 20, scope: !1083, inlinedAt: !1091)
!1102 = !DILocation(line: 41, column: 3, scope: !1083, inlinedAt: !1091)
!1103 = !DILocation(line: 45, column: 18, scope: !1104, inlinedAt: !1091)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !385, line: 45, column: 11)
!1105 = distinct !DILexicalBlock(scope: !1083, file: !385, line: 42, column: 5)
!1106 = !DILocation(line: 45, column: 11, scope: !1105, inlinedAt: !1091)
!1107 = !DILocation(line: 47, column: 12, scope: !1105, inlinedAt: !1091)
!1108 = !DILocation(line: 48, column: 12, scope: !1105, inlinedAt: !1091)
!1109 = distinct !{!1109, !1102, !1110, !554}
!1110 = !DILocation(line: 50, column: 5, scope: !1083, inlinedAt: !1091)
!1111 = !DILocation(line: 52, column: 20, scope: !1112, inlinedAt: !1091)
!1112 = distinct !DILexicalBlock(scope: !1083, file: !385, line: 52, column: 7)
!1113 = !DILocation(line: 53, column: 7, scope: !1112, inlinedAt: !1091)
!1114 = !DILocation(line: 54, column: 12, scope: !1112, inlinedAt: !1091)
!1115 = !DILocation(line: 54, column: 19, scope: !1112, inlinedAt: !1091)
!1116 = !DILocation(line: 55, column: 5, scope: !1112, inlinedAt: !1091)
!1117 = !DILocation(line: 94, column: 8, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1069, file: !385, line: 94, column: 7)
!1119 = !DILocation(line: 94, column: 7, scope: !1069)
!1120 = !DILocation(line: 97, column: 41, scope: !1069)
!1121 = !DILocation(line: 98, column: 40, scope: !1069)
!1122 = !DILocation(line: 101, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1069, file: !385, line: 101, column: 7)
!1124 = !DILocation(line: 101, column: 21, scope: !1123)
!1125 = !DILocation(line: 101, column: 7, scope: !1069)
!1126 = !DILocation(line: 103, column: 7, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1069, file: !385, line: 103, column: 7)
!1128 = !DILocation(line: 103, column: 21, scope: !1127)
!1129 = !DILocation(line: 103, column: 7, scope: !1069)
!1130 = !DILocation(line: 108, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1069, file: !385, line: 108, column: 7)
!1132 = !DILocation(line: 108, column: 7, scope: !1069)
!1133 = !DILocalVariable(name: "str", arg: 1, scope: !1134, file: !385, line: 66, type: !51)
!1134 = distinct !DISubprogram(name: "buffer_or_output", scope: !385, file: !385, line: 66, type: !1135, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1137)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!57, !51, !711, !423}
!1137 = !{!1133, !1138, !1139, !1140}
!1138 = !DILocalVariable(name: "pbuf", arg: 2, scope: !1134, file: !385, line: 66, type: !711)
!1139 = !DILocalVariable(name: "plen", arg: 3, scope: !1134, file: !385, line: 66, type: !423)
!1140 = !DILocalVariable(name: "slen", scope: !1141, file: !385, line: 70, type: !48)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !385, line: 69, column: 5)
!1142 = distinct !DILexicalBlock(scope: !1134, file: !385, line: 68, column: 7)
!1143 = !DILocation(line: 0, scope: !1134, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 110, column: 18, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1131, file: !385, line: 109, column: 5)
!1146 = !DILocation(line: 68, column: 7, scope: !1142, inlinedAt: !1144)
!1147 = !DILocation(line: 68, column: 7, scope: !1134, inlinedAt: !1144)
!1148 = !DILocation(line: 0, scope: !1141, inlinedAt: !1144)
!1149 = !DILocation(line: 71, column: 16, scope: !1150, inlinedAt: !1144)
!1150 = distinct !DILexicalBlock(scope: !1141, file: !385, line: 71, column: 11)
!1151 = !DILocation(line: 71, column: 11, scope: !1141, inlinedAt: !1144)
!1152 = !DILocalVariable(name: "__dest", arg: 1, scope: !1153, file: !1154, line: 26, type: !1157)
!1153 = distinct !DISubprogram(name: "memcpy", scope: !1154, file: !1154, line: 26, type: !1155, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1158)
!1154 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!45, !1157, !705, !48}
!1157 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!1158 = !{!1152, !1159, !1160}
!1159 = !DILocalVariable(name: "__src", arg: 2, scope: !1153, file: !1154, line: 26, type: !705)
!1160 = !DILocalVariable(name: "__len", arg: 3, scope: !1153, file: !1154, line: 26, type: !48)
!1161 = !DILocation(line: 0, scope: !1153, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 73, column: 7, scope: !1141, inlinedAt: !1144)
!1163 = !DILocation(line: 29, column: 10, scope: !1153, inlinedAt: !1162)
!1164 = !DILocation(line: 74, column: 13, scope: !1141, inlinedAt: !1144)
!1165 = !DILocation(line: 75, column: 13, scope: !1141, inlinedAt: !1144)
!1166 = !DILocation(line: 79, column: 7, scope: !1167, inlinedAt: !1144)
!1167 = distinct !DILexicalBlock(scope: !1142, file: !385, line: 78, column: 5)
!1168 = !DILocation(line: 110, column: 15, scope: !1145)
!1169 = !DILocation(line: 111, column: 7, scope: !1145)
!1170 = !DILocation(line: 0, scope: !1145)
!1171 = !DILocation(line: 111, column: 14, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !385, line: 111, column: 7)
!1173 = distinct !DILexicalBlock(scope: !1145, file: !385, line: 111, column: 7)
!1174 = !DILocation(line: 111, column: 7, scope: !1173)
!1175 = !DILocation(line: 0, scope: !1134, inlinedAt: !1176)
!1176 = distinct !DILocation(line: 114, column: 24, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !385, line: 113, column: 15)
!1178 = distinct !DILexicalBlock(scope: !1172, file: !385, line: 112, column: 9)
!1179 = !DILocation(line: 68, column: 7, scope: !1142, inlinedAt: !1176)
!1180 = !DILocation(line: 68, column: 7, scope: !1134, inlinedAt: !1176)
!1181 = !DILocation(line: 0, scope: !1141, inlinedAt: !1176)
!1182 = !DILocation(line: 71, column: 16, scope: !1150, inlinedAt: !1176)
!1183 = !DILocation(line: 71, column: 11, scope: !1141, inlinedAt: !1176)
!1184 = !DILocation(line: 0, scope: !1153, inlinedAt: !1185)
!1185 = distinct !DILocation(line: 73, column: 7, scope: !1141, inlinedAt: !1176)
!1186 = !DILocation(line: 29, column: 10, scope: !1153, inlinedAt: !1185)
!1187 = !DILocation(line: 74, column: 13, scope: !1141, inlinedAt: !1176)
!1188 = !DILocation(line: 75, column: 13, scope: !1141, inlinedAt: !1176)
!1189 = !DILocation(line: 79, column: 7, scope: !1167, inlinedAt: !1176)
!1190 = !DILocation(line: 114, column: 24, scope: !1177)
!1191 = !DILocation(line: 114, column: 21, scope: !1177)
!1192 = !DILocation(line: 114, column: 13, scope: !1177)
!1193 = !DILocation(line: 111, column: 29, scope: !1172)
!1194 = !DILocation(line: 111, column: 7, scope: !1172)
!1195 = distinct !{!1195, !1174, !1196, !554}
!1196 = !DILocation(line: 115, column: 9, scope: !1173)
!1197 = !DILocation(line: 117, column: 11, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1145, file: !385, line: 117, column: 11)
!1199 = !DILocation(line: 117, column: 11, scope: !1145)
