; ModuleID = 'src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1
@.str.2 = private unnamed_addr constant [48 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A\00", align 1

!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256)
!24 = !DIEnumerator(name: "_ISlower", value: 512)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!28 = !DIEnumerator(name: "_ISspace", value: 8192)
!29 = !DIEnumerator(name: "_ISprint", value: 16384)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768)
!31 = !DIEnumerator(name: "_ISblank", value: 1)
!32 = !DIEnumerator(name: "_IScntrl", value: 2)
!33 = !DIEnumerator(name: "_ISpunct", value: 4)
!34 = !DIEnumerator(name: "_ISalnum", value: 8)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 299, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!40 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!41 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!42 = !{!43, !45, !37, !46, !47, !50, !52}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!49 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{!54, !57, !59, !61, !0}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !2, file: !3, line: 40, type: !56, isLocal: true, isDefinition: true)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !2, file: !3, line: 44, type: !56, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 47, type: !56, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !63, file: !36, line: 575, type: !37, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "oputs_", scope: !36, file: !36, line: 573, type: !64, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !50, !50}
!66 = !{!67, !68, !69, !72, !73, !74, !75, !79, !80, !81, !82, !84, !140, !141, !142, !144, !145}
!67 = !DILocalVariable(name: "program", arg: 1, scope: !63, file: !36, line: 573, type: !50)
!68 = !DILocalVariable(name: "option", arg: 2, scope: !63, file: !36, line: 573, type: !50)
!69 = !DILocalVariable(name: "term", scope: !70, file: !36, line: 585, type: !50)
!70 = distinct !DILexicalBlock(scope: !71, file: !36, line: 582, column: 5)
!71 = distinct !DILexicalBlock(scope: !63, file: !36, line: 581, column: 7)
!72 = !DILocalVariable(name: "double_space", scope: !63, file: !36, line: 594, type: !56)
!73 = !DILocalVariable(name: "first_word", scope: !63, file: !36, line: 595, type: !50)
!74 = !DILocalVariable(name: "option_text", scope: !63, file: !36, line: 596, type: !50)
!75 = !DILocalVariable(name: "s", scope: !76, file: !36, line: 608, type: !50)
!76 = distinct !DILexicalBlock(scope: !77, file: !36, line: 605, column: 5)
!77 = distinct !DILexicalBlock(scope: !78, file: !36, line: 604, column: 12)
!78 = distinct !DILexicalBlock(scope: !63, file: !36, line: 597, column: 7)
!79 = !DILocalVariable(name: "spaces", scope: !76, file: !36, line: 609, type: !47)
!80 = !DILocalVariable(name: "anchor_len", scope: !63, file: !36, line: 620, type: !47)
!81 = !DILocalVariable(name: "desc_text", scope: !63, file: !36, line: 625, type: !50)
!82 = !DILocalVariable(name: "__ptr", scope: !83, file: !36, line: 644, type: !50)
!83 = distinct !DILexicalBlock(scope: !63, file: !36, line: 644, column: 3)
!84 = !DILocalVariable(name: "__stream", scope: !83, file: !36, line: 644, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !88)
!87 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !90)
!89 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !106, !108, !109, !110, !114, !115, !117, !121, !124, !126, !129, !132, !133, !134, !135, !136}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 51, baseType: !37, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 54, baseType: !43, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 55, baseType: !43, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 56, baseType: !43, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 57, baseType: !43, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 58, baseType: !43, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 59, baseType: !43, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 60, baseType: !43, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 61, baseType: !43, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 64, baseType: !43, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 65, baseType: !43, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 66, baseType: !43, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 68, baseType: !104, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 36, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 70, baseType: !107, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 72, baseType: !37, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 73, baseType: !37, size: 32, offset: 928)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 74, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 77, baseType: !46, size: 16, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 78, baseType: !116, size: 8, offset: 1040)
!116 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 79, baseType: !118, size: 8, offset: 1048)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 81, baseType: !122, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 43, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 89, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !112, line: 153, baseType: !113)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !88, file: !89, line: 91, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !89, line: 37, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !88, file: !89, line: 92, baseType: !130, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !89, line: 38, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !88, file: !89, line: 93, baseType: !107, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !88, file: !89, line: 94, baseType: !45, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 95, baseType: !47, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 96, baseType: !37, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocalVariable(name: "__cnt", scope: !83, file: !36, line: 644, type: !47)
!141 = !DILocalVariable(name: "url_program", scope: !63, file: !36, line: 648, type: !50)
!142 = !DILocalVariable(name: "__ptr", scope: !143, file: !36, line: 686, type: !50)
!143 = distinct !DILexicalBlock(scope: !63, file: !36, line: 686, column: 3)
!144 = !DILocalVariable(name: "__stream", scope: !143, file: !36, line: 686, type: !85)
!145 = !DILocalVariable(name: "__cnt", scope: !143, file: !36, line: 686, type: !47)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 1792, elements: !156)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !149, line: 50, size: 256, elements: !150)
!149 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!150 = !{!151, !152, !153, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 52, baseType: !50, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !148, file: !149, line: 55, baseType: !37, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !149, line: 56, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !148, file: !149, line: 57, baseType: !37, size: 32, offset: 192)
!156 = !{!157}
!157 = !DISubrange(count: 7)
!158 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!159 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!160 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "Version", scope: !163, file: !164, line: 3, type: !50, isLocal: false, isDefinition: true)
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !165, splitDebugInlining: false, nameTableKind: None)
!164 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!165 = !{!161}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "file_name", scope: !168, file: !169, line: 45, type: !50, isLocal: true, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!170 = !{!166, !171}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !168, file: !169, line: 55, type: !56, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !175, file: !176, line: 66, type: !211, isLocal: false, isDefinition: true)
!175 = distinct !DICompileUnit(language: DW_LANG_C99, file: !176, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !177, globals: !178, splitDebugInlining: false, nameTableKind: None)
!176 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!177 = !{!45, !52}
!178 = !{!179, !205, !173, !207, !209}
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "old_file_name", scope: !181, file: !176, line: 304, type: !50, isLocal: true, isDefinition: true)
!181 = distinct !DISubprogram(name: "verror_at_line", scope: !176, file: !176, line: 298, type: !182, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !175, retainedNodes: !198)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !37, !37, !50, !7, !50, !184}
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !185, line: 52, baseType: !186)
!185 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !187, line: 32, baseType: !188)
!187 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !189, baseType: !190)
!189 = !DIFile(filename: "lib/error.c", directory: "/src")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !191, size: 256, elements: !192)
!191 = !DINamespace(name: "std", scope: null)
!192 = !{!193, !194, !195, !196, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !190, file: !189, baseType: !45, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !190, file: !189, baseType: !45, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !190, file: !189, baseType: !45, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !190, file: !189, baseType: !37, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !190, file: !189, baseType: !37, size: 32, offset: 224)
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DILocalVariable(name: "status", arg: 1, scope: !181, file: !176, line: 298, type: !37)
!200 = !DILocalVariable(name: "errnum", arg: 2, scope: !181, file: !176, line: 298, type: !37)
!201 = !DILocalVariable(name: "file_name", arg: 3, scope: !181, file: !176, line: 298, type: !50)
!202 = !DILocalVariable(name: "line_number", arg: 4, scope: !181, file: !176, line: 298, type: !7)
!203 = !DILocalVariable(name: "message", arg: 5, scope: !181, file: !176, line: 298, type: !50)
!204 = !DILocalVariable(name: "args", arg: 6, scope: !181, file: !176, line: 298, type: !184)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "old_line_number", scope: !181, file: !176, line: 305, type: !7, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "error_message_count", scope: !175, file: !176, line: 69, type: !7, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !175, file: !176, line: 295, type: !37, isLocal: false, isDefinition: true)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "program_name", scope: !216, file: !217, line: 31, type: !50, isLocal: false, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !218, globals: !219, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!218 = !{!43}
!219 = !{!214}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "utf07FF", scope: !222, file: !223, line: 46, type: !253, isLocal: true, isDefinition: true)
!222 = distinct !DISubprogram(name: "proper_name_lite", scope: !223, file: !223, line: 38, type: !224, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !228)
!223 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!224 = !DISubroutineType(types: !225)
!225 = !{!50, !50, !50}
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !227, splitDebugInlining: false, nameTableKind: None)
!227 = !{!220}
!228 = !{!229, !230, !231, !232, !237}
!229 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !222, file: !223, line: 38, type: !50)
!230 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !222, file: !223, line: 38, type: !50)
!231 = !DILocalVariable(name: "translation", scope: !222, file: !223, line: 40, type: !50)
!232 = !DILocalVariable(name: "w", scope: !222, file: !223, line: 47, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !234, line: 37, baseType: !235)
!234 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !112, line: 57, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !112, line: 42, baseType: !7)
!237 = !DILocalVariable(name: "mbs", scope: !222, file: !223, line: 48, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !239, line: 6, baseType: !240)
!239 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !241, line: 21, baseType: !242)
!241 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 13, size: 64, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !242, file: !241, line: 15, baseType: !37, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !242, file: !241, line: 20, baseType: !246, size: 32, offset: 32)
!246 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !241, line: 16, size: 32, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !246, file: !241, line: 18, baseType: !7, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !246, file: !241, line: 19, baseType: !250, size: 32)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 4)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 16, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 2)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !258, file: !259, line: 76, type: !327, isLocal: false, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !260, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!260 = !{!5, !261, !20}
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!264 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!265 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!266 = !{!37, !46, !47}
!267 = !{!256, !268, !274, !286, !288, !293, !316, !323, !325}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !258, file: !259, line: 92, type: !270, isLocal: false, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 320, elements: !272)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!272 = !{!273}
!273 = !DISubrange(count: 10)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !258, file: !259, line: 1040, type: !276, isLocal: false, isDefinition: true)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !259, line: 56, size: 448, elements: !277)
!277 = !{!278, !279, !280, !284, !285}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !276, file: !259, line: 59, baseType: !5, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !259, line: 62, baseType: !37, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !276, file: !259, line: 66, baseType: !281, size: 256, offset: 64)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !276, file: !259, line: 69, baseType: !50, size: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !276, file: !259, line: 72, baseType: !50, size: 64, offset: 384)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !258, file: !259, line: 107, type: !276, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "slot0", scope: !258, file: !259, line: 831, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2048, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 256)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "quote", scope: !295, file: !259, line: 228, type: !314, isLocal: true, isDefinition: true)
!295 = distinct !DISubprogram(name: "gettext_quote", scope: !259, file: !259, line: 197, type: !296, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !258, retainedNodes: !298)
!296 = !DISubroutineType(types: !297)
!297 = !{!50, !50, !5}
!298 = !{!299, !300, !301, !302, !303}
!299 = !DILocalVariable(name: "msgid", arg: 1, scope: !295, file: !259, line: 197, type: !50)
!300 = !DILocalVariable(name: "s", arg: 2, scope: !295, file: !259, line: 197, type: !5)
!301 = !DILocalVariable(name: "translation", scope: !295, file: !259, line: 199, type: !50)
!302 = !DILocalVariable(name: "w", scope: !295, file: !259, line: 229, type: !233)
!303 = !DILocalVariable(name: "mbs", scope: !295, file: !259, line: 230, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !239, line: 6, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !241, line: 21, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 13, size: 64, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !306, file: !241, line: 15, baseType: !37, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !306, file: !241, line: 20, baseType: !310, size: 32, offset: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !306, file: !241, line: 16, size: 32, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !310, file: !241, line: 18, baseType: !7, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !310, file: !241, line: 19, baseType: !250, size: 32)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !315)
!315 = !{!255, !252}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "slotvec", scope: !258, file: !259, line: 834, type: !318, isLocal: true, isDefinition: true)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !259, line: 823, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !319, file: !259, line: 825, baseType: !47, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !319, file: !259, line: 826, baseType: !43, size: 64, offset: 64)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "nslots", scope: !258, file: !259, line: 832, type: !37, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "slotvec0", scope: !258, file: !259, line: 833, type: !319, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 704, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!329 = !{!330}
!330 = !DISubrange(count: 11)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !333, file: !334, line: 26, type: !336, isLocal: false, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !335, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!335 = !{!331}
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 47)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "exit_failure", scope: !341, file: !342, line: 24, type: !344, isLocal: false, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!343 = !{!339}
!344 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "internal_state", scope: !347, file: !348, line: 97, type: !351, isLocal: true, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !349, globals: !350, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!349 = !{!45, !47, !52}
!350 = !{!345}
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !239, line: 6, baseType: !352)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !241, line: 21, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 13, size: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !353, file: !241, line: 15, baseType: !37, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !353, file: !241, line: 20, baseType: !357, size: 32, offset: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !353, file: !241, line: 16, size: 32, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !357, file: !241, line: 18, baseType: !7, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !357, file: !241, line: 19, baseType: !250, size: 32)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!363 = !{!52}
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !370, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!370 = !{!371}
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 40, baseType: !7, size: 32, elements: !372)
!372 = !{!373}
!373 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!374 = !{!45}
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !377, retainedTypes: !408, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!377 = !{!378, !390}
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !379, file: !376, line: 188, baseType: !7, size: 32, elements: !388)
!379 = distinct !DISubprogram(name: "x2nrealloc", scope: !376, file: !376, line: 176, type: !380, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !383)
!380 = !DISubroutineType(types: !381)
!381 = !{!45, !45, !382, !47}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!383 = !{!384, !385, !386, !387}
!384 = !DILocalVariable(name: "p", arg: 1, scope: !379, file: !376, line: 176, type: !45)
!385 = !DILocalVariable(name: "pn", arg: 2, scope: !379, file: !376, line: 176, type: !382)
!386 = !DILocalVariable(name: "s", arg: 3, scope: !379, file: !376, line: 176, type: !47)
!387 = !DILocalVariable(name: "n", scope: !379, file: !376, line: 178, type: !47)
!388 = !{!389}
!389 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !391, file: !376, line: 228, baseType: !7, size: 32, elements: !388)
!391 = distinct !DISubprogram(name: "xpalloc", scope: !376, file: !376, line: 223, type: !392, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !375, retainedNodes: !398)
!392 = !DISubroutineType(types: !393)
!393 = !{!45, !45, !394, !395, !397, !395}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !396, line: 130, baseType: !397)
!396 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !48, line: 35, baseType: !113)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407}
!399 = !DILocalVariable(name: "pa", arg: 1, scope: !391, file: !376, line: 223, type: !45)
!400 = !DILocalVariable(name: "pn", arg: 2, scope: !391, file: !376, line: 223, type: !394)
!401 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !391, file: !376, line: 223, type: !395)
!402 = !DILocalVariable(name: "n_max", arg: 4, scope: !391, file: !376, line: 223, type: !397)
!403 = !DILocalVariable(name: "s", arg: 5, scope: !391, file: !376, line: 223, type: !395)
!404 = !DILocalVariable(name: "n0", scope: !391, file: !376, line: 230, type: !395)
!405 = !DILocalVariable(name: "n", scope: !391, file: !376, line: 237, type: !395)
!406 = !DILocalVariable(name: "nbytes", scope: !391, file: !376, line: 248, type: !395)
!407 = !DILocalVariable(name: "adjusted_nbytes", scope: !391, file: !376, line: 252, type: !395)
!408 = !{!43, !45, !56, !113, !49}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !218, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !423, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!423 = !{!56, !49, !45}
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !429, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !374, splitDebugInlining: false, nameTableKind: None)
!429 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!430 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!431 = !{i32 7, !"Dwarf Version", i32 5}
!432 = !{i32 2, !"Debug Info Version", i32 3}
!433 = !{i32 1, !"wchar_size", i32 4}
!434 = !{i32 1, !"branch-target-enforcement", i32 0}
!435 = !{i32 1, !"sign-return-address", i32 0}
!436 = !{i32 1, !"sign-return-address-all", i32 0}
!437 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!438 = !{i32 7, !"PIC Level", i32 2}
!439 = !{i32 7, !"PIE Level", i32 2}
!440 = !{i32 7, !"uwtable", i32 1}
!441 = !{i32 7, !"frame-pointer", i32 1}
!442 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 166, type: !443, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !445)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !37}
!445 = !{!446}
!446 = !DILocalVariable(name: "status", arg: 1, scope: !442, file: !3, line: 166, type: !37)
!447 = !DILocation(line: 0, scope: !442)
!448 = !DILocation(line: 168, column: 14, scope: !449)
!449 = distinct !DILexicalBlock(scope: !442, file: !3, line: 168, column: 7)
!450 = !DILocation(line: 168, column: 7, scope: !442)
!451 = !DILocation(line: 169, column: 5, scope: !452)
!452 = distinct !DILexicalBlock(scope: !449, file: !3, line: 169, column: 5)
!453 = !{!454, !454, i64 0}
!454 = !{!"any pointer", !455, i64 0}
!455 = !{!"omnipotent char", !456, i64 0}
!456 = !{!"Simple C/C++ TBAA"}
!457 = !DILocation(line: 172, column: 7, scope: !458)
!458 = distinct !DILexicalBlock(scope: !449, file: !3, line: 171, column: 5)
!459 = !DILocation(line: 173, column: 7, scope: !458)
!460 = !DILocation(line: 177, column: 7, scope: !458)
!461 = !DILocation(line: 181, column: 7, scope: !458)
!462 = !DILocation(line: 186, column: 7, scope: !458)
!463 = !DILocation(line: 190, column: 7, scope: !458)
!464 = !DILocation(line: 191, column: 7, scope: !458)
!465 = !DILocalVariable(name: "program", arg: 1, scope: !466, file: !36, line: 836, type: !50)
!466 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !36, file: !36, line: 836, type: !467, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !469)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !50}
!469 = !{!465, !470, !477, !478, !480, !481}
!470 = !DILocalVariable(name: "infomap", scope: !466, file: !36, line: 838, type: !471)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 896, elements: !156)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !466, file: !36, line: 838, size: 128, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !473, file: !36, line: 838, baseType: !50, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !36, line: 838, baseType: !50, size: 64, offset: 64)
!477 = !DILocalVariable(name: "node", scope: !466, file: !36, line: 848, type: !50)
!478 = !DILocalVariable(name: "map_prog", scope: !466, file: !36, line: 849, type: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!480 = !DILocalVariable(name: "lc_messages", scope: !466, file: !36, line: 861, type: !50)
!481 = !DILocalVariable(name: "url_program", scope: !466, file: !36, line: 874, type: !50)
!482 = !DILocation(line: 0, scope: !466, inlinedAt: !483)
!483 = distinct !DILocation(line: 192, column: 7, scope: !458)
!484 = !DILocation(line: 838, column: 3, scope: !466, inlinedAt: !483)
!485 = !DILocation(line: 838, column: 67, scope: !466, inlinedAt: !483)
!486 = !DILocation(line: 849, column: 36, scope: !466, inlinedAt: !483)
!487 = !DILocation(line: 851, column: 3, scope: !466, inlinedAt: !483)
!488 = !DILocalVariable(name: "__s1", arg: 1, scope: !489, file: !490, line: 1359, type: !50)
!489 = distinct !DISubprogram(name: "streq", scope: !490, file: !490, line: 1359, type: !491, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !493)
!490 = !DIFile(filename: "./lib/string.h", directory: "/src")
!491 = !DISubroutineType(types: !492)
!492 = !{!56, !50, !50}
!493 = !{!488, !494}
!494 = !DILocalVariable(name: "__s2", arg: 2, scope: !489, file: !490, line: 1359, type: !50)
!495 = !DILocation(line: 0, scope: !489, inlinedAt: !496)
!496 = distinct !DILocation(line: 851, column: 33, scope: !466, inlinedAt: !483)
!497 = !DILocation(line: 1361, column: 11, scope: !489, inlinedAt: !496)
!498 = !DILocation(line: 1361, column: 10, scope: !489, inlinedAt: !496)
!499 = !DILocation(line: 852, column: 13, scope: !466, inlinedAt: !483)
!500 = !DILocation(line: 851, column: 20, scope: !466, inlinedAt: !483)
!501 = !{!502, !454, i64 0}
!502 = !{!"infomap", !454, i64 0, !454, i64 8}
!503 = !DILocation(line: 851, column: 10, scope: !466, inlinedAt: !483)
!504 = !DILocation(line: 851, column: 28, scope: !466, inlinedAt: !483)
!505 = distinct !{!505, !487, !499, !506}
!506 = !{!"llvm.loop.mustprogress"}
!507 = !DILocation(line: 854, column: 17, scope: !508, inlinedAt: !483)
!508 = distinct !DILexicalBlock(scope: !466, file: !36, line: 854, column: 7)
!509 = !{!502, !454, i64 8}
!510 = !DILocation(line: 854, column: 7, scope: !508, inlinedAt: !483)
!511 = !DILocation(line: 854, column: 7, scope: !466, inlinedAt: !483)
!512 = !DILocation(line: 857, column: 3, scope: !466, inlinedAt: !483)
!513 = !DILocation(line: 861, column: 29, scope: !466, inlinedAt: !483)
!514 = !DILocation(line: 862, column: 7, scope: !515, inlinedAt: !483)
!515 = distinct !DILexicalBlock(scope: !466, file: !36, line: 862, column: 7)
!516 = !DILocation(line: 862, column: 19, scope: !515, inlinedAt: !483)
!517 = !DILocation(line: 862, column: 22, scope: !515, inlinedAt: !483)
!518 = !DILocation(line: 862, column: 7, scope: !466, inlinedAt: !483)
!519 = !DILocation(line: 868, column: 7, scope: !520, inlinedAt: !483)
!520 = distinct !DILexicalBlock(scope: !515, file: !36, line: 863, column: 5)
!521 = !DILocation(line: 870, column: 5, scope: !520, inlinedAt: !483)
!522 = !DILocation(line: 0, scope: !489, inlinedAt: !523)
!523 = distinct !DILocation(line: 874, column: 29, scope: !466, inlinedAt: !483)
!524 = !DILocation(line: 875, column: 3, scope: !466, inlinedAt: !483)
!525 = !DILocation(line: 877, column: 3, scope: !466, inlinedAt: !483)
!526 = !DILocation(line: 879, column: 1, scope: !466, inlinedAt: !483)
!527 = !DILocation(line: 194, column: 3, scope: !442)
!528 = !DISubprogram(name: "dcgettext", scope: !529, file: !529, line: 51, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!529 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!530 = !DISubroutineType(types: !531)
!531 = !{!43, !50, !50, !37}
!532 = !{}
!533 = !DISubprogram(name: "fputs_unlocked", scope: !185, file: !185, line: 691, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!534 = !DISubroutineType(types: !535)
!535 = !{!37, !536, !537}
!536 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!537 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!538 = !DILocation(line: 0, scope: !63)
!539 = !DILocation(line: 581, column: 7, scope: !71)
!540 = !{!541, !541, i64 0}
!541 = !{!"int", !455, i64 0}
!542 = !DILocation(line: 581, column: 19, scope: !71)
!543 = !DILocation(line: 581, column: 7, scope: !63)
!544 = !DILocation(line: 585, column: 26, scope: !70)
!545 = !DILocation(line: 0, scope: !70)
!546 = !DILocation(line: 586, column: 23, scope: !70)
!547 = !DILocation(line: 586, column: 28, scope: !70)
!548 = !DILocation(line: 586, column: 32, scope: !70)
!549 = !{!455, !455, i64 0}
!550 = !DILocation(line: 586, column: 38, scope: !70)
!551 = !DILocation(line: 0, scope: !489, inlinedAt: !552)
!552 = distinct !DILocation(line: 586, column: 41, scope: !70)
!553 = !DILocation(line: 1361, column: 11, scope: !489, inlinedAt: !552)
!554 = !DILocation(line: 1361, column: 10, scope: !489, inlinedAt: !552)
!555 = !DILocation(line: 586, column: 19, scope: !70)
!556 = !DILocation(line: 587, column: 5, scope: !70)
!557 = !DILocation(line: 588, column: 7, scope: !558)
!558 = distinct !DILexicalBlock(scope: !63, file: !36, line: 588, column: 7)
!559 = !DILocation(line: 588, column: 7, scope: !63)
!560 = !DILocation(line: 590, column: 7, scope: !561)
!561 = distinct !DILexicalBlock(scope: !558, file: !36, line: 589, column: 5)
!562 = !DILocation(line: 591, column: 7, scope: !561)
!563 = !DILocation(line: 595, column: 37, scope: !63)
!564 = !DILocation(line: 595, column: 35, scope: !63)
!565 = !DILocation(line: 596, column: 29, scope: !63)
!566 = !DILocation(line: 597, column: 8, scope: !78)
!567 = !DILocation(line: 597, column: 7, scope: !63)
!568 = !DILocation(line: 604, column: 24, scope: !77)
!569 = !DILocation(line: 604, column: 12, scope: !78)
!570 = !DILocation(line: 0, scope: !76)
!571 = !DILocation(line: 610, column: 16, scope: !76)
!572 = !DILocation(line: 610, column: 7, scope: !76)
!573 = !DILocation(line: 611, column: 21, scope: !76)
!574 = !{!575, !575, i64 0}
!575 = !{!"short", !455, i64 0}
!576 = !DILocation(line: 611, column: 19, scope: !76)
!577 = !DILocation(line: 611, column: 16, scope: !76)
!578 = !DILocation(line: 610, column: 30, scope: !76)
!579 = distinct !{!579, !572, !573, !506}
!580 = !DILocation(line: 612, column: 18, scope: !581)
!581 = distinct !DILexicalBlock(scope: !76, file: !36, line: 612, column: 11)
!582 = !DILocation(line: 612, column: 11, scope: !76)
!583 = !DILocation(line: 620, column: 23, scope: !63)
!584 = !DILocation(line: 625, column: 39, scope: !63)
!585 = !DILocation(line: 626, column: 3, scope: !63)
!586 = !DILocation(line: 626, column: 10, scope: !63)
!587 = !DILocation(line: 626, column: 21, scope: !63)
!588 = !DILocation(line: 628, column: 44, scope: !589)
!589 = distinct !DILexicalBlock(scope: !590, file: !36, line: 628, column: 11)
!590 = distinct !DILexicalBlock(scope: !63, file: !36, line: 627, column: 5)
!591 = !DILocation(line: 628, column: 32, scope: !589)
!592 = !DILocation(line: 628, column: 49, scope: !589)
!593 = !DILocation(line: 628, column: 11, scope: !590)
!594 = !DILocation(line: 630, column: 11, scope: !595)
!595 = distinct !DILexicalBlock(scope: !590, file: !36, line: 630, column: 11)
!596 = !DILocation(line: 630, column: 11, scope: !590)
!597 = !DILocation(line: 632, column: 26, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !36, line: 632, column: 15)
!599 = distinct !DILexicalBlock(scope: !595, file: !36, line: 631, column: 9)
!600 = !DILocation(line: 632, column: 34, scope: !598)
!601 = !DILocation(line: 632, column: 37, scope: !598)
!602 = !DILocation(line: 632, column: 15, scope: !599)
!603 = !DILocation(line: 636, column: 29, scope: !604)
!604 = distinct !DILexicalBlock(scope: !599, file: !36, line: 636, column: 15)
!605 = !DILocation(line: 640, column: 16, scope: !590)
!606 = distinct !{!606, !585, !607, !506}
!607 = !DILocation(line: 641, column: 5, scope: !63)
!608 = !DILocation(line: 644, column: 3, scope: !63)
!609 = !DILocation(line: 0, scope: !489, inlinedAt: !610)
!610 = distinct !DILocation(line: 648, column: 31, scope: !63)
!611 = !DILocation(line: 0, scope: !489, inlinedAt: !612)
!612 = distinct !DILocation(line: 649, column: 31, scope: !63)
!613 = !DILocation(line: 0, scope: !489, inlinedAt: !614)
!614 = distinct !DILocation(line: 650, column: 31, scope: !63)
!615 = !DILocation(line: 0, scope: !489, inlinedAt: !616)
!616 = distinct !DILocation(line: 651, column: 31, scope: !63)
!617 = !DILocation(line: 0, scope: !489, inlinedAt: !618)
!618 = distinct !DILocation(line: 652, column: 31, scope: !63)
!619 = !DILocation(line: 0, scope: !489, inlinedAt: !620)
!620 = distinct !DILocation(line: 653, column: 31, scope: !63)
!621 = !DILocation(line: 0, scope: !489, inlinedAt: !622)
!622 = distinct !DILocation(line: 654, column: 31, scope: !63)
!623 = !DILocation(line: 0, scope: !489, inlinedAt: !624)
!624 = distinct !DILocation(line: 655, column: 31, scope: !63)
!625 = !DILocation(line: 0, scope: !489, inlinedAt: !626)
!626 = distinct !DILocation(line: 656, column: 31, scope: !63)
!627 = !DILocation(line: 0, scope: !489, inlinedAt: !628)
!628 = distinct !DILocation(line: 657, column: 31, scope: !63)
!629 = !DILocation(line: 663, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !63, file: !36, line: 663, column: 7)
!631 = !DILocation(line: 664, column: 7, scope: !630)
!632 = !DILocation(line: 664, column: 10, scope: !630)
!633 = !DILocation(line: 663, column: 7, scope: !63)
!634 = !DILocation(line: 669, column: 7, scope: !635)
!635 = distinct !DILexicalBlock(scope: !630, file: !36, line: 665, column: 5)
!636 = !DILocation(line: 671, column: 5, scope: !635)
!637 = !DILocation(line: 676, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !630, file: !36, line: 673, column: 5)
!639 = !DILocation(line: 679, column: 3, scope: !63)
!640 = !DILocation(line: 683, column: 3, scope: !63)
!641 = !DILocation(line: 686, column: 3, scope: !63)
!642 = !DILocation(line: 688, column: 3, scope: !63)
!643 = !DILocation(line: 691, column: 3, scope: !63)
!644 = !DILocation(line: 695, column: 3, scope: !63)
!645 = !DILocation(line: 696, column: 1, scope: !63)
!646 = !DISubprogram(name: "setlocale", scope: !647, file: !647, line: 122, type: !648, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!647 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!648 = !DISubroutineType(types: !649)
!649 = !{!43, !37, !50}
!650 = !DISubprogram(name: "getenv", scope: !651, file: !651, line: 641, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!651 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!652 = !DISubroutineType(types: !653)
!653 = !{!43, !50}
!654 = !DISubprogram(name: "fwrite_unlocked", scope: !185, file: !185, line: 704, type: !655, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!655 = !DISubroutineType(types: !656)
!656 = !{!47, !657, !47, !47, !537}
!657 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!660 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 198, type: !661, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !664)
!661 = !DISubroutineType(types: !662)
!662 = !{!37, !37, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!664 = !{!665, !666, !667, !668, !669, !673, !676, !677, !680, !718, !719}
!665 = !DILocalVariable(name: "argc", arg: 1, scope: !660, file: !3, line: 198, type: !37)
!666 = !DILocalVariable(name: "argv", arg: 2, scope: !660, file: !3, line: 198, type: !663)
!667 = !DILocalVariable(name: "optc", scope: !660, file: !3, line: 208, type: !37)
!668 = !DILocalVariable(name: "ok", scope: !660, file: !3, line: 235, type: !56)
!669 = !DILocalVariable(name: "dir", scope: !670, file: !3, line: 238, type: !43)
!670 = distinct !DILexicalBlock(scope: !671, file: !3, line: 237, column: 5)
!671 = distinct !DILexicalBlock(scope: !672, file: !3, line: 236, column: 3)
!672 = distinct !DILexicalBlock(scope: !660, file: !3, line: 236, column: 3)
!673 = !DILocalVariable(name: "rmdir_errno", scope: !674, file: !3, line: 246, type: !37)
!674 = distinct !DILexicalBlock(scope: !675, file: !3, line: 245, column: 9)
!675 = distinct !DILexicalBlock(scope: !670, file: !3, line: 244, column: 11)
!676 = !DILocalVariable(name: "custom_error", scope: !674, file: !3, line: 255, type: !56)
!677 = !DILocalVariable(name: "last_unix_slash", scope: !678, file: !3, line: 258, type: !50)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 257, column: 13)
!679 = distinct !DILexicalBlock(scope: !674, file: !3, line: 256, column: 15)
!680 = !DILocalVariable(name: "st", scope: !681, file: !3, line: 261, type: !683)
!681 = distinct !DILexicalBlock(scope: !682, file: !3, line: 260, column: 17)
!682 = distinct !DILexicalBlock(scope: !678, file: !3, line: 259, column: 19)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !684, line: 44, size: 1024, elements: !685)
!684 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!685 = !{!686, !688, !690, !692, !694, !696, !698, !699, !700, !701, !703, !704, !706, !714, !715, !716}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !683, file: !684, line: 46, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !112, line: 145, baseType: !49)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !683, file: !684, line: 47, baseType: !689, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !112, line: 148, baseType: !49)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !683, file: !684, line: 48, baseType: !691, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !112, line: 150, baseType: !7)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !683, file: !684, line: 49, baseType: !693, size: 32, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !112, line: 151, baseType: !7)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !683, file: !684, line: 50, baseType: !695, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !112, line: 146, baseType: !7)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !683, file: !684, line: 51, baseType: !697, size: 32, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !112, line: 147, baseType: !7)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !683, file: !684, line: 52, baseType: !687, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !683, file: !684, line: 53, baseType: !687, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !683, file: !684, line: 54, baseType: !111, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !683, file: !684, line: 55, baseType: !702, size: 32, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !112, line: 175, baseType: !37)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !683, file: !684, line: 56, baseType: !37, size: 32, offset: 480)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !683, file: !684, line: 57, baseType: !705, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !112, line: 180, baseType: !113)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !683, file: !684, line: 65, baseType: !707, size: 128, offset: 576)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !708, line: 11, size: 128, elements: !709)
!708 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !707, file: !708, line: 16, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !112, line: 160, baseType: !113)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !707, file: !708, line: 21, baseType: !713, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !112, line: 197, baseType: !113)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !683, file: !684, line: 66, baseType: !707, size: 128, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !683, file: !684, line: 67, baseType: !707, size: 128, offset: 832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !683, file: !684, line: 79, baseType: !717, size: 64, offset: 960)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !254)
!718 = !DILocalVariable(name: "ret", scope: !681, file: !3, line: 262, type: !37)
!719 = !DILocalVariable(name: "dir_arg", scope: !720, file: !3, line: 268, type: !43)
!720 = distinct !DILexicalBlock(scope: !721, file: !3, line: 266, column: 21)
!721 = distinct !DILexicalBlock(scope: !681, file: !3, line: 264, column: 23)
!722 = !DILocation(line: 0, scope: !660)
!723 = !DILocation(line: 201, column: 21, scope: !660)
!724 = !DILocation(line: 201, column: 3, scope: !660)
!725 = !DILocation(line: 202, column: 3, scope: !660)
!726 = !DILocation(line: 203, column: 3, scope: !660)
!727 = !DILocation(line: 204, column: 3, scope: !660)
!728 = !DILocation(line: 206, column: 3, scope: !660)
!729 = !DILocation(line: 209, column: 3, scope: !660)
!730 = !DILocation(line: 209, column: 18, scope: !660)
!731 = !DILocation(line: 218, column: 11, scope: !732)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 212, column: 9)
!733 = distinct !DILexicalBlock(scope: !660, file: !3, line: 210, column: 5)
!734 = !DILocation(line: 221, column: 11, scope: !732)
!735 = !DILocation(line: 222, column: 9, scope: !732)
!736 = !DILocation(line: 223, column: 9, scope: !732)
!737 = !DILocation(line: 225, column: 11, scope: !732)
!738 = !DILocation(line: 0, scope: !732)
!739 = distinct !{!739, !729, !740, !506}
!740 = !DILocation(line: 227, column: 5, scope: !660)
!741 = !DILocation(line: 229, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !660, file: !3, line: 229, column: 7)
!743 = !DILocation(line: 229, column: 14, scope: !742)
!744 = !DILocation(line: 229, column: 7, scope: !660)
!745 = !DILocation(line: 236, column: 17, scope: !671)
!746 = !DILocation(line: 236, column: 3, scope: !672)
!747 = !DILocation(line: 231, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !742, file: !3, line: 230, column: 5)
!749 = !DILocation(line: 232, column: 7, scope: !748)
!750 = !DILocation(line: 238, column: 19, scope: !670)
!751 = !DILocation(line: 0, scope: !670)
!752 = !DILocation(line: 241, column: 11, scope: !753)
!753 = distinct !DILexicalBlock(scope: !670, file: !3, line: 241, column: 11)
!754 = !DILocation(line: 241, column: 11, scope: !670)
!755 = !DILocation(line: 242, column: 23, scope: !753)
!756 = !DILocation(line: 242, column: 31, scope: !753)
!757 = !DILocation(line: 242, column: 60, scope: !753)
!758 = !DILocation(line: 242, column: 9, scope: !753)
!759 = !DILocation(line: 244, column: 11, scope: !675)
!760 = !DILocation(line: 244, column: 23, scope: !675)
!761 = !DILocation(line: 244, column: 11, scope: !670)
!762 = !DILocation(line: 246, column: 29, scope: !674)
!763 = !DILocation(line: 0, scope: !674)
!764 = !DILocation(line: 247, column: 15, scope: !765)
!765 = distinct !DILexicalBlock(scope: !674, file: !3, line: 247, column: 15)
!766 = !DILocation(line: 247, column: 15, scope: !674)
!767 = !DILocation(line: 256, column: 27, scope: !679)
!768 = !DILocation(line: 256, column: 15, scope: !674)
!769 = !DILocation(line: 258, column: 45, scope: !678)
!770 = !DILocation(line: 0, scope: !678)
!771 = !DILocation(line: 259, column: 19, scope: !682)
!772 = !DILocation(line: 259, column: 35, scope: !682)
!773 = !DILocation(line: 259, column: 57, scope: !682)
!774 = !DILocation(line: 259, column: 39, scope: !682)
!775 = !DILocation(line: 259, column: 62, scope: !682)
!776 = !DILocation(line: 259, column: 19, scope: !678)
!777 = !DILocation(line: 261, column: 19, scope: !681)
!778 = !DILocation(line: 261, column: 31, scope: !681)
!779 = !DILocation(line: 262, column: 29, scope: !681)
!780 = !DILocation(line: 0, scope: !681)
!781 = !DILocation(line: 264, column: 33, scope: !721)
!782 = !DILocation(line: 264, column: 36, scope: !721)
!783 = !DILocation(line: 264, column: 42, scope: !721)
!784 = !DILocation(line: 265, column: 23, scope: !721)
!785 = !DILocation(line: 265, column: 39, scope: !721)
!786 = !{!787, !541, i64 16}
!787 = !{!"stat", !788, i64 0, !788, i64 8, !541, i64 16, !541, i64 20, !541, i64 24, !541, i64 28, !788, i64 32, !788, i64 40, !788, i64 48, !541, i64 56, !541, i64 60, !788, i64 64, !789, i64 72, !789, i64 88, !789, i64 104, !455, i64 120}
!788 = !{!"long", !455, i64 0}
!789 = !{!"timespec", !788, i64 0, !788, i64 8}
!790 = !DILocation(line: 264, column: 23, scope: !681)
!791 = !DILocation(line: 268, column: 39, scope: !720)
!792 = !DILocation(line: 0, scope: !720)
!793 = !DILocation(line: 269, column: 23, scope: !720)
!794 = !DILocalVariable(name: "filename", arg: 1, scope: !795, file: !796, line: 49, type: !50)
!795 = distinct !DISubprogram(name: "issymlink", scope: !796, file: !796, line: 49, type: !797, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !799)
!796 = !DIFile(filename: "./lib/issymlink.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3ed5fe5c76158b7c9a68dd013fb9e151")
!797 = !DISubroutineType(types: !798)
!798 = !{!37, !50}
!799 = !{!794, !800}
!800 = !DILocalVariable(name: "linkbuf", scope: !795, file: !796, line: 51, type: !118)
!801 = !DILocation(line: 0, scope: !795, inlinedAt: !802)
!802 = distinct !DILocation(line: 270, column: 27, scope: !803)
!803 = distinct !DILexicalBlock(scope: !720, file: !3, line: 270, column: 27)
!804 = !DILocation(line: 51, column: 3, scope: !795, inlinedAt: !802)
!805 = !DILocation(line: 51, column: 8, scope: !795, inlinedAt: !802)
!806 = !DILocation(line: 52, column: 7, scope: !807, inlinedAt: !802)
!807 = distinct !DILexicalBlock(scope: !795, file: !796, line: 52, column: 7)
!808 = !DILocation(line: 52, column: 54, scope: !807, inlinedAt: !802)
!809 = !DILocation(line: 58, column: 1, scope: !795, inlinedAt: !802)
!810 = !DILocation(line: 52, column: 7, scope: !795, inlinedAt: !802)
!811 = !DILocation(line: 272, column: 27, scope: !812)
!812 = distinct !DILexicalBlock(scope: !803, file: !3, line: 271, column: 25)
!813 = !DILocation(line: 278, column: 23, scope: !720)
!814 = !DILocation(line: 280, column: 17, scope: !682)
!815 = !DILocation(line: 283, column: 15, scope: !674)
!816 = !DILocation(line: 284, column: 13, scope: !817)
!817 = distinct !DILexicalBlock(scope: !674, file: !3, line: 283, column: 15)
!818 = !DILocation(line: 288, column: 16, scope: !819)
!819 = distinct !DILexicalBlock(scope: !675, file: !3, line: 288, column: 16)
!820 = !DILocation(line: 288, column: 16, scope: !675)
!821 = !DILocalVariable(name: "dir", arg: 1, scope: !822, file: !3, line: 113, type: !43)
!822 = distinct !DISubprogram(name: "remove_parents", scope: !3, file: !3, line: 113, type: !823, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{!56, !43}
!825 = !{!821, !826, !827, !829, !830}
!826 = !DILocalVariable(name: "ok", scope: !822, file: !3, line: 115, type: !56)
!827 = !DILocalVariable(name: "slash", scope: !828, file: !3, line: 120, type: !43)
!828 = distinct !DILexicalBlock(scope: !822, file: !3, line: 119, column: 5)
!829 = !DILocalVariable(name: "rmdir_errno", scope: !828, file: !3, line: 134, type: !37)
!830 = !DILocalVariable(name: "error_msg", scope: !831, file: !3, line: 145, type: !50)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 144, column: 13)
!832 = distinct !DILexicalBlock(scope: !833, file: !3, line: 139, column: 15)
!833 = distinct !DILexicalBlock(scope: !834, file: !3, line: 137, column: 9)
!834 = distinct !DILexicalBlock(scope: !828, file: !3, line: 136, column: 11)
!835 = !DILocation(line: 0, scope: !822, inlinedAt: !836)
!836 = distinct !DILocation(line: 290, column: 17, scope: !837)
!837 = distinct !DILexicalBlock(scope: !819, file: !3, line: 289, column: 9)
!838 = !DILocation(line: 117, column: 3, scope: !822, inlinedAt: !836)
!839 = !DILocation(line: 118, column: 3, scope: !822, inlinedAt: !836)
!840 = !DILocation(line: 120, column: 21, scope: !828, inlinedAt: !836)
!841 = !DILocation(line: 0, scope: !828, inlinedAt: !836)
!842 = !DILocation(line: 121, column: 17, scope: !843, inlinedAt: !836)
!843 = distinct !DILexicalBlock(scope: !828, file: !3, line: 121, column: 11)
!844 = !DILocation(line: 121, column: 11, scope: !828, inlinedAt: !836)
!845 = !DILocation(line: 125, column: 20, scope: !828, inlinedAt: !836)
!846 = !DILocation(line: 125, column: 26, scope: !828, inlinedAt: !836)
!847 = !DILocation(line: 125, column: 7, scope: !828, inlinedAt: !836)
!848 = !DILocation(line: 125, column: 29, scope: !828, inlinedAt: !836)
!849 = !DILocation(line: 125, column: 36, scope: !828, inlinedAt: !836)
!850 = !DILocation(line: 126, column: 9, scope: !828, inlinedAt: !836)
!851 = distinct !{!851, !847, !852, !506}
!852 = !DILocation(line: 126, column: 11, scope: !828, inlinedAt: !836)
!853 = !DILocation(line: 127, column: 7, scope: !828, inlinedAt: !836)
!854 = !DILocation(line: 127, column: 16, scope: !828, inlinedAt: !836)
!855 = !DILocation(line: 130, column: 11, scope: !856, inlinedAt: !836)
!856 = distinct !DILexicalBlock(scope: !828, file: !3, line: 130, column: 11)
!857 = !DILocation(line: 130, column: 11, scope: !828, inlinedAt: !836)
!858 = !DILocation(line: 131, column: 23, scope: !856, inlinedAt: !836)
!859 = !DILocation(line: 131, column: 31, scope: !856, inlinedAt: !836)
!860 = !DILocation(line: 131, column: 60, scope: !856, inlinedAt: !836)
!861 = !DILocation(line: 131, column: 9, scope: !856, inlinedAt: !836)
!862 = !DILocation(line: 133, column: 13, scope: !828, inlinedAt: !836)
!863 = !DILocation(line: 133, column: 25, scope: !828, inlinedAt: !836)
!864 = !DILocation(line: 134, column: 25, scope: !828, inlinedAt: !836)
!865 = !DILocation(line: 136, column: 11, scope: !828, inlinedAt: !836)
!866 = !DILocation(line: 139, column: 15, scope: !832, inlinedAt: !836)
!867 = !DILocation(line: 139, column: 15, scope: !833, inlinedAt: !836)
!868 = !DILocation(line: 146, column: 31, scope: !869, inlinedAt: !836)
!869 = distinct !DILexicalBlock(scope: !831, file: !3, line: 146, column: 19)
!870 = !DILocation(line: 0, scope: !831, inlinedAt: !836)
!871 = !DILocation(line: 157, column: 15, scope: !831, inlinedAt: !836)
!872 = !DILocation(line: 290, column: 14, scope: !837)
!873 = !DILocation(line: 291, column: 9, scope: !837)
!874 = !DILocation(line: 236, column: 25, scope: !671)
!875 = distinct !{!875, !746, !876, !506}
!876 = !DILocation(line: 292, column: 5, scope: !672)
!877 = !DILocation(line: 294, column: 10, scope: !660)
!878 = !DILocation(line: 295, column: 1, scope: !660)
!879 = !DISubprogram(name: "bindtextdomain", scope: !529, file: !529, line: 86, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!880 = !DISubroutineType(types: !881)
!881 = !{!43, !50, !50}
!882 = !DISubprogram(name: "textdomain", scope: !529, file: !529, line: 82, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!883 = !DISubprogram(name: "atexit", scope: !651, file: !651, line: 602, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!884 = !DISubroutineType(types: !885)
!885 = !{!37, !211}
!886 = !DISubprogram(name: "getopt_long", scope: !149, file: !149, line: 66, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!887 = !DISubroutineType(types: !888)
!888 = !{!37, !37, !889, !50, !891, !154}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!892 = !DISubprogram(name: "rmdir", scope: !893, file: !893, line: 867, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!893 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!894 = distinct !DISubprogram(name: "ignorable_failure", scope: !3, file: !3, line: 99, type: !895, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!56, !37, !50}
!897 = !{!898, !899}
!898 = !DILocalVariable(name: "error_number", arg: 1, scope: !894, file: !3, line: 99, type: !37)
!899 = !DILocalVariable(name: "dir", arg: 2, scope: !894, file: !3, line: 99, type: !50)
!900 = !DILocation(line: 0, scope: !894)
!901 = !DILocation(line: 101, column: 11, scope: !894)
!902 = !DILocation(line: 102, column: 11, scope: !894)
!903 = !DILocation(line: 103, column: 15, scope: !894)
!904 = !DILocalVariable(name: "fd_cwd", arg: 1, scope: !905, file: !36, line: 305, type: !37)
!905 = distinct !DISubprogram(name: "directory_status", scope: !36, file: !36, line: 305, type: !906, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{!37, !37, !50}
!908 = !{!904, !909, !910, !915, !916, !917}
!909 = !DILocalVariable(name: "dir", arg: 2, scope: !905, file: !36, line: 305, type: !50)
!910 = !DILocalVariable(name: "dirp", scope: !905, file: !36, line: 307, type: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !913, line: 127, baseType: !914)
!913 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !913, line: 127, flags: DIFlagFwdDecl)
!915 = !DILocalVariable(name: "no_direntries", scope: !905, file: !36, line: 308, type: !56)
!916 = !DILocalVariable(name: "saved_errno", scope: !905, file: !36, line: 309, type: !37)
!917 = !DILocalVariable(name: "fd", scope: !905, file: !36, line: 310, type: !37)
!918 = !DILocation(line: 0, scope: !905, inlinedAt: !919)
!919 = distinct !DILocation(line: 104, column: 22, scope: !894)
!920 = !DILocation(line: 310, column: 12, scope: !905, inlinedAt: !919)
!921 = !DILocation(line: 314, column: 10, scope: !922, inlinedAt: !919)
!922 = distinct !DILexicalBlock(scope: !905, file: !36, line: 314, column: 7)
!923 = !DILocation(line: 314, column: 7, scope: !905, inlinedAt: !919)
!924 = !DILocation(line: 315, column: 12, scope: !922, inlinedAt: !919)
!925 = !DILocation(line: 315, column: 5, scope: !922, inlinedAt: !919)
!926 = !DILocation(line: 317, column: 10, scope: !905, inlinedAt: !919)
!927 = !DILocation(line: 318, column: 12, scope: !928, inlinedAt: !919)
!928 = distinct !DILexicalBlock(scope: !905, file: !36, line: 318, column: 7)
!929 = !DILocation(line: 318, column: 7, scope: !905, inlinedAt: !919)
!930 = !DILocation(line: 320, column: 21, scope: !931, inlinedAt: !919)
!931 = distinct !DILexicalBlock(scope: !928, file: !36, line: 319, column: 5)
!932 = !DILocation(line: 321, column: 7, scope: !931, inlinedAt: !919)
!933 = !DILocation(line: 322, column: 7, scope: !931, inlinedAt: !919)
!934 = !DILocation(line: 325, column: 9, scope: !905, inlinedAt: !919)
!935 = !DILocalVariable(name: "dirp", arg: 1, scope: !936, file: !36, line: 285, type: !911)
!936 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !36, file: !36, line: 285, type: !937, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !949)
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !911}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !942, line: 22, size: 2240, elements: !943)
!942 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "bc8b10a1ddd2747862e3ae7b91dbf464")
!943 = !{!944, !945, !946, !947, !948}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !941, file: !942, line: 25, baseType: !689, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !941, file: !942, line: 26, baseType: !111, size: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !941, file: !942, line: 31, baseType: !46, size: 16, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !941, file: !942, line: 32, baseType: !52, size: 8, offset: 144)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !941, file: !942, line: 33, baseType: !290, size: 2048, offset: 152)
!949 = !{!935, !950}
!950 = !DILocalVariable(name: "dp", scope: !951, file: !36, line: 289, type: !939)
!951 = distinct !DILexicalBlock(scope: !936, file: !36, line: 288, column: 5)
!952 = !DILocation(line: 0, scope: !936, inlinedAt: !953)
!953 = distinct !DILocation(line: 326, column: 20, scope: !905, inlinedAt: !919)
!954 = !DILocation(line: 289, column: 33, scope: !951, inlinedAt: !953)
!955 = !DILocation(line: 0, scope: !951, inlinedAt: !953)
!956 = !DILocation(line: 290, column: 14, scope: !957, inlinedAt: !953)
!957 = distinct !DILexicalBlock(scope: !951, file: !36, line: 290, column: 11)
!958 = !DILocation(line: 290, column: 22, scope: !957, inlinedAt: !953)
!959 = !DILocation(line: 290, column: 42, scope: !957, inlinedAt: !953)
!960 = !DILocalVariable(name: "file_name", arg: 1, scope: !961, file: !36, line: 272, type: !50)
!961 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !36, file: !36, line: 272, type: !962, scopeLine: 273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !964)
!962 = !DISubroutineType(types: !963)
!963 = !{!56, !50}
!964 = !{!960, !965}
!965 = !DILocalVariable(name: "sep", scope: !966, file: !36, line: 276, type: !44)
!966 = distinct !DILexicalBlock(scope: !967, file: !36, line: 275, column: 5)
!967 = distinct !DILexicalBlock(scope: !961, file: !36, line: 274, column: 7)
!968 = !DILocation(line: 0, scope: !961, inlinedAt: !969)
!969 = distinct !DILocation(line: 290, column: 27, scope: !957, inlinedAt: !953)
!970 = !DILocation(line: 274, column: 7, scope: !967, inlinedAt: !969)
!971 = !DILocation(line: 274, column: 20, scope: !967, inlinedAt: !969)
!972 = !DILocation(line: 274, column: 7, scope: !961, inlinedAt: !969)
!973 = !DILocation(line: 276, column: 29, scope: !966, inlinedAt: !969)
!974 = !DILocation(line: 276, column: 42, scope: !966, inlinedAt: !969)
!975 = !DILocation(line: 276, column: 50, scope: !966, inlinedAt: !969)
!976 = !DILocation(line: 276, column: 18, scope: !966, inlinedAt: !969)
!977 = !DILocation(line: 0, scope: !966, inlinedAt: !969)
!978 = !DILocation(line: 290, column: 11, scope: !951, inlinedAt: !953)
!979 = !DILocation(line: 326, column: 19, scope: !905, inlinedAt: !919)
!980 = !DILocation(line: 327, column: 17, scope: !905, inlinedAt: !919)
!981 = !DILocation(line: 328, column: 3, scope: !905, inlinedAt: !919)
!982 = !DILocation(line: 329, column: 24, scope: !905, inlinedAt: !919)
!983 = !DILocation(line: 329, column: 3, scope: !905, inlinedAt: !919)
!984 = !DILocation(line: 104, column: 55, scope: !894)
!985 = !DILocation(line: 101, column: 3, scope: !894)
!986 = !DISubprogram(name: "stat", scope: !987, file: !987, line: 205, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!987 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!988 = !DISubroutineType(types: !989)
!989 = !{!37, !536, !990}
!990 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!992 = !DISubprogram(name: "openat", scope: !993, file: !993, line: 205, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!993 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!994 = !DISubroutineType(types: !995)
!995 = !{!37, !37, !50, !37, null}
!996 = !DISubprogram(name: "fdopendir", scope: !913, file: !913, line: 141, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!997 = !DISubroutineType(types: !998)
!998 = !{!911, !37}
!999 = !DISubprogram(name: "close", scope: !893, file: !893, line: 358, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!37, !37}
!1002 = !DISubprogram(name: "readdir", scope: !913, file: !913, line: 162, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1005, !911}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!1006 = !DISubprogram(name: "closedir", scope: !913, file: !913, line: 149, type: !1007, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !532)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!37, !911}
!1009 = distinct !DISubprogram(name: "prog_fprintf", scope: !362, file: !362, line: 28, type: !1010, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1046)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !1012, !50, null}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1014, file: !89, line: 51, baseType: !37, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1014, file: !89, line: 54, baseType: !43, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1014, file: !89, line: 55, baseType: !43, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1014, file: !89, line: 56, baseType: !43, size: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1014, file: !89, line: 57, baseType: !43, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1014, file: !89, line: 58, baseType: !43, size: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1014, file: !89, line: 59, baseType: !43, size: 64, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1014, file: !89, line: 60, baseType: !43, size: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1014, file: !89, line: 61, baseType: !43, size: 64, offset: 512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1014, file: !89, line: 64, baseType: !43, size: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1014, file: !89, line: 65, baseType: !43, size: 64, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1014, file: !89, line: 66, baseType: !43, size: 64, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1014, file: !89, line: 68, baseType: !104, size: 64, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1014, file: !89, line: 70, baseType: !1030, size: 64, offset: 832)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1014, file: !89, line: 72, baseType: !37, size: 32, offset: 896)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1014, file: !89, line: 73, baseType: !37, size: 32, offset: 928)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1014, file: !89, line: 74, baseType: !111, size: 64, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1014, file: !89, line: 77, baseType: !46, size: 16, offset: 1024)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1014, file: !89, line: 78, baseType: !116, size: 8, offset: 1040)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1014, file: !89, line: 79, baseType: !118, size: 8, offset: 1048)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1014, file: !89, line: 81, baseType: !122, size: 64, offset: 1088)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1014, file: !89, line: 89, baseType: !125, size: 64, offset: 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1014, file: !89, line: 91, baseType: !127, size: 64, offset: 1216)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1014, file: !89, line: 92, baseType: !130, size: 64, offset: 1280)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1014, file: !89, line: 93, baseType: !1030, size: 64, offset: 1344)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1014, file: !89, line: 94, baseType: !45, size: 64, offset: 1408)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1014, file: !89, line: 95, baseType: !47, size: 64, offset: 1472)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1014, file: !89, line: 96, baseType: !37, size: 32, offset: 1536)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1014, file: !89, line: 98, baseType: !137, size: 160, offset: 1568)
!1046 = !{!1047, !1048, !1049}
!1047 = !DILocalVariable(name: "fp", arg: 1, scope: !1009, file: !362, line: 28, type: !1012)
!1048 = !DILocalVariable(name: "fmt", arg: 2, scope: !1009, file: !362, line: 28, type: !50)
!1049 = !DILocalVariable(name: "ap", scope: !1009, file: !362, line: 30, type: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !185, line: 52, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !187, line: 32, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1053, baseType: !1054)
!1053 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src")
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !191, size: 256, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1054, file: !1053, line: 30, baseType: !45, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1054, file: !1053, line: 30, baseType: !45, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1054, file: !1053, line: 30, baseType: !45, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1054, file: !1053, line: 30, baseType: !37, size: 32, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1054, file: !1053, line: 30, baseType: !37, size: 32, offset: 224)
!1061 = !DILocation(line: 0, scope: !1009)
!1062 = !DILocation(line: 30, column: 3, scope: !1009)
!1063 = !DILocation(line: 30, column: 11, scope: !1009)
!1064 = !DILocation(line: 31, column: 3, scope: !1009)
!1065 = !DILocation(line: 32, column: 3, scope: !1009)
!1066 = !DILocation(line: 33, column: 3, scope: !1009)
!1067 = !DILocalVariable(name: "__stream", arg: 1, scope: !1068, file: !1069, line: 132, type: !1072)
!1068 = distinct !DISubprogram(name: "vfprintf", scope: !1069, file: !1069, line: 132, type: !1070, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1073)
!1069 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!37, !1072, !536, !1051}
!1072 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1012)
!1073 = !{!1067, !1074, !1075}
!1074 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1068, file: !1069, line: 133, type: !536)
!1075 = !DILocalVariable(name: "__ap", arg: 3, scope: !1068, file: !1069, line: 133, type: !1051)
!1076 = !DILocation(line: 0, scope: !1068, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 34, column: 3, scope: !1009)
!1078 = !DILocation(line: 135, column: 10, scope: !1068, inlinedAt: !1077)
!1079 = !{!1080, !1082}
!1080 = distinct !{!1080, !1081, !"vfprintf.inline: argument 0"}
!1081 = distinct !{!1081, !"vfprintf.inline"}
!1082 = distinct !{!1082, !1081, !"vfprintf.inline: argument 1"}
!1083 = !DILocation(line: 35, column: 3, scope: !1009)
!1084 = !DILocalVariable(name: "__c", arg: 1, scope: !1085, file: !1086, line: 91, type: !37)
!1085 = distinct !DISubprogram(name: "fputc_unlocked", scope: !1086, file: !1086, line: 91, type: !1087, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1089)
!1086 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!37, !37, !1012}
!1089 = !{!1084, !1090}
!1090 = !DILocalVariable(name: "__stream", arg: 2, scope: !1085, file: !1086, line: 91, type: !1012)
!1091 = !DILocation(line: 0, scope: !1085, inlinedAt: !1092)
!1092 = distinct !DILocation(line: 36, column: 3, scope: !1009)
!1093 = !DILocation(line: 93, column: 10, scope: !1085, inlinedAt: !1092)
!1094 = !{!1095, !454, i64 40}
!1095 = !{!"_IO_FILE", !541, i64 0, !454, i64 8, !454, i64 16, !454, i64 24, !454, i64 32, !454, i64 40, !454, i64 48, !454, i64 56, !454, i64 64, !454, i64 72, !454, i64 80, !454, i64 88, !454, i64 96, !454, i64 104, !541, i64 112, !541, i64 116, !788, i64 120, !575, i64 128, !455, i64 130, !455, i64 131, !454, i64 136, !788, i64 144, !454, i64 152, !454, i64 160, !454, i64 168, !454, i64 176, !788, i64 184, !541, i64 192, !455, i64 196}
!1096 = !{!1095, !454, i64 48}
!1097 = !{!"branch_weights", i32 2000, i32 1}
!1098 = !DILocation(line: 37, column: 1, scope: !1009)
!1099 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !169, file: !169, line: 50, type: !467, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !1100)
!1100 = !{!1101}
!1101 = !DILocalVariable(name: "file", arg: 1, scope: !1099, file: !169, line: 50, type: !50)
!1102 = !DILocation(line: 0, scope: !1099)
!1103 = !DILocation(line: 52, column: 13, scope: !1099)
!1104 = !DILocation(line: 53, column: 1, scope: !1099)
!1105 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !169, file: !169, line: 87, type: !1106, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !1108)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{null, !56}
!1108 = !{!1109}
!1109 = !DILocalVariable(name: "ignore", arg: 1, scope: !1105, file: !169, line: 87, type: !56)
!1110 = !DILocation(line: 0, scope: !1105)
!1111 = !DILocation(line: 89, column: 16, scope: !1105)
!1112 = !{!1113, !1113, i64 0}
!1113 = !{!"_Bool", !455, i64 0}
!1114 = !DILocation(line: 90, column: 1, scope: !1105)
!1115 = distinct !DISubprogram(name: "close_stdout", scope: !169, file: !169, line: 116, type: !212, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !1116)
!1116 = !{!1117}
!1117 = !DILocalVariable(name: "write_error", scope: !1118, file: !169, line: 121, type: !50)
!1118 = distinct !DILexicalBlock(scope: !1119, file: !169, line: 120, column: 5)
!1119 = distinct !DILexicalBlock(scope: !1115, file: !169, line: 118, column: 7)
!1120 = !DILocation(line: 118, column: 21, scope: !1119)
!1121 = !DILocation(line: 118, column: 7, scope: !1119)
!1122 = !DILocation(line: 118, column: 29, scope: !1119)
!1123 = !DILocation(line: 119, column: 7, scope: !1119)
!1124 = !DILocation(line: 119, column: 12, scope: !1119)
!1125 = !{i8 0, i8 2}
!1126 = !DILocation(line: 119, column: 25, scope: !1119)
!1127 = !DILocation(line: 119, column: 28, scope: !1119)
!1128 = !DILocation(line: 119, column: 34, scope: !1119)
!1129 = !DILocation(line: 118, column: 7, scope: !1115)
!1130 = !DILocation(line: 121, column: 33, scope: !1118)
!1131 = !DILocation(line: 0, scope: !1118)
!1132 = !DILocation(line: 122, column: 11, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1118, file: !169, line: 122, column: 11)
!1134 = !DILocation(line: 0, scope: !1133)
!1135 = !DILocation(line: 122, column: 11, scope: !1118)
!1136 = !DILocation(line: 123, column: 9, scope: !1133)
!1137 = !DILocation(line: 126, column: 9, scope: !1133)
!1138 = !DILocation(line: 128, column: 14, scope: !1118)
!1139 = !DILocation(line: 128, column: 7, scope: !1118)
!1140 = !DILocation(line: 133, column: 42, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1115, file: !169, line: 133, column: 7)
!1142 = !DILocation(line: 133, column: 28, scope: !1141)
!1143 = !DILocation(line: 133, column: 50, scope: !1141)
!1144 = !DILocation(line: 133, column: 7, scope: !1115)
!1145 = !DILocation(line: 134, column: 12, scope: !1141)
!1146 = !DILocation(line: 134, column: 5, scope: !1141)
!1147 = !DILocation(line: 135, column: 1, scope: !1115)
!1148 = distinct !DISubprogram(name: "strip_trailing_slashes", scope: !365, file: !365, line: 31, type: !823, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !364, retainedNodes: !1149)
!1149 = !{!1150, !1151, !1152, !1153}
!1150 = !DILocalVariable(name: "file", arg: 1, scope: !1148, file: !365, line: 31, type: !43)
!1151 = !DILocalVariable(name: "base", scope: !1148, file: !365, line: 33, type: !43)
!1152 = !DILocalVariable(name: "base_lim", scope: !1148, file: !365, line: 39, type: !43)
!1153 = !DILocalVariable(name: "had_slash", scope: !1148, file: !365, line: 40, type: !56)
!1154 = !DILocation(line: 0, scope: !1148)
!1155 = !DILocation(line: 33, column: 16, scope: !1148)
!1156 = !DILocation(line: 37, column: 9, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1148, file: !365, line: 37, column: 7)
!1158 = !DILocation(line: 37, column: 7, scope: !1148)
!1159 = !DILocation(line: 39, column: 27, scope: !1148)
!1160 = !DILocation(line: 39, column: 25, scope: !1148)
!1161 = !DILocation(line: 40, column: 21, scope: !1148)
!1162 = !DILocation(line: 40, column: 31, scope: !1148)
!1163 = !DILocation(line: 41, column: 13, scope: !1148)
!1164 = !DILocation(line: 42, column: 3, scope: !1148)
!1165 = distinct !DISubprogram(name: "verror", scope: !176, file: !176, line: 251, type: !1166, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !175, retainedNodes: !1168)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{null, !37, !37, !50, !184}
!1168 = !{!1169, !1170, !1171, !1172}
!1169 = !DILocalVariable(name: "status", arg: 1, scope: !1165, file: !176, line: 251, type: !37)
!1170 = !DILocalVariable(name: "errnum", arg: 2, scope: !1165, file: !176, line: 251, type: !37)
!1171 = !DILocalVariable(name: "message", arg: 3, scope: !1165, file: !176, line: 251, type: !50)
!1172 = !DILocalVariable(name: "args", arg: 4, scope: !1165, file: !176, line: 251, type: !184)
!1173 = !DILocation(line: 0, scope: !1165)
!1174 = !DILocation(line: 251, column: 1, scope: !1165)
!1175 = !DILocation(line: 261, column: 3, scope: !1165)
!1176 = !DILocation(line: 265, column: 7, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1165, file: !176, line: 265, column: 7)
!1178 = !DILocation(line: 265, column: 7, scope: !1165)
!1179 = !DILocation(line: 266, column: 5, scope: !1177)
!1180 = !DILocation(line: 272, column: 7, scope: !1181)
