; ModuleID = 'src/seq.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.operand = type { fp128, i64, i32 }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }
%struct.arguments = type { i64, %struct.argument*, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.46 }
%union.anon.46 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1

!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !41, line: 35, baseType: !42)
!41 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!42 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!43 = !DILocalVariable(name: "b_len", scope: !22, file: !3, line: 470, type: !38)
!44 = !DILocalVariable(name: "inf", scope: !22, file: !3, line: 471, type: !45)
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DILocalVariable(name: "inc_size", scope: !22, file: !3, line: 476, type: !38)
!47 = !DILocalVariable(name: "p0", scope: !22, file: !3, line: 481, type: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!49 = !DILocalVariable(name: "endp", scope: !22, file: !3, line: 482, type: !48)
!50 = !DILocalVariable(name: "p", scope: !22, file: !3, line: 483, type: !48)
!51 = !DILocalVariable(name: "buf", scope: !22, file: !3, line: 488, type: !52)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 65536, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 8192)
!55 = !DILocalVariable(name: "buf_end", scope: !22, file: !3, line: 489, type: !48)
!56 = !DILocalVariable(name: "bufp", scope: !22, file: !3, line: 490, type: !48)
!57 = !DILocalVariable(name: "pp", scope: !58, file: !3, line: 496, type: !48)
!58 = distinct !DILexicalBlock(scope: !22, file: !3, line: 493, column: 5)
!59 = !DILocalVariable(name: "new_p0", scope: !60, file: !3, line: 514, type: !48)
!60 = distinct !DILexicalBlock(scope: !61, file: !3, line: 513, column: 9)
!61 = distinct !DILexicalBlock(scope: !58, file: !3, line: 512, column: 11)
!62 = !DILocalVariable(name: "saved_p_len", scope: !60, file: !3, line: 515, type: !38)
!63 = !DILocalVariable(name: "n_incr", scope: !64, file: !3, line: 523, type: !28)
!64 = distinct !DILexicalBlock(scope: !58, file: !3, line: 523, column: 7)
!65 = !DILocalVariable(name: "remaining", scope: !22, file: !3, line: 529, type: !38)
!66 = !{!67}
!67 = !DIEnumerator(name: "INITIAL_ALLOC_DIGITS", value: 31)
!68 = !{!48, !69, !70, !71, !72, !25, !73}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 46, baseType: !32)
!73 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!74 = !{!0, !75, !77, !161, !175, !177, !182}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "equal_width", scope: !2, file: !3, line: 55, type: !45, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !79, file: !80, line: 575, type: !70, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "oputs_", scope: !80, file: !80, line: 573, type: !81, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!80 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !25, !25}
!83 = !{!84, !85, !86, !89, !90, !91, !92, !96, !97, !98, !99, !101, !155, !156, !157, !159, !160}
!84 = !DILocalVariable(name: "program", arg: 1, scope: !79, file: !80, line: 573, type: !25)
!85 = !DILocalVariable(name: "option", arg: 2, scope: !79, file: !80, line: 573, type: !25)
!86 = !DILocalVariable(name: "term", scope: !87, file: !80, line: 585, type: !25)
!87 = distinct !DILexicalBlock(scope: !88, file: !80, line: 582, column: 5)
!88 = distinct !DILexicalBlock(scope: !79, file: !80, line: 581, column: 7)
!89 = !DILocalVariable(name: "double_space", scope: !79, file: !80, line: 594, type: !45)
!90 = !DILocalVariable(name: "first_word", scope: !79, file: !80, line: 595, type: !25)
!91 = !DILocalVariable(name: "option_text", scope: !79, file: !80, line: 596, type: !25)
!92 = !DILocalVariable(name: "s", scope: !93, file: !80, line: 608, type: !25)
!93 = distinct !DILexicalBlock(scope: !94, file: !80, line: 605, column: 5)
!94 = distinct !DILexicalBlock(scope: !95, file: !80, line: 604, column: 12)
!95 = distinct !DILexicalBlock(scope: !79, file: !80, line: 597, column: 7)
!96 = !DILocalVariable(name: "spaces", scope: !93, file: !80, line: 609, type: !72)
!97 = !DILocalVariable(name: "anchor_len", scope: !79, file: !80, line: 620, type: !72)
!98 = !DILocalVariable(name: "desc_text", scope: !79, file: !80, line: 625, type: !25)
!99 = !DILocalVariable(name: "__ptr", scope: !100, file: !80, line: 644, type: !25)
!100 = distinct !DILexicalBlock(scope: !79, file: !80, line: 644, column: 3)
!101 = !DILocalVariable(name: "__stream", scope: !100, file: !80, line: 644, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !107)
!106 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !125, !126, !127, !129, !130, !132, !136, !139, !141, !144, !147, !148, !149, !150, !151}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 51, baseType: !70, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 54, baseType: !48, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 55, baseType: !48, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 56, baseType: !48, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 57, baseType: !48, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 58, baseType: !48, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 59, baseType: !48, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 60, baseType: !48, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 61, baseType: !48, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 64, baseType: !48, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 65, baseType: !48, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 66, baseType: !48, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 36, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 70, baseType: !124, size: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 72, baseType: !70, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 73, baseType: !70, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 152, baseType: !42)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 77, baseType: !71, size: 16, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 78, baseType: !131, size: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 79, baseType: !133, size: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 81, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 43, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 89, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 153, baseType: !42)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !105, file: !106, line: 91, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !106, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !105, file: !106, line: 92, baseType: !145, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !106, line: 38, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !105, file: !106, line: 93, baseType: !124, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !105, file: !106, line: 94, baseType: !69, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 95, baseType: !72, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 96, baseType: !70, size: 32, offset: 1536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 98, baseType: !152, size: 160, offset: 1568)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 160, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 20)
!155 = !DILocalVariable(name: "__cnt", scope: !100, file: !80, line: 644, type: !72)
!156 = !DILocalVariable(name: "url_program", scope: !79, file: !80, line: 648, type: !25)
!157 = !DILocalVariable(name: "__ptr", scope: !158, file: !80, line: 686, type: !25)
!158 = distinct !DILexicalBlock(scope: !79, file: !80, line: 686, column: 3)
!159 = !DILocalVariable(name: "__stream", scope: !158, file: !80, line: 686, type: !102)
!160 = !DILocalVariable(name: "__cnt", scope: !158, file: !80, line: 686, type: !72)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 64, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1536, elements: !173)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !166, line: 50, size: 256, elements: !167)
!166 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!167 = !{!168, !169, !170, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !165, file: !166, line: 52, baseType: !25, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !165, file: !166, line: 55, baseType: !70, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !165, file: !166, line: 56, baseType: !171, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !165, file: !166, line: 57, baseType: !70, size: 32, offset: 192)
!173 = !{!174}
!174 = !DISubrange(count: 6)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "separator", scope: !2, file: !3, line: 58, type: !25, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "terminator", scope: !2, file: !3, line: 62, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 16, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "format_buf", scope: !184, file: !3, line: 375, type: !209, isLocal: true, isDefinition: true)
!184 = distinct !DISubprogram(name: "get_default_format", scope: !3, file: !3, line: 373, type: !185, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !194)
!185 = !DISubroutineType(types: !186)
!186 = !{!25, !187, !187, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "operand", file: !3, line: 143, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "operand", file: !3, line: 128, size: 256, elements: !189)
!189 = !{!190, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !3, line: 131, baseType: !191, size: 128)
!191 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !188, file: !3, line: 137, baseType: !72, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !188, file: !3, line: 141, baseType: !70, size: 32, offset: 192)
!194 = !{!195, !196, !197, !198, !199, !204, !205, !206}
!195 = !DILocalVariable(name: "first", arg: 1, scope: !184, file: !3, line: 373, type: !187)
!196 = !DILocalVariable(name: "step", arg: 2, scope: !184, file: !3, line: 373, type: !187)
!197 = !DILocalVariable(name: "last", arg: 3, scope: !184, file: !3, line: 373, type: !187)
!198 = !DILocalVariable(name: "prec", scope: !184, file: !3, line: 377, type: !70)
!199 = !DILocalVariable(name: "first_width", scope: !200, file: !3, line: 384, type: !72)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 382, column: 9)
!201 = distinct !DILexicalBlock(scope: !202, file: !3, line: 381, column: 11)
!202 = distinct !DILexicalBlock(scope: !203, file: !3, line: 380, column: 5)
!203 = distinct !DILexicalBlock(scope: !184, file: !3, line: 379, column: 7)
!204 = !DILocalVariable(name: "last_width", scope: !200, file: !3, line: 386, type: !72)
!205 = !DILocalVariable(name: "width", scope: !200, file: !3, line: 393, type: !72)
!206 = !DILocalVariable(name: "w", scope: !207, file: !3, line: 396, type: !70)
!207 = distinct !DILexicalBlock(scope: !208, file: !3, line: 395, column: 13)
!208 = distinct !DILexicalBlock(scope: !200, file: !3, line: 394, column: 15)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 28)
!212 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "Version", scope: !215, file: !216, line: 3, type: !25, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !217, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!217 = !{!213}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "file_name", scope: !220, file: !221, line: 45, type: !25, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !222, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!222 = !{!218, !223}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !220, file: !221, line: 55, type: !45, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !227, file: !228, line: 66, type: !263, isLocal: false, isDefinition: true)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !229, globals: !230, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!229 = !{!69, !73}
!230 = !{!231, !257, !225, !259, !261}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "old_file_name", scope: !233, file: !228, line: 304, type: !25, isLocal: true, isDefinition: true)
!233 = distinct !DISubprogram(name: "verror_at_line", scope: !228, file: !228, line: 298, type: !234, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !227, retainedNodes: !250)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !70, !70, !25, !7, !25, !236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !237, line: 52, baseType: !238)
!237 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !239, line: 32, baseType: !240)
!239 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !241, baseType: !242)
!241 = !DIFile(filename: "lib/error.c", directory: "/src")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !243, size: 256, elements: !244)
!243 = !DINamespace(name: "std", scope: null)
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !242, file: !241, baseType: !69, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !242, file: !241, baseType: !69, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !242, file: !241, baseType: !69, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !242, file: !241, baseType: !70, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !242, file: !241, baseType: !70, size: 32, offset: 224)
!250 = !{!251, !252, !253, !254, !255, !256}
!251 = !DILocalVariable(name: "status", arg: 1, scope: !233, file: !228, line: 298, type: !70)
!252 = !DILocalVariable(name: "errnum", arg: 2, scope: !233, file: !228, line: 298, type: !70)
!253 = !DILocalVariable(name: "file_name", arg: 3, scope: !233, file: !228, line: 298, type: !25)
!254 = !DILocalVariable(name: "line_number", arg: 4, scope: !233, file: !228, line: 298, type: !7)
!255 = !DILocalVariable(name: "message", arg: 5, scope: !233, file: !228, line: 298, type: !25)
!256 = !DILocalVariable(name: "args", arg: 6, scope: !233, file: !228, line: 298, type: !236)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "old_line_number", scope: !233, file: !228, line: 305, type: !7, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "error_message_count", scope: !227, file: !228, line: 69, type: !7, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !227, file: !228, line: 295, type: !70, isLocal: false, isDefinition: true)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null}
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "program_name", scope: !268, file: !269, line: 31, type: !25, isLocal: false, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !270, globals: !271, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!270 = !{!48}
!271 = !{!266}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "utf07FF", scope: !274, file: !275, line: 46, type: !179, isLocal: true, isDefinition: true)
!274 = distinct !DISubprogram(name: "proper_name_lite", scope: !275, file: !275, line: 38, type: !276, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !278, retainedNodes: !280)
!275 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!276 = !DISubroutineType(types: !277)
!277 = !{!25, !25, !25}
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !279, splitDebugInlining: false, nameTableKind: None)
!279 = !{!272}
!280 = !{!281, !282, !283, !284, !289}
!281 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !274, file: !275, line: 38, type: !25)
!282 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !274, file: !275, line: 38, type: !25)
!283 = !DILocalVariable(name: "translation", scope: !274, file: !275, line: 40, type: !25)
!284 = !DILocalVariable(name: "w", scope: !274, file: !275, line: 47, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !286, line: 37, baseType: !287)
!286 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !31, line: 57, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !7)
!289 = !DILocalVariable(name: "mbs", scope: !274, file: !275, line: 48, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !291, line: 6, baseType: !292)
!291 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !293, line: 21, baseType: !294)
!293 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 13, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !294, file: !293, line: 15, baseType: !70, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !294, file: !293, line: 20, baseType: !298, size: 32, offset: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !294, file: !293, line: 16, size: 32, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !298, file: !293, line: 18, baseType: !7, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !298, file: !293, line: 19, baseType: !302, size: 32)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 4)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !307, file: !308, line: 76, type: !390, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !329, globals: !330, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!309 = !{!310, !324, !5}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !311, line: 42, baseType: !7, size: 32, elements: !312)
!311 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!313 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!314 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!315 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!316 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!317 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!318 = !DIEnumerator(name: "c_quoting_style", value: 5)
!319 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!320 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!321 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!322 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!323 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !311, line: 254, baseType: !7, size: 32, elements: !325)
!325 = !{!326, !327, !328}
!326 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!327 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!328 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!329 = !{!70, !71, !72}
!330 = !{!305, !331, !337, !349, !351, !356, !379, !386, !388}
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !307, file: !308, line: 92, type: !333, isLocal: false, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 320, elements: !335)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!335 = !{!336}
!336 = !DISubrange(count: 10)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !307, file: !308, line: 1040, type: !339, isLocal: false, isDefinition: true)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !308, line: 56, size: 448, elements: !340)
!340 = !{!341, !342, !343, !347, !348}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !339, file: !308, line: 59, baseType: !310, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !308, line: 62, baseType: !70, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !339, file: !308, line: 66, baseType: !344, size: 256, offset: 64)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !339, file: !308, line: 69, baseType: !25, size: 64, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !339, file: !308, line: 72, baseType: !25, size: 64, offset: 384)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !307, file: !308, line: 107, type: !339, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "slot0", scope: !307, file: !308, line: 831, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 256)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "quote", scope: !358, file: !308, line: 228, type: !377, isLocal: true, isDefinition: true)
!358 = distinct !DISubprogram(name: "gettext_quote", scope: !308, file: !308, line: 197, type: !359, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !307, retainedNodes: !361)
!359 = !DISubroutineType(types: !360)
!360 = !{!25, !25, !310}
!361 = !{!362, !363, !364, !365, !366}
!362 = !DILocalVariable(name: "msgid", arg: 1, scope: !358, file: !308, line: 197, type: !25)
!363 = !DILocalVariable(name: "s", arg: 2, scope: !358, file: !308, line: 197, type: !310)
!364 = !DILocalVariable(name: "translation", scope: !358, file: !308, line: 199, type: !25)
!365 = !DILocalVariable(name: "w", scope: !358, file: !308, line: 229, type: !285)
!366 = !DILocalVariable(name: "mbs", scope: !358, file: !308, line: 230, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !291, line: 6, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !293, line: 21, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 13, size: 64, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !369, file: !293, line: 15, baseType: !70, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !369, file: !293, line: 20, baseType: !373, size: 32, offset: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !293, line: 16, size: 32, elements: !374)
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !373, file: !293, line: 18, baseType: !7, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !373, file: !293, line: 19, baseType: !302, size: 32)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !378)
!378 = !{!181, !304}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "slotvec", scope: !307, file: !308, line: 834, type: !381, isLocal: true, isDefinition: true)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !308, line: 823, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !382, file: !308, line: 825, baseType: !72, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !382, file: !308, line: 826, baseType: !48, size: 64, offset: 64)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "nslots", scope: !307, file: !308, line: 832, type: !70, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "slotvec0", scope: !307, file: !308, line: 833, type: !382, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 704, elements: !392)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!392 = !{!393}
!393 = !DISubrange(count: 11)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !396, file: !397, line: 26, type: !399, isLocal: false, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !398, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!398 = !{!394}
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 376, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 47)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "exit_failure", scope: !404, file: !405, line: 24, type: !407, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !406, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!406 = !{!402}
!407 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !410, file: !436, line: 58, type: !437, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !435, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!412 = !{!48, !413}
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !414, line: 24, baseType: !415)
!414 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !416, line: 41, baseType: !417)
!416 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !416, line: 27, size: 1856, elements: !419)
!419 = !{!420, !426, !429, !432, !433}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !418, file: !416, line: 30, baseType: !421, size: 832)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 832, elements: !424)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !416, line: 30, flags: DIFlagFwdDecl)
!424 = !{!425}
!425 = !DISubrange(count: 13)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !418, file: !416, line: 33, baseType: !427, size: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !418, file: !416, line: 34, baseType: !430, size: 64, offset: 896)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !418, file: !416, line: 35, baseType: !430, size: 64, offset: 960)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !418, file: !416, line: 38, baseType: !434, size: 832, offset: 1024)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 832, elements: !424)
!435 = !{!408}
!436 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "internal_state", scope: !440, file: !441, line: 97, type: !444, isLocal: true, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !442, globals: !443, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!442 = !{!69, !72, !73}
!443 = !{!438}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !291, line: 6, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !293, line: 21, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 13, size: 64, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !446, file: !293, line: 15, baseType: !70, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !446, file: !293, line: 20, baseType: !450, size: 32, offset: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !446, file: !293, line: 16, size: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !450, file: !293, line: 18, baseType: !7, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !450, file: !293, line: 19, baseType: !302, size: 32)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !456, file: !457, line: 211, type: !642, isLocal: true, isDefinition: true)
!456 = distinct !DISubprogram(name: "printf_fetchargs", scope: !457, file: !457, line: 42, type: !458, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !637)
!457 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!458 = !DISubroutineType(types: !459)
!459 = !{!70, !460, !470}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !239, line: 14, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !462, baseType: !463)
!462 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !243, size: 256, elements: !464)
!464 = !{!465, !466, !467, !468, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !463, file: !462, baseType: !69, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !463, file: !462, baseType: !69, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !463, file: !462, baseType: !69, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !463, file: !462, baseType: !70, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !463, file: !462, baseType: !70, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !472, line: 185, baseType: !473)
!472 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 179, size: 1920, elements: !474)
!474 = !{!475, !476, !629}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !473, file: !472, line: 181, baseType: !72, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !473, file: !472, line: 182, baseType: !477, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !472, line: 174, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 111, size: 256, elements: !480)
!480 = !{!481, !532}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !472, line: 113, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !472, line: 108, baseType: !483)
!483 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !472, line: 47, baseType: !7, size: 32, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!485 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!486 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!487 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!488 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!489 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!490 = !DIEnumerator(name: "TYPE_INT", value: 5)
!491 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!492 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!493 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!494 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!495 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!496 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!497 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!498 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!499 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!500 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!501 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!502 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!503 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!504 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!505 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!506 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!507 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!508 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!509 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!510 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!511 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!512 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!513 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!514 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!515 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!516 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!517 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!518 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!519 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!520 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!521 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!522 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!523 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!524 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!525 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!526 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!527 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!528 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!529 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!530 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!531 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !479, file: !472, line: 172, baseType: !533, size: 128, offset: 128)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !479, file: !472, line: 114, size: 128, elements: !534)
!534 = !{!535, !536, !537, !539, !540, !541, !542, !543, !544, !546, !548, !552, !556, !559, !562, !565, !567, !570, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !594, !595, !598, !599, !603, !604, !606, !608, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !533, file: !472, line: 116, baseType: !131, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !533, file: !472, line: 117, baseType: !73, size: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !533, file: !472, line: 118, baseType: !538, size: 16)
!538 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !533, file: !472, line: 119, baseType: !71, size: 16)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !533, file: !472, line: 120, baseType: !70, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !533, file: !472, line: 121, baseType: !7, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !533, file: !472, line: 122, baseType: !42, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !533, file: !472, line: 123, baseType: !32, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !533, file: !472, line: 124, baseType: !545, size: 64)
!545 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !533, file: !472, line: 125, baseType: !547, size: 64)
!547 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !533, file: !472, line: 126, baseType: !549, size: 8)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !550, line: 24, baseType: !551)
!550 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !31, line: 37, baseType: !131)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !533, file: !472, line: 127, baseType: !553, size: 8)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !554, line: 24, baseType: !555)
!554 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !73)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !533, file: !472, line: 128, baseType: !557, size: 16)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !550, line: 25, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !31, line: 39, baseType: !538)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !533, file: !472, line: 129, baseType: !560, size: 16)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !554, line: 25, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !71)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !533, file: !472, line: 130, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !550, line: 26, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 41, baseType: !70)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !533, file: !472, line: 131, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !554, line: 26, baseType: !288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !533, file: !472, line: 132, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !550, line: 27, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !31, line: 44, baseType: !42)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !533, file: !472, line: 133, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !554, line: 27, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 45, baseType: !32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !533, file: !472, line: 134, baseType: !574, size: 8)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !29, line: 58, baseType: !131)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !533, file: !472, line: 135, baseType: !576, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !29, line: 71, baseType: !73)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !533, file: !472, line: 136, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !29, line: 60, baseType: !42)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !533, file: !472, line: 137, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !29, line: 73, baseType: !32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !533, file: !472, line: 138, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !29, line: 61, baseType: !42)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !533, file: !472, line: 139, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !29, line: 74, baseType: !32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !533, file: !472, line: 140, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !29, line: 62, baseType: !42)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !533, file: !472, line: 141, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !29, line: 75, baseType: !32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !533, file: !472, line: 142, baseType: !590, size: 32)
!590 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !533, file: !472, line: 143, baseType: !592, size: 64)
!592 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !533, file: !472, line: 144, baseType: !191, size: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !533, file: !472, line: 145, baseType: !70, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !533, file: !472, line: 147, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !597, line: 20, baseType: !7)
!597 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !533, file: !472, line: 149, baseType: !25, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !533, file: !472, line: 150, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !41, line: 74, baseType: !7)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !533, file: !472, line: 151, baseType: !69, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !533, file: !472, line: 152, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !533, file: !472, line: 153, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !533, file: !472, line: 154, baseType: !171, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !533, file: !472, line: 155, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !533, file: !472, line: 156, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !533, file: !472, line: 157, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !533, file: !472, line: 158, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !533, file: !472, line: 159, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !533, file: !472, line: 160, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !533, file: !472, line: 161, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !533, file: !472, line: 162, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !533, file: !472, line: 163, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !533, file: !472, line: 164, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !473, file: !472, line: 183, baseType: !630, size: 1792, offset: 128)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 1792, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 7)
!633 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !635, globals: !636, splitDebugInlining: false, nameTableKind: None)
!634 = !{!483}
!635 = !{!69}
!636 = !{!454}
!637 = !{!638, !639, !640, !641}
!638 = !DILocalVariable(name: "args", arg: 1, scope: !456, file: !457, line: 42, type: !460)
!639 = !DILocalVariable(name: "a", arg: 2, scope: !456, file: !457, line: 42, type: !470)
!640 = !DILocalVariable(name: "i", scope: !456, file: !457, line: 44, type: !72)
!641 = !DILocalVariable(name: "ap", scope: !456, file: !457, line: 45, type: !477)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 224, elements: !631)
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!649 = !{!25}
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !654, retainedTypes: !659, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!654 = !{!655}
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !656, line: 36, baseType: !7, size: 32, elements: !657)
!656 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!657 = !{!658}
!658 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!659 = !{!72}
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !662, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!662 = !{!663}
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !661, line: 40, baseType: !7, size: 32, elements: !664)
!664 = !{!665}
!665 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!666 = distinct !DICompileUnit(language: DW_LANG_C99, file: !667, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !668, retainedTypes: !696, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!668 = !{!669, !681}
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !670, file: !667, line: 188, baseType: !7, size: 32, elements: !679)
!670 = distinct !DISubprogram(name: "x2nrealloc", scope: !667, file: !667, line: 176, type: !671, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !666, retainedNodes: !674)
!671 = !DISubroutineType(types: !672)
!672 = !{!69, !69, !673, !72}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!674 = !{!675, !676, !677, !678}
!675 = !DILocalVariable(name: "p", arg: 1, scope: !670, file: !667, line: 176, type: !69)
!676 = !DILocalVariable(name: "pn", arg: 2, scope: !670, file: !667, line: 176, type: !673)
!677 = !DILocalVariable(name: "s", arg: 3, scope: !670, file: !667, line: 176, type: !72)
!678 = !DILocalVariable(name: "n", scope: !670, file: !667, line: 178, type: !72)
!679 = !{!680}
!680 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !682, file: !667, line: 228, baseType: !7, size: 32, elements: !679)
!682 = distinct !DISubprogram(name: "xpalloc", scope: !667, file: !667, line: 223, type: !683, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !666, retainedNodes: !686)
!683 = !DISubroutineType(types: !684)
!684 = !{!69, !69, !685, !38, !40, !38}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695}
!687 = !DILocalVariable(name: "pa", arg: 1, scope: !682, file: !667, line: 223, type: !69)
!688 = !DILocalVariable(name: "pn", arg: 2, scope: !682, file: !667, line: 223, type: !685)
!689 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !682, file: !667, line: 223, type: !38)
!690 = !DILocalVariable(name: "n_max", arg: 4, scope: !682, file: !667, line: 223, type: !40)
!691 = !DILocalVariable(name: "s", arg: 5, scope: !682, file: !667, line: 223, type: !38)
!692 = !DILocalVariable(name: "n0", scope: !682, file: !667, line: 230, type: !38)
!693 = !DILocalVariable(name: "n", scope: !682, file: !667, line: 237, type: !38)
!694 = !DILocalVariable(name: "nbytes", scope: !682, file: !667, line: 248, type: !38)
!695 = !DILocalVariable(name: "adjusted_nbytes", scope: !682, file: !667, line: 252, type: !38)
!696 = !{!48, !69, !45, !42, !32}
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/xstrtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9163aa2ba8291d8ce5ef92018250850c")
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/xasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "284d06af3d9f59048744c48dba404142")
!703 = distinct !DICompileUnit(language: DW_LANG_C99, file: !704, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!704 = !DIFile(filename: "lib/asprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f6cf1caf6d38b23e08bf76a6bab2ad95")
!705 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !708, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !714, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!714 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!717 = !{!45, !32, !69}
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !720, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!720 = !{!69, !48}
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !723, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!723 = !{!48, !72, !69, !25, !7}
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !635, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/vaszprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "69851cb8a605f8ae9d51cb31a58ffe0c")
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!734 = !{!72, !735, !69, !790}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !472, line: 174, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !472, line: 111, size: 256, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !472, line: 113, baseType: !482, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !737, file: !472, line: 172, baseType: !741, size: 128, offset: 128)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !737, file: !472, line: 114, size: 128, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !741, file: !472, line: 116, baseType: !131, size: 8)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !741, file: !472, line: 117, baseType: !73, size: 8)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !741, file: !472, line: 118, baseType: !538, size: 16)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !741, file: !472, line: 119, baseType: !71, size: 16)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !741, file: !472, line: 120, baseType: !70, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !741, file: !472, line: 121, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !741, file: !472, line: 122, baseType: !42, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !741, file: !472, line: 123, baseType: !32, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !741, file: !472, line: 124, baseType: !545, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !741, file: !472, line: 125, baseType: !547, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !741, file: !472, line: 126, baseType: !549, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !741, file: !472, line: 127, baseType: !553, size: 8)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !741, file: !472, line: 128, baseType: !557, size: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !741, file: !472, line: 129, baseType: !560, size: 16)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !741, file: !472, line: 130, baseType: !563, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !741, file: !472, line: 131, baseType: !566, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !741, file: !472, line: 132, baseType: !568, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !741, file: !472, line: 133, baseType: !571, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !741, file: !472, line: 134, baseType: !574, size: 8)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !741, file: !472, line: 135, baseType: !576, size: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !741, file: !472, line: 136, baseType: !578, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !741, file: !472, line: 137, baseType: !580, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !741, file: !472, line: 138, baseType: !582, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !741, file: !472, line: 139, baseType: !584, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !741, file: !472, line: 140, baseType: !586, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !741, file: !472, line: 141, baseType: !588, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !741, file: !472, line: 142, baseType: !590, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !741, file: !472, line: 143, baseType: !592, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !741, file: !472, line: 144, baseType: !191, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !741, file: !472, line: 145, baseType: !70, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !741, file: !472, line: 147, baseType: !596, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !741, file: !472, line: 149, baseType: !25, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !741, file: !472, line: 150, baseType: !600, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !741, file: !472, line: 151, baseType: !69, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !741, file: !472, line: 152, baseType: !605, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !741, file: !472, line: 153, baseType: !607, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !741, file: !472, line: 154, baseType: !171, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !741, file: !472, line: 155, baseType: !610, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !741, file: !472, line: 156, baseType: !612, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !741, file: !472, line: 157, baseType: !614, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !741, file: !472, line: 158, baseType: !616, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !741, file: !472, line: 159, baseType: !618, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !741, file: !472, line: 160, baseType: !620, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !741, file: !472, line: 161, baseType: !622, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !741, file: !472, line: 162, baseType: !624, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !741, file: !472, line: 163, baseType: !626, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !741, file: !472, line: 164, baseType: !628, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !792, line: 67, baseType: !793)
!792 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !792, line: 53, size: 704, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !793, file: !792, line: 55, baseType: !25, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !793, file: !792, line: 56, baseType: !25, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !793, file: !792, line: 57, baseType: !70, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !793, file: !792, line: 58, baseType: !25, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !793, file: !792, line: 59, baseType: !25, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !793, file: !792, line: 60, baseType: !72, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !793, file: !792, line: 61, baseType: !25, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !793, file: !792, line: 62, baseType: !25, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !793, file: !792, line: 63, baseType: !72, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !793, file: !792, line: 64, baseType: !27, size: 8, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !793, file: !792, line: 65, baseType: !72, size: 64, offset: 640)
!806 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!807 = !{i32 7, !"Dwarf Version", i32 5}
!808 = !{i32 2, !"Debug Info Version", i32 3}
!809 = !{i32 1, !"wchar_size", i32 4}
!810 = !{i32 1, !"branch-target-enforcement", i32 0}
!811 = !{i32 1, !"sign-return-address", i32 0}
!812 = !{i32 1, !"sign-return-address-all", i32 0}
!813 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!814 = !{i32 7, !"PIC Level", i32 2}
!815 = !{i32 7, !"PIE Level", i32 2}
!816 = !{i32 7, !"uwtable", i32 1}
!817 = !{i32 7, !"frame-pointer", i32 1}
!818 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 75, type: !819, scopeLine: 76, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !70}
!821 = !{!822}
!822 = !DILocalVariable(name: "status", arg: 1, scope: !818, file: !3, line: 75, type: !70)
!823 = !DILocation(line: 0, scope: !818)
!824 = !DILocation(line: 77, column: 14, scope: !825)
!825 = distinct !DILexicalBlock(scope: !818, file: !3, line: 77, column: 7)
!826 = !DILocation(line: 77, column: 7, scope: !818)
!827 = !DILocation(line: 78, column: 5, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !3, line: 78, column: 5)
!829 = !{!830, !830, i64 0}
!830 = !{!"any pointer", !831, i64 0}
!831 = !{!"omnipotent char", !832, i64 0}
!832 = !{!"Simple C/C++ TBAA"}
!833 = !DILocation(line: 81, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !825, file: !3, line: 80, column: 5)
!835 = !DILocation(line: 86, column: 7, scope: !834)
!836 = !DILocation(line: 736, column: 3, scope: !837, inlinedAt: !839)
!837 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !80, file: !80, line: 734, type: !264, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!838 = !{}
!839 = distinct !DILocation(line: 90, column: 7, scope: !834)
!840 = !DILocation(line: 92, column: 7, scope: !834)
!841 = !DILocation(line: 96, column: 7, scope: !834)
!842 = !DILocation(line: 100, column: 7, scope: !834)
!843 = !DILocation(line: 104, column: 7, scope: !834)
!844 = !DILocation(line: 105, column: 7, scope: !834)
!845 = !DILocation(line: 106, column: 7, scope: !834)
!846 = !DILocation(line: 117, column: 7, scope: !834)
!847 = !DILocalVariable(name: "program", arg: 1, scope: !848, file: !80, line: 836, type: !25)
!848 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !80, file: !80, line: 836, type: !849, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !25}
!851 = !{!847, !852, !859, !860, !862, !863}
!852 = !DILocalVariable(name: "infomap", scope: !848, file: !80, line: 838, type: !853)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !854, size: 896, elements: !631)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !848, file: !80, line: 838, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !855, file: !80, line: 838, baseType: !25, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !855, file: !80, line: 838, baseType: !25, size: 64, offset: 64)
!859 = !DILocalVariable(name: "node", scope: !848, file: !80, line: 848, type: !25)
!860 = !DILocalVariable(name: "map_prog", scope: !848, file: !80, line: 849, type: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!862 = !DILocalVariable(name: "lc_messages", scope: !848, file: !80, line: 861, type: !25)
!863 = !DILocalVariable(name: "url_program", scope: !848, file: !80, line: 874, type: !25)
!864 = !DILocation(line: 0, scope: !848, inlinedAt: !865)
!865 = distinct !DILocation(line: 122, column: 7, scope: !834)
!866 = !DILocation(line: 838, column: 3, scope: !848, inlinedAt: !865)
!867 = !DILocation(line: 838, column: 67, scope: !848, inlinedAt: !865)
!868 = !DILocation(line: 849, column: 36, scope: !848, inlinedAt: !865)
!869 = !DILocation(line: 851, column: 3, scope: !848, inlinedAt: !865)
!870 = !DILocalVariable(name: "__s1", arg: 1, scope: !871, file: !872, line: 1359, type: !25)
!871 = distinct !DISubprogram(name: "streq", scope: !872, file: !872, line: 1359, type: !873, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !875)
!872 = !DIFile(filename: "./lib/string.h", directory: "/src")
!873 = !DISubroutineType(types: !874)
!874 = !{!45, !25, !25}
!875 = !{!870, !876}
!876 = !DILocalVariable(name: "__s2", arg: 2, scope: !871, file: !872, line: 1359, type: !25)
!877 = !DILocation(line: 0, scope: !871, inlinedAt: !878)
!878 = distinct !DILocation(line: 851, column: 33, scope: !848, inlinedAt: !865)
!879 = !DILocation(line: 1361, column: 11, scope: !871, inlinedAt: !878)
!880 = !DILocation(line: 1361, column: 10, scope: !871, inlinedAt: !878)
!881 = !DILocation(line: 852, column: 13, scope: !848, inlinedAt: !865)
!882 = !DILocation(line: 851, column: 20, scope: !848, inlinedAt: !865)
!883 = !{!884, !830, i64 0}
!884 = !{!"infomap", !830, i64 0, !830, i64 8}
!885 = !DILocation(line: 851, column: 10, scope: !848, inlinedAt: !865)
!886 = !DILocation(line: 851, column: 28, scope: !848, inlinedAt: !865)
!887 = distinct !{!887, !869, !881, !888}
!888 = !{!"llvm.loop.mustprogress"}
!889 = !DILocation(line: 854, column: 17, scope: !890, inlinedAt: !865)
!890 = distinct !DILexicalBlock(scope: !848, file: !80, line: 854, column: 7)
!891 = !{!884, !830, i64 8}
!892 = !DILocation(line: 854, column: 7, scope: !890, inlinedAt: !865)
!893 = !DILocation(line: 854, column: 7, scope: !848, inlinedAt: !865)
!894 = !DILocation(line: 857, column: 3, scope: !848, inlinedAt: !865)
!895 = !DILocation(line: 861, column: 29, scope: !848, inlinedAt: !865)
!896 = !DILocation(line: 862, column: 7, scope: !897, inlinedAt: !865)
!897 = distinct !DILexicalBlock(scope: !848, file: !80, line: 862, column: 7)
!898 = !DILocation(line: 862, column: 19, scope: !897, inlinedAt: !865)
!899 = !DILocation(line: 862, column: 22, scope: !897, inlinedAt: !865)
!900 = !DILocation(line: 862, column: 7, scope: !848, inlinedAt: !865)
!901 = !DILocation(line: 868, column: 7, scope: !902, inlinedAt: !865)
!902 = distinct !DILexicalBlock(scope: !897, file: !80, line: 863, column: 5)
!903 = !DILocation(line: 870, column: 5, scope: !902, inlinedAt: !865)
!904 = !DILocation(line: 0, scope: !871, inlinedAt: !905)
!905 = distinct !DILocation(line: 874, column: 29, scope: !848, inlinedAt: !865)
!906 = !DILocation(line: 875, column: 3, scope: !848, inlinedAt: !865)
!907 = !DILocation(line: 877, column: 3, scope: !848, inlinedAt: !865)
!908 = !DILocation(line: 879, column: 1, scope: !848, inlinedAt: !865)
!909 = !DILocation(line: 124, column: 3, scope: !818)
!910 = !DISubprogram(name: "dcgettext", scope: !911, file: !911, line: 51, type: !912, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!911 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!912 = !DISubroutineType(types: !913)
!913 = !{!48, !25, !25, !70}
!914 = !DISubprogram(name: "fputs_unlocked", scope: !237, file: !237, line: 691, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!915 = !DISubroutineType(types: !916)
!916 = !{!70, !917, !918}
!917 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !25)
!918 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !102)
!919 = !DILocation(line: 0, scope: !79)
!920 = !DILocation(line: 581, column: 7, scope: !88)
!921 = !{!922, !922, i64 0}
!922 = !{!"int", !831, i64 0}
!923 = !DILocation(line: 581, column: 19, scope: !88)
!924 = !DILocation(line: 581, column: 7, scope: !79)
!925 = !DILocation(line: 585, column: 26, scope: !87)
!926 = !DILocation(line: 0, scope: !87)
!927 = !DILocation(line: 586, column: 23, scope: !87)
!928 = !DILocation(line: 586, column: 28, scope: !87)
!929 = !DILocation(line: 586, column: 32, scope: !87)
!930 = !{!831, !831, i64 0}
!931 = !DILocation(line: 586, column: 38, scope: !87)
!932 = !DILocation(line: 0, scope: !871, inlinedAt: !933)
!933 = distinct !DILocation(line: 586, column: 41, scope: !87)
!934 = !DILocation(line: 1361, column: 11, scope: !871, inlinedAt: !933)
!935 = !DILocation(line: 1361, column: 10, scope: !871, inlinedAt: !933)
!936 = !DILocation(line: 586, column: 19, scope: !87)
!937 = !DILocation(line: 587, column: 5, scope: !87)
!938 = !DILocation(line: 588, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !79, file: !80, line: 588, column: 7)
!940 = !DILocation(line: 588, column: 7, scope: !79)
!941 = !DILocation(line: 590, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !939, file: !80, line: 589, column: 5)
!943 = !DILocation(line: 591, column: 7, scope: !942)
!944 = !DILocation(line: 595, column: 37, scope: !79)
!945 = !DILocation(line: 595, column: 35, scope: !79)
!946 = !DILocation(line: 596, column: 29, scope: !79)
!947 = !DILocation(line: 597, column: 8, scope: !95)
!948 = !DILocation(line: 597, column: 7, scope: !79)
!949 = !DILocation(line: 604, column: 24, scope: !94)
!950 = !DILocation(line: 604, column: 12, scope: !95)
!951 = !DILocation(line: 0, scope: !93)
!952 = !DILocation(line: 610, column: 16, scope: !93)
!953 = !DILocation(line: 610, column: 7, scope: !93)
!954 = !DILocation(line: 611, column: 21, scope: !93)
!955 = !{!956, !956, i64 0}
!956 = !{!"short", !831, i64 0}
!957 = !DILocation(line: 611, column: 19, scope: !93)
!958 = !DILocation(line: 611, column: 16, scope: !93)
!959 = !DILocation(line: 610, column: 30, scope: !93)
!960 = distinct !{!960, !953, !954, !888}
!961 = !DILocation(line: 612, column: 18, scope: !962)
!962 = distinct !DILexicalBlock(scope: !93, file: !80, line: 612, column: 11)
!963 = !DILocation(line: 612, column: 11, scope: !93)
!964 = !DILocation(line: 620, column: 23, scope: !79)
!965 = !DILocation(line: 625, column: 39, scope: !79)
!966 = !DILocation(line: 626, column: 3, scope: !79)
!967 = !DILocation(line: 626, column: 10, scope: !79)
!968 = !DILocation(line: 626, column: 21, scope: !79)
!969 = !DILocation(line: 628, column: 44, scope: !970)
!970 = distinct !DILexicalBlock(scope: !971, file: !80, line: 628, column: 11)
!971 = distinct !DILexicalBlock(scope: !79, file: !80, line: 627, column: 5)
!972 = !DILocation(line: 628, column: 32, scope: !970)
!973 = !DILocation(line: 628, column: 49, scope: !970)
!974 = !DILocation(line: 628, column: 11, scope: !971)
!975 = !DILocation(line: 630, column: 11, scope: !976)
!976 = distinct !DILexicalBlock(scope: !971, file: !80, line: 630, column: 11)
!977 = !DILocation(line: 630, column: 11, scope: !971)
!978 = !DILocation(line: 632, column: 26, scope: !979)
!979 = distinct !DILexicalBlock(scope: !980, file: !80, line: 632, column: 15)
!980 = distinct !DILexicalBlock(scope: !976, file: !80, line: 631, column: 9)
!981 = !DILocation(line: 632, column: 34, scope: !979)
!982 = !DILocation(line: 632, column: 37, scope: !979)
!983 = !DILocation(line: 632, column: 15, scope: !980)
!984 = !DILocation(line: 636, column: 29, scope: !985)
!985 = distinct !DILexicalBlock(scope: !980, file: !80, line: 636, column: 15)
!986 = !DILocation(line: 640, column: 16, scope: !971)
!987 = distinct !{!987, !966, !988, !888}
!988 = !DILocation(line: 641, column: 5, scope: !79)
!989 = !DILocation(line: 644, column: 3, scope: !79)
!990 = !DILocation(line: 0, scope: !871, inlinedAt: !991)
!991 = distinct !DILocation(line: 648, column: 31, scope: !79)
!992 = !DILocation(line: 0, scope: !871, inlinedAt: !993)
!993 = distinct !DILocation(line: 649, column: 31, scope: !79)
!994 = !DILocation(line: 0, scope: !871, inlinedAt: !995)
!995 = distinct !DILocation(line: 650, column: 31, scope: !79)
!996 = !DILocation(line: 0, scope: !871, inlinedAt: !997)
!997 = distinct !DILocation(line: 651, column: 31, scope: !79)
!998 = !DILocation(line: 0, scope: !871, inlinedAt: !999)
!999 = distinct !DILocation(line: 652, column: 31, scope: !79)
!1000 = !DILocation(line: 0, scope: !871, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 653, column: 31, scope: !79)
!1002 = !DILocation(line: 0, scope: !871, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 654, column: 31, scope: !79)
!1004 = !DILocation(line: 0, scope: !871, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 655, column: 31, scope: !79)
!1006 = !DILocation(line: 0, scope: !871, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 656, column: 31, scope: !79)
!1008 = !DILocation(line: 0, scope: !871, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 657, column: 31, scope: !79)
!1010 = !DILocation(line: 663, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !79, file: !80, line: 663, column: 7)
!1012 = !DILocation(line: 664, column: 7, scope: !1011)
!1013 = !DILocation(line: 664, column: 10, scope: !1011)
!1014 = !DILocation(line: 663, column: 7, scope: !79)
!1015 = !DILocation(line: 669, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !80, line: 665, column: 5)
!1017 = !DILocation(line: 671, column: 5, scope: !1016)
!1018 = !DILocation(line: 676, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1011, file: !80, line: 673, column: 5)
!1020 = !DILocation(line: 679, column: 3, scope: !79)
!1021 = !DILocation(line: 683, column: 3, scope: !79)
!1022 = !DILocation(line: 686, column: 3, scope: !79)
!1023 = !DILocation(line: 688, column: 3, scope: !79)
!1024 = !DILocation(line: 691, column: 3, scope: !79)
!1025 = !DILocation(line: 695, column: 3, scope: !79)
!1026 = !DILocation(line: 696, column: 1, scope: !79)
!1027 = !DISubprogram(name: "setlocale", scope: !1028, file: !1028, line: 122, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1028 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!48, !70, !25}
!1031 = !DISubprogram(name: "getenv", scope: !1032, file: !1032, line: 641, type: !1033, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1032 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!48, !25}
!1035 = !DISubprogram(name: "fwrite_unlocked", scope: !237, file: !237, line: 704, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !838)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!72, !1038, !72, !72, !918}
!1038 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1041 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 550, type: !1042, scopeLine: 551, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1045)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!70, !70, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!1045 = !{!1046, !1047, !1048, !1049, !1051, !1052, !1057, !1058, !1059, !1060, !1063, !1064, !1065, !1066, !1069}
!1046 = !DILocalVariable(name: "argc", arg: 1, scope: !1041, file: !3, line: 550, type: !70)
!1047 = !DILocalVariable(name: "argv", arg: 2, scope: !1041, file: !3, line: 550, type: !1044)
!1048 = !DILocalVariable(name: "format_str", scope: !1041, file: !3, line: 553, type: !25)
!1049 = !DILocalVariable(name: "optc", scope: !1050, file: !3, line: 568, type: !70)
!1050 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 567, column: 5)
!1051 = !DILocalVariable(name: "n_args", scope: !1041, file: !3, line: 603, type: !70)
!1052 = !DILocalVariable(name: "layout", scope: !1041, file: !3, line: 616, type: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "layout", file: !3, line: 146, size: 128, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_len", scope: !1053, file: !3, line: 149, baseType: !72, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "suffix_len", scope: !1053, file: !3, line: 150, baseType: !72, size: 64, offset: 64)
!1057 = !DILocalVariable(name: "user_start", scope: !1041, file: !3, line: 627, type: !25)
!1058 = !DILocalVariable(name: "step", scope: !1041, file: !3, line: 636, type: !187)
!1059 = !DILocalVariable(name: "fast_step_ok", scope: !1041, file: !3, line: 637, type: !45)
!1060 = !DILocalVariable(name: "s1", scope: !1061, file: !3, line: 650, type: !25)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 649, column: 5)
!1062 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 644, column: 7)
!1063 = !DILocalVariable(name: "s2", scope: !1061, file: !3, line: 651, type: !25)
!1064 = !DILocalVariable(name: "first", scope: !1041, file: !3, line: 655, type: !187)
!1065 = !DILocalVariable(name: "last", scope: !1041, file: !3, line: 656, type: !187)
!1066 = !DILocalVariable(name: "s1", scope: !1067, file: !3, line: 684, type: !48)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !3, line: 683, column: 5)
!1068 = distinct !DILexicalBlock(scope: !1041, file: !3, line: 679, column: 7)
!1069 = !DILocalVariable(name: "s2", scope: !1067, file: !3, line: 687, type: !48)
!1070 = !DILocation(line: 0, scope: !1041)
!1071 = !DILocation(line: 556, column: 21, scope: !1041)
!1072 = !DILocation(line: 556, column: 3, scope: !1041)
!1073 = !DILocation(line: 557, column: 17, scope: !1041)
!1074 = !DILocation(line: 557, column: 16, scope: !1041)
!1075 = !DILocation(line: 557, column: 13, scope: !1041)
!1076 = !{!1077, !1077, i64 0}
!1077 = !{!"_Bool", !831, i64 0}
!1078 = !DILocation(line: 558, column: 3, scope: !1041)
!1079 = !DILocation(line: 559, column: 3, scope: !1041)
!1080 = !DILocation(line: 561, column: 3, scope: !1041)
!1081 = !DILocation(line: 566, column: 10, scope: !1041)
!1082 = !DILocation(line: 566, column: 17, scope: !1041)
!1083 = !DILocation(line: 566, column: 3, scope: !1041)
!1084 = !DILocation(line: 569, column: 11, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 569, column: 11)
!1086 = !DILocation(line: 569, column: 27, scope: !1085)
!1087 = !DILocation(line: 570, column: 11, scope: !1085)
!1088 = !DILocation(line: 570, column: 23, scope: !1085)
!1089 = !DILocation(line: 0, scope: !1050)
!1090 = !DILocation(line: 570, column: 40, scope: !1085)
!1091 = !DILocation(line: 570, column: 47, scope: !1085)
!1092 = !DILocalVariable(name: "c", arg: 1, scope: !1093, file: !1094, line: 233, type: !70)
!1093 = distinct !DISubprogram(name: "c_isdigit", scope: !1094, file: !1094, line: 233, type: !1095, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1097)
!1094 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!45, !70}
!1097 = !{!1092}
!1098 = !DILocation(line: 0, scope: !1093, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 570, column: 50, scope: !1085)
!1100 = !DILocation(line: 576, column: 14, scope: !1050)
!1101 = !DILocation(line: 577, column: 11, scope: !1050)
!1102 = !DILocation(line: 603, column: 23, scope: !1041)
!1103 = !DILocation(line: 583, column: 24, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 581, column: 9)
!1105 = !DILocation(line: 584, column: 11, scope: !1104)
!1106 = !DILocation(line: 587, column: 23, scope: !1104)
