; ModuleID = 'src/shred.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.randint_source = type { %struct.randread_source*, i64, i64 }
%struct.randread_source = type { %struct._IO_FILE*, void (i8*)*, i8*, %union.anon.25 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.anon.25 = type { %struct.isaac }
%struct.isaac = type { i64, %struct.isaac_state, %union.anon.0 }
%struct.isaac_state = type { [256 x i64], i64, i64, i64 }
%union.anon.0 = type { [256 x i64] }
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.Options = type { i8, i64, i64, i32, i8, i8, i8 }
%struct.mtop = type { i16, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

!57 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!58 = !DIEnumerator(name: "human_autoscale", value: 16)
!59 = !DIEnumerator(name: "human_base_1024", value: 32)
!60 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!61 = !DIEnumerator(name: "human_SI", value: 128)
!62 = !DIEnumerator(name: "human_B", value: 256)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 108, baseType: !6, size: 32, elements: !64)
!64 = !{!65}
!65 = !DIEnumerator(name: "SECTOR_SIZE", value: 512)
!66 = !{!67, !68, !70, !75, !77, !78, !79, !82, !84, !85}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !71, line: 63, baseType: !72)
!71 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !73, line: 152, baseType: !74)
!73 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!74 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!81 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!84 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!85 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!86 = !{!87, !92, !0, !175, !181, !187, !193}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "randint_source", scope: !2, file: !3, line: 1169, type: !89, isLocal: true, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "randint_source", file: !91, line: 33, flags: DIFlagFwdDecl)
!91 = !DIFile(filename: "./lib/randint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "28ec191ae1fe18b14ea27fd20962a86a")
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !94, file: !95, line: 575, type: !77, isLocal: true, isDefinition: true)
!94 = distinct !DISubprogram(name: "oputs_", scope: !95, file: !95, line: 573, type: !96, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !98)
!95 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!96 = !DISubroutineType(types: !97)
!97 = !{null, !82, !82}
!98 = !{!99, !100, !101, !104, !105, !106, !107, !111, !112, !113, !114, !116, !169, !170, !171, !173, !174}
!99 = !DILocalVariable(name: "program", arg: 1, scope: !94, file: !95, line: 573, type: !82)
!100 = !DILocalVariable(name: "option", arg: 2, scope: !94, file: !95, line: 573, type: !82)
!101 = !DILocalVariable(name: "term", scope: !102, file: !95, line: 585, type: !82)
!102 = distinct !DILexicalBlock(scope: !103, file: !95, line: 582, column: 5)
!103 = distinct !DILexicalBlock(scope: !94, file: !95, line: 581, column: 7)
!104 = !DILocalVariable(name: "double_space", scope: !94, file: !95, line: 594, type: !85)
!105 = !DILocalVariable(name: "first_word", scope: !94, file: !95, line: 595, type: !82)
!106 = !DILocalVariable(name: "option_text", scope: !94, file: !95, line: 596, type: !82)
!107 = !DILocalVariable(name: "s", scope: !108, file: !95, line: 608, type: !82)
!108 = distinct !DILexicalBlock(scope: !109, file: !95, line: 605, column: 5)
!109 = distinct !DILexicalBlock(scope: !110, file: !95, line: 604, column: 12)
!110 = distinct !DILexicalBlock(scope: !94, file: !95, line: 597, column: 7)
!111 = !DILocalVariable(name: "spaces", scope: !108, file: !95, line: 609, type: !79)
!112 = !DILocalVariable(name: "anchor_len", scope: !94, file: !95, line: 620, type: !79)
!113 = !DILocalVariable(name: "desc_text", scope: !94, file: !95, line: 625, type: !82)
!114 = !DILocalVariable(name: "__ptr", scope: !115, file: !95, line: 644, type: !82)
!115 = distinct !DILexicalBlock(scope: !94, file: !95, line: 644, column: 3)
!116 = !DILocalVariable(name: "__stream", scope: !115, file: !95, line: 644, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !119, line: 7, baseType: !120)
!119 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !121, line: 49, size: 1728, elements: !122)
!121 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !140, !141, !142, !143, !144, !146, !150, !153, !155, !158, !161, !162, !163, !164, !165}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !120, file: !121, line: 51, baseType: !77, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !120, file: !121, line: 54, baseType: !75, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !120, file: !121, line: 55, baseType: !75, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !120, file: !121, line: 56, baseType: !75, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !120, file: !121, line: 57, baseType: !75, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !120, file: !121, line: 58, baseType: !75, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !120, file: !121, line: 59, baseType: !75, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !120, file: !121, line: 60, baseType: !75, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !120, file: !121, line: 61, baseType: !75, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !120, file: !121, line: 64, baseType: !75, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !120, file: !121, line: 65, baseType: !75, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !120, file: !121, line: 66, baseType: !75, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !120, file: !121, line: 68, baseType: !136, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !121, line: 36, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !120, file: !121, line: 70, baseType: !139, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !120, file: !121, line: 72, baseType: !77, size: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !120, file: !121, line: 73, baseType: !77, size: 32, offset: 928)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !120, file: !121, line: 74, baseType: !72, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !120, file: !121, line: 77, baseType: !78, size: 16, offset: 1024)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !120, file: !121, line: 78, baseType: !145, size: 8, offset: 1040)
!145 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !120, file: !121, line: 79, baseType: !147, size: 8, offset: 1048)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 1)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !120, file: !121, line: 81, baseType: !151, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !121, line: 43, baseType: null)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !120, file: !121, line: 89, baseType: !154, size: 64, offset: 1152)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !73, line: 153, baseType: !74)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !120, file: !121, line: 91, baseType: !156, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !121, line: 37, flags: DIFlagFwdDecl)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !120, file: !121, line: 92, baseType: !159, size: 64, offset: 1280)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !121, line: 38, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !120, file: !121, line: 93, baseType: !139, size: 64, offset: 1344)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !120, file: !121, line: 94, baseType: !67, size: 64, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !120, file: !121, line: 95, baseType: !79, size: 64, offset: 1472)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !120, file: !121, line: 96, baseType: !77, size: 32, offset: 1536)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !120, file: !121, line: 98, baseType: !166, size: 160, offset: 1568)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 20)
!169 = !DILocalVariable(name: "__cnt", scope: !115, file: !95, line: 644, type: !79)
!170 = !DILocalVariable(name: "url_program", scope: !94, file: !95, line: 648, type: !82)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !95, line: 686, type: !82)
!172 = distinct !DILexicalBlock(scope: !94, file: !95, line: 686, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !95, line: 686, type: !117)
!174 = !DILocalVariable(name: "__cnt", scope: !172, file: !95, line: 686, type: !79)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "remove_methods", scope: !2, file: !3, line: 125, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 96, elements: !179)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!179 = !{!180}
!180 = !DISubrange(count: 3)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "remove_args", scope: !2, file: !3, line: 120, type: !183, isLocal: true, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 256, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!185 = !{!186}
!186 = !DISubrange(count: 4)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "patterns", scope: !2, file: !3, line: 697, type: !189, isLocal: true, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 1760, elements: !191)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!191 = !{!192}
!192 = !DISubrange(count: 55)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "nameset", scope: !2, file: !3, line: 998, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 520, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 65)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 2816, elements: !208)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !201, line: 50, size: 256, elements: !202)
!201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!202 = !{!203, !204, !205, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !201, line: 52, baseType: !82, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !200, file: !201, line: 55, baseType: !77, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 56, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !200, file: !201, line: 57, baseType: !77, size: 32, offset: 192)
!208 = !{!209}
!209 = !DISubrange(count: 11)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "Version", scope: !212, file: !213, line: 3, type: !82, isLocal: false, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !214, splitDebugInlining: false, nameTableKind: None)
!213 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!214 = !{!210}
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !217, file: !218, line: 65, type: !222, isLocal: false, isDefinition: true)
!217 = distinct !DICompileUnit(language: DW_LANG_C99, file: !218, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !219, retainedTypes: !220, globals: !221, splitDebugInlining: false, nameTableKind: None)
!218 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!219 = !{!15}
!220 = !{!67, !82, !84}
!221 = !{!215}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !223, line: 69, baseType: !224)
!223 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{null}
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "file_name", scope: !229, file: !230, line: 45, type: !82, isLocal: true, isDefinition: true)
!229 = distinct !DICompileUnit(language: DW_LANG_C99, file: !230, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !231, splitDebugInlining: false, nameTableKind: None)
!230 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!231 = !{!227, !232}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !229, file: !230, line: 55, type: !85, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !236, file: !237, line: 66, type: !224, isLocal: false, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !238, globals: !239, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!238 = !{!67, !84}
!239 = !{!240, !265, !234, !267, !269}
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "old_file_name", scope: !242, file: !237, line: 304, type: !82, isLocal: true, isDefinition: true)
!242 = distinct !DISubprogram(name: "verror_at_line", scope: !237, file: !237, line: 298, type: !243, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !258)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !77, !77, !82, !6, !82, !245}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !71, line: 52, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !247, line: 32, baseType: !248)
!247 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !249, baseType: !250)
!249 = !DIFile(filename: "lib/error.c", directory: "/src")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !251, size: 256, elements: !252)
!251 = !DINamespace(name: "std", scope: null)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !250, file: !249, baseType: !67, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !250, file: !249, baseType: !67, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !250, file: !249, baseType: !67, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !250, file: !249, baseType: !77, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !250, file: !249, baseType: !77, size: 32, offset: 224)
!258 = !{!259, !260, !261, !262, !263, !264}
!259 = !DILocalVariable(name: "status", arg: 1, scope: !242, file: !237, line: 298, type: !77)
!260 = !DILocalVariable(name: "errnum", arg: 2, scope: !242, file: !237, line: 298, type: !77)
!261 = !DILocalVariable(name: "file_name", arg: 3, scope: !242, file: !237, line: 298, type: !82)
!262 = !DILocalVariable(name: "line_number", arg: 4, scope: !242, file: !237, line: 298, type: !6)
!263 = !DILocalVariable(name: "message", arg: 5, scope: !242, file: !237, line: 298, type: !82)
!264 = !DILocalVariable(name: "args", arg: 6, scope: !242, file: !237, line: 298, type: !245)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "old_line_number", scope: !242, file: !237, line: 305, type: !6, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "error_message_count", scope: !236, file: !237, line: 69, type: !6, isLocal: false, isDefinition: true)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !236, file: !237, line: 295, type: !77, isLocal: false, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !273, file: !274, line: 506, type: !77, isLocal: true, isDefinition: true)
!273 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !274, file: !274, line: 485, type: !275, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !277, retainedNodes: !279)
!274 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!275 = !DISubroutineType(types: !276)
!276 = !{!77, !77, !77}
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !278, splitDebugInlining: false, nameTableKind: None)
!278 = !{!271}
!279 = !{!280, !281, !282, !283, !286}
!280 = !DILocalVariable(name: "fd", arg: 1, scope: !273, file: !274, line: 485, type: !77)
!281 = !DILocalVariable(name: "target", arg: 2, scope: !273, file: !274, line: 485, type: !77)
!282 = !DILocalVariable(name: "result", scope: !273, file: !274, line: 487, type: !77)
!283 = !DILocalVariable(name: "flags", scope: !284, file: !274, line: 530, type: !77)
!284 = distinct !DILexicalBlock(scope: !285, file: !274, line: 529, column: 5)
!285 = distinct !DILexicalBlock(scope: !273, file: !274, line: 528, column: 7)
!286 = !DILocalVariable(name: "saved_errno", scope: !287, file: !274, line: 533, type: !77)
!287 = distinct !DILexicalBlock(scope: !288, file: !274, line: 532, column: 9)
!288 = distinct !DILexicalBlock(scope: !284, file: !274, line: 531, column: 11)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "power_letter", scope: !291, file: !292, line: 36, type: !312, isLocal: true, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !293, retainedTypes: !302, globals: !303, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!293 = !{!50, !294}
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !295, line: 30, baseType: !6, size: 32, elements: !296)
!295 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!296 = !{!297, !298, !299, !300, !301}
!297 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!298 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!299 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!300 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!301 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!302 = !{!68}
!303 = !{!289, !304, !307}
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "block_size_args", scope: !291, file: !292, line: 398, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 192, elements: !179)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !291, file: !292, line: 399, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 2)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 88, elements: !208)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "program_name", scope: !315, file: !316, line: 31, type: !82, isLocal: false, isDefinition: true)
!315 = distinct !DICompileUnit(language: DW_LANG_C99, file: !316, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !317, globals: !318, splitDebugInlining: false, nameTableKind: None)
!316 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!317 = !{!75}
!318 = !{!313}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "utf07FF", scope: !321, file: !322, line: 46, type: !350, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "proper_name_lite", scope: !322, file: !322, line: 38, type: !323, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !325, retainedNodes: !327)
!322 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!323 = !DISubroutineType(types: !324)
!324 = !{!82, !82, !82}
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !326, splitDebugInlining: false, nameTableKind: None)
!326 = !{!319}
!327 = !{!328, !329, !330, !331, !336}
!328 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !321, file: !322, line: 38, type: !82)
!329 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !321, file: !322, line: 38, type: !82)
!330 = !DILocalVariable(name: "translation", scope: !321, file: !322, line: 40, type: !82)
!331 = !DILocalVariable(name: "w", scope: !321, file: !322, line: 47, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !333, line: 37, baseType: !334)
!333 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !73, line: 57, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !73, line: 42, baseType: !6)
!336 = !DILocalVariable(name: "mbs", scope: !321, file: !322, line: 48, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !338, line: 6, baseType: !339)
!338 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !340, line: 21, baseType: !341)
!340 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 13, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !341, file: !340, line: 15, baseType: !77, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !341, file: !340, line: 20, baseType: !345, size: 32, offset: 32)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !341, file: !340, line: 16, size: 32, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !345, file: !340, line: 18, baseType: !6, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !345, file: !340, line: 19, baseType: !349, size: 32)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !185)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 16, elements: !310)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !353, file: !354, line: 76, type: !422, isLocal: false, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !355, retainedTypes: !361, globals: !362, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!355 = !{!15, !356, !29}
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !16, line: 254, baseType: !6, size: 32, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!359 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!360 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!361 = !{!77, !78, !79}
!362 = !{!351, !363, !369, !381, !383, !388, !411, !418, !420}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !353, file: !354, line: 92, type: !365, isLocal: false, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 320, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!367 = !{!368}
!368 = !DISubrange(count: 10)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !353, file: !354, line: 1040, type: !371, isLocal: false, isDefinition: true)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !354, line: 56, size: 448, elements: !372)
!372 = !{!373, !374, !375, !379, !380}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !371, file: !354, line: 59, baseType: !15, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !371, file: !354, line: 62, baseType: !77, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !371, file: !354, line: 66, baseType: !376, size: 256, offset: 64)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 8)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !371, file: !354, line: 69, baseType: !82, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !371, file: !354, line: 72, baseType: !82, size: 64, offset: 384)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !353, file: !354, line: 107, type: !371, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "slot0", scope: !353, file: !354, line: 831, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 256)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "quote", scope: !390, file: !354, line: 228, type: !409, isLocal: true, isDefinition: true)
!390 = distinct !DISubprogram(name: "gettext_quote", scope: !354, file: !354, line: 197, type: !391, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{!82, !82, !15}
!393 = !{!394, !395, !396, !397, !398}
!394 = !DILocalVariable(name: "msgid", arg: 1, scope: !390, file: !354, line: 197, type: !82)
!395 = !DILocalVariable(name: "s", arg: 2, scope: !390, file: !354, line: 197, type: !15)
!396 = !DILocalVariable(name: "translation", scope: !390, file: !354, line: 199, type: !82)
!397 = !DILocalVariable(name: "w", scope: !390, file: !354, line: 229, type: !332)
!398 = !DILocalVariable(name: "mbs", scope: !390, file: !354, line: 230, type: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !338, line: 6, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !340, line: 21, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 13, size: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !401, file: !340, line: 15, baseType: !77, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !401, file: !340, line: 20, baseType: !405, size: 32, offset: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !340, line: 16, size: 32, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !405, file: !340, line: 18, baseType: !6, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !405, file: !340, line: 19, baseType: !349, size: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !410)
!410 = !{!311, !186}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "slotvec", scope: !353, file: !354, line: 834, type: !413, isLocal: true, isDefinition: true)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !354, line: 823, size: 128, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !414, file: !354, line: 825, baseType: !79, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !414, file: !354, line: 826, baseType: !75, size: 64, offset: 64)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "nslots", scope: !353, file: !354, line: 832, type: !77, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slotvec0", scope: !353, file: !354, line: 833, type: !414, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 704, elements: !208)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !425, file: !426, line: 26, type: !428, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !427, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!427 = !{!423}
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 376, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 47)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "exit_failure", scope: !433, file: !434, line: 24, type: !436, isLocal: false, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !435, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!435 = !{!431}
!436 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "internal_state", scope: !439, file: !440, line: 97, type: !443, isLocal: true, isDefinition: true)
!439 = distinct !DICompileUnit(language: DW_LANG_C99, file: !440, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !441, globals: !442, splitDebugInlining: false, nameTableKind: None)
!440 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!441 = !{!67, !79, !84}
!442 = !{!437}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !338, line: 6, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !340, line: 21, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !340, line: 13, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !445, file: !340, line: 15, baseType: !77, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !445, file: !340, line: 20, baseType: !449, size: 32, offset: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !340, line: 16, size: 32, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !449, file: !340, line: 18, baseType: !6, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !449, file: !340, line: 19, baseType: !349, size: 32)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !455, file: !456, line: 211, type: !643, isLocal: true, isDefinition: true)
!455 = distinct !DISubprogram(name: "printf_fetchargs", scope: !456, file: !456, line: 42, type: !457, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !634, retainedNodes: !638)
!456 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!457 = !DISubroutineType(types: !458)
!458 = !{!77, !459, !469}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !247, line: 14, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !461, baseType: !462)
!461 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !251, size: 256, elements: !463)
!463 = !{!464, !465, !466, !467, !468}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !462, file: !461, baseType: !67, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !462, file: !461, baseType: !67, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !462, file: !461, baseType: !67, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !462, file: !461, baseType: !77, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !462, file: !461, baseType: !77, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !471, line: 185, baseType: !472)
!471 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 179, size: 1920, elements: !473)
!473 = !{!474, !475, !630}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !472, file: !471, line: 181, baseType: !79, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !472, file: !471, line: 182, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !471, line: 174, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 111, size: 256, elements: !479)
!479 = !{!480, !531}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !471, line: 113, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !471, line: 108, baseType: !482)
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !471, line: 47, baseType: !6, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!484 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!485 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!486 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!487 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!488 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!489 = !DIEnumerator(name: "TYPE_INT", value: 5)
!490 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!491 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!492 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!493 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!494 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!495 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!496 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!497 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!498 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!499 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!500 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!501 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!502 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!503 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!504 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!505 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!506 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!507 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!508 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!509 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!510 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!511 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!512 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!513 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!514 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!515 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!516 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!517 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!518 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!519 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!520 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!521 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!522 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!523 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!524 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!525 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!526 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!527 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!528 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!529 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!530 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !478, file: !471, line: 172, baseType: !532, size: 128, offset: 128)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !478, file: !471, line: 114, size: 128, elements: !533)
!533 = !{!534, !535, !536, !538, !539, !540, !541, !542, !543, !545, !547, !551, !555, !558, !561, !564, !566, !569, !572, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !596, !599, !600, !604, !605, !607, !609, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !532, file: !471, line: 116, baseType: !145, size: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !532, file: !471, line: 117, baseType: !84, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !532, file: !471, line: 118, baseType: !537, size: 16)
!537 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !532, file: !471, line: 119, baseType: !78, size: 16)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !532, file: !471, line: 120, baseType: !77, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !532, file: !471, line: 121, baseType: !6, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !532, file: !471, line: 122, baseType: !74, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !532, file: !471, line: 123, baseType: !81, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !532, file: !471, line: 124, baseType: !544, size: 64)
!544 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !532, file: !471, line: 125, baseType: !546, size: 64)
!546 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !532, file: !471, line: 126, baseType: !548, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !549, line: 24, baseType: !550)
!549 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !73, line: 37, baseType: !145)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !532, file: !471, line: 127, baseType: !552, size: 8)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !553, line: 24, baseType: !554)
!553 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !73, line: 38, baseType: !84)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !532, file: !471, line: 128, baseType: !556, size: 16)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !549, line: 25, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !73, line: 39, baseType: !537)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !532, file: !471, line: 129, baseType: !559, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !553, line: 25, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !73, line: 40, baseType: !78)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !532, file: !471, line: 130, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !549, line: 26, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !73, line: 41, baseType: !77)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !532, file: !471, line: 131, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !553, line: 26, baseType: !335)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !532, file: !471, line: 132, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !549, line: 27, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !73, line: 44, baseType: !74)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !532, file: !471, line: 133, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !553, line: 27, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !73, line: 45, baseType: !81)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !532, file: !471, line: 134, baseType: !573, size: 8)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !574, line: 58, baseType: !145)
!574 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !532, file: !471, line: 135, baseType: !576, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !574, line: 71, baseType: !84)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !532, file: !471, line: 136, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !574, line: 60, baseType: !74)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !532, file: !471, line: 137, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !574, line: 73, baseType: !81)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !532, file: !471, line: 138, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !574, line: 61, baseType: !74)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !532, file: !471, line: 139, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !574, line: 74, baseType: !81)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !532, file: !471, line: 140, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !574, line: 62, baseType: !74)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !532, file: !471, line: 141, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !574, line: 75, baseType: !81)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !532, file: !471, line: 142, baseType: !590, size: 32)
!590 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !532, file: !471, line: 143, baseType: !592, size: 64)
!592 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !532, file: !471, line: 144, baseType: !594, size: 128)
!594 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !532, file: !471, line: 145, baseType: !77, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !532, file: !471, line: 147, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !598, line: 20, baseType: !6)
!598 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!599 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !532, file: !471, line: 149, baseType: !82, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !532, file: !471, line: 150, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !80, line: 74, baseType: !6)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !532, file: !471, line: 151, baseType: !67, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !532, file: !471, line: 152, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !532, file: !471, line: 153, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !532, file: !471, line: 154, baseType: !206, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !532, file: !471, line: 155, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !532, file: !471, line: 156, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !532, file: !471, line: 157, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !532, file: !471, line: 158, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !532, file: !471, line: 159, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !532, file: !471, line: 160, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !532, file: !471, line: 161, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !532, file: !471, line: 162, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !532, file: !471, line: 163, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !532, file: !471, line: 164, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !472, file: !471, line: 183, baseType: !631, size: 1792, offset: 128)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 1792, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 7)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !636, globals: !637, splitDebugInlining: false, nameTableKind: None)
!635 = !{!482}
!636 = !{!67}
!637 = !{!453}
!638 = !{!639, !640, !641, !642}
!639 = !DILocalVariable(name: "args", arg: 1, scope: !455, file: !456, line: 42, type: !459)
!640 = !DILocalVariable(name: "a", arg: 2, scope: !455, file: !456, line: 42, type: !469)
!641 = !DILocalVariable(name: "i", scope: !455, file: !456, line: 44, type: !79)
!642 = !DILocalVariable(name: "ap", scope: !455, file: !456, line: 45, type: !476)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 224, elements: !632)
!644 = distinct !DICompileUnit(language: DW_LANG_C99, file: !645, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !317, splitDebugInlining: false, nameTableKind: None)
!645 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!646 = distinct !DICompileUnit(language: DW_LANG_C99, file: !647, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!647 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/gethrxtime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2abae07bd356ebe51c13e20c33e0c4bf")
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/randint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "11f435a81221ba750eb474b22ae06eb8")
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/randread.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2a439877b8fd91186e97781a416043df")
!662 = !{!79}
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !665, retainedTypes: !718, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/rand-isaac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d44161d8d093b6cf59f0cc9f71c527c2")
!665 = !{!666}
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !667, file: !664, line: 100, baseType: !6, size: 32, elements: !716)
!667 = distinct !DISubprogram(name: "isaac_refill", scope: !664, file: !664, line: 90, type: !668, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !663, retainedNodes: !683)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670, !682}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isaac_state", file: !672, line: 56, size: 16576, elements: !673)
!672 = !DIFile(filename: "./lib/rand-isaac.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4c70774edc5c86c3b7f59097e965130e")
!673 = !{!674, !679, !680, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !671, file: !672, line: 58, baseType: !675, size: 16384)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 16384, elements: !386)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "isaac_word", file: !672, line: 44, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !574, line: 52, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !73, line: 59, baseType: !571)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !671, file: !672, line: 59, baseType: !676, size: 64, offset: 16384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !671, file: !672, line: 59, baseType: !676, size: 64, offset: 16448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !671, file: !672, line: 59, baseType: !676, size: 64, offset: 16512)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !693, !694, !696, !697, !699, !700, !702, !703, !706, !707, !709, !710, !712, !713, !715}
!684 = !DILocalVariable(name: "s", arg: 1, scope: !667, file: !664, line: 90, type: !670)
!685 = !DILocalVariable(name: "result", arg: 2, scope: !667, file: !664, line: 90, type: !682)
!686 = !DILocalVariable(name: "a", scope: !667, file: !664, line: 93, type: !676)
!687 = !DILocalVariable(name: "b", scope: !667, file: !664, line: 94, type: !676)
!688 = !DILocalVariable(name: "m", scope: !667, file: !664, line: 97, type: !682)
!689 = !DILocalVariable(name: "r", scope: !667, file: !664, line: 98, type: !682)
!690 = !DILocalVariable(name: "x", scope: !691, file: !664, line: 118, type: !676)
!691 = distinct !DILexicalBlock(scope: !692, file: !664, line: 118, column: 7)
!692 = distinct !DILexicalBlock(scope: !667, file: !664, line: 117, column: 5)
!693 = !DILocalVariable(name: "y", scope: !691, file: !664, line: 118, type: !676)
!694 = !DILocalVariable(name: "x", scope: !695, file: !664, line: 119, type: !676)
!695 = distinct !DILexicalBlock(scope: !692, file: !664, line: 119, column: 7)
!696 = !DILocalVariable(name: "y", scope: !695, file: !664, line: 119, type: !676)
!697 = !DILocalVariable(name: "x", scope: !698, file: !664, line: 120, type: !676)
!698 = distinct !DILexicalBlock(scope: !692, file: !664, line: 120, column: 7)
!699 = !DILocalVariable(name: "y", scope: !698, file: !664, line: 120, type: !676)
!700 = !DILocalVariable(name: "x", scope: !701, file: !664, line: 121, type: !676)
!701 = distinct !DILexicalBlock(scope: !692, file: !664, line: 121, column: 7)
!702 = !DILocalVariable(name: "y", scope: !701, file: !664, line: 121, type: !676)
!703 = !DILocalVariable(name: "x", scope: !704, file: !664, line: 128, type: !676)
!704 = distinct !DILexicalBlock(scope: !705, file: !664, line: 128, column: 7)
!705 = distinct !DILexicalBlock(scope: !667, file: !664, line: 127, column: 5)
!706 = !DILocalVariable(name: "y", scope: !704, file: !664, line: 128, type: !676)
!707 = !DILocalVariable(name: "x", scope: !708, file: !664, line: 129, type: !676)
!708 = distinct !DILexicalBlock(scope: !705, file: !664, line: 129, column: 7)
!709 = !DILocalVariable(name: "y", scope: !708, file: !664, line: 129, type: !676)
!710 = !DILocalVariable(name: "x", scope: !711, file: !664, line: 130, type: !676)
!711 = distinct !DILexicalBlock(scope: !705, file: !664, line: 130, column: 7)
!712 = !DILocalVariable(name: "y", scope: !711, file: !664, line: 130, type: !676)
!713 = !DILocalVariable(name: "x", scope: !714, file: !664, line: 131, type: !676)
!714 = distinct !DILexicalBlock(scope: !705, file: !664, line: 131, column: 7)
!715 = !DILocalVariable(name: "y", scope: !714, file: !664, line: 131, type: !676)
!716 = !{!717}
!717 = !DIEnumerator(name: "HALF", value: 128)
!718 = !{!676}
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !317, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/renameatu.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c018670dfeb96d47df408cf9bacb370e")
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!725 = !{!726}
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !724, line: 40, baseType: !6, size: 32, elements: !727)
!727 = !{!728}
!728 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!729 = distinct !DICompileUnit(language: DW_LANG_C99, file: !730, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !662, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !732, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !733, retainedTypes: !764, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!733 = !{!734, !746}
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !735, file: !732, line: 188, baseType: !6, size: 32, elements: !744)
!735 = distinct !DISubprogram(name: "x2nrealloc", scope: !732, file: !732, line: 176, type: !736, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !739)
!736 = !DISubroutineType(types: !737)
!737 = !{!67, !67, !738, !79}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!739 = !{!740, !741, !742, !743}
!740 = !DILocalVariable(name: "p", arg: 1, scope: !735, file: !732, line: 176, type: !67)
!741 = !DILocalVariable(name: "pn", arg: 2, scope: !735, file: !732, line: 176, type: !738)
!742 = !DILocalVariable(name: "s", arg: 3, scope: !735, file: !732, line: 176, type: !79)
!743 = !DILocalVariable(name: "n", scope: !735, file: !732, line: 178, type: !79)
!744 = !{!745}
!745 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !747, file: !732, line: 228, baseType: !6, size: 32, elements: !744)
!747 = distinct !DISubprogram(name: "xpalloc", scope: !732, file: !732, line: 223, type: !748, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !754)
!748 = !DISubroutineType(types: !749)
!749 = !{!67, !67, !750, !751, !753, !751}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !752, line: 130, baseType: !753)
!752 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !80, line: 35, baseType: !74)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763}
!755 = !DILocalVariable(name: "pa", arg: 1, scope: !747, file: !732, line: 223, type: !67)
!756 = !DILocalVariable(name: "pn", arg: 2, scope: !747, file: !732, line: 223, type: !750)
!757 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !747, file: !732, line: 223, type: !751)
!758 = !DILocalVariable(name: "n_max", arg: 4, scope: !747, file: !732, line: 223, type: !753)
!759 = !DILocalVariable(name: "s", arg: 5, scope: !747, file: !732, line: 223, type: !751)
!760 = !DILocalVariable(name: "n0", scope: !747, file: !732, line: 230, type: !751)
!761 = !DILocalVariable(name: "n", scope: !747, file: !732, line: 237, type: !751)
!762 = !DILocalVariable(name: "nbytes", scope: !747, file: !732, line: 248, type: !751)
!763 = !DILocalVariable(name: "adjusted_nbytes", scope: !747, file: !732, line: 252, type: !751)
!764 = !{!75, !67, !85, !74, !81}
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!769 = !{!294, !770}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !771, line: 24, baseType: !6, size: 32, elements: !772)
!771 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!772 = !{!773, !774, !775, !776}
!773 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!774 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!775 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!776 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!777 = distinct !DICompileUnit(language: DW_LANG_C99, file: !778, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !779, retainedTypes: !780, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!779 = !{!294, !29}
!780 = !{!77, !78, !75, !85, !81, !781}
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !574, line: 102, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !73, line: 73, baseType: !81)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!789 = distinct !DICompileUnit(language: DW_LANG_C99, file: !790, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !798, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !799, splitDebugInlining: false, nameTableKind: None)
!798 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!799 = !{!85, !81, !67}
!800 = distinct !DICompileUnit(language: DW_LANG_C99, file: !801, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!802 = distinct !DICompileUnit(language: DW_LANG_C99, file: !803, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!803 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!804 = distinct !DICompileUnit(language: DW_LANG_C99, file: !805, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!806 = !{!75, !79, !67, !82, !6}
!807 = distinct !DICompileUnit(language: DW_LANG_C99, file: !808, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!808 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!811 = distinct !DICompileUnit(language: DW_LANG_C99, file: !812, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !636, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !635, retainedTypes: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!815 = !{!79, !816, !67, !871}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !471, line: 174, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 111, size: 256, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !818, file: !471, line: 113, baseType: !481, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !818, file: !471, line: 172, baseType: !822, size: 128, offset: 128)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !471, line: 114, size: 128, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !822, file: !471, line: 116, baseType: !145, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !822, file: !471, line: 117, baseType: !84, size: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !822, file: !471, line: 118, baseType: !537, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !822, file: !471, line: 119, baseType: !78, size: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !822, file: !471, line: 120, baseType: !77, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !822, file: !471, line: 121, baseType: !6, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !822, file: !471, line: 122, baseType: !74, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !822, file: !471, line: 123, baseType: !81, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !822, file: !471, line: 124, baseType: !544, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !822, file: !471, line: 125, baseType: !546, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !822, file: !471, line: 126, baseType: !548, size: 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !822, file: !471, line: 127, baseType: !552, size: 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !822, file: !471, line: 128, baseType: !556, size: 16)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !822, file: !471, line: 129, baseType: !559, size: 16)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !822, file: !471, line: 130, baseType: !562, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !822, file: !471, line: 131, baseType: !565, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !822, file: !471, line: 132, baseType: !567, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !822, file: !471, line: 133, baseType: !570, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !822, file: !471, line: 134, baseType: !573, size: 8)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !822, file: !471, line: 135, baseType: !576, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !822, file: !471, line: 136, baseType: !578, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !822, file: !471, line: 137, baseType: !580, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !822, file: !471, line: 138, baseType: !582, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !822, file: !471, line: 139, baseType: !584, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !822, file: !471, line: 140, baseType: !586, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !822, file: !471, line: 141, baseType: !588, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !822, file: !471, line: 142, baseType: !590, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !822, file: !471, line: 143, baseType: !592, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !822, file: !471, line: 144, baseType: !594, size: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !822, file: !471, line: 145, baseType: !77, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !822, file: !471, line: 147, baseType: !597, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !822, file: !471, line: 149, baseType: !82, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !822, file: !471, line: 150, baseType: !601, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !822, file: !471, line: 151, baseType: !67, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !822, file: !471, line: 152, baseType: !606, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !822, file: !471, line: 153, baseType: !608, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !822, file: !471, line: 154, baseType: !206, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !822, file: !471, line: 155, baseType: !611, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !822, file: !471, line: 156, baseType: !613, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !822, file: !471, line: 157, baseType: !615, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !822, file: !471, line: 158, baseType: !617, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !822, file: !471, line: 159, baseType: !619, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !822, file: !471, line: 160, baseType: !621, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !822, file: !471, line: 161, baseType: !623, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !822, file: !471, line: 162, baseType: !625, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !822, file: !471, line: 163, baseType: !627, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !822, file: !471, line: 164, baseType: !629, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !873, line: 67, baseType: !874)
!873 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !873, line: 53, size: 704, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !874, file: !873, line: 55, baseType: !82, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !874, file: !873, line: 56, baseType: !82, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !874, file: !873, line: 57, baseType: !77, size: 32, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !874, file: !873, line: 58, baseType: !82, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !874, file: !873, line: 59, baseType: !82, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !874, file: !873, line: 60, baseType: !79, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !874, file: !873, line: 61, baseType: !82, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !874, file: !873, line: 62, baseType: !82, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !874, file: !873, line: 63, baseType: !79, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !874, file: !873, line: 64, baseType: !76, size: 8, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !874, file: !873, line: 65, baseType: !79, size: 64, offset: 640)
!887 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!888 = !{i32 7, !"Dwarf Version", i32 5}
!889 = !{i32 2, !"Debug Info Version", i32 3}
!890 = !{i32 1, !"wchar_size", i32 4}
!891 = !{i32 1, !"branch-target-enforcement", i32 0}
!892 = !{i32 1, !"sign-return-address", i32 0}
!893 = !{i32 1, !"sign-return-address-all", i32 0}
!894 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!895 = !{i32 7, !"PIC Level", i32 2}
!896 = !{i32 7, !"PIE Level", i32 2}
!897 = !{i32 7, !"uwtable", i32 1}
!898 = !{i32 7, !"frame-pointer", i32 1}
!899 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 164, type: !900, scopeLine: 165, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !77}
!902 = !{!903}
!903 = !DILocalVariable(name: "status", arg: 1, scope: !899, file: !3, line: 164, type: !77)
!904 = !DILocation(line: 0, scope: !899)
!905 = !DILocation(line: 166, column: 14, scope: !906)
!906 = distinct !DILexicalBlock(scope: !899, file: !3, line: 166, column: 7)
!907 = !DILocation(line: 166, column: 7, scope: !899)
!908 = !DILocation(line: 167, column: 5, scope: !909)
!909 = distinct !DILexicalBlock(scope: !906, file: !3, line: 167, column: 5)
!910 = !{!911, !911, i64 0}
!911 = !{!"any pointer", !912, i64 0}
!912 = !{!"omnipotent char", !913, i64 0}
!913 = !{!"Simple C/C++ TBAA"}
!914 = !DILocation(line: 170, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !906, file: !3, line: 169, column: 5)
!916 = !DILocation(line: 171, column: 7, scope: !915)
!917 = !DILocation(line: 175, column: 7, scope: !915)
!918 = !DILocation(line: 736, column: 3, scope: !919, inlinedAt: !921)
!919 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !95, file: !95, line: 734, type: !225, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!920 = !{}
!921 = distinct !DILocation(line: 180, column: 7, scope: !915)
!922 = !DILocation(line: 182, column: 7, scope: !915)
!923 = !DILocation(line: 186, column: 7, scope: !915)
!924 = !DILocation(line: 190, column: 7, scope: !915)
!925 = !DILocation(line: 194, column: 7, scope: !915)
!926 = !DILocation(line: 198, column: 7, scope: !915)
!927 = !DILocation(line: 202, column: 7, scope: !915)
!928 = !DILocation(line: 206, column: 7, scope: !915)
!929 = !DILocation(line: 210, column: 7, scope: !915)
!930 = !DILocation(line: 215, column: 7, scope: !915)
!931 = !DILocation(line: 219, column: 7, scope: !915)
!932 = !DILocation(line: 220, column: 7, scope: !915)
!933 = !DILocation(line: 221, column: 7, scope: !915)
!934 = !DILocation(line: 233, column: 7, scope: !915)
!935 = !DILocalVariable(name: "program", arg: 1, scope: !936, file: !95, line: 836, type: !82)
!936 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !95, file: !95, line: 836, type: !937, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !939)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !82}
!939 = !{!935, !940, !947, !948, !950, !951}
!940 = !DILocalVariable(name: "infomap", scope: !936, file: !95, line: 838, type: !941)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 896, elements: !632)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !936, file: !95, line: 838, size: 128, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !943, file: !95, line: 838, baseType: !82, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !943, file: !95, line: 838, baseType: !82, size: 64, offset: 64)
!947 = !DILocalVariable(name: "node", scope: !936, file: !95, line: 848, type: !82)
!948 = !DILocalVariable(name: "map_prog", scope: !936, file: !95, line: 849, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!950 = !DILocalVariable(name: "lc_messages", scope: !936, file: !95, line: 861, type: !82)
!951 = !DILocalVariable(name: "url_program", scope: !936, file: !95, line: 874, type: !82)
!952 = !DILocation(line: 0, scope: !936, inlinedAt: !953)
!953 = distinct !DILocation(line: 239, column: 7, scope: !915)
!954 = !DILocation(line: 838, column: 3, scope: !936, inlinedAt: !953)
!955 = !DILocation(line: 838, column: 67, scope: !936, inlinedAt: !953)
!956 = !DILocation(line: 849, column: 36, scope: !936, inlinedAt: !953)
!957 = !DILocation(line: 851, column: 3, scope: !936, inlinedAt: !953)
!958 = !DILocalVariable(name: "__s1", arg: 1, scope: !959, file: !960, line: 1359, type: !82)
!959 = distinct !DISubprogram(name: "streq", scope: !960, file: !960, line: 1359, type: !961, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !963)
!960 = !DIFile(filename: "./lib/string.h", directory: "/src")
!961 = !DISubroutineType(types: !962)
!962 = !{!85, !82, !82}
!963 = !{!958, !964}
!964 = !DILocalVariable(name: "__s2", arg: 2, scope: !959, file: !960, line: 1359, type: !82)
!965 = !DILocation(line: 0, scope: !959, inlinedAt: !966)
!966 = distinct !DILocation(line: 851, column: 33, scope: !936, inlinedAt: !953)
!967 = !DILocation(line: 1361, column: 11, scope: !959, inlinedAt: !966)
!968 = !DILocation(line: 1361, column: 10, scope: !959, inlinedAt: !966)
!969 = !DILocation(line: 852, column: 13, scope: !936, inlinedAt: !953)
!970 = !DILocation(line: 851, column: 20, scope: !936, inlinedAt: !953)
!971 = !{!972, !911, i64 0}
!972 = !{!"infomap", !911, i64 0, !911, i64 8}
!973 = !DILocation(line: 851, column: 10, scope: !936, inlinedAt: !953)
!974 = !DILocation(line: 851, column: 28, scope: !936, inlinedAt: !953)
!975 = distinct !{!975, !957, !969, !976}
!976 = !{!"llvm.loop.mustprogress"}
!977 = !DILocation(line: 854, column: 17, scope: !978, inlinedAt: !953)
!978 = distinct !DILexicalBlock(scope: !936, file: !95, line: 854, column: 7)
!979 = !{!972, !911, i64 8}
!980 = !DILocation(line: 854, column: 7, scope: !978, inlinedAt: !953)
!981 = !DILocation(line: 854, column: 7, scope: !936, inlinedAt: !953)
!982 = !DILocation(line: 857, column: 3, scope: !936, inlinedAt: !953)
!983 = !DILocation(line: 861, column: 29, scope: !936, inlinedAt: !953)
!984 = !DILocation(line: 862, column: 7, scope: !985, inlinedAt: !953)
!985 = distinct !DILexicalBlock(scope: !936, file: !95, line: 862, column: 7)
!986 = !DILocation(line: 862, column: 19, scope: !985, inlinedAt: !953)
!987 = !DILocation(line: 862, column: 22, scope: !985, inlinedAt: !953)
!988 = !DILocation(line: 862, column: 7, scope: !936, inlinedAt: !953)
!989 = !DILocation(line: 868, column: 7, scope: !990, inlinedAt: !953)
!990 = distinct !DILexicalBlock(scope: !985, file: !95, line: 863, column: 5)
!991 = !DILocation(line: 870, column: 5, scope: !990, inlinedAt: !953)
!992 = !DILocation(line: 0, scope: !959, inlinedAt: !993)
!993 = distinct !DILocation(line: 874, column: 29, scope: !936, inlinedAt: !953)
!994 = !DILocation(line: 875, column: 3, scope: !936, inlinedAt: !953)
!995 = !DILocation(line: 877, column: 3, scope: !936, inlinedAt: !953)
!996 = !DILocation(line: 879, column: 1, scope: !936, inlinedAt: !953)
!997 = !DILocation(line: 241, column: 3, scope: !899)
!998 = !DISubprogram(name: "dcgettext", scope: !999, file: !999, line: 51, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!999 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!75, !82, !82, !77}
!1002 = !DISubprogram(name: "fputs_unlocked", scope: !71, file: !71, line: 691, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !920)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!77, !1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !82)
!1006 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !117)
!1007 = !DILocation(line: 0, scope: !94)
!1008 = !DILocation(line: 581, column: 7, scope: !103)
!1009 = !{!1010, !1010, i64 0}
!1010 = !{!"int", !912, i64 0}
!1011 = !DILocation(line: 581, column: 19, scope: !103)
!1012 = !DILocation(line: 581, column: 7, scope: !94)
!1013 = !DILocation(line: 585, column: 26, scope: !102)
!1014 = !DILocation(line: 0, scope: !102)
!1015 = !DILocation(line: 586, column: 23, scope: !102)
!1016 = !DILocation(line: 586, column: 28, scope: !102)
!1017 = !DILocation(line: 586, column: 32, scope: !102)
!1018 = !{!912, !912, i64 0}
!1019 = !DILocation(line: 586, column: 38, scope: !102)
!1020 = !DILocation(line: 0, scope: !959, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 586, column: 41, scope: !102)
!1022 = !DILocation(line: 1361, column: 11, scope: !959, inlinedAt: !1021)
!1023 = !DILocation(line: 1361, column: 10, scope: !959, inlinedAt: !1021)
!1024 = !DILocation(line: 586, column: 19, scope: !102)
!1025 = !DILocation(line: 587, column: 5, scope: !102)
!1026 = !DILocation(line: 588, column: 7, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !94, file: !95, line: 588, column: 7)
!1028 = !DILocation(line: 588, column: 7, scope: !94)
!1029 = !DILocation(line: 590, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !95, line: 589, column: 5)
!1031 = !DILocation(line: 591, column: 7, scope: !1030)
!1032 = !DILocation(line: 595, column: 37, scope: !94)
!1033 = !DILocation(line: 595, column: 35, scope: !94)
!1034 = !DILocation(line: 596, column: 29, scope: !94)
!1035 = !DILocation(line: 597, column: 8, scope: !110)
!1036 = !DILocation(line: 597, column: 7, scope: !94)
!1037 = !DILocation(line: 604, column: 24, scope: !109)
!1038 = !DILocation(line: 604, column: 12, scope: !110)
!1039 = !DILocation(line: 0, scope: !108)
!1040 = !DILocation(line: 610, column: 16, scope: !108)
!1041 = !DILocation(line: 610, column: 7, scope: !108)
!1042 = !DILocation(line: 611, column: 21, scope: !108)
!1043 = !{!1044, !1044, i64 0}
!1044 = !{!"short", !912, i64 0}
!1045 = !DILocation(line: 611, column: 19, scope: !108)
!1046 = !DILocation(line: 611, column: 16, scope: !108)
!1047 = !DILocation(line: 610, column: 30, scope: !108)
!1048 = distinct !{!1048, !1041, !1042, !976}
!1049 = !DILocation(line: 612, column: 18, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !108, file: !95, line: 612, column: 11)
!1051 = !DILocation(line: 612, column: 11, scope: !108)
!1052 = !DILocation(line: 620, column: 23, scope: !94)
!1053 = !DILocation(line: 625, column: 39, scope: !94)
!1054 = !DILocation(line: 626, column: 3, scope: !94)
!1055 = !DILocation(line: 626, column: 10, scope: !94)
!1056 = !DILocation(line: 626, column: 21, scope: !94)
!1057 = !DILocation(line: 628, column: 44, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !95, line: 628, column: 11)
!1059 = distinct !DILexicalBlock(scope: !94, file: !95, line: 627, column: 5)
!1060 = !DILocation(line: 628, column: 32, scope: !1058)
!1061 = !DILocation(line: 628, column: 49, scope: !1058)
!1062 = !DILocation(line: 628, column: 11, scope: !1059)
!1063 = !DILocation(line: 630, column: 11, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1059, file: !95, line: 630, column: 11)
!1065 = !DILocation(line: 630, column: 11, scope: !1059)
!1066 = !DILocation(line: 632, column: 26, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1068, file: !95, line: 632, column: 15)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !95, line: 631, column: 9)
!1069 = !DILocation(line: 632, column: 34, scope: !1067)
!1070 = !DILocation(line: 632, column: 37, scope: !1067)
!1071 = !DILocation(line: 632, column: 15, scope: !1068)
!1072 = !DILocation(line: 636, column: 29, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1068, file: !95, line: 636, column: 15)
!1074 = !DILocation(line: 640, column: 16, scope: !1059)
!1075 = distinct !{!1075, !1054, !1076, !976}
!1076 = !DILocation(line: 641, column: 5, scope: !94)
!1077 = !DILocation(line: 644, column: 3, scope: !94)
!1078 = !DILocation(line: 0, scope: !959, inlinedAt: !1079)
!1079 = distinct !DILocation(line: 648, column: 31, scope: !94)
!1080 = !DILocation(line: 0, scope: !959, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 649, column: 31, scope: !94)
!1082 = !DILocation(line: 0, scope: !959, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 650, column: 31, scope: !94)
