; ModuleID = 'src/sleep.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [249 x i8] c"Usage: %s NUMBER[SUFFIX]...\0A  or:  %s OPTION\0APause for NUMBER seconds, where NUMBER is an integer or floating-point.\0ASUFFIX may be 's','m','h', or 'd', for seconds, minutes, hours, days.\0AWith multiple arguments, pause for the sum of their values.\0A\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !30, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !37)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !28, globals: !36, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/sleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "382b2cab9ca796c7040797f94b92cf12")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !{!6, !29, !30, !31, !32, !35}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !33, line: 46, baseType: !34)
!33 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!34 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !{!0}
!37 = !{!38, !39, !40, !43, !45, !46, !47, !51, !52, !53, !54, !56, !113, !114, !115, !117, !118}
!38 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!39 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!40 = !DILocalVariable(name: "term", scope: !41, file: !3, line: 585, type: !6)
!41 = distinct !DILexicalBlock(scope: !42, file: !3, line: 582, column: 5)
!42 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!43 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !44)
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!46 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!47 = !DILocalVariable(name: "s", scope: !48, file: !3, line: 608, type: !6)
!48 = distinct !DILexicalBlock(scope: !49, file: !3, line: 605, column: 5)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 604, column: 12)
!50 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!51 = !DILocalVariable(name: "spaces", scope: !48, file: !3, line: 609, type: !32)
!52 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !32)
!53 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!54 = !DILocalVariable(name: "__ptr", scope: !55, file: !3, line: 644, type: !6)
!55 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!56 = !DILocalVariable(name: "__stream", scope: !55, file: !3, line: 644, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !60)
!59 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !62)
!61 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!62 = !{!63, !64, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !88, !90, !94, !97, !99, !102, !105, !106, !107, !108, !109}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !60, file: !61, line: 51, baseType: !30, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !60, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !60, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !60, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !60, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !60, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !60, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !60, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !60, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !60, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !60, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !60, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !60, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !61, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !60, file: !61, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !60, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !60, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !60, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !60, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !60, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !60, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !60, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !61, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !60, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !60, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !61, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !60, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !61, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !60, file: !61, line: 93, baseType: !80, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !60, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !60, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !60, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !60, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocalVariable(name: "__cnt", scope: !55, file: !3, line: 644, type: !32)
!114 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!115 = !DILocalVariable(name: "__ptr", scope: !116, file: !3, line: 686, type: !6)
!116 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!117 = !DILocalVariable(name: "__stream", scope: !116, file: !3, line: 686, type: !57)
!118 = !DILocalVariable(name: "__cnt", scope: !116, file: !3, line: 686, type: !32)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Version", scope: !121, file: !122, line: 3, type: !6, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !123, splitDebugInlining: false, nameTableKind: None)
!122 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!123 = !{!119}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "file_name", scope: !126, file: !127, line: 45, type: !6, isLocal: true, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !128, splitDebugInlining: false, nameTableKind: None)
!127 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!128 = !{!124, !129}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !126, file: !127, line: 55, type: !44, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !133, file: !134, line: 66, type: !169, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !135, globals: !136, splitDebugInlining: false, nameTableKind: None)
!134 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!135 = !{!29, !35}
!136 = !{!137, !163, !131, !165, !167}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "old_file_name", scope: !139, file: !134, line: 304, type: !6, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "verror_at_line", scope: !134, file: !134, line: 298, type: !140, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !156)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !30, !30, !6, !14, !6, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !147, baseType: !148)
!147 = !DIFile(filename: "lib/error.c", directory: "/src")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !150)
!149 = !DINamespace(name: "std", scope: null)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !148, file: !147, baseType: !29, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !148, file: !147, baseType: !29, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !148, file: !147, baseType: !30, size: 32, offset: 224)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DILocalVariable(name: "status", arg: 1, scope: !139, file: !134, line: 298, type: !30)
!158 = !DILocalVariable(name: "errnum", arg: 2, scope: !139, file: !134, line: 298, type: !30)
!159 = !DILocalVariable(name: "file_name", arg: 3, scope: !139, file: !134, line: 298, type: !6)
!160 = !DILocalVariable(name: "line_number", arg: 4, scope: !139, file: !134, line: 298, type: !14)
!161 = !DILocalVariable(name: "message", arg: 5, scope: !139, file: !134, line: 298, type: !6)
!162 = !DILocalVariable(name: "args", arg: 6, scope: !139, file: !134, line: 298, type: !142)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "old_line_number", scope: !139, file: !134, line: 305, type: !14, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "error_message_count", scope: !133, file: !134, line: 69, type: !14, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !133, file: !134, line: 295, type: !30, isLocal: false, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "long_options", scope: !174, file: !175, line: 34, type: !177, isLocal: true, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!176 = !{!172}
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !187)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !180, line: 50, size: 256, elements: !181)
!180 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 52, baseType: !6, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !179, file: !180, line: 55, baseType: !30, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !180, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !180, line: 57, baseType: !30, size: 32, offset: 192)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "program_name", scope: !191, file: !192, line: 31, type: !6, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !193, globals: !194, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!193 = !{!65}
!194 = !{!189}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "utf07FF", scope: !197, file: !198, line: 46, type: !228, isLocal: true, isDefinition: true)
!197 = distinct !DISubprogram(name: "proper_name_lite", scope: !198, file: !198, line: 38, type: !199, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !201, retainedNodes: !203)
!198 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!199 = !DISubroutineType(types: !200)
!200 = !{!6, !6, !6}
!201 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !202, splitDebugInlining: false, nameTableKind: None)
!202 = !{!195}
!203 = !{!204, !205, !206, !207, !212}
!204 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !197, file: !198, line: 38, type: !6)
!205 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !197, file: !198, line: 38, type: !6)
!206 = !DILocalVariable(name: "translation", scope: !197, file: !198, line: 40, type: !6)
!207 = !DILocalVariable(name: "w", scope: !197, file: !198, line: 47, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !209, line: 37, baseType: !210)
!209 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !85, line: 57, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 42, baseType: !14)
!212 = !DILocalVariable(name: "mbs", scope: !197, file: !198, line: 48, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !218)
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !217, file: !216, line: 15, baseType: !30, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !217, file: !216, line: 20, baseType: !221, size: 32, offset: 32)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !216, line: 16, size: 32, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !221, file: !216, line: 18, baseType: !14, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !221, file: !216, line: 19, baseType: !225, size: 32)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 4)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !233, file: !234, line: 76, type: !316, isLocal: false, isDefinition: true)
!233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !234, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !235, retainedTypes: !255, globals: !256, splitDebugInlining: false, nameTableKind: None)
!234 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!235 = !{!236, !250, !12}
!236 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !237, line: 42, baseType: !14, size: 32, elements: !238)
!237 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!239 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!240 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!241 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!242 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!243 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!244 = !DIEnumerator(name: "c_quoting_style", value: 5)
!245 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!246 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!247 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!248 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!249 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !237, line: 254, baseType: !14, size: 32, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!253 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!254 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!255 = !{!30, !31, !32}
!256 = !{!231, !257, !263, !275, !277, !282, !305, !312, !314}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !233, file: !234, line: 92, type: !259, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 320, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!261 = !{!262}
!262 = !DISubrange(count: 10)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !233, file: !234, line: 1040, type: !265, isLocal: false, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !234, line: 56, size: 448, elements: !266)
!266 = !{!267, !268, !269, !273, !274}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !265, file: !234, line: 59, baseType: !236, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !234, line: 62, baseType: !30, size: 32, offset: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !265, file: !234, line: 66, baseType: !270, size: 256, offset: 64)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !265, file: !234, line: 69, baseType: !6, size: 64, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !265, file: !234, line: 72, baseType: !6, size: 64, offset: 384)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !233, file: !234, line: 107, type: !265, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slot0", scope: !233, file: !234, line: 831, type: !279, isLocal: true, isDefinition: true)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 256)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "quote", scope: !284, file: !234, line: 228, type: !303, isLocal: true, isDefinition: true)
!284 = distinct !DISubprogram(name: "gettext_quote", scope: !234, file: !234, line: 197, type: !285, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !233, retainedNodes: !287)
!285 = !DISubroutineType(types: !286)
!286 = !{!6, !6, !236}
!287 = !{!288, !289, !290, !291, !292}
!288 = !DILocalVariable(name: "msgid", arg: 1, scope: !284, file: !234, line: 197, type: !6)
!289 = !DILocalVariable(name: "s", arg: 2, scope: !284, file: !234, line: 197, type: !236)
!290 = !DILocalVariable(name: "translation", scope: !284, file: !234, line: 199, type: !6)
!291 = !DILocalVariable(name: "w", scope: !284, file: !234, line: 229, type: !208)
!292 = !DILocalVariable(name: "mbs", scope: !284, file: !234, line: 230, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !295, file: !216, line: 15, baseType: !30, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !295, file: !216, line: 20, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !216, line: 16, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !299, file: !216, line: 18, baseType: !14, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !299, file: !216, line: 19, baseType: !225, size: 32)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !304)
!304 = !{!230, !227}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "slotvec", scope: !233, file: !234, line: 834, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !234, line: 823, size: 128, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !308, file: !234, line: 825, baseType: !32, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !308, file: !234, line: 826, baseType: !65, size: 64, offset: 64)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "nslots", scope: !233, file: !234, line: 832, type: !30, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slotvec0", scope: !233, file: !234, line: 833, type: !308, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 704, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!318 = !{!319}
!319 = !DISubrange(count: 11)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !322, file: !323, line: 26, type: !325, isLocal: false, isDefinition: true)
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !324, splitDebugInlining: false, nameTableKind: None)
!323 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!324 = !{!320}
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 47)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "exit_failure", scope: !330, file: !331, line: 24, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!332 = !{!328}
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !336, file: !337, line: 58, type: !362, isLocal: true, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !338, globals: !361, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!338 = !{!65, !339}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !340, line: 24, baseType: !341)
!340 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !342, line: 41, baseType: !343)
!342 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !342, line: 27, size: 1856, elements: !345)
!345 = !{!346, !352, !355, !358, !359}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !344, file: !342, line: 30, baseType: !347, size: 832)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 832, elements: !350)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !342, line: 30, flags: DIFlagFwdDecl)
!350 = !{!351}
!351 = !DISubrange(count: 13)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !344, file: !342, line: 33, baseType: !353, size: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !344, file: !342, line: 34, baseType: !356, size: 64, offset: 896)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !344, file: !342, line: 35, baseType: !356, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !344, file: !342, line: 38, baseType: !360, size: 832, offset: 1024)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !350)
!361 = !{!334}
!362 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !339)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "internal_state", scope: !365, file: !366, line: 97, type: !369, isLocal: true, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !367, globals: !368, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!367 = !{!29, !32, !35}
!368 = !{!363}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !214, line: 6, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !216, line: 21, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !216, line: 13, size: 64, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !371, file: !216, line: 15, baseType: !30, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !371, file: !216, line: 20, baseType: !375, size: 32, offset: 32)
!375 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !371, file: !216, line: 16, size: 32, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !375, file: !216, line: 18, baseType: !14, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !375, file: !216, line: 19, baseType: !225, size: 32)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !385, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!385 = !{!386}
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 40, baseType: !14, size: 32, elements: !387)
!387 = !{!388}
!388 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!389 = !{!29}
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !423, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!392 = !{!393, !405}
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !394, file: !391, line: 188, baseType: !14, size: 32, elements: !403)
!394 = distinct !DISubprogram(name: "x2nrealloc", scope: !391, file: !391, line: 176, type: !395, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !398)
!395 = !DISubroutineType(types: !396)
!396 = !{!29, !29, !397, !32}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!398 = !{!399, !400, !401, !402}
!399 = !DILocalVariable(name: "p", arg: 1, scope: !394, file: !391, line: 176, type: !29)
!400 = !DILocalVariable(name: "pn", arg: 2, scope: !394, file: !391, line: 176, type: !397)
!401 = !DILocalVariable(name: "s", arg: 3, scope: !394, file: !391, line: 176, type: !32)
!402 = !DILocalVariable(name: "n", scope: !394, file: !391, line: 178, type: !32)
!403 = !{!404}
!404 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!405 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !406, file: !391, line: 228, baseType: !14, size: 32, elements: !403)
!406 = distinct !DISubprogram(name: "xpalloc", scope: !391, file: !391, line: 223, type: !407, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !413)
!407 = !DISubroutineType(types: !408)
!408 = !{!29, !29, !409, !410, !412, !410}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !411, line: 130, baseType: !412)
!411 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !33, line: 35, baseType: !86)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422}
!414 = !DILocalVariable(name: "pa", arg: 1, scope: !406, file: !391, line: 223, type: !29)
!415 = !DILocalVariable(name: "pn", arg: 2, scope: !406, file: !391, line: 223, type: !409)
!416 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !406, file: !391, line: 223, type: !410)
!417 = !DILocalVariable(name: "n_max", arg: 4, scope: !406, file: !391, line: 223, type: !412)
!418 = !DILocalVariable(name: "s", arg: 5, scope: !406, file: !391, line: 223, type: !410)
!419 = !DILocalVariable(name: "n0", scope: !406, file: !391, line: 230, type: !410)
!420 = !DILocalVariable(name: "n", scope: !406, file: !391, line: 237, type: !410)
!421 = !DILocalVariable(name: "nbytes", scope: !406, file: !391, line: 248, type: !410)
!422 = !DILocalVariable(name: "adjusted_nbytes", scope: !406, file: !391, line: 252, type: !410)
!423 = !{!65, !29, !44, !86, !34}
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/xnanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b6a69034949aee1e9f05553e779b94d2")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !430, line: 10, baseType: !431)
!430 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !86)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!434 = distinct !DICompileUnit(language: DW_LANG_C99, file: !435, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !436, retainedTypes: !428, splitDebugInlining: false, nameTableKind: None)
!435 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!436 = !{!437}
!437 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !438, line: 44, baseType: !14, size: 32, elements: !439)
!438 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!439 = !{!440}
!440 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/nanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ea6d8d4443a961090653c9a262702e98")
!449 = !{!450}
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !448, line: 37, baseType: !14, size: 32, elements: !451)
!451 = !{!452}
!452 = !DIEnumerator(name: "BILLION", value: 1000000000)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!455 = !{!44, !34, !29}
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!462 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!463 = !{i32 7, !"Dwarf Version", i32 5}
!464 = !{i32 2, !"Debug Info Version", i32 3}
!465 = !{i32 1, !"wchar_size", i32 4}
!466 = !{i32 1, !"branch-target-enforcement", i32 0}
!467 = !{i32 1, !"sign-return-address", i32 0}
!468 = !{i32 1, !"sign-return-address-all", i32 0}
!469 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!470 = !{i32 7, !"PIC Level", i32 2}
!471 = !{i32 7, !"PIE Level", i32 2}
!472 = !{i32 7, !"uwtable", i32 1}
!473 = !{i32 7, !"frame-pointer", i32 1}
!474 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 36, type: !475, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !30}
!477 = !{!478}
!478 = !DILocalVariable(name: "status", arg: 1, scope: !474, file: !10, line: 36, type: !30)
!479 = !DILocation(line: 0, scope: !474)
!480 = !DILocation(line: 38, column: 14, scope: !481)
!481 = distinct !DILexicalBlock(scope: !474, file: !10, line: 38, column: 7)
!482 = !DILocation(line: 38, column: 7, scope: !474)
!483 = !DILocation(line: 39, column: 5, scope: !484)
!484 = distinct !DILexicalBlock(scope: !481, file: !10, line: 39, column: 5)
!485 = !{!486, !486, i64 0}
!486 = !{!"any pointer", !487, i64 0}
!487 = !{!"omnipotent char", !488, i64 0}
!488 = !{!"Simple C/C++ TBAA"}
!489 = !DILocation(line: 42, column: 7, scope: !490)
!490 = distinct !DILexicalBlock(scope: !481, file: !10, line: 41, column: 5)
!491 = !DILocation(line: 51, column: 7, scope: !490)
!492 = !DILocation(line: 52, column: 7, scope: !490)
!493 = !DILocalVariable(name: "program", arg: 1, scope: !494, file: !3, line: 836, type: !6)
!494 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !495, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !497)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !6}
!497 = !{!493, !498, !507, !508, !510, !511}
!498 = !DILocalVariable(name: "infomap", scope: !494, file: !3, line: 838, type: !499)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 896, elements: !505)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !494, file: !3, line: 838, size: 128, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !501, file: !3, line: 838, baseType: !6, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !501, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!505 = !{!506}
!506 = !DISubrange(count: 7)
!507 = !DILocalVariable(name: "node", scope: !494, file: !3, line: 848, type: !6)
!508 = !DILocalVariable(name: "map_prog", scope: !494, file: !3, line: 849, type: !509)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!510 = !DILocalVariable(name: "lc_messages", scope: !494, file: !3, line: 861, type: !6)
!511 = !DILocalVariable(name: "url_program", scope: !494, file: !3, line: 874, type: !6)
!512 = !DILocation(line: 0, scope: !494, inlinedAt: !513)
!513 = distinct !DILocation(line: 53, column: 7, scope: !490)
!514 = !DILocation(line: 838, column: 3, scope: !494, inlinedAt: !513)
!515 = !DILocation(line: 838, column: 67, scope: !494, inlinedAt: !513)
!516 = !DILocation(line: 849, column: 36, scope: !494, inlinedAt: !513)
!517 = !DILocation(line: 851, column: 3, scope: !494, inlinedAt: !513)
!518 = !DILocalVariable(name: "__s1", arg: 1, scope: !519, file: !520, line: 1359, type: !6)
!519 = distinct !DISubprogram(name: "streq", scope: !520, file: !520, line: 1359, type: !521, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !523)
!520 = !DIFile(filename: "./lib/string.h", directory: "/src")
!521 = !DISubroutineType(types: !522)
!522 = !{!44, !6, !6}
!523 = !{!518, !524}
!524 = !DILocalVariable(name: "__s2", arg: 2, scope: !519, file: !520, line: 1359, type: !6)
!525 = !DILocation(line: 0, scope: !519, inlinedAt: !526)
!526 = distinct !DILocation(line: 851, column: 33, scope: !494, inlinedAt: !513)
!527 = !DILocation(line: 1361, column: 11, scope: !519, inlinedAt: !526)
!528 = !DILocation(line: 1361, column: 10, scope: !519, inlinedAt: !526)
!529 = !DILocation(line: 852, column: 13, scope: !494, inlinedAt: !513)
!530 = !DILocation(line: 851, column: 20, scope: !494, inlinedAt: !513)
!531 = !{!532, !486, i64 0}
!532 = !{!"infomap", !486, i64 0, !486, i64 8}
!533 = !DILocation(line: 851, column: 10, scope: !494, inlinedAt: !513)
!534 = !DILocation(line: 851, column: 28, scope: !494, inlinedAt: !513)
!535 = distinct !{!535, !517, !529, !536}
!536 = !{!"llvm.loop.mustprogress"}
!537 = !DILocation(line: 854, column: 17, scope: !538, inlinedAt: !513)
!538 = distinct !DILexicalBlock(scope: !494, file: !3, line: 854, column: 7)
!539 = !{!532, !486, i64 8}
!540 = !DILocation(line: 854, column: 7, scope: !538, inlinedAt: !513)
!541 = !DILocation(line: 854, column: 7, scope: !494, inlinedAt: !513)
!542 = !DILocation(line: 857, column: 3, scope: !494, inlinedAt: !513)
!543 = !DILocation(line: 861, column: 29, scope: !494, inlinedAt: !513)
!544 = !DILocation(line: 862, column: 7, scope: !545, inlinedAt: !513)
!545 = distinct !DILexicalBlock(scope: !494, file: !3, line: 862, column: 7)
!546 = !DILocation(line: 862, column: 19, scope: !545, inlinedAt: !513)
!547 = !DILocation(line: 862, column: 22, scope: !545, inlinedAt: !513)
!548 = !DILocation(line: 862, column: 7, scope: !494, inlinedAt: !513)
!549 = !DILocation(line: 868, column: 7, scope: !550, inlinedAt: !513)
!550 = distinct !DILexicalBlock(scope: !545, file: !3, line: 863, column: 5)
!551 = !DILocation(line: 870, column: 5, scope: !550, inlinedAt: !513)
!552 = !DILocation(line: 0, scope: !519, inlinedAt: !553)
!553 = distinct !DILocation(line: 874, column: 29, scope: !494, inlinedAt: !513)
!554 = !DILocation(line: 875, column: 3, scope: !494, inlinedAt: !513)
!555 = !DILocation(line: 877, column: 3, scope: !494, inlinedAt: !513)
!556 = !DILocation(line: 879, column: 1, scope: !494, inlinedAt: !513)
!557 = !DILocation(line: 55, column: 3, scope: !474)
!558 = !DISubprogram(name: "dcgettext", scope: !559, file: !559, line: 51, type: !560, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!559 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!560 = !DISubroutineType(types: !561)
!561 = !{!65, !6, !6, !30}
!562 = !{}
!563 = !DILocation(line: 0, scope: !2)
!564 = !DILocation(line: 581, column: 7, scope: !42)
!565 = !{!566, !566, i64 0}
!566 = !{!"int", !487, i64 0}
!567 = !DILocation(line: 581, column: 19, scope: !42)
!568 = !DILocation(line: 581, column: 7, scope: !2)
!569 = !DILocation(line: 585, column: 26, scope: !41)
!570 = !DILocation(line: 0, scope: !41)
!571 = !DILocation(line: 586, column: 23, scope: !41)
!572 = !DILocation(line: 586, column: 28, scope: !41)
!573 = !DILocation(line: 586, column: 32, scope: !41)
!574 = !{!487, !487, i64 0}
!575 = !DILocation(line: 586, column: 38, scope: !41)
!576 = !DILocation(line: 0, scope: !519, inlinedAt: !577)
!577 = distinct !DILocation(line: 586, column: 41, scope: !41)
!578 = !DILocation(line: 1361, column: 11, scope: !519, inlinedAt: !577)
!579 = !DILocation(line: 1361, column: 10, scope: !519, inlinedAt: !577)
!580 = !DILocation(line: 586, column: 19, scope: !41)
!581 = !DILocation(line: 587, column: 5, scope: !41)
!582 = !DILocation(line: 588, column: 7, scope: !583)
!583 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!584 = !DILocation(line: 588, column: 7, scope: !2)
!585 = !DILocation(line: 590, column: 7, scope: !586)
!586 = distinct !DILexicalBlock(scope: !583, file: !3, line: 589, column: 5)
!587 = !DILocation(line: 591, column: 7, scope: !586)
!588 = !DILocation(line: 595, column: 37, scope: !2)
!589 = !DILocation(line: 595, column: 35, scope: !2)
!590 = !DILocation(line: 596, column: 29, scope: !2)
!591 = !DILocation(line: 597, column: 8, scope: !50)
!592 = !DILocation(line: 597, column: 7, scope: !2)
!593 = !DILocation(line: 604, column: 24, scope: !49)
!594 = !DILocation(line: 604, column: 12, scope: !50)
!595 = !DILocation(line: 0, scope: !48)
!596 = !DILocation(line: 610, column: 16, scope: !48)
!597 = !DILocation(line: 610, column: 7, scope: !48)
!598 = !DILocation(line: 611, column: 21, scope: !48)
!599 = !{!600, !600, i64 0}
!600 = !{!"short", !487, i64 0}
!601 = !DILocation(line: 611, column: 19, scope: !48)
!602 = !DILocation(line: 611, column: 16, scope: !48)
!603 = !DILocation(line: 610, column: 30, scope: !48)
!604 = distinct !{!604, !597, !598, !536}
!605 = !DILocation(line: 612, column: 18, scope: !606)
!606 = distinct !DILexicalBlock(scope: !48, file: !3, line: 612, column: 11)
!607 = !DILocation(line: 612, column: 11, scope: !48)
!608 = !DILocation(line: 620, column: 23, scope: !2)
!609 = !DILocation(line: 625, column: 39, scope: !2)
!610 = !DILocation(line: 626, column: 3, scope: !2)
!611 = !DILocation(line: 626, column: 10, scope: !2)
!612 = !DILocation(line: 626, column: 21, scope: !2)
!613 = !DILocation(line: 628, column: 44, scope: !614)
!614 = distinct !DILexicalBlock(scope: !615, file: !3, line: 628, column: 11)
!615 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!616 = !DILocation(line: 628, column: 32, scope: !614)
!617 = !DILocation(line: 628, column: 49, scope: !614)
!618 = !DILocation(line: 628, column: 11, scope: !615)
!619 = !DILocation(line: 630, column: 11, scope: !620)
!620 = distinct !DILexicalBlock(scope: !615, file: !3, line: 630, column: 11)
!621 = !DILocation(line: 630, column: 11, scope: !615)
!622 = !DILocation(line: 632, column: 26, scope: !623)
!623 = distinct !DILexicalBlock(scope: !624, file: !3, line: 632, column: 15)
!624 = distinct !DILexicalBlock(scope: !620, file: !3, line: 631, column: 9)
!625 = !DILocation(line: 632, column: 34, scope: !623)
!626 = !DILocation(line: 632, column: 37, scope: !623)
!627 = !DILocation(line: 632, column: 15, scope: !624)
!628 = !DILocation(line: 636, column: 29, scope: !629)
!629 = distinct !DILexicalBlock(scope: !624, file: !3, line: 636, column: 15)
!630 = !DILocation(line: 640, column: 16, scope: !615)
!631 = distinct !{!631, !610, !632, !536}
!632 = !DILocation(line: 641, column: 5, scope: !2)
!633 = !DILocation(line: 644, column: 3, scope: !2)
!634 = !DILocation(line: 0, scope: !519, inlinedAt: !635)
!635 = distinct !DILocation(line: 648, column: 31, scope: !2)
!636 = !DILocation(line: 0, scope: !519, inlinedAt: !637)
!637 = distinct !DILocation(line: 649, column: 31, scope: !2)
!638 = !DILocation(line: 0, scope: !519, inlinedAt: !639)
!639 = distinct !DILocation(line: 650, column: 31, scope: !2)
!640 = !DILocation(line: 0, scope: !519, inlinedAt: !641)
!641 = distinct !DILocation(line: 651, column: 31, scope: !2)
!642 = !DILocation(line: 0, scope: !519, inlinedAt: !643)
!643 = distinct !DILocation(line: 652, column: 31, scope: !2)
!644 = !DILocation(line: 0, scope: !519, inlinedAt: !645)
!645 = distinct !DILocation(line: 653, column: 31, scope: !2)
!646 = !DILocation(line: 0, scope: !519, inlinedAt: !647)
!647 = distinct !DILocation(line: 654, column: 31, scope: !2)
!648 = !DILocation(line: 0, scope: !519, inlinedAt: !649)
!649 = distinct !DILocation(line: 655, column: 31, scope: !2)
!650 = !DILocation(line: 0, scope: !519, inlinedAt: !651)
!651 = distinct !DILocation(line: 656, column: 31, scope: !2)
!652 = !DILocation(line: 0, scope: !519, inlinedAt: !653)
!653 = distinct !DILocation(line: 657, column: 31, scope: !2)
!654 = !DILocation(line: 663, column: 7, scope: !655)
!655 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!656 = !DILocation(line: 664, column: 7, scope: !655)
!657 = !DILocation(line: 664, column: 10, scope: !655)
!658 = !DILocation(line: 663, column: 7, scope: !2)
!659 = !DILocation(line: 669, column: 7, scope: !660)
!660 = distinct !DILexicalBlock(scope: !655, file: !3, line: 665, column: 5)
!661 = !DILocation(line: 671, column: 5, scope: !660)
!662 = !DILocation(line: 676, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !655, file: !3, line: 673, column: 5)
!664 = !DILocation(line: 679, column: 3, scope: !2)
!665 = !DILocation(line: 683, column: 3, scope: !2)
!666 = !DILocation(line: 686, column: 3, scope: !2)
!667 = !DILocation(line: 688, column: 3, scope: !2)
!668 = !DILocation(line: 691, column: 3, scope: !2)
!669 = !DILocation(line: 695, column: 3, scope: !2)
!670 = !DILocation(line: 696, column: 1, scope: !2)
!671 = !DISubprogram(name: "setlocale", scope: !672, file: !672, line: 122, type: !673, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!672 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!673 = !DISubroutineType(types: !674)
!674 = !{!65, !30, !6}
!675 = !DISubprogram(name: "fputs_unlocked", scope: !143, file: !143, line: 691, type: !676, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!676 = !DISubroutineType(types: !677)
!677 = !{!30, !678, !679}
!678 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!679 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!680 = !DISubprogram(name: "getenv", scope: !681, file: !681, line: 641, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!681 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!682 = !DISubroutineType(types: !683)
!683 = !{!65, !6}
!684 = !DISubprogram(name: "fwrite_unlocked", scope: !143, file: !143, line: 704, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!685 = !DISubroutineType(types: !686)
!686 = !{!32, !687, !32, !32, !679}
!687 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!690 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 94, type: !691, scopeLine: 95, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !694)
!691 = !DISubroutineType(types: !692)
!692 = !{!30, !30, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!694 = !{!695, !696, !697, !699, !700, !702, !705, !706}
!695 = !DILocalVariable(name: "argc", arg: 1, scope: !690, file: !10, line: 94, type: !30)
!696 = !DILocalVariable(name: "argv", arg: 2, scope: !690, file: !10, line: 94, type: !693)
!697 = !DILocalVariable(name: "seconds", scope: !690, file: !10, line: 96, type: !698)
!698 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!699 = !DILocalVariable(name: "ok", scope: !690, file: !10, line: 97, type: !44)
!700 = !DILocalVariable(name: "i", scope: !701, file: !10, line: 117, type: !30)
!701 = distinct !DILexicalBlock(scope: !690, file: !10, line: 117, column: 3)
!702 = !DILocalVariable(name: "p", scope: !703, file: !10, line: 119, type: !65)
!703 = distinct !DILexicalBlock(scope: !704, file: !10, line: 118, column: 5)
!704 = distinct !DILexicalBlock(scope: !701, file: !10, line: 117, column: 3)
!705 = !DILocalVariable(name: "duration", scope: !703, file: !10, line: 121, type: !698)
!706 = !DILocalVariable(name: "s", scope: !703, file: !10, line: 122, type: !698)
!707 = !DILocation(line: 0, scope: !690)
!708 = !DILocation(line: 100, column: 21, scope: !690)
!709 = !DILocation(line: 100, column: 3, scope: !690)
!710 = !DILocation(line: 101, column: 3, scope: !690)
!711 = !DILocation(line: 102, column: 3, scope: !690)
!712 = !DILocation(line: 103, column: 3, scope: !690)
!713 = !DILocation(line: 105, column: 3, scope: !690)
!714 = !DILocation(line: 108, column: 36, scope: !690)
!715 = !DILocation(line: 108, column: 58, scope: !690)
!716 = !DILocation(line: 107, column: 3, scope: !690)
!717 = !DILocation(line: 111, column: 12, scope: !718)
!718 = distinct !DILexicalBlock(scope: !690, file: !10, line: 111, column: 7)
!719 = !DILocation(line: 111, column: 7, scope: !690)
!720 = !DILocation(line: 113, column: 7, scope: !721)
!721 = distinct !DILexicalBlock(scope: !718, file: !10, line: 112, column: 5)
!722 = !DILocation(line: 114, column: 7, scope: !721)
!723 = !DILocation(line: 117, column: 16, scope: !701)
!724 = !DILocation(line: 0, scope: !701)
!725 = !DILocation(line: 117, column: 26, scope: !704)
!726 = !DILocation(line: 117, column: 3, scope: !701)
!727 = !DILocation(line: 138, column: 7, scope: !690)
!728 = !DILocation(line: 119, column: 7, scope: !703)
!729 = !DILocation(line: 120, column: 13, scope: !703)
!730 = !DILocation(line: 121, column: 36, scope: !703)
!731 = !DILocation(line: 0, scope: !703)
!732 = !DILocation(line: 121, column: 25, scope: !703)
!733 = !DILocation(line: 122, column: 45, scope: !703)
!734 = !DILocalVariable(name: "c", arg: 1, scope: !735, file: !736, line: 54, type: !698)
!735 = distinct !DISubprogram(name: "dtimespec_bound", scope: !736, file: !736, line: 54, type: !737, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !739)
!736 = !DIFile(filename: "./lib/dtimespec-bound.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1c1d0447ed5234421679b9baaf454c86")
!737 = !DISubroutineType(types: !738)
!738 = !{!698, !698, !30}
!739 = !{!734, !740, !741}
!740 = !DILocalVariable(name: "err", arg: 2, scope: !735, file: !736, line: 54, type: !30)
!741 = !DILocalVariable(name: "phi", scope: !735, file: !736, line: 70, type: !698)
!742 = !DILocation(line: 0, scope: !735, inlinedAt: !743)
!743 = distinct !DILocation(line: 122, column: 18, scope: !703)
!744 = !DILocation(line: 60, column: 11, scope: !745, inlinedAt: !743)
!745 = distinct !DILexicalBlock(scope: !735, file: !736, line: 60, column: 7)
!746 = !DILocation(line: 60, column: 21, scope: !745, inlinedAt: !743)
!747 = !DILocation(line: 123, column: 11, scope: !748)
!748 = distinct !DILexicalBlock(scope: !703, file: !10, line: 123, column: 11)
!749 = !DILocation(line: 123, column: 22, scope: !748)
!750 = !DILocation(line: 123, column: 19, scope: !748)
!751 = !DILocation(line: 125, column: 11, scope: !748)
!752 = !DILocation(line: 127, column: 15, scope: !748)
!753 = !DILocation(line: 127, column: 18, scope: !748)
!754 = !DILocation(line: 127, column: 25, scope: !748)
!755 = !DILocation(line: 127, column: 21, scope: !748)
!756 = !DILocation(line: 129, column: 11, scope: !748)
!757 = !DILocalVariable(name: "x", arg: 1, scope: !758, file: !10, line: 65, type: !761)
!758 = distinct !DISubprogram(name: "apply_suffix", scope: !10, file: !10, line: 65, type: !759, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !762)
!759 = !DISubroutineType(types: !760)
!760 = !{!44, !761, !8}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!762 = !{!757, !763, !764}
!763 = !DILocalVariable(name: "suffix_char", arg: 2, scope: !758, file: !10, line: 65, type: !8)
!764 = !DILocalVariable(name: "multiplier", scope: !758, file: !10, line: 67, type: !30)
!765 = !DILocation(line: 0, scope: !758, inlinedAt: !766)
!766 = distinct !DILocation(line: 129, column: 16, scope: !748)
!767 = !DILocation(line: 69, column: 3, scope: !758, inlinedAt: !766)
!768 = !DILocation(line: 77, column: 7, scope: !769, inlinedAt: !766)
!769 = distinct !DILexicalBlock(scope: !758, file: !10, line: 70, column: 5)
!770 = !DILocation(line: 80, column: 7, scope: !769, inlinedAt: !766)
!771 = !DILocation(line: 83, column: 7, scope: !769, inlinedAt: !766)
!772 = !DILocation(line: 88, column: 28, scope: !758, inlinedAt: !766)
!773 = !DILocation(line: 0, scope: !735, inlinedAt: !774)
!774 = distinct !DILocation(line: 88, column: 8, scope: !758, inlinedAt: !766)
!775 = !DILocation(line: 60, column: 21, scope: !745, inlinedAt: !774)
!776 = !DILocation(line: 123, column: 11, scope: !703)
!777 = !DILocation(line: 131, column: 11, scope: !778)
!778 = distinct !DILexicalBlock(scope: !748, file: !10, line: 130, column: 9)
!779 = !DILocation(line: 133, column: 9, scope: !778)
!780 = !DILocation(line: 122, column: 14, scope: !703)
!781 = !DILocation(line: 135, column: 42, scope: !703)
!782 = !DILocation(line: 0, scope: !735, inlinedAt: !783)
!783 = distinct !DILocation(line: 135, column: 17, scope: !703)
!784 = !DILocation(line: 60, column: 21, scope: !745, inlinedAt: !783)
!785 = !DILocation(line: 136, column: 5, scope: !704)
!786 = !DILocation(line: 117, column: 35, scope: !704)
!787 = distinct !{!787, !726, !788, !536}
!788 = !DILocation(line: 136, column: 5, scope: !701)
!789 = !DILocation(line: 139, column: 5, scope: !790)
!790 = distinct !DILexicalBlock(scope: !690, file: !10, line: 138, column: 7)
!791 = !DILocation(line: 141, column: 7, scope: !792)
!792 = distinct !DILexicalBlock(scope: !690, file: !10, line: 141, column: 7)
!793 = !DILocation(line: 141, column: 7, scope: !690)
!794 = !DILocation(line: 142, column: 5, scope: !792)
!795 = !DILocation(line: 144, column: 3, scope: !690)
!796 = !DISubprogram(name: "bindtextdomain", scope: !559, file: !559, line: 86, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!797 = !DISubroutineType(types: !798)
!798 = !{!65, !6, !6}
!799 = !DISubprogram(name: "textdomain", scope: !559, file: !559, line: 82, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!800 = !DISubprogram(name: "atexit", scope: !681, file: !681, line: 602, type: !801, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!801 = !DISubroutineType(types: !802)
!802 = !{!30, !169}
!803 = distinct !DISubprogram(name: "cl_strtod", scope: !380, file: !380, line: 59, type: !804, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !379, retainedNodes: !807)
!804 = !DISubroutineType(types: !805)
!805 = !{!698, !6, !806}
!806 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !693)
!807 = !{!808, !809, !810, !811, !812, !815, !816}
!808 = !DILocalVariable(name: "nptr", arg: 1, scope: !803, file: !380, line: 59, type: !6)
!809 = !DILocalVariable(name: "endptr", arg: 2, scope: !803, file: !380, line: 59, type: !806)
!810 = !DILocalVariable(name: "end", scope: !803, file: !380, line: 61, type: !65)
!811 = !DILocalVariable(name: "d", scope: !803, file: !380, line: 62, type: !698)
!812 = !DILocalVariable(name: "strtod_errno", scope: !813, file: !380, line: 65, type: !30)
!813 = distinct !DILexicalBlock(scope: !814, file: !380, line: 64, column: 5)
!814 = distinct !DILexicalBlock(scope: !803, file: !380, line: 63, column: 7)
!815 = !DILocalVariable(name: "c_end", scope: !813, file: !380, line: 66, type: !65)
!816 = !DILocalVariable(name: "c", scope: !813, file: !380, line: 67, type: !698)
!817 = !DILocation(line: 0, scope: !803)
!818 = !DILocation(line: 61, column: 3, scope: !803)
!819 = !DILocation(line: 62, column: 14, scope: !803)
!820 = !DILocation(line: 63, column: 8, scope: !814)
!821 = !DILocation(line: 63, column: 7, scope: !814)
!822 = !DILocation(line: 63, column: 7, scope: !803)
!823 = !DILocation(line: 65, column: 26, scope: !813)
!824 = !DILocation(line: 0, scope: !813)
!825 = !DILocation(line: 66, column: 7, scope: !813)
!826 = !DILocation(line: 67, column: 18, scope: !813)
!827 = !DILocation(line: 68, column: 17, scope: !828)
!828 = distinct !DILexicalBlock(scope: !813, file: !380, line: 68, column: 11)
!829 = !DILocation(line: 68, column: 15, scope: !828)
!830 = !DILocation(line: 68, column: 11, scope: !813)
!831 = !DILocation(line: 71, column: 15, scope: !828)
!832 = !DILocation(line: 72, column: 5, scope: !814)
!833 = !DILocation(line: 72, column: 5, scope: !813)
!834 = !DILocation(line: 73, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !803, file: !380, line: 73, column: 7)
!836 = !DILocation(line: 73, column: 7, scope: !803)
!837 = !DILocation(line: 74, column: 13, scope: !835)
!838 = !DILocation(line: 74, column: 5, scope: !835)
!839 = !DILocation(line: 76, column: 1, scope: !803)
!840 = !DILocation(line: 75, column: 3, scope: !803)
!841 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !127, file: !127, line: 50, type: !495, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !842)
!842 = !{!843}
!843 = !DILocalVariable(name: "file", arg: 1, scope: !841, file: !127, line: 50, type: !6)
!844 = !DILocation(line: 0, scope: !841)
!845 = !DILocation(line: 52, column: 13, scope: !841)
!846 = !DILocation(line: 53, column: 1, scope: !841)
!847 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !127, file: !127, line: 87, type: !848, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !850)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !44}
!850 = !{!851}
!851 = !DILocalVariable(name: "ignore", arg: 1, scope: !847, file: !127, line: 87, type: !44)
!852 = !DILocation(line: 0, scope: !847)
!853 = !DILocation(line: 89, column: 16, scope: !847)
!854 = !{!855, !855, i64 0}
!855 = !{!"_Bool", !487, i64 0}
!856 = !DILocation(line: 90, column: 1, scope: !847)
!857 = distinct !DISubprogram(name: "close_stdout", scope: !127, file: !127, line: 116, type: !170, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !858)
!858 = !{!859}
!859 = !DILocalVariable(name: "write_error", scope: !860, file: !127, line: 121, type: !6)
!860 = distinct !DILexicalBlock(scope: !861, file: !127, line: 120, column: 5)
!861 = distinct !DILexicalBlock(scope: !857, file: !127, line: 118, column: 7)
!862 = !DILocation(line: 118, column: 21, scope: !861)
!863 = !DILocation(line: 118, column: 7, scope: !861)
!864 = !DILocation(line: 118, column: 29, scope: !861)
!865 = !DILocation(line: 119, column: 7, scope: !861)
!866 = !DILocation(line: 119, column: 12, scope: !861)
!867 = !{i8 0, i8 2}
!868 = !DILocation(line: 119, column: 25, scope: !861)
!869 = !DILocation(line: 119, column: 28, scope: !861)
!870 = !DILocation(line: 119, column: 34, scope: !861)
!871 = !DILocation(line: 118, column: 7, scope: !857)
!872 = !DILocation(line: 121, column: 33, scope: !860)
!873 = !DILocation(line: 0, scope: !860)
!874 = !DILocation(line: 122, column: 11, scope: !875)
!875 = distinct !DILexicalBlock(scope: !860, file: !127, line: 122, column: 11)
!876 = !DILocation(line: 0, scope: !875)
!877 = !DILocation(line: 122, column: 11, scope: !860)
!878 = !DILocation(line: 123, column: 9, scope: !875)
!879 = !DILocation(line: 126, column: 9, scope: !875)
!880 = !DILocation(line: 128, column: 14, scope: !860)
!881 = !DILocation(line: 128, column: 7, scope: !860)
!882 = !DILocation(line: 133, column: 42, scope: !883)
!883 = distinct !DILexicalBlock(scope: !857, file: !127, line: 133, column: 7)
!884 = !DILocation(line: 133, column: 28, scope: !883)
!885 = !DILocation(line: 133, column: 50, scope: !883)
!886 = !DILocation(line: 133, column: 7, scope: !857)
!887 = !DILocation(line: 134, column: 12, scope: !883)
!888 = !DILocation(line: 134, column: 5, scope: !883)
!889 = !DILocation(line: 135, column: 1, scope: !857)
!890 = distinct !DISubprogram(name: "verror", scope: !134, file: !134, line: 251, type: !891, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !30, !30, !6, !142}
!893 = !{!894, !895, !896, !897}
!894 = !DILocalVariable(name: "status", arg: 1, scope: !890, file: !134, line: 251, type: !30)
!895 = !DILocalVariable(name: "errnum", arg: 2, scope: !890, file: !134, line: 251, type: !30)
!896 = !DILocalVariable(name: "message", arg: 3, scope: !890, file: !134, line: 251, type: !6)
!897 = !DILocalVariable(name: "args", arg: 4, scope: !890, file: !134, line: 251, type: !142)
!898 = !DILocation(line: 0, scope: !890)
!899 = !DILocation(line: 251, column: 1, scope: !890)
!900 = !DILocation(line: 261, column: 3, scope: !890)
!901 = !DILocation(line: 265, column: 7, scope: !902)
!902 = distinct !DILexicalBlock(scope: !890, file: !134, line: 265, column: 7)
!903 = !DILocation(line: 265, column: 7, scope: !890)
!904 = !DILocation(line: 266, column: 5, scope: !902)
!905 = !DILocation(line: 272, column: 7, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !134, line: 268, column: 5)
!907 = !DILocation(line: 276, column: 3, scope: !890)
!908 = !{i64 0, i64 8, !485, i64 8, i64 8, !485, i64 16, i64 8, !485, i64 24, i64 4, !565, i64 28, i64 4, !565}
!909 = !DILocation(line: 282, column: 1, scope: !890)
!910 = distinct !DISubprogram(name: "flush_stdout", scope: !134, file: !134, line: 163, type: !170, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !911)
!911 = !{!912}
!912 = !DILocalVariable(name: "stdout_fd", scope: !910, file: !134, line: 166, type: !30)
!913 = !DILocation(line: 0, scope: !910)
!914 = !DILocalVariable(name: "fd", arg: 1, scope: !915, file: !134, line: 145, type: !30)
!915 = distinct !DISubprogram(name: "is_open", scope: !134, file: !134, line: 145, type: !916, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !918)
!916 = !DISubroutineType(types: !917)
!917 = !{!30, !30}
!918 = !{!914}
!919 = !DILocation(line: 0, scope: !915, inlinedAt: !920)
!920 = distinct !DILocation(line: 182, column: 25, scope: !921)
!921 = distinct !DILexicalBlock(scope: !910, file: !134, line: 182, column: 7)
!922 = !DILocation(line: 157, column: 15, scope: !915, inlinedAt: !920)
!923 = !DILocation(line: 182, column: 25, scope: !921)
!924 = !DILocation(line: 182, column: 7, scope: !910)
!925 = !DILocation(line: 184, column: 5, scope: !921)
!926 = !DILocation(line: 185, column: 1, scope: !910)
!927 = distinct !DISubprogram(name: "error_tail", scope: !134, file: !134, line: 219, type: !891, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DILocalVariable(name: "status", arg: 1, scope: !927, file: !134, line: 219, type: !30)
!930 = !DILocalVariable(name: "errnum", arg: 2, scope: !927, file: !134, line: 219, type: !30)
!931 = !DILocalVariable(name: "message", arg: 3, scope: !927, file: !134, line: 219, type: !6)
!932 = !DILocalVariable(name: "args", arg: 4, scope: !927, file: !134, line: 219, type: !142)
!933 = !DILocation(line: 0, scope: !927)
!934 = !DILocation(line: 219, column: 1, scope: !927)
!935 = !DILocation(line: 229, column: 13, scope: !927)
!936 = !DILocation(line: 229, column: 3, scope: !927)
!937 = !DILocalVariable(name: "__stream", arg: 1, scope: !938, file: !939, line: 132, type: !942)
!938 = distinct !DISubprogram(name: "vfprintf", scope: !939, file: !939, line: 132, type: !940, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !977)
!939 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!940 = !DISubroutineType(types: !941)
!941 = !{!30, !942, !678, !144}
!942 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !59, line: 7, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !61, line: 49, size: 1728, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !945, file: !61, line: 51, baseType: !30, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !945, file: !61, line: 54, baseType: !65, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !945, file: !61, line: 55, baseType: !65, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !945, file: !61, line: 56, baseType: !65, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !945, file: !61, line: 57, baseType: !65, size: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !945, file: !61, line: 58, baseType: !65, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !945, file: !61, line: 59, baseType: !65, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !945, file: !61, line: 60, baseType: !65, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !945, file: !61, line: 61, baseType: !65, size: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !945, file: !61, line: 64, baseType: !65, size: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !945, file: !61, line: 65, baseType: !65, size: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !945, file: !61, line: 66, baseType: !65, size: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !945, file: !61, line: 68, baseType: !77, size: 64, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !945, file: !61, line: 70, baseType: !961, size: 64, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !945, file: !61, line: 72, baseType: !30, size: 32, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !945, file: !61, line: 73, baseType: !30, size: 32, offset: 928)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !945, file: !61, line: 74, baseType: !84, size: 64, offset: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !945, file: !61, line: 77, baseType: !31, size: 16, offset: 1024)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !945, file: !61, line: 78, baseType: !89, size: 8, offset: 1040)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !945, file: !61, line: 79, baseType: !91, size: 8, offset: 1048)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !945, file: !61, line: 81, baseType: !95, size: 64, offset: 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !945, file: !61, line: 89, baseType: !98, size: 64, offset: 1152)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !945, file: !61, line: 91, baseType: !100, size: 64, offset: 1216)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !945, file: !61, line: 92, baseType: !103, size: 64, offset: 1280)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !945, file: !61, line: 93, baseType: !961, size: 64, offset: 1344)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !945, file: !61, line: 94, baseType: !29, size: 64, offset: 1408)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !945, file: !61, line: 95, baseType: !32, size: 64, offset: 1472)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !945, file: !61, line: 96, baseType: !30, size: 32, offset: 1536)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !945, file: !61, line: 98, baseType: !110, size: 160, offset: 1568)
!977 = !{!937, !978, !979}
!978 = !DILocalVariable(name: "__fmt", arg: 2, scope: !938, file: !939, line: 133, type: !678)
!979 = !DILocalVariable(name: "__ap", arg: 3, scope: !938, file: !939, line: 133, type: !144)
!980 = !DILocation(line: 0, scope: !938, inlinedAt: !981)
!981 = distinct !DILocation(line: 229, column: 3, scope: !927)
!982 = !DILocation(line: 135, column: 10, scope: !938, inlinedAt: !981)
!983 = !{!984, !986}
!984 = distinct !{!984, !985, !"vfprintf.inline: argument 0"}
!985 = distinct !{!985, !"vfprintf.inline"}
!986 = distinct !{!986, !985, !"vfprintf.inline: argument 1"}
!987 = !DILocation(line: 232, column: 3, scope: !927)
!988 = !DILocation(line: 233, column: 7, scope: !989)
!989 = distinct !DILexicalBlock(scope: !927, file: !134, line: 233, column: 7)
!990 = !DILocation(line: 233, column: 7, scope: !927)
!991 = !DILocalVariable(name: "errnum", arg: 1, scope: !992, file: !134, line: 188, type: !30)
!992 = distinct !DISubprogram(name: "print_errno_message", scope: !134, file: !134, line: 188, type: !475, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !993)
!993 = !{!991, !994, !995}
!994 = !DILocalVariable(name: "s", scope: !992, file: !134, line: 190, type: !6)
!995 = !DILocalVariable(name: "errbuf", scope: !992, file: !134, line: 193, type: !996)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 1024)
!999 = !DILocation(line: 0, scope: !992, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 234, column: 5, scope: !989)
!1001 = !DILocation(line: 193, column: 3, scope: !992, inlinedAt: !1000)
!1002 = !DILocation(line: 193, column: 8, scope: !992, inlinedAt: !1000)
!1003 = !DILocation(line: 195, column: 7, scope: !992, inlinedAt: !1000)
!1004 = !DILocation(line: 207, column: 9, scope: !1005, inlinedAt: !1000)
!1005 = distinct !DILexicalBlock(scope: !992, file: !134, line: 207, column: 7)
!1006 = !DILocation(line: 207, column: 7, scope: !992, inlinedAt: !1000)
!1007 = !DILocation(line: 208, column: 9, scope: !1005, inlinedAt: !1000)
!1008 = !DILocation(line: 208, column: 5, scope: !1005, inlinedAt: !1000)
!1009 = !DILocation(line: 214, column: 3, scope: !992, inlinedAt: !1000)
!1010 = !DILocation(line: 216, column: 1, scope: !992, inlinedAt: !1000)
!1011 = !DILocation(line: 234, column: 5, scope: !989)
!1012 = !DILocation(line: 238, column: 3, scope: !927)
!1013 = !DILocalVariable(name: "__c", arg: 1, scope: !1014, file: !1015, line: 101, type: !30)
!1014 = distinct !DISubprogram(name: "putc_unlocked", scope: !1015, file: !1015, line: 101, type: !1016, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !1018)
!1015 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!30, !30, !943}
!1018 = !{!1013, !1019}
!1019 = !DILocalVariable(name: "__stream", arg: 2, scope: !1014, file: !1015, line: 101, type: !943)
!1020 = !DILocation(line: 0, scope: !1014, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 238, column: 3, scope: !927)
!1022 = !DILocation(line: 103, column: 10, scope: !1014, inlinedAt: !1021)
!1023 = !{!1024, !486, i64 40}
!1024 = !{!"_IO_FILE", !566, i64 0, !486, i64 8, !486, i64 16, !486, i64 24, !486, i64 32, !486, i64 40, !486, i64 48, !486, i64 56, !486, i64 64, !486, i64 72, !486, i64 80, !486, i64 88, !486, i64 96, !486, i64 104, !566, i64 112, !566, i64 116, !1025, i64 120, !600, i64 128, !487, i64 130, !487, i64 131, !486, i64 136, !1025, i64 144, !486, i64 152, !486, i64 160, !486, i64 168, !486, i64 176, !1025, i64 184, !566, i64 192, !487, i64 196}
!1025 = !{!"long", !487, i64 0}
!1026 = !{!1024, !486, i64 48}
!1027 = !{!"branch_weights", i32 2000, i32 1}
!1028 = !DILocation(line: 240, column: 3, scope: !927)
!1029 = !DILocation(line: 241, column: 7, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !927, file: !134, line: 241, column: 7)
!1031 = !DILocation(line: 241, column: 7, scope: !927)
!1032 = !DILocation(line: 242, column: 5, scope: !1030)
!1033 = !DILocation(line: 243, column: 1, scope: !927)
!1034 = !DISubprogram(name: "strerror_r", scope: !1035, file: !1035, line: 444, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!1035 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!65, !30, !65, !32}
!1038 = !DISubprogram(name: "fflush_unlocked", scope: !143, file: !143, line: 239, type: !1039, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!30, !943}
!1041 = !DISubprogram(name: "fcntl", scope: !1042, file: !1042, line: 149, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!1042 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!30, !30, !30, null}
!1045 = distinct !DISubprogram(name: "error", scope: !134, file: !134, line: 285, type: !1046, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !1048)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !30, !30, !6, null}
!1048 = !{!1049, !1050, !1051, !1052}
!1049 = !DILocalVariable(name: "status", arg: 1, scope: !1045, file: !134, line: 285, type: !30)
!1050 = !DILocalVariable(name: "errnum", arg: 2, scope: !1045, file: !134, line: 285, type: !30)
!1051 = !DILocalVariable(name: "message", arg: 3, scope: !1045, file: !134, line: 285, type: !6)
!1052 = !DILocalVariable(name: "ap", scope: !1045, file: !134, line: 287, type: !142)
!1053 = !DILocation(line: 0, scope: !1045)
!1054 = !DILocation(line: 287, column: 3, scope: !1045)
!1055 = !DILocation(line: 287, column: 11, scope: !1045)
!1056 = !DILocation(line: 288, column: 3, scope: !1045)
!1057 = !DILocation(line: 289, column: 3, scope: !1045)
!1058 = !DILocation(line: 290, column: 3, scope: !1045)
!1059 = !DILocation(line: 291, column: 1, scope: !1045)
!1060 = !DILocation(line: 0, scope: !139)
!1061 = !DILocation(line: 298, column: 1, scope: !139)
!1062 = !DILocation(line: 302, column: 7, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !139, file: !134, line: 302, column: 7)
!1064 = !DILocation(line: 302, column: 7, scope: !139)
!1065 = !DILocation(line: 307, column: 11, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1067, file: !134, line: 307, column: 11)
!1067 = distinct !DILexicalBlock(scope: !1063, file: !134, line: 303, column: 5)
!1068 = !DILocation(line: 307, column: 27, scope: !1066)
!1069 = !DILocation(line: 308, column: 11, scope: !1066)
!1070 = !DILocation(line: 308, column: 28, scope: !1066)
!1071 = !DILocation(line: 308, column: 25, scope: !1066)
!1072 = !DILocation(line: 309, column: 15, scope: !1066)
!1073 = !DILocation(line: 309, column: 33, scope: !1066)
!1074 = !DILocation(line: 310, column: 19, scope: !1066)
!1075 = !DILocation(line: 311, column: 22, scope: !1066)
!1076 = !DILocation(line: 311, column: 56, scope: !1066)
!1077 = !DILocation(line: 307, column: 11, scope: !1067)
!1078 = !DILocation(line: 316, column: 21, scope: !1067)
!1079 = !DILocation(line: 317, column: 23, scope: !1067)
!1080 = !DILocation(line: 318, column: 5, scope: !1067)
!1081 = !DILocation(line: 327, column: 3, scope: !139)
!1082 = !DILocation(line: 331, column: 7, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !139, file: !134, line: 331, column: 7)
!1084 = !DILocation(line: 331, column: 7, scope: !139)
!1085 = !DILocation(line: 332, column: 5, scope: !1083)
!1086 = !DILocation(line: 338, column: 7, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1083, file: !134, line: 334, column: 5)
!1088 = !DILocation(line: 346, column: 3, scope: !139)
!1089 = !DILocation(line: 350, column: 3, scope: !139)
!1090 = !DILocation(line: 356, column: 1, scope: !139)
!1091 = distinct !DISubprogram(name: "error_at_line", scope: !134, file: !134, line: 359, type: !1092, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !1094)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !30, !30, !6, !14, !6, null}
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100}
!1095 = !DILocalVariable(name: "status", arg: 1, scope: !1091, file: !134, line: 359, type: !30)
!1096 = !DILocalVariable(name: "errnum", arg: 2, scope: !1091, file: !134, line: 359, type: !30)
!1097 = !DILocalVariable(name: "file_name", arg: 3, scope: !1091, file: !134, line: 359, type: !6)
!1098 = !DILocalVariable(name: "line_number", arg: 4, scope: !1091, file: !134, line: 360, type: !14)
!1099 = !DILocalVariable(name: "message", arg: 5, scope: !1091, file: !134, line: 360, type: !6)
!1100 = !DILocalVariable(name: "ap", scope: !1091, file: !134, line: 362, type: !142)
!1101 = !DILocation(line: 0, scope: !1091)
!1102 = !DILocation(line: 362, column: 3, scope: !1091)
!1103 = !DILocation(line: 362, column: 11, scope: !1091)
!1104 = !DILocation(line: 363, column: 3, scope: !1091)
!1105 = !DILocation(line: 364, column: 3, scope: !1091)
!1106 = !DILocation(line: 366, column: 3, scope: !1091)
!1107 = !DILocation(line: 367, column: 1, scope: !1091)
!1108 = distinct !DISubprogram(name: "getprogname", scope: !382, file: !382, line: 54, type: !1109, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !562)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!6}
!1111 = !DILocation(line: 58, column: 10, scope: !1108)
!1112 = !DILocation(line: 58, column: 3, scope: !1108)
!1113 = distinct !DISubprogram(name: "parse_long_options", scope: !175, file: !175, line: 45, type: !1114, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !1117)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{null, !30, !693, !6, !6, !6, !1116, null}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1128}
!1118 = !DILocalVariable(name: "argc", arg: 1, scope: !1113, file: !175, line: 45, type: !30)
!1119 = !DILocalVariable(name: "argv", arg: 2, scope: !1113, file: !175, line: 46, type: !693)
!1120 = !DILocalVariable(name: "command_name", arg: 3, scope: !1113, file: !175, line: 47, type: !6)
!1121 = !DILocalVariable(name: "package", arg: 4, scope: !1113, file: !175, line: 48, type: !6)
!1122 = !DILocalVariable(name: "version", arg: 5, scope: !1113, file: !175, line: 49, type: !6)
!1123 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1113, file: !175, line: 50, type: !1116)
!1124 = !DILocalVariable(name: "saved_opterr", scope: !1113, file: !175, line: 53, type: !30)
!1125 = !DILocalVariable(name: "c", scope: !1126, file: !175, line: 60, type: !30)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !175, line: 59, column: 5)
!1127 = distinct !DILexicalBlock(scope: !1113, file: !175, line: 58, column: 7)
!1128 = !DILocalVariable(name: "authors", scope: !1129, file: !175, line: 71, type: !1133)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !175, line: 70, column: 15)
!1130 = distinct !DILexicalBlock(scope: !1131, file: !175, line: 64, column: 13)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !175, line: 62, column: 9)
!1132 = distinct !DILexicalBlock(scope: !1126, file: !175, line: 61, column: 11)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1136, baseType: !1137)
!1136 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1137, file: !1136, line: 71, baseType: !29, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1137, file: !1136, line: 71, baseType: !29, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1137, file: !1136, line: 71, baseType: !29, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1137, file: !1136, line: 71, baseType: !30, size: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1137, file: !1136, line: 71, baseType: !30, size: 32, offset: 224)
!1144 = !DILocation(line: 0, scope: !1113)
!1145 = !DILocation(line: 53, column: 22, scope: !1113)
!1146 = !DILocation(line: 56, column: 10, scope: !1113)
!1147 = !DILocation(line: 58, column: 12, scope: !1127)
!1148 = !DILocation(line: 58, column: 7, scope: !1113)
!1149 = !DILocation(line: 60, column: 15, scope: !1126)
!1150 = !DILocation(line: 0, scope: !1126)
!1151 = !DILocation(line: 61, column: 11, scope: !1126)
!1152 = !DILocation(line: 66, column: 15, scope: !1130)
!1153 = !DILocation(line: 67, column: 15, scope: !1130)
!1154 = !DILocation(line: 71, column: 17, scope: !1129)
!1155 = !DILocation(line: 71, column: 25, scope: !1129)
!1156 = !DILocation(line: 72, column: 17, scope: !1129)
!1157 = !DILocation(line: 73, column: 33, scope: !1129)
!1158 = !DILocation(line: 73, column: 17, scope: !1129)
!1159 = !DILocation(line: 74, column: 17, scope: !1129)
!1160 = !DILocation(line: 85, column: 10, scope: !1113)
!1161 = !DILocation(line: 89, column: 10, scope: !1113)
!1162 = !DILocation(line: 90, column: 1, scope: !1113)
!1163 = !DISubprogram(name: "getopt_long", scope: !180, file: !180, line: 66, type: !1164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !562)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!30, !30, !1166, !6, !1168, !185}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!1169 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !175, file: !175, line: 98, type: !1170, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !1172)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !30, !693, !6, !6, !6, !44, !1116, null}
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183}
!1173 = !DILocalVariable(name: "argc", arg: 1, scope: !1169, file: !175, line: 98, type: !30)
!1174 = !DILocalVariable(name: "argv", arg: 2, scope: !1169, file: !175, line: 99, type: !693)
!1175 = !DILocalVariable(name: "command_name", arg: 3, scope: !1169, file: !175, line: 100, type: !6)
!1176 = !DILocalVariable(name: "package", arg: 4, scope: !1169, file: !175, line: 101, type: !6)
!1177 = !DILocalVariable(name: "version", arg: 5, scope: !1169, file: !175, line: 102, type: !6)
!1178 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1169, file: !175, line: 103, type: !44)
!1179 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1169, file: !175, line: 104, type: !1116)
!1180 = !DILocalVariable(name: "saved_opterr", scope: !1169, file: !175, line: 107, type: !30)
!1181 = !DILocalVariable(name: "optstring", scope: !1169, file: !175, line: 112, type: !6)
