; ModuleID = 'src/sort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.__sigset_t = type { [16 x i64] }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.keyfield = type { i64, i64, i64, i64, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, %struct.keyfield* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.month = type { i8*, i32 }
%struct.tempnode = type { %struct.tempnode*, i32, i8, [0 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.rlimit, %struct.rlimit, %struct.rlimit, [2 x i32] }
%struct.rlimit = type { i64, i64 }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.hash_table = type { %struct.hash_entry*, %struct.hash_entry*, i64, i64, i64, %struct.hash_tuning*, i64 (i8*, i64)*, i1 (i8*, i8*)*, void (i8*)*, %struct.hash_entry* }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.hash_entry = type { i8*, %struct.hash_entry* }
%struct.line = type { i8*, i64, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hard_LC_COLLATE", scope: !2, file: !3, line: 153, type: !38, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !901, globals: !907, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/sort.c", directory: "/src", checksumkind: CSK_MD5, checksum: "eb190b2bb7facfe69b39aec13ec2bceb")
!4 = !{!5, !10, !13, !399, !404, !407, !421, !427, !430, !445, !831, !839, !861, !870, !882, !887, !891, !894, !898}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 110, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9}
!8 = !DIEnumerator(name: "SORT_OUT_OF_ORDER", value: 1)
!9 = !DIEnumerator(name: "SORT_FAILURE", value: 2)
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 334, baseType: !6, size: 32, elements: !11)
!11 = !{!12}
!12 = !DIEnumerator(name: "NON_CHAR", value: 256)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !14, file: !3, line: 4490, baseType: !6, size: 32, elements: !397)
!14 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 4432, type: !15, scopeLine: 4433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !21)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !17, !18}
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !{!22, !23, !24, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !130, !131, !132, !163, !274, !276, !278, !280, !285, !292, !297, !299, !302, !359, !363, !369, !372, !390, !392, !396}
!22 = !DILocalVariable(name: "argc", arg: 1, scope: !14, file: !3, line: 4432, type: !17)
!23 = !DILocalVariable(name: "argv", arg: 2, scope: !14, file: !3, line: 4432, type: !18)
!24 = !DILocalVariable(name: "key", scope: !14, file: !3, line: 4434, type: !25)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "keyfield", file: !3, line: 192, size: 576, elements: !27)
!27 = !{!28, !32, !33, !34, !35, !39, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sword", scope: !26, file: !3, line: 194, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!31 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "schar", scope: !26, file: !3, line: 195, baseType: !29, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "eword", scope: !26, file: !3, line: 196, baseType: !29, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "echar", scope: !26, file: !3, line: 197, baseType: !29, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !26, file: !3, line: 198, baseType: !36, size: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !26, file: !3, line: 199, baseType: !40, size: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "skipsblanks", scope: !26, file: !3, line: 200, baseType: !38, size: 8, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "skipeblanks", scope: !26, file: !3, line: 201, baseType: !38, size: 8, offset: 392)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "numeric", scope: !26, file: !3, line: 202, baseType: !38, size: 8, offset: 400)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !26, file: !3, line: 205, baseType: !38, size: 8, offset: 408)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "general_numeric", scope: !26, file: !3, line: 206, baseType: !38, size: 8, offset: 416)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "human_numeric", scope: !26, file: !3, line: 208, baseType: !38, size: 8, offset: 424)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !26, file: !3, line: 210, baseType: !38, size: 8, offset: 432)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "reverse", scope: !26, file: !3, line: 211, baseType: !38, size: 8, offset: 440)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !26, file: !3, line: 212, baseType: !38, size: 8, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "traditional_used", scope: !26, file: !3, line: 213, baseType: !38, size: 8, offset: 456)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !26, file: !3, line: 214, baseType: !25, size: 64, offset: 512)
!53 = !DILocalVariable(name: "key_buf", scope: !14, file: !3, line: 4435, type: !26)
!54 = !DILocalVariable(name: "gkey", scope: !14, file: !3, line: 4436, type: !26)
!55 = !DILocalVariable(name: "gkey_only", scope: !14, file: !3, line: 4437, type: !38)
!56 = !DILocalVariable(name: "s", scope: !14, file: !3, line: 4438, type: !40)
!57 = !DILocalVariable(name: "c", scope: !14, file: !3, line: 4439, type: !17)
!58 = !DILocalVariable(name: "checkonly", scope: !14, file: !3, line: 4440, type: !20)
!59 = !DILocalVariable(name: "mergeonly", scope: !14, file: !3, line: 4441, type: !38)
!60 = !DILocalVariable(name: "random_source", scope: !14, file: !3, line: 4442, type: !19)
!61 = !DILocalVariable(name: "need_random", scope: !14, file: !3, line: 4443, type: !38)
!62 = !DILocalVariable(name: "nthreads", scope: !14, file: !3, line: 4444, type: !29)
!63 = !DILocalVariable(name: "nfiles", scope: !14, file: !3, line: 4445, type: !29)
!64 = !DILocalVariable(name: "posixly_correct", scope: !14, file: !3, line: 4446, type: !38)
!65 = !DILocalVariable(name: "posix_ver", scope: !14, file: !3, line: 4447, type: !17)
!66 = !DILocalVariable(name: "traditional_usage", scope: !14, file: !3, line: 4448, type: !38)
!67 = !DILocalVariable(name: "files", scope: !14, file: !3, line: 4449, type: !18)
!68 = !DILocalVariable(name: "files_from", scope: !14, file: !3, line: 4450, type: !19)
!69 = !DILocalVariable(name: "tok", scope: !14, file: !3, line: 4451, type: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !71, line: 32, size: 2304, elements: !72)
!71 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!72 = !{!73, !74, !75, !77, !128, !129}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !70, file: !71, line: 34, baseType: !29, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !70, file: !71, line: 35, baseType: !18, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !70, file: !71, line: 36, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !70, file: !71, line: 37, baseType: !78, size: 704, offset: 192)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !79, line: 210, size: 704, elements: !80)
!79 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!80 = !{!81, !82, !92, !93, !94, !95, !101, !102, !113, !124, !125, !126, !127}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !78, file: !79, line: 212, baseType: !29, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !78, file: !79, line: 213, baseType: !83, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !79, line: 203, size: 128, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !84, file: !79, line: 205, baseType: !19, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !79, line: 206, baseType: !83, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !84, file: !79, line: 207, baseType: !89, offset: 128)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: -1)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !78, file: !79, line: 214, baseType: !19, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !78, file: !79, line: 215, baseType: !19, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !78, file: !79, line: 216, baseType: !19, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !78, file: !79, line: 221, baseType: !96, size: 64, offset: 320)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !79, line: 217, size: 64, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !96, file: !79, line: 219, baseType: !29, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !96, file: !79, line: 220, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !78, file: !79, line: 222, baseType: !29, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !78, file: !79, line: 229, baseType: !103, size: 64, offset: 448)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !79, line: 225, size: 64, elements: !104)
!104 = !{!105, !109}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !103, file: !79, line: 227, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!100, !29}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !103, file: !79, line: 228, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!100, !100, !29}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !78, file: !79, line: 234, baseType: !114, size: 64, offset: 512)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !79, line: 230, size: 64, elements: !115)
!115 = !{!116, !120}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !114, file: !79, line: 232, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !100}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !114, file: !79, line: 233, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !100, !100}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !78, file: !79, line: 236, baseType: !100, size: 64, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !78, file: !79, line: 237, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !78, file: !79, line: 238, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !78, file: !79, line: 242, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !70, file: !71, line: 38, baseType: !78, size: 704, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !70, file: !71, line: 39, baseType: !78, size: 704, offset: 1600)
!130 = !DILocalVariable(name: "outfile", scope: !14, file: !3, line: 4452, type: !40)
!131 = !DILocalVariable(name: "locale_ok", scope: !14, file: !3, line: 4453, type: !38)
!132 = !DILocalVariable(name: "locale", scope: !133, file: !3, line: 4470, type: !134)
!133 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4469, column: 3)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !137, line: 51, size: 768, elements: !138)
!137 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !136, file: !137, line: 55, baseType: !19, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !136, file: !137, line: 56, baseType: !19, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !136, file: !137, line: 62, baseType: !19, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !136, file: !137, line: 68, baseType: !19, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !136, file: !137, line: 69, baseType: !19, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !136, file: !137, line: 70, baseType: !19, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !136, file: !137, line: 71, baseType: !19, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !136, file: !137, line: 72, baseType: !19, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !136, file: !137, line: 73, baseType: !19, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !136, file: !137, line: 74, baseType: !19, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !136, file: !137, line: 75, baseType: !20, size: 8, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !136, file: !137, line: 76, baseType: !20, size: 8, offset: 648)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !136, file: !137, line: 78, baseType: !20, size: 8, offset: 656)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !136, file: !137, line: 80, baseType: !20, size: 8, offset: 664)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !136, file: !137, line: 82, baseType: !20, size: 8, offset: 672)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !136, file: !137, line: 84, baseType: !20, size: 8, offset: 680)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !136, file: !137, line: 91, baseType: !20, size: 8, offset: 688)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !136, file: !137, line: 92, baseType: !20, size: 8, offset: 696)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !136, file: !137, line: 95, baseType: !20, size: 8, offset: 704)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !136, file: !137, line: 97, baseType: !20, size: 8, offset: 712)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !136, file: !137, line: 99, baseType: !20, size: 8, offset: 720)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !136, file: !137, line: 101, baseType: !20, size: 8, offset: 728)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !136, file: !137, line: 108, baseType: !20, size: 8, offset: 736)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !136, file: !137, line: 109, baseType: !20, size: 8, offset: 744)
!163 = !DILocalVariable(name: "act", scope: !164, file: !3, line: 4492, type: !165)
!164 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4489, column: 3)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !166, line: 27, size: 1216, elements: !167)
!166 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!167 = !{!168, !260, !269, !270}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !165, file: !166, line: 38, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !166, line: 31, size: 64, elements: !170)
!170 = !{!171, !177}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !169, file: !166, line: 34, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !173, line: 72, baseType: !174)
!173 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !17}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !169, file: !166, line: 36, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !17, !181, !100}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !183, line: 124, baseType: !184)
!183 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 36, size: 1024, elements: !185)
!185 = !{!186, !187, !188, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !184, file: !183, line: 38, baseType: !17, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !184, file: !183, line: 40, baseType: !17, size: 32, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !184, file: !183, line: 42, baseType: !17, size: 32, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !184, file: !183, line: 48, baseType: !17, size: 32, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !184, file: !183, line: 123, baseType: !191, size: 896, offset: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !184, file: !183, line: 51, size: 896, elements: !192)
!192 = !{!193, !197, !205, !217, !223, !233, !249, !254}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !191, file: !183, line: 53, baseType: !194, size: 896)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 896, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 28)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !191, file: !183, line: 60, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 56, size: 64, elements: !199)
!199 = !{!200, !203}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !198, file: !183, line: 58, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !202, line: 154, baseType: !17)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!203 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !198, file: !183, line: 59, baseType: !204, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !202, line: 146, baseType: !6)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !191, file: !183, line: 68, baseType: !206, size: 128)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 63, size: 128, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !206, file: !183, line: 65, baseType: !17, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !206, file: !183, line: 66, baseType: !17, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !206, file: !183, line: 67, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !212, line: 30, baseType: !213)
!212 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !212, line: 24, size: 64, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !213, file: !212, line: 26, baseType: !17, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !213, file: !212, line: 27, baseType: !100, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !191, file: !183, line: 76, baseType: !218, size: 128)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 71, size: 128, elements: !219)
!219 = !{!220, !221, !222}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !218, file: !183, line: 73, baseType: !201, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !218, file: !183, line: 74, baseType: !204, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !218, file: !183, line: 75, baseType: !211, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !191, file: !183, line: 86, baseType: !224, size: 256)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 79, size: 256, elements: !225)
!225 = !{!226, !227, !228, !229, !232}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !224, file: !183, line: 81, baseType: !201, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !224, file: !183, line: 82, baseType: !204, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !224, file: !183, line: 83, baseType: !17, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !224, file: !183, line: 84, baseType: !230, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !202, line: 156, baseType: !231)
!231 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !224, file: !183, line: 85, baseType: !230, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !191, file: !183, line: 105, baseType: !234, size: 256)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 89, size: 256, elements: !235)
!235 = !{!236, !237, !239}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !234, file: !183, line: 91, baseType: !100, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !234, file: !183, line: 93, baseType: !238, size: 16, offset: 64)
!238 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !234, file: !183, line: 104, baseType: !240, size: 128, offset: 128)
!240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !183, line: 94, size: 128, elements: !241)
!241 = !{!242, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !240, file: !183, line: 101, baseType: !243, size: 128)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !240, file: !183, line: 97, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !243, file: !183, line: 99, baseType: !100, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !243, file: !183, line: 100, baseType: !100, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !240, file: !183, line: 103, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !202, line: 42, baseType: !6)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !191, file: !183, line: 112, baseType: !250, size: 128)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 108, size: 128, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !250, file: !183, line: 110, baseType: !231, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !250, file: !183, line: 111, baseType: !17, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !191, file: !183, line: 121, baseType: !255, size: 128)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !191, file: !183, line: 116, size: 128, elements: !256)
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !255, file: !183, line: 118, baseType: !100, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !255, file: !183, line: 119, baseType: !17, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !255, file: !183, line: 120, baseType: !6, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !165, file: !166, line: 46, baseType: !261, size: 1024, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !262, line: 8, baseType: !263)
!262 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !262, line: 5, size: 1024, elements: !264)
!264 = !{!265}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !263, file: !262, line: 7, baseType: !266, size: 1024)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !165, file: !166, line: 49, baseType: !17, size: 32, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !165, file: !166, line: 52, baseType: !271, size: 64, offset: 1152)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null}
!274 = !DILocalVariable(name: "i", scope: !275, file: !3, line: 4495, type: !29)
!275 = distinct !DILexicalBlock(scope: !164, file: !3, line: 4495, column: 5)
!276 = !DILocalVariable(name: "i", scope: !277, file: !3, line: 4508, type: !29)
!277 = distinct !DILexicalBlock(scope: !164, file: !3, line: 4508, column: 5)
!278 = !DILocalVariable(name: "oi", scope: !279, file: !3, line: 4532, type: !17)
!279 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4527, column: 5)
!280 = !DILocalVariable(name: "minus_pos_usage", scope: !281, file: !3, line: 4555, type: !38)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 4554, column: 13)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4553, column: 15)
!283 = distinct !DILexicalBlock(scope: !284, file: !3, line: 4550, column: 9)
!284 = distinct !DILexicalBlock(scope: !279, file: !3, line: 4534, column: 11)
!285 = !DILocalVariable(name: "optarg1", scope: !286, file: !3, line: 4574, type: !40)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 4573, column: 25)
!287 = distinct !DILexicalBlock(scope: !288, file: !3, line: 4572, column: 27)
!288 = distinct !DILexicalBlock(scope: !289, file: !3, line: 4571, column: 21)
!289 = distinct !DILexicalBlock(scope: !290, file: !3, line: 4568, column: 23)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 4559, column: 17)
!291 = distinct !DILexicalBlock(scope: !281, file: !3, line: 4558, column: 19)
!292 = !DILocalVariable(name: "str", scope: !293, file: !3, line: 4618, type: !294)
!293 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4617, column: 11)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 16, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 2)
!297 = !DILocalVariable(name: "newtab", scope: !298, file: !3, line: 4732, type: !20)
!298 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4731, column: 11)
!299 = !DILocalVariable(name: "p", scope: !300, file: !3, line: 4780, type: !40)
!300 = distinct !DILexicalBlock(scope: !301, file: !3, line: 4779, column: 13)
!301 = distinct !DILexicalBlock(scope: !283, file: !3, line: 4778, column: 15)
!302 = !DILocalVariable(name: "stream", scope: !303, file: !3, line: 4817, type: !305)
!303 = distinct !DILexicalBlock(scope: !304, file: !3, line: 4806, column: 5)
!304 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4805, column: 7)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !307, line: 7, baseType: !308)
!307 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !309, line: 49, size: 1728, elements: !310)
!309 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !326, !328, !329, !330, !332, !334, !336, !340, !343, !345, !348, !351, !352, !353, !354, !355}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !308, file: !309, line: 51, baseType: !17, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !308, file: !309, line: 54, baseType: !19, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !308, file: !309, line: 55, baseType: !19, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !308, file: !309, line: 56, baseType: !19, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !308, file: !309, line: 57, baseType: !19, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !308, file: !309, line: 58, baseType: !19, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !308, file: !309, line: 59, baseType: !19, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !308, file: !309, line: 60, baseType: !19, size: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !308, file: !309, line: 61, baseType: !19, size: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !308, file: !309, line: 64, baseType: !19, size: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !308, file: !309, line: 65, baseType: !19, size: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !308, file: !309, line: 66, baseType: !19, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !308, file: !309, line: 68, baseType: !324, size: 64, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !309, line: 36, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !308, file: !309, line: 70, baseType: !327, size: 64, offset: 832)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !308, file: !309, line: 72, baseType: !17, size: 32, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !308, file: !309, line: 73, baseType: !17, size: 32, offset: 928)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !308, file: !309, line: 74, baseType: !331, size: 64, offset: 960)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !202, line: 152, baseType: !231)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !308, file: !309, line: 77, baseType: !333, size: 16, offset: 1024)
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !308, file: !309, line: 78, baseType: !335, size: 8, offset: 1040)
!335 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !308, file: !309, line: 79, baseType: !337, size: 8, offset: 1048)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 1)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !308, file: !309, line: 81, baseType: !341, size: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !309, line: 43, baseType: null)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !308, file: !309, line: 89, baseType: !344, size: 64, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !202, line: 153, baseType: !231)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !308, file: !309, line: 91, baseType: !346, size: 64, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !309, line: 37, flags: DIFlagFwdDecl)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !308, file: !309, line: 92, baseType: !349, size: 64, offset: 1280)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !309, line: 38, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !308, file: !309, line: 93, baseType: !327, size: 64, offset: 1344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !308, file: !309, line: 94, baseType: !100, size: 64, offset: 1408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !308, file: !309, line: 95, baseType: !29, size: 64, offset: 1472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !308, file: !309, line: 96, baseType: !17, size: 32, offset: 1536)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !308, file: !309, line: 98, baseType: !356, size: 160, offset: 1568)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 160, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 20)
!359 = !DILocalVariable(name: "i", scope: !360, file: !3, line: 4831, type: !29)
!360 = distinct !DILexicalBlock(scope: !361, file: !3, line: 4831, column: 11)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 4827, column: 9)
!362 = distinct !DILexicalBlock(scope: !303, file: !3, line: 4826, column: 11)
!363 = !DILocalVariable(name: "file_number", scope: !364, file: !3, line: 4843, type: !31)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 4839, column: 17)
!365 = distinct !DILexicalBlock(scope: !366, file: !3, line: 4838, column: 24)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 4833, column: 19)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 4832, column: 13)
!368 = distinct !DILexicalBlock(scope: !360, file: !3, line: 4831, column: 11)
!369 = !DILocalVariable(name: "tmp_dir", scope: !370, file: !3, line: 4920, type: !40)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 4919, column: 5)
!371 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4918, column: 7)
!372 = !DILocalVariable(name: "sortfiles", scope: !373, file: !3, line: 4963, type: !375)
!373 = distinct !DILexicalBlock(scope: !374, file: !3, line: 4962, column: 5)
!374 = distinct !DILexicalBlock(scope: !14, file: !3, line: 4961, column: 7)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sortfile", file: !3, line: 720, size: 128, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !376, file: !3, line: 723, baseType: !40, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !376, file: !3, line: 726, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tempnode", file: !3, line: 368, size: 128, elements: !382)
!382 = !{!383, !385, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !3, line: 370, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !380)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !381, file: !3, line: 371, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !387, line: 38, baseType: !201)
!387 = !DIFile(filename: "/usr/include/sched.h", directory: "", checksumkind: CSK_MD5, checksum: "52ea601aba54a9937a50019367077a72")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !381, file: !3, line: 372, baseType: !20, size: 8, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !381, file: !3, line: 373, baseType: !89, offset: 104)
!390 = !DILocalVariable(name: "i", scope: !391, file: !3, line: 4965, type: !29)
!391 = distinct !DILexicalBlock(scope: !373, file: !3, line: 4965, column: 7)
!392 = !DILocalVariable(name: "np", scope: !393, file: !3, line: 4974, type: !31)
!393 = distinct !DILexicalBlock(scope: !394, file: !3, line: 4973, column: 9)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 4972, column: 11)
!395 = distinct !DILexicalBlock(scope: !374, file: !3, line: 4971, column: 5)
!396 = !DILocalVariable(name: "nthreads_max", scope: !395, file: !3, line: 4979, type: !29)
!397 = !{!398}
!398 = !DIEnumerator(name: "nsigs", value: 22)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blanktype", file: !3, line: 161, baseType: !6, size: 32, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIEnumerator(name: "bl_start", value: 0)
!402 = !DIEnumerator(name: "bl_end", value: 1)
!403 = !DIEnumerator(name: "bl_both", value: 2)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 337, baseType: !6, size: 32, elements: !405)
!405 = !{!406}
!406 = !DIEnumerator(name: "TAB_DEFAULT", value: 256)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !408, line: 42, baseType: !6, size: 32, elements: !409)
!408 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!410 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!411 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!412 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!413 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!414 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!415 = !DIEnumerator(name: "c_quoting_style", value: 5)
!416 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!417 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!418 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!419 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!420 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nproc_query", file: !422, line: 32, baseType: !6, size: 32, elements: !423)
!422 = !DIFile(filename: "./lib/nproc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dd1b9803a99598e46cd95fdfb7d0bf6e")
!423 = !{!424, !425, !426}
!424 = !DIEnumerator(name: "NPROC_ALL", value: 0)
!425 = !DIEnumerator(name: "NPROC_CURRENT", value: 1)
!426 = !DIEnumerator(name: "NPROC_CURRENT_OVERRIDABLE", value: 2)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 107, baseType: !6, size: 32, elements: !428)
!428 = !{!429}
!429 = !DIEnumerator(name: "DEFAULT_MAX_THREADS", value: 8)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 46, baseType: !6, size: 32, elements: !432)
!431 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!433 = !DIEnumerator(name: "_ISupper", value: 256)
!434 = !DIEnumerator(name: "_ISlower", value: 512)
!435 = !DIEnumerator(name: "_ISalpha", value: 1024)
!436 = !DIEnumerator(name: "_ISdigit", value: 2048)
!437 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!438 = !DIEnumerator(name: "_ISspace", value: 8192)
!439 = !DIEnumerator(name: "_ISprint", value: 16384)
!440 = !DIEnumerator(name: "_ISgraph", value: 32768)
!441 = !DIEnumerator(name: "_ISblank", value: 1)
!442 = !DIEnumerator(name: "_IScntrl", value: 2)
!443 = !DIEnumerator(name: "_ISpunct", value: 4)
!444 = !DIEnumerator(name: "_ISalnum", value: 8)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !446, line: 41, baseType: !6, size: 32, elements: !447)
!446 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!448 = !DIEnumerator(name: "ABDAY_1", value: 131072)
!449 = !DIEnumerator(name: "ABDAY_2", value: 131073)
!450 = !DIEnumerator(name: "ABDAY_3", value: 131074)
!451 = !DIEnumerator(name: "ABDAY_4", value: 131075)
!452 = !DIEnumerator(name: "ABDAY_5", value: 131076)
!453 = !DIEnumerator(name: "ABDAY_6", value: 131077)
!454 = !DIEnumerator(name: "ABDAY_7", value: 131078)
!455 = !DIEnumerator(name: "DAY_1", value: 131079)
!456 = !DIEnumerator(name: "DAY_2", value: 131080)
!457 = !DIEnumerator(name: "DAY_3", value: 131081)
!458 = !DIEnumerator(name: "DAY_4", value: 131082)
!459 = !DIEnumerator(name: "DAY_5", value: 131083)
!460 = !DIEnumerator(name: "DAY_6", value: 131084)
!461 = !DIEnumerator(name: "DAY_7", value: 131085)
!462 = !DIEnumerator(name: "ABMON_1", value: 131086)
!463 = !DIEnumerator(name: "ABMON_2", value: 131087)
!464 = !DIEnumerator(name: "ABMON_3", value: 131088)
!465 = !DIEnumerator(name: "ABMON_4", value: 131089)
!466 = !DIEnumerator(name: "ABMON_5", value: 131090)
!467 = !DIEnumerator(name: "ABMON_6", value: 131091)
!468 = !DIEnumerator(name: "ABMON_7", value: 131092)
!469 = !DIEnumerator(name: "ABMON_8", value: 131093)
!470 = !DIEnumerator(name: "ABMON_9", value: 131094)
!471 = !DIEnumerator(name: "ABMON_10", value: 131095)
!472 = !DIEnumerator(name: "ABMON_11", value: 131096)
!473 = !DIEnumerator(name: "ABMON_12", value: 131097)
!474 = !DIEnumerator(name: "MON_1", value: 131098)
!475 = !DIEnumerator(name: "MON_2", value: 131099)
!476 = !DIEnumerator(name: "MON_3", value: 131100)
!477 = !DIEnumerator(name: "MON_4", value: 131101)
!478 = !DIEnumerator(name: "MON_5", value: 131102)
!479 = !DIEnumerator(name: "MON_6", value: 131103)
!480 = !DIEnumerator(name: "MON_7", value: 131104)
!481 = !DIEnumerator(name: "MON_8", value: 131105)
!482 = !DIEnumerator(name: "MON_9", value: 131106)
!483 = !DIEnumerator(name: "MON_10", value: 131107)
!484 = !DIEnumerator(name: "MON_11", value: 131108)
!485 = !DIEnumerator(name: "MON_12", value: 131109)
!486 = !DIEnumerator(name: "AM_STR", value: 131110)
!487 = !DIEnumerator(name: "PM_STR", value: 131111)
!488 = !DIEnumerator(name: "D_T_FMT", value: 131112)
!489 = !DIEnumerator(name: "D_FMT", value: 131113)
!490 = !DIEnumerator(name: "T_FMT", value: 131114)
!491 = !DIEnumerator(name: "T_FMT_AMPM", value: 131115)
!492 = !DIEnumerator(name: "ERA", value: 131116)
!493 = !DIEnumerator(name: "__ERA_YEAR", value: 131117)
!494 = !DIEnumerator(name: "ERA_D_FMT", value: 131118)
!495 = !DIEnumerator(name: "ALT_DIGITS", value: 131119)
!496 = !DIEnumerator(name: "ERA_D_T_FMT", value: 131120)
!497 = !DIEnumerator(name: "ERA_T_FMT", value: 131121)
!498 = !DIEnumerator(name: "_NL_TIME_ERA_NUM_ENTRIES", value: 131122)
!499 = !DIEnumerator(name: "_NL_TIME_ERA_ENTRIES", value: 131123)
!500 = !DIEnumerator(name: "_NL_WABDAY_1", value: 131124)
!501 = !DIEnumerator(name: "_NL_WABDAY_2", value: 131125)
!502 = !DIEnumerator(name: "_NL_WABDAY_3", value: 131126)
!503 = !DIEnumerator(name: "_NL_WABDAY_4", value: 131127)
!504 = !DIEnumerator(name: "_NL_WABDAY_5", value: 131128)
!505 = !DIEnumerator(name: "_NL_WABDAY_6", value: 131129)
!506 = !DIEnumerator(name: "_NL_WABDAY_7", value: 131130)
!507 = !DIEnumerator(name: "_NL_WDAY_1", value: 131131)
!508 = !DIEnumerator(name: "_NL_WDAY_2", value: 131132)
!509 = !DIEnumerator(name: "_NL_WDAY_3", value: 131133)
!510 = !DIEnumerator(name: "_NL_WDAY_4", value: 131134)
!511 = !DIEnumerator(name: "_NL_WDAY_5", value: 131135)
!512 = !DIEnumerator(name: "_NL_WDAY_6", value: 131136)
!513 = !DIEnumerator(name: "_NL_WDAY_7", value: 131137)
!514 = !DIEnumerator(name: "_NL_WABMON_1", value: 131138)
!515 = !DIEnumerator(name: "_NL_WABMON_2", value: 131139)
!516 = !DIEnumerator(name: "_NL_WABMON_3", value: 131140)
!517 = !DIEnumerator(name: "_NL_WABMON_4", value: 131141)
!518 = !DIEnumerator(name: "_NL_WABMON_5", value: 131142)
!519 = !DIEnumerator(name: "_NL_WABMON_6", value: 131143)
!520 = !DIEnumerator(name: "_NL_WABMON_7", value: 131144)
!521 = !DIEnumerator(name: "_NL_WABMON_8", value: 131145)
!522 = !DIEnumerator(name: "_NL_WABMON_9", value: 131146)
!523 = !DIEnumerator(name: "_NL_WABMON_10", value: 131147)
!524 = !DIEnumerator(name: "_NL_WABMON_11", value: 131148)
!525 = !DIEnumerator(name: "_NL_WABMON_12", value: 131149)
!526 = !DIEnumerator(name: "_NL_WMON_1", value: 131150)
!527 = !DIEnumerator(name: "_NL_WMON_2", value: 131151)
!528 = !DIEnumerator(name: "_NL_WMON_3", value: 131152)
!529 = !DIEnumerator(name: "_NL_WMON_4", value: 131153)
!530 = !DIEnumerator(name: "_NL_WMON_5", value: 131154)
!531 = !DIEnumerator(name: "_NL_WMON_6", value: 131155)
!532 = !DIEnumerator(name: "_NL_WMON_7", value: 131156)
!533 = !DIEnumerator(name: "_NL_WMON_8", value: 131157)
!534 = !DIEnumerator(name: "_NL_WMON_9", value: 131158)
!535 = !DIEnumerator(name: "_NL_WMON_10", value: 131159)
!536 = !DIEnumerator(name: "_NL_WMON_11", value: 131160)
!537 = !DIEnumerator(name: "_NL_WMON_12", value: 131161)
!538 = !DIEnumerator(name: "_NL_WAM_STR", value: 131162)
!539 = !DIEnumerator(name: "_NL_WPM_STR", value: 131163)
!540 = !DIEnumerator(name: "_NL_WD_T_FMT", value: 131164)
!541 = !DIEnumerator(name: "_NL_WD_FMT", value: 131165)
!542 = !DIEnumerator(name: "_NL_WT_FMT", value: 131166)
!543 = !DIEnumerator(name: "_NL_WT_FMT_AMPM", value: 131167)
!544 = !DIEnumerator(name: "_NL_WERA_YEAR", value: 131168)
!545 = !DIEnumerator(name: "_NL_WERA_D_FMT", value: 131169)
!546 = !DIEnumerator(name: "_NL_WALT_DIGITS", value: 131170)
!547 = !DIEnumerator(name: "_NL_WERA_D_T_FMT", value: 131171)
!548 = !DIEnumerator(name: "_NL_WERA_T_FMT", value: 131172)
!549 = !DIEnumerator(name: "_NL_TIME_WEEK_NDAYS", value: 131173)
!550 = !DIEnumerator(name: "_NL_TIME_WEEK_1STDAY", value: 131174)
!551 = !DIEnumerator(name: "_NL_TIME_WEEK_1STWEEK", value: 131175)
!552 = !DIEnumerator(name: "_NL_TIME_FIRST_WEEKDAY", value: 131176)
!553 = !DIEnumerator(name: "_NL_TIME_FIRST_WORKDAY", value: 131177)
!554 = !DIEnumerator(name: "_NL_TIME_CAL_DIRECTION", value: 131178)
!555 = !DIEnumerator(name: "_NL_TIME_TIMEZONE", value: 131179)
!556 = !DIEnumerator(name: "_DATE_FMT", value: 131180)
!557 = !DIEnumerator(name: "_NL_W_DATE_FMT", value: 131181)
!558 = !DIEnumerator(name: "_NL_TIME_CODESET", value: 131182)
!559 = !DIEnumerator(name: "__ALTMON_1", value: 131183)
!560 = !DIEnumerator(name: "__ALTMON_2", value: 131184)
!561 = !DIEnumerator(name: "__ALTMON_3", value: 131185)
!562 = !DIEnumerator(name: "__ALTMON_4", value: 131186)
!563 = !DIEnumerator(name: "__ALTMON_5", value: 131187)
!564 = !DIEnumerator(name: "__ALTMON_6", value: 131188)
!565 = !DIEnumerator(name: "__ALTMON_7", value: 131189)
!566 = !DIEnumerator(name: "__ALTMON_8", value: 131190)
!567 = !DIEnumerator(name: "__ALTMON_9", value: 131191)
!568 = !DIEnumerator(name: "__ALTMON_10", value: 131192)
!569 = !DIEnumerator(name: "__ALTMON_11", value: 131193)
!570 = !DIEnumerator(name: "__ALTMON_12", value: 131194)
!571 = !DIEnumerator(name: "_NL_WALTMON_1", value: 131195)
!572 = !DIEnumerator(name: "_NL_WALTMON_2", value: 131196)
!573 = !DIEnumerator(name: "_NL_WALTMON_3", value: 131197)
!574 = !DIEnumerator(name: "_NL_WALTMON_4", value: 131198)
!575 = !DIEnumerator(name: "_NL_WALTMON_5", value: 131199)
!576 = !DIEnumerator(name: "_NL_WALTMON_6", value: 131200)
!577 = !DIEnumerator(name: "_NL_WALTMON_7", value: 131201)
!578 = !DIEnumerator(name: "_NL_WALTMON_8", value: 131202)
!579 = !DIEnumerator(name: "_NL_WALTMON_9", value: 131203)
!580 = !DIEnumerator(name: "_NL_WALTMON_10", value: 131204)
!581 = !DIEnumerator(name: "_NL_WALTMON_11", value: 131205)
!582 = !DIEnumerator(name: "_NL_WALTMON_12", value: 131206)
!583 = !DIEnumerator(name: "_NL_ABALTMON_1", value: 131207)
!584 = !DIEnumerator(name: "_NL_ABALTMON_2", value: 131208)
!585 = !DIEnumerator(name: "_NL_ABALTMON_3", value: 131209)
!586 = !DIEnumerator(name: "_NL_ABALTMON_4", value: 131210)
!587 = !DIEnumerator(name: "_NL_ABALTMON_5", value: 131211)
!588 = !DIEnumerator(name: "_NL_ABALTMON_6", value: 131212)
!589 = !DIEnumerator(name: "_NL_ABALTMON_7", value: 131213)
!590 = !DIEnumerator(name: "_NL_ABALTMON_8", value: 131214)
!591 = !DIEnumerator(name: "_NL_ABALTMON_9", value: 131215)
!592 = !DIEnumerator(name: "_NL_ABALTMON_10", value: 131216)
!593 = !DIEnumerator(name: "_NL_ABALTMON_11", value: 131217)
!594 = !DIEnumerator(name: "_NL_ABALTMON_12", value: 131218)
!595 = !DIEnumerator(name: "_NL_WABALTMON_1", value: 131219)
!596 = !DIEnumerator(name: "_NL_WABALTMON_2", value: 131220)
!597 = !DIEnumerator(name: "_NL_WABALTMON_3", value: 131221)
!598 = !DIEnumerator(name: "_NL_WABALTMON_4", value: 131222)
!599 = !DIEnumerator(name: "_NL_WABALTMON_5", value: 131223)
!600 = !DIEnumerator(name: "_NL_WABALTMON_6", value: 131224)
!601 = !DIEnumerator(name: "_NL_WABALTMON_7", value: 131225)
!602 = !DIEnumerator(name: "_NL_WABALTMON_8", value: 131226)
!603 = !DIEnumerator(name: "_NL_WABALTMON_9", value: 131227)
!604 = !DIEnumerator(name: "_NL_WABALTMON_10", value: 131228)
!605 = !DIEnumerator(name: "_NL_WABALTMON_11", value: 131229)
!606 = !DIEnumerator(name: "_NL_WABALTMON_12", value: 131230)
!607 = !DIEnumerator(name: "_NL_NUM_LC_TIME", value: 131231)
!608 = !DIEnumerator(name: "_NL_COLLATE_NRULES", value: 196608)
!609 = !DIEnumerator(name: "_NL_COLLATE_RULESETS", value: 196609)
!610 = !DIEnumerator(name: "_NL_COLLATE_TABLEMB", value: 196610)
!611 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTMB", value: 196611)
!612 = !DIEnumerator(name: "_NL_COLLATE_EXTRAMB", value: 196612)
!613 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTMB", value: 196613)
!614 = !DIEnumerator(name: "_NL_COLLATE_GAP1", value: 196614)
!615 = !DIEnumerator(name: "_NL_COLLATE_GAP2", value: 196615)
!616 = !DIEnumerator(name: "_NL_COLLATE_GAP3", value: 196616)
!617 = !DIEnumerator(name: "_NL_COLLATE_TABLEWC", value: 196617)
!618 = !DIEnumerator(name: "_NL_COLLATE_WEIGHTWC", value: 196618)
!619 = !DIEnumerator(name: "_NL_COLLATE_EXTRAWC", value: 196619)
!620 = !DIEnumerator(name: "_NL_COLLATE_INDIRECTWC", value: 196620)
!621 = !DIEnumerator(name: "_NL_COLLATE_SYMB_HASH_SIZEMB", value: 196621)
!622 = !DIEnumerator(name: "_NL_COLLATE_SYMB_TABLEMB", value: 196622)
!623 = !DIEnumerator(name: "_NL_COLLATE_SYMB_EXTRAMB", value: 196623)
!624 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQMB", value: 196624)
!625 = !DIEnumerator(name: "_NL_COLLATE_COLLSEQWC", value: 196625)
!626 = !DIEnumerator(name: "_NL_COLLATE_CODESET", value: 196626)
!627 = !DIEnumerator(name: "_NL_NUM_LC_COLLATE", value: 196627)
!628 = !DIEnumerator(name: "_NL_CTYPE_CLASS", value: 0)
!629 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER", value: 1)
!630 = !DIEnumerator(name: "_NL_CTYPE_GAP1", value: 2)
!631 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER", value: 3)
!632 = !DIEnumerator(name: "_NL_CTYPE_GAP2", value: 4)
!633 = !DIEnumerator(name: "_NL_CTYPE_CLASS32", value: 5)
!634 = !DIEnumerator(name: "_NL_CTYPE_GAP3", value: 6)
!635 = !DIEnumerator(name: "_NL_CTYPE_GAP4", value: 7)
!636 = !DIEnumerator(name: "_NL_CTYPE_GAP5", value: 8)
!637 = !DIEnumerator(name: "_NL_CTYPE_GAP6", value: 9)
!638 = !DIEnumerator(name: "_NL_CTYPE_CLASS_NAMES", value: 10)
!639 = !DIEnumerator(name: "_NL_CTYPE_MAP_NAMES", value: 11)
!640 = !DIEnumerator(name: "_NL_CTYPE_WIDTH", value: 12)
!641 = !DIEnumerator(name: "_NL_CTYPE_MB_CUR_MAX", value: 13)
!642 = !DIEnumerator(name: "_NL_CTYPE_CODESET_NAME", value: 14)
!643 = !DIEnumerator(name: "CODESET", value: 14)
!644 = !DIEnumerator(name: "_NL_CTYPE_TOUPPER32", value: 15)
!645 = !DIEnumerator(name: "_NL_CTYPE_TOLOWER32", value: 16)
!646 = !DIEnumerator(name: "_NL_CTYPE_CLASS_OFFSET", value: 17)
!647 = !DIEnumerator(name: "_NL_CTYPE_MAP_OFFSET", value: 18)
!648 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_MB_LEN", value: 19)
!649 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_MB", value: 20)
!650 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_MB", value: 21)
!651 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_MB", value: 22)
!652 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_MB", value: 23)
!653 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_MB", value: 24)
!654 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_MB", value: 25)
!655 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_MB", value: 26)
!656 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_MB", value: 27)
!657 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_MB", value: 28)
!658 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_MB", value: 29)
!659 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS_WC_LEN", value: 30)
!660 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS0_WC", value: 31)
!661 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS1_WC", value: 32)
!662 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS2_WC", value: 33)
!663 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS3_WC", value: 34)
!664 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS4_WC", value: 35)
!665 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS5_WC", value: 36)
!666 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS6_WC", value: 37)
!667 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS7_WC", value: 38)
!668 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS8_WC", value: 39)
!669 = !DIEnumerator(name: "_NL_CTYPE_INDIGITS9_WC", value: 40)
!670 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_MB", value: 41)
!671 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_MB", value: 42)
!672 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_MB", value: 43)
!673 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_MB", value: 44)
!674 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_MB", value: 45)
!675 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_MB", value: 46)
!676 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_MB", value: 47)
!677 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_MB", value: 48)
!678 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_MB", value: 49)
!679 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_MB", value: 50)
!680 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT0_WC", value: 51)
!681 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT1_WC", value: 52)
!682 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT2_WC", value: 53)
!683 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT3_WC", value: 54)
!684 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT4_WC", value: 55)
!685 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT5_WC", value: 56)
!686 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT6_WC", value: 57)
!687 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT7_WC", value: 58)
!688 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT8_WC", value: 59)
!689 = !DIEnumerator(name: "_NL_CTYPE_OUTDIGIT9_WC", value: 60)
!690 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TAB_SIZE", value: 61)
!691 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_IDX", value: 62)
!692 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_FROM_TBL", value: 63)
!693 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_IDX", value: 64)
!694 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_TO_TBL", value: 65)
!695 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING_LEN", value: 66)
!696 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_DEFAULT_MISSING", value: 67)
!697 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE_LEN", value: 68)
!698 = !DIEnumerator(name: "_NL_CTYPE_TRANSLIT_IGNORE", value: 69)
!699 = !DIEnumerator(name: "_NL_CTYPE_MAP_TO_NONASCII", value: 70)
!700 = !DIEnumerator(name: "_NL_CTYPE_NONASCII_CASE", value: 71)
!701 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_1", value: 72)
!702 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_2", value: 73)
!703 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_3", value: 74)
!704 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_4", value: 75)
!705 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_5", value: 76)
!706 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_6", value: 77)
!707 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_7", value: 78)
!708 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_8", value: 79)
!709 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_9", value: 80)
!710 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_10", value: 81)
!711 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_11", value: 82)
!712 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_12", value: 83)
!713 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_13", value: 84)
!714 = !DIEnumerator(name: "_NL_CTYPE_EXTRA_MAP_14", value: 85)
!715 = !DIEnumerator(name: "_NL_NUM_LC_CTYPE", value: 86)
!716 = !DIEnumerator(name: "__INT_CURR_SYMBOL", value: 262144)
!717 = !DIEnumerator(name: "__CURRENCY_SYMBOL", value: 262145)
!718 = !DIEnumerator(name: "__MON_DECIMAL_POINT", value: 262146)
!719 = !DIEnumerator(name: "__MON_THOUSANDS_SEP", value: 262147)
!720 = !DIEnumerator(name: "__MON_GROUPING", value: 262148)
!721 = !DIEnumerator(name: "__POSITIVE_SIGN", value: 262149)
!722 = !DIEnumerator(name: "__NEGATIVE_SIGN", value: 262150)
!723 = !DIEnumerator(name: "__INT_FRAC_DIGITS", value: 262151)
!724 = !DIEnumerator(name: "__FRAC_DIGITS", value: 262152)
!725 = !DIEnumerator(name: "__P_CS_PRECEDES", value: 262153)
!726 = !DIEnumerator(name: "__P_SEP_BY_SPACE", value: 262154)
!727 = !DIEnumerator(name: "__N_CS_PRECEDES", value: 262155)
!728 = !DIEnumerator(name: "__N_SEP_BY_SPACE", value: 262156)
!729 = !DIEnumerator(name: "__P_SIGN_POSN", value: 262157)
!730 = !DIEnumerator(name: "__N_SIGN_POSN", value: 262158)
!731 = !DIEnumerator(name: "_NL_MONETARY_CRNCYSTR", value: 262159)
!732 = !DIEnumerator(name: "__INT_P_CS_PRECEDES", value: 262160)
!733 = !DIEnumerator(name: "__INT_P_SEP_BY_SPACE", value: 262161)
!734 = !DIEnumerator(name: "__INT_N_CS_PRECEDES", value: 262162)
!735 = !DIEnumerator(name: "__INT_N_SEP_BY_SPACE", value: 262163)
!736 = !DIEnumerator(name: "__INT_P_SIGN_POSN", value: 262164)
!737 = !DIEnumerator(name: "__INT_N_SIGN_POSN", value: 262165)
!738 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_CURR_SYMBOL", value: 262166)
!739 = !DIEnumerator(name: "_NL_MONETARY_DUO_CURRENCY_SYMBOL", value: 262167)
!740 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_FRAC_DIGITS", value: 262168)
!741 = !DIEnumerator(name: "_NL_MONETARY_DUO_FRAC_DIGITS", value: 262169)
!742 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_CS_PRECEDES", value: 262170)
!743 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SEP_BY_SPACE", value: 262171)
!744 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_CS_PRECEDES", value: 262172)
!745 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SEP_BY_SPACE", value: 262173)
!746 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_CS_PRECEDES", value: 262174)
!747 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SEP_BY_SPACE", value: 262175)
!748 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_CS_PRECEDES", value: 262176)
!749 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SEP_BY_SPACE", value: 262177)
!750 = !DIEnumerator(name: "_NL_MONETARY_DUO_P_SIGN_POSN", value: 262178)
!751 = !DIEnumerator(name: "_NL_MONETARY_DUO_N_SIGN_POSN", value: 262179)
!752 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_P_SIGN_POSN", value: 262180)
!753 = !DIEnumerator(name: "_NL_MONETARY_DUO_INT_N_SIGN_POSN", value: 262181)
!754 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_FROM", value: 262182)
!755 = !DIEnumerator(name: "_NL_MONETARY_UNO_VALID_TO", value: 262183)
!756 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_FROM", value: 262184)
!757 = !DIEnumerator(name: "_NL_MONETARY_DUO_VALID_TO", value: 262185)
!758 = !DIEnumerator(name: "_NL_MONETARY_CONVERSION_RATE", value: 262186)
!759 = !DIEnumerator(name: "_NL_MONETARY_DECIMAL_POINT_WC", value: 262187)
!760 = !DIEnumerator(name: "_NL_MONETARY_THOUSANDS_SEP_WC", value: 262188)
!761 = !DIEnumerator(name: "_NL_MONETARY_CODESET", value: 262189)
!762 = !DIEnumerator(name: "_NL_NUM_LC_MONETARY", value: 262190)
!763 = !DIEnumerator(name: "__DECIMAL_POINT", value: 65536)
!764 = !DIEnumerator(name: "RADIXCHAR", value: 65536)
!765 = !DIEnumerator(name: "__THOUSANDS_SEP", value: 65537)
!766 = !DIEnumerator(name: "THOUSEP", value: 65537)
!767 = !DIEnumerator(name: "__GROUPING", value: 65538)
!768 = !DIEnumerator(name: "_NL_NUMERIC_DECIMAL_POINT_WC", value: 65539)
!769 = !DIEnumerator(name: "_NL_NUMERIC_THOUSANDS_SEP_WC", value: 65540)
!770 = !DIEnumerator(name: "_NL_NUMERIC_CODESET", value: 65541)
!771 = !DIEnumerator(name: "_NL_NUM_LC_NUMERIC", value: 65542)
!772 = !DIEnumerator(name: "__YESEXPR", value: 327680)
!773 = !DIEnumerator(name: "__NOEXPR", value: 327681)
!774 = !DIEnumerator(name: "__YESSTR", value: 327682)
!775 = !DIEnumerator(name: "__NOSTR", value: 327683)
!776 = !DIEnumerator(name: "_NL_MESSAGES_CODESET", value: 327684)
!777 = !DIEnumerator(name: "_NL_NUM_LC_MESSAGES", value: 327685)
!778 = !DIEnumerator(name: "_NL_PAPER_HEIGHT", value: 458752)
!779 = !DIEnumerator(name: "_NL_PAPER_WIDTH", value: 458753)
!780 = !DIEnumerator(name: "_NL_PAPER_CODESET", value: 458754)
!781 = !DIEnumerator(name: "_NL_NUM_LC_PAPER", value: 458755)
!782 = !DIEnumerator(name: "_NL_NAME_NAME_FMT", value: 524288)
!783 = !DIEnumerator(name: "_NL_NAME_NAME_GEN", value: 524289)
!784 = !DIEnumerator(name: "_NL_NAME_NAME_MR", value: 524290)
!785 = !DIEnumerator(name: "_NL_NAME_NAME_MRS", value: 524291)
!786 = !DIEnumerator(name: "_NL_NAME_NAME_MISS", value: 524292)
!787 = !DIEnumerator(name: "_NL_NAME_NAME_MS", value: 524293)
!788 = !DIEnumerator(name: "_NL_NAME_CODESET", value: 524294)
!789 = !DIEnumerator(name: "_NL_NUM_LC_NAME", value: 524295)
!790 = !DIEnumerator(name: "_NL_ADDRESS_POSTAL_FMT", value: 589824)
!791 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NAME", value: 589825)
!792 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_POST", value: 589826)
!793 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB2", value: 589827)
!794 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_AB3", value: 589828)
!795 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_CAR", value: 589829)
!796 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_NUM", value: 589830)
!797 = !DIEnumerator(name: "_NL_ADDRESS_COUNTRY_ISBN", value: 589831)
!798 = !DIEnumerator(name: "_NL_ADDRESS_LANG_NAME", value: 589832)
!799 = !DIEnumerator(name: "_NL_ADDRESS_LANG_AB", value: 589833)
!800 = !DIEnumerator(name: "_NL_ADDRESS_LANG_TERM", value: 589834)
!801 = !DIEnumerator(name: "_NL_ADDRESS_LANG_LIB", value: 589835)
!802 = !DIEnumerator(name: "_NL_ADDRESS_CODESET", value: 589836)
!803 = !DIEnumerator(name: "_NL_NUM_LC_ADDRESS", value: 589837)
!804 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_INT_FMT", value: 655360)
!805 = !DIEnumerator(name: "_NL_TELEPHONE_TEL_DOM_FMT", value: 655361)
!806 = !DIEnumerator(name: "_NL_TELEPHONE_INT_SELECT", value: 655362)
!807 = !DIEnumerator(name: "_NL_TELEPHONE_INT_PREFIX", value: 655363)
!808 = !DIEnumerator(name: "_NL_TELEPHONE_CODESET", value: 655364)
!809 = !DIEnumerator(name: "_NL_NUM_LC_TELEPHONE", value: 655365)
!810 = !DIEnumerator(name: "_NL_MEASUREMENT_MEASUREMENT", value: 720896)
!811 = !DIEnumerator(name: "_NL_MEASUREMENT_CODESET", value: 720897)
!812 = !DIEnumerator(name: "_NL_NUM_LC_MEASUREMENT", value: 720898)
!813 = !DIEnumerator(name: "_NL_IDENTIFICATION_TITLE", value: 786432)
!814 = !DIEnumerator(name: "_NL_IDENTIFICATION_SOURCE", value: 786433)
!815 = !DIEnumerator(name: "_NL_IDENTIFICATION_ADDRESS", value: 786434)
!816 = !DIEnumerator(name: "_NL_IDENTIFICATION_CONTACT", value: 786435)
!817 = !DIEnumerator(name: "_NL_IDENTIFICATION_EMAIL", value: 786436)
!818 = !DIEnumerator(name: "_NL_IDENTIFICATION_TEL", value: 786437)
!819 = !DIEnumerator(name: "_NL_IDENTIFICATION_FAX", value: 786438)
!820 = !DIEnumerator(name: "_NL_IDENTIFICATION_LANGUAGE", value: 786439)
!821 = !DIEnumerator(name: "_NL_IDENTIFICATION_TERRITORY", value: 786440)
!822 = !DIEnumerator(name: "_NL_IDENTIFICATION_AUDIENCE", value: 786441)
!823 = !DIEnumerator(name: "_NL_IDENTIFICATION_APPLICATION", value: 786442)
!824 = !DIEnumerator(name: "_NL_IDENTIFICATION_ABBREVIATION", value: 786443)
!825 = !DIEnumerator(name: "_NL_IDENTIFICATION_REVISION", value: 786444)
!826 = !DIEnumerator(name: "_NL_IDENTIFICATION_DATE", value: 786445)
!827 = !DIEnumerator(name: "_NL_IDENTIFICATION_CATEGORY", value: 786446)
!828 = !DIEnumerator(name: "_NL_IDENTIFICATION_CODESET", value: 786447)
!829 = !DIEnumerator(name: "_NL_NUM_LC_IDENTIFICATION", value: 786448)
!830 = !DIEnumerator(name: "_NL_NUM", value: 786449)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !832, line: 30, baseType: !6, size: 32, elements: !833)
!832 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!833 = !{!834, !835, !836, !837, !838}
!834 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!835 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!836 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!837 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!838 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__rlimit_resource", file: !840, line: 31, baseType: !6, size: 32, elements: !841)
!840 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/resource.h", directory: "", checksumkind: CSK_MD5, checksum: "bb0bdc9e7ae341ef435e98e05276a863")
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!842 = !DIEnumerator(name: "RLIMIT_CPU", value: 0)
!843 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1)
!844 = !DIEnumerator(name: "RLIMIT_DATA", value: 2)
!845 = !DIEnumerator(name: "RLIMIT_STACK", value: 3)
!846 = !DIEnumerator(name: "RLIMIT_CORE", value: 4)
!847 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5)
!848 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7)
!849 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7)
!850 = !DIEnumerator(name: "RLIMIT_AS", value: 9)
!851 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6)
!852 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8)
!853 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10)
!854 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11)
!855 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12)
!856 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13)
!857 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14)
!858 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15)
!859 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16)
!860 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !862, line: 44, baseType: !6, size: 32, elements: !863)
!862 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!863 = !{!864, !865, !866, !867, !868, !869}
!864 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!865 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!866 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!867 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!868 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!869 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !872, file: !871, line: 209, baseType: !6, size: 32, elements: !880)
!871 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!872 = distinct !DISubprogram(name: "select_plural", scope: !871, file: !871, line: 205, type: !873, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !878)
!873 = !DISubroutineType(types: !874)
!874 = !{!31, !875}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !876, line: 102, baseType: !877)
!876 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !202, line: 73, baseType: !31)
!878 = !{!879}
!879 = !DILocalVariable(name: "n", arg: 1, scope: !872, file: !871, line: 205, type: !875)
!880 = !{!881}
!881 = !DIEnumerator(name: "PLURAL_REDUCER", value: 1000000)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 717, baseType: !6, size: 32, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIEnumerator(name: "UNCOMPRESSED", value: 0)
!885 = !DIEnumerator(name: "UNREAPED", value: 1)
!886 = !DIEnumerator(name: "REAPED", value: 2)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 121, baseType: !6, size: 32, elements: !888)
!888 = !{!889, !890}
!889 = !DIEnumerator(name: "MAX_TRIES_COMPRESS", value: 4)
!890 = !DIEnumerator(name: "MAX_TRIES_DECOMPRESS", value: 9)
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 732, baseType: !6, size: 32, elements: !892)
!892 = !{!893}
!893 = !DIEnumerator(name: "INIT_PROCTAB_SIZE", value: 47)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 135, baseType: !6, size: 32, elements: !895)
!895 = !{!896, !897}
!896 = !DIEnumerator(name: "MERGE_END", value: 0)
!897 = !DIEnumerator(name: "MERGE_ROOT", value: 1)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 102, baseType: !6, size: 32, elements: !899)
!899 = !{!900}
!900 = !DIEnumerator(name: "SUBTHREAD_LINES_HEURISTIC", value: 131072)
!901 = !{!100, !172, !902, !19, !17, !333, !29, !40, !904, !38, !31, !905}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!904 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!907 = !{!908, !913, !918, !920, !922, !0, !924, !926, !928, !933, !935, !937, !939, !941, !943, !945, !947, !949, !953, !983, !988, !990, !992, !995, !1004, !1011, !1013, !1018, !1030, !1035, !1041, !1044, !1049, !1051, !1053, !1056, !1058, !1099, !1101, !1119, !1121, !1123, !1126, !1132, !1134, !1139, !1142, !1157, !1177, !1179, !1203}
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "opts", scope: !14, file: !3, line: 4889, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 10)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "opts", scope: !14, file: !3, line: 4945, type: !915, isLocal: true, isDefinition: true)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 24, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 3)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 145, type: !20, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "thousands_sep", scope: !2, file: !3, line: 148, type: !17, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "thousands_sep_ignored", scope: !2, file: !3, line: 150, type: !38, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "hard_LC_TIME", scope: !2, file: !3, line: 155, type: !38, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "sort_size", scope: !2, file: !3, line: 307, type: !29, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "temp_dir_count", scope: !2, file: !3, line: 320, type: !930, isLocal: true, isDefinition: true)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !931, line: 130, baseType: !932)
!931 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !30, line: 35, baseType: !231)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "reverse", scope: !2, file: !3, line: 326, type: !38, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "stable", scope: !2, file: !3, line: 331, type: !38, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "unique", scope: !2, file: !3, line: 346, type: !38, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 349, type: !38, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "keylist", scope: !2, file: !3, line: 352, type: !25, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "compress_program", scope: !2, file: !3, line: 355, type: !40, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 358, type: !38, isLocal: true, isDefinition: true)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !2, file: !3, line: 365, type: !38, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "caught_signals", scope: !2, file: !3, line: 686, type: !951, isLocal: true, isDefinition: true)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !952, line: 7, baseType: !261)
!952 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !955, file: !871, line: 575, type: !17, isLocal: true, isDefinition: true)
!955 = distinct !DISubprogram(name: "oputs_", scope: !871, file: !871, line: 573, type: !956, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !958)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !40, !40}
!958 = !{!959, !960, !961, !964, !965, !966, !967, !971, !972, !973, !974, !976, !977, !978, !979, !981, !982}
!959 = !DILocalVariable(name: "program", arg: 1, scope: !955, file: !871, line: 573, type: !40)
!960 = !DILocalVariable(name: "option", arg: 2, scope: !955, file: !871, line: 573, type: !40)
!961 = !DILocalVariable(name: "term", scope: !962, file: !871, line: 585, type: !40)
!962 = distinct !DILexicalBlock(scope: !963, file: !871, line: 582, column: 5)
!963 = distinct !DILexicalBlock(scope: !955, file: !871, line: 581, column: 7)
!964 = !DILocalVariable(name: "double_space", scope: !955, file: !871, line: 594, type: !38)
!965 = !DILocalVariable(name: "first_word", scope: !955, file: !871, line: 595, type: !40)
!966 = !DILocalVariable(name: "option_text", scope: !955, file: !871, line: 596, type: !40)
!967 = !DILocalVariable(name: "s", scope: !968, file: !871, line: 608, type: !40)
!968 = distinct !DILexicalBlock(scope: !969, file: !871, line: 605, column: 5)
!969 = distinct !DILexicalBlock(scope: !970, file: !871, line: 604, column: 12)
!970 = distinct !DILexicalBlock(scope: !955, file: !871, line: 597, column: 7)
!971 = !DILocalVariable(name: "spaces", scope: !968, file: !871, line: 609, type: !29)
!972 = !DILocalVariable(name: "anchor_len", scope: !955, file: !871, line: 620, type: !29)
!973 = !DILocalVariable(name: "desc_text", scope: !955, file: !871, line: 625, type: !40)
!974 = !DILocalVariable(name: "__ptr", scope: !975, file: !871, line: 644, type: !40)
!975 = distinct !DILexicalBlock(scope: !955, file: !871, line: 644, column: 3)
!976 = !DILocalVariable(name: "__stream", scope: !975, file: !871, line: 644, type: !305)
!977 = !DILocalVariable(name: "__cnt", scope: !975, file: !871, line: 644, type: !29)
!978 = !DILocalVariable(name: "url_program", scope: !955, file: !871, line: 648, type: !40)
!979 = !DILocalVariable(name: "__ptr", scope: !980, file: !871, line: 686, type: !40)
!980 = distinct !DILexicalBlock(scope: !955, file: !871, line: 686, column: 3)
!981 = !DILocalVariable(name: "__stream", scope: !980, file: !871, line: 686, type: !305)
!982 = !DILocalVariable(name: "__cnt", scope: !980, file: !871, line: 686, type: !29)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "blanks", scope: !2, file: !3, line: 260, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 256)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "nondictionary", scope: !2, file: !3, line: 266, type: !985, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "nonprinting", scope: !2, file: !3, line: 263, type: !985, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "fold_toupper", scope: !2, file: !3, line: 269, type: !994, isLocal: true, isDefinition: true)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !986)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "monthtab", scope: !2, file: !3, line: 275, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 1536, elements: !1002)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "month", file: !3, line: 217, size: 128, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !3, line: 219, baseType: !40, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !998, file: !3, line: 220, baseType: !17, size: 32, offset: 64)
!1002 = !{!1003}
!1003 = !DISubrange(count: 12)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "term_sig", scope: !2, file: !1006, line: 6, type: !1007, isLocal: true, isDefinition: true)
!1006 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 704, elements: !1009)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!1009 = !{!1010}
!1010 = !DISubrange(count: 22)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "temphead", scope: !2, file: !3, line: 375, type: !384, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 609, type: !1015, isLocal: true, isDefinition: true)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 248, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 31)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 611, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 7936, elements: !1016)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1023, line: 50, size: 256, elements: !1024)
!1023 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!1024 = !{!1025, !1026, !1027, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !1023, line: 52, baseType: !40, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1022, file: !1023, line: 55, baseType: !17, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1022, file: !1023, line: 56, baseType: !1028, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1022, file: !1023, line: 57, baseType: !17, size: 32, offset: 192)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "sort_types", scope: !2, file: !3, line: 678, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 48, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 6)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "sort_args", scope: !2, file: !3, line: 672, type: !1037, isLocal: true, isDefinition: true)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 448, elements: !1039)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!1039 = !{!1040}
!1040 = !DISubrange(count: 7)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "check_types", scope: !2, file: !3, line: 657, type: !1043, isLocal: true, isDefinition: true)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 24, elements: !916)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "check_args", scope: !2, file: !3, line: 651, type: !1046, isLocal: true, isDefinition: true)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 256, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 4)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "tab", scope: !2, file: !3, line: 342, type: !17, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "temp_dir_alloc", scope: !2, file: !3, line: 323, type: !930, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "temp_dirs", scope: !2, file: !3, line: 317, type: !1055, isLocal: true, isDefinition: true)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "eolchar", scope: !2, file: !3, line: 164, type: !20, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "outstat_errno", scope: !1060, file: !3, line: 931, type: !17, isLocal: true, isDefinition: true)
!1060 = distinct !DISubprogram(name: "get_outstatus", scope: !3, file: !3, line: 929, type: !1061, scopeLine: 930, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1098)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1065, line: 44, size: 1024, elements: !1066)
!1065 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1066 = !{!1067, !1069, !1071, !1073, !1075, !1076, !1078, !1079, !1080, !1081, !1083, !1084, !1086, !1094, !1095, !1096}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1064, file: !1065, line: 46, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !202, line: 145, baseType: !31)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1064, file: !1065, line: 47, baseType: !1070, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !202, line: 148, baseType: !31)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1064, file: !1065, line: 48, baseType: !1072, size: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !202, line: 150, baseType: !6)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1064, file: !1065, line: 49, baseType: !1074, size: 32, offset: 160)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !202, line: 151, baseType: !6)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1064, file: !1065, line: 50, baseType: !204, size: 32, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1064, file: !1065, line: 51, baseType: !1077, size: 32, offset: 224)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !202, line: 147, baseType: !6)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1064, file: !1065, line: 52, baseType: !1068, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1064, file: !1065, line: 53, baseType: !1068, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1064, file: !1065, line: 54, baseType: !331, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1064, file: !1065, line: 55, baseType: !1082, size: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !202, line: 175, baseType: !17)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1064, file: !1065, line: 56, baseType: !17, size: 32, offset: 480)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1064, file: !1065, line: 57, baseType: !1085, size: 64, offset: 512)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !202, line: 180, baseType: !231)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1064, file: !1065, line: 65, baseType: !1087, size: 128, offset: 576)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1088, line: 11, size: 128, elements: !1089)
!1088 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1089 = !{!1090, !1092}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1087, file: !1088, line: 16, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !202, line: 160, baseType: !231)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1087, file: !1088, line: 21, baseType: !1093, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !202, line: 197, baseType: !231)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1064, file: !1065, line: 66, baseType: !1087, size: 128, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1064, file: !1065, line: 67, baseType: !1087, size: 128, offset: 832)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1064, file: !1065, line: 79, baseType: !1097, size: 64, offset: 960)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !295)
!1098 = !{}
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "outstat", scope: !1060, file: !3, line: 932, type: !1064, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "random_md5_state", scope: !2, file: !3, line: 2256, type: !1103, isLocal: true, isDefinition: true)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !1104, line: 99, size: 1248, elements: !1105)
!1104 = !DIFile(filename: "./lib/md5.h", directory: "/src", checksumkind: CSK_MD5, checksum: "44504e3b0232d469814a3eeb68d40106")
!1105 = !{!1106, !1109, !1110, !1111, !1112, !1114, !1115}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !1103, file: !1104, line: 101, baseType: !1107, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1108, line: 26, baseType: !248)
!1108 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !1103, file: !1104, line: 102, baseType: !1107, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !1103, file: !1104, line: 103, baseType: !1107, size: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !1103, file: !1104, line: 104, baseType: !1107, size: 32, offset: 96)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1103, file: !1104, line: 106, baseType: !1113, size: 64, offset: 128)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 64, elements: !295)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1103, file: !1104, line: 107, baseType: !1107, size: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1103, file: !1104, line: 108, baseType: !1116, size: 1024, offset: 224)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 1024, elements: !1117)
!1117 = !{!1118}
!1118 = !DISubrange(count: 32)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "nmerge", scope: !2, file: !3, line: 362, type: !6, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "merge_buffer_size", scope: !2, file: !3, line: 303, type: !29, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "unit_order", scope: !2, file: !3, line: 1986, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !986)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "proctab", scope: !2, file: !3, line: 730, type: !1128, isLocal: true, isDefinition: true)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1130, line: 56, baseType: !1131)
!1130 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1130, line: 54, flags: DIFlagFwdDecl)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "nprocs", scope: !2, file: !3, line: 750, type: !386, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "resolved_compress_program_cache", scope: !1136, file: !3, line: 1097, type: !40, isLocal: true, isDefinition: true)
!1136 = distinct !DISubprogram(name: "get_resolved_compress_program", scope: !3, file: !3, line: 1094, type: !1137, scopeLine: 1095, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1098)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!40}
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(name: "temptail", scope: !2, file: !3, line: 376, type: !1141, isLocal: true, isDefinition: true)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(name: "last_result", scope: !1144, file: !3, line: 1253, type: !17, isLocal: true, isDefinition: true)
!1144 = distinct !DISubprogram(name: "maybe_create_temp", scope: !3, file: !3, line: 1241, type: !1145, scopeLine: 1242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1148)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!380, !1147, !38}
