; ModuleID = 'src/split.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.__mbstate_t = type { i32, %struct.sched_param }
%struct.sched_param = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.of_info = type { i8*, i32, %struct._IO_FILE*, i32 }
%struct.posix_spawnattr_t = type { i16, i32, %struct.__sigset_t, %struct.__sigset_t, %struct.sched_param, i32, [16 x i32] }
%struct.__sigset_t = type { [16 x i64] }
%struct.posix_spawn_file_actions_t = type { i32, i32, %struct.__spawn_action*, [16 x i32] }
%struct.__spawn_action = type opaque

!73 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!76 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!77 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!78 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!79 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 79, baseType: !13, size: 32, elements: !82)
!81 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!82 = !{!83}
!83 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1124, baseType: !6, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "OFD_NEW", value: -1)
!87 = !DIEnumerator(name: "OFD_APPEND", value: -2)
!88 = !{!89, !6, !94, !95, !93, !96, !8, !97, !98, !103, !105, !107, !108, !110}
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !90, line: 63, baseType: !91)
!90 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !92, line: 152, baseType: !93)
!92 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!93 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !99, line: 72, baseType: !100)
!99 = !DIFile(filename: "/usr/include/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "331e107bf774bb600ec675d0db0b92ce")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !6}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 46, baseType: !96)
!104 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!107 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!111 = !{!0, !112, !114, !119, !121, !123, !128, !130, !132, !171, !173, !175, !177, !259, !273, !275, !277, !279, !281, !283, !302, !304, !306, !308, !310, !312, !314, !316}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "filter_command", scope: !10, file: !3, line: 56, type: !105, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "filter_pid", scope: !10, file: !3, line: 59, type: !116, isLocal: true, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !117, line: 97, baseType: !118)
!117 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !92, line: 154, baseType: !6)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "default_SIGPIPE", scope: !10, file: !3, line: 67, type: !95, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "outfile", scope: !10, file: !3, line: 73, type: !8, isLocal: true, isDefinition: true)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "suffix_length", scope: !10, file: !3, line: 83, type: !125, isLocal: true, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !126, line: 130, baseType: !127)
!126 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !104, line: 35, baseType: !93)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "numeric_suffix_start", scope: !10, file: !3, line: 89, type: !105, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "additional_suffix", scope: !10, file: !3, line: 92, type: !105, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "in_stat_buf", scope: !10, file: !3, line: 98, type: !134, isLocal: true, isDefinition: true)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !135, line: 44, size: 1024, elements: !136)
!135 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!136 = !{!137, !139, !141, !143, !145, !147, !149, !150, !151, !152, !154, !155, !157, !165, !166, !167}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !134, file: !135, line: 46, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !92, line: 145, baseType: !96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !134, file: !135, line: 47, baseType: !140, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !92, line: 148, baseType: !96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !134, file: !135, line: 48, baseType: !142, size: 32, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !92, line: 150, baseType: !13)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !134, file: !135, line: 49, baseType: !144, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !92, line: 151, baseType: !13)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !134, file: !135, line: 50, baseType: !146, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !92, line: 146, baseType: !13)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !134, file: !135, line: 51, baseType: !148, size: 32, offset: 224)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !92, line: 147, baseType: !13)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !134, file: !135, line: 52, baseType: !138, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !134, file: !135, line: 53, baseType: !138, size: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !134, file: !135, line: 54, baseType: !91, size: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !134, file: !135, line: 55, baseType: !153, size: 32, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !92, line: 175, baseType: !6)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !134, file: !135, line: 56, baseType: !6, size: 32, offset: 480)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !134, file: !135, line: 57, baseType: !156, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !92, line: 180, baseType: !93)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !134, file: !135, line: 65, baseType: !158, size: 128, offset: 576)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !159, line: 11, size: 128, elements: !160)
!159 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!160 = !{!161, !163}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !158, file: !159, line: 16, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !92, line: 160, baseType: !93)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !158, file: !159, line: 21, baseType: !164, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !92, line: 197, baseType: !93)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !134, file: !135, line: 66, baseType: !158, size: 128, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !134, file: !135, line: 67, baseType: !158, size: 128, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !134, file: !135, line: 79, baseType: !168, size: 64, offset: 960)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 2)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "verbose", scope: !10, file: !3, line: 105, type: !95, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "elide_empty_files", scope: !10, file: !3, line: 108, type: !95, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "unbuffered", scope: !10, file: !3, line: 112, type: !95, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !179, file: !180, line: 575, type: !6, isLocal: true, isDefinition: true)
!179 = distinct !DISubprogram(name: "oputs_", scope: !180, file: !180, line: 573, type: !181, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !183)
!180 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!181 = !DISubroutineType(types: !182)
!182 = !{null, !105, !105}
!183 = !{!184, !185, !186, !189, !190, !191, !192, !196, !197, !198, !199, !201, !253, !254, !255, !257, !258}
!184 = !DILocalVariable(name: "program", arg: 1, scope: !179, file: !180, line: 573, type: !105)
!185 = !DILocalVariable(name: "option", arg: 2, scope: !179, file: !180, line: 573, type: !105)
!186 = !DILocalVariable(name: "term", scope: !187, file: !180, line: 585, type: !105)
!187 = distinct !DILexicalBlock(scope: !188, file: !180, line: 582, column: 5)
!188 = distinct !DILexicalBlock(scope: !179, file: !180, line: 581, column: 7)
!189 = !DILocalVariable(name: "double_space", scope: !179, file: !180, line: 594, type: !95)
!190 = !DILocalVariable(name: "first_word", scope: !179, file: !180, line: 595, type: !105)
!191 = !DILocalVariable(name: "option_text", scope: !179, file: !180, line: 596, type: !105)
!192 = !DILocalVariable(name: "s", scope: !193, file: !180, line: 608, type: !105)
!193 = distinct !DILexicalBlock(scope: !194, file: !180, line: 605, column: 5)
!194 = distinct !DILexicalBlock(scope: !195, file: !180, line: 604, column: 12)
!195 = distinct !DILexicalBlock(scope: !179, file: !180, line: 597, column: 7)
!196 = !DILocalVariable(name: "spaces", scope: !193, file: !180, line: 609, type: !103)
!197 = !DILocalVariable(name: "anchor_len", scope: !179, file: !180, line: 620, type: !103)
!198 = !DILocalVariable(name: "desc_text", scope: !179, file: !180, line: 625, type: !105)
!199 = !DILocalVariable(name: "__ptr", scope: !200, file: !180, line: 644, type: !105)
!200 = distinct !DILexicalBlock(scope: !179, file: !180, line: 644, column: 3)
!201 = !DILocalVariable(name: "__stream", scope: !200, file: !180, line: 644, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !204, line: 7, baseType: !205)
!204 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !206, line: 49, size: 1728, elements: !207)
!206 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !223, !225, !226, !227, !228, !229, !230, !234, !237, !239, !242, !245, !246, !247, !248, !249}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !205, file: !206, line: 51, baseType: !6, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !205, file: !206, line: 54, baseType: !8, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !205, file: !206, line: 55, baseType: !8, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !205, file: !206, line: 56, baseType: !8, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !205, file: !206, line: 57, baseType: !8, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !205, file: !206, line: 58, baseType: !8, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !205, file: !206, line: 59, baseType: !8, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !205, file: !206, line: 60, baseType: !8, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !205, file: !206, line: 61, baseType: !8, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !205, file: !206, line: 64, baseType: !8, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !205, file: !206, line: 65, baseType: !8, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !205, file: !206, line: 66, baseType: !8, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !205, file: !206, line: 68, baseType: !221, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !206, line: 36, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !205, file: !206, line: 70, baseType: !224, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !205, file: !206, line: 72, baseType: !6, size: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !205, file: !206, line: 73, baseType: !6, size: 32, offset: 928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !205, file: !206, line: 74, baseType: !91, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !205, file: !206, line: 77, baseType: !94, size: 16, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !205, file: !206, line: 78, baseType: !110, size: 8, offset: 1040)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !205, file: !206, line: 79, baseType: !231, size: 8, offset: 1048)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 1)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !205, file: !206, line: 81, baseType: !235, size: 64, offset: 1088)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !206, line: 43, baseType: null)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !205, file: !206, line: 89, baseType: !238, size: 64, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !92, line: 153, baseType: !93)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !205, file: !206, line: 91, baseType: !240, size: 64, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !206, line: 37, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !205, file: !206, line: 92, baseType: !243, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !206, line: 38, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !205, file: !206, line: 93, baseType: !224, size: 64, offset: 1344)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !205, file: !206, line: 94, baseType: !97, size: 64, offset: 1408)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !205, file: !206, line: 95, baseType: !103, size: 64, offset: 1472)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !205, file: !206, line: 96, baseType: !6, size: 32, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !205, file: !206, line: 98, baseType: !250, size: 160, offset: 1568)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 20)
!253 = !DILocalVariable(name: "__cnt", scope: !200, file: !180, line: 644, type: !103)
!254 = !DILocalVariable(name: "url_program", scope: !179, file: !180, line: 648, type: !105)
!255 = !DILocalVariable(name: "__ptr", scope: !256, file: !180, line: 686, type: !105)
!256 = distinct !DILexicalBlock(scope: !179, file: !180, line: 686, column: 3)
!257 = !DILocalVariable(name: "__stream", scope: !256, file: !180, line: 686, type: !202)
!258 = !DILocalVariable(name: "__cnt", scope: !256, file: !180, line: 686, type: !103)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "longopts", scope: !10, file: !3, line: 134, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 4352, elements: !271)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !264, line: 50, size: 256, elements: !265)
!264 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!265 = !{!266, !267, !268, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !264, line: 52, baseType: !105, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !263, file: !264, line: 55, baseType: !6, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !263, file: !264, line: 56, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !263, file: !264, line: 57, baseType: !6, size: 32, offset: 192)
!271 = !{!272}
!272 = !DISubrange(count: 17)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "eolchar", scope: !10, file: !3, line: 115, type: !6, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "suffix_alphabet", scope: !10, file: !3, line: 86, type: !105, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "suffix_auto", scope: !10, file: !3, line: 80, type: !95, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "infile", scope: !10, file: !3, line: 95, type: !105, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "outbase", scope: !10, file: !3, line: 70, type: !105, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "sufindex", scope: !285, file: !3, line: 409, type: !298, isLocal: true, isDefinition: true)
!285 = distinct !DISubprogram(name: "next_file_name", scope: !3, file: !3, line: 406, type: !286, scopeLine: 407, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !288)
!286 = !DISubroutineType(types: !287)
!287 = !{null}
!288 = !{!289, !292, !293, !294, !297, !299, !301}
!289 = !DILocalVariable(name: "overflow", scope: !290, file: !3, line: 416, type: !95)
!290 = distinct !DILexicalBlock(scope: !291, file: !3, line: 415, column: 5)
!291 = distinct !DILexicalBlock(scope: !285, file: !3, line: 414, column: 7)
!292 = !DILocalVariable(name: "widen", scope: !290, file: !3, line: 416, type: !95)
!293 = !DILocalVariable(name: "outfile_size", scope: !290, file: !3, line: 441, type: !125)
!294 = !DILocalVariable(name: "i", scope: !295, file: !3, line: 470, type: !125)
!295 = distinct !DILexicalBlock(scope: !296, file: !3, line: 466, column: 9)
!296 = distinct !DILexicalBlock(scope: !290, file: !3, line: 465, column: 11)
!297 = !DILocalVariable(name: "sufindex_end", scope: !295, file: !3, line: 474, type: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!299 = !DILocalVariable(name: "i", scope: !300, file: !3, line: 497, type: !125)
!300 = distinct !DILexicalBlock(scope: !291, file: !3, line: 494, column: 5)
!301 = !DILabel(scope: !290, name: "new_name", file: !3, line: 418)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "outbase_length", scope: !285, file: !3, line: 410, type: !125, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "outfile_length", scope: !285, file: !3, line: 411, type: !125, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "addsuf_length", scope: !285, file: !3, line: 412, type: !125, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "outfile_mid", scope: !10, file: !3, line: 77, type: !8, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "n_open_pipes", scope: !10, file: !3, line: 64, type: !6, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "open_pipes", scope: !10, file: !3, line: 62, type: !269, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "open_pipes_alloc", scope: !10, file: !3, line: 63, type: !125, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "output_desc", scope: !10, file: !3, line: 101, type: !6, isLocal: true, isDefinition: true)
!318 = !{!319, !320, !321, !322, !323, !324, !328, !329, !330, !331, !332, !334, !337, !339, !340, !343}
!319 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 1407, type: !6)
!320 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 1407, type: !7)
!321 = !DILocalVariable(name: "split_type", scope: !2, file: !3, line: 1409, type: !12)
!322 = !DILocalVariable(name: "in_blk_size", scope: !2, file: !3, line: 1410, type: !125)
!323 = !DILocalVariable(name: "page_size", scope: !2, file: !3, line: 1411, type: !125)
!324 = !DILocalVariable(name: "k_units", scope: !2, file: !3, line: 1412, type: !325)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !326, line: 101, baseType: !327)
!326 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !92, line: 72, baseType: !93)
!328 = !DILocalVariable(name: "n_units", scope: !2, file: !3, line: 1413, type: !325)
!329 = !DILocalVariable(name: "c", scope: !2, file: !3, line: 1416, type: !6)
!330 = !DILocalVariable(name: "digits_optind", scope: !2, file: !3, line: 1417, type: !6)
!331 = !DILocalVariable(name: "file_size", scope: !2, file: !3, line: 1418, type: !89)
!332 = !DILocalVariable(name: "this_optind", scope: !333, file: !3, line: 1433, type: !6)
!333 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1431, column: 5)
!334 = !DILocalVariable(name: "suffix_len", scope: !335, file: !3, line: 1449, type: !6)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 1448, column: 11)
!336 = distinct !DILexicalBlock(scope: !333, file: !3, line: 1441, column: 9)
!337 = !DILocalVariable(name: "neweol", scope: !338, file: !3, line: 1512, type: !9)
!338 = distinct !DILexicalBlock(scope: !336, file: !3, line: 1511, column: 11)
!339 = !DILocalVariable(name: "buf", scope: !2, file: !3, line: 1693, type: !8)
!340 = !DILocalVariable(name: "initial_read", scope: !2, file: !3, line: 1694, type: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !90, line: 77, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !92, line: 194, baseType: !93)
!343 = !DILocalVariable(name: "files", scope: !344, file: !3, line: 1744, type: !346)
!344 = distinct !DILexicalBlock(scope: !345, file: !3, line: 1743, column: 7)
!345 = distinct !DILexicalBlock(scope: !2, file: !3, line: 1712, column: 5)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "of_t", file: !3, line: 1122, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "of_info", file: !3, line: 1116, size: 256, elements: !349)
!349 = !{!350, !351, !352, !353}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "of_name", scope: !348, file: !3, line: 1118, baseType: !8, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ofd", scope: !348, file: !3, line: 1119, baseType: !6, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ofile", scope: !348, file: !3, line: 1120, baseType: !202, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "opid", scope: !348, file: !3, line: 1121, baseType: !116, size: 32, offset: 192)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 120, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 15)
!357 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!358 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!359 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!360 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "tempfile", scope: !363, file: !364, line: 86, type: !8, isLocal: true, isDefinition: true)
!363 = distinct !DISubprogram(name: "temp_stream", scope: !364, file: !364, line: 84, type: !365, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !408)
!364 = !DIFile(filename: "src/temp-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8878e64e34a1409e8108ead719db2042")
!365 = !DISubroutineType(types: !366)
!366 = !{!95, !367, !7}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !204, line: 7, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !206, line: 49, size: 1728, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !370, file: !206, line: 51, baseType: !6, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !370, file: !206, line: 54, baseType: !8, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !370, file: !206, line: 55, baseType: !8, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !370, file: !206, line: 56, baseType: !8, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !370, file: !206, line: 57, baseType: !8, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !370, file: !206, line: 58, baseType: !8, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !370, file: !206, line: 59, baseType: !8, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !370, file: !206, line: 60, baseType: !8, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !370, file: !206, line: 61, baseType: !8, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !370, file: !206, line: 64, baseType: !8, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !370, file: !206, line: 65, baseType: !8, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !370, file: !206, line: 66, baseType: !8, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !370, file: !206, line: 68, baseType: !221, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !370, file: !206, line: 70, baseType: !386, size: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !370, file: !206, line: 72, baseType: !6, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !370, file: !206, line: 73, baseType: !6, size: 32, offset: 928)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !370, file: !206, line: 74, baseType: !91, size: 64, offset: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !370, file: !206, line: 77, baseType: !94, size: 16, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !370, file: !206, line: 78, baseType: !110, size: 8, offset: 1040)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !370, file: !206, line: 79, baseType: !231, size: 8, offset: 1048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !370, file: !206, line: 81, baseType: !235, size: 64, offset: 1088)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !370, file: !206, line: 89, baseType: !238, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !370, file: !206, line: 91, baseType: !240, size: 64, offset: 1216)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !370, file: !206, line: 92, baseType: !243, size: 64, offset: 1280)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !370, file: !206, line: 93, baseType: !386, size: 64, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !370, file: !206, line: 94, baseType: !97, size: 64, offset: 1408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !370, file: !206, line: 95, baseType: !103, size: 64, offset: 1472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !370, file: !206, line: 96, baseType: !6, size: 32, offset: 1536)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !370, file: !206, line: 98, baseType: !250, size: 160, offset: 1568)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !364, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !404, globals: !405, splitDebugInlining: false, nameTableKind: None)
!403 = !{!49}
!404 = !{!97}
!405 = !{!361, !406}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !363, file: !364, line: 87, type: !368, isLocal: true, isDefinition: true)
!408 = !{!409, !410, !411, !414, !415, !416}
!409 = !DILocalVariable(name: "fp", arg: 1, scope: !363, file: !364, line: 84, type: !367)
!410 = !DILocalVariable(name: "file_name", arg: 2, scope: !363, file: !364, line: 84, type: !7)
!411 = !DILocalVariable(name: "tempbuf", scope: !412, file: !364, line: 90, type: !8)
!412 = distinct !DILexicalBlock(scope: !413, file: !364, line: 89, column: 5)
!413 = distinct !DILexicalBlock(scope: !363, file: !364, line: 88, column: 7)
!414 = !DILocalVariable(name: "tempbuf_len", scope: !412, file: !364, line: 91, type: !103)
!415 = !DILocalVariable(name: "fd", scope: !412, file: !364, line: 125, type: !6)
!416 = !DILabel(scope: !417, name: "Reset", file: !364, line: 140)
!417 = distinct !DILexicalBlock(scope: !418, file: !364, line: 135, column: 9)
!418 = distinct !DILexicalBlock(scope: !412, file: !364, line: 134, column: 11)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "Version", scope: !421, file: !422, line: 3, type: !105, isLocal: false, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !423, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!423 = !{!419}
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "file_name", scope: !426, file: !427, line: 45, type: !105, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !428, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!428 = !{!424, !429}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !426, file: !427, line: 55, type: !95, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !433, file: !434, line: 66, type: !468, isLocal: false, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !435, globals: !436, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!435 = !{!97, !107}
!436 = !{!437, !462, !431, !464, !466}
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "old_file_name", scope: !439, file: !434, line: 304, type: !105, isLocal: true, isDefinition: true)
!439 = distinct !DISubprogram(name: "verror_at_line", scope: !434, file: !434, line: 298, type: !440, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !433, retainedNodes: !455)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !6, !6, !105, !13, !105, !442}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !90, line: 52, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !444, line: 32, baseType: !445)
!444 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !446, baseType: !447)
!446 = !DIFile(filename: "lib/error.c", directory: "/src")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !448, size: 256, elements: !449)
!448 = !DINamespace(name: "std", scope: null)
!449 = !{!450, !451, !452, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !447, file: !446, baseType: !97, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !447, file: !446, baseType: !97, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !447, file: !446, baseType: !97, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !447, file: !446, baseType: !6, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !447, file: !446, baseType: !6, size: 32, offset: 224)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DILocalVariable(name: "status", arg: 1, scope: !439, file: !434, line: 298, type: !6)
!457 = !DILocalVariable(name: "errnum", arg: 2, scope: !439, file: !434, line: 298, type: !6)
!458 = !DILocalVariable(name: "file_name", arg: 3, scope: !439, file: !434, line: 298, type: !105)
!459 = !DILocalVariable(name: "line_number", arg: 4, scope: !439, file: !434, line: 298, type: !13)
!460 = !DILocalVariable(name: "message", arg: 5, scope: !439, file: !434, line: 298, type: !105)
!461 = !DILocalVariable(name: "args", arg: 6, scope: !439, file: !434, line: 298, type: !442)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "old_line_number", scope: !439, file: !434, line: 305, type: !13, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "error_message_count", scope: !433, file: !434, line: 69, type: !13, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !433, file: !434, line: 295, type: !6, isLocal: false, isDefinition: true)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "program_name", scope: !471, file: !472, line: 31, type: !105, isLocal: false, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !473, globals: !474, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!473 = !{!8}
!474 = !{!469}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "utf07FF", scope: !477, file: !478, line: 46, type: !508, isLocal: true, isDefinition: true)
!477 = distinct !DISubprogram(name: "proper_name_lite", scope: !478, file: !478, line: 38, type: !479, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !481, retainedNodes: !483)
!478 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!479 = !DISubroutineType(types: !480)
!480 = !{!105, !105, !105}
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !478, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !482, splitDebugInlining: false, nameTableKind: None)
!482 = !{!475}
!483 = !{!484, !485, !486, !487, !492}
!484 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !477, file: !478, line: 38, type: !105)
!485 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !477, file: !478, line: 38, type: !105)
!486 = !DILocalVariable(name: "translation", scope: !477, file: !478, line: 40, type: !105)
!487 = !DILocalVariable(name: "w", scope: !477, file: !478, line: 47, type: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !489, line: 37, baseType: !490)
!489 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !92, line: 57, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !92, line: 42, baseType: !13)
!492 = !DILocalVariable(name: "mbs", scope: !477, file: !478, line: 48, type: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !494, line: 6, baseType: !495)
!494 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !496, line: 21, baseType: !497)
!496 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 13, size: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !497, file: !496, line: 15, baseType: !6, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !497, file: !496, line: 20, baseType: !501, size: 32, offset: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !496, line: 16, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !501, file: !496, line: 18, baseType: !13, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !501, file: !496, line: 19, baseType: !505, size: 32)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 4)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 16, elements: !169)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !511, file: !512, line: 76, type: !580, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !519, globals: !520, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!513 = !{!49, !514, !23}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !50, line: 254, baseType: !13, size: 32, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!517 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!518 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!519 = !{!6, !94, !103}
!520 = !{!509, !521, !527, !539, !541, !546, !569, !576, !578}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !511, file: !512, line: 92, type: !523, isLocal: false, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !525)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!525 = !{!526}
!526 = !DISubrange(count: 10)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !511, file: !512, line: 1040, type: !529, isLocal: false, isDefinition: true)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !512, line: 56, size: 448, elements: !530)
!530 = !{!531, !532, !533, !537, !538}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !529, file: !512, line: 59, baseType: !49, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !512, line: 62, baseType: !6, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !529, file: !512, line: 66, baseType: !534, size: 256, offset: 64)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !529, file: !512, line: 69, baseType: !105, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !529, file: !512, line: 72, baseType: !105, size: 64, offset: 384)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !511, file: !512, line: 107, type: !529, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "slot0", scope: !511, file: !512, line: 831, type: !543, isLocal: true, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 256)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "quote", scope: !548, file: !512, line: 228, type: !567, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "gettext_quote", scope: !512, file: !512, line: 197, type: !549, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !511, retainedNodes: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!105, !105, !49}
!551 = !{!552, !553, !554, !555, !556}
!552 = !DILocalVariable(name: "msgid", arg: 1, scope: !548, file: !512, line: 197, type: !105)
!553 = !DILocalVariable(name: "s", arg: 2, scope: !548, file: !512, line: 197, type: !49)
!554 = !DILocalVariable(name: "translation", scope: !548, file: !512, line: 199, type: !105)
!555 = !DILocalVariable(name: "w", scope: !548, file: !512, line: 229, type: !488)
!556 = !DILocalVariable(name: "mbs", scope: !548, file: !512, line: 230, type: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !494, line: 6, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !496, line: 21, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 13, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !559, file: !496, line: 15, baseType: !6, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !559, file: !496, line: 20, baseType: !563, size: 32, offset: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !496, line: 16, size: 32, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !563, file: !496, line: 18, baseType: !13, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !563, file: !496, line: 19, baseType: !505, size: 32)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !568)
!568 = !{!170, !507}
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "slotvec", scope: !511, file: !512, line: 834, type: !571, isLocal: true, isDefinition: true)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !512, line: 823, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !572, file: !512, line: 825, baseType: !103, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !572, file: !512, line: 826, baseType: !8, size: 64, offset: 64)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "nslots", scope: !511, file: !512, line: 832, type: !6, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "slotvec0", scope: !511, file: !512, line: 833, type: !572, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 704, elements: !582)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!582 = !{!583}
!583 = !DISubrange(count: 11)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "numname_table", scope: !586, file: !587, line: 43, type: !590, isLocal: true, isDefinition: true)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !588, globals: !589, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!588 = !{!13}
!589 = !{!584}
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 3360, elements: !596)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !587, line: 43, size: 96, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !591, file: !587, line: 43, baseType: !6, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !587, line: 43, baseType: !595, size: 64, offset: 32)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !535)
!596 = !{!597}
!597 = !DISubrange(count: 35)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !600, file: !601, line: 26, type: !603, isLocal: false, isDefinition: true)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !602, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!602 = !{!598}
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 376, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 47)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "exit_failure", scope: !608, file: !609, line: 24, type: !611, isLocal: false, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !610, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!610 = !{!606}
!611 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "internal_state", scope: !614, file: !615, line: 97, type: !618, isLocal: true, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !616, globals: !617, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!616 = !{!97, !103, !107}
!617 = !{!612}
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !494, line: 6, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !496, line: 21, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 13, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !620, file: !496, line: 15, baseType: !6, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !620, file: !496, line: 20, baseType: !624, size: 32, offset: 32)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !620, file: !496, line: 16, size: 32, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !624, file: !496, line: 18, baseType: !13, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !624, file: !496, line: 19, baseType: !505, size: 32)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !630, file: !631, line: 506, type: !6, isLocal: true, isDefinition: true)
!630 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !631, file: !631, line: 485, type: !632, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !634, retainedNodes: !636)
!631 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!632 = !DISubroutineType(types: !633)
!633 = !{!6, !6, !6}
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !635, splitDebugInlining: false, nameTableKind: None)
!635 = !{!628}
!636 = !{!637, !638, !639, !640, !643}
!637 = !DILocalVariable(name: "fd", arg: 1, scope: !630, file: !631, line: 485, type: !6)
!638 = !DILocalVariable(name: "target", arg: 2, scope: !630, file: !631, line: 485, type: !6)
!639 = !DILocalVariable(name: "result", scope: !630, file: !631, line: 487, type: !6)
!640 = !DILocalVariable(name: "flags", scope: !641, file: !631, line: 530, type: !6)
!641 = distinct !DILexicalBlock(scope: !642, file: !631, line: 529, column: 5)
!642 = distinct !DILexicalBlock(scope: !630, file: !631, line: 528, column: 7)
!643 = !DILocalVariable(name: "saved_errno", scope: !644, file: !631, line: 533, type: !6)
!644 = distinct !DILexicalBlock(scope: !645, file: !631, line: 532, column: 9)
!645 = distinct !DILexicalBlock(scope: !641, file: !631, line: 531, column: 11)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !648, file: !649, line: 211, type: !834, isLocal: true, isDefinition: true)
!648 = distinct !DISubprogram(name: "printf_fetchargs", scope: !649, file: !649, line: 42, type: !650, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !826, retainedNodes: !829)
!649 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!650 = !DISubroutineType(types: !651)
!651 = !{!6, !652, !662}
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !444, line: 14, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !654, baseType: !655)
!654 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !448, size: 256, elements: !656)
!656 = !{!657, !658, !659, !660, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !655, file: !654, baseType: !97, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !655, file: !654, baseType: !97, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !655, file: !654, baseType: !97, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !655, file: !654, baseType: !6, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !655, file: !654, baseType: !6, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !664, line: 185, baseType: !665)
!664 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 179, size: 1920, elements: !666)
!666 = !{!667, !668, !822}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !665, file: !664, line: 181, baseType: !103, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !665, file: !664, line: 182, baseType: !669, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !664, line: 174, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 111, size: 256, elements: !672)
!672 = !{!673, !724}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !664, line: 113, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !664, line: 108, baseType: !675)
!675 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !664, line: 47, baseType: !13, size: 32, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!677 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!678 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!679 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!680 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!681 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!682 = !DIEnumerator(name: "TYPE_INT", value: 5)
!683 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!684 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!685 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!686 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!687 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!688 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!689 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!690 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!691 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!692 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!693 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!694 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!695 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!696 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!697 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!698 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!699 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!700 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!701 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!702 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!703 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!704 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!705 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!706 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!707 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!708 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!709 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!710 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!711 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!712 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!713 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!714 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!715 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!716 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!717 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!718 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!719 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!720 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!721 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!722 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!723 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !671, file: !664, line: 172, baseType: !725, size: 128, offset: 128)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !671, file: !664, line: 114, size: 128, elements: !726)
!726 = !{!727, !728, !729, !731, !732, !733, !734, !735, !736, !738, !740, !744, !748, !751, !754, !757, !759, !762, !765, !767, !769, !771, !773, !775, !777, !779, !781, !783, !785, !787, !788, !791, !792, !796, !797, !799, !801, !802, !804, !806, !808, !810, !812, !814, !816, !818, !820}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !725, file: !664, line: 116, baseType: !110, size: 8)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !725, file: !664, line: 117, baseType: !107, size: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !725, file: !664, line: 118, baseType: !730, size: 16)
!730 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !725, file: !664, line: 119, baseType: !94, size: 16)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !725, file: !664, line: 120, baseType: !6, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !725, file: !664, line: 121, baseType: !13, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !725, file: !664, line: 122, baseType: !93, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !725, file: !664, line: 123, baseType: !96, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !725, file: !664, line: 124, baseType: !737, size: 64)
!737 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !725, file: !664, line: 125, baseType: !739, size: 64)
!739 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !725, file: !664, line: 126, baseType: !741, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !742, line: 24, baseType: !743)
!742 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !92, line: 37, baseType: !110)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !725, file: !664, line: 127, baseType: !745, size: 8)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !746, line: 24, baseType: !747)
!746 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !92, line: 38, baseType: !107)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !725, file: !664, line: 128, baseType: !749, size: 16)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !742, line: 25, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !92, line: 39, baseType: !730)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !725, file: !664, line: 129, baseType: !752, size: 16)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !746, line: 25, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !92, line: 40, baseType: !94)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !725, file: !664, line: 130, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !742, line: 26, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !92, line: 41, baseType: !6)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !725, file: !664, line: 131, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !746, line: 26, baseType: !491)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !725, file: !664, line: 132, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !742, line: 27, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !92, line: 44, baseType: !93)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !725, file: !664, line: 133, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !746, line: 27, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !92, line: 45, baseType: !96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !725, file: !664, line: 134, baseType: !766, size: 8)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !326, line: 58, baseType: !110)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !725, file: !664, line: 135, baseType: !768, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !326, line: 71, baseType: !107)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !725, file: !664, line: 136, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !326, line: 60, baseType: !93)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !725, file: !664, line: 137, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !326, line: 73, baseType: !96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !725, file: !664, line: 138, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !326, line: 61, baseType: !93)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !725, file: !664, line: 139, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !326, line: 74, baseType: !96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !725, file: !664, line: 140, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !326, line: 62, baseType: !93)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !725, file: !664, line: 141, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !326, line: 75, baseType: !96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !725, file: !664, line: 142, baseType: !782, size: 32)
!782 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !725, file: !664, line: 143, baseType: !784, size: 64)
!784 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !725, file: !664, line: 144, baseType: !786, size: 128)
!786 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !725, file: !664, line: 145, baseType: !6, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !725, file: !664, line: 147, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !790, line: 20, baseType: !13)
!790 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!791 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !725, file: !664, line: 149, baseType: !105, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !725, file: !664, line: 150, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !104, line: 74, baseType: !13)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !725, file: !664, line: 151, baseType: !97, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !725, file: !664, line: 152, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !725, file: !664, line: 153, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !725, file: !664, line: 154, baseType: !269, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !725, file: !664, line: 155, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !725, file: !664, line: 156, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !725, file: !664, line: 157, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !725, file: !664, line: 158, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !725, file: !664, line: 159, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !725, file: !664, line: 160, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !725, file: !664, line: 161, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !725, file: !664, line: 162, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !725, file: !664, line: 163, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !725, file: !664, line: 164, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !665, file: !664, line: 183, baseType: !823, size: 1792, offset: 128)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 1792, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 7)
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !404, globals: !828, splitDebugInlining: false, nameTableKind: None)
!827 = !{!675}
!828 = !{!646}
!829 = !{!830, !831, !832, !833}
!830 = !DILocalVariable(name: "args", arg: 1, scope: !648, file: !649, line: 42, type: !652)
!831 = !DILocalVariable(name: "a", arg: 2, scope: !648, file: !649, line: 42, type: !662)
!832 = !DILocalVariable(name: "i", scope: !648, file: !649, line: 44, type: !103)
!833 = !DILocalVariable(name: "ap", scope: !648, file: !649, line: 45, type: !669)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 224, elements: !824)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !473, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !839, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!839 = !{!63}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!842 = distinct !DICompileUnit(language: DW_LANG_C99, file: !843, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!854 = !{!105}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !859, retainedTypes: !860, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!859 = !{!38}
!860 = !{!103}
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/mkstemp-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c54cf13a93f038494ed7ea783050e30c")
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !865, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "lib/tmpdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6bb1205c798131b3318a3c96a85b8877")
!865 = !{!97, !6}
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/pipe-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bfe25f787a479604d93cf00731a9af1f")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !872, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!872 = !{!873}
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !871, line: 40, baseType: !13, size: 32, elements: !874)
!874 = !{!875}
!875 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !860, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !907, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!880 = !{!881, !893}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !882, file: !879, line: 188, baseType: !13, size: 32, elements: !891)
!882 = distinct !DISubprogram(name: "x2nrealloc", scope: !879, file: !879, line: 176, type: !883, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !886)
!883 = !DISubroutineType(types: !884)
!884 = !{!97, !97, !885, !103}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "p", arg: 1, scope: !882, file: !879, line: 176, type: !97)
!888 = !DILocalVariable(name: "pn", arg: 2, scope: !882, file: !879, line: 176, type: !885)
!889 = !DILocalVariable(name: "s", arg: 3, scope: !882, file: !879, line: 176, type: !103)
!890 = !DILocalVariable(name: "n", scope: !882, file: !879, line: 178, type: !103)
!891 = !{!892}
!892 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !894, file: !879, line: 228, baseType: !13, size: 32, elements: !891)
!894 = distinct !DISubprogram(name: "xpalloc", scope: !879, file: !879, line: 223, type: !895, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{!97, !97, !298, !125, !127, !125}
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906}
!898 = !DILocalVariable(name: "pa", arg: 1, scope: !894, file: !879, line: 223, type: !97)
!899 = !DILocalVariable(name: "pn", arg: 2, scope: !894, file: !879, line: 223, type: !298)
!900 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !894, file: !879, line: 223, type: !125)
!901 = !DILocalVariable(name: "n_max", arg: 4, scope: !894, file: !879, line: 223, type: !127)
!902 = !DILocalVariable(name: "s", arg: 5, scope: !894, file: !879, line: 223, type: !125)
!903 = !DILocalVariable(name: "n0", scope: !894, file: !879, line: 230, type: !125)
!904 = !DILocalVariable(name: "n", scope: !894, file: !879, line: 237, type: !125)
!905 = !DILocalVariable(name: "nbytes", scope: !894, file: !879, line: 248, type: !125)
!906 = !DILocalVariable(name: "adjusted_nbytes", scope: !894, file: !879, line: 252, type: !125)
!907 = !{!8, !97, !95, !93, !96}
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, splitDebugInlining: false, nameTableKind: None)
!911 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!912 = !{!72, !42}
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !917, retainedTypes: !918, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!917 = !{!72}
!918 = !{!95, !93, !96, !325}
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !921, retainedTypes: !922, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!921 = !{!72, !23}
!922 = !{!6, !94, !8, !95, !96, !923}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !326, line: 102, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !92, line: 73, baseType: !96)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !928, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/fd-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "63ab878cf4b441e9798f87a8e3963108")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "lib/dup-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad0f64dd333db5cafacb6809a74d5848")
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !934, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !935, splitDebugInlining: false, nameTableKind: None)
!934 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!935 = !{!95, !96, !97}
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!937 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !940, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!940 = !{!8, !103, !97, !105, !13}
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!943 = distinct !DICompileUnit(language: DW_LANG_C99, file: !944, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!944 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, splitDebugInlining: false, nameTableKind: None)
!946 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !827, retainedTypes: !949, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!949 = !{!103, !950, !97, !1005}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !664, line: 174, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 111, size: 256, elements: !953)
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !664, line: 113, baseType: !674, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !952, file: !664, line: 172, baseType: !956, size: 128, offset: 128)
!956 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !952, file: !664, line: 114, size: 128, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !956, file: !664, line: 116, baseType: !110, size: 8)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !956, file: !664, line: 117, baseType: !107, size: 8)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !956, file: !664, line: 118, baseType: !730, size: 16)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !956, file: !664, line: 119, baseType: !94, size: 16)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !956, file: !664, line: 120, baseType: !6, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !956, file: !664, line: 121, baseType: !13, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !956, file: !664, line: 122, baseType: !93, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !956, file: !664, line: 123, baseType: !96, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !956, file: !664, line: 124, baseType: !737, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !956, file: !664, line: 125, baseType: !739, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !956, file: !664, line: 126, baseType: !741, size: 8)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !956, file: !664, line: 127, baseType: !745, size: 8)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !956, file: !664, line: 128, baseType: !749, size: 16)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !956, file: !664, line: 129, baseType: !752, size: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !956, file: !664, line: 130, baseType: !755, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !956, file: !664, line: 131, baseType: !758, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !956, file: !664, line: 132, baseType: !760, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !956, file: !664, line: 133, baseType: !763, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !956, file: !664, line: 134, baseType: !766, size: 8)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !956, file: !664, line: 135, baseType: !768, size: 8)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !956, file: !664, line: 136, baseType: !770, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !956, file: !664, line: 137, baseType: !772, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !956, file: !664, line: 138, baseType: !774, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !956, file: !664, line: 139, baseType: !776, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !956, file: !664, line: 140, baseType: !778, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !956, file: !664, line: 141, baseType: !780, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !956, file: !664, line: 142, baseType: !782, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !956, file: !664, line: 143, baseType: !784, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !956, file: !664, line: 144, baseType: !786, size: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !956, file: !664, line: 145, baseType: !6, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !956, file: !664, line: 147, baseType: !789, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !956, file: !664, line: 149, baseType: !105, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !956, file: !664, line: 150, baseType: !793, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !956, file: !664, line: 151, baseType: !97, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !956, file: !664, line: 152, baseType: !798, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !956, file: !664, line: 153, baseType: !800, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !956, file: !664, line: 154, baseType: !269, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !956, file: !664, line: 155, baseType: !803, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !956, file: !664, line: 156, baseType: !805, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !956, file: !664, line: 157, baseType: !807, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !956, file: !664, line: 158, baseType: !809, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !956, file: !664, line: 159, baseType: !811, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !956, file: !664, line: 160, baseType: !813, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !956, file: !664, line: 161, baseType: !815, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !956, file: !664, line: 162, baseType: !817, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !956, file: !664, line: 163, baseType: !819, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !956, file: !664, line: 164, baseType: !821, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !1007, line: 67, baseType: !1008)
!1007 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
