; ModuleID = 'src/stat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.mount_entry = type { i8*, i8*, i8*, i8*, i64, i8, %struct.mount_entry* }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.calendar = type { i32 (%struct.calendar_date*, i32, i32, i32)*, i8*, i32 }
%struct.calendar_date = type { i32, i32, i32, %struct.infomap* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

!27 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!29 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!30 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!31 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!32 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!33 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!34 = !DIEnumerator(name: "c_quoting_style", value: 5)
!35 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!36 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!37 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!38 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!39 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !41, file: !3, line: 1140, baseType: !7, size: 32, elements: !83)
!41 = distinct !DISubprogram(name: "print_it", scope: !3, file: !3, line: 1131, type: !42, scopeLine: 1135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !58)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !45, !48, !45, !49, !56}
!44 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!44, !52, !53, !47, !47, !48, !45, !56}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!55 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !69, !74, !75, !76, !79, !80}
!59 = !DILocalVariable(name: "format", arg: 1, scope: !41, file: !3, line: 1131, type: !45)
!60 = !DILocalVariable(name: "fd", arg: 2, scope: !41, file: !3, line: 1131, type: !48)
!61 = !DILocalVariable(name: "filename", arg: 3, scope: !41, file: !3, line: 1131, type: !45)
!62 = !DILocalVariable(name: "print_func", arg: 4, scope: !41, file: !3, line: 1132, type: !49)
!63 = !DILocalVariable(name: "data", arg: 5, scope: !41, file: !3, line: 1134, type: !56)
!64 = !DILocalVariable(name: "fail", scope: !41, file: !3, line: 1136, type: !44)
!65 = !DILocalVariable(name: "n_alloc", scope: !41, file: !3, line: 1147, type: !53)
!66 = !DILocalVariable(name: "dest", scope: !41, file: !3, line: 1148, type: !52)
!67 = !DILocalVariable(name: "b", scope: !68, file: !3, line: 1149, type: !45)
!68 = distinct !DILexicalBlock(scope: !41, file: !3, line: 1149, column: 3)
!69 = !DILocalVariable(name: "len", scope: !70, file: !3, line: 1155, type: !53)
!70 = distinct !DILexicalBlock(scope: !71, file: !3, line: 1154, column: 11)
!71 = distinct !DILexicalBlock(scope: !72, file: !3, line: 1152, column: 9)
!72 = distinct !DILexicalBlock(scope: !73, file: !3, line: 1150, column: 5)
!73 = distinct !DILexicalBlock(scope: !68, file: !3, line: 1149, column: 3)
!74 = !DILocalVariable(name: "fmt_char", scope: !70, file: !3, line: 1156, type: !47)
!75 = !DILocalVariable(name: "mod_char", scope: !70, file: !3, line: 1157, type: !47)
!76 = !DILocalVariable(name: "esc_value", scope: !77, file: !3, line: 1208, type: !48)
!77 = distinct !DILexicalBlock(scope: !78, file: !3, line: 1207, column: 13)
!78 = distinct !DILexicalBlock(scope: !71, file: !3, line: 1206, column: 15)
!79 = !DILocalVariable(name: "esc_length", scope: !77, file: !3, line: 1209, type: !48)
!80 = !DILocalVariable(name: "esc_value", scope: !81, file: !3, line: 1220, type: !48)
!81 = distinct !DILexicalBlock(scope: !82, file: !3, line: 1219, column: 13)
!82 = distinct !DILexicalBlock(scope: !78, file: !3, line: 1218, column: 20)
!83 = !{!84}
!84 = !DIEnumerator(name: "MAX_ADDITIONAL_BYTES", value: 2)
!85 = !{!56, !52, !86, !48, !87, !53, !45, !88, !89, !98, !135, !138, !140}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_args", file: !3, line: 1281, size: 192, elements: !91)
!91 = !{!92, !134}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !90, file: !3, line: 1282, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !95, line: 44, size: 1024, elements: !96)
!95 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!96 = !{!97, !100, !102, !104, !106, !108, !110, !111, !112, !115, !117, !118, !120, !128, !129, !130}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !94, file: !95, line: 46, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !99, line: 145, baseType: !55)
!99 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !94, file: !95, line: 47, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !99, line: 148, baseType: !55)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !94, file: !95, line: 48, baseType: !103, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !99, line: 150, baseType: !7)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !94, file: !95, line: 49, baseType: !105, size: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !99, line: 151, baseType: !7)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !94, file: !95, line: 50, baseType: !107, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !99, line: 146, baseType: !7)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !94, file: !95, line: 51, baseType: !109, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !99, line: 147, baseType: !7)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !94, file: !95, line: 52, baseType: !98, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !94, file: !95, line: 53, baseType: !98, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !94, file: !95, line: 54, baseType: !113, size: 64, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !99, line: 152, baseType: !114)
!114 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !94, file: !95, line: 55, baseType: !116, size: 32, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !99, line: 175, baseType: !48)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !94, file: !95, line: 56, baseType: !48, size: 32, offset: 480)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !94, file: !95, line: 57, baseType: !119, size: 64, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !99, line: 180, baseType: !114)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !94, file: !95, line: 65, baseType: !121, size: 128, offset: 576)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !122, line: 11, size: 128, elements: !123)
!122 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !121, file: !122, line: 16, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !99, line: 160, baseType: !114)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !121, file: !122, line: 21, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !99, line: 197, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !94, file: !95, line: 66, baseType: !121, size: 128, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !94, file: !95, line: 67, baseType: !121, size: 128, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !94, file: !95, line: 79, baseType: !131, size: 64, offset: 960)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !90, file: !3, line: 1283, baseType: !121, size: 128, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !136, line: 102, baseType: !137)
!136 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !99, line: 73, baseType: !55)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !139, line: 63, baseType: !113)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "fsid_word", scope: !142, file: !3, line: 879, baseType: !7)
!142 = distinct !DISubprogram(name: "print_statfs", scope: !3, file: !3, line: 861, type: !50, scopeLine: 864, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !179, !180, !185, !186, !187, !189, !192}
!144 = !DILocalVariable(name: "pformat", arg: 1, scope: !142, file: !3, line: 861, type: !52)
!145 = !DILocalVariable(name: "prefix_len", arg: 2, scope: !142, file: !3, line: 861, type: !53)
!146 = !DILocalVariable(name: "mod", arg: 3, scope: !142, file: !3, line: 861, type: !47)
!147 = !DILocalVariable(name: "m", arg: 4, scope: !142, file: !3, line: 861, type: !47)
!148 = !DILocalVariable(name: "fd", arg: 5, scope: !142, file: !3, line: 862, type: !48)
!149 = !DILocalVariable(name: "filename", arg: 6, scope: !142, file: !3, line: 862, type: !45)
!150 = !DILocalVariable(name: "data", arg: 7, scope: !142, file: !3, line: 863, type: !56)
!151 = !DILocalVariable(name: "statfsbuf", scope: !142, file: !3, line: 865, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statfs", file: !155, line: 24, size: 960, elements: !156)
!155 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/statfs.h", directory: "", checksumkind: CSK_MD5, checksum: "4c379ce582232e44e7b8fa7ccdecac58")
!156 = !{!157, !159, !160, !162, !163, !164, !166, !167, !172, !173, !174, !175}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "f_type", scope: !154, file: !155, line: 26, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsword_t", file: !99, line: 192, baseType: !114)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "f_bsize", scope: !154, file: !155, line: 27, baseType: !158, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f_blocks", scope: !154, file: !155, line: 29, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsblkcnt_t", file: !99, line: 184, baseType: !55)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "f_bfree", scope: !154, file: !155, line: 30, baseType: !161, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "f_bavail", scope: !154, file: !155, line: 31, baseType: !161, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "f_files", scope: !154, file: !155, line: 32, baseType: !165, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsfilcnt_t", file: !99, line: 188, baseType: !55)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f_ffree", scope: !154, file: !155, line: 33, baseType: !165, size: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_fsid", scope: !154, file: !155, line: 41, baseType: !168, size: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fsid_t", file: !99, line: 155, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 155, size: 64, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !169, file: !99, line: 155, baseType: !131, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "f_namelen", scope: !154, file: !155, line: 42, baseType: !158, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "f_frsize", scope: !154, file: !155, line: 43, baseType: !158, size: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "f_flags", scope: !154, file: !155, line: 44, baseType: !158, size: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_spare", scope: !154, file: !155, line: 45, baseType: !176, size: 256, offset: 704)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 256, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 4)
!179 = !DILocalVariable(name: "fail", scope: !142, file: !3, line: 866, type: !44)
!180 = !DILocalVariable(name: "p", scope: !181, file: !3, line: 884, type: !183)
!181 = distinct !DILexicalBlock(scope: !182, file: !3, line: 875, column: 7)
!182 = distinct !DILexicalBlock(scope: !142, file: !3, line: 869, column: 5)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!185 = !DILocalVariable(name: "fsid", scope: !181, file: !3, line: 888, type: !135)
!186 = !DILocalVariable(name: "words", scope: !181, file: !3, line: 889, type: !48)
!187 = !DILocalVariable(name: "i", scope: !188, file: !3, line: 890, type: !48)
!188 = distinct !DILexicalBlock(scope: !181, file: !3, line: 890, column: 9)
!189 = !DILocalVariable(name: "u", scope: !190, file: !3, line: 892, type: !135)
!190 = distinct !DILexicalBlock(scope: !191, file: !3, line: 891, column: 11)
!191 = distinct !DILexicalBlock(scope: !188, file: !3, line: 890, column: 9)
!192 = !DILocalVariable(name: "frsize", scope: !193, file: !3, line: 927, type: !135)
!193 = distinct !DILexicalBlock(scope: !182, file: !3, line: 926, column: 7)
!194 = !{!195, !197, !199, !201, !203, !205, !207, !0, !290, !295, !309, !311, !317, !321, !326, !331, !343, !374, !376, !408, !414}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "follow_links", scope: !2, file: !3, line: 228, type: !44, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "interpret_backslash_escapes", scope: !2, file: !3, line: 232, type: !44, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "decimal_point", scope: !2, file: !3, line: 239, type: !45, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "decimal_point_len", scope: !2, file: !3, line: 240, type: !53, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dont_sync", scope: !2, file: !3, line: 1287, type: !44, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "force_sync", scope: !2, file: !3, line: 1290, type: !44, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !209, file: !210, line: 575, type: !48, isLocal: true, isDefinition: true)
!209 = distinct !DISubprogram(name: "oputs_", scope: !210, file: !210, line: 573, type: !211, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !213)
!210 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!211 = !DISubroutineType(types: !212)
!212 = !{null, !45, !45}
!213 = !{!214, !215, !216, !219, !220, !221, !222, !226, !227, !228, !229, !231, !284, !285, !286, !288, !289}
!214 = !DILocalVariable(name: "program", arg: 1, scope: !209, file: !210, line: 573, type: !45)
!215 = !DILocalVariable(name: "option", arg: 2, scope: !209, file: !210, line: 573, type: !45)
!216 = !DILocalVariable(name: "term", scope: !217, file: !210, line: 585, type: !45)
!217 = distinct !DILexicalBlock(scope: !218, file: !210, line: 582, column: 5)
!218 = distinct !DILexicalBlock(scope: !209, file: !210, line: 581, column: 7)
!219 = !DILocalVariable(name: "double_space", scope: !209, file: !210, line: 594, type: !44)
!220 = !DILocalVariable(name: "first_word", scope: !209, file: !210, line: 595, type: !45)
!221 = !DILocalVariable(name: "option_text", scope: !209, file: !210, line: 596, type: !45)
!222 = !DILocalVariable(name: "s", scope: !223, file: !210, line: 608, type: !45)
!223 = distinct !DILexicalBlock(scope: !224, file: !210, line: 605, column: 5)
!224 = distinct !DILexicalBlock(scope: !225, file: !210, line: 604, column: 12)
!225 = distinct !DILexicalBlock(scope: !209, file: !210, line: 597, column: 7)
!226 = !DILocalVariable(name: "spaces", scope: !223, file: !210, line: 609, type: !53)
!227 = !DILocalVariable(name: "anchor_len", scope: !209, file: !210, line: 620, type: !53)
!228 = !DILocalVariable(name: "desc_text", scope: !209, file: !210, line: 625, type: !45)
!229 = !DILocalVariable(name: "__ptr", scope: !230, file: !210, line: 644, type: !45)
!230 = distinct !DILexicalBlock(scope: !209, file: !210, line: 644, column: 3)
!231 = !DILocalVariable(name: "__stream", scope: !230, file: !210, line: 644, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !234, line: 7, baseType: !235)
!234 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !236, line: 49, size: 1728, elements: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !255, !256, !257, !258, !259, !261, !265, !268, !270, !273, !276, !277, !278, !279, !280}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !235, file: !236, line: 51, baseType: !48, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !235, file: !236, line: 54, baseType: !52, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !235, file: !236, line: 55, baseType: !52, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !235, file: !236, line: 56, baseType: !52, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !235, file: !236, line: 57, baseType: !52, size: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !235, file: !236, line: 58, baseType: !52, size: 64, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !235, file: !236, line: 59, baseType: !52, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !235, file: !236, line: 60, baseType: !52, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !235, file: !236, line: 61, baseType: !52, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !235, file: !236, line: 64, baseType: !52, size: 64, offset: 576)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !235, file: !236, line: 65, baseType: !52, size: 64, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !235, file: !236, line: 66, baseType: !52, size: 64, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !235, file: !236, line: 68, baseType: !251, size: 64, offset: 768)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !236, line: 36, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !235, file: !236, line: 70, baseType: !254, size: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !235, file: !236, line: 72, baseType: !48, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !235, file: !236, line: 73, baseType: !48, size: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !235, file: !236, line: 74, baseType: !113, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !235, file: !236, line: 77, baseType: !87, size: 16, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !235, file: !236, line: 78, baseType: !260, size: 8, offset: 1040)
!260 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !235, file: !236, line: 79, baseType: !262, size: 8, offset: 1048)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 1)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !235, file: !236, line: 81, baseType: !266, size: 64, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !236, line: 43, baseType: null)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !235, file: !236, line: 89, baseType: !269, size: 64, offset: 1152)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !99, line: 153, baseType: !114)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !235, file: !236, line: 91, baseType: !271, size: 64, offset: 1216)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !236, line: 37, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !235, file: !236, line: 92, baseType: !274, size: 64, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !236, line: 38, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !235, file: !236, line: 93, baseType: !254, size: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !235, file: !236, line: 94, baseType: !86, size: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !235, file: !236, line: 95, baseType: !53, size: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !235, file: !236, line: 96, baseType: !48, size: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !235, file: !236, line: 98, baseType: !281, size: 160, offset: 1568)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 20)
!284 = !DILocalVariable(name: "__cnt", scope: !230, file: !210, line: 644, type: !53)
!285 = !DILocalVariable(name: "url_program", scope: !209, file: !210, line: 648, type: !45)
!286 = !DILocalVariable(name: "__ptr", scope: !287, file: !210, line: 686, type: !45)
!287 = distinct !DILexicalBlock(scope: !209, file: !210, line: 686, column: 3)
!288 = !DILocalVariable(name: "__stream", scope: !287, file: !210, line: 686, type: !232)
!289 = !DILocalVariable(name: "__cnt", scope: !287, file: !210, line: 686, type: !53)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "fmt_terse_fs", scope: !2, file: !3, line: 182, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 272, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 34)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 214, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 2304, elements: !307)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !300, line: 50, size: 256, elements: !301)
!300 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!301 = !{!302, !303, !304, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !300, line: 52, baseType: !45, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !299, file: !300, line: 55, baseType: !48, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !299, file: !300, line: 56, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !299, file: !300, line: 57, baseType: !48, size: 32, offset: 192)
!307 = !{!308}
!308 = !DISubrange(count: 9)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "trailing_delim", scope: !2, file: !3, line: 236, type: !45, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "cached_modes", scope: !2, file: !3, line: 209, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 96, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "cached_args", scope: !2, file: !3, line: 204, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 256, elements: !177)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "printf_flags", scope: !2, file: !3, line: 179, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 8)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "digits", scope: !2, file: !3, line: 171, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 88, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 11)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "modebuf", scope: !333, file: !3, line: 638, type: !340, isLocal: true, isDefinition: true)
!333 = distinct !DISubprogram(name: "human_access", scope: !3, file: !3, line: 636, type: !334, scopeLine: 637, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !338)
!334 = !DISubroutineType(types: !335)
!335 = !{!52, !336}
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!338 = !{!339}
!339 = !DILocalVariable(name: "statbuf", arg: 1, scope: !333, file: !3, line: 636, type: !336)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 12)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "mount_list", scope: !345, file: !3, line: 955, type: !354, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "find_bind_mount", scope: !3, file: !3, line: 951, type: !346, scopeLine: 952, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!45, !45}
!348 = !{!349, !350, !351, !352, !369}
!349 = !DILocalVariable(name: "name", arg: 1, scope: !345, file: !3, line: 951, type: !45)
!350 = !DILocalVariable(name: "bind_mount", scope: !345, file: !3, line: 953, type: !45)
!351 = !DILocalVariable(name: "name_stats", scope: !345, file: !3, line: 964, type: !94)
!352 = !DILocalVariable(name: "me", scope: !353, file: !3, line: 968, type: !354)
!353 = distinct !DILexicalBlock(scope: !345, file: !3, line: 968, column: 3)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !356, line: 35, size: 448, elements: !357)
!356 = !DIFile(filename: "./lib/mountlist.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0b721ac4f5b5eea4f8f1c70f7145ac5d")
!357 = !{!358, !359, !360, !361, !362, !365, !366, !367, !368}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !355, file: !356, line: 37, baseType: !52, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !355, file: !356, line: 38, baseType: !52, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !355, file: !356, line: 39, baseType: !52, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !355, file: !356, line: 41, baseType: !52, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !355, file: !356, line: 42, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !364, line: 59, baseType: !98)
!364 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !355, file: !356, line: 43, baseType: !7, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !355, file: !356, line: 44, baseType: !7, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !355, file: !356, line: 45, baseType: !7, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !355, file: !356, line: 46, baseType: !354, size: 64, offset: 384)
!369 = !DILocalVariable(name: "dev_stats", scope: !370, file: !3, line: 973, type: !94)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 972, column: 9)
!371 = distinct !DILexicalBlock(scope: !372, file: !3, line: 970, column: 11)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 969, column: 5)
!373 = distinct !DILexicalBlock(scope: !353, file: !3, line: 968, column: 3)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "tried_mount_list", scope: !345, file: !3, line: 956, type: !44, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "str", scope: !378, file: !3, line: 651, type: !405, isLocal: true, isDefinition: true)
!378 = distinct !DISubprogram(name: "human_time", scope: !3, file: !3, line: 646, type: !379, scopeLine: 647, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !381)
!379 = !DISubroutineType(types: !380)
!380 = !{!52, !121}
!381 = !{!382, !383, !398, !399}
!382 = !DILocalVariable(name: "t", arg: 1, scope: !378, file: !3, line: 646, type: !121)
!383 = !DILocalVariable(name: "tm", scope: !378, file: !3, line: 658, type: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !385, line: 7, size: 448, elements: !386)
!385 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !384, file: !385, line: 9, baseType: !48, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !384, file: !385, line: 10, baseType: !48, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !384, file: !385, line: 11, baseType: !48, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !384, file: !385, line: 12, baseType: !48, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !384, file: !385, line: 13, baseType: !48, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !384, file: !385, line: 14, baseType: !48, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !384, file: !385, line: 15, baseType: !48, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !384, file: !385, line: 16, baseType: !48, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !384, file: !385, line: 17, baseType: !48, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !384, file: !385, line: 20, baseType: !114, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !384, file: !385, line: 21, baseType: !45, size: 64, offset: 384)
!398 = !DILocalVariable(name: "ns", scope: !378, file: !3, line: 659, type: !48)
!399 = !DILocalVariable(name: "secbuf", scope: !400, file: !3, line: 664, type: !402)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 663, column: 5)
!401 = distinct !DILexicalBlock(scope: !378, file: !3, line: 660, column: 7)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 168, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 21)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 488, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 61)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "tz", scope: !378, file: !3, line: 655, type: !410, isLocal: true, isDefinition: true)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !411, line: 1039, baseType: !412)
!411 = !DIFile(filename: "./lib/time.h", directory: "/src")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !411, line: 1039, flags: DIFlagFwdDecl)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "buf", scope: !416, file: !3, line: 625, type: !424, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "human_fstype", scope: !3, file: !3, line: 254, type: !417, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !419)
!417 = !DISubroutineType(types: !418)
!418 = !{!45, !152}
!419 = !{!420, !421}
!420 = !DILocalVariable(name: "statfsbuf", arg: 1, scope: !416, file: !3, line: 254, type: !152)
!421 = !DILocalVariable(name: "type", scope: !422, file: !3, line: 624, type: !55)
!422 = distinct !DILexicalBlock(scope: !423, file: !3, line: 623, column: 7)
!423 = distinct !DILexicalBlock(scope: !416, file: !3, line: 260, column: 5)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 232, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 29)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 392, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 49)
!430 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!431 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!432 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!433 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!434 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "Version", scope: !437, file: !438, line: 3, type: !45, isLocal: false, isDefinition: true)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !438, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !439, splitDebugInlining: false, nameTableKind: None)
!438 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!439 = !{!435}
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !442, file: !443, line: 65, type: !447, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !444, retainedTypes: !445, globals: !446, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!444 = !{!26}
!445 = !{!86, !45, !88}
!446 = !{!440}
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !448, line: 69, baseType: !449)
!448 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{null}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "file_name", scope: !454, file: !455, line: 45, type: !45, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!456 = !{!452, !457}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !454, file: !455, line: 55, type: !44, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !461, file: !462, line: 66, type: !449, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !463, globals: !464, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!463 = !{!86, !88}
!464 = !{!465, !490, !459, !492, !494}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "old_file_name", scope: !467, file: !462, line: 304, type: !45, isLocal: true, isDefinition: true)
!467 = distinct !DISubprogram(name: "verror_at_line", scope: !462, file: !462, line: 298, type: !468, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !461, retainedNodes: !483)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !48, !48, !45, !7, !45, !470}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !139, line: 52, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !472, line: 32, baseType: !473)
!472 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !474, baseType: !475)
!474 = !DIFile(filename: "lib/error.c", directory: "/src")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !476, size: 256, elements: !477)
!476 = !DINamespace(name: "std", scope: null)
!477 = !{!478, !479, !480, !481, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !475, file: !474, baseType: !86, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !475, file: !474, baseType: !86, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !475, file: !474, baseType: !86, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !475, file: !474, baseType: !48, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !475, file: !474, baseType: !48, size: 32, offset: 224)
!483 = !{!484, !485, !486, !487, !488, !489}
!484 = !DILocalVariable(name: "status", arg: 1, scope: !467, file: !462, line: 298, type: !48)
!485 = !DILocalVariable(name: "errnum", arg: 2, scope: !467, file: !462, line: 298, type: !48)
!486 = !DILocalVariable(name: "file_name", arg: 3, scope: !467, file: !462, line: 298, type: !45)
!487 = !DILocalVariable(name: "line_number", arg: 4, scope: !467, file: !462, line: 298, type: !7)
!488 = !DILocalVariable(name: "message", arg: 5, scope: !467, file: !462, line: 298, type: !45)
!489 = !DILocalVariable(name: "args", arg: 6, scope: !467, file: !462, line: 298, type: !470)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "old_line_number", scope: !467, file: !462, line: 305, type: !7, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "error_message_count", scope: !461, file: !462, line: 69, type: !7, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !461, file: !462, line: 295, type: !48, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !498, file: !524, line: 75, type: !537, isLocal: true, isDefinition: true)
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !500, retainedTypes: !509, globals: !521, splitDebugInlining: false, nameTableKind: None)
!499 = !DIFile(filename: "lib/nstrftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1a46cf0b441bf81ebaa8e46decf753ed")
!500 = !{!501}
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !502, line: 163, baseType: !7, size: 32, elements: !503)
!502 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!503 = !{!504, !505, !506, !507, !508}
!504 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!505 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!506 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!507 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!508 = !DIEnumerator(name: "NO_PAD", value: 4)
!509 = !{!86, !7, !44, !114, !55, !56, !53, !48, !88, !510}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !411, line: 1039, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !513, line: 24, size: 128, elements: !514)
!513 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !513, line: 28, baseType: !511, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !512, file: !513, line: 33, baseType: !47, size: 8, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !512, file: !513, line: 45, baseType: !518, offset: 72)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: -1)
!521 = !{!496, !522, !534, !554, !557, !560}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !498, file: !524, line: 21, type: !525, isLocal: true, isDefinition: true)
!524 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 1920, elements: !532)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !528, line: 19, size: 128, elements: !529)
!528 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !527, file: !528, line: 21, baseType: !45, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !527, file: !528, line: 22, baseType: !45, size: 64, offset: 64)
!532 = !{!533}
!533 = !DISubrange(count: 15)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !498, file: !536, line: 131, type: !537, isLocal: true, isDefinition: true)
!536 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !528, line: 33, size: 192, elements: !539)
!539 = !{!540, !552, !553}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !538, file: !528, line: 39, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!48, !544, !48, !48, !48}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !528, line: 25, size: 192, elements: !546)
!546 = !{!547, !548, !549, !550}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !545, file: !528, line: 27, baseType: !48, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !545, file: !528, line: 28, baseType: !48, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !545, file: !528, line: 29, baseType: !48, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !545, file: !528, line: 30, baseType: !551, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !538, file: !528, line: 42, baseType: !45, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !538, file: !528, line: 44, baseType: !7, size: 32, offset: 128)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !498, file: !536, line: 37, type: !556, isLocal: true, isDefinition: true)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 1536, elements: !341)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !498, file: !559, line: 76, type: !537, isLocal: true, isDefinition: true)
!559 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !498, file: !559, line: 21, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 1664, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 13)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "program_name", scope: !567, file: !568, line: 31, type: !45, isLocal: false, isDefinition: true)
!567 = distinct !DICompileUnit(language: DW_LANG_C99, file: !568, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !569, globals: !570, splitDebugInlining: false, nameTableKind: None)
!568 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!569 = !{!52}
!570 = !{!565}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "utf07FF", scope: !573, file: !574, line: 46, type: !602, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "proper_name_lite", scope: !574, file: !574, line: 38, type: !575, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !579)
!574 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!575 = !DISubroutineType(types: !576)
!576 = !{!45, !45, !45}
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !578, splitDebugInlining: false, nameTableKind: None)
!578 = !{!571}
!579 = !{!580, !581, !582, !583, !588}
!580 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !573, file: !574, line: 38, type: !45)
!581 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !573, file: !574, line: 38, type: !45)
!582 = !DILocalVariable(name: "translation", scope: !573, file: !574, line: 40, type: !45)
!583 = !DILocalVariable(name: "w", scope: !573, file: !574, line: 47, type: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !585, line: 37, baseType: !586)
!585 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !99, line: 57, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !99, line: 42, baseType: !7)
!588 = !DILocalVariable(name: "mbs", scope: !573, file: !574, line: 48, type: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !590, line: 6, baseType: !591)
!590 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !592, line: 21, baseType: !593)
!592 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 13, size: 64, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !593, file: !592, line: 15, baseType: !48, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !593, file: !592, line: 20, baseType: !597, size: 32, offset: 32)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !592, line: 16, size: 32, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !597, file: !592, line: 18, baseType: !7, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !597, file: !592, line: 19, baseType: !601, size: 32)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !177)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 16, elements: !132)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !605, file: !606, line: 76, type: !672, isLocal: false, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !607, retainedTypes: !613, globals: !614, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!607 = !{!26, !608, !5}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !27, line: 254, baseType: !7, size: 32, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!611 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!612 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!613 = !{!48, !87, !53}
!614 = !{!603, !615, !621, !631, !633, !638, !661, !668, !670}
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !605, file: !606, line: 92, type: !617, isLocal: false, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 320, elements: !619)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!619 = !{!620}
!620 = !DISubrange(count: 10)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !605, file: !606, line: 1040, type: !623, isLocal: false, isDefinition: true)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !606, line: 56, size: 448, elements: !624)
!624 = !{!625, !626, !627, !629, !630}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !623, file: !606, line: 59, baseType: !26, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !606, line: 62, baseType: !48, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !623, file: !606, line: 66, baseType: !628, size: 256, offset: 64)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !324)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !623, file: !606, line: 69, baseType: !45, size: 64, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !623, file: !606, line: 72, baseType: !45, size: 64, offset: 384)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !605, file: !606, line: 107, type: !623, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "slot0", scope: !605, file: !606, line: 831, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 256)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "quote", scope: !640, file: !606, line: 228, type: !659, isLocal: true, isDefinition: true)
!640 = distinct !DISubprogram(name: "gettext_quote", scope: !606, file: !606, line: 197, type: !641, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !605, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{!45, !45, !26}
!643 = !{!644, !645, !646, !647, !648}
!644 = !DILocalVariable(name: "msgid", arg: 1, scope: !640, file: !606, line: 197, type: !45)
!645 = !DILocalVariable(name: "s", arg: 2, scope: !640, file: !606, line: 197, type: !26)
!646 = !DILocalVariable(name: "translation", scope: !640, file: !606, line: 199, type: !45)
!647 = !DILocalVariable(name: "w", scope: !640, file: !606, line: 229, type: !584)
!648 = !DILocalVariable(name: "mbs", scope: !640, file: !606, line: 230, type: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !590, line: 6, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !592, line: 21, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 13, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !651, file: !592, line: 15, baseType: !48, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !651, file: !592, line: 20, baseType: !655, size: 32, offset: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !592, line: 16, size: 32, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !655, file: !592, line: 18, baseType: !7, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !655, file: !592, line: 19, baseType: !601, size: 32)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !660)
!660 = !{!133, !178}
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "slotvec", scope: !605, file: !606, line: 834, type: !663, isLocal: true, isDefinition: true)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !606, line: 823, size: 128, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !606, line: 825, baseType: !53, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !664, file: !606, line: 826, baseType: !52, size: 64, offset: 64)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "nslots", scope: !605, file: !606, line: 832, type: !48, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "slotvec0", scope: !605, file: !606, line: 833, type: !664, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 704, elements: !329)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !675, file: !676, line: 26, type: !678, isLocal: false, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !677, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!677 = !{!673}
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 376, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 47)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "exit_failure", scope: !683, file: !684, line: 24, type: !686, isLocal: false, isDefinition: true)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !685, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!685 = !{!681}
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "internal_state", scope: !689, file: !690, line: 97, type: !693, isLocal: true, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C99, file: !690, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, globals: !692, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!691 = !{!86, !53, !88}
!692 = !{!687}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !590, line: 6, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !592, line: 21, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 13, size: 64, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !695, file: !592, line: 15, baseType: !48, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !695, file: !592, line: 20, baseType: !699, size: 32, offset: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !592, line: 16, size: 32, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !699, file: !592, line: 18, baseType: !7, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !699, file: !592, line: 19, baseType: !601, size: 32)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !705, file: !706, line: 506, type: !48, isLocal: true, isDefinition: true)
!705 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !706, file: !706, line: 485, type: !707, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !709, retainedNodes: !711)
!706 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!707 = !DISubroutineType(types: !708)
!708 = !{!48, !48, !48}
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !706, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !710, splitDebugInlining: false, nameTableKind: None)
!710 = !{!703}
!711 = !{!712, !713, !714, !715, !718}
!712 = !DILocalVariable(name: "fd", arg: 1, scope: !705, file: !706, line: 485, type: !48)
!713 = !DILocalVariable(name: "target", arg: 2, scope: !705, file: !706, line: 485, type: !48)
!714 = !DILocalVariable(name: "result", scope: !705, file: !706, line: 487, type: !48)
!715 = !DILocalVariable(name: "flags", scope: !716, file: !706, line: 530, type: !48)
!716 = distinct !DILexicalBlock(scope: !717, file: !706, line: 529, column: 5)
!717 = distinct !DILexicalBlock(scope: !705, file: !706, line: 528, column: 7)
!718 = !DILocalVariable(name: "saved_errno", scope: !719, file: !706, line: 533, type: !48)
!719 = distinct !DILexicalBlock(scope: !720, file: !706, line: 532, column: 9)
!720 = distinct !DILexicalBlock(scope: !716, file: !706, line: 531, column: 11)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !723, file: !724, line: 211, type: !910, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "printf_fetchargs", scope: !724, file: !724, line: 42, type: !725, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !901, retainedNodes: !905)
!724 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!725 = !DISubroutineType(types: !726)
!726 = !{!48, !727, !737}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !472, line: 14, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !729, baseType: !730)
!729 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !476, size: 256, elements: !731)
!731 = !{!732, !733, !734, !735, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !730, file: !729, baseType: !86, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !730, file: !729, baseType: !86, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !730, file: !729, baseType: !86, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !730, file: !729, baseType: !48, size: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !730, file: !729, baseType: !48, size: 32, offset: 224)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !739, line: 185, baseType: !740)
!739 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 179, size: 1920, elements: !741)
!741 = !{!742, !743, !897}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !740, file: !739, line: 181, baseType: !53, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !740, file: !739, line: 182, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !739, line: 174, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 111, size: 256, elements: !747)
!747 = !{!748, !799}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !739, line: 113, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !739, line: 108, baseType: !750)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !739, line: 47, baseType: !7, size: 32, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!752 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!753 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!754 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!755 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!756 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!757 = !DIEnumerator(name: "TYPE_INT", value: 5)
!758 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!759 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!760 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!761 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!762 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!763 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!764 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!765 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!766 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!767 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!768 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!769 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!770 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!771 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!772 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!773 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!774 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!775 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!776 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!777 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!778 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!779 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!780 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!781 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!782 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!783 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!784 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!785 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!786 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!787 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!788 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!789 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!790 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!791 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!792 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!793 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!794 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!795 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!796 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!797 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!798 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !746, file: !739, line: 172, baseType: !800, size: 128, offset: 128)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !746, file: !739, line: 114, size: 128, elements: !801)
!801 = !{!802, !803, !804, !806, !807, !808, !809, !810, !811, !813, !815, !819, !823, !826, !829, !832, !834, !837, !840, !842, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !863, !866, !867, !871, !872, !874, !876, !877, !879, !881, !883, !885, !887, !889, !891, !893, !895}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !800, file: !739, line: 116, baseType: !260, size: 8)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !800, file: !739, line: 117, baseType: !88, size: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !800, file: !739, line: 118, baseType: !805, size: 16)
!805 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !800, file: !739, line: 119, baseType: !87, size: 16)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !800, file: !739, line: 120, baseType: !48, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !800, file: !739, line: 121, baseType: !7, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !800, file: !739, line: 122, baseType: !114, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !800, file: !739, line: 123, baseType: !55, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !800, file: !739, line: 124, baseType: !812, size: 64)
!812 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !800, file: !739, line: 125, baseType: !814, size: 64)
!814 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !800, file: !739, line: 126, baseType: !816, size: 8)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !817, line: 24, baseType: !818)
!817 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !99, line: 37, baseType: !260)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !800, file: !739, line: 127, baseType: !820, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !821, line: 24, baseType: !822)
!821 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !99, line: 38, baseType: !88)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !800, file: !739, line: 128, baseType: !824, size: 16)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !817, line: 25, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !99, line: 39, baseType: !805)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !800, file: !739, line: 129, baseType: !827, size: 16)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !821, line: 25, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !99, line: 40, baseType: !87)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !800, file: !739, line: 130, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !817, line: 26, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !99, line: 41, baseType: !48)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !800, file: !739, line: 131, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !821, line: 26, baseType: !587)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !800, file: !739, line: 132, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !817, line: 27, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !99, line: 44, baseType: !114)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !800, file: !739, line: 133, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !821, line: 27, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !99, line: 45, baseType: !55)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !800, file: !739, line: 134, baseType: !841, size: 8)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !136, line: 58, baseType: !260)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !800, file: !739, line: 135, baseType: !843, size: 8)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !136, line: 71, baseType: !88)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !800, file: !739, line: 136, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !136, line: 60, baseType: !114)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !800, file: !739, line: 137, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !136, line: 73, baseType: !55)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !800, file: !739, line: 138, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !136, line: 61, baseType: !114)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !800, file: !739, line: 139, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !136, line: 74, baseType: !55)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !800, file: !739, line: 140, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !136, line: 62, baseType: !114)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !800, file: !739, line: 141, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !136, line: 75, baseType: !55)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !800, file: !739, line: 142, baseType: !857, size: 32)
!857 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !800, file: !739, line: 143, baseType: !859, size: 64)
!859 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !800, file: !739, line: 144, baseType: !861, size: 128)
!861 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !800, file: !739, line: 145, baseType: !48, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !800, file: !739, line: 147, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !865, line: 20, baseType: !7)
!865 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!866 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !800, file: !739, line: 149, baseType: !45, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !800, file: !739, line: 150, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !54, line: 74, baseType: !7)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !800, file: !739, line: 151, baseType: !86, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !800, file: !739, line: 152, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !800, file: !739, line: 153, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !800, file: !739, line: 154, baseType: !305, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !800, file: !739, line: 155, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !800, file: !739, line: 156, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !800, file: !739, line: 157, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !800, file: !739, line: 158, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !800, file: !739, line: 159, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !800, file: !739, line: 160, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !800, file: !739, line: 161, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !800, file: !739, line: 162, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !800, file: !739, line: 163, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !800, file: !739, line: 164, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !740, file: !739, line: 183, baseType: !898, size: 1792, offset: 128)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 1792, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 7)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !902, retainedTypes: !903, globals: !904, splitDebugInlining: false, nameTableKind: None)
!902 = !{!750}
!903 = !{!86}
!904 = !{!721}
!905 = !{!906, !907, !908, !909}
!906 = !DILocalVariable(name: "args", arg: 1, scope: !723, file: !724, line: 42, type: !727)
!907 = !DILocalVariable(name: "a", arg: 2, scope: !723, file: !724, line: 42, type: !737)
!908 = !DILocalVariable(name: "i", scope: !723, file: !724, line: 44, type: !53)
!909 = !DILocalVariable(name: "ap", scope: !723, file: !724, line: 45, type: !744)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !869, size: 224, elements: !899)
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !444, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "src/find-mount-point.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02c11bacc56618f441de1ed8fb506d8b")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !915, retainedTypes: !903, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "lib/areadlink-with-size.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aaac2d7e2e4691c3c7dfceec011d70d1")
!915 = !{!916}
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !917, file: !914, line: 60, baseType: !7, size: 32, elements: !944)
!917 = distinct !DISubprogram(name: "areadlink_with_size", scope: !914, file: !914, line: 49, type: !918, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !913, retainedNodes: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{!52, !45, !53}
!920 = !{!921, !922, !923, !924, !925, !926, !927, !932, !933, !934, !937, !938}
!921 = !DILocalVariable(name: "file", arg: 1, scope: !917, file: !914, line: 49, type: !45)
!922 = !DILocalVariable(name: "size", arg: 2, scope: !917, file: !914, line: 49, type: !53)
!923 = !DILocalVariable(name: "symlink_max", scope: !917, file: !914, line: 54, type: !53)
!924 = !DILocalVariable(name: "INITIAL_LIMIT_BOUND", scope: !917, file: !914, line: 55, type: !53)
!925 = !DILocalVariable(name: "initial_limit", scope: !917, file: !914, line: 56, type: !53)
!926 = !DILocalVariable(name: "buf_size", scope: !917, file: !914, line: 63, type: !53)
!927 = !DILocalVariable(name: "stackbuf", scope: !928, file: !914, line: 68, type: !929)
!928 = distinct !DILexicalBlock(scope: !917, file: !914, line: 67, column: 5)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 128)
!932 = !DILocalVariable(name: "buf", scope: !928, file: !914, line: 69, type: !52)
!933 = !DILocalVariable(name: "buffer", scope: !928, file: !914, line: 70, type: !52)
!934 = !DILocalVariable(name: "r", scope: !928, file: !914, line: 82, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !364, line: 108, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !99, line: 194, baseType: !114)
!937 = !DILocalVariable(name: "link_length", scope: !928, file: !914, line: 89, type: !53)
!938 = !DILocalVariable(name: "shrinked_buffer", scope: !939, file: !914, line: 102, type: !52)
!939 = distinct !DILexicalBlock(scope: !940, file: !914, line: 100, column: 13)
!940 = distinct !DILexicalBlock(scope: !941, file: !914, line: 99, column: 20)
!941 = distinct !DILexicalBlock(scope: !942, file: !914, line: 93, column: 15)
!942 = distinct !DILexicalBlock(scope: !943, file: !914, line: 91, column: 9)
!943 = distinct !DILexicalBlock(scope: !928, file: !914, line: 90, column: 11)
!944 = !{!945}
!945 = !DIEnumerator(name: "stackbuf_size", value: 128)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!948 = distinct !DICompileUnit(language: DW_LANG_C99, file: !949, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!949 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!952 = distinct !DICompileUnit(language: DW_LANG_C99, file: !953, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!953 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!956 = distinct !DICompileUnit(language: DW_LANG_C99, file: !957, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !958, splitDebugInlining: false, nameTableKind: None)
!957 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !136, line: 101, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !99, line: 72, baseType: !114)
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !963, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/mountlist.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9c45539f6f3902bf91fbce80e7cbadbc")
!963 = !{!86, !98}
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "lib/save-cwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50106651149ed8104fc2255edd6d8bae")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !968, retainedTypes: !972, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "lib/time_rz.c", directory: "/src", checksumkind: CSK_MD5, checksum: "77903e6b2ced3335152eaec7e7af65ee")
!968 = !{!969}
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !967, line: 82, baseType: !7, size: 32, elements: !970)
!970 = !{!971}
!971 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!972 = !{!973, !52}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !411, line: 1039, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !513, line: 24, size: 128, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !975, file: !513, line: 28, baseType: !974, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !975, file: !513, line: 33, baseType: !47, size: 8, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !975, file: !513, line: 45, baseType: !518, offset: 72)
!980 = distinct !DICompileUnit(language: DW_LANG_C99, file: !981, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !982, retainedTypes: !903, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!982 = !{!983}
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !981, line: 40, baseType: !7, size: 32, elements: !984)
!984 = !{!985}
!985 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!986 = distinct !DICompileUnit(language: DW_LANG_C99, file: !987, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !988, retainedTypes: !1019, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!988 = !{!989, !1001}
!989 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !990, file: !987, line: 188, baseType: !7, size: 32, elements: !999)
!990 = distinct !DISubprogram(name: "x2nrealloc", scope: !987, file: !987, line: 176, type: !991, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !986, retainedNodes: !994)
!991 = !DISubroutineType(types: !992)
!992 = !{!86, !86, !993, !53}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!994 = !{!995, !996, !997, !998}
!995 = !DILocalVariable(name: "p", arg: 1, scope: !990, file: !987, line: 176, type: !86)
!996 = !DILocalVariable(name: "pn", arg: 2, scope: !990, file: !987, line: 176, type: !993)
!997 = !DILocalVariable(name: "s", arg: 3, scope: !990, file: !987, line: 176, type: !53)
!998 = !DILocalVariable(name: "n", scope: !990, file: !987, line: 178, type: !53)
!999 = !{!1000}
!1000 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1002, file: !987, line: 228, baseType: !7, size: 32, elements: !999)
!1002 = distinct !DISubprogram(name: "xpalloc", scope: !987, file: !987, line: 223, type: !1003, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !986, retainedNodes: !1009)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!86, !86, !1005, !1006, !1008, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1007, line: 130, baseType: !1008)
!1007 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !54, line: 35, baseType: !114)
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!1010 = !DILocalVariable(name: "pa", arg: 1, scope: !1002, file: !987, line: 223, type: !86)
!1011 = !DILocalVariable(name: "pn", arg: 2, scope: !1002, file: !987, line: 223, type: !1005)
!1012 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1002, file: !987, line: 223, type: !1006)
!1013 = !DILocalVariable(name: "n_max", arg: 4, scope: !1002, file: !987, line: 223, type: !1008)
!1014 = !DILocalVariable(name: "s", arg: 5, scope: !1002, file: !987, line: 223, type: !1006)
!1015 = !DILocalVariable(name: "n0", scope: !1002, file: !987, line: 230, type: !1006)
!1016 = !DILocalVariable(name: "n", scope: !1002, file: !987, line: 237, type: !1006)
!1017 = !DILocalVariable(name: "nbytes", scope: !1002, file: !987, line: 248, type: !1006)
!1018 = !DILocalVariable(name: "adjusted_nbytes", scope: !1002, file: !987, line: 252, type: !1006)
!1019 = !{!52, !86, !44, !114, !55}
!1020 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1021, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1021 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1022 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1023, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1023 = !DIFile(filename: "lib/xgetcwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3727157833d2e1ec9b24b353bc14eccb")
!1024 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1025, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1025 = !DIFile(filename: "lib/xasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "284d06af3d9f59048744c48dba404142")
!1026 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1027, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !903, splitDebugInlining: false, nameTableKind: None)
!1027 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1028 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1029, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !569, splitDebugInlining: false, nameTableKind: None)
!1029 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
