; ModuleID = 'src/stdbuf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.anon = type { i64, i32, i8* }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.allocator = type { i8* (i64)*, i8* (i8*, i64)*, void (i8*)*, void (i64)* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }
%struct.arguments = type { i64, %struct.argument*, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.37 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 47, type: !147, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !36, globals: !48, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/stdbuf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42a816e1163f951f05f11ddd4bb233a8")
!4 = !{!5, !13, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 90, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124)
!10 = !DIEnumerator(name: "EXIT_CANCELED", value: 125)
!11 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126)
!12 = !DIEnumerator(name: "EXIT_ENOENT", value: 127)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 46, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !29, line: 30, baseType: !7, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!30 = !{!31, !32, !33, !34, !35}
!31 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!32 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!33 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!34 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!35 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!36 = !{!37, !40, !42, !43, !44, !45, !47}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 46, baseType: !39)
!38 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!39 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !{!49, !51, !61, !0}
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "program_path", scope: !2, file: !3, line: 38, type: !40, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "stdbuf", scope: !2, file: !3, line: 45, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 576, elements: !59)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 40, size: 192, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !3, line: 42, baseType: !37, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "optc", scope: !54, file: !3, line: 43, baseType: !43, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "optarg", scope: !54, file: !3, line: 44, baseType: !40, size: 64, offset: 128)
!59 = !{!60}
!60 = !DISubrange(count: 3)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !63, file: !6, line: 575, type: !43, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "oputs_", scope: !6, file: !6, line: 573, type: !64, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !45, !45}
!66 = !{!67, !68, !69, !72, !74, !75, !76, !80, !81, !82, !83, !85, !141, !142, !143, !145, !146}
!67 = !DILocalVariable(name: "program", arg: 1, scope: !63, file: !6, line: 573, type: !45)
!68 = !DILocalVariable(name: "option", arg: 2, scope: !63, file: !6, line: 573, type: !45)
!69 = !DILocalVariable(name: "term", scope: !70, file: !6, line: 585, type: !45)
!70 = distinct !DILexicalBlock(scope: !71, file: !6, line: 582, column: 5)
!71 = distinct !DILexicalBlock(scope: !63, file: !6, line: 581, column: 7)
!72 = !DILocalVariable(name: "double_space", scope: !63, file: !6, line: 594, type: !73)
!73 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!74 = !DILocalVariable(name: "first_word", scope: !63, file: !6, line: 595, type: !45)
!75 = !DILocalVariable(name: "option_text", scope: !63, file: !6, line: 596, type: !45)
!76 = !DILocalVariable(name: "s", scope: !77, file: !6, line: 608, type: !45)
!77 = distinct !DILexicalBlock(scope: !78, file: !6, line: 605, column: 5)
!78 = distinct !DILexicalBlock(scope: !79, file: !6, line: 604, column: 12)
!79 = distinct !DILexicalBlock(scope: !63, file: !6, line: 597, column: 7)
!80 = !DILocalVariable(name: "spaces", scope: !77, file: !6, line: 609, type: !37)
!81 = !DILocalVariable(name: "anchor_len", scope: !63, file: !6, line: 620, type: !37)
!82 = !DILocalVariable(name: "desc_text", scope: !63, file: !6, line: 625, type: !45)
!83 = !DILocalVariable(name: "__ptr", scope: !84, file: !6, line: 644, type: !45)
!84 = distinct !DILexicalBlock(scope: !63, file: !6, line: 644, column: 3)
!85 = !DILocalVariable(name: "__stream", scope: !84, file: !6, line: 644, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 7, baseType: !89)
!88 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !91)
!90 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !107, !109, !110, !111, !115, !116, !118, !122, !125, !127, !130, !133, !134, !135, !136, !137}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !90, line: 51, baseType: !43, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !89, file: !90, line: 54, baseType: !40, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !89, file: !90, line: 55, baseType: !40, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !89, file: !90, line: 56, baseType: !40, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !89, file: !90, line: 57, baseType: !40, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !89, file: !90, line: 58, baseType: !40, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !89, file: !90, line: 59, baseType: !40, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !89, file: !90, line: 60, baseType: !40, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !89, file: !90, line: 61, baseType: !40, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !89, file: !90, line: 64, baseType: !40, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !89, file: !90, line: 65, baseType: !40, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !89, file: !90, line: 66, baseType: !40, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !89, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !90, line: 36, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !89, file: !90, line: 70, baseType: !108, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !89, file: !90, line: 72, baseType: !43, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !89, file: !90, line: 73, baseType: !43, size: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !89, file: !90, line: 74, baseType: !112, size: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !113, line: 152, baseType: !114)
!113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!114 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !89, file: !90, line: 77, baseType: !44, size: 16, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !89, file: !90, line: 78, baseType: !117, size: 8, offset: 1040)
!117 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !89, file: !90, line: 79, baseType: !119, size: 8, offset: 1048)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 8, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !89, file: !90, line: 81, baseType: !123, size: 64, offset: 1088)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !90, line: 43, baseType: null)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !90, line: 89, baseType: !126, size: 64, offset: 1152)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !113, line: 153, baseType: !114)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !89, file: !90, line: 91, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !90, line: 37, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !89, file: !90, line: 92, baseType: !131, size: 64, offset: 1280)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !90, line: 38, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !89, file: !90, line: 93, baseType: !108, size: 64, offset: 1344)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !89, file: !90, line: 94, baseType: !42, size: 64, offset: 1408)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !89, file: !90, line: 95, baseType: !37, size: 64, offset: 1472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !89, file: !90, line: 96, baseType: !43, size: 32, offset: 1536)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !89, file: !90, line: 98, baseType: !138, size: 160, offset: 1568)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 20)
!141 = !DILocalVariable(name: "__cnt", scope: !84, file: !6, line: 644, type: !37)
!142 = !DILocalVariable(name: "url_program", scope: !63, file: !6, line: 648, type: !45)
!143 = !DILocalVariable(name: "__ptr", scope: !144, file: !6, line: 686, type: !45)
!144 = distinct !DILexicalBlock(scope: !63, file: !6, line: 686, column: 3)
!145 = !DILocalVariable(name: "__stream", scope: !144, file: !6, line: 686, type: !86)
!146 = !DILocalVariable(name: "__cnt", scope: !144, file: !6, line: 686, type: !37)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1536, elements: !157)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !150, line: 50, size: 256, elements: !151)
!150 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!151 = !{!152, !153, !154, !156}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !150, line: 52, baseType: !45, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !149, file: !150, line: 55, baseType: !43, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !149, file: !150, line: 56, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !150, line: 57, baseType: !43, size: 32, offset: 192)
!157 = !{!158}
!158 = !DISubrange(count: 6)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "Version", scope: !161, file: !162, line: 3, type: !45, isLocal: false, isDefinition: true)
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !163, splitDebugInlining: false, nameTableKind: None)
!162 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!163 = !{!159}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "file_name", scope: !166, file: !167, line: 45, type: !45, isLocal: true, isDefinition: true)
!166 = distinct !DICompileUnit(language: DW_LANG_C99, file: !167, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !168, splitDebugInlining: false, nameTableKind: None)
!167 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!168 = !{!164, !169}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !166, file: !167, line: 55, type: !73, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !173, file: !174, line: 66, type: !209, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!175 = !{!42, !47}
!176 = !{!177, !203, !171, !205, !207}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "old_file_name", scope: !179, file: !174, line: 304, type: !45, isLocal: true, isDefinition: true)
!179 = distinct !DISubprogram(name: "verror_at_line", scope: !174, file: !174, line: 298, type: !180, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !173, retainedNodes: !196)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !43, !43, !45, !7, !45, !182}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !183, line: 52, baseType: !184)
!183 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !185, line: 32, baseType: !186)
!185 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !187, baseType: !188)
!187 = !DIFile(filename: "lib/error.c", directory: "/src")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !189, size: 256, elements: !190)
!189 = !DINamespace(name: "std", scope: null)
!190 = !{!191, !192, !193, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !188, file: !187, baseType: !42, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !188, file: !187, baseType: !42, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !188, file: !187, baseType: !42, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !188, file: !187, baseType: !43, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !188, file: !187, baseType: !43, size: 32, offset: 224)
!196 = !{!197, !198, !199, !200, !201, !202}
!197 = !DILocalVariable(name: "status", arg: 1, scope: !179, file: !174, line: 298, type: !43)
!198 = !DILocalVariable(name: "errnum", arg: 2, scope: !179, file: !174, line: 298, type: !43)
!199 = !DILocalVariable(name: "file_name", arg: 3, scope: !179, file: !174, line: 298, type: !45)
!200 = !DILocalVariable(name: "line_number", arg: 4, scope: !179, file: !174, line: 298, type: !7)
!201 = !DILocalVariable(name: "message", arg: 5, scope: !179, file: !174, line: 298, type: !45)
!202 = !DILocalVariable(name: "args", arg: 6, scope: !179, file: !174, line: 298, type: !182)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "old_line_number", scope: !179, file: !174, line: 305, type: !7, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "error_message_count", scope: !173, file: !174, line: 69, type: !7, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !173, file: !174, line: 295, type: !43, isLocal: false, isDefinition: true)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "program_name", scope: !214, file: !215, line: 31, type: !45, isLocal: false, isDefinition: true)
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !216, globals: !217, splitDebugInlining: false, nameTableKind: None)
!215 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!216 = !{!40}
!217 = !{!212}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "utf07FF", scope: !220, file: !221, line: 46, type: !251, isLocal: true, isDefinition: true)
!220 = distinct !DISubprogram(name: "proper_name_lite", scope: !221, file: !221, line: 38, type: !222, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !224, retainedNodes: !226)
!221 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!222 = !DISubroutineType(types: !223)
!223 = !{!45, !45, !45}
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !225, splitDebugInlining: false, nameTableKind: None)
!225 = !{!218}
!226 = !{!227, !228, !229, !230, !235}
!227 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !220, file: !221, line: 38, type: !45)
!228 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !220, file: !221, line: 38, type: !45)
!229 = !DILocalVariable(name: "translation", scope: !220, file: !221, line: 40, type: !45)
!230 = !DILocalVariable(name: "w", scope: !220, file: !221, line: 47, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !232, line: 37, baseType: !233)
!232 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !113, line: 57, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !113, line: 42, baseType: !7)
!235 = !DILocalVariable(name: "mbs", scope: !220, file: !221, line: 48, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !237, line: 6, baseType: !238)
!237 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !239, line: 21, baseType: !240)
!239 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 13, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !240, file: !239, line: 15, baseType: !43, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !240, file: !239, line: 20, baseType: !244, size: 32, offset: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !240, file: !239, line: 16, size: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !244, file: !239, line: 18, baseType: !7, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !244, file: !239, line: 19, baseType: !248, size: 32)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 4)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 16, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !256, file: !257, line: 76, type: !339, isLocal: false, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !258, retainedTypes: !278, globals: !279, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!258 = !{!259, !273, !13}
!259 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !260, line: 42, baseType: !7, size: 32, elements: !261)
!260 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!262 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!263 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!264 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!265 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!266 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!267 = !DIEnumerator(name: "c_quoting_style", value: 5)
!268 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!269 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!270 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!271 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!272 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!273 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !260, line: 254, baseType: !7, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!276 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!277 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!278 = !{!43, !44, !37}
!279 = !{!254, !280, !286, !298, !300, !305, !328, !335, !337}
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !256, file: !257, line: 92, type: !282, isLocal: false, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 320, elements: !284)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!284 = !{!285}
!285 = !DISubrange(count: 10)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !256, file: !257, line: 1040, type: !288, isLocal: false, isDefinition: true)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !257, line: 56, size: 448, elements: !289)
!289 = !{!290, !291, !292, !296, !297}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !288, file: !257, line: 59, baseType: !259, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !257, line: 62, baseType: !43, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !288, file: !257, line: 66, baseType: !293, size: 256, offset: 64)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !288, file: !257, line: 69, baseType: !45, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !288, file: !257, line: 72, baseType: !45, size: 64, offset: 384)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !256, file: !257, line: 107, type: !288, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "slot0", scope: !256, file: !257, line: 831, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 256)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "quote", scope: !307, file: !257, line: 228, type: !326, isLocal: true, isDefinition: true)
!307 = distinct !DISubprogram(name: "gettext_quote", scope: !257, file: !257, line: 197, type: !308, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !256, retainedNodes: !310)
!308 = !DISubroutineType(types: !309)
!309 = !{!45, !45, !259}
!310 = !{!311, !312, !313, !314, !315}
!311 = !DILocalVariable(name: "msgid", arg: 1, scope: !307, file: !257, line: 197, type: !45)
!312 = !DILocalVariable(name: "s", arg: 2, scope: !307, file: !257, line: 197, type: !259)
!313 = !DILocalVariable(name: "translation", scope: !307, file: !257, line: 199, type: !45)
!314 = !DILocalVariable(name: "w", scope: !307, file: !257, line: 229, type: !231)
!315 = !DILocalVariable(name: "mbs", scope: !307, file: !257, line: 230, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !237, line: 6, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !239, line: 21, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 13, size: 64, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !318, file: !239, line: 15, baseType: !43, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !318, file: !239, line: 20, baseType: !322, size: 32, offset: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !318, file: !239, line: 16, size: 32, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !322, file: !239, line: 18, baseType: !7, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !322, file: !239, line: 19, baseType: !248, size: 32)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 64, elements: !327)
!327 = !{!253, !250}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "slotvec", scope: !256, file: !257, line: 834, type: !330, isLocal: true, isDefinition: true)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !257, line: 823, size: 128, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !257, line: 825, baseType: !37, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !331, file: !257, line: 826, baseType: !40, size: 64, offset: 64)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "nslots", scope: !256, file: !257, line: 832, type: !43, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "slotvec0", scope: !256, file: !257, line: 833, type: !331, isLocal: true, isDefinition: true)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 704, elements: !341)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!341 = !{!342}
!342 = !DISubrange(count: 11)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !345, file: !346, line: 26, type: !348, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !347, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!347 = !{!343}
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 376, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 47)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "exit_failure", scope: !353, file: !354, line: 24, type: !356, isLocal: false, isDefinition: true)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !355, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!355 = !{!351}
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !43)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "internal_state", scope: !359, file: !360, line: 97, type: !363, isLocal: true, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, globals: !362, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!361 = !{!42, !37, !47}
!362 = !{!357}
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !237, line: 6, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !239, line: 21, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 13, size: 64, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !365, file: !239, line: 15, baseType: !43, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !365, file: !239, line: 20, baseType: !369, size: 32, offset: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !239, line: 16, size: 32, elements: !370)
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !369, file: !239, line: 18, baseType: !7, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !369, file: !239, line: 19, baseType: !248, size: 32)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "stdlib_allocator", scope: !375, file: !376, line: 22, type: !378, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !377, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/allocator.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54a9f4967f3b89b8910b08aae9f2e480")
!377 = !{!373}
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator", file: !380, line: 32, size: 256, elements: !381)
!380 = !DIFile(filename: "./lib/allocator.h", directory: "/src", checksumkind: CSK_MD5, checksum: "816cfc497daa662c0eddbd32abbb58a6")
!381 = !{!382, !386, !390, !394}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !379, file: !380, line: 42, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!42, !37}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reallocate", scope: !379, file: !380, line: 48, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!42, !42, !37}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !379, file: !380, line: 51, baseType: !391, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !42}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !379, file: !380, line: 57, baseType: !395, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !37}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !400, file: !401, line: 211, type: !588, isLocal: true, isDefinition: true)
!400 = distinct !DISubprogram(name: "printf_fetchargs", scope: !401, file: !401, line: 42, type: !402, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !579, retainedNodes: !583)
!401 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!402 = !DISubroutineType(types: !403)
!403 = !{!43, !404, !414}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !185, line: 14, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !406, baseType: !407)
!406 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !189, size: 256, elements: !408)
!408 = !{!409, !410, !411, !412, !413}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !407, file: !406, baseType: !42, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !407, file: !406, baseType: !42, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !407, file: !406, baseType: !42, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !407, file: !406, baseType: !43, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !407, file: !406, baseType: !43, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !416, line: 185, baseType: !417)
!416 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 179, size: 1920, elements: !418)
!418 = !{!419, !420, !575}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !417, file: !416, line: 181, baseType: !37, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !417, file: !416, line: 182, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !416, line: 174, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 111, size: 256, elements: !424)
!424 = !{!425, !476}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !416, line: 113, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !416, line: 108, baseType: !427)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !416, line: 47, baseType: !7, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!429 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!430 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!431 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!432 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!433 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!434 = !DIEnumerator(name: "TYPE_INT", value: 5)
!435 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!436 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!437 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!438 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!439 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!440 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!441 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!442 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!443 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!444 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!445 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!446 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!447 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!448 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!449 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!450 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!451 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!452 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!453 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!454 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!455 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!456 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!457 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!458 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!459 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!460 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!461 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!462 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!463 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!464 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!465 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!466 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!467 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!468 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!469 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!470 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!471 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!472 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!473 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!474 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!475 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !423, file: !416, line: 172, baseType: !477, size: 128, offset: 128)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !423, file: !416, line: 114, size: 128, elements: !478)
!478 = !{!479, !480, !481, !483, !484, !485, !486, !487, !488, !490, !492, !496, !500, !503, !506, !509, !511, !514, !517, !520, !522, !524, !526, !528, !530, !532, !534, !536, !538, !540, !541, !544, !545, !549, !550, !552, !554, !555, !557, !559, !561, !563, !565, !567, !569, !571, !573}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !477, file: !416, line: 116, baseType: !117, size: 8)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !477, file: !416, line: 117, baseType: !47, size: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !477, file: !416, line: 118, baseType: !482, size: 16)
!482 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !477, file: !416, line: 119, baseType: !44, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !477, file: !416, line: 120, baseType: !43, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !477, file: !416, line: 121, baseType: !7, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !477, file: !416, line: 122, baseType: !114, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !477, file: !416, line: 123, baseType: !39, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !477, file: !416, line: 124, baseType: !489, size: 64)
!489 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !477, file: !416, line: 125, baseType: !491, size: 64)
!491 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !477, file: !416, line: 126, baseType: !493, size: 8)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !494, line: 24, baseType: !495)
!494 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !113, line: 37, baseType: !117)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !477, file: !416, line: 127, baseType: !497, size: 8)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !498, line: 24, baseType: !499)
!498 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !113, line: 38, baseType: !47)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !477, file: !416, line: 128, baseType: !501, size: 16)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !494, line: 25, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !113, line: 39, baseType: !482)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !477, file: !416, line: 129, baseType: !504, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !498, line: 25, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !113, line: 40, baseType: !44)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !477, file: !416, line: 130, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !494, line: 26, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !113, line: 41, baseType: !43)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !477, file: !416, line: 131, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !498, line: 26, baseType: !234)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !477, file: !416, line: 132, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !494, line: 27, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !113, line: 44, baseType: !114)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !477, file: !416, line: 133, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !498, line: 27, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !113, line: 45, baseType: !39)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !477, file: !416, line: 134, baseType: !518, size: 8)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !519, line: 58, baseType: !117)
!519 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!520 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !477, file: !416, line: 135, baseType: !521, size: 8)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !519, line: 71, baseType: !47)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !477, file: !416, line: 136, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !519, line: 60, baseType: !114)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !477, file: !416, line: 137, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !519, line: 73, baseType: !39)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !477, file: !416, line: 138, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !519, line: 61, baseType: !114)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !477, file: !416, line: 139, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !519, line: 74, baseType: !39)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !477, file: !416, line: 140, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !519, line: 62, baseType: !114)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !477, file: !416, line: 141, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !519, line: 75, baseType: !39)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !477, file: !416, line: 142, baseType: !535, size: 32)
!535 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !477, file: !416, line: 143, baseType: !537, size: 64)
!537 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !477, file: !416, line: 144, baseType: !539, size: 128)
!539 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !477, file: !416, line: 145, baseType: !43, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !477, file: !416, line: 147, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !543, line: 20, baseType: !7)
!543 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!544 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !477, file: !416, line: 149, baseType: !45, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !477, file: !416, line: 150, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !38, line: 74, baseType: !7)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !477, file: !416, line: 151, baseType: !42, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !477, file: !416, line: 152, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !477, file: !416, line: 153, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !477, file: !416, line: 154, baseType: !155, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !477, file: !416, line: 155, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !477, file: !416, line: 156, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !477, file: !416, line: 157, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !477, file: !416, line: 158, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !477, file: !416, line: 159, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !477, file: !416, line: 160, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !477, file: !416, line: 161, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !477, file: !416, line: 162, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !477, file: !416, line: 163, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !477, file: !416, line: 164, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !417, file: !416, line: 183, baseType: !576, size: 1792, offset: 128)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 1792, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 7)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !580, retainedTypes: !581, globals: !582, splitDebugInlining: false, nameTableKind: None)
!580 = !{!427}
!581 = !{!42}
!582 = !{!398}
!583 = !{!584, !585, !586, !587}
!584 = !DILocalVariable(name: "args", arg: 1, scope: !400, file: !401, line: 42, type: !404)
!585 = !DILocalVariable(name: "a", arg: 2, scope: !400, file: !401, line: 42, type: !414)
!586 = !DILocalVariable(name: "i", scope: !400, file: !401, line: 44, type: !37)
!587 = !DILocalVariable(name: "ap", scope: !400, file: !401, line: 45, type: !421)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 224, elements: !577)
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/dirname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "475e06e8d4977c5de1ecd152a9105396")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !601, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!601 = !{!602}
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !600, line: 40, baseType: !7, size: 32, elements: !603)
!603 = !{!604}
!604 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !607, retainedTypes: !638, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!607 = !{!608, !620}
!608 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !609, file: !606, line: 188, baseType: !7, size: 32, elements: !618)
!609 = distinct !DISubprogram(name: "x2nrealloc", scope: !606, file: !606, line: 176, type: !610, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !605, retainedNodes: !613)
!610 = !DISubroutineType(types: !611)
!611 = !{!42, !42, !612, !37}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!613 = !{!614, !615, !616, !617}
!614 = !DILocalVariable(name: "p", arg: 1, scope: !609, file: !606, line: 176, type: !42)
!615 = !DILocalVariable(name: "pn", arg: 2, scope: !609, file: !606, line: 176, type: !612)
!616 = !DILocalVariable(name: "s", arg: 3, scope: !609, file: !606, line: 176, type: !37)
!617 = !DILocalVariable(name: "n", scope: !609, file: !606, line: 178, type: !37)
!618 = !{!619}
!619 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !621, file: !606, line: 228, baseType: !7, size: 32, elements: !618)
!621 = distinct !DISubprogram(name: "xpalloc", scope: !606, file: !606, line: 223, type: !622, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !605, retainedNodes: !628)
!622 = !DISubroutineType(types: !623)
!623 = !{!42, !42, !624, !625, !627, !625}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !626, line: 130, baseType: !627)
!626 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !38, line: 35, baseType: !114)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637}
!629 = !DILocalVariable(name: "pa", arg: 1, scope: !621, file: !606, line: 223, type: !42)
!630 = !DILocalVariable(name: "pn", arg: 2, scope: !621, file: !606, line: 223, type: !624)
!631 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !621, file: !606, line: 223, type: !625)
!632 = !DILocalVariable(name: "n_max", arg: 4, scope: !621, file: !606, line: 223, type: !627)
!633 = !DILocalVariable(name: "s", arg: 5, scope: !621, file: !606, line: 223, type: !625)
!634 = !DILocalVariable(name: "n0", scope: !621, file: !606, line: 230, type: !625)
!635 = !DILocalVariable(name: "n", scope: !621, file: !606, line: 237, type: !625)
!636 = !DILocalVariable(name: "nbytes", scope: !621, file: !606, line: 248, type: !625)
!637 = !DILocalVariable(name: "adjusted_nbytes", scope: !621, file: !606, line: 252, type: !625)
!638 = !{!40, !42, !73, !114, !39}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!640 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/xreadlink.c", directory: "/src", checksumkind: CSK_MD5, checksum: "665e17e653dd00157df8eb1b092c6ddd")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !645, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!645 = !{!28, !13}
!646 = !{!43, !44, !40, !73, !39, !647}
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !519, line: 102, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !113, line: 73, baseType: !39)
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/asprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f6cf1caf6d38b23e08bf76a6bab2ad95")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !654, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/areadlink.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c76ae31657c32722bd051975a94b3fc")
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !216, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "lib/careadlinkat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3a2e6c863806ab2883d87f5e9821445a")
!659 = !{!660}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 40, baseType: !7, size: 32, elements: !661)
!661 = !{!662}
!662 = !DIEnumerator(name: "STACK_BUF_SIZE", value: 1024)
!663 = distinct !DICompileUnit(language: DW_LANG_C99, file: !664, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!664 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !668, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!668 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!671 = distinct !DICompileUnit(language: DW_LANG_C99, file: !672, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !673, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!673 = !{!73, !39, !42}
!674 = distinct !DICompileUnit(language: DW_LANG_C99, file: !675, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !580, retainedTypes: !676, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!676 = !{!40, !37, !42, !45, !7}
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !581, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !580, retainedTypes: !685, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!685 = !{!37, !686, !42, !741}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !416, line: 174, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 111, size: 256, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !416, line: 113, baseType: !426, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !688, file: !416, line: 172, baseType: !692, size: 128, offset: 128)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !688, file: !416, line: 114, size: 128, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !692, file: !416, line: 116, baseType: !117, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !692, file: !416, line: 117, baseType: !47, size: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !692, file: !416, line: 118, baseType: !482, size: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !692, file: !416, line: 119, baseType: !44, size: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !692, file: !416, line: 120, baseType: !43, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !692, file: !416, line: 121, baseType: !7, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !692, file: !416, line: 122, baseType: !114, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !692, file: !416, line: 123, baseType: !39, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !692, file: !416, line: 124, baseType: !489, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !692, file: !416, line: 125, baseType: !491, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !692, file: !416, line: 126, baseType: !493, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !692, file: !416, line: 127, baseType: !497, size: 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !692, file: !416, line: 128, baseType: !501, size: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !692, file: !416, line: 129, baseType: !504, size: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !692, file: !416, line: 130, baseType: !507, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !692, file: !416, line: 131, baseType: !510, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !692, file: !416, line: 132, baseType: !512, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !692, file: !416, line: 133, baseType: !515, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !692, file: !416, line: 134, baseType: !518, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !692, file: !416, line: 135, baseType: !521, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !692, file: !416, line: 136, baseType: !523, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !692, file: !416, line: 137, baseType: !525, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !692, file: !416, line: 138, baseType: !527, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !692, file: !416, line: 139, baseType: !529, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !692, file: !416, line: 140, baseType: !531, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !692, file: !416, line: 141, baseType: !533, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !692, file: !416, line: 142, baseType: !535, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !692, file: !416, line: 143, baseType: !537, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !692, file: !416, line: 144, baseType: !539, size: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !692, file: !416, line: 145, baseType: !43, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !692, file: !416, line: 147, baseType: !542, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !692, file: !416, line: 149, baseType: !45, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !692, file: !416, line: 150, baseType: !546, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !692, file: !416, line: 151, baseType: !42, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !692, file: !416, line: 152, baseType: !551, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !692, file: !416, line: 153, baseType: !553, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !692, file: !416, line: 154, baseType: !155, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !692, file: !416, line: 155, baseType: !556, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !692, file: !416, line: 156, baseType: !558, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !692, file: !416, line: 157, baseType: !560, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !692, file: !416, line: 158, baseType: !562, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !692, file: !416, line: 159, baseType: !564, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !692, file: !416, line: 160, baseType: !566, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !692, file: !416, line: 161, baseType: !568, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !692, file: !416, line: 162, baseType: !570, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !692, file: !416, line: 163, baseType: !572, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !692, file: !416, line: 164, baseType: !574, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !743, line: 67, baseType: !744)
!743 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !743, line: 53, size: 704, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !744, file: !743, line: 55, baseType: !45, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !744, file: !743, line: 56, baseType: !45, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !743, line: 57, baseType: !43, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !744, file: !743, line: 58, baseType: !45, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !744, file: !743, line: 59, baseType: !45, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !744, file: !743, line: 60, baseType: !37, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !744, file: !743, line: 61, baseType: !45, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !744, file: !743, line: 62, baseType: !45, size: 64, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !744, file: !743, line: 63, baseType: !37, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !744, file: !743, line: 64, baseType: !41, size: 8, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !744, file: !743, line: 65, baseType: !37, size: 64, offset: 640)
!757 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!758 = !{i32 7, !"Dwarf Version", i32 5}
!759 = !{i32 2, !"Debug Info Version", i32 3}
!760 = !{i32 1, !"wchar_size", i32 4}
!761 = !{i32 1, !"branch-target-enforcement", i32 0}
!762 = !{i32 1, !"sign-return-address", i32 0}
!763 = !{i32 1, !"sign-return-address-all", i32 0}
!764 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!765 = !{i32 7, !"PIC Level", i32 2}
!766 = !{i32 7, !"PIE Level", i32 2}
!767 = !{i32 7, !"uwtable", i32 1}
!768 = !{i32 7, !"frame-pointer", i32 1}
!769 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 84, type: !770, scopeLine: 85, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !43}
!772 = !{!773}
!773 = !DILocalVariable(name: "status", arg: 1, scope: !769, file: !3, line: 84, type: !43)
!774 = !DILocation(line: 0, scope: !769)
!775 = !DILocation(line: 86, column: 14, scope: !776)
!776 = distinct !DILexicalBlock(scope: !769, file: !3, line: 86, column: 7)
!777 = !DILocation(line: 86, column: 7, scope: !769)
!778 = !DILocation(line: 87, column: 5, scope: !779)
!779 = distinct !DILexicalBlock(scope: !776, file: !3, line: 87, column: 5)
!780 = !{!781, !781, i64 0}
!781 = !{!"any pointer", !782, i64 0}
!782 = !{!"omnipotent char", !783, i64 0}
!783 = !{!"Simple C/C++ TBAA"}
!784 = !DILocation(line: 90, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !776, file: !3, line: 89, column: 5)
!786 = !DILocation(line: 91, column: 7, scope: !785)
!787 = !DILocation(line: 736, column: 3, scope: !788, inlinedAt: !790)
!788 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 734, type: !210, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !789)
!789 = !{}
!790 = distinct !DILocation(line: 95, column: 7, scope: !785)
!791 = !DILocation(line: 97, column: 7, scope: !785)
!792 = !DILocation(line: 100, column: 7, scope: !785)
!793 = !DILocation(line: 103, column: 7, scope: !785)
!794 = !DILocation(line: 106, column: 7, scope: !785)
!795 = !DILocation(line: 107, column: 7, scope: !785)
!796 = !DILocation(line: 108, column: 7, scope: !785)
!797 = !DILocation(line: 111, column: 7, scope: !785)
!798 = !DILocation(line: 114, column: 7, scope: !785)
!799 = !DILocation(line: 121, column: 7, scope: !785)
!800 = !DILocalVariable(name: "program", arg: 1, scope: !801, file: !6, line: 824, type: !45)
!801 = distinct !DISubprogram(name: "emit_exec_status", scope: !6, file: !6, line: 824, type: !802, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !45}
!804 = !{!800}
!805 = !DILocation(line: 0, scope: !801, inlinedAt: !806)
!806 = distinct !DILocation(line: 127, column: 7, scope: !785)
!807 = !DILocation(line: 826, column: 7, scope: !801, inlinedAt: !806)
!808 = !DILocalVariable(name: "program", arg: 1, scope: !809, file: !6, line: 836, type: !45)
!809 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 836, type: !802, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!810 = !{!808, !811, !818, !819, !821, !822}
!811 = !DILocalVariable(name: "infomap", scope: !809, file: !6, line: 838, type: !812)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 896, elements: !577)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !809, file: !6, line: 838, size: 128, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !814, file: !6, line: 838, baseType: !45, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !814, file: !6, line: 838, baseType: !45, size: 64, offset: 64)
!818 = !DILocalVariable(name: "node", scope: !809, file: !6, line: 848, type: !45)
!819 = !DILocalVariable(name: "map_prog", scope: !809, file: !6, line: 849, type: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!821 = !DILocalVariable(name: "lc_messages", scope: !809, file: !6, line: 861, type: !45)
!822 = !DILocalVariable(name: "url_program", scope: !809, file: !6, line: 874, type: !45)
!823 = !DILocation(line: 0, scope: !809, inlinedAt: !824)
!824 = distinct !DILocation(line: 128, column: 7, scope: !785)
!825 = !DILocation(line: 838, column: 3, scope: !809, inlinedAt: !824)
!826 = !DILocation(line: 838, column: 67, scope: !809, inlinedAt: !824)
!827 = !DILocation(line: 849, column: 36, scope: !809, inlinedAt: !824)
!828 = !DILocation(line: 851, column: 3, scope: !809, inlinedAt: !824)
!829 = !DILocalVariable(name: "__s1", arg: 1, scope: !830, file: !831, line: 1359, type: !45)
!830 = distinct !DISubprogram(name: "streq", scope: !831, file: !831, line: 1359, type: !832, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !834)
!831 = !DIFile(filename: "./lib/string.h", directory: "/src")
!832 = !DISubroutineType(types: !833)
!833 = !{!73, !45, !45}
!834 = !{!829, !835}
!835 = !DILocalVariable(name: "__s2", arg: 2, scope: !830, file: !831, line: 1359, type: !45)
!836 = !DILocation(line: 0, scope: !830, inlinedAt: !837)
!837 = distinct !DILocation(line: 851, column: 33, scope: !809, inlinedAt: !824)
!838 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !837)
!839 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !837)
!840 = !DILocation(line: 852, column: 13, scope: !809, inlinedAt: !824)
!841 = !DILocation(line: 851, column: 20, scope: !809, inlinedAt: !824)
!842 = !{!843, !781, i64 0}
!843 = !{!"infomap", !781, i64 0, !781, i64 8}
!844 = !DILocation(line: 851, column: 10, scope: !809, inlinedAt: !824)
!845 = !DILocation(line: 851, column: 28, scope: !809, inlinedAt: !824)
!846 = distinct !{!846, !828, !840, !847}
!847 = !{!"llvm.loop.mustprogress"}
!848 = !DILocation(line: 854, column: 17, scope: !849, inlinedAt: !824)
!849 = distinct !DILexicalBlock(scope: !809, file: !6, line: 854, column: 7)
!850 = !{!843, !781, i64 8}
!851 = !DILocation(line: 854, column: 7, scope: !849, inlinedAt: !824)
!852 = !DILocation(line: 854, column: 7, scope: !809, inlinedAt: !824)
!853 = !DILocation(line: 857, column: 3, scope: !809, inlinedAt: !824)
!854 = !DILocation(line: 861, column: 29, scope: !809, inlinedAt: !824)
!855 = !DILocation(line: 862, column: 7, scope: !856, inlinedAt: !824)
!856 = distinct !DILexicalBlock(scope: !809, file: !6, line: 862, column: 7)
!857 = !DILocation(line: 862, column: 19, scope: !856, inlinedAt: !824)
!858 = !DILocation(line: 862, column: 22, scope: !856, inlinedAt: !824)
!859 = !DILocation(line: 862, column: 7, scope: !809, inlinedAt: !824)
!860 = !DILocation(line: 868, column: 7, scope: !861, inlinedAt: !824)
!861 = distinct !DILexicalBlock(scope: !856, file: !6, line: 863, column: 5)
!862 = !DILocation(line: 870, column: 5, scope: !861, inlinedAt: !824)
!863 = !DILocation(line: 0, scope: !830, inlinedAt: !864)
!864 = distinct !DILocation(line: 874, column: 29, scope: !809, inlinedAt: !824)
!865 = !DILocation(line: 875, column: 3, scope: !809, inlinedAt: !824)
!866 = !DILocation(line: 877, column: 3, scope: !809, inlinedAt: !824)
!867 = !DILocation(line: 879, column: 1, scope: !809, inlinedAt: !824)
!868 = !DILocation(line: 130, column: 3, scope: !769)
!869 = !DISubprogram(name: "dcgettext", scope: !870, file: !870, line: 51, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!870 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!871 = !DISubroutineType(types: !872)
!872 = !{!40, !45, !45, !43}
!873 = !DISubprogram(name: "fputs_unlocked", scope: !183, file: !183, line: 691, type: !874, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!874 = !DISubroutineType(types: !875)
!875 = !{!43, !876, !877}
!876 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!877 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!878 = !DILocation(line: 0, scope: !63)
!879 = !DILocation(line: 581, column: 7, scope: !71)
!880 = !{!881, !881, i64 0}
!881 = !{!"int", !782, i64 0}
!882 = !DILocation(line: 581, column: 19, scope: !71)
!883 = !DILocation(line: 581, column: 7, scope: !63)
!884 = !DILocation(line: 585, column: 26, scope: !70)
!885 = !DILocation(line: 0, scope: !70)
!886 = !DILocation(line: 586, column: 23, scope: !70)
!887 = !DILocation(line: 586, column: 28, scope: !70)
!888 = !DILocation(line: 586, column: 32, scope: !70)
!889 = !{!782, !782, i64 0}
!890 = !DILocation(line: 586, column: 38, scope: !70)
!891 = !DILocation(line: 0, scope: !830, inlinedAt: !892)
!892 = distinct !DILocation(line: 586, column: 41, scope: !70)
!893 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !892)
!894 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !892)
!895 = !DILocation(line: 586, column: 19, scope: !70)
!896 = !DILocation(line: 587, column: 5, scope: !70)
!897 = !DILocation(line: 588, column: 7, scope: !898)
!898 = distinct !DILexicalBlock(scope: !63, file: !6, line: 588, column: 7)
!899 = !DILocation(line: 588, column: 7, scope: !63)
!900 = !DILocation(line: 590, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !6, line: 589, column: 5)
!902 = !DILocation(line: 591, column: 7, scope: !901)
!903 = !DILocation(line: 595, column: 37, scope: !63)
!904 = !DILocation(line: 595, column: 35, scope: !63)
!905 = !DILocation(line: 596, column: 29, scope: !63)
!906 = !DILocation(line: 597, column: 8, scope: !79)
!907 = !DILocation(line: 597, column: 7, scope: !63)
!908 = !DILocation(line: 604, column: 24, scope: !78)
!909 = !DILocation(line: 604, column: 12, scope: !79)
!910 = !DILocation(line: 0, scope: !77)
!911 = !DILocation(line: 610, column: 16, scope: !77)
!912 = !DILocation(line: 610, column: 7, scope: !77)
!913 = !DILocation(line: 611, column: 21, scope: !77)
!914 = !{!915, !915, i64 0}
!915 = !{!"short", !782, i64 0}
!916 = !DILocation(line: 611, column: 19, scope: !77)
!917 = !DILocation(line: 611, column: 16, scope: !77)
!918 = !DILocation(line: 610, column: 30, scope: !77)
!919 = distinct !{!919, !912, !913, !847}
!920 = !DILocation(line: 612, column: 18, scope: !921)
!921 = distinct !DILexicalBlock(scope: !77, file: !6, line: 612, column: 11)
!922 = !DILocation(line: 612, column: 11, scope: !77)
!923 = !DILocation(line: 620, column: 23, scope: !63)
!924 = !DILocation(line: 625, column: 39, scope: !63)
!925 = !DILocation(line: 626, column: 3, scope: !63)
!926 = !DILocation(line: 626, column: 10, scope: !63)
!927 = !DILocation(line: 626, column: 21, scope: !63)
!928 = !DILocation(line: 628, column: 44, scope: !929)
!929 = distinct !DILexicalBlock(scope: !930, file: !6, line: 628, column: 11)
!930 = distinct !DILexicalBlock(scope: !63, file: !6, line: 627, column: 5)
!931 = !DILocation(line: 628, column: 32, scope: !929)
!932 = !DILocation(line: 628, column: 49, scope: !929)
!933 = !DILocation(line: 628, column: 11, scope: !930)
!934 = !DILocation(line: 630, column: 11, scope: !935)
!935 = distinct !DILexicalBlock(scope: !930, file: !6, line: 630, column: 11)
!936 = !DILocation(line: 630, column: 11, scope: !930)
!937 = !DILocation(line: 632, column: 26, scope: !938)
!938 = distinct !DILexicalBlock(scope: !939, file: !6, line: 632, column: 15)
!939 = distinct !DILexicalBlock(scope: !935, file: !6, line: 631, column: 9)
!940 = !DILocation(line: 632, column: 34, scope: !938)
!941 = !DILocation(line: 632, column: 37, scope: !938)
!942 = !DILocation(line: 632, column: 15, scope: !939)
!943 = !DILocation(line: 636, column: 29, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !6, line: 636, column: 15)
!945 = !DILocation(line: 640, column: 16, scope: !930)
!946 = distinct !{!946, !925, !947, !847}
!947 = !DILocation(line: 641, column: 5, scope: !63)
!948 = !DILocation(line: 644, column: 3, scope: !63)
!949 = !DILocation(line: 0, scope: !830, inlinedAt: !950)
!950 = distinct !DILocation(line: 648, column: 31, scope: !63)
!951 = !DILocation(line: 0, scope: !830, inlinedAt: !952)
!952 = distinct !DILocation(line: 649, column: 31, scope: !63)
!953 = !DILocation(line: 0, scope: !830, inlinedAt: !954)
!954 = distinct !DILocation(line: 650, column: 31, scope: !63)
!955 = !DILocation(line: 0, scope: !830, inlinedAt: !956)
!956 = distinct !DILocation(line: 651, column: 31, scope: !63)
!957 = !DILocation(line: 0, scope: !830, inlinedAt: !958)
!958 = distinct !DILocation(line: 652, column: 31, scope: !63)
!959 = !DILocation(line: 0, scope: !830, inlinedAt: !960)
!960 = distinct !DILocation(line: 653, column: 31, scope: !63)
!961 = !DILocation(line: 0, scope: !830, inlinedAt: !962)
!962 = distinct !DILocation(line: 654, column: 31, scope: !63)
!963 = !DILocation(line: 0, scope: !830, inlinedAt: !964)
!964 = distinct !DILocation(line: 655, column: 31, scope: !63)
!965 = !DILocation(line: 0, scope: !830, inlinedAt: !966)
!966 = distinct !DILocation(line: 656, column: 31, scope: !63)
!967 = !DILocation(line: 0, scope: !830, inlinedAt: !968)
!968 = distinct !DILocation(line: 657, column: 31, scope: !63)
!969 = !DILocation(line: 663, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !63, file: !6, line: 663, column: 7)
!971 = !DILocation(line: 664, column: 7, scope: !970)
!972 = !DILocation(line: 664, column: 10, scope: !970)
!973 = !DILocation(line: 663, column: 7, scope: !63)
!974 = !DILocation(line: 669, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !6, line: 665, column: 5)
!976 = !DILocation(line: 671, column: 5, scope: !975)
!977 = !DILocation(line: 676, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !970, file: !6, line: 673, column: 5)
!979 = !DILocation(line: 679, column: 3, scope: !63)
!980 = !DILocation(line: 683, column: 3, scope: !63)
!981 = !DILocation(line: 686, column: 3, scope: !63)
!982 = !DILocation(line: 688, column: 3, scope: !63)
!983 = !DILocation(line: 691, column: 3, scope: !63)
!984 = !DILocation(line: 695, column: 3, scope: !63)
!985 = !DILocation(line: 696, column: 1, scope: !63)
!986 = !DISubprogram(name: "setlocale", scope: !987, file: !987, line: 122, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!987 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!988 = !DISubroutineType(types: !989)
!989 = !{!40, !43, !45}
!990 = !DISubprogram(name: "getenv", scope: !991, file: !991, line: 641, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!991 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!992 = !DISubroutineType(types: !993)
!993 = !{!40, !45}
!994 = !DISubprogram(name: "fwrite_unlocked", scope: !183, file: !183, line: 704, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !789)
!995 = !DISubroutineType(types: !996)
!996 = !{!37, !997, !37, !37, !877}
!997 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1000 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 315, type: !1001, scopeLine: 316, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1004)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!43, !43, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!1004 = !{!1005, !1006, !1007, !1008, !1010}
!1005 = !DILocalVariable(name: "argc", arg: 1, scope: !1000, file: !3, line: 315, type: !43)
!1006 = !DILocalVariable(name: "argv", arg: 2, scope: !1000, file: !3, line: 315, type: !1003)
!1007 = !DILocalVariable(name: "c", scope: !1000, file: !3, line: 317, type: !43)
!1008 = !DILocalVariable(name: "opt_fileno", scope: !1009, file: !3, line: 330, type: !43)
!1009 = distinct !DILexicalBlock(scope: !1000, file: !3, line: 329, column: 5)
!1010 = !DILocalVariable(name: "exit_status", scope: !1000, file: !3, line: 394, type: !43)
!1011 = !DILocation(line: 0, scope: !1000)
!1012 = !DILocation(line: 320, column: 21, scope: !1000)
!1013 = !DILocation(line: 320, column: 3, scope: !1000)
!1014 = !DILocation(line: 321, column: 3, scope: !1000)
!1015 = !DILocation(line: 322, column: 3, scope: !1000)
!1016 = !DILocation(line: 323, column: 3, scope: !1000)
!1017 = !DILocalVariable(name: "status", arg: 1, scope: !1018, file: !6, line: 102, type: !43)
!1018 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 102, type: !770, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1019)
!1019 = !{!1017}
!1020 = !DILocation(line: 0, scope: !1018, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 325, column: 3, scope: !1000)
!1022 = !DILocation(line: 105, column: 18, scope: !1023, inlinedAt: !1021)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !6, line: 104, column: 7)
!1024 = !DILocation(line: 326, column: 3, scope: !1000)
!1025 = !DILocation(line: 328, column: 3, scope: !1000)
!1026 = !DILocation(line: 328, column: 15, scope: !1000)
!1027 = !DILocalVariable(name: "ret", scope: !1028, file: !3, line: 174, type: !43)
!1028 = distinct !DISubprogram(name: "optc_to_fileno", scope: !3, file: !3, line: 172, type: !1029, scopeLine: 173, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!43, !43}
!1031 = !{!1032, !1027}
!1032 = !DILocalVariable(name: "c", arg: 1, scope: !1028, file: !3, line: 172, type: !43)
!1033 = !DILocation(line: 0, scope: !1028, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 338, column: 24, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1009, file: !3, line: 333, column: 9)
!1036 = !DILocation(line: 183, column: 7, scope: !1037, inlinedAt: !1034)
!1037 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 177, column: 5)
!1038 = !DILocation(line: 186, column: 7, scope: !1037, inlinedAt: !1034)
!1039 = !DILocation(line: 0, scope: !1009)
!1040 = !DILocation(line: 340, column: 30, scope: !1035)
!1041 = !DILocation(line: 340, column: 35, scope: !1035)
!1042 = !{!1043, !881, i64 8}
!1043 = !{!"", !1044, i64 0, !881, i64 8, !781, i64 16}
!1044 = !{!"long", !782, i64 0}
!1045 = !DILocation(line: 341, column: 30, scope: !1035)
!1046 = !DILocation(line: 341, column: 11, scope: !1035)
!1047 = !DILocation(line: 341, column: 29, scope: !1035)
!1048 = !DILocalVariable(name: "c", arg: 1, scope: !1049, file: !1050, line: 300, type: !43)
!1049 = distinct !DISubprogram(name: "c_isspace", scope: !1050, file: !1050, line: 300, type: !1051, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1053)
!1050 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!73, !43}
!1053 = !{!1048}
!1054 = !DILocation(line: 0, scope: !1049, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 341, column: 18, scope: !1035)
!1056 = !DILocation(line: 302, column: 3, scope: !1049, inlinedAt: !1055)
!1057 = !DILocation(line: 342, column: 19, scope: !1035)
!1058 = distinct !{!1058, !1046, !1057, !847}
!1059 = !DILocation(line: 343, column: 30, scope: !1035)
!1060 = !DILocation(line: 343, column: 37, scope: !1035)
!1061 = !{!1043, !781, i64 16}
!1062 = !DILocation(line: 344, column: 17, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 344, column: 15)
!1064 = !DILocation(line: 344, column: 24, scope: !1063)
!1065 = !DILocation(line: 344, column: 27, scope: !1063)
!1066 = !DILocation(line: 344, column: 35, scope: !1063)
!1067 = !DILocation(line: 344, column: 15, scope: !1035)
!1068 = !DILocation(line: 349, column: 15, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 345, column: 13)
!1070 = !DILocation(line: 350, column: 15, scope: !1069)
!1071 = !DILocation(line: 0, scope: !830, inlinedAt: !1072)
!1072 = distinct !DILocation(line: 353, column: 16, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 353, column: 15)
!1074 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !1072)
!1075 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !1072)
!1076 = !DILocation(line: 354, column: 15, scope: !1073)
!1077 = !DILocalVariable(name: "str", arg: 1, scope: !1078, file: !3, line: 64, type: !45)
