; ModuleID = 'src/stty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.termios = type { i32, i32, i32, i32, i8, [32 x i8], i32, i32 }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.mode_info = type { i8*, i32, i8, i64, i64 }
%struct.control_info = type { i8*, i8, i64 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.char_directives = type { i64, %struct.char_directive*, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { i8*, i8*, i32, i8*, i8*, i64, i8*, i8*, i64, i8, i64 }
%struct.arguments = type { i64, %struct.argument*, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.37 }
%union.anon.37 = type { fp128 }


!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_type", file: !3, line: 181, baseType: !6, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51}
!47 = !DIEnumerator(name: "control", value: 0)
!48 = !DIEnumerator(name: "input", value: 1)
!49 = !DIEnumerator(name: "output", value: 2)
!50 = !DIEnumerator(name: "local", value: 3)
!51 = !DIEnumerator(name: "combination", value: 4)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !53, line: 30, baseType: !6, size: 32, elements: !54)
!53 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!56 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!57 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!58 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!59 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!60 = !{!61, !63, !64, !66, !67, !68, !71, !65, !73, !75, !76, !77, !70}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!70 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !74, line: 24, baseType: !6)
!74 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/termios.h", directory: "", checksumkind: CSK_MD5, checksum: "8fb85635ee384e33fd6386ce833e946a")
!75 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !74, line: 23, baseType: !65)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !74, line: 25, baseType: !6)
!78 = !{!79, !127, !129, !131, !133, !135, !137, !0, !223, !237, !250, !261, !263, !265}
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "mode", scope: !81, file: !3, line: 1291, type: !113, isLocal: true, isDefinition: true)
!81 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1287, type: !82, scopeLine: 1288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !85)
!82 = !DISubroutineType(types: !83)
!83 = !{!66, !66, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !109, !112}
!86 = !DILocalVariable(name: "argc", arg: 1, scope: !81, file: !3, line: 1287, type: !66)
!87 = !DILocalVariable(name: "argv", arg: 2, scope: !81, file: !3, line: 1287, type: !84)
!88 = !DILocalVariable(name: "output_type", scope: !81, file: !3, line: 1293, type: !5)
!89 = !DILocalVariable(name: "optc", scope: !81, file: !3, line: 1294, type: !66)
!90 = !DILocalVariable(name: "argi", scope: !81, file: !3, line: 1295, type: !66)
!91 = !DILocalVariable(name: "opti", scope: !81, file: !3, line: 1296, type: !66)
!92 = !DILocalVariable(name: "require_set_attr", scope: !81, file: !3, line: 1297, type: !75)
!93 = !DILocalVariable(name: "verbose_output", scope: !81, file: !3, line: 1298, type: !75)
!94 = !DILocalVariable(name: "recoverable_output", scope: !81, file: !3, line: 1299, type: !75)
!95 = !DILocalVariable(name: "noargs", scope: !81, file: !3, line: 1300, type: !75)
!96 = !DILocalVariable(name: "file_name", scope: !81, file: !3, line: 1301, type: !61)
!97 = !DILocalVariable(name: "device_name", scope: !81, file: !3, line: 1302, type: !71)
!98 = !DILocalVariable(name: "fdflags", scope: !99, file: !3, line: 1401, type: !66)
!99 = distinct !DILexicalBlock(scope: !100, file: !3, line: 1400, column: 5)
!100 = distinct !DILexicalBlock(scope: !81, file: !3, line: 1399, column: 7)
!101 = !DILocalVariable(name: "i", scope: !102, file: !3, line: 1449, type: !6)
!102 = distinct !DILexicalBlock(scope: !103, file: !3, line: 1449, column: 15)
!103 = distinct !DILexicalBlock(scope: !104, file: !3, line: 1447, column: 13)
!104 = distinct !DILexicalBlock(scope: !105, file: !3, line: 1446, column: 15)
!105 = distinct !DILexicalBlock(scope: !106, file: !3, line: 1445, column: 9)
!106 = distinct !DILexicalBlock(scope: !107, file: !3, line: 1444, column: 11)
!107 = distinct !DILexicalBlock(scope: !108, file: !3, line: 1426, column: 5)
!108 = distinct !DILexicalBlock(scope: !81, file: !3, line: 1425, column: 7)
!109 = !DILocalVariable(name: "newc", scope: !110, file: !3, line: 1451, type: !6)
!110 = distinct !DILexicalBlock(scope: !111, file: !3, line: 1450, column: 17)
!111 = distinct !DILexicalBlock(scope: !102, file: !3, line: 1449, column: 15)
!112 = !DILocalVariable(name: "oldc", scope: !110, file: !3, line: 1452, type: !6)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !114, line: 24, size: 480, elements: !115)
!114 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/termios-struct.h", directory: "", checksumkind: CSK_MD5, checksum: "a512dc8866a1d12d70982670557f907e")
!115 = !{!116, !117, !118, !119, !120, !121, !125, !126}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !113, file: !114, line: 26, baseType: !77, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !113, file: !114, line: 27, baseType: !77, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !113, file: !114, line: 28, baseType: !77, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !113, file: !114, line: 29, baseType: !77, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "c_line", scope: !113, file: !114, line: 30, baseType: !76, size: 8, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !113, file: !114, line: 31, baseType: !122, size: 256, offset: 136)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !113, file: !114, line: 32, baseType: !73, size: 32, offset: 416)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !113, file: !114, line: 33, baseType: !73, size: 32, offset: 448)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "check_mode", scope: !81, file: !3, line: 1394, type: !113, isLocal: true, isDefinition: true)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "new_mode", scope: !81, file: !3, line: 1429, type: !113, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "max_col", scope: !2, file: !3, line: 464, type: !66, isLocal: true, isDefinition: true)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "current_col", scope: !2, file: !3, line: 467, type: !66, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "dev_debug", scope: !2, file: !3, line: 473, type: !75, isLocal: true, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !139, file: !140, line: 575, type: !66, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "oputs_", scope: !140, file: !140, line: 573, type: !141, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !143)
!140 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!141 = !DISubroutineType(types: !142)
!142 = !{null, !71, !71}
!143 = !{!144, !145, !146, !149, !150, !151, !152, !156, !157, !158, !159, !161, !217, !218, !219, !221, !222}
!144 = !DILocalVariable(name: "program", arg: 1, scope: !139, file: !140, line: 573, type: !71)
!145 = !DILocalVariable(name: "option", arg: 2, scope: !139, file: !140, line: 573, type: !71)
!146 = !DILocalVariable(name: "term", scope: !147, file: !140, line: 585, type: !71)
!147 = distinct !DILexicalBlock(scope: !148, file: !140, line: 582, column: 5)
!148 = distinct !DILexicalBlock(scope: !139, file: !140, line: 581, column: 7)
!149 = !DILocalVariable(name: "double_space", scope: !139, file: !140, line: 594, type: !75)
!150 = !DILocalVariable(name: "first_word", scope: !139, file: !140, line: 595, type: !71)
!151 = !DILocalVariable(name: "option_text", scope: !139, file: !140, line: 596, type: !71)
!152 = !DILocalVariable(name: "s", scope: !153, file: !140, line: 608, type: !71)
!153 = distinct !DILexicalBlock(scope: !154, file: !140, line: 605, column: 5)
!154 = distinct !DILexicalBlock(scope: !155, file: !140, line: 604, column: 12)
!155 = distinct !DILexicalBlock(scope: !139, file: !140, line: 597, column: 7)
!156 = !DILocalVariable(name: "spaces", scope: !153, file: !140, line: 609, type: !68)
!157 = !DILocalVariable(name: "anchor_len", scope: !139, file: !140, line: 620, type: !68)
!158 = !DILocalVariable(name: "desc_text", scope: !139, file: !140, line: 625, type: !71)
!159 = !DILocalVariable(name: "__ptr", scope: !160, file: !140, line: 644, type: !71)
!160 = distinct !DILexicalBlock(scope: !139, file: !140, line: 644, column: 3)
!161 = !DILocalVariable(name: "__stream", scope: !160, file: !140, line: 644, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !164, line: 7, baseType: !165)
!164 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !166, line: 49, size: 1728, elements: !167)
!166 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !183, !185, !186, !187, !191, !192, !194, !198, !201, !203, !206, !209, !210, !211, !212, !213}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !165, file: !166, line: 51, baseType: !66, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !165, file: !166, line: 54, baseType: !61, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !165, file: !166, line: 55, baseType: !61, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !165, file: !166, line: 56, baseType: !61, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !165, file: !166, line: 57, baseType: !61, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !165, file: !166, line: 58, baseType: !61, size: 64, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !165, file: !166, line: 59, baseType: !61, size: 64, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !165, file: !166, line: 60, baseType: !61, size: 64, offset: 448)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !165, file: !166, line: 61, baseType: !61, size: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !165, file: !166, line: 64, baseType: !61, size: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !165, file: !166, line: 65, baseType: !61, size: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !165, file: !166, line: 66, baseType: !61, size: 64, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !165, file: !166, line: 68, baseType: !181, size: 64, offset: 768)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !166, line: 36, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !165, file: !166, line: 70, baseType: !184, size: 64, offset: 832)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !165, file: !166, line: 72, baseType: !66, size: 32, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !165, file: !166, line: 73, baseType: !66, size: 32, offset: 928)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !165, file: !166, line: 74, baseType: !188, size: 64, offset: 960)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !189, line: 152, baseType: !190)
!189 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!190 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !165, file: !166, line: 77, baseType: !67, size: 16, offset: 1024)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !165, file: !166, line: 78, baseType: !193, size: 8, offset: 1040)
!193 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !165, file: !166, line: 79, baseType: !195, size: 8, offset: 1048)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 1)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !165, file: !166, line: 81, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !166, line: 43, baseType: null)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !165, file: !166, line: 89, baseType: !202, size: 64, offset: 1152)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !189, line: 153, baseType: !190)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !165, file: !166, line: 91, baseType: !204, size: 64, offset: 1216)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !166, line: 37, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !165, file: !166, line: 92, baseType: !207, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !166, line: 38, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !165, file: !166, line: 93, baseType: !184, size: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !165, file: !166, line: 94, baseType: !63, size: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !165, file: !166, line: 95, baseType: !68, size: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !165, file: !166, line: 96, baseType: !66, size: 32, offset: 1536)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !165, file: !166, line: 98, baseType: !214, size: 160, offset: 1568)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 160, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 20)
!217 = !DILocalVariable(name: "__cnt", scope: !160, file: !140, line: 644, type: !68)
!218 = !DILocalVariable(name: "url_program", scope: !139, file: !140, line: 648, type: !71)
!219 = !DILocalVariable(name: "__ptr", scope: !220, file: !140, line: 686, type: !71)
!220 = distinct !DILexicalBlock(scope: !139, file: !140, line: 686, column: 3)
!221 = !DILocalVariable(name: "__stream", scope: !220, file: !140, line: 686, type: !162)
!222 = !DILocalVariable(name: "__cnt", scope: !220, file: !140, line: 686, type: !68)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 486, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1792, elements: !235)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !228, line: 50, size: 256, elements: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!229 = !{!230, !231, !232, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !228, line: 52, baseType: !71, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !227, file: !228, line: 55, baseType: !66, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !227, file: !228, line: 56, baseType: !233, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !227, file: !228, line: 57, baseType: !66, size: 32, offset: 192)
!235 = !{!236}
!236 = !DISubrange(count: 7)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "mode_info", scope: !2, file: !3, line: 203, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 23040, elements: !248)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mode_info", file: !3, line: 194, size: 256, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !3, line: 196, baseType: !71, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !241, file: !3, line: 197, baseType: !45, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !3, line: 198, baseType: !62, size: 8, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !241, file: !3, line: 199, baseType: !70, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !241, file: !3, line: 200, baseType: !70, size: 64, offset: 192)
!248 = !{!249}
!249 = !DISubrange(count: 90)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "control_info", scope: !2, file: !3, line: 389, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 3648, elements: !259)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_info", file: !3, line: 380, size: 192, elements: !255)
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !254, file: !3, line: 382, baseType: !71, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "saneval", scope: !254, file: !3, line: 383, baseType: !76, size: 8, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !254, file: !3, line: 384, baseType: !68, size: 64, offset: 128)
!259 = !{!260}
!260 = !DISubrange(count: 19)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "last_ibaud", scope: !2, file: !3, line: 476, type: !73, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "last_obaud", scope: !2, file: !3, line: 477, type: !73, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "buf", scope: !267, file: !3, line: 2274, type: !273, isLocal: true, isDefinition: true)
!267 = distinct !DISubprogram(name: "visible", scope: !3, file: !3, line: 2272, type: !268, scopeLine: 2273, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !270)
!268 = !DISubroutineType(types: !269)
!269 = !{!71, !76}
!270 = !{!271, !272}
!271 = !DILocalVariable(name: "ch", arg: 1, scope: !267, file: !3, line: 2272, type: !76)
!272 = !DILocalVariable(name: "bpout", scope: !267, file: !3, line: 2275, type: !61)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 80, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 10)
!276 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "Version", scope: !279, file: !280, line: 3, type: !71, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !281, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!281 = !{!277}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "file_name", scope: !284, file: !285, line: 45, type: !71, isLocal: true, isDefinition: true)
!284 = distinct !DICompileUnit(language: DW_LANG_C99, file: !285, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !286, splitDebugInlining: false, nameTableKind: None)
!285 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!286 = !{!282, !287}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !284, file: !285, line: 55, type: !75, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !291, file: !292, line: 66, type: !327, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!293 = !{!63, !65}
!294 = !{!295, !321, !289, !323, !325}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "old_file_name", scope: !297, file: !292, line: 304, type: !71, isLocal: true, isDefinition: true)
!297 = distinct !DISubprogram(name: "verror_at_line", scope: !292, file: !292, line: 298, type: !298, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !291, retainedNodes: !314)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !66, !66, !71, !6, !71, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !301, line: 52, baseType: !302)
!301 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !303, line: 32, baseType: !304)
!303 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !305, baseType: !306)
!305 = !DIFile(filename: "lib/error.c", directory: "/src")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !307, size: 256, elements: !308)
!307 = !DINamespace(name: "std", scope: null)
!308 = !{!309, !310, !311, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !306, file: !305, baseType: !63, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !306, file: !305, baseType: !63, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !306, file: !305, baseType: !63, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !306, file: !305, baseType: !66, size: 32, offset: 192)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !306, file: !305, baseType: !66, size: 32, offset: 224)
!314 = !{!315, !316, !317, !318, !319, !320}
!315 = !DILocalVariable(name: "status", arg: 1, scope: !297, file: !292, line: 298, type: !66)
!316 = !DILocalVariable(name: "errnum", arg: 2, scope: !297, file: !292, line: 298, type: !66)
!317 = !DILocalVariable(name: "file_name", arg: 3, scope: !297, file: !292, line: 298, type: !71)
!318 = !DILocalVariable(name: "line_number", arg: 4, scope: !297, file: !292, line: 298, type: !6)
!319 = !DILocalVariable(name: "message", arg: 5, scope: !297, file: !292, line: 298, type: !71)
!320 = !DILocalVariable(name: "args", arg: 6, scope: !297, file: !292, line: 298, type: !300)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "old_line_number", scope: !297, file: !292, line: 305, type: !6, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "error_message_count", scope: !291, file: !292, line: 69, type: !6, isLocal: false, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !291, file: !292, line: 295, type: !66, isLocal: false, isDefinition: true)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{null}
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !332, file: !333, line: 506, type: !66, isLocal: true, isDefinition: true)
!332 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !333, file: !333, line: 485, type: !334, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !336, retainedNodes: !338)
!333 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!334 = !DISubroutineType(types: !335)
!335 = !{!66, !66, !66}
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !333, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !337, splitDebugInlining: false, nameTableKind: None)
!337 = !{!330}
!338 = !{!339, !340, !341, !342, !345}
!339 = !DILocalVariable(name: "fd", arg: 1, scope: !332, file: !333, line: 485, type: !66)
!340 = !DILocalVariable(name: "target", arg: 2, scope: !332, file: !333, line: 485, type: !66)
!341 = !DILocalVariable(name: "result", scope: !332, file: !333, line: 487, type: !66)
!342 = !DILocalVariable(name: "flags", scope: !343, file: !333, line: 530, type: !66)
!343 = distinct !DILexicalBlock(scope: !344, file: !333, line: 529, column: 5)
!344 = distinct !DILexicalBlock(scope: !332, file: !333, line: 528, column: 7)
!345 = !DILocalVariable(name: "saved_errno", scope: !346, file: !333, line: 533, type: !66)
!346 = distinct !DILexicalBlock(scope: !347, file: !333, line: 532, column: 9)
!347 = distinct !DILexicalBlock(scope: !343, file: !333, line: 531, column: 11)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "program_name", scope: !350, file: !351, line: 31, type: !71, isLocal: false, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !352, globals: !353, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!352 = !{!61}
!353 = !{!348}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "utf07FF", scope: !356, file: !357, line: 46, type: !387, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "proper_name_lite", scope: !357, file: !357, line: 38, type: !358, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !362)
!357 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!358 = !DISubroutineType(types: !359)
!359 = !{!71, !71, !71}
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !361, splitDebugInlining: false, nameTableKind: None)
!361 = !{!354}
!362 = !{!363, !364, !365, !366, !371}
!363 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !356, file: !357, line: 38, type: !71)
!364 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !356, file: !357, line: 38, type: !71)
!365 = !DILocalVariable(name: "translation", scope: !356, file: !357, line: 40, type: !71)
!366 = !DILocalVariable(name: "w", scope: !356, file: !357, line: 47, type: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !368, line: 37, baseType: !369)
!368 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !189, line: 57, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !189, line: 42, baseType: !6)
!371 = !DILocalVariable(name: "mbs", scope: !356, file: !357, line: 48, type: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !373, line: 6, baseType: !374)
!373 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !375, line: 21, baseType: !376)
!375 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 13, size: 64, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !376, file: !375, line: 15, baseType: !66, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !376, file: !375, line: 20, baseType: !380, size: 32, offset: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !376, file: !375, line: 16, size: 32, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !380, file: !375, line: 18, baseType: !6, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !380, file: !375, line: 19, baseType: !384, size: 32)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 32, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 4)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 16, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !392, file: !393, line: 76, type: !459, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !400, globals: !401, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!394 = !{!11, !395, !25}
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !12, line: 254, baseType: !6, size: 32, elements: !396)
!396 = !{!397, !398, !399}
!397 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!398 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!399 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!400 = !{!66, !67, !68}
!401 = !{!390, !402, !406, !418, !420, !425, !448, !455, !457}
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !392, file: !393, line: 92, type: !404, isLocal: false, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 320, elements: !274)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !392, file: !393, line: 1040, type: !408, isLocal: false, isDefinition: true)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !393, line: 56, size: 448, elements: !409)
!409 = !{!410, !411, !412, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !408, file: !393, line: 59, baseType: !11, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !393, line: 62, baseType: !66, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !408, file: !393, line: 66, baseType: !413, size: 256, offset: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !408, file: !393, line: 69, baseType: !71, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !408, file: !393, line: 72, baseType: !71, size: 64, offset: 384)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !392, file: !393, line: 107, type: !408, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "slot0", scope: !392, file: !393, line: 831, type: !422, isLocal: true, isDefinition: true)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2048, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 256)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "quote", scope: !427, file: !393, line: 228, type: !446, isLocal: true, isDefinition: true)
!427 = distinct !DISubprogram(name: "gettext_quote", scope: !393, file: !393, line: 197, type: !428, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !392, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!71, !71, !11}
!430 = !{!431, !432, !433, !434, !435}
!431 = !DILocalVariable(name: "msgid", arg: 1, scope: !427, file: !393, line: 197, type: !71)
!432 = !DILocalVariable(name: "s", arg: 2, scope: !427, file: !393, line: 197, type: !11)
!433 = !DILocalVariable(name: "translation", scope: !427, file: !393, line: 199, type: !71)
!434 = !DILocalVariable(name: "w", scope: !427, file: !393, line: 229, type: !367)
!435 = !DILocalVariable(name: "mbs", scope: !427, file: !393, line: 230, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !373, line: 6, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !375, line: 21, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 13, size: 64, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !438, file: !375, line: 15, baseType: !66, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !438, file: !375, line: 20, baseType: !442, size: 32, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !438, file: !375, line: 16, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !442, file: !375, line: 18, baseType: !6, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !442, file: !375, line: 19, baseType: !384, size: 32)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !447)
!447 = !{!389, !386}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "slotvec", scope: !392, file: !393, line: 834, type: !450, isLocal: true, isDefinition: true)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !393, line: 823, size: 128, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !393, line: 825, baseType: !68, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !451, file: !393, line: 826, baseType: !61, size: 64, offset: 64)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "nslots", scope: !392, file: !393, line: 832, type: !66, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "slotvec0", scope: !392, file: !393, line: 833, type: !451, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 704, elements: !461)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!461 = !{!462}
!462 = !DISubrange(count: 11)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !465, file: !466, line: 26, type: !468, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!467 = !{!463}
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 376, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 47)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "exit_failure", scope: !473, file: !474, line: 24, type: !476, isLocal: false, isDefinition: true)
!473 = distinct !DICompileUnit(language: DW_LANG_C99, file: !474, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !475, splitDebugInlining: false, nameTableKind: None)
!474 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!475 = !{!471}
!476 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "internal_state", scope: !479, file: !480, line: 97, type: !483, isLocal: true, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!481 = !{!63, !68, !65}
!482 = !{!477}
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !373, line: 6, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !375, line: 21, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !375, line: 13, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !485, file: !375, line: 15, baseType: !66, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !485, file: !375, line: 20, baseType: !489, size: 32, offset: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !485, file: !375, line: 16, size: 32, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !489, file: !375, line: 18, baseType: !6, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !489, file: !375, line: 19, baseType: !384, size: 32)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !495, file: !496, line: 211, type: !681, isLocal: true, isDefinition: true)
!495 = distinct !DISubprogram(name: "printf_fetchargs", scope: !496, file: !496, line: 42, type: !497, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !672, retainedNodes: !676)
!496 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!497 = !DISubroutineType(types: !498)
!498 = !{!66, !499, !509}
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !303, line: 14, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !501, baseType: !502)
!501 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !307, size: 256, elements: !503)
!503 = !{!504, !505, !506, !507, !508}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !502, file: !501, baseType: !63, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !502, file: !501, baseType: !63, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !502, file: !501, baseType: !63, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !502, file: !501, baseType: !66, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !502, file: !501, baseType: !66, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !511, line: 185, baseType: !512)
!511 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 179, size: 1920, elements: !513)
!513 = !{!514, !515, !670}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !512, file: !511, line: 181, baseType: !68, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !512, file: !511, line: 182, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !511, line: 174, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 111, size: 256, elements: !519)
!519 = !{!520, !571}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !518, file: !511, line: 113, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !511, line: 108, baseType: !522)
!522 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 47, baseType: !6, size: 32, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!524 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!525 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!526 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!527 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!528 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!529 = !DIEnumerator(name: "TYPE_INT", value: 5)
!530 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!531 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!532 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!533 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!534 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!535 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!536 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!537 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!538 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!539 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!540 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!541 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!542 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!543 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!544 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!545 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!546 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!547 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!548 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!549 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!550 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!551 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!552 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!553 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!554 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!555 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!556 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!557 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!558 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!559 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!560 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!561 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!562 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!563 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!564 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!565 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!566 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!567 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!568 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!569 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!570 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !518, file: !511, line: 172, baseType: !572, size: 128, offset: 128)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !518, file: !511, line: 114, size: 128, elements: !573)
!573 = !{!574, !575, !576, !578, !579, !580, !581, !582, !583, !585, !587, !591, !595, !598, !601, !604, !606, !609, !612, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !635, !636, !639, !640, !644, !645, !647, !649, !650, !652, !654, !656, !658, !660, !662, !664, !666, !668}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !572, file: !511, line: 116, baseType: !193, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !572, file: !511, line: 117, baseType: !65, size: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !572, file: !511, line: 118, baseType: !577, size: 16)
!577 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !572, file: !511, line: 119, baseType: !67, size: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !572, file: !511, line: 120, baseType: !66, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !572, file: !511, line: 121, baseType: !6, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !572, file: !511, line: 122, baseType: !190, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !572, file: !511, line: 123, baseType: !70, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !572, file: !511, line: 124, baseType: !584, size: 64)
!584 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !572, file: !511, line: 125, baseType: !586, size: 64)
!586 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !572, file: !511, line: 126, baseType: !588, size: 8)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !589, line: 24, baseType: !590)
!589 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !189, line: 37, baseType: !193)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !572, file: !511, line: 127, baseType: !592, size: 8)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !593, line: 24, baseType: !594)
!593 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !189, line: 38, baseType: !65)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !572, file: !511, line: 128, baseType: !596, size: 16)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !589, line: 25, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !189, line: 39, baseType: !577)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !572, file: !511, line: 129, baseType: !599, size: 16)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !593, line: 25, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !189, line: 40, baseType: !67)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !572, file: !511, line: 130, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !589, line: 26, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !189, line: 41, baseType: !66)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !572, file: !511, line: 131, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !593, line: 26, baseType: !370)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !572, file: !511, line: 132, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !589, line: 27, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !189, line: 44, baseType: !190)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !572, file: !511, line: 133, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !593, line: 27, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !189, line: 45, baseType: !70)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !572, file: !511, line: 134, baseType: !613, size: 8)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !614, line: 58, baseType: !193)
!614 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!615 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !572, file: !511, line: 135, baseType: !616, size: 8)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !614, line: 71, baseType: !65)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !572, file: !511, line: 136, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !614, line: 60, baseType: !190)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !572, file: !511, line: 137, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !614, line: 73, baseType: !70)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !572, file: !511, line: 138, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !614, line: 61, baseType: !190)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !572, file: !511, line: 139, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !614, line: 74, baseType: !70)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !572, file: !511, line: 140, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !614, line: 62, baseType: !190)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !572, file: !511, line: 141, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !614, line: 75, baseType: !70)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !572, file: !511, line: 142, baseType: !630, size: 32)
!630 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !572, file: !511, line: 143, baseType: !632, size: 64)
!632 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !572, file: !511, line: 144, baseType: !634, size: 128)
!634 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !572, file: !511, line: 145, baseType: !66, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !572, file: !511, line: 147, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !638, line: 20, baseType: !6)
!638 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!639 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !572, file: !511, line: 149, baseType: !71, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !572, file: !511, line: 150, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !6)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !572, file: !511, line: 151, baseType: !63, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !572, file: !511, line: 152, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !572, file: !511, line: 153, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !572, file: !511, line: 154, baseType: !233, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !572, file: !511, line: 155, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !572, file: !511, line: 156, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !572, file: !511, line: 157, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !572, file: !511, line: 158, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !572, file: !511, line: 159, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !572, file: !511, line: 160, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !572, file: !511, line: 161, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !572, file: !511, line: 162, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !572, file: !511, line: 163, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !572, file: !511, line: 164, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !512, file: !511, line: 183, baseType: !671, size: 1792, offset: 128)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 1792, elements: !235)
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !674, globals: !675, splitDebugInlining: false, nameTableKind: None)
!673 = !{!522}
!674 = !{!63}
!675 = !{!493}
!676 = !{!677, !678, !679, !680}
!677 = !DILocalVariable(name: "args", arg: 1, scope: !495, file: !496, line: 42, type: !499)
!678 = !DILocalVariable(name: "a", arg: 2, scope: !495, file: !496, line: 42, type: !509)
!679 = !DILocalVariable(name: "i", scope: !495, file: !496, line: 44, type: !68)
!680 = !DILocalVariable(name: "ap", scope: !495, file: !496, line: 45, type: !516)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 224, elements: !235)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !688, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!688 = !{!689}
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !687, line: 40, baseType: !6, size: 32, elements: !690)
!690 = !{!691}
!691 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !725, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!694 = !{!695, !707}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !696, file: !693, line: 188, baseType: !6, size: 32, elements: !705)
!696 = distinct !DISubprogram(name: "x2nrealloc", scope: !693, file: !693, line: 176, type: !697, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !692, retainedNodes: !700)
!697 = !DISubroutineType(types: !698)
!698 = !{!63, !63, !699, !68}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!700 = !{!701, !702, !703, !704}
!701 = !DILocalVariable(name: "p", arg: 1, scope: !696, file: !693, line: 176, type: !63)
!702 = !DILocalVariable(name: "pn", arg: 2, scope: !696, file: !693, line: 176, type: !699)
!703 = !DILocalVariable(name: "s", arg: 3, scope: !696, file: !693, line: 176, type: !68)
!704 = !DILocalVariable(name: "n", scope: !696, file: !693, line: 178, type: !68)
!705 = !{!706}
!706 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !708, file: !693, line: 228, baseType: !6, size: 32, elements: !705)
!708 = distinct !DISubprogram(name: "xpalloc", scope: !693, file: !693, line: 223, type: !709, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !692, retainedNodes: !715)
!709 = !DISubroutineType(types: !710)
!710 = !{!63, !63, !711, !712, !714, !712}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !713, line: 130, baseType: !714)
!713 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !69, line: 35, baseType: !190)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724}
!716 = !DILocalVariable(name: "pa", arg: 1, scope: !708, file: !693, line: 223, type: !63)
!717 = !DILocalVariable(name: "pn", arg: 2, scope: !708, file: !693, line: 223, type: !711)
!718 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !708, file: !693, line: 223, type: !712)
!719 = !DILocalVariable(name: "n_max", arg: 4, scope: !708, file: !693, line: 223, type: !714)
!720 = !DILocalVariable(name: "s", arg: 5, scope: !708, file: !693, line: 223, type: !712)
!721 = !DILocalVariable(name: "n0", scope: !708, file: !693, line: 230, type: !712)
!722 = !DILocalVariable(name: "n", scope: !708, file: !693, line: 237, type: !712)
!723 = !DILocalVariable(name: "nbytes", scope: !708, file: !693, line: 248, type: !712)
!724 = !DILocalVariable(name: "adjusted_nbytes", scope: !708, file: !693, line: 252, type: !712)
!725 = !{!61, !63, !75, !190, !70}
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!730 = !{!52, !731}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !732, line: 24, baseType: !6, size: 32, elements: !733)
!732 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!733 = !{!734, !735, !736, !737}
!734 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!735 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!736 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!737 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!738 = distinct !DICompileUnit(language: DW_LANG_C99, file: !739, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !740, retainedTypes: !741, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/xstrtol.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a1112be551b7ea11a9f6293a4923a73")
!740 = !{!52}
!741 = !{!75, !190, !70}
!742 = distinct !DICompileUnit(language: DW_LANG_C99, file: !743, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !744, retainedTypes: !745, splitDebugInlining: false, nameTableKind: None)
!743 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!744 = !{!52, !25}
!745 = !{!66, !67, !61, !75, !70, !746}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !614, line: 102, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !189, line: 73, baseType: !70)
!748 = distinct !DICompileUnit(language: DW_LANG_C99, file: !749, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!749 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !753, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !755, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!755 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !757, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!757 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!760 = !{!75, !70, !63}
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !763, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!763 = !{!61, !68, !63, !71, !6}
!764 = distinct !DICompileUnit(language: DW_LANG_C99, file: !765, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!766 = distinct !DICompileUnit(language: DW_LANG_C99, file: !767, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !674, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!770 = distinct !DICompileUnit(language: DW_LANG_C99, file: !771, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !772, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!772 = !{!68, !773, !63, !828}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !511, line: 174, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 111, size: 256, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !775, file: !511, line: 113, baseType: !521, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !775, file: !511, line: 172, baseType: !779, size: 128, offset: 128)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !511, line: 114, size: 128, elements: !780)
!780 = !{!781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !779, file: !511, line: 116, baseType: !193, size: 8)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !779, file: !511, line: 117, baseType: !65, size: 8)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !779, file: !511, line: 118, baseType: !577, size: 16)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !779, file: !511, line: 119, baseType: !67, size: 16)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !779, file: !511, line: 120, baseType: !66, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !779, file: !511, line: 121, baseType: !6, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !779, file: !511, line: 122, baseType: !190, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !779, file: !511, line: 123, baseType: !70, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !779, file: !511, line: 124, baseType: !584, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !779, file: !511, line: 125, baseType: !586, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !779, file: !511, line: 126, baseType: !588, size: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !779, file: !511, line: 127, baseType: !592, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !779, file: !511, line: 128, baseType: !596, size: 16)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !779, file: !511, line: 129, baseType: !599, size: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !779, file: !511, line: 130, baseType: !602, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !779, file: !511, line: 131, baseType: !605, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !779, file: !511, line: 132, baseType: !607, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !779, file: !511, line: 133, baseType: !610, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !779, file: !511, line: 134, baseType: !613, size: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !779, file: !511, line: 135, baseType: !616, size: 8)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !779, file: !511, line: 136, baseType: !618, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !779, file: !511, line: 137, baseType: !620, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !779, file: !511, line: 138, baseType: !622, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !779, file: !511, line: 139, baseType: !624, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !779, file: !511, line: 140, baseType: !626, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !779, file: !511, line: 141, baseType: !628, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !779, file: !511, line: 142, baseType: !630, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !779, file: !511, line: 143, baseType: !632, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !779, file: !511, line: 144, baseType: !634, size: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !779, file: !511, line: 145, baseType: !66, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !779, file: !511, line: 147, baseType: !637, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !779, file: !511, line: 149, baseType: !71, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !779, file: !511, line: 150, baseType: !641, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !779, file: !511, line: 151, baseType: !63, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !779, file: !511, line: 152, baseType: !646, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !779, file: !511, line: 153, baseType: !648, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !779, file: !511, line: 154, baseType: !233, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !779, file: !511, line: 155, baseType: !651, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !779, file: !511, line: 156, baseType: !653, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !779, file: !511, line: 157, baseType: !655, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !779, file: !511, line: 158, baseType: !657, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !779, file: !511, line: 159, baseType: !659, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !779, file: !511, line: 160, baseType: !661, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !779, file: !511, line: 161, baseType: !663, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !779, file: !511, line: 162, baseType: !665, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !779, file: !511, line: 163, baseType: !667, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !779, file: !511, line: 164, baseType: !669, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !830, line: 67, baseType: !831)
!830 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !830, line: 53, size: 704, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !831, file: !830, line: 55, baseType: !71, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !831, file: !830, line: 56, baseType: !71, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !831, file: !830, line: 57, baseType: !66, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !831, file: !830, line: 58, baseType: !71, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !831, file: !830, line: 59, baseType: !71, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !831, file: !830, line: 60, baseType: !68, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !831, file: !830, line: 61, baseType: !71, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !831, file: !830, line: 62, baseType: !71, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !831, file: !830, line: 63, baseType: !68, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !831, file: !830, line: 64, baseType: !62, size: 8, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !831, file: !830, line: 65, baseType: !68, size: 64, offset: 640)
!844 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!845 = !{i32 7, !"Dwarf Version", i32 5}
!846 = !{i32 2, !"Debug Info Version", i32 3}
!847 = !{i32 1, !"wchar_size", i32 4}
!848 = !{i32 1, !"branch-target-enforcement", i32 0}
!849 = !{i32 1, !"sign-return-address", i32 0}
!850 = !{i32 1, !"sign-return-address-all", i32 0}
!851 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!852 = !{i32 7, !"PIC Level", i32 2}
!853 = !{i32 7, !"PIE Level", i32 2}
!854 = !{i32 7, !"uwtable", i32 1}
!855 = !{i32 7, !"frame-pointer", i32 1}
!856 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 536, type: !857, scopeLine: 537, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !859)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !66}
!859 = !{!860}
!860 = !DILocalVariable(name: "status", arg: 1, scope: !856, file: !3, line: 536, type: !66)
!861 = !DILocation(line: 0, scope: !856)
!862 = !DILocation(line: 538, column: 14, scope: !863)
!863 = distinct !DILexicalBlock(scope: !856, file: !3, line: 538, column: 7)
!864 = !DILocation(line: 538, column: 7, scope: !856)
!865 = !DILocation(line: 539, column: 5, scope: !866)
!866 = distinct !DILexicalBlock(scope: !863, file: !3, line: 539, column: 5)
!867 = !{!868, !868, i64 0}
!868 = !{!"any pointer", !869, i64 0}
!869 = !{!"omnipotent char", !870, i64 0}
!870 = !{!"Simple C/C++ TBAA"}
!871 = !DILocation(line: 542, column: 7, scope: !872)
!872 = distinct !DILexicalBlock(scope: !863, file: !3, line: 541, column: 5)
!873 = !DILocation(line: 548, column: 7, scope: !872)
!874 = !DILocation(line: 736, column: 3, scope: !875, inlinedAt: !877)
!875 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !140, file: !140, line: 734, type: !328, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !876)
!876 = !{}
!877 = distinct !DILocation(line: 552, column: 7, scope: !872)
!878 = !DILocation(line: 554, column: 7, scope: !872)
!879 = !DILocation(line: 557, column: 7, scope: !872)
!880 = !DILocation(line: 560, column: 7, scope: !872)
!881 = !DILocation(line: 563, column: 7, scope: !872)
!882 = !DILocation(line: 564, column: 7, scope: !872)
!883 = !DILocation(line: 565, column: 7, scope: !872)
!884 = !DILocation(line: 570, column: 7, scope: !872)
!885 = !DILocation(line: 574, column: 7, scope: !872)
!886 = !DILocation(line: 583, column: 7, scope: !872)
!887 = !DILocation(line: 588, column: 7, scope: !872)
!888 = !DILocation(line: 592, column: 7, scope: !872)
!889 = !DILocation(line: 598, column: 7, scope: !872)
!890 = !DILocation(line: 607, column: 7, scope: !872)
!891 = !DILocation(line: 611, column: 7, scope: !872)
!892 = !DILocation(line: 615, column: 7, scope: !872)
!893 = !DILocation(line: 621, column: 7, scope: !872)
!894 = !DILocation(line: 626, column: 7, scope: !872)
!895 = !DILocation(line: 630, column: 7, scope: !872)
!896 = !DILocation(line: 636, column: 7, scope: !872)
!897 = !DILocation(line: 641, column: 7, scope: !872)
!898 = !{!899, !899, i64 0}
!899 = !{!"int", !869, i64 0}
!900 = !DILocation(line: 644, column: 7, scope: !872)
!901 = !DILocation(line: 648, column: 7, scope: !872)
!902 = !DILocation(line: 652, column: 7, scope: !872)
!903 = !DILocation(line: 657, column: 7, scope: !872)
!904 = !DILocation(line: 662, column: 7, scope: !872)
!905 = !DILocation(line: 666, column: 7, scope: !872)
!906 = !DILocation(line: 673, column: 7, scope: !872)
!907 = !DILocation(line: 682, column: 7, scope: !872)
!908 = !DILocation(line: 685, column: 7, scope: !872)
!909 = !DILocation(line: 693, column: 7, scope: !872)
!910 = !DILocation(line: 697, column: 7, scope: !872)
!911 = !DILocation(line: 707, column: 7, scope: !872)
!912 = !DILocation(line: 711, column: 7, scope: !872)
!913 = !DILocation(line: 717, column: 7, scope: !872)
!914 = !DILocation(line: 722, column: 7, scope: !872)
!915 = !DILocation(line: 727, column: 7, scope: !872)
!916 = !DILocation(line: 731, column: 7, scope: !872)
!917 = !DILocation(line: 737, column: 7, scope: !872)
!918 = !DILocation(line: 742, column: 7, scope: !872)
!919 = !DILocation(line: 747, column: 7, scope: !872)
!920 = !DILocation(line: 752, column: 7, scope: !872)
!921 = !DILocation(line: 757, column: 7, scope: !872)
!922 = !DILocation(line: 762, column: 7, scope: !872)
!923 = !DILocation(line: 767, column: 7, scope: !872)
!924 = !DILocation(line: 772, column: 7, scope: !872)
!925 = !DILocation(line: 777, column: 7, scope: !872)
!926 = !DILocation(line: 782, column: 7, scope: !872)
!927 = !DILocation(line: 787, column: 7, scope: !872)
!928 = !DILocation(line: 792, column: 7, scope: !872)
!929 = !DILocation(line: 796, column: 7, scope: !872)
!930 = !DILocation(line: 800, column: 7, scope: !872)
!931 = !DILocation(line: 807, column: 7, scope: !872)
!932 = !DILocation(line: 811, column: 7, scope: !872)
!933 = !DILocation(line: 817, column: 7, scope: !872)
!934 = !DILocation(line: 823, column: 7, scope: !872)
!935 = !DILocation(line: 827, column: 7, scope: !872)
!936 = !DILocation(line: 831, column: 7, scope: !872)
!937 = !DILocation(line: 835, column: 7, scope: !872)
!938 = !DILocation(line: 840, column: 7, scope: !872)
!939 = !DILocation(line: 844, column: 7, scope: !872)
!940 = !DILocation(line: 848, column: 7, scope: !872)
!941 = !DILocation(line: 853, column: 7, scope: !872)
!942 = !DILocation(line: 858, column: 7, scope: !872)
!943 = !DILocation(line: 862, column: 7, scope: !872)
!944 = !DILocation(line: 873, column: 7, scope: !872)
!945 = !DILocation(line: 878, column: 7, scope: !872)
!946 = !DILocation(line: 883, column: 7, scope: !872)
!947 = !DILocation(line: 888, column: 7, scope: !872)
!948 = !DILocation(line: 892, column: 7, scope: !872)
!949 = !DILocation(line: 897, column: 7, scope: !872)
!950 = !DILocation(line: 901, column: 7, scope: !872)
!951 = !DILocation(line: 905, column: 7, scope: !872)
!952 = !DILocation(line: 910, column: 7, scope: !872)
!953 = !DILocation(line: 920, column: 7, scope: !872)
!954 = !DILocation(line: 935, column: 7, scope: !872)
!955 = !DILocation(line: 939, column: 7, scope: !872)
!956 = !DILocation(line: 945, column: 7, scope: !872)
!957 = !DILocation(line: 949, column: 7, scope: !872)
!958 = !DILocation(line: 953, column: 7, scope: !872)
!959 = !DILocation(line: 971, column: 7, scope: !872)
!960 = !DILocation(line: 978, column: 7, scope: !872)
!961 = !DILocation(line: 997, column: 7, scope: !872)
!962 = !DILocation(line: 1083, column: 7, scope: !872)
!963 = !DILocalVariable(name: "program", arg: 1, scope: !964, file: !140, line: 836, type: !71)
!964 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !140, file: !140, line: 836, type: !965, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !967)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !71}
!967 = !{!963, !968, !975, !976, !978, !979}
!968 = !DILocalVariable(name: "infomap", scope: !964, file: !140, line: 838, type: !969)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 896, elements: !235)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !964, file: !140, line: 838, size: 128, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !971, file: !140, line: 838, baseType: !71, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !971, file: !140, line: 838, baseType: !71, size: 64, offset: 64)
!975 = !DILocalVariable(name: "node", scope: !964, file: !140, line: 848, type: !71)
!976 = !DILocalVariable(name: "map_prog", scope: !964, file: !140, line: 849, type: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!978 = !DILocalVariable(name: "lc_messages", scope: !964, file: !140, line: 861, type: !71)
!979 = !DILocalVariable(name: "url_program", scope: !964, file: !140, line: 874, type: !71)
!980 = !DILocation(line: 0, scope: !964, inlinedAt: !981)
!981 = distinct !DILocation(line: 1090, column: 7, scope: !872)
!982 = !DILocation(line: 838, column: 3, scope: !964, inlinedAt: !981)
!983 = !DILocation(line: 838, column: 67, scope: !964, inlinedAt: !981)
!984 = !DILocation(line: 849, column: 36, scope: !964, inlinedAt: !981)
!985 = !DILocation(line: 851, column: 3, scope: !964, inlinedAt: !981)
!986 = !DILocalVariable(name: "__s1", arg: 1, scope: !987, file: !988, line: 1359, type: !71)
!987 = distinct !DISubprogram(name: "streq", scope: !988, file: !988, line: 1359, type: !989, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !991)
!988 = !DIFile(filename: "./lib/string.h", directory: "/src")
!989 = !DISubroutineType(types: !990)
!990 = !{!75, !71, !71}
!991 = !{!986, !992}
!992 = !DILocalVariable(name: "__s2", arg: 2, scope: !987, file: !988, line: 1359, type: !71)
!993 = !DILocation(line: 0, scope: !987, inlinedAt: !994)
!994 = distinct !DILocation(line: 851, column: 33, scope: !964, inlinedAt: !981)
!995 = !DILocation(line: 1361, column: 11, scope: !987, inlinedAt: !994)
!996 = !DILocation(line: 1361, column: 10, scope: !987, inlinedAt: !994)
!997 = !DILocation(line: 852, column: 13, scope: !964, inlinedAt: !981)
!998 = !DILocation(line: 851, column: 20, scope: !964, inlinedAt: !981)
!999 = !{!1000, !868, i64 0}
!1000 = !{!"infomap", !868, i64 0, !868, i64 8}
!1001 = !DILocation(line: 851, column: 10, scope: !964, inlinedAt: !981)
!1002 = !DILocation(line: 851, column: 28, scope: !964, inlinedAt: !981)
!1003 = distinct !{!1003, !985, !997, !1004}
!1004 = !{!"llvm.loop.mustprogress"}
!1005 = !DILocation(line: 854, column: 17, scope: !1006, inlinedAt: !981)
!1006 = distinct !DILexicalBlock(scope: !964, file: !140, line: 854, column: 7)
!1007 = !{!1000, !868, i64 8}
!1008 = !DILocation(line: 854, column: 7, scope: !1006, inlinedAt: !981)
!1009 = !DILocation(line: 854, column: 7, scope: !964, inlinedAt: !981)
!1010 = !DILocation(line: 857, column: 3, scope: !964, inlinedAt: !981)
!1011 = !DILocation(line: 861, column: 29, scope: !964, inlinedAt: !981)
!1012 = !DILocation(line: 862, column: 7, scope: !1013, inlinedAt: !981)
!1013 = distinct !DILexicalBlock(scope: !964, file: !140, line: 862, column: 7)
!1014 = !DILocation(line: 862, column: 19, scope: !1013, inlinedAt: !981)
!1015 = !DILocation(line: 862, column: 22, scope: !1013, inlinedAt: !981)
!1016 = !DILocation(line: 862, column: 7, scope: !964, inlinedAt: !981)
!1017 = !DILocation(line: 868, column: 7, scope: !1018, inlinedAt: !981)
!1018 = distinct !DILexicalBlock(scope: !1013, file: !140, line: 863, column: 5)
!1019 = !DILocation(line: 870, column: 5, scope: !1018, inlinedAt: !981)
!1020 = !DILocation(line: 0, scope: !987, inlinedAt: !1021)
!1021 = distinct !DILocation(line: 874, column: 29, scope: !964, inlinedAt: !981)
!1022 = !DILocation(line: 875, column: 3, scope: !964, inlinedAt: !981)
!1023 = !DILocation(line: 877, column: 3, scope: !964, inlinedAt: !981)
!1024 = !DILocation(line: 879, column: 1, scope: !964, inlinedAt: !981)
!1025 = !DILocation(line: 1092, column: 3, scope: !856)
!1026 = !DISubprogram(name: "dcgettext", scope: !1027, file: !1027, line: 51, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !876)
!1027 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!61, !71, !71, !66}
!1030 = !DISubprogram(name: "fputs_unlocked", scope: !301, file: !301, line: 691, type: !1031, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !876)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!66, !1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!1034 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !162)
!1035 = !DILocation(line: 0, scope: !139)
!1036 = !DILocation(line: 581, column: 7, scope: !148)
!1037 = !DILocation(line: 581, column: 19, scope: !148)
!1038 = !DILocation(line: 581, column: 7, scope: !139)
!1039 = !DILocation(line: 585, column: 26, scope: !147)
!1040 = !DILocation(line: 0, scope: !147)
!1041 = !DILocation(line: 586, column: 23, scope: !147)
!1042 = !DILocation(line: 586, column: 28, scope: !147)
!1043 = !DILocation(line: 586, column: 32, scope: !147)
!1044 = !{!869, !869, i64 0}
!1045 = !DILocation(line: 586, column: 38, scope: !147)
!1046 = !DILocation(line: 0, scope: !987, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 586, column: 41, scope: !147)
!1048 = !DILocation(line: 1361, column: 11, scope: !987, inlinedAt: !1047)
!1049 = !DILocation(line: 1361, column: 10, scope: !987, inlinedAt: !1047)
!1050 = !DILocation(line: 586, column: 19, scope: !147)
!1051 = !DILocation(line: 587, column: 5, scope: !147)
!1052 = !DILocation(line: 588, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !139, file: !140, line: 588, column: 7)
!1054 = !DILocation(line: 588, column: 7, scope: !139)
!1055 = !DILocation(line: 590, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1053, file: !140, line: 589, column: 5)
!1057 = !DILocation(line: 591, column: 7, scope: !1056)
!1058 = !DILocation(line: 595, column: 37, scope: !139)
!1059 = !DILocation(line: 595, column: 35, scope: !139)
!1060 = !DILocation(line: 596, column: 29, scope: !139)
!1061 = !DILocation(line: 597, column: 8, scope: !155)
!1062 = !DILocation(line: 597, column: 7, scope: !139)
!1063 = !DILocation(line: 604, column: 24, scope: !154)
!1064 = !DILocation(line: 604, column: 12, scope: !155)
!1065 = !DILocation(line: 0, scope: !153)
!1066 = !DILocation(line: 610, column: 16, scope: !153)
!1067 = !DILocation(line: 610, column: 7, scope: !153)
!1068 = !DILocation(line: 611, column: 21, scope: !153)
!1069 = !{!1070, !1070, i64 0}
!1070 = !{!"short", !869, i64 0}
!1071 = !DILocation(line: 611, column: 19, scope: !153)
!1072 = !DILocation(line: 611, column: 16, scope: !153)
!1073 = !DILocation(line: 610, column: 30, scope: !153)
!1074 = distinct !{!1074, !1067, !1068, !1004}
!1075 = !DILocation(line: 612, column: 18, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !153, file: !140, line: 612, column: 11)
!1077 = !DILocation(line: 612, column: 11, scope: !153)
!1078 = !DILocation(line: 620, column: 23, scope: !139)
!1079 = !DILocation(line: 625, column: 39, scope: !139)
!1080 = !DILocation(line: 626, column: 3, scope: !139)
!1081 = !DILocation(line: 626, column: 10, scope: !139)
!1082 = !DILocation(line: 626, column: 21, scope: !139)
!1083 = !DILocation(line: 628, column: 44, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !140, line: 628, column: 11)
!1085 = distinct !DILexicalBlock(scope: !139, file: !140, line: 627, column: 5)
!1086 = !DILocation(line: 628, column: 32, scope: !1084)
!1087 = !DILocation(line: 628, column: 49, scope: !1084)
!1088 = !DILocation(line: 628, column: 11, scope: !1085)
!1089 = !DILocation(line: 630, column: 11, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !140, line: 630, column: 11)
!1091 = !DILocation(line: 630, column: 11, scope: !1085)
!1092 = !DILocation(line: 632, column: 26, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !140, line: 632, column: 15)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !140, line: 631, column: 9)
!1095 = !DILocation(line: 632, column: 34, scope: !1093)
!1096 = !DILocation(line: 632, column: 37, scope: !1093)
!1097 = !DILocation(line: 632, column: 15, scope: !1094)
!1098 = !DILocation(line: 636, column: 29, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1094, file: !140, line: 636, column: 15)
!1100 = !DILocation(line: 640, column: 16, scope: !1085)
!1101 = distinct !{!1101, !1080, !1102, !1004}
!1102 = !DILocation(line: 641, column: 5, scope: !139)
!1103 = !DILocation(line: 644, column: 3, scope: !139)
!1104 = !DILocation(line: 0, scope: !987, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 648, column: 31, scope: !139)
!1106 = !DILocation(line: 0, scope: !987, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 649, column: 31, scope: !139)
!1108 = !DILocation(line: 0, scope: !987, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 650, column: 31, scope: !139)
!1110 = !DILocation(line: 0, scope: !987, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 651, column: 31, scope: !139)
!1112 = !DILocation(line: 0, scope: !987, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 652, column: 31, scope: !139)
!1114 = !DILocation(line: 0, scope: !987, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 653, column: 31, scope: !139)
!1116 = !DILocation(line: 0, scope: !987, inlinedAt: !1117)
!1117 = distinct !DILocation(line: 654, column: 31, scope: !139)
!1118 = !DILocation(line: 0, scope: !987, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 655, column: 31, scope: !139)
!1120 = !DILocation(line: 0, scope: !987, inlinedAt: !1121)
!1121 = distinct !DILocation(line: 656, column: 31, scope: !139)
!1122 = !DILocation(line: 0, scope: !987, inlinedAt: !1123)
!1123 = distinct !DILocation(line: 657, column: 31, scope: !139)
