; ModuleID = 'src/sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.lconv = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@.str = private unnamed_addr constant [9 x i8] c"%05d %5s\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c" %s\00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"%d %s\00", align 1
@.str.3 = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1.4 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1

!53 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !54, line: 44, baseType: !6, size: 32, elements: !55)
!54 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!55 = !{!56, !57, !58, !59, !60, !61}
!56 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!57 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!58 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!59 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!60 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!61 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!62 = !{!63, !65, !66, !67, !68, !70, !72, !73}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !44)
!69 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!72 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!74 = !{!75, !78, !84, !86, !88, !0, !171, !173, !175, !177, !179, !181, !183, !185, !187, !202, !215}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 194, type: !77, isLocal: true, isDefinition: true)
!77 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !2, file: !3, line: 197, type: !80, isLocal: true, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !81, line: 130, baseType: !82)
!81 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !69, line: 35, baseType: !83)
!83 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !2, file: !3, line: 200, type: !80, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "sum_algorithm", scope: !2, file: !3, line: 253, type: !5, isLocal: true, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !90, file: !40, line: 575, type: !66, isLocal: true, isDefinition: true)
!90 = distinct !DISubprogram(name: "oputs_", scope: !40, file: !40, line: 573, type: !91, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !93)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !70, !70}
!93 = !{!94, !95, !96, !99, !100, !101, !102, !106, !107, !108, !109, !111, !165, !166, !167, !169, !170}
!94 = !DILocalVariable(name: "program", arg: 1, scope: !90, file: !40, line: 573, type: !70)
!95 = !DILocalVariable(name: "option", arg: 2, scope: !90, file: !40, line: 573, type: !70)
!96 = !DILocalVariable(name: "term", scope: !97, file: !40, line: 585, type: !70)
!97 = distinct !DILexicalBlock(scope: !98, file: !40, line: 582, column: 5)
!98 = distinct !DILexicalBlock(scope: !90, file: !40, line: 581, column: 7)
!99 = !DILocalVariable(name: "double_space", scope: !90, file: !40, line: 594, type: !77)
!100 = !DILocalVariable(name: "first_word", scope: !90, file: !40, line: 595, type: !70)
!101 = !DILocalVariable(name: "option_text", scope: !90, file: !40, line: 596, type: !70)
!102 = !DILocalVariable(name: "s", scope: !103, file: !40, line: 608, type: !70)
!103 = distinct !DILexicalBlock(scope: !104, file: !40, line: 605, column: 5)
!104 = distinct !DILexicalBlock(scope: !105, file: !40, line: 604, column: 12)
!105 = distinct !DILexicalBlock(scope: !90, file: !40, line: 597, column: 7)
!106 = !DILocalVariable(name: "spaces", scope: !103, file: !40, line: 609, type: !68)
!107 = !DILocalVariable(name: "anchor_len", scope: !90, file: !40, line: 620, type: !68)
!108 = !DILocalVariable(name: "desc_text", scope: !90, file: !40, line: 625, type: !70)
!109 = !DILocalVariable(name: "__ptr", scope: !110, file: !40, line: 644, type: !70)
!110 = distinct !DILexicalBlock(scope: !90, file: !40, line: 644, column: 3)
!111 = !DILocalVariable(name: "__stream", scope: !110, file: !40, line: 644, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !114, line: 7, baseType: !115)
!114 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !117)
!116 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !133, !135, !136, !137, !139, !140, !142, !146, !149, !151, !154, !157, !158, !159, !160, !161}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !115, file: !116, line: 51, baseType: !66, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !115, file: !116, line: 54, baseType: !63, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !115, file: !116, line: 55, baseType: !63, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !115, file: !116, line: 56, baseType: !63, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !115, file: !116, line: 57, baseType: !63, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !115, file: !116, line: 58, baseType: !63, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !115, file: !116, line: 59, baseType: !63, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !115, file: !116, line: 60, baseType: !63, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !115, file: !116, line: 61, baseType: !63, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !115, file: !116, line: 64, baseType: !63, size: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !115, file: !116, line: 65, baseType: !63, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !115, file: !116, line: 66, baseType: !63, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !115, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !116, line: 36, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !115, file: !116, line: 70, baseType: !134, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !115, file: !116, line: 72, baseType: !66, size: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !115, file: !116, line: 73, baseType: !66, size: 32, offset: 928)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !115, file: !116, line: 74, baseType: !138, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !48, line: 152, baseType: !83)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !115, file: !116, line: 77, baseType: !67, size: 16, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !115, file: !116, line: 78, baseType: !141, size: 8, offset: 1040)
!141 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !115, file: !116, line: 79, baseType: !143, size: 8, offset: 1048)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 1)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !115, file: !116, line: 81, baseType: !147, size: 64, offset: 1088)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !116, line: 43, baseType: null)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !115, file: !116, line: 89, baseType: !150, size: 64, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !48, line: 153, baseType: !83)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !115, file: !116, line: 91, baseType: !152, size: 64, offset: 1216)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !116, line: 37, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !115, file: !116, line: 92, baseType: !155, size: 64, offset: 1280)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !116, line: 38, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !115, file: !116, line: 93, baseType: !134, size: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !115, file: !116, line: 94, baseType: !65, size: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !115, file: !116, line: 95, baseType: !68, size: 64, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !115, file: !116, line: 96, baseType: !66, size: 32, offset: 1536)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !115, file: !116, line: 98, baseType: !162, size: 160, offset: 1568)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 160, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 20)
!165 = !DILocalVariable(name: "__cnt", scope: !110, file: !40, line: 644, type: !68)
!166 = !DILocalVariable(name: "url_program", scope: !90, file: !40, line: 648, type: !70)
!167 = !DILocalVariable(name: "__ptr", scope: !168, file: !40, line: 686, type: !70)
!168 = distinct !DILexicalBlock(scope: !90, file: !40, line: 686, column: 3)
!169 = !DILocalVariable(name: "__stream", scope: !168, file: !40, line: 686, type: !112)
!170 = !DILocalVariable(name: "__cnt", scope: !168, file: !40, line: 686, type: !68)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 224, type: !72, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 211, type: !77, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 204, type: !77, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 208, type: !77, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 214, type: !77, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 218, type: !77, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "raw_digest", scope: !2, file: !3, line: 232, type: !77, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 221, type: !66, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "bin2hex", scope: !189, file: !3, line: 1345, type: !199, isLocal: true, isDefinition: true)
!189 = distinct !DISubprogram(name: "hex_equal", scope: !3, file: !3, line: 1343, type: !190, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !194)
!190 = !DISubroutineType(types: !191)
!191 = !{!77, !192, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!194 = !{!195, !196, !197, !198}
!195 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !189, file: !3, line: 1343, type: !192)
!196 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !189, file: !3, line: 1343, type: !192)
!197 = !DILocalVariable(name: "digest_bin_bytes", scope: !189, file: !3, line: 1349, type: !80)
!198 = !DILocalVariable(name: "cnt", scope: !189, file: !3, line: 1353, type: !80)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 16)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "sumfns", scope: !2, file: !3, line: 254, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 128, elements: !213)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !206, line: 7, baseType: !207)
!206 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!66, !112, !65, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !46, line: 101, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !48, line: 72, baseType: !83)
!213 = !{!214}
!214 = !DISubrange(count: 2)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "sum_output_fns", scope: !2, file: !3, line: 259, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 128, elements: !213)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 244, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !70, !66, !222, !77, !77, !72, !77, !211}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 1024, elements: !234)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !227, line: 50, size: 256, elements: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!228 = !{!229, !230, !231, !233}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !226, file: !227, line: 52, baseType: !70, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !226, file: !227, line: 55, baseType: !66, size: 32, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !227, line: 56, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !226, file: !227, line: 57, baseType: !66, size: 32, offset: 192)
!234 = !{!235}
!235 = !DISubrange(count: 4)
!236 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!237 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "Version", scope: !240, file: !241, line: 3, type: !70, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !242, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!242 = !{!238}
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "file_name", scope: !245, file: !246, line: 45, type: !70, isLocal: true, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !247, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!247 = !{!243, !248}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !245, file: !246, line: 55, type: !77, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !252, file: !253, line: 66, type: !288, isLocal: false, isDefinition: true)
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !254, globals: !255, splitDebugInlining: false, nameTableKind: None)
!253 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!254 = !{!65, !72}
!255 = !{!256, !282, !250, !284, !286}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "old_file_name", scope: !258, file: !253, line: 304, type: !70, isLocal: true, isDefinition: true)
!258 = distinct !DISubprogram(name: "verror_at_line", scope: !253, file: !253, line: 298, type: !259, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !252, retainedNodes: !275)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !66, !66, !70, !6, !70, !261}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !262, line: 52, baseType: !263)
!262 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !264, line: 32, baseType: !265)
!264 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !266, baseType: !267)
!266 = !DIFile(filename: "lib/error.c", directory: "/src")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !268, size: 256, elements: !269)
!268 = !DINamespace(name: "std", scope: null)
!269 = !{!270, !271, !272, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !267, file: !266, baseType: !65, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !267, file: !266, baseType: !65, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !267, file: !266, baseType: !65, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !267, file: !266, baseType: !66, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !267, file: !266, baseType: !66, size: 32, offset: 224)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DILocalVariable(name: "status", arg: 1, scope: !258, file: !253, line: 298, type: !66)
!277 = !DILocalVariable(name: "errnum", arg: 2, scope: !258, file: !253, line: 298, type: !66)
!278 = !DILocalVariable(name: "file_name", arg: 3, scope: !258, file: !253, line: 298, type: !70)
!279 = !DILocalVariable(name: "line_number", arg: 4, scope: !258, file: !253, line: 298, type: !6)
!280 = !DILocalVariable(name: "message", arg: 5, scope: !258, file: !253, line: 298, type: !70)
!281 = !DILocalVariable(name: "args", arg: 6, scope: !258, file: !253, line: 298, type: !261)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "old_line_number", scope: !258, file: !253, line: 305, type: !6, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "error_message_count", scope: !252, file: !253, line: 69, type: !6, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !252, file: !253, line: 295, type: !66, isLocal: false, isDefinition: true)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "power_letter", scope: !293, file: !294, line: 36, type: !329, isLocal: true, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C99, file: !294, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !295, retainedTypes: !317, globals: !318, splitDebugInlining: false, nameTableKind: None)
!294 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!295 = !{!296, !309}
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 47, baseType: !6, size: 32, elements: !298)
!297 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!299 = !DIEnumerator(name: "human_ceiling", value: 0)
!300 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!301 = !DIEnumerator(name: "human_floor", value: 2)
!302 = !DIEnumerator(name: "human_group_digits", value: 4)
!303 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!304 = !DIEnumerator(name: "human_autoscale", value: 16)
!305 = !DIEnumerator(name: "human_base_1024", value: 32)
!306 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!307 = !DIEnumerator(name: "human_SI", value: 128)
!308 = !DIEnumerator(name: "human_B", value: 256)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !310, line: 30, baseType: !6, size: 32, elements: !311)
!310 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!311 = !{!312, !313, !314, !315, !316}
!312 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!313 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!314 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!315 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!316 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!317 = !{!222}
!318 = !{!291, !319, !325}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "block_size_args", scope: !293, file: !294, line: 398, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 192, elements: !323)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!323 = !{!324}
!324 = !DISubrange(count: 3)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !293, file: !294, line: 399, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !213)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 88, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 11)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "program_name", scope: !334, file: !335, line: 31, type: !70, isLocal: false, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C99, file: !335, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !336, globals: !337, splitDebugInlining: false, nameTableKind: None)
!335 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!336 = !{!63}
!337 = !{!332}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "utf07FF", scope: !340, file: !341, line: 46, type: !369, isLocal: true, isDefinition: true)
!340 = distinct !DISubprogram(name: "proper_name_lite", scope: !341, file: !341, line: 38, type: !342, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !344, retainedNodes: !346)
!341 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!342 = !DISubroutineType(types: !343)
!343 = !{!70, !70, !70}
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !341, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !345, splitDebugInlining: false, nameTableKind: None)
!345 = !{!338}
!346 = !{!347, !348, !349, !350, !355}
!347 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !340, file: !341, line: 38, type: !70)
!348 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !340, file: !341, line: 38, type: !70)
!349 = !DILocalVariable(name: "translation", scope: !340, file: !341, line: 40, type: !70)
!350 = !DILocalVariable(name: "w", scope: !340, file: !341, line: 47, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !352, line: 37, baseType: !353)
!352 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !48, line: 57, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !48, line: 42, baseType: !6)
!355 = !DILocalVariable(name: "mbs", scope: !340, file: !341, line: 48, type: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !357, line: 6, baseType: !358)
!357 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !359, line: 21, baseType: !360)
!359 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 13, size: 64, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !360, file: !359, line: 15, baseType: !66, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !360, file: !359, line: 20, baseType: !364, size: 32, offset: 32)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !360, file: !359, line: 16, size: 32, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !364, file: !359, line: 18, baseType: !6, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !364, file: !359, line: 19, baseType: !368, size: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !234)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16, elements: !213)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !372, file: !373, line: 76, type: !441, isLocal: false, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C99, file: !373, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !374, retainedTypes: !380, globals: !381, splitDebugInlining: false, nameTableKind: None)
!373 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!374 = !{!25, !375, !10}
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !26, line: 254, baseType: !6, size: 32, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!378 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!379 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!380 = !{!66, !67, !68}
!381 = !{!370, !382, !388, !400, !402, !407, !430, !437, !439}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !372, file: !373, line: 92, type: !384, isLocal: false, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 320, elements: !386)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!386 = !{!387}
!387 = !DISubrange(count: 10)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !372, file: !373, line: 1040, type: !390, isLocal: false, isDefinition: true)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !373, line: 56, size: 448, elements: !391)
!391 = !{!392, !393, !394, !398, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !390, file: !373, line: 59, baseType: !25, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !373, line: 62, baseType: !66, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !390, file: !373, line: 66, baseType: !395, size: 256, offset: 64)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 8)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !390, file: !373, line: 69, baseType: !70, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !390, file: !373, line: 72, baseType: !70, size: 64, offset: 384)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !372, file: !373, line: 107, type: !390, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "slot0", scope: !372, file: !373, line: 831, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2048, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 256)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "quote", scope: !409, file: !373, line: 228, type: !428, isLocal: true, isDefinition: true)
!409 = distinct !DISubprogram(name: "gettext_quote", scope: !373, file: !373, line: 197, type: !410, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !412)
!410 = !DISubroutineType(types: !411)
!411 = !{!70, !70, !25}
!412 = !{!413, !414, !415, !416, !417}
!413 = !DILocalVariable(name: "msgid", arg: 1, scope: !409, file: !373, line: 197, type: !70)
!414 = !DILocalVariable(name: "s", arg: 2, scope: !409, file: !373, line: 197, type: !25)
!415 = !DILocalVariable(name: "translation", scope: !409, file: !373, line: 199, type: !70)
!416 = !DILocalVariable(name: "w", scope: !409, file: !373, line: 229, type: !351)
!417 = !DILocalVariable(name: "mbs", scope: !409, file: !373, line: 230, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !357, line: 6, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !359, line: 21, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 13, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !420, file: !359, line: 15, baseType: !66, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !420, file: !359, line: 20, baseType: !424, size: 32, offset: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !359, line: 16, size: 32, elements: !425)
!425 = !{!426, !427}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !424, file: !359, line: 18, baseType: !6, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !424, file: !359, line: 19, baseType: !368, size: 32)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !429)
!429 = !{!214, !235}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "slotvec", scope: !372, file: !373, line: 834, type: !432, isLocal: true, isDefinition: true)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !373, line: 823, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !373, line: 825, baseType: !68, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !433, file: !373, line: 826, baseType: !63, size: 64, offset: 64)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "nslots", scope: !372, file: !373, line: 832, type: !66, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "slotvec0", scope: !372, file: !373, line: 833, type: !433, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 704, elements: !330)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !444, file: !445, line: 26, type: !447, isLocal: false, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !446, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!446 = !{!442}
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 376, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 47)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "exit_failure", scope: !452, file: !453, line: 24, type: !455, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !454, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!454 = !{!450}
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !458, file: !459, line: 65, type: !463, isLocal: false, isDefinition: true)
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !460, retainedTypes: !461, globals: !462, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!460 = !{!25}
!461 = !{!65, !70, !72}
!462 = !{!456}
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !464, line: 69, baseType: !288)
!464 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !467, file: !468, line: 506, type: !66, isLocal: true, isDefinition: true)
!467 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !468, file: !468, line: 485, type: !469, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !473)
!468 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!469 = !DISubroutineType(types: !470)
!470 = !{!66, !66, !66}
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !472, splitDebugInlining: false, nameTableKind: None)
!472 = !{!465}
!473 = !{!474, !475, !476, !477, !480}
!474 = !DILocalVariable(name: "fd", arg: 1, scope: !467, file: !468, line: 485, type: !66)
!475 = !DILocalVariable(name: "target", arg: 2, scope: !467, file: !468, line: 485, type: !66)
!476 = !DILocalVariable(name: "result", scope: !467, file: !468, line: 487, type: !66)
!477 = !DILocalVariable(name: "flags", scope: !478, file: !468, line: 530, type: !66)
!478 = distinct !DILexicalBlock(scope: !479, file: !468, line: 529, column: 5)
!479 = distinct !DILexicalBlock(scope: !467, file: !468, line: 528, column: 7)
!480 = !DILocalVariable(name: "saved_errno", scope: !481, file: !468, line: 533, type: !66)
!481 = distinct !DILexicalBlock(scope: !482, file: !468, line: 532, column: 9)
!482 = distinct !DILexicalBlock(scope: !478, file: !468, line: 531, column: 11)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "internal_state", scope: !485, file: !486, line: 97, type: !489, isLocal: true, isDefinition: true)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !487, globals: !488, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!487 = !{!65, !68, !72}
!488 = !{!483}
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !357, line: 6, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !359, line: 21, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !359, line: 13, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !359, line: 15, baseType: !66, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !359, line: 20, baseType: !495, size: 32, offset: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !359, line: 16, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !495, file: !359, line: 18, baseType: !6, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !495, file: !359, line: 19, baseType: !368, size: 32)
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !501, retainedTypes: !586, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "src/sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "984061a05cf8100a66387ffa345dea00")
!501 = !{!502, !564, !296}
!502 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !503, file: !500, line: 40, baseType: !6, size: 32, elements: !562)
!503 = distinct !DISubprogram(name: "bsd_sum_stream", scope: !500, file: !500, line: 34, type: !504, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !540)
!504 = !DISubroutineType(types: !505)
!505 = !{!66, !506, !65, !210}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !114, line: 7, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !508, file: !116, line: 51, baseType: !66, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !508, file: !116, line: 54, baseType: !63, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !508, file: !116, line: 55, baseType: !63, size: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !508, file: !116, line: 56, baseType: !63, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !508, file: !116, line: 57, baseType: !63, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !508, file: !116, line: 58, baseType: !63, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !508, file: !116, line: 59, baseType: !63, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !508, file: !116, line: 60, baseType: !63, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !508, file: !116, line: 61, baseType: !63, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !508, file: !116, line: 64, baseType: !63, size: 64, offset: 576)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !508, file: !116, line: 65, baseType: !63, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !508, file: !116, line: 66, baseType: !63, size: 64, offset: 704)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !508, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !508, file: !116, line: 70, baseType: !524, size: 64, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !508, file: !116, line: 72, baseType: !66, size: 32, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !508, file: !116, line: 73, baseType: !66, size: 32, offset: 928)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !508, file: !116, line: 74, baseType: !138, size: 64, offset: 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !508, file: !116, line: 77, baseType: !67, size: 16, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !508, file: !116, line: 78, baseType: !141, size: 8, offset: 1040)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !508, file: !116, line: 79, baseType: !143, size: 8, offset: 1048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !508, file: !116, line: 81, baseType: !147, size: 64, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !508, file: !116, line: 89, baseType: !150, size: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !508, file: !116, line: 91, baseType: !152, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !508, file: !116, line: 92, baseType: !155, size: 64, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !508, file: !116, line: 93, baseType: !524, size: 64, offset: 1344)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !508, file: !116, line: 94, baseType: !65, size: 64, offset: 1408)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !508, file: !116, line: 95, baseType: !68, size: 64, offset: 1472)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !508, file: !116, line: 96, baseType: !66, size: 32, offset: 1536)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !508, file: !116, line: 98, baseType: !162, size: 160, offset: 1568)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !553, !556, !558, !560, !561}
!541 = !DILocalVariable(name: "stream", arg: 1, scope: !503, file: !500, line: 34, type: !506)
!542 = !DILocalVariable(name: "resstream", arg: 2, scope: !503, file: !500, line: 34, type: !65)
!543 = !DILocalVariable(name: "length", arg: 3, scope: !503, file: !500, line: 34, type: !210)
!544 = !DILocalVariable(name: "ret", scope: !503, file: !500, line: 36, type: !66)
!545 = !DILocalVariable(name: "sum", scope: !503, file: !500, line: 37, type: !80)
!546 = !DILocalVariable(name: "checksum", scope: !503, file: !500, line: 38, type: !66)
!547 = !DILocalVariable(name: "total_bytes", scope: !503, file: !500, line: 39, type: !211)
!548 = !DILocalVariable(name: "buffer", scope: !503, file: !500, line: 41, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !551, line: 24, baseType: !552)
!551 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 38, baseType: !72)
!553 = !DILocalVariable(name: "n", scope: !554, file: !500, line: 54, type: !68)
!554 = distinct !DILexicalBlock(scope: !555, file: !500, line: 53, column: 5)
!555 = distinct !DILexicalBlock(scope: !503, file: !500, line: 48, column: 3)
!556 = !DILocalVariable(name: "i", scope: !557, file: !500, line: 71, type: !68)
!557 = distinct !DILexicalBlock(scope: !555, file: !500, line: 71, column: 5)
!558 = !DILocalVariable(name: "i", scope: !559, file: !500, line: 86, type: !80)
!559 = distinct !DILexicalBlock(scope: !503, file: !500, line: 86, column: 3)
!560 = !DILabel(scope: !503, name: "final_process", file: !500, line: 84)
!561 = !DILabel(scope: !503, name: "cleanup_buffer", file: !500, line: 101)
!562 = !{!563}
!563 = !DIEnumerator(name: "buffer_length", value: 32768)
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !565, file: !500, line: 115, baseType: !6, size: 32, elements: !562)
!565 = distinct !DISubprogram(name: "sysv_sum_stream", scope: !500, file: !500, line: 110, type: !504, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !578, !580, !582, !583, !584, !585}
!567 = !DILocalVariable(name: "stream", arg: 1, scope: !565, file: !500, line: 110, type: !506)
!568 = !DILocalVariable(name: "resstream", arg: 2, scope: !565, file: !500, line: 110, type: !65)
!569 = !DILocalVariable(name: "length", arg: 3, scope: !565, file: !500, line: 110, type: !210)
!570 = !DILocalVariable(name: "ret", scope: !565, file: !500, line: 112, type: !66)
!571 = !DILocalVariable(name: "sum", scope: !565, file: !500, line: 113, type: !80)
!572 = !DILocalVariable(name: "total_bytes", scope: !565, file: !500, line: 114, type: !211)
!573 = !DILocalVariable(name: "buffer", scope: !565, file: !500, line: 116, type: !549)
!574 = !DILocalVariable(name: "s", scope: !565, file: !500, line: 122, type: !6)
!575 = !DILocalVariable(name: "n", scope: !576, file: !500, line: 132, type: !68)
!576 = distinct !DILexicalBlock(scope: !577, file: !500, line: 131, column: 5)
!577 = distinct !DILexicalBlock(scope: !565, file: !500, line: 126, column: 3)
!578 = !DILocalVariable(name: "i", scope: !579, file: !500, line: 149, type: !68)
!579 = distinct !DILexicalBlock(scope: !577, file: !500, line: 149, column: 5)
!580 = !DILocalVariable(name: "i", scope: !581, file: !500, line: 161, type: !68)
!581 = distinct !DILexicalBlock(scope: !565, file: !500, line: 161, column: 3)
!582 = !DILocalVariable(name: "r", scope: !565, file: !500, line: 170, type: !66)
!583 = !DILocalVariable(name: "checksum", scope: !565, file: !500, line: 171, type: !66)
!584 = !DILabel(scope: !565, name: "final_process", file: !500, line: 159)
!585 = !DILabel(scope: !565, name: "cleanup_buffer", file: !500, line: 176)
!586 = !{!77, !232, !70, !68, !587, !72}
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !48, line: 40, baseType: !67)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !590, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!590 = !{!53}
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!595 = !{!65}
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !606, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!606 = !{!607}
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 40, baseType: !6, size: 32, elements: !608)
!608 = !{!609}
!609 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !640, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!612 = !{!613, !625}
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !614, file: !611, line: 188, baseType: !6, size: 32, elements: !623)
!614 = distinct !DISubprogram(name: "x2nrealloc", scope: !611, file: !611, line: 176, type: !615, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !618)
!615 = !DISubroutineType(types: !616)
!616 = !{!65, !65, !617, !68}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!618 = !{!619, !620, !621, !622}
!619 = !DILocalVariable(name: "p", arg: 1, scope: !614, file: !611, line: 176, type: !65)
!620 = !DILocalVariable(name: "pn", arg: 2, scope: !614, file: !611, line: 176, type: !617)
!621 = !DILocalVariable(name: "s", arg: 3, scope: !614, file: !611, line: 176, type: !68)
!622 = !DILocalVariable(name: "n", scope: !614, file: !611, line: 178, type: !68)
!623 = !{!624}
!624 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !626, file: !611, line: 228, baseType: !6, size: 32, elements: !623)
!626 = distinct !DISubprogram(name: "xpalloc", scope: !611, file: !611, line: 223, type: !627, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !610, retainedNodes: !630)
!627 = !DISubroutineType(types: !628)
!628 = !{!65, !65, !629, !80, !82, !80}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639}
!631 = !DILocalVariable(name: "pa", arg: 1, scope: !626, file: !611, line: 223, type: !65)
!632 = !DILocalVariable(name: "pn", arg: 2, scope: !626, file: !611, line: 223, type: !629)
!633 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !626, file: !611, line: 223, type: !80)
!634 = !DILocalVariable(name: "n_max", arg: 4, scope: !626, file: !611, line: 223, type: !82)
!635 = !DILocalVariable(name: "s", arg: 5, scope: !626, file: !611, line: 223, type: !80)
!636 = !DILocalVariable(name: "n0", scope: !626, file: !611, line: 230, type: !80)
!637 = !DILocalVariable(name: "n", scope: !626, file: !611, line: 237, type: !80)
!638 = !DILocalVariable(name: "nbytes", scope: !626, file: !611, line: 248, type: !80)
!639 = !DILocalVariable(name: "adjusted_nbytes", scope: !626, file: !611, line: 252, type: !80)
!640 = !{!63, !65, !77, !83, !44}
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !645, retainedTypes: !646, splitDebugInlining: false, nameTableKind: None)
!644 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!645 = !{!309, !10}
!646 = !{!66, !67, !63, !77, !44, !45}
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!649 = distinct !DICompileUnit(language: DW_LANG_C99, file: !650, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!650 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!651 = distinct !DICompileUnit(language: DW_LANG_C99, file: !652, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, splitDebugInlining: false, nameTableKind: None)
!652 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!653 = !{!77, !44, !65}
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !655, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!655 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !657, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!657 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!660 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!661 = !{i32 7, !"Dwarf Version", i32 5}
!662 = !{i32 2, !"Debug Info Version", i32 3}
!663 = !{i32 1, !"wchar_size", i32 4}
!664 = !{i32 1, !"branch-target-enforcement", i32 0}
!665 = !{i32 1, !"sign-return-address", i32 0}
!666 = !{i32 1, !"sign-return-address-all", i32 0}
!667 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!668 = !{i32 7, !"PIC Level", i32 2}
!669 = !{i32 7, !"PIE Level", i32 2}
!670 = !{i32 7, !"uwtable", i32 1}
!671 = !{i32 7, !"frame-pointer", i32 1}
!672 = !DILocation(line: 0, scope: !503)
!673 = !DILocation(line: 38, column: 3, scope: !503)
!674 = !DILocation(line: 41, column: 21, scope: !503)
!675 = !DILocation(line: 43, column: 9, scope: !676)
!676 = distinct !DILexicalBlock(scope: !503, file: !500, line: 43, column: 7)
!677 = !DILocation(line: 43, column: 7, scope: !503)
!678 = !DILocation(line: 47, column: 3, scope: !503)
!679 = !DILocation(line: 52, column: 5, scope: !555)
!680 = !DILocation(line: 49, column: 9, scope: !555)
!681 = !DILocation(line: 54, column: 18, scope: !554)
!682 = !DILocation(line: 0, scope: !554)
!683 = !DILocation(line: 55, column: 13, scope: !684)
!684 = distinct !DILexicalBlock(scope: !554, file: !500, line: 55, column: 11)
!685 = !DILocation(line: 55, column: 11, scope: !554)
!686 = !DILocalVariable(name: "__stream", arg: 1, scope: !687, file: !688, line: 135, type: !506)
!687 = distinct !DISubprogram(name: "ferror_unlocked", scope: !688, file: !688, line: 135, type: !689, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !691)
!688 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!689 = !DISubroutineType(types: !690)
!690 = !{!66, !506}
!691 = !{!686}
!692 = !DILocation(line: 0, scope: !687, inlinedAt: !693)
!693 = distinct !DILocation(line: 57, column: 15, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !500, line: 57, column: 15)
!695 = distinct !DILexicalBlock(scope: !684, file: !500, line: 56, column: 9)
!696 = !DILocation(line: 137, column: 10, scope: !687, inlinedAt: !693)
!697 = !{!698, !699, i64 0}
!698 = !{!"_IO_FILE", !699, i64 0, !702, i64 8, !702, i64 16, !702, i64 24, !702, i64 32, !702, i64 40, !702, i64 48, !702, i64 56, !702, i64 64, !702, i64 72, !702, i64 80, !702, i64 88, !702, i64 96, !702, i64 104, !699, i64 112, !699, i64 116, !703, i64 120, !704, i64 128, !700, i64 130, !700, i64 131, !702, i64 136, !703, i64 144, !702, i64 152, !702, i64 160, !702, i64 168, !702, i64 176, !703, i64 184, !699, i64 192, !700, i64 196}
!699 = !{!"int", !700, i64 0}
!700 = !{!"omnipotent char", !701, i64 0}
!701 = !{!"Simple C/C++ TBAA"}
!702 = !{!"any pointer", !700, i64 0}
!703 = !{!"long", !700, i64 0}
!704 = !{!"short", !700, i64 0}
!705 = !DILocation(line: 57, column: 15, scope: !694)
!706 = !DILocation(line: 0, scope: !695)
!707 = !DILocation(line: 62, column: 11, scope: !554)
!708 = !DILocation(line: 64, column: 25, scope: !709)
!709 = distinct !DILexicalBlock(scope: !554, file: !500, line: 64, column: 11)
!710 = !DILocation(line: 64, column: 11, scope: !554)
!711 = !DILocalVariable(name: "__stream", arg: 1, scope: !712, file: !688, line: 128, type: !506)
!712 = distinct !DISubprogram(name: "feof_unlocked", scope: !688, file: !688, line: 128, type: !689, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !713)
!713 = !{!711}
!714 = !DILocation(line: 0, scope: !712, inlinedAt: !715)
!715 = distinct !DILocation(line: 67, column: 11, scope: !716)
!716 = distinct !DILexicalBlock(scope: !554, file: !500, line: 67, column: 11)
!717 = !DILocation(line: 130, column: 10, scope: !712, inlinedAt: !715)
!718 = !DILocation(line: 67, column: 11, scope: !716)
!719 = !DILocation(line: 0, scope: !555)
!720 = !DILocation(line: 0, scope: !559)
!721 = !DILocation(line: 86, column: 23, scope: !722)
!722 = distinct !DILexicalBlock(scope: !559, file: !500, line: 86, column: 3)
!723 = !DILocation(line: 86, column: 3, scope: !559)
!724 = !DILocation(line: 77, column: 9, scope: !725)
!725 = distinct !DILexicalBlock(scope: !555, file: !500, line: 77, column: 9)
!726 = !DILocation(line: 77, column: 9, scope: !555)
!727 = distinct !{!727, !678, !728}
!728 = !DILocation(line: 82, column: 3, scope: !503)
!729 = !DILocation(line: 0, scope: !557)
!730 = !DILocation(line: 73, column: 30, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !500, line: 72, column: 7)
!732 = distinct !DILexicalBlock(scope: !557, file: !500, line: 71, column: 5)
!733 = !DILocation(line: 73, column: 54, scope: !731)
!734 = !DILocation(line: 73, column: 36, scope: !731)
!735 = !DILocation(line: 74, column: 21, scope: !731)
!736 = !{!700, !700, i64 0}
!737 = !DILocation(line: 74, column: 18, scope: !731)
!738 = !DILocation(line: 75, column: 18, scope: !731)
!739 = !DILocation(line: 71, column: 34, scope: !732)
!740 = !DILocation(line: 71, column: 26, scope: !732)
!741 = !DILocation(line: 71, column: 5, scope: !557)
!742 = distinct !{!742, !741, !743, !744}
!743 = !DILocation(line: 76, column: 7, scope: !557)
!744 = !{!"llvm.loop.mustprogress"}
!745 = !DILocation(line: 79, column: 9, scope: !746)
!746 = distinct !DILexicalBlock(scope: !725, file: !500, line: 78, column: 7)
!747 = !DILocation(line: 79, column: 15, scope: !746)
!748 = !{!699, !699, i64 0}
!749 = !DILocation(line: 80, column: 9, scope: !746)
!750 = !DILocation(line: 0, scope: !751)
!751 = distinct !DILexicalBlock(scope: !722, file: !500, line: 87, column: 5)
!752 = !DILocation(line: 92, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !503, file: !500, line: 92, column: 7)
!754 = !DILocation(line: 92, column: 7, scope: !503)
!755 = !DILocation(line: 88, column: 28, scope: !751)
!756 = !DILocation(line: 88, column: 52, scope: !751)
!757 = !DILocation(line: 88, column: 34, scope: !751)
!758 = !DILocation(line: 89, column: 19, scope: !751)
!759 = !DILocation(line: 89, column: 16, scope: !751)
!760 = !DILocation(line: 90, column: 16, scope: !751)
!761 = !DILocation(line: 86, column: 31, scope: !722)
!762 = distinct !{!762, !723, !763, !744}
!763 = !DILocation(line: 91, column: 5, scope: !559)
!764 = !DILocation(line: 94, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !753, file: !500, line: 93, column: 5)
!766 = !DILocation(line: 94, column: 13, scope: !765)
!767 = !DILocation(line: 95, column: 7, scope: !765)
!768 = !DILocalVariable(name: "__dest", arg: 1, scope: !769, file: !770, line: 26, type: !773)
!769 = distinct !DISubprogram(name: "memcpy", scope: !770, file: !770, line: 26, type: !771, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !775)
!770 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!771 = !DISubroutineType(types: !772)
!772 = !{!65, !773, !774, !68}
!773 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!774 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !222)
!775 = !{!768, !776, !777}
!776 = !DILocalVariable(name: "__src", arg: 2, scope: !769, file: !770, line: 26, type: !774)
!777 = !DILocalVariable(name: "__len", arg: 3, scope: !769, file: !770, line: 26, type: !68)
!778 = !DILocation(line: 0, scope: !769, inlinedAt: !779)
!779 = distinct !DILocation(line: 98, column: 3, scope: !503)
!780 = !DILocation(line: 29, column: 10, scope: !769, inlinedAt: !779)
!781 = !DILocation(line: 99, column: 11, scope: !503)
!782 = !{!703, !703, i64 0}
!783 = !DILocation(line: 100, column: 3, scope: !503)
!784 = !DILocation(line: 101, column: 1, scope: !503)
!785 = !DILocation(line: 102, column: 3, scope: !503)
!786 = !DILocation(line: 103, column: 3, scope: !503)
!787 = !DILocation(line: 104, column: 1, scope: !503)
!788 = !DILocation(line: 0, scope: !565)
!789 = !DILocation(line: 116, column: 21, scope: !565)
!790 = !DILocation(line: 118, column: 9, scope: !791)
!791 = distinct !DILexicalBlock(scope: !565, file: !500, line: 118, column: 7)
!792 = !DILocation(line: 118, column: 7, scope: !565)
!793 = !DILocation(line: 125, column: 3, scope: !565)
!794 = !DILocation(line: 122, column: 16, scope: !565)
!795 = !DILocation(line: 130, column: 5, scope: !577)
!796 = !DILocation(line: 127, column: 9, scope: !577)
!797 = !DILocation(line: 132, column: 18, scope: !576)
!798 = !DILocation(line: 0, scope: !576)
!799 = !DILocation(line: 133, column: 13, scope: !800)
!800 = distinct !DILexicalBlock(scope: !576, file: !500, line: 133, column: 11)
!801 = !DILocation(line: 133, column: 11, scope: !576)
!802 = !DILocation(line: 0, scope: !687, inlinedAt: !803)
!803 = distinct !DILocation(line: 135, column: 15, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !500, line: 135, column: 15)
!805 = distinct !DILexicalBlock(scope: !800, file: !500, line: 134, column: 9)
!806 = !DILocation(line: 137, column: 10, scope: !687, inlinedAt: !803)
!807 = !DILocation(line: 135, column: 15, scope: !804)
!808 = !DILocation(line: 0, scope: !805)
!809 = !DILocation(line: 140, column: 11, scope: !576)
!810 = !DILocation(line: 142, column: 25, scope: !811)
!811 = distinct !DILexicalBlock(scope: !576, file: !500, line: 142, column: 11)
!812 = !DILocation(line: 142, column: 11, scope: !576)
!813 = !DILocation(line: 149, column: 5, scope: !579)
!814 = !DILocation(line: 149, column: 34, scope: !815)
!815 = distinct !DILexicalBlock(scope: !579, file: !500, line: 149, column: 5)
!816 = !DILocation(line: 150, column: 12, scope: !815)
!817 = !DILocation(line: 150, column: 9, scope: !815)
!818 = distinct !{!818, !813, !819, !744, !820}
!819 = !DILocation(line: 150, column: 20, scope: !579)
!820 = !{!"llvm.loop.isvectorized", i32 1}
!821 = !DILocation(line: 151, column: 21, scope: !822)
!822 = distinct !DILexicalBlock(scope: !577, file: !500, line: 151, column: 9)
!823 = !DILocation(line: 151, column: 9, scope: !577)
!824 = distinct !{!824, !793, !825}
!825 = !DILocation(line: 157, column: 3, scope: !565)
!826 = !DILocation(line: 0, scope: !712, inlinedAt: !827)
!827 = distinct !DILocation(line: 145, column: 11, scope: !828)
!828 = distinct !DILexicalBlock(scope: !576, file: !500, line: 145, column: 11)
!829 = !DILocation(line: 130, column: 10, scope: !712, inlinedAt: !827)
!830 = !DILocation(line: 145, column: 11, scope: !828)
!831 = !DILocation(line: 0, scope: !577)
!832 = !DILocation(line: 0, scope: !581)
!833 = !DILocation(line: 161, column: 24, scope: !834)
!834 = distinct !DILexicalBlock(scope: !581, file: !500, line: 161, column: 3)
!835 = !DILocation(line: 161, column: 3, scope: !581)
!836 = !DILocation(line: 161, column: 32, scope: !834)
!837 = !DILocation(line: 162, column: 10, scope: !834)
!838 = !DILocation(line: 162, column: 7, scope: !834)
!839 = distinct !{!839, !835, !840, !744, !820}
!840 = !DILocation(line: 162, column: 18, scope: !581)
!841 = !DILocation(line: 163, column: 25, scope: !842)
!842 = distinct !DILexicalBlock(scope: !565, file: !500, line: 163, column: 7)
!843 = !DILocation(line: 163, column: 7, scope: !565)
!844 = distinct !{!844, !835, !840, !744, !845, !820}
!845 = !{!"llvm.loop.unroll.runtime.disable"}
!846 = !DILocation(line: 165, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !842, file: !500, line: 164, column: 5)
!848 = !DILocation(line: 165, column: 13, scope: !847)
!849 = !DILocation(line: 166, column: 7, scope: !847)
!850 = !DILocation(line: 163, column: 19, scope: !842)
!851 = !DILocation(line: 170, column: 14, scope: !565)
!852 = !DILocation(line: 170, column: 44, scope: !565)
!853 = !DILocation(line: 170, column: 24, scope: !565)
!854 = !DILocation(line: 171, column: 21, scope: !565)
!855 = !DILocation(line: 171, column: 36, scope: !565)
!856 = !DILocation(line: 171, column: 31, scope: !565)
!857 = !DILocation(line: 0, scope: !769, inlinedAt: !858)
!858 = distinct !DILocation(line: 173, column: 3, scope: !565)
!859 = !DILocation(line: 29, column: 10, scope: !769, inlinedAt: !858)
!860 = !DILocation(line: 174, column: 11, scope: !565)
!861 = !DILocation(line: 175, column: 3, scope: !565)
!862 = !DILocation(line: 176, column: 1, scope: !565)
!863 = !DILocation(line: 177, column: 3, scope: !565)
!864 = !DILocation(line: 178, column: 3, scope: !565)
!865 = !DILocation(line: 179, column: 1, scope: !565)
!866 = distinct !DISubprogram(name: "output_bsd", scope: !500, file: !500, line: 185, type: !220, scopeLine: 188, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !880, !882, !883, !884}
!868 = !DILocalVariable(name: "file", arg: 1, scope: !866, file: !500, line: 185, type: !70)
!869 = !DILocalVariable(name: "binary_file", arg: 2, scope: !866, file: !500, line: 185, type: !66)
!870 = !DILocalVariable(name: "digest", arg: 3, scope: !866, file: !500, line: 185, type: !222)
!871 = !DILocalVariable(name: "raw", arg: 4, scope: !866, file: !500, line: 186, type: !77)
!872 = !DILocalVariable(name: "tagged", arg: 5, scope: !866, file: !500, line: 186, type: !77)
!873 = !DILocalVariable(name: "delim", arg: 6, scope: !866, file: !500, line: 186, type: !72)
!874 = !DILocalVariable(name: "args", arg: 7, scope: !866, file: !500, line: 186, type: !77)
!875 = !DILocalVariable(name: "length", arg: 8, scope: !866, file: !500, line: 187, type: !211)
!876 = !DILocalVariable(name: "out_int", scope: !877, file: !500, line: 192, type: !879)
!877 = distinct !DILexicalBlock(scope: !878, file: !500, line: 190, column: 5)
!878 = distinct !DILexicalBlock(scope: !866, file: !500, line: 189, column: 7)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !551, line: 25, baseType: !587)
!880 = !DILocalVariable(name: "__ptr", scope: !881, file: !500, line: 194, type: !70)
!881 = distinct !DILexicalBlock(scope: !877, file: !500, line: 194, column: 7)
!882 = !DILocalVariable(name: "__stream", scope: !881, file: !500, line: 194, type: !506)
!883 = !DILocalVariable(name: "__cnt", scope: !881, file: !500, line: 194, type: !68)
!884 = !DILocalVariable(name: "hbuf", scope: !866, file: !500, line: 198, type: !885)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 5216, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 652)
!888 = !DILocation(line: 0, scope: !866)
!889 = !DILocation(line: 189, column: 7, scope: !866)
!890 = !DILocation(line: 192, column: 7, scope: !877)
!891 = !DILocation(line: 192, column: 27, scope: !877)
!892 = !DILocation(line: 192, column: 26, scope: !877)
!893 = !DILocation(line: 0, scope: !877)
!894 = !DILocation(line: 193, column: 15, scope: !877)
!895 = !{!704, !704, i64 0}
!896 = !DILocation(line: 0, scope: !881)
!897 = !DILocation(line: 194, column: 7, scope: !881)
!898 = !{!702, !702, i64 0}
!899 = !DILocation(line: 194, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !881, file: !500, line: 194, column: 7)
!901 = !DILocation(line: 194, column: 7, scope: !902)
!902 = distinct !DILexicalBlock(scope: !903, file: !500, line: 194, column: 7)
!903 = distinct !DILexicalBlock(scope: !900, file: !500, line: 194, column: 7)
!904 = !DILocalVariable(name: "__c", arg: 1, scope: !905, file: !688, line: 101, type: !66)
!905 = distinct !DISubprogram(name: "putc_unlocked", scope: !688, file: !688, line: 101, type: !906, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{!66, !66, !506}
!908 = !{!904, !909}
!909 = !DILocalVariable(name: "__stream", arg: 2, scope: !905, file: !688, line: 101, type: !506)
!910 = !DILocation(line: 0, scope: !905, inlinedAt: !911)
!911 = distinct !DILocation(line: 194, column: 7, scope: !902)
!912 = !DILocation(line: 103, column: 10, scope: !905, inlinedAt: !911)
!913 = !{!698, !702, i64 40}
!914 = !{!698, !702, i64 48}
!915 = !{!"branch_weights", i32 2000, i32 1}
!916 = !DILocation(line: 194, column: 7, scope: !903)
!917 = distinct !{!917, !899, !899, !744}
!918 = !DILocation(line: 196, column: 5, scope: !878)
!919 = !DILocation(line: 198, column: 3, scope: !866)
!920 = !DILocation(line: 198, column: 8, scope: !866)
!921 = !DILocation(line: 199, column: 3, scope: !866)
!922 = !DILocation(line: 201, column: 7, scope: !866)
!923 = !DILocation(line: 202, column: 5, scope: !924)
!924 = distinct !DILexicalBlock(scope: !866, file: !500, line: 201, column: 7)
!925 = !DILocalVariable(name: "__c", arg: 1, scope: !926, file: !688, line: 108, type: !66)
!926 = distinct !DISubprogram(name: "putchar_unlocked", scope: !688, file: !688, line: 108, type: !927, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!66, !66}
!929 = !{!925}
!930 = !DILocation(line: 0, scope: !926, inlinedAt: !931)
!931 = distinct !DILocation(line: 203, column: 3, scope: !866)
!932 = !DILocation(line: 110, column: 10, scope: !926, inlinedAt: !931)
!933 = !DILocation(line: 203, column: 3, scope: !866)
!934 = !DILocation(line: 204, column: 1, scope: !866)
!935 = distinct !DISubprogram(name: "output_sysv", scope: !500, file: !500, line: 210, type: !220, scopeLine: 213, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !499, retainedNodes: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !948, !950, !951, !952}
!937 = !DILocalVariable(name: "file", arg: 1, scope: !935, file: !500, line: 210, type: !70)
!938 = !DILocalVariable(name: "binary_file", arg: 2, scope: !935, file: !500, line: 210, type: !66)
!939 = !DILocalVariable(name: "digest", arg: 3, scope: !935, file: !500, line: 211, type: !222)
!940 = !DILocalVariable(name: "raw", arg: 4, scope: !935, file: !500, line: 211, type: !77)
!941 = !DILocalVariable(name: "tagged", arg: 5, scope: !935, file: !500, line: 211, type: !77)
!942 = !DILocalVariable(name: "delim", arg: 6, scope: !935, file: !500, line: 212, type: !72)
!943 = !DILocalVariable(name: "args", arg: 7, scope: !935, file: !500, line: 212, type: !77)
!944 = !DILocalVariable(name: "length", arg: 8, scope: !935, file: !500, line: 212, type: !211)
!945 = !DILocalVariable(name: "out_int", scope: !946, file: !500, line: 217, type: !879)
!946 = distinct !DILexicalBlock(scope: !947, file: !500, line: 215, column: 5)
!947 = distinct !DILexicalBlock(scope: !935, file: !500, line: 214, column: 7)
!948 = !DILocalVariable(name: "__ptr", scope: !949, file: !500, line: 219, type: !70)
!949 = distinct !DILexicalBlock(scope: !946, file: !500, line: 219, column: 7)
!950 = !DILocalVariable(name: "__stream", scope: !949, file: !500, line: 219, type: !506)
!951 = !DILocalVariable(name: "__cnt", scope: !949, file: !500, line: 219, type: !68)
!952 = !DILocalVariable(name: "hbuf", scope: !935, file: !500, line: 223, type: !885)
!953 = !DILocation(line: 0, scope: !935)
!954 = !DILocation(line: 214, column: 7, scope: !935)
!955 = !DILocation(line: 217, column: 7, scope: !946)
!956 = !DILocation(line: 217, column: 27, scope: !946)
!957 = !DILocation(line: 217, column: 26, scope: !946)
!958 = !DILocation(line: 0, scope: !946)
!959 = !DILocation(line: 218, column: 15, scope: !946)
!960 = !DILocation(line: 0, scope: !949)
!961 = !DILocation(line: 219, column: 7, scope: !949)
!962 = !DILocation(line: 219, column: 7, scope: !963)
!963 = distinct !DILexicalBlock(scope: !949, file: !500, line: 219, column: 7)
!964 = !DILocation(line: 219, column: 7, scope: !965)
!965 = distinct !DILexicalBlock(scope: !966, file: !500, line: 219, column: 7)
!966 = distinct !DILexicalBlock(scope: !963, file: !500, line: 219, column: 7)
!967 = !DILocation(line: 0, scope: !905, inlinedAt: !968)
!968 = distinct !DILocation(line: 219, column: 7, scope: !965)
!969 = !DILocation(line: 103, column: 10, scope: !905, inlinedAt: !968)
!970 = !DILocation(line: 219, column: 7, scope: !966)
!971 = distinct !{!971, !962, !962, !744}
!972 = !DILocation(line: 221, column: 5, scope: !947)
!973 = !DILocation(line: 223, column: 3, scope: !935)
!974 = !DILocation(line: 223, column: 8, scope: !935)
!975 = !DILocation(line: 224, column: 3, scope: !935)
!976 = !DILocation(line: 226, column: 7, scope: !935)
!977 = !DILocation(line: 227, column: 5, scope: !978)
!978 = distinct !DILexicalBlock(scope: !935, file: !500, line: 226, column: 7)
!979 = !DILocation(line: 0, scope: !926, inlinedAt: !980)
!980 = distinct !DILocation(line: 228, column: 3, scope: !935)
!981 = !DILocation(line: 110, column: 10, scope: !926, inlinedAt: !980)
!982 = !DILocation(line: 228, column: 3, scope: !935)
!983 = !DILocation(line: 229, column: 1, scope: !935)
!984 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 489, type: !985, scopeLine: 490, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !66}
!987 = !{!988}
!988 = !DILocalVariable(name: "status", arg: 1, scope: !984, file: !3, line: 489, type: !66)
!989 = !DILocation(line: 0, scope: !984)
!990 = !DILocation(line: 491, column: 14, scope: !991)
!991 = distinct !DILexicalBlock(scope: !984, file: !3, line: 491, column: 7)
!992 = !DILocation(line: 491, column: 7, scope: !984)
!993 = !DILocation(line: 492, column: 5, scope: !994)
!994 = distinct !DILexicalBlock(scope: !991, file: !3, line: 492, column: 5)
!995 = !DILocation(line: 495, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !991, file: !3, line: 494, column: 5)
!997 = !DILocation(line: 514, column: 7, scope: !996)
!998 = !DILocation(line: 519, column: 7, scope: !996)
!999 = !DILocation(line: 729, column: 3, scope: !1000, inlinedAt: !1002)
!1000 = distinct !DISubprogram(name: "emit_stdin_note", scope: !40, file: !40, line: 727, type: !289, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1001)
!1001 = !{}
!1002 = distinct !DILocation(line: 524, column: 7, scope: !996)
!1003 = !DILocation(line: 526, column: 7, scope: !996)
!1004 = !DILocation(line: 530, column: 7, scope: !996)
!1005 = !DILocation(line: 664, column: 7, scope: !996)
!1006 = !DILocation(line: 665, column: 7, scope: !996)
!1007 = !DILocalVariable(name: "program", arg: 1, scope: !1008, file: !40, line: 836, type: !70)
!1008 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !40, file: !40, line: 836, type: !1009, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1011)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, !70}
!1011 = !{!1007, !1012, !1021, !1022, !1024, !1025}
!1012 = !DILocalVariable(name: "infomap", scope: !1008, file: !40, line: 838, type: !1013)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 896, elements: !1019)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1008, file: !40, line: 838, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1015, file: !40, line: 838, baseType: !70, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1015, file: !40, line: 838, baseType: !70, size: 64, offset: 64)
!1019 = !{!1020}
!1020 = !DISubrange(count: 7)
!1021 = !DILocalVariable(name: "node", scope: !1008, file: !40, line: 848, type: !70)
!1022 = !DILocalVariable(name: "map_prog", scope: !1008, file: !40, line: 849, type: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1024 = !DILocalVariable(name: "lc_messages", scope: !1008, file: !40, line: 861, type: !70)
!1025 = !DILocalVariable(name: "url_program", scope: !1008, file: !40, line: 874, type: !70)
!1026 = !DILocation(line: 0, scope: !1008, inlinedAt: !1027)
!1027 = distinct !DILocation(line: 702, column: 7, scope: !996)
!1028 = !DILocation(line: 838, column: 3, scope: !1008, inlinedAt: !1027)
!1029 = !DILocation(line: 838, column: 67, scope: !1008, inlinedAt: !1027)
!1030 = !DILocation(line: 849, column: 36, scope: !1008, inlinedAt: !1027)
!1031 = !DILocation(line: 851, column: 3, scope: !1008, inlinedAt: !1027)
!1032 = !DILocalVariable(name: "__s1", arg: 1, scope: !1033, file: !1034, line: 1359, type: !70)
!1033 = distinct !DISubprogram(name: "streq", scope: !1034, file: !1034, line: 1359, type: !1035, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1034 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!77, !70, !70}
!1037 = !{!1032, !1038}
!1038 = !DILocalVariable(name: "__s2", arg: 2, scope: !1033, file: !1034, line: 1359, type: !70)
!1039 = !DILocation(line: 0, scope: !1033, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 851, column: 33, scope: !1008, inlinedAt: !1027)
!1041 = !DILocation(line: 1361, column: 11, scope: !1033, inlinedAt: !1040)
!1042 = !DILocation(line: 1361, column: 10, scope: !1033, inlinedAt: !1040)
!1043 = !DILocation(line: 852, column: 13, scope: !1008, inlinedAt: !1027)
!1044 = !DILocation(line: 851, column: 20, scope: !1008, inlinedAt: !1027)
!1045 = !{!1046, !702, i64 0}
!1046 = !{!"infomap", !702, i64 0, !702, i64 8}
!1047 = !DILocation(line: 851, column: 10, scope: !1008, inlinedAt: !1027)
!1048 = !DILocation(line: 851, column: 28, scope: !1008, inlinedAt: !1027)
!1049 = distinct !{!1049, !1031, !1043, !744}
!1050 = !DILocation(line: 854, column: 17, scope: !1051, inlinedAt: !1027)
!1051 = distinct !DILexicalBlock(scope: !1008, file: !40, line: 854, column: 7)
!1052 = !{!1046, !702, i64 8}
!1053 = !DILocation(line: 854, column: 7, scope: !1051, inlinedAt: !1027)
!1054 = !DILocation(line: 854, column: 7, scope: !1008, inlinedAt: !1027)
!1055 = !DILocation(line: 857, column: 3, scope: !1008, inlinedAt: !1027)
!1056 = !DILocation(line: 861, column: 29, scope: !1008, inlinedAt: !1027)
!1057 = !DILocation(line: 862, column: 7, scope: !1058, inlinedAt: !1027)
!1058 = distinct !DILexicalBlock(scope: !1008, file: !40, line: 862, column: 7)
!1059 = !DILocation(line: 862, column: 19, scope: !1058, inlinedAt: !1027)
!1060 = !DILocation(line: 862, column: 22, scope: !1058, inlinedAt: !1027)
!1061 = !DILocation(line: 862, column: 7, scope: !1008, inlinedAt: !1027)
!1062 = !DILocation(line: 868, column: 7, scope: !1063, inlinedAt: !1027)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !40, line: 863, column: 5)
!1064 = !DILocation(line: 870, column: 5, scope: !1063, inlinedAt: !1027)
!1065 = !DILocation(line: 0, scope: !1033, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 874, column: 29, scope: !1008, inlinedAt: !1027)
!1067 = !DILocation(line: 875, column: 3, scope: !1008, inlinedAt: !1027)
!1068 = !DILocation(line: 877, column: 3, scope: !1008, inlinedAt: !1027)
!1069 = !DILocation(line: 879, column: 1, scope: !1008, inlinedAt: !1027)
!1070 = !DILocation(line: 705, column: 3, scope: !984)
!1071 = !DISubprogram(name: "dcgettext", scope: !1072, file: !1072, line: 51, type: !1073, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1001)
!1072 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!63, !70, !70, !66}
!1075 = !DISubprogram(name: "fputs_unlocked", scope: !262, file: !262, line: 691, type: !1076, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1001)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!66, !1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!1079 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !112)
!1080 = !DILocation(line: 0, scope: !90)
!1081 = !DILocation(line: 581, column: 7, scope: !98)
!1082 = !DILocation(line: 581, column: 19, scope: !98)
!1083 = !DILocation(line: 581, column: 7, scope: !90)
!1084 = !DILocation(line: 585, column: 26, scope: !97)
!1085 = !DILocation(line: 0, scope: !97)
!1086 = !DILocation(line: 586, column: 23, scope: !97)
!1087 = !DILocation(line: 586, column: 28, scope: !97)
!1088 = !DILocation(line: 586, column: 32, scope: !97)
!1089 = !DILocation(line: 586, column: 38, scope: !97)
!1090 = !DILocation(line: 0, scope: !1033, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 586, column: 41, scope: !97)
!1092 = !DILocation(line: 1361, column: 11, scope: !1033, inlinedAt: !1091)
!1093 = !DILocation(line: 1361, column: 10, scope: !1033, inlinedAt: !1091)
!1094 = !DILocation(line: 586, column: 19, scope: !97)
!1095 = !DILocation(line: 587, column: 5, scope: !97)
!1096 = !DILocation(line: 588, column: 7, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !90, file: !40, line: 588, column: 7)
!1098 = !DILocation(line: 588, column: 7, scope: !90)
!1099 = !DILocation(line: 590, column: 7, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1097, file: !40, line: 589, column: 5)
!1101 = !DILocation(line: 591, column: 7, scope: !1100)
!1102 = !DILocation(line: 595, column: 37, scope: !90)
!1103 = !DILocation(line: 595, column: 35, scope: !90)
!1104 = !DILocation(line: 596, column: 29, scope: !90)
!1105 = !DILocation(line: 597, column: 8, scope: !105)
!1106 = !DILocation(line: 597, column: 7, scope: !90)
!1107 = !DILocation(line: 604, column: 24, scope: !104)
!1108 = !DILocation(line: 604, column: 12, scope: !105)
!1109 = !DILocation(line: 0, scope: !103)
!1110 = !DILocation(line: 610, column: 16, scope: !103)
!1111 = !DILocation(line: 610, column: 7, scope: !103)
!1112 = !DILocation(line: 611, column: 21, scope: !103)
!1113 = !DILocation(line: 611, column: 19, scope: !103)
!1114 = !DILocation(line: 611, column: 16, scope: !103)
!1115 = !DILocation(line: 610, column: 30, scope: !103)
!1116 = distinct !{!1116, !1111, !1112, !744}
!1117 = !DILocation(line: 612, column: 18, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !103, file: !40, line: 612, column: 11)
!1119 = !DILocation(line: 612, column: 11, scope: !103)
!1120 = !DILocation(line: 620, column: 23, scope: !90)
!1121 = !DILocation(line: 625, column: 39, scope: !90)
!1122 = !DILocation(line: 626, column: 3, scope: !90)
!1123 = !DILocation(line: 626, column: 10, scope: !90)
!1124 = !DILocation(line: 626, column: 21, scope: !90)
!1125 = !DILocation(line: 628, column: 44, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1127, file: !40, line: 628, column: 11)
!1127 = distinct !DILexicalBlock(scope: !90, file: !40, line: 627, column: 5)
!1128 = !DILocation(line: 628, column: 32, scope: !1126)
!1129 = !DILocation(line: 628, column: 49, scope: !1126)
!1130 = !DILocation(line: 628, column: 11, scope: !1127)
!1131 = !DILocation(line: 630, column: 11, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !40, line: 630, column: 11)
!1133 = !DILocation(line: 630, column: 11, scope: !1127)
!1134 = !DILocation(line: 632, column: 26, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !40, line: 632, column: 15)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !40, line: 631, column: 9)
!1137 = !DILocation(line: 632, column: 34, scope: !1135)
!1138 = !DILocation(line: 632, column: 37, scope: !1135)
!1139 = !DILocation(line: 632, column: 15, scope: !1136)
!1140 = !DILocation(line: 636, column: 29, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !40, line: 636, column: 15)
!1142 = !DILocation(line: 640, column: 16, scope: !1127)
!1143 = distinct !{!1143, !1122, !1144, !744}
!1144 = !DILocation(line: 641, column: 5, scope: !90)
!1145 = !DILocation(line: 644, column: 3, scope: !90)
!1146 = !DILocation(line: 0, scope: !1033, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 648, column: 31, scope: !90)
!1148 = !DILocation(line: 0, scope: !1033, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 649, column: 31, scope: !90)
!1150 = !DILocation(line: 0, scope: !1033, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 650, column: 31, scope: !90)
!1152 = !DILocation(line: 0, scope: !1033, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 651, column: 31, scope: !90)
!1154 = !DILocation(line: 0, scope: !1033, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 652, column: 31, scope: !90)
!1156 = !DILocation(line: 0, scope: !1033, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 653, column: 31, scope: !90)
!1158 = !DILocation(line: 0, scope: !1033, inlinedAt: !1159)
!1159 = distinct !DILocation(line: 654, column: 31, scope: !90)
!1160 = !DILocation(line: 0, scope: !1033, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 655, column: 31, scope: !90)
!1162 = !DILocation(line: 0, scope: !1033, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 656, column: 31, scope: !90)
!1164 = !DILocation(line: 0, scope: !1033, inlinedAt: !1165)
!1165 = distinct !DILocation(line: 657, column: 31, scope: !90)
!1166 = !DILocation(line: 663, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !90, file: !40, line: 663, column: 7)
!1168 = !DILocation(line: 664, column: 7, scope: !1167)
!1169 = !DILocation(line: 664, column: 10, scope: !1167)
!1170 = !DILocation(line: 663, column: 7, scope: !90)
!1171 = !DILocation(line: 669, column: 7, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1167, file: !40, line: 665, column: 5)
!1173 = !DILocation(line: 671, column: 5, scope: !1172)
!1174 = !DILocation(line: 676, column: 7, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1167, file: !40, line: 673, column: 5)
!1176 = !DILocation(line: 679, column: 3, scope: !90)
!1177 = !DILocation(line: 683, column: 3, scope: !90)
!1178 = !DILocation(line: 686, column: 3, scope: !90)
!1179 = !DILocation(line: 688, column: 3, scope: !90)
!1180 = !DILocation(line: 691, column: 3, scope: !90)
!1181 = !DILocation(line: 695, column: 3, scope: !90)
!1182 = !DILocation(line: 696, column: 1, scope: !90)
!1183 = !DISubprogram(name: "setlocale", scope: !1184, file: !1184, line: 122, type: !1185, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1001)
!1184 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!63, !66, !70}
!1187 = !DISubprogram(name: "getenv", scope: !1188, file: !1188, line: 641, type: !1189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1001)
!1188 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!63, !70}
!1191 = !DISubprogram(name: "fwrite_unlocked", scope: !262, file: !262, line: 704, type: !1192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1001)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!68, !774, !68, !68, !1079}
!1194 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 1565, type: !1195, scopeLine: 1566, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1198)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!66, !66, !1197}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!1198 = !{!1199, !1200, !1201, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1217, !1220, !1223, !1224}
!1199 = !DILocalVariable(name: "argc", arg: 1, scope: !1194, file: !3, line: 1565, type: !66)
!1200 = !DILocalVariable(name: "argv", arg: 2, scope: !1194, file: !3, line: 1565, type: !1197)
!1201 = !DILocalVariable(name: "bin_buffer_unaligned", scope: !1194, file: !3, line: 1567, type: !1202)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 48, elements: !1203)
!1203 = !{!1204}
!1204 = !DISubrange(count: 6)
!1205 = !DILocalVariable(name: "bin_buffer", scope: !1194, file: !3, line: 1569, type: !73)
!1206 = !DILocalVariable(name: "do_check", scope: !1194, file: !3, line: 1570, type: !77)
!1207 = !DILocalVariable(name: "opt", scope: !1194, file: !3, line: 1571, type: !66)
!1208 = !DILocalVariable(name: "ok", scope: !1194, file: !3, line: 1572, type: !77)
!1209 = !DILocalVariable(name: "binary", scope: !1194, file: !3, line: 1573, type: !66)
!1210 = !DILocalVariable(name: "prefix_tag", scope: !1194, file: !3, line: 1574, type: !66)
!1211 = !DILocalVariable(name: "long_opts", scope: !1194, file: !3, line: 1575, type: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!1213 = !DILocalVariable(name: "short_opts", scope: !1194, file: !3, line: 1601, type: !70)
!1214 = !DILocalVariable(name: "operand_lim", scope: !1194, file: !3, line: 1864, type: !1197)
!1215 = !DILocalVariable(name: "operandp", scope: !1216, file: !3, line: 1871, type: !1197)
!1216 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 1871, column: 3)
!1217 = !DILocalVariable(name: "file", scope: !1218, file: !3, line: 1873, type: !63)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !3, line: 1872, column: 5)
