; ModuleID = 'src/sync.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION] [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [137 x i8] c"Synchronize cached writes to persistent storage\0A\0AIf one or more files are specified, sync only them,\0Aor their containing file systems.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"sync\00", align 1
@.str.4 = private unnamed_addr constant [68 x i8] c"  -d, --data             sync only file data, no unneeded metadata\0A\00", align 1

!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!15 = !DIEnumerator(name: "_ISupper", value: 256)
!16 = !DIEnumerator(name: "_ISlower", value: 512)
!17 = !DIEnumerator(name: "_ISalpha", value: 1024)
!18 = !DIEnumerator(name: "_ISdigit", value: 2048)
!19 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!20 = !DIEnumerator(name: "_ISspace", value: 8192)
!21 = !DIEnumerator(name: "_ISprint", value: 16384)
!22 = !DIEnumerator(name: "_ISgraph", value: 32768)
!23 = !DIEnumerator(name: "_ISblank", value: 1)
!24 = !DIEnumerator(name: "_IScntrl", value: 2)
!25 = !DIEnumerator(name: "_ISpunct", value: 4)
!26 = !DIEnumerator(name: "_ISalnum", value: 8)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !28, line: 42, baseType: !6, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!30 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!31 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!32 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!33 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!34 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!35 = !DIEnumerator(name: "c_quoting_style", value: 5)
!36 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!37 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!38 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!39 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!40 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!41 = !{!42, !44, !45, !46, !47, !50, !52}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 46, baseType: !49)
!48 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!49 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{!54, !0}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !56, file: !57, line: 575, type: !45, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "oputs_", scope: !57, file: !57, line: 573, type: !58, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !60)
!57 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!58 = !DISubroutineType(types: !59)
!59 = !{null, !50, !50}
!60 = !{!61, !62, !63, !66, !68, !69, !70, !74, !75, !76, !77, !79, !135, !136, !137, !139, !140}
!61 = !DILocalVariable(name: "program", arg: 1, scope: !56, file: !57, line: 573, type: !50)
!62 = !DILocalVariable(name: "option", arg: 2, scope: !56, file: !57, line: 573, type: !50)
!63 = !DILocalVariable(name: "term", scope: !64, file: !57, line: 585, type: !50)
!64 = distinct !DILexicalBlock(scope: !65, file: !57, line: 582, column: 5)
!65 = distinct !DILexicalBlock(scope: !56, file: !57, line: 581, column: 7)
!66 = !DILocalVariable(name: "double_space", scope: !56, file: !57, line: 594, type: !67)
!67 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DILocalVariable(name: "first_word", scope: !56, file: !57, line: 595, type: !50)
!69 = !DILocalVariable(name: "option_text", scope: !56, file: !57, line: 596, type: !50)
!70 = !DILocalVariable(name: "s", scope: !71, file: !57, line: 608, type: !50)
!71 = distinct !DILexicalBlock(scope: !72, file: !57, line: 605, column: 5)
!72 = distinct !DILexicalBlock(scope: !73, file: !57, line: 604, column: 12)
!73 = distinct !DILexicalBlock(scope: !56, file: !57, line: 597, column: 7)
!74 = !DILocalVariable(name: "spaces", scope: !71, file: !57, line: 609, type: !47)
!75 = !DILocalVariable(name: "anchor_len", scope: !56, file: !57, line: 620, type: !47)
!76 = !DILocalVariable(name: "desc_text", scope: !56, file: !57, line: 625, type: !50)
!77 = !DILocalVariable(name: "__ptr", scope: !78, file: !57, line: 644, type: !50)
!78 = distinct !DILexicalBlock(scope: !56, file: !57, line: 644, column: 3)
!79 = !DILocalVariable(name: "__stream", scope: !78, file: !57, line: 644, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !45, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !45, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !45, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!108 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !46, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !44, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !47, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !45, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocalVariable(name: "__cnt", scope: !78, file: !57, line: 644, type: !47)
!136 = !DILocalVariable(name: "url_program", scope: !56, file: !57, line: 648, type: !50)
!137 = !DILocalVariable(name: "__ptr", scope: !138, file: !57, line: 686, type: !50)
!138 = distinct !DILexicalBlock(scope: !56, file: !57, line: 686, column: 3)
!139 = !DILocalVariable(name: "__stream", scope: !138, file: !57, line: 686, type: !80)
!140 = !DILocalVariable(name: "__cnt", scope: !138, file: !57, line: 686, type: !47)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1280, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !50, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !45, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !45, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 5)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 3, type: !50, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !157, splitDebugInlining: false, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "file_name", scope: !160, file: !161, line: 45, type: !50, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !162, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!162 = !{!158, !163}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !160, file: !161, line: 55, type: !67, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !167, file: !168, line: 66, type: !203, isLocal: false, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !169, globals: !170, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!169 = !{!44, !52}
!170 = !{!171, !197, !165, !199, !201}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "old_file_name", scope: !173, file: !168, line: 304, type: !50, isLocal: true, isDefinition: true)
!173 = distinct !DISubprogram(name: "verror_at_line", scope: !168, file: !168, line: 298, type: !174, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !190)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !45, !45, !50, !6, !50, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !177, line: 52, baseType: !178)
!177 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !179, line: 32, baseType: !180)
!179 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !181, baseType: !182)
!181 = !DIFile(filename: "lib/error.c", directory: "/src")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !183, size: 256, elements: !184)
!183 = !DINamespace(name: "std", scope: null)
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !182, file: !181, baseType: !44, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !182, file: !181, baseType: !44, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !182, file: !181, baseType: !44, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !182, file: !181, baseType: !45, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !182, file: !181, baseType: !45, size: 32, offset: 224)
!190 = !{!191, !192, !193, !194, !195, !196}
!191 = !DILocalVariable(name: "status", arg: 1, scope: !173, file: !168, line: 298, type: !45)
!192 = !DILocalVariable(name: "errnum", arg: 2, scope: !173, file: !168, line: 298, type: !45)
!193 = !DILocalVariable(name: "file_name", arg: 3, scope: !173, file: !168, line: 298, type: !50)
!194 = !DILocalVariable(name: "line_number", arg: 4, scope: !173, file: !168, line: 298, type: !6)
!195 = !DILocalVariable(name: "message", arg: 5, scope: !173, file: !168, line: 298, type: !50)
!196 = !DILocalVariable(name: "args", arg: 6, scope: !173, file: !168, line: 298, type: !176)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "old_line_number", scope: !173, file: !168, line: 305, type: !6, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "error_message_count", scope: !167, file: !168, line: 69, type: !6, isLocal: false, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !167, file: !168, line: 295, type: !45, isLocal: false, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !208, file: !209, line: 506, type: !45, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !209, file: !209, line: 485, type: !210, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !214)
!209 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!210 = !DISubroutineType(types: !211)
!211 = !{!45, !45, !45}
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !213, splitDebugInlining: false, nameTableKind: None)
!213 = !{!206}
!214 = !{!215, !216, !217, !218, !221}
!215 = !DILocalVariable(name: "fd", arg: 1, scope: !208, file: !209, line: 485, type: !45)
!216 = !DILocalVariable(name: "target", arg: 2, scope: !208, file: !209, line: 485, type: !45)
!217 = !DILocalVariable(name: "result", scope: !208, file: !209, line: 487, type: !45)
!218 = !DILocalVariable(name: "flags", scope: !219, file: !209, line: 530, type: !45)
!219 = distinct !DILexicalBlock(scope: !220, file: !209, line: 529, column: 5)
!220 = distinct !DILexicalBlock(scope: !208, file: !209, line: 528, column: 7)
!221 = !DILocalVariable(name: "saved_errno", scope: !222, file: !209, line: 533, type: !45)
!222 = distinct !DILexicalBlock(scope: !223, file: !209, line: 532, column: 9)
!223 = distinct !DILexicalBlock(scope: !219, file: !209, line: 531, column: 11)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "program_name", scope: !226, file: !227, line: 31, type: !50, isLocal: false, isDefinition: true)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !228, globals: !229, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!228 = !{!42}
!229 = !{!224}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "utf07FF", scope: !232, file: !233, line: 46, type: !263, isLocal: true, isDefinition: true)
!232 = distinct !DISubprogram(name: "proper_name_lite", scope: !233, file: !233, line: 38, type: !234, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !238)
!233 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!234 = !DISubroutineType(types: !235)
!235 = !{!50, !50, !50}
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !237, splitDebugInlining: false, nameTableKind: None)
!237 = !{!230}
!238 = !{!239, !240, !241, !242, !247}
!239 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !232, file: !233, line: 38, type: !50)
!240 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !232, file: !233, line: 38, type: !50)
!241 = !DILocalVariable(name: "translation", scope: !232, file: !233, line: 40, type: !50)
!242 = !DILocalVariable(name: "w", scope: !232, file: !233, line: 47, type: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !244, line: 37, baseType: !245)
!244 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !107, line: 57, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !107, line: 42, baseType: !6)
!247 = !DILocalVariable(name: "mbs", scope: !232, file: !233, line: 48, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !249, line: 6, baseType: !250)
!249 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !251, line: 21, baseType: !252)
!251 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 13, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !252, file: !251, line: 15, baseType: !45, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !252, file: !251, line: 20, baseType: !256, size: 32, offset: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !251, line: 16, size: 32, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !256, file: !251, line: 18, baseType: !6, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !256, file: !251, line: 19, baseType: !260, size: 32)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 32, elements: !261)
!261 = !{!262}
!262 = !DISubrange(count: 4)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 16, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !268, file: !269, line: 76, type: !337, isLocal: false, isDefinition: true)
!268 = distinct !DICompileUnit(language: DW_LANG_C99, file: !269, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !270, retainedTypes: !276, globals: !277, splitDebugInlining: false, nameTableKind: None)
!269 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!270 = !{!27, !271, !12}
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !28, line: 254, baseType: !6, size: 32, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!274 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!275 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!276 = !{!45, !46, !47}
!277 = !{!266, !278, !284, !296, !298, !303, !326, !333, !335}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !268, file: !269, line: 92, type: !280, isLocal: false, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !282)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!282 = !{!283}
!283 = !DISubrange(count: 10)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !268, file: !269, line: 1040, type: !286, isLocal: false, isDefinition: true)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !269, line: 56, size: 448, elements: !287)
!287 = !{!288, !289, !290, !294, !295}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !286, file: !269, line: 59, baseType: !27, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !269, line: 62, baseType: !45, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !286, file: !269, line: 66, baseType: !291, size: 256, offset: 64)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !286, file: !269, line: 69, baseType: !50, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !286, file: !269, line: 72, baseType: !50, size: 64, offset: 384)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !268, file: !269, line: 107, type: !286, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "slot0", scope: !268, file: !269, line: 831, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 2048, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 256)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "quote", scope: !305, file: !269, line: 228, type: !324, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "gettext_quote", scope: !269, file: !269, line: 197, type: !306, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !268, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!50, !50, !27}
!308 = !{!309, !310, !311, !312, !313}
!309 = !DILocalVariable(name: "msgid", arg: 1, scope: !305, file: !269, line: 197, type: !50)
!310 = !DILocalVariable(name: "s", arg: 2, scope: !305, file: !269, line: 197, type: !27)
!311 = !DILocalVariable(name: "translation", scope: !305, file: !269, line: 199, type: !50)
!312 = !DILocalVariable(name: "w", scope: !305, file: !269, line: 229, type: !243)
!313 = !DILocalVariable(name: "mbs", scope: !305, file: !269, line: 230, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !249, line: 6, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !251, line: 21, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 13, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !316, file: !251, line: 15, baseType: !45, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !316, file: !251, line: 20, baseType: !320, size: 32, offset: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !251, line: 16, size: 32, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !320, file: !251, line: 18, baseType: !6, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !320, file: !251, line: 19, baseType: !260, size: 32)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !325)
!325 = !{!265, !262}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "slotvec", scope: !268, file: !269, line: 834, type: !328, isLocal: true, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !269, line: 823, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !329, file: !269, line: 825, baseType: !47, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !329, file: !269, line: 826, baseType: !42, size: 64, offset: 64)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "nslots", scope: !268, file: !269, line: 832, type: !45, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "slotvec0", scope: !268, file: !269, line: 833, type: !329, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 704, elements: !339)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!339 = !{!340}
!340 = !DISubrange(count: 11)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !343, file: !344, line: 26, type: !346, isLocal: false, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !345, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!345 = !{!341}
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 376, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 47)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "exit_failure", scope: !351, file: !352, line: 24, type: !354, isLocal: false, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !353, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!353 = !{!349}
!354 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "internal_state", scope: !357, file: !358, line: 97, type: !361, isLocal: true, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!359 = !{!44, !47, !52}
!360 = !{!355}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !249, line: 6, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !251, line: 21, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 13, size: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !363, file: !251, line: 15, baseType: !45, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !363, file: !251, line: 20, baseType: !367, size: 32, offset: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !251, line: 16, size: 32, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !367, file: !251, line: 18, baseType: !6, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !367, file: !251, line: 19, baseType: !260, size: 32)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !375, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!375 = !{!376}
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !374, line: 40, baseType: !6, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!379 = !{!44}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !382, retainedTypes: !413, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!382 = !{!383, !395}
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !384, file: !381, line: 188, baseType: !6, size: 32, elements: !393)
!384 = distinct !DISubprogram(name: "x2nrealloc", scope: !381, file: !381, line: 176, type: !385, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !388)
!385 = !DISubroutineType(types: !386)
!386 = !{!44, !44, !387, !47}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!388 = !{!389, !390, !391, !392}
!389 = !DILocalVariable(name: "p", arg: 1, scope: !384, file: !381, line: 176, type: !44)
!390 = !DILocalVariable(name: "pn", arg: 2, scope: !384, file: !381, line: 176, type: !387)
!391 = !DILocalVariable(name: "s", arg: 3, scope: !384, file: !381, line: 176, type: !47)
!392 = !DILocalVariable(name: "n", scope: !384, file: !381, line: 178, type: !47)
!393 = !{!394}
!394 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !396, file: !381, line: 228, baseType: !6, size: 32, elements: !393)
!396 = distinct !DISubprogram(name: "xpalloc", scope: !381, file: !381, line: 223, type: !397, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !403)
!397 = !DISubroutineType(types: !398)
!398 = !{!44, !44, !399, !400, !402, !400}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !401, line: 130, baseType: !402)
!401 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !48, line: 35, baseType: !108)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DILocalVariable(name: "pa", arg: 1, scope: !396, file: !381, line: 223, type: !44)
!405 = !DILocalVariable(name: "pn", arg: 2, scope: !396, file: !381, line: 223, type: !399)
!406 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !396, file: !381, line: 223, type: !400)
!407 = !DILocalVariable(name: "n_max", arg: 4, scope: !396, file: !381, line: 223, type: !402)
!408 = !DILocalVariable(name: "s", arg: 5, scope: !396, file: !381, line: 223, type: !400)
!409 = !DILocalVariable(name: "n0", scope: !396, file: !381, line: 230, type: !400)
!410 = !DILocalVariable(name: "n", scope: !396, file: !381, line: 237, type: !400)
!411 = !DILocalVariable(name: "nbytes", scope: !396, file: !381, line: 248, type: !400)
!412 = !DILocalVariable(name: "adjusted_nbytes", scope: !396, file: !381, line: 252, type: !400)
!413 = !{!42, !44, !67, !108, !49}
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !419, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !426, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!426 = !{!67, !49, !44}
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!433 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!434 = !{i32 7, !"Dwarf Version", i32 5}
!435 = !{i32 2, !"Debug Info Version", i32 3}
!436 = !{i32 1, !"wchar_size", i32 4}
!437 = !{i32 1, !"branch-target-enforcement", i32 0}
!438 = !{i32 1, !"sign-return-address", i32 0}
!439 = !{i32 1, !"sign-return-address-all", i32 0}
!440 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!441 = !{i32 7, !"PIC Level", i32 2}
!442 = !{i32 7, !"PIE Level", i32 2}
!443 = !{i32 7, !"uwtable", i32 1}
!444 = !{i32 7, !"frame-pointer", i32 1}
!445 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 55, type: !446, scopeLine: 56, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !448)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !45}
!448 = !{!449}
!449 = !DILocalVariable(name: "status", arg: 1, scope: !445, file: !3, line: 55, type: !45)
!450 = !DILocation(line: 0, scope: !445)
!451 = !DILocation(line: 57, column: 14, scope: !452)
!452 = distinct !DILexicalBlock(scope: !445, file: !3, line: 57, column: 7)
!453 = !DILocation(line: 57, column: 7, scope: !445)
!454 = !DILocation(line: 58, column: 5, scope: !455)
!455 = distinct !DILexicalBlock(scope: !452, file: !3, line: 58, column: 5)
!456 = !{!457, !457, i64 0}
!457 = !{!"any pointer", !458, i64 0}
!458 = !{!"omnipotent char", !459, i64 0}
!459 = !{!"Simple C/C++ TBAA"}
!460 = !DILocation(line: 61, column: 7, scope: !461)
!461 = distinct !DILexicalBlock(scope: !452, file: !3, line: 60, column: 5)
!462 = !DILocation(line: 62, column: 7, scope: !461)
!463 = !DILocation(line: 70, column: 7, scope: !461)
!464 = !DILocation(line: 73, column: 7, scope: !461)
!465 = !DILocation(line: 76, column: 7, scope: !461)
!466 = !DILocation(line: 77, column: 7, scope: !461)
!467 = !DILocalVariable(name: "program", arg: 1, scope: !468, file: !57, line: 836, type: !50)
!468 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !57, file: !57, line: 836, type: !469, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !50}
!471 = !{!467, !472, !481, !482, !484, !485}
!472 = !DILocalVariable(name: "infomap", scope: !468, file: !57, line: 838, type: !473)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 896, elements: !479)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !468, file: !57, line: 838, size: 128, elements: !476)
!476 = !{!477, !478}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !475, file: !57, line: 838, baseType: !50, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !475, file: !57, line: 838, baseType: !50, size: 64, offset: 64)
!479 = !{!480}
!480 = !DISubrange(count: 7)
!481 = !DILocalVariable(name: "node", scope: !468, file: !57, line: 848, type: !50)
!482 = !DILocalVariable(name: "map_prog", scope: !468, file: !57, line: 849, type: !483)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!484 = !DILocalVariable(name: "lc_messages", scope: !468, file: !57, line: 861, type: !50)
!485 = !DILocalVariable(name: "url_program", scope: !468, file: !57, line: 874, type: !50)
!486 = !DILocation(line: 0, scope: !468, inlinedAt: !487)
!487 = distinct !DILocation(line: 78, column: 7, scope: !461)
!488 = !DILocation(line: 838, column: 3, scope: !468, inlinedAt: !487)
!489 = !DILocation(line: 838, column: 67, scope: !468, inlinedAt: !487)
!490 = !DILocation(line: 849, column: 36, scope: !468, inlinedAt: !487)
!491 = !DILocation(line: 851, column: 3, scope: !468, inlinedAt: !487)
!492 = !DILocalVariable(name: "__s1", arg: 1, scope: !493, file: !494, line: 1359, type: !50)
!493 = distinct !DISubprogram(name: "streq", scope: !494, file: !494, line: 1359, type: !495, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !497)
!494 = !DIFile(filename: "./lib/string.h", directory: "/src")
!495 = !DISubroutineType(types: !496)
!496 = !{!67, !50, !50}
!497 = !{!492, !498}
!498 = !DILocalVariable(name: "__s2", arg: 2, scope: !493, file: !494, line: 1359, type: !50)
!499 = !DILocation(line: 0, scope: !493, inlinedAt: !500)
!500 = distinct !DILocation(line: 851, column: 33, scope: !468, inlinedAt: !487)
!501 = !DILocation(line: 1361, column: 11, scope: !493, inlinedAt: !500)
!502 = !DILocation(line: 1361, column: 10, scope: !493, inlinedAt: !500)
!503 = !DILocation(line: 852, column: 13, scope: !468, inlinedAt: !487)
!504 = !DILocation(line: 851, column: 20, scope: !468, inlinedAt: !487)
!505 = !{!506, !457, i64 0}
!506 = !{!"infomap", !457, i64 0, !457, i64 8}
!507 = !DILocation(line: 851, column: 10, scope: !468, inlinedAt: !487)
!508 = !DILocation(line: 851, column: 28, scope: !468, inlinedAt: !487)
!509 = distinct !{!509, !491, !503, !510}
!510 = !{!"llvm.loop.mustprogress"}
!511 = !DILocation(line: 854, column: 17, scope: !512, inlinedAt: !487)
!512 = distinct !DILexicalBlock(scope: !468, file: !57, line: 854, column: 7)
!513 = !{!506, !457, i64 8}
!514 = !DILocation(line: 854, column: 7, scope: !512, inlinedAt: !487)
!515 = !DILocation(line: 854, column: 7, scope: !468, inlinedAt: !487)
!516 = !DILocation(line: 857, column: 3, scope: !468, inlinedAt: !487)
!517 = !DILocation(line: 861, column: 29, scope: !468, inlinedAt: !487)
!518 = !DILocation(line: 862, column: 7, scope: !519, inlinedAt: !487)
!519 = distinct !DILexicalBlock(scope: !468, file: !57, line: 862, column: 7)
!520 = !DILocation(line: 862, column: 19, scope: !519, inlinedAt: !487)
!521 = !DILocation(line: 862, column: 22, scope: !519, inlinedAt: !487)
!522 = !DILocation(line: 862, column: 7, scope: !468, inlinedAt: !487)
!523 = !DILocation(line: 868, column: 7, scope: !524, inlinedAt: !487)
!524 = distinct !DILexicalBlock(scope: !519, file: !57, line: 863, column: 5)
!525 = !DILocation(line: 870, column: 5, scope: !524, inlinedAt: !487)
!526 = !DILocation(line: 0, scope: !493, inlinedAt: !527)
!527 = distinct !DILocation(line: 874, column: 29, scope: !468, inlinedAt: !487)
!528 = !DILocation(line: 875, column: 3, scope: !468, inlinedAt: !487)
!529 = !DILocation(line: 877, column: 3, scope: !468, inlinedAt: !487)
!530 = !DILocation(line: 879, column: 1, scope: !468, inlinedAt: !487)
!531 = !DILocation(line: 80, column: 3, scope: !445)
!532 = !DISubprogram(name: "dcgettext", scope: !533, file: !533, line: 51, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!533 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!534 = !DISubroutineType(types: !535)
!535 = !{!42, !50, !50, !45}
!536 = !{}
!537 = !DISubprogram(name: "fputs_unlocked", scope: !177, file: !177, line: 691, type: !538, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!538 = !DISubroutineType(types: !539)
!539 = !{!45, !540, !541}
!540 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !50)
!541 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!542 = !DILocation(line: 0, scope: !56)
!543 = !DILocation(line: 581, column: 7, scope: !65)
!544 = !{!545, !545, i64 0}
!545 = !{!"int", !458, i64 0}
!546 = !DILocation(line: 581, column: 19, scope: !65)
!547 = !DILocation(line: 581, column: 7, scope: !56)
!548 = !DILocation(line: 585, column: 26, scope: !64)
!549 = !DILocation(line: 0, scope: !64)
!550 = !DILocation(line: 586, column: 23, scope: !64)
!551 = !DILocation(line: 586, column: 28, scope: !64)
!552 = !DILocation(line: 586, column: 32, scope: !64)
!553 = !{!458, !458, i64 0}
!554 = !DILocation(line: 586, column: 38, scope: !64)
!555 = !DILocation(line: 0, scope: !493, inlinedAt: !556)
!556 = distinct !DILocation(line: 586, column: 41, scope: !64)
!557 = !DILocation(line: 1361, column: 11, scope: !493, inlinedAt: !556)
!558 = !DILocation(line: 1361, column: 10, scope: !493, inlinedAt: !556)
!559 = !DILocation(line: 586, column: 19, scope: !64)
!560 = !DILocation(line: 587, column: 5, scope: !64)
!561 = !DILocation(line: 588, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !56, file: !57, line: 588, column: 7)
!563 = !DILocation(line: 588, column: 7, scope: !56)
!564 = !DILocation(line: 590, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !562, file: !57, line: 589, column: 5)
!566 = !DILocation(line: 591, column: 7, scope: !565)
!567 = !DILocation(line: 595, column: 37, scope: !56)
!568 = !DILocation(line: 595, column: 35, scope: !56)
!569 = !DILocation(line: 596, column: 29, scope: !56)
!570 = !DILocation(line: 597, column: 8, scope: !73)
!571 = !DILocation(line: 597, column: 7, scope: !56)
!572 = !DILocation(line: 604, column: 24, scope: !72)
!573 = !DILocation(line: 604, column: 12, scope: !73)
!574 = !DILocation(line: 0, scope: !71)
!575 = !DILocation(line: 610, column: 16, scope: !71)
!576 = !DILocation(line: 610, column: 7, scope: !71)
!577 = !DILocation(line: 611, column: 21, scope: !71)
!578 = !{!579, !579, i64 0}
!579 = !{!"short", !458, i64 0}
!580 = !DILocation(line: 611, column: 19, scope: !71)
!581 = !DILocation(line: 611, column: 16, scope: !71)
!582 = !DILocation(line: 610, column: 30, scope: !71)
!583 = distinct !{!583, !576, !577, !510}
!584 = !DILocation(line: 612, column: 18, scope: !585)
!585 = distinct !DILexicalBlock(scope: !71, file: !57, line: 612, column: 11)
!586 = !DILocation(line: 612, column: 11, scope: !71)
!587 = !DILocation(line: 620, column: 23, scope: !56)
!588 = !DILocation(line: 625, column: 39, scope: !56)
!589 = !DILocation(line: 626, column: 3, scope: !56)
!590 = !DILocation(line: 626, column: 10, scope: !56)
!591 = !DILocation(line: 626, column: 21, scope: !56)
!592 = !DILocation(line: 628, column: 44, scope: !593)
!593 = distinct !DILexicalBlock(scope: !594, file: !57, line: 628, column: 11)
!594 = distinct !DILexicalBlock(scope: !56, file: !57, line: 627, column: 5)
!595 = !DILocation(line: 628, column: 32, scope: !593)
!596 = !DILocation(line: 628, column: 49, scope: !593)
!597 = !DILocation(line: 628, column: 11, scope: !594)
!598 = !DILocation(line: 630, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !594, file: !57, line: 630, column: 11)
!600 = !DILocation(line: 630, column: 11, scope: !594)
!601 = !DILocation(line: 632, column: 26, scope: !602)
!602 = distinct !DILexicalBlock(scope: !603, file: !57, line: 632, column: 15)
!603 = distinct !DILexicalBlock(scope: !599, file: !57, line: 631, column: 9)
!604 = !DILocation(line: 632, column: 34, scope: !602)
!605 = !DILocation(line: 632, column: 37, scope: !602)
!606 = !DILocation(line: 632, column: 15, scope: !603)
!607 = !DILocation(line: 636, column: 29, scope: !608)
!608 = distinct !DILexicalBlock(scope: !603, file: !57, line: 636, column: 15)
!609 = !DILocation(line: 640, column: 16, scope: !594)
!610 = distinct !{!610, !589, !611, !510}
!611 = !DILocation(line: 641, column: 5, scope: !56)
!612 = !DILocation(line: 644, column: 3, scope: !56)
!613 = !DILocation(line: 0, scope: !493, inlinedAt: !614)
!614 = distinct !DILocation(line: 648, column: 31, scope: !56)
!615 = !DILocation(line: 0, scope: !493, inlinedAt: !616)
!616 = distinct !DILocation(line: 649, column: 31, scope: !56)
!617 = !DILocation(line: 0, scope: !493, inlinedAt: !618)
!618 = distinct !DILocation(line: 650, column: 31, scope: !56)
!619 = !DILocation(line: 0, scope: !493, inlinedAt: !620)
!620 = distinct !DILocation(line: 651, column: 31, scope: !56)
!621 = !DILocation(line: 0, scope: !493, inlinedAt: !622)
!622 = distinct !DILocation(line: 652, column: 31, scope: !56)
!623 = !DILocation(line: 0, scope: !493, inlinedAt: !624)
!624 = distinct !DILocation(line: 653, column: 31, scope: !56)
!625 = !DILocation(line: 0, scope: !493, inlinedAt: !626)
!626 = distinct !DILocation(line: 654, column: 31, scope: !56)
!627 = !DILocation(line: 0, scope: !493, inlinedAt: !628)
!628 = distinct !DILocation(line: 655, column: 31, scope: !56)
!629 = !DILocation(line: 0, scope: !493, inlinedAt: !630)
!630 = distinct !DILocation(line: 656, column: 31, scope: !56)
!631 = !DILocation(line: 0, scope: !493, inlinedAt: !632)
!632 = distinct !DILocation(line: 657, column: 31, scope: !56)
!633 = !DILocation(line: 663, column: 7, scope: !634)
!634 = distinct !DILexicalBlock(scope: !56, file: !57, line: 663, column: 7)
!635 = !DILocation(line: 664, column: 7, scope: !634)
!636 = !DILocation(line: 664, column: 10, scope: !634)
!637 = !DILocation(line: 663, column: 7, scope: !56)
!638 = !DILocation(line: 669, column: 7, scope: !639)
!639 = distinct !DILexicalBlock(scope: !634, file: !57, line: 665, column: 5)
!640 = !DILocation(line: 671, column: 5, scope: !639)
!641 = !DILocation(line: 676, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !634, file: !57, line: 673, column: 5)
!643 = !DILocation(line: 679, column: 3, scope: !56)
!644 = !DILocation(line: 683, column: 3, scope: !56)
!645 = !DILocation(line: 686, column: 3, scope: !56)
!646 = !DILocation(line: 688, column: 3, scope: !56)
!647 = !DILocation(line: 691, column: 3, scope: !56)
!648 = !DILocation(line: 695, column: 3, scope: !56)
!649 = !DILocation(line: 696, column: 1, scope: !56)
!650 = !DISubprogram(name: "setlocale", scope: !651, file: !651, line: 122, type: !652, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!651 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!652 = !DISubroutineType(types: !653)
!653 = !{!42, !45, !50}
!654 = !DISubprogram(name: "getenv", scope: !655, file: !655, line: 641, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!655 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!656 = !DISubroutineType(types: !657)
!657 = !{!42, !50}
!658 = !DISubprogram(name: "fwrite_unlocked", scope: !177, file: !177, line: 704, type: !659, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!659 = !DISubroutineType(types: !660)
!660 = !{!47, !661, !47, !47, !541}
!661 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!664 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 166, type: !665, scopeLine: 167, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !668)
!665 = !DISubroutineType(types: !666)
!666 = !{!45, !45, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676}
!669 = !DILocalVariable(name: "argc", arg: 1, scope: !664, file: !3, line: 166, type: !45)
!670 = !DILocalVariable(name: "argv", arg: 2, scope: !664, file: !3, line: 166, type: !667)
!671 = !DILocalVariable(name: "arg_data", scope: !664, file: !3, line: 168, type: !67)
!672 = !DILocalVariable(name: "arg_file_system", scope: !664, file: !3, line: 168, type: !67)
!673 = !DILocalVariable(name: "ok", scope: !664, file: !3, line: 169, type: !67)
!674 = !DILocalVariable(name: "c", scope: !664, file: !3, line: 179, type: !45)
!675 = !DILocalVariable(name: "args_specified", scope: !664, file: !3, line: 202, type: !67)
!676 = !DILocalVariable(name: "mode", scope: !664, file: !3, line: 211, type: !5)
!677 = !DILocation(line: 0, scope: !664)
!678 = !DILocation(line: 172, column: 21, scope: !664)
!679 = !DILocation(line: 172, column: 3, scope: !664)
!680 = !DILocation(line: 173, column: 3, scope: !664)
!681 = !DILocation(line: 174, column: 3, scope: !664)
!682 = !DILocation(line: 175, column: 3, scope: !664)
!683 = !DILocation(line: 177, column: 3, scope: !664)
!684 = !DILocation(line: 180, column: 3, scope: !664)
!685 = !DILocation(line: 180, column: 15, scope: !664)
!686 = distinct !{!686, !684, !687, !510}
!687 = !DILocation(line: 200, column: 5, scope: !664)
!688 = !DILocation(line: 193, column: 9, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !3, line: 184, column: 9)
!690 = distinct !DILexicalBlock(scope: !664, file: !3, line: 182, column: 5)
!691 = !DILocation(line: 195, column: 9, scope: !689)
!692 = !DILocation(line: 198, column: 11, scope: !689)
!693 = !DILocation(line: 202, column: 25, scope: !664)
!694 = !DILocation(line: 202, column: 32, scope: !664)
!695 = !DILocation(line: 204, column: 16, scope: !696)
!696 = distinct !DILexicalBlock(scope: !664, file: !3, line: 204, column: 7)
!697 = !DILocation(line: 205, column: 5, scope: !696)
!698 = !DILocation(line: 208, column: 23, scope: !699)
!699 = distinct !DILexicalBlock(scope: !664, file: !3, line: 208, column: 7)
!700 = !DILocation(line: 209, column: 5, scope: !699)
!701 = !DILocation(line: 212, column: 24, scope: !702)
!702 = distinct !DILexicalBlock(scope: !664, file: !3, line: 212, column: 7)
!703 = !DILocation(line: 221, column: 7, scope: !664)
!704 = !DILocation(line: 222, column: 5, scope: !705)
!705 = distinct !DILexicalBlock(scope: !664, file: !3, line: 221, column: 7)
!706 = !DILocation(line: 226, column: 31, scope: !707)
!707 = distinct !DILexicalBlock(scope: !708, file: !3, line: 225, column: 7)
!708 = distinct !DILexicalBlock(scope: !709, file: !3, line: 225, column: 7)
!709 = distinct !DILexicalBlock(scope: !705, file: !3, line: 224, column: 5)
!710 = !DILocalVariable(name: "mode", arg: 1, scope: !711, file: !3, line: 87, type: !5)
!711 = distinct !DISubprogram(name: "sync_arg", scope: !3, file: !3, line: 87, type: !712, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!712 = !DISubroutineType(types: !713)
!713 = !{!67, !5, !50}
!714 = !{!710, !715, !716, !717, !718, !721, !722, !723}
!715 = !DILocalVariable(name: "file", arg: 2, scope: !711, file: !3, line: 87, type: !50)
!716 = !DILocalVariable(name: "open_flags", scope: !711, file: !3, line: 89, type: !45)
!717 = !DILocalVariable(name: "fd", scope: !711, file: !3, line: 99, type: !45)
!718 = !DILocalVariable(name: "rd_errno", scope: !719, file: !3, line: 104, type: !45)
!719 = distinct !DILexicalBlock(scope: !720, file: !3, line: 101, column: 5)
!720 = distinct !DILexicalBlock(scope: !711, file: !3, line: 100, column: 7)
!721 = !DILocalVariable(name: "ret", scope: !711, file: !3, line: 114, type: !67)
!722 = !DILocalVariable(name: "fdflags", scope: !711, file: !3, line: 117, type: !45)
!723 = !DILocalVariable(name: "sync_status", scope: !724, file: !3, line: 128, type: !45)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 127, column: 5)
!725 = distinct !DILexicalBlock(scope: !711, file: !3, line: 126, column: 7)
!726 = !DILocation(line: 0, scope: !711, inlinedAt: !727)
!727 = distinct !DILocation(line: 226, column: 15, scope: !707)
!728 = !DILocation(line: 99, column: 12, scope: !711, inlinedAt: !727)
!729 = !DILocation(line: 100, column: 10, scope: !720, inlinedAt: !727)
!730 = !DILocation(line: 100, column: 7, scope: !711, inlinedAt: !727)
!731 = !DILocation(line: 104, column: 22, scope: !719, inlinedAt: !727)
!732 = !DILocation(line: 0, scope: !719, inlinedAt: !727)
!733 = !DILocation(line: 106, column: 14, scope: !734, inlinedAt: !727)
!734 = distinct !DILexicalBlock(scope: !719, file: !3, line: 105, column: 11)
!735 = !DILocation(line: 107, column: 14, scope: !736, inlinedAt: !727)
!736 = distinct !DILexicalBlock(scope: !719, file: !3, line: 107, column: 11)
!737 = !DILocation(line: 107, column: 11, scope: !719, inlinedAt: !727)
!738 = !DILocation(line: 117, column: 17, scope: !711, inlinedAt: !727)
!739 = !DILocation(line: 118, column: 15, scope: !740, inlinedAt: !727)
!740 = distinct !DILexicalBlock(scope: !711, file: !3, line: 118, column: 7)
!741 = !DILocation(line: 119, column: 7, scope: !740, inlinedAt: !727)
!742 = !DILocation(line: 119, column: 38, scope: !740, inlinedAt: !727)
!743 = !DILocation(line: 119, column: 10, scope: !740, inlinedAt: !727)
!744 = !DILocation(line: 119, column: 53, scope: !740, inlinedAt: !727)
!745 = !DILocation(line: 118, column: 7, scope: !711, inlinedAt: !727)
!746 = !DILocation(line: 0, scope: !724, inlinedAt: !727)
!747 = !DILocation(line: 130, column: 7, scope: !724, inlinedAt: !727)
!748 = !DILocation(line: 133, column: 25, scope: !749, inlinedAt: !727)
!749 = distinct !DILexicalBlock(scope: !724, file: !3, line: 131, column: 9)
!750 = !DILocation(line: 134, column: 11, scope: !749, inlinedAt: !727)
!751 = !DILocation(line: 137, column: 25, scope: !749, inlinedAt: !727)
!752 = !DILocation(line: 138, column: 11, scope: !749, inlinedAt: !727)
!753 = !DILocation(line: 142, column: 25, scope: !749, inlinedAt: !727)
!754 = !DILocation(line: 143, column: 11, scope: !749, inlinedAt: !727)
!755 = !DILocation(line: 146, column: 11, scope: !749, inlinedAt: !727)
!756 = !DILocation(line: 0, scope: !749, inlinedAt: !727)
!757 = !DILocation(line: 149, column: 23, scope: !758, inlinedAt: !727)
!758 = distinct !DILexicalBlock(scope: !724, file: !3, line: 149, column: 11)
!759 = !DILocation(line: 149, column: 11, scope: !724, inlinedAt: !727)
!760 = !DILocation(line: 156, column: 7, scope: !761, inlinedAt: !727)
!761 = distinct !DILexicalBlock(scope: !711, file: !3, line: 156, column: 7)
!762 = !DILocation(line: 156, column: 18, scope: !761, inlinedAt: !727)
!763 = !DILocation(line: 156, column: 7, scope: !711, inlinedAt: !727)
!764 = !DILocation(line: 158, column: 7, scope: !765, inlinedAt: !727)
!765 = distinct !DILexicalBlock(scope: !761, file: !3, line: 157, column: 5)
!766 = !DILocation(line: 160, column: 5, scope: !765, inlinedAt: !727)
!767 = !DILocation(line: 163, column: 1, scope: !711, inlinedAt: !727)
!768 = !DILocation(line: 226, column: 12, scope: !707)
!769 = !DILocation(line: 225, column: 35, scope: !707)
!770 = !DILocation(line: 225, column: 21, scope: !707)
!771 = !DILocation(line: 225, column: 7, scope: !708)
!772 = distinct !{!772, !771, !773, !510}
!773 = !DILocation(line: 226, column: 43, scope: !708)
!774 = !DILocation(line: 229, column: 10, scope: !664)
!775 = !DILocation(line: 230, column: 1, scope: !664)
!776 = !DISubprogram(name: "bindtextdomain", scope: !533, file: !533, line: 86, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!777 = !DISubroutineType(types: !778)
!778 = !{!42, !50, !50}
!779 = !DISubprogram(name: "textdomain", scope: !533, file: !533, line: 82, type: !656, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!780 = !DISubprogram(name: "atexit", scope: !655, file: !655, line: 602, type: !781, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!781 = !DISubroutineType(types: !782)
!782 = !{!45, !203}
!783 = !DISubprogram(name: "getopt_long", scope: !144, file: !144, line: 66, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!784 = !DISubroutineType(types: !785)
!785 = !{!45, !45, !786, !50, !788, !149}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!789 = !DISubprogram(name: "sync", scope: !790, file: !790, line: 1005, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!790 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!791 = !DISubprogram(name: "open", scope: !792, file: !792, line: 181, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!792 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!793 = !DISubroutineType(types: !794)
!794 = !{!45, !50, !45, null}
!795 = !DISubprogram(name: "fdatasync", scope: !790, file: !790, line: 1150, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!796 = !DISubroutineType(types: !797)
!797 = !{!45, !45}
!798 = !DISubprogram(name: "fsync", scope: !790, file: !790, line: 989, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!799 = !DISubprogram(name: "syncfs", scope: !790, file: !790, line: 995, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!800 = !DISubprogram(name: "close", scope: !790, file: !790, line: 358, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!801 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !161, file: !161, line: 50, type: !469, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !802)
!802 = !{!803}
!803 = !DILocalVariable(name: "file", arg: 1, scope: !801, file: !161, line: 50, type: !50)
!804 = !DILocation(line: 0, scope: !801)
!805 = !DILocation(line: 52, column: 13, scope: !801)
!806 = !DILocation(line: 53, column: 1, scope: !801)
!807 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !161, file: !161, line: 87, type: !808, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !67}
!810 = !{!811}
!811 = !DILocalVariable(name: "ignore", arg: 1, scope: !807, file: !161, line: 87, type: !67)
!812 = !DILocation(line: 0, scope: !807)
!813 = !DILocation(line: 89, column: 16, scope: !807)
!814 = !{!815, !815, i64 0}
!815 = !{!"_Bool", !458, i64 0}
!816 = !DILocation(line: 90, column: 1, scope: !807)
!817 = distinct !DISubprogram(name: "close_stdout", scope: !161, file: !161, line: 116, type: !204, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !160, retainedNodes: !818)
!818 = !{!819}
!819 = !DILocalVariable(name: "write_error", scope: !820, file: !161, line: 121, type: !50)
!820 = distinct !DILexicalBlock(scope: !821, file: !161, line: 120, column: 5)
!821 = distinct !DILexicalBlock(scope: !817, file: !161, line: 118, column: 7)
!822 = !DILocation(line: 118, column: 21, scope: !821)
!823 = !DILocation(line: 118, column: 7, scope: !821)
!824 = !DILocation(line: 118, column: 29, scope: !821)
!825 = !DILocation(line: 119, column: 7, scope: !821)
!826 = !DILocation(line: 119, column: 12, scope: !821)
!827 = !{i8 0, i8 2}
!828 = !DILocation(line: 119, column: 25, scope: !821)
!829 = !DILocation(line: 119, column: 28, scope: !821)
!830 = !DILocation(line: 119, column: 34, scope: !821)
!831 = !DILocation(line: 118, column: 7, scope: !817)
!832 = !DILocation(line: 121, column: 33, scope: !820)
!833 = !DILocation(line: 0, scope: !820)
!834 = !DILocation(line: 122, column: 11, scope: !835)
!835 = distinct !DILexicalBlock(scope: !820, file: !161, line: 122, column: 11)
!836 = !DILocation(line: 0, scope: !835)
!837 = !DILocation(line: 122, column: 11, scope: !820)
!838 = !DILocation(line: 123, column: 9, scope: !835)
!839 = !DILocation(line: 126, column: 9, scope: !835)
!840 = !DILocation(line: 128, column: 14, scope: !820)
!841 = !DILocation(line: 128, column: 7, scope: !820)
!842 = !DILocation(line: 133, column: 42, scope: !843)
!843 = distinct !DILexicalBlock(scope: !817, file: !161, line: 133, column: 7)
!844 = !DILocation(line: 133, column: 28, scope: !843)
!845 = !DILocation(line: 133, column: 50, scope: !843)
!846 = !DILocation(line: 133, column: 7, scope: !817)
!847 = !DILocation(line: 134, column: 12, scope: !843)
!848 = !DILocation(line: 134, column: 5, scope: !843)
!849 = !DILocation(line: 135, column: 1, scope: !817)
!850 = distinct !DISubprogram(name: "verror", scope: !168, file: !168, line: 251, type: !851, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !853)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !45, !45, !50, !176}
!853 = !{!854, !855, !856, !857}
!854 = !DILocalVariable(name: "status", arg: 1, scope: !850, file: !168, line: 251, type: !45)
!855 = !DILocalVariable(name: "errnum", arg: 2, scope: !850, file: !168, line: 251, type: !45)
!856 = !DILocalVariable(name: "message", arg: 3, scope: !850, file: !168, line: 251, type: !50)
!857 = !DILocalVariable(name: "args", arg: 4, scope: !850, file: !168, line: 251, type: !176)
!858 = !DILocation(line: 0, scope: !850)
!859 = !DILocation(line: 251, column: 1, scope: !850)
!860 = !DILocation(line: 261, column: 3, scope: !850)
!861 = !DILocation(line: 265, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !850, file: !168, line: 265, column: 7)
!863 = !DILocation(line: 265, column: 7, scope: !850)
!864 = !DILocation(line: 266, column: 5, scope: !862)
!865 = !DILocation(line: 272, column: 7, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !168, line: 268, column: 5)
!867 = !DILocation(line: 276, column: 3, scope: !850)
!868 = !{i64 0, i64 8, !456, i64 8, i64 8, !456, i64 16, i64 8, !456, i64 24, i64 4, !544, i64 28, i64 4, !544}
!869 = !DILocation(line: 282, column: 1, scope: !850)
!870 = distinct !DISubprogram(name: "flush_stdout", scope: !168, file: !168, line: 163, type: !204, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !871)
!871 = !{!872}
!872 = !DILocalVariable(name: "stdout_fd", scope: !870, file: !168, line: 166, type: !45)
!873 = !DILocation(line: 0, scope: !870)
!874 = !DILocalVariable(name: "fd", arg: 1, scope: !875, file: !168, line: 145, type: !45)
!875 = distinct !DISubprogram(name: "is_open", scope: !168, file: !168, line: 145, type: !796, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !876)
!876 = !{!874}
!877 = !DILocation(line: 0, scope: !875, inlinedAt: !878)
!878 = distinct !DILocation(line: 182, column: 25, scope: !879)
!879 = distinct !DILexicalBlock(scope: !870, file: !168, line: 182, column: 7)
!880 = !DILocation(line: 157, column: 15, scope: !875, inlinedAt: !878)
!881 = !DILocation(line: 182, column: 25, scope: !879)
!882 = !DILocation(line: 182, column: 7, scope: !870)
!883 = !DILocation(line: 184, column: 5, scope: !879)
!884 = !DILocation(line: 185, column: 1, scope: !870)
!885 = distinct !DISubprogram(name: "error_tail", scope: !168, file: !168, line: 219, type: !851, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "status", arg: 1, scope: !885, file: !168, line: 219, type: !45)
!888 = !DILocalVariable(name: "errnum", arg: 2, scope: !885, file: !168, line: 219, type: !45)
!889 = !DILocalVariable(name: "message", arg: 3, scope: !885, file: !168, line: 219, type: !50)
!890 = !DILocalVariable(name: "args", arg: 4, scope: !885, file: !168, line: 219, type: !176)
!891 = !DILocation(line: 0, scope: !885)
!892 = !DILocation(line: 219, column: 1, scope: !885)
!893 = !DILocation(line: 229, column: 13, scope: !885)
!894 = !DILocation(line: 229, column: 3, scope: !885)
!895 = !DILocalVariable(name: "__stream", arg: 1, scope: !896, file: !897, line: 132, type: !900)
!896 = distinct !DISubprogram(name: "vfprintf", scope: !897, file: !897, line: 132, type: !898, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !935)
!897 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!898 = !DISubroutineType(types: !899)
!899 = !{!45, !900, !540, !178}
!900 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !903, file: !84, line: 51, baseType: !45, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !903, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !903, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !903, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !903, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !903, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !903, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !903, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !903, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !903, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !903, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !903, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !903, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !903, file: !84, line: 70, baseType: !919, size: 64, offset: 832)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !903, file: !84, line: 72, baseType: !45, size: 32, offset: 896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !903, file: !84, line: 73, baseType: !45, size: 32, offset: 928)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !903, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !903, file: !84, line: 77, baseType: !46, size: 16, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !903, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !903, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !903, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !903, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !903, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !903, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !903, file: !84, line: 93, baseType: !919, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !903, file: !84, line: 94, baseType: !44, size: 64, offset: 1408)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !903, file: !84, line: 95, baseType: !47, size: 64, offset: 1472)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !903, file: !84, line: 96, baseType: !45, size: 32, offset: 1536)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !903, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!935 = !{!895, !936, !937}
!936 = !DILocalVariable(name: "__fmt", arg: 2, scope: !896, file: !897, line: 133, type: !540)
!937 = !DILocalVariable(name: "__ap", arg: 3, scope: !896, file: !897, line: 133, type: !178)
!938 = !DILocation(line: 0, scope: !896, inlinedAt: !939)
!939 = distinct !DILocation(line: 229, column: 3, scope: !885)
!940 = !DILocation(line: 135, column: 10, scope: !896, inlinedAt: !939)
!941 = !{!942, !944}
!942 = distinct !{!942, !943, !"vfprintf.inline: argument 0"}
!943 = distinct !{!943, !"vfprintf.inline"}
!944 = distinct !{!944, !943, !"vfprintf.inline: argument 1"}
!945 = !DILocation(line: 232, column: 3, scope: !885)
!946 = !DILocation(line: 233, column: 7, scope: !947)
!947 = distinct !DILexicalBlock(scope: !885, file: !168, line: 233, column: 7)
!948 = !DILocation(line: 233, column: 7, scope: !885)
!949 = !DILocalVariable(name: "errnum", arg: 1, scope: !950, file: !168, line: 188, type: !45)
!950 = distinct !DISubprogram(name: "print_errno_message", scope: !168, file: !168, line: 188, type: !446, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !951)
!951 = !{!949, !952, !953}
!952 = !DILocalVariable(name: "s", scope: !950, file: !168, line: 190, type: !50)
!953 = !DILocalVariable(name: "errbuf", scope: !950, file: !168, line: 193, type: !954)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8192, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1024)
!957 = !DILocation(line: 0, scope: !950, inlinedAt: !958)
!958 = distinct !DILocation(line: 234, column: 5, scope: !947)
!959 = !DILocation(line: 193, column: 3, scope: !950, inlinedAt: !958)
!960 = !DILocation(line: 193, column: 8, scope: !950, inlinedAt: !958)
!961 = !DILocation(line: 195, column: 7, scope: !950, inlinedAt: !958)
!962 = !DILocation(line: 207, column: 9, scope: !963, inlinedAt: !958)
!963 = distinct !DILexicalBlock(scope: !950, file: !168, line: 207, column: 7)
!964 = !DILocation(line: 207, column: 7, scope: !950, inlinedAt: !958)
!965 = !DILocation(line: 208, column: 9, scope: !963, inlinedAt: !958)
!966 = !DILocation(line: 208, column: 5, scope: !963, inlinedAt: !958)
!967 = !DILocation(line: 214, column: 3, scope: !950, inlinedAt: !958)
!968 = !DILocation(line: 216, column: 1, scope: !950, inlinedAt: !958)
!969 = !DILocation(line: 234, column: 5, scope: !947)
!970 = !DILocation(line: 238, column: 3, scope: !885)
!971 = !DILocalVariable(name: "__c", arg: 1, scope: !972, file: !973, line: 101, type: !45)
!972 = distinct !DISubprogram(name: "putc_unlocked", scope: !973, file: !973, line: 101, type: !974, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !976)
!973 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!974 = !DISubroutineType(types: !975)
!975 = !{!45, !45, !901}
!976 = !{!971, !977}
!977 = !DILocalVariable(name: "__stream", arg: 2, scope: !972, file: !973, line: 101, type: !901)
!978 = !DILocation(line: 0, scope: !972, inlinedAt: !979)
!979 = distinct !DILocation(line: 238, column: 3, scope: !885)
!980 = !DILocation(line: 103, column: 10, scope: !972, inlinedAt: !979)
!981 = !{!982, !457, i64 40}
!982 = !{!"_IO_FILE", !545, i64 0, !457, i64 8, !457, i64 16, !457, i64 24, !457, i64 32, !457, i64 40, !457, i64 48, !457, i64 56, !457, i64 64, !457, i64 72, !457, i64 80, !457, i64 88, !457, i64 96, !457, i64 104, !545, i64 112, !545, i64 116, !983, i64 120, !579, i64 128, !458, i64 130, !458, i64 131, !457, i64 136, !983, i64 144, !457, i64 152, !457, i64 160, !457, i64 168, !457, i64 176, !983, i64 184, !545, i64 192, !458, i64 196}
!983 = !{!"long", !458, i64 0}
!984 = !{!982, !457, i64 48}
!985 = !{!"branch_weights", i32 2000, i32 1}
!986 = !DILocation(line: 240, column: 3, scope: !885)
!987 = !DILocation(line: 241, column: 7, scope: !988)
!988 = distinct !DILexicalBlock(scope: !885, file: !168, line: 241, column: 7)
!989 = !DILocation(line: 241, column: 7, scope: !885)
!990 = !DILocation(line: 242, column: 5, scope: !988)
!991 = !DILocation(line: 243, column: 1, scope: !885)
!992 = !DISubprogram(name: "strerror_r", scope: !993, file: !993, line: 444, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!993 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!994 = !DISubroutineType(types: !995)
!995 = !{!42, !45, !42, !47}
!996 = !DISubprogram(name: "fflush_unlocked", scope: !177, file: !177, line: 239, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!997 = !DISubroutineType(types: !998)
!998 = !{!45, !901}
!999 = !DISubprogram(name: "fcntl", scope: !792, file: !792, line: 149, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!45, !45, !45, null}
!1002 = distinct !DISubprogram(name: "error", scope: !168, file: !168, line: 285, type: !1003, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !1005)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !45, !45, !50, null}
!1005 = !{!1006, !1007, !1008, !1009}
!1006 = !DILocalVariable(name: "status", arg: 1, scope: !1002, file: !168, line: 285, type: !45)
!1007 = !DILocalVariable(name: "errnum", arg: 2, scope: !1002, file: !168, line: 285, type: !45)
!1008 = !DILocalVariable(name: "message", arg: 3, scope: !1002, file: !168, line: 285, type: !50)
!1009 = !DILocalVariable(name: "ap", scope: !1002, file: !168, line: 287, type: !176)
!1010 = !DILocation(line: 0, scope: !1002)
!1011 = !DILocation(line: 287, column: 3, scope: !1002)
!1012 = !DILocation(line: 287, column: 11, scope: !1002)
!1013 = !DILocation(line: 288, column: 3, scope: !1002)
!1014 = !DILocation(line: 289, column: 3, scope: !1002)
!1015 = !DILocation(line: 290, column: 3, scope: !1002)
!1016 = !DILocation(line: 291, column: 1, scope: !1002)
!1017 = !DILocation(line: 0, scope: !173)
!1018 = !DILocation(line: 298, column: 1, scope: !173)
!1019 = !DILocation(line: 302, column: 7, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !173, file: !168, line: 302, column: 7)
!1021 = !DILocation(line: 302, column: 7, scope: !173)
!1022 = !DILocation(line: 307, column: 11, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !168, line: 307, column: 11)
!1024 = distinct !DILexicalBlock(scope: !1020, file: !168, line: 303, column: 5)
!1025 = !DILocation(line: 307, column: 27, scope: !1023)
!1026 = !DILocation(line: 308, column: 11, scope: !1023)
!1027 = !DILocation(line: 308, column: 28, scope: !1023)
!1028 = !DILocation(line: 308, column: 25, scope: !1023)
!1029 = !DILocation(line: 309, column: 15, scope: !1023)
!1030 = !DILocation(line: 309, column: 33, scope: !1023)
!1031 = !DILocation(line: 310, column: 19, scope: !1023)
!1032 = !DILocation(line: 311, column: 22, scope: !1023)
!1033 = !DILocation(line: 311, column: 56, scope: !1023)
!1034 = !DILocation(line: 307, column: 11, scope: !1024)
!1035 = !DILocation(line: 316, column: 21, scope: !1024)
!1036 = !DILocation(line: 317, column: 23, scope: !1024)
!1037 = !DILocation(line: 318, column: 5, scope: !1024)
!1038 = !DILocation(line: 327, column: 3, scope: !173)
!1039 = !DILocation(line: 331, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !173, file: !168, line: 331, column: 7)
!1041 = !DILocation(line: 331, column: 7, scope: !173)
!1042 = !DILocation(line: 332, column: 5, scope: !1040)
!1043 = !DILocation(line: 338, column: 7, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !168, line: 334, column: 5)
!1045 = !DILocation(line: 346, column: 3, scope: !173)
!1046 = !DILocation(line: 350, column: 3, scope: !173)
!1047 = !DILocation(line: 356, column: 1, scope: !173)
!1048 = distinct !DISubprogram(name: "error_at_line", scope: !168, file: !168, line: 359, type: !1049, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !1051)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !45, !45, !50, !6, !50, null}
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057}
!1052 = !DILocalVariable(name: "status", arg: 1, scope: !1048, file: !168, line: 359, type: !45)
!1053 = !DILocalVariable(name: "errnum", arg: 2, scope: !1048, file: !168, line: 359, type: !45)
!1054 = !DILocalVariable(name: "file_name", arg: 3, scope: !1048, file: !168, line: 359, type: !50)
!1055 = !DILocalVariable(name: "line_number", arg: 4, scope: !1048, file: !168, line: 360, type: !6)
!1056 = !DILocalVariable(name: "message", arg: 5, scope: !1048, file: !168, line: 360, type: !50)
!1057 = !DILocalVariable(name: "ap", scope: !1048, file: !168, line: 362, type: !176)
!1058 = !DILocation(line: 0, scope: !1048)
!1059 = !DILocation(line: 362, column: 3, scope: !1048)
!1060 = !DILocation(line: 362, column: 11, scope: !1048)
!1061 = !DILocation(line: 363, column: 3, scope: !1048)
!1062 = !DILocation(line: 364, column: 3, scope: !1048)
!1063 = !DILocation(line: 366, column: 3, scope: !1048)
!1064 = !DILocation(line: 367, column: 1, scope: !1048)
!1065 = distinct !DISubprogram(name: "rpl_fcntl", scope: !209, file: !209, line: 202, type: !1000, scopeLine: 207, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !1066)
!1066 = !{!1067, !1068, !1069, !1080, !1081, !1084, !1086, !1090}
!1067 = !DILocalVariable(name: "fd", arg: 1, scope: !1065, file: !209, line: 202, type: !45)
!1068 = !DILocalVariable(name: "action", arg: 2, scope: !1065, file: !209, line: 202, type: !45)
!1069 = !DILocalVariable(name: "arg", scope: !1065, file: !209, line: 208, type: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !179, line: 14, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1072, baseType: !1073)
!1072 = !DIFile(filename: "lib/fcntl.c", directory: "/src")
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !183, size: 256, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1073, file: !1072, line: 208, baseType: !44, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1073, file: !1072, line: 208, baseType: !44, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1073, file: !1072, line: 208, baseType: !44, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1073, file: !1072, line: 208, baseType: !45, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1073, file: !1072, line: 208, baseType: !45, size: 32, offset: 224)
!1080 = !DILocalVariable(name: "result", scope: !1065, file: !209, line: 211, type: !45)
!1081 = !DILocalVariable(name: "target", scope: !1082, file: !209, line: 216, type: !45)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !209, line: 215, column: 7)
!1083 = distinct !DILexicalBlock(scope: !1065, file: !209, line: 213, column: 5)
!1084 = !DILocalVariable(name: "target", scope: !1085, file: !209, line: 223, type: !45)
!1085 = distinct !DILexicalBlock(scope: !1083, file: !209, line: 222, column: 7)
!1086 = !DILocalVariable(name: "x", scope: !1087, file: !209, line: 418, type: !45)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !209, line: 417, column: 13)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !209, line: 261, column: 11)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !209, line: 258, column: 7)
!1090 = !DILocalVariable(name: "p", scope: !1091, file: !209, line: 426, type: !44)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !209, line: 425, column: 13)
!1092 = !DILocation(line: 0, scope: !1065)
!1093 = !DILocation(line: 208, column: 3, scope: !1065)
!1094 = !DILocation(line: 208, column: 11, scope: !1065)
!1095 = !DILocation(line: 209, column: 3, scope: !1065)
!1096 = !DILocation(line: 212, column: 3, scope: !1065)
!1097 = !DILocation(line: 216, column: 22, scope: !1082)
!1098 = !DILocation(line: 0, scope: !1082)
!1099 = !DILocalVariable(name: "fd", arg: 1, scope: !1100, file: !209, line: 444, type: !45)
!1100 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD", scope: !209, file: !209, line: 444, type: !210, scopeLine: 445, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !212, retainedNodes: !1101)
!1101 = !{!1099, !1102, !1103}
!1102 = !DILocalVariable(name: "target", arg: 2, scope: !1100, file: !209, line: 444, type: !45)
!1103 = !DILocalVariable(name: "result", scope: !1100, file: !209, line: 446, type: !45)
!1104 = !DILocation(line: 0, scope: !1100, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 217, column: 18, scope: !1082)
!1106 = !DILocation(line: 479, column: 12, scope: !1100, inlinedAt: !1105)
!1107 = !DILocation(line: 223, column: 22, scope: !1085)
!1108 = !DILocation(line: 0, scope: !1085)
!1109 = !DILocation(line: 0, scope: !208, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 224, column: 18, scope: !1085)
!1111 = !DILocation(line: 507, column: 12, scope: !1112, inlinedAt: !1110)
!1112 = distinct !DILexicalBlock(scope: !208, file: !209, line: 507, column: 7)
!1113 = !DILocation(line: 507, column: 9, scope: !1112, inlinedAt: !1110)
!1114 = !DILocation(line: 507, column: 7, scope: !208, inlinedAt: !1110)
!1115 = !DILocation(line: 509, column: 16, scope: !1116, inlinedAt: !1110)
!1116 = distinct !DILexicalBlock(scope: !1112, file: !209, line: 508, column: 5)
!1117 = !DILocation(line: 510, column: 13, scope: !1118, inlinedAt: !1110)
!1118 = distinct !DILexicalBlock(scope: !1116, file: !209, line: 510, column: 11)
!1119 = !DILocation(line: 510, column: 23, scope: !1118, inlinedAt: !1110)
!1120 = !DILocation(line: 510, column: 26, scope: !1118, inlinedAt: !1110)
!1121 = !DILocation(line: 510, column: 32, scope: !1118, inlinedAt: !1110)
!1122 = !DILocation(line: 510, column: 11, scope: !1116, inlinedAt: !1110)
!1123 = !DILocation(line: 512, column: 30, scope: !1124, inlinedAt: !1110)
!1124 = distinct !DILexicalBlock(scope: !1118, file: !209, line: 511, column: 9)
!1125 = !DILocation(line: 528, column: 19, scope: !220, inlinedAt: !1110)
!1126 = !DILocation(line: 0, scope: !1100, inlinedAt: !1127)
!1127 = distinct !DILocation(line: 520, column: 20, scope: !1128, inlinedAt: !1110)
!1128 = distinct !DILexicalBlock(scope: !1118, file: !209, line: 519, column: 9)
!1129 = !DILocation(line: 479, column: 12, scope: !1100, inlinedAt: !1127)
!1130 = !DILocation(line: 521, column: 22, scope: !1131, inlinedAt: !1110)
!1131 = distinct !DILexicalBlock(scope: !1128, file: !209, line: 521, column: 15)
!1132 = !DILocation(line: 521, column: 15, scope: !1128, inlinedAt: !1110)
!1133 = !DILocation(line: 522, column: 32, scope: !1131, inlinedAt: !1110)
!1134 = !DILocation(line: 522, column: 13, scope: !1131, inlinedAt: !1110)
!1135 = !DILocation(line: 0, scope: !1100, inlinedAt: !1136)
!1136 = distinct !DILocation(line: 527, column: 14, scope: !1112, inlinedAt: !1110)
!1137 = !DILocation(line: 479, column: 12, scope: !1100, inlinedAt: !1136)
!1138 = !DILocation(line: 0, scope: !1112, inlinedAt: !1110)
!1139 = !DILocation(line: 528, column: 9, scope: !220, inlinedAt: !1110)
!1140 = !DILocation(line: 530, column: 19, scope: !219, inlinedAt: !1110)
!1141 = !DILocation(line: 0, scope: !219, inlinedAt: !1110)
!1142 = !DILocation(line: 531, column: 17, scope: !223, inlinedAt: !1110)
!1143 = !DILocation(line: 531, column: 21, scope: !223, inlinedAt: !1110)
!1144 = !DILocation(line: 531, column: 54, scope: !223, inlinedAt: !1110)
!1145 = !DILocation(line: 531, column: 24, scope: !223, inlinedAt: !1110)
!1146 = !DILocation(line: 531, column: 68, scope: !223, inlinedAt: !1110)
!1147 = !DILocation(line: 531, column: 11, scope: !219, inlinedAt: !1110)
!1148 = !DILocation(line: 533, column: 29, scope: !222, inlinedAt: !1110)
!1149 = !DILocation(line: 0, scope: !222, inlinedAt: !1110)
!1150 = !DILocation(line: 534, column: 11, scope: !222, inlinedAt: !1110)
!1151 = !DILocation(line: 535, column: 17, scope: !222, inlinedAt: !1110)
!1152 = !DILocation(line: 537, column: 9, scope: !222, inlinedAt: !1110)
!1153 = !DILocation(line: 329, column: 22, scope: !1088)
!1154 = !DILocation(line: 330, column: 13, scope: !1088)
!1155 = !DILocation(line: 418, column: 23, scope: !1087)
!1156 = !DILocation(line: 0, scope: !1087)
!1157 = !DILocation(line: 419, column: 24, scope: !1087)
!1158 = !DILocation(line: 421, column: 13, scope: !1088)
!1159 = !DILocation(line: 426, column: 25, scope: !1091)
!1160 = !DILocation(line: 0, scope: !1091)
!1161 = !DILocation(line: 427, column: 24, scope: !1091)
!1162 = !DILocation(line: 429, column: 13, scope: !1088)
!1163 = !DILocation(line: 0, scope: !1083)
!1164 = !DILocation(line: 438, column: 3, scope: !1065)
!1165 = !DILocation(line: 441, column: 1, scope: !1065)
!1166 = !DILocation(line: 440, column: 3, scope: !1065)
!1167 = distinct !DISubprogram(name: "getprogname", scope: !372, file: !372, line: 54, type: !1168, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !371, retainedNodes: !536)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!50}
!1170 = !DILocation(line: 58, column: 10, scope: !1167)
!1171 = !DILocation(line: 58, column: 3, scope: !1167)
!1172 = distinct !DISubprogram(name: "set_program_name", scope: !227, file: !227, line: 37, type: !469, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DILocalVariable(name: "argv0", arg: 1, scope: !1172, file: !227, line: 37, type: !50)
!1175 = !DILocalVariable(name: "slash", scope: !1172, file: !227, line: 44, type: !50)
!1176 = !DILocalVariable(name: "base", scope: !1172, file: !227, line: 45, type: !50)
!1177 = !DILocation(line: 0, scope: !1172)
!1178 = !DILocation(line: 44, column: 23, scope: !1172)
!1179 = !DILocation(line: 45, column: 22, scope: !1172)
!1180 = !DILocation(line: 46, column: 17, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1172, file: !227, line: 46, column: 7)
!1182 = !DILocation(line: 46, column: 9, scope: !1181)
!1183 = !DILocation(line: 46, column: 25, scope: !1181)
!1184 = !DILocation(line: 46, column: 40, scope: !1181)
!1185 = !DILocalVariable(name: "__s1", arg: 1, scope: !1186, file: !494, line: 974, type: !662)
!1186 = distinct !DISubprogram(name: "memeq", scope: !494, file: !494, line: 974, type: !1187, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !1189)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!67, !662, !662, !47}
!1189 = !{!1185, !1190, !1191}
!1190 = !DILocalVariable(name: "__s2", arg: 2, scope: !1186, file: !494, line: 974, type: !662)
!1191 = !DILocalVariable(name: "__n", arg: 3, scope: !1186, file: !494, line: 974, type: !47)
!1192 = !DILocation(line: 0, scope: !1186, inlinedAt: !1193)
!1193 = distinct !DILocation(line: 46, column: 28, scope: !1181)
!1194 = !DILocation(line: 976, column: 11, scope: !1186, inlinedAt: !1193)
!1195 = !DILocation(line: 976, column: 10, scope: !1186, inlinedAt: !1193)
!1196 = !DILocation(line: 46, column: 7, scope: !1172)
!1197 = !DILocation(line: 49, column: 11, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !227, line: 49, column: 11)
!1199 = distinct !DILexicalBlock(scope: !1181, file: !227, line: 47, column: 5)
!1200 = !DILocation(line: 49, column: 36, scope: !1198)
!1201 = !DILocation(line: 49, column: 11, scope: !1199)
!1202 = !DILocation(line: 65, column: 16, scope: !1172)
!1203 = !DILocation(line: 71, column: 27, scope: !1172)
!1204 = !DILocation(line: 74, column: 33, scope: !1172)
!1205 = !DILocation(line: 76, column: 1, scope: !1172)
!1206 = !DILocation(line: 0, scope: !232)
