; ModuleID = 'src/tac.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.re_pattern_buffer = type { %struct.re_dfa_t*, i64, i64, i64, i8*, i8*, i64, i8 }
%struct.re_dfa_t = type opaque
%struct.infomap = type { i8*, i8* }
%struct.re_registers = type { i32, i32*, i32* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "default_file_list", scope: !2, file: !3, line: 498, type: !241, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 489, type: !4, scopeLine: 490, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !230)
!3 = !DIFile(filename: "src/tac.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c011dce72bff7945d0c8301de2405c61")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !42, globals: !53, splitDebugInlining: false, nameTableKind: None)
!11 = !{!12, !28}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !29, line: 42, baseType: !14, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!31 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!32 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!33 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!34 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!35 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!36 = !DIEnumerator(name: "c_quoting_style", value: 5)
!37 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!38 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!39 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!40 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!41 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!42 = !{!8, !43, !44, !6, !48, !49, !46, !52}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!51 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !{!0, !54, !56, !58, !60, !62, !86, !91, !178, !192, !194, !196, !198, !208, !226, !228}
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "match_length", scope: !10, file: !3, line: 83, type: !49, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "G_buffer", scope: !10, file: !3, line: 86, type: !8, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "read_size", scope: !10, file: !3, line: 89, type: !49, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "G_buffer_size", scope: !10, file: !3, line: 94, type: !49, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "compiled_separator", scope: !10, file: !3, line: 97, type: !64, isLocal: true, isDefinition: true)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !65, line: 413, size: 512, elements: !66)
!65 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!66 = !{!67, !70, !72, !73, !75, !76, !78, !79, !80, !81, !82, !83, !84, !85}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !64, file: !65, line: 417, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !65, line: 417, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !64, file: !65, line: 420, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !65, line: 56, baseType: !51)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !64, file: !65, line: 423, baseType: !71, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !64, file: !65, line: 426, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !65, line: 71, baseType: !51)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !64, file: !65, line: 431, baseType: !8, size: 64, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !64, file: !65, line: 437, baseType: !77, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !64, file: !65, line: 440, baseType: !49, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !64, file: !65, line: 446, baseType: !14, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !64, file: !65, line: 457, baseType: !14, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !64, file: !65, line: 461, baseType: !14, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !64, file: !65, line: 465, baseType: !14, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !64, file: !65, line: 469, baseType: !14, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !64, file: !65, line: 472, baseType: !14, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !64, file: !65, line: 475, baseType: !14, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "compiled_separator_fastmap", scope: !10, file: !3, line: 98, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 256)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !93, file: !94, line: 575, type: !6, isLocal: true, isDefinition: true)
!93 = distinct !DISubprogram(name: "oputs_", scope: !94, file: !94, line: 573, type: !95, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !97)
!94 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!95 = !DISubroutineType(types: !96)
!96 = !{null, !46, !46}
!97 = !{!98, !99, !100, !103, !105, !106, !107, !111, !112, !113, !114, !116, !172, !173, !174, !176, !177}
!98 = !DILocalVariable(name: "program", arg: 1, scope: !93, file: !94, line: 573, type: !46)
!99 = !DILocalVariable(name: "option", arg: 2, scope: !93, file: !94, line: 573, type: !46)
!100 = !DILocalVariable(name: "term", scope: !101, file: !94, line: 585, type: !46)
!101 = distinct !DILexicalBlock(scope: !102, file: !94, line: 582, column: 5)
!102 = distinct !DILexicalBlock(scope: !93, file: !94, line: 581, column: 7)
!103 = !DILocalVariable(name: "double_space", scope: !93, file: !94, line: 594, type: !104)
!104 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!105 = !DILocalVariable(name: "first_word", scope: !93, file: !94, line: 595, type: !46)
!106 = !DILocalVariable(name: "option_text", scope: !93, file: !94, line: 596, type: !46)
!107 = !DILocalVariable(name: "s", scope: !108, file: !94, line: 608, type: !46)
!108 = distinct !DILexicalBlock(scope: !109, file: !94, line: 605, column: 5)
!109 = distinct !DILexicalBlock(scope: !110, file: !94, line: 604, column: 12)
!110 = distinct !DILexicalBlock(scope: !93, file: !94, line: 597, column: 7)
!111 = !DILocalVariable(name: "spaces", scope: !108, file: !94, line: 609, type: !49)
!112 = !DILocalVariable(name: "anchor_len", scope: !93, file: !94, line: 620, type: !49)
!113 = !DILocalVariable(name: "desc_text", scope: !93, file: !94, line: 625, type: !46)
!114 = !DILocalVariable(name: "__ptr", scope: !115, file: !94, line: 644, type: !46)
!115 = distinct !DILexicalBlock(scope: !93, file: !94, line: 644, column: 3)
!116 = !DILocalVariable(name: "__stream", scope: !115, file: !94, line: 644, type: !117)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !119, line: 7, baseType: !120)
!119 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !121, line: 49, size: 1728, elements: !122)
!121 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !138, !140, !141, !142, !146, !147, !149, !153, !156, !158, !161, !164, !165, !166, !167, !168}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !120, file: !121, line: 51, baseType: !6, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !120, file: !121, line: 54, baseType: !8, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !120, file: !121, line: 55, baseType: !8, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !120, file: !121, line: 56, baseType: !8, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !120, file: !121, line: 57, baseType: !8, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !120, file: !121, line: 58, baseType: !8, size: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !120, file: !121, line: 59, baseType: !8, size: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !120, file: !121, line: 60, baseType: !8, size: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !120, file: !121, line: 61, baseType: !8, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !120, file: !121, line: 64, baseType: !8, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !120, file: !121, line: 65, baseType: !8, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !120, file: !121, line: 66, baseType: !8, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !120, file: !121, line: 68, baseType: !136, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !121, line: 36, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !120, file: !121, line: 70, baseType: !139, size: 64, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !120, file: !121, line: 72, baseType: !6, size: 32, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !120, file: !121, line: 73, baseType: !6, size: 32, offset: 928)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !120, file: !121, line: 74, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !144, line: 152, baseType: !145)
!144 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!145 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !120, file: !121, line: 77, baseType: !48, size: 16, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !120, file: !121, line: 78, baseType: !148, size: 8, offset: 1040)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !120, file: !121, line: 79, baseType: !150, size: 8, offset: 1048)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 1)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !120, file: !121, line: 81, baseType: !154, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !121, line: 43, baseType: null)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !120, file: !121, line: 89, baseType: !157, size: 64, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !144, line: 153, baseType: !145)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !120, file: !121, line: 91, baseType: !159, size: 64, offset: 1216)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !121, line: 37, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !120, file: !121, line: 92, baseType: !162, size: 64, offset: 1280)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !121, line: 38, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !120, file: !121, line: 93, baseType: !139, size: 64, offset: 1344)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !120, file: !121, line: 94, baseType: !43, size: 64, offset: 1408)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !120, file: !121, line: 95, baseType: !49, size: 64, offset: 1472)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !120, file: !121, line: 96, baseType: !6, size: 32, offset: 1536)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !120, file: !121, line: 98, baseType: !169, size: 160, offset: 1568)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 20)
!172 = !DILocalVariable(name: "__cnt", scope: !115, file: !94, line: 644, type: !49)
!173 = !DILocalVariable(name: "url_program", scope: !93, file: !94, line: 648, type: !46)
!174 = !DILocalVariable(name: "__ptr", scope: !175, file: !94, line: 686, type: !46)
!175 = distinct !DILexicalBlock(scope: !93, file: !94, line: 686, column: 3)
!176 = !DILocalVariable(name: "__stream", scope: !175, file: !94, line: 686, type: !117)
!177 = !DILocalVariable(name: "__cnt", scope: !175, file: !94, line: 686, type: !49)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "longopts", scope: !10, file: !3, line: 101, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 1536, elements: !190)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !183, line: 50, size: 256, elements: !184)
!183 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!184 = !{!185, !186, !187, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 52, baseType: !46, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !183, line: 55, baseType: !6, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !183, line: 56, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !183, line: 57, baseType: !6, size: 32, offset: 192)
!190 = !{!191}
!191 = !DISubrange(count: 6)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "separator_ends_record", scope: !10, file: !3, line: 73, type: !104, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "sentinel_length", scope: !10, file: !3, line: 78, type: !49, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "separator", scope: !10, file: !3, line: 66, type: !46, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "regs", scope: !10, file: !3, line: 99, type: !200, isLocal: true, isDefinition: true)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !65, line: 497, size: 192, elements: !201)
!201 = !{!202, !204, !207}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !200, file: !65, line: 499, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !65, line: 55, baseType: !14)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !200, file: !65, line: 500, baseType: !205, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !65, line: 490, baseType: !6)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !200, file: !65, line: 501, baseType: !205, size: 64, offset: 128)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "buffer", scope: !210, file: !3, line: 154, type: !223, isLocal: true, isDefinition: true)
!210 = distinct !DISubprogram(name: "output", scope: !3, file: !3, line: 152, type: !95, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !211)
!211 = !{!212, !213, !214, !215, !216, !221, !222}
!212 = !DILocalVariable(name: "start", arg: 1, scope: !210, file: !3, line: 152, type: !46)
!213 = !DILocalVariable(name: "past_end", arg: 2, scope: !210, file: !3, line: 152, type: !46)
!214 = !DILocalVariable(name: "bytes_to_add", scope: !210, file: !3, line: 156, type: !49)
!215 = !DILocalVariable(name: "bytes_available", scope: !210, file: !3, line: 157, type: !49)
!216 = !DILocalVariable(name: "__ptr", scope: !217, file: !3, line: 161, type: !46)
!217 = distinct !DILexicalBlock(scope: !218, file: !3, line: 161, column: 11)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 161, column: 11)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 160, column: 5)
!220 = distinct !DILexicalBlock(scope: !210, file: !3, line: 159, column: 7)
!221 = !DILocalVariable(name: "__stream", scope: !217, file: !3, line: 161, type: !117)
!222 = !DILocalVariable(name: "__cnt", scope: !217, file: !3, line: 161, type: !49)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 65536, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 8192)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "bytes_in_buffer", scope: !210, file: !3, line: 155, type: !49, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !10, file: !3, line: 69, type: !104, isLocal: true, isDefinition: true)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238}
!231 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 489, type: !6)
!232 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 489, type: !7)
!233 = !DILocalVariable(name: "error_message", scope: !2, file: !3, line: 491, type: !46)
!234 = !DILocalVariable(name: "optc", scope: !2, file: !3, line: 492, type: !6)
!235 = !DILocalVariable(name: "ok", scope: !2, file: !3, line: 493, type: !104)
!236 = !DILocalVariable(name: "half_buffer_size", scope: !2, file: !3, line: 494, type: !49)
!237 = !DILocalVariable(name: "file", scope: !2, file: !3, line: 499, type: !44)
!238 = !DILocalVariable(name: "i", scope: !239, file: !3, line: 576, type: !49)
!239 = distinct !DILexicalBlock(scope: !240, file: !3, line: 576, column: 5)
!240 = distinct !DILexicalBlock(scope: !2, file: !3, line: 574, column: 3)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!245 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "tempfile", scope: !248, file: !249, line: 86, type: !8, isLocal: true, isDefinition: true)
!248 = distinct !DISubprogram(name: "temp_stream", scope: !249, file: !249, line: 84, type: !250, scopeLine: 85, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !287, retainedNodes: !293)
!249 = !DIFile(filename: "src/temp-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8878e64e34a1409e8108ead719db2042")
!250 = !DISubroutineType(types: !251)
!251 = !{!104, !252, !7}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !119, line: 7, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !121, line: 49, size: 1728, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !255, file: !121, line: 51, baseType: !6, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !255, file: !121, line: 54, baseType: !8, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !255, file: !121, line: 55, baseType: !8, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !255, file: !121, line: 56, baseType: !8, size: 64, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !255, file: !121, line: 57, baseType: !8, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !255, file: !121, line: 58, baseType: !8, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !255, file: !121, line: 59, baseType: !8, size: 64, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !255, file: !121, line: 60, baseType: !8, size: 64, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !255, file: !121, line: 61, baseType: !8, size: 64, offset: 512)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !255, file: !121, line: 64, baseType: !8, size: 64, offset: 576)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !255, file: !121, line: 65, baseType: !8, size: 64, offset: 640)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !255, file: !121, line: 66, baseType: !8, size: 64, offset: 704)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !255, file: !121, line: 68, baseType: !136, size: 64, offset: 768)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !255, file: !121, line: 70, baseType: !271, size: 64, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !255, file: !121, line: 72, baseType: !6, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !255, file: !121, line: 73, baseType: !6, size: 32, offset: 928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !255, file: !121, line: 74, baseType: !143, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !255, file: !121, line: 77, baseType: !48, size: 16, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !255, file: !121, line: 78, baseType: !148, size: 8, offset: 1040)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !255, file: !121, line: 79, baseType: !150, size: 8, offset: 1048)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !255, file: !121, line: 81, baseType: !154, size: 64, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !255, file: !121, line: 89, baseType: !157, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !255, file: !121, line: 91, baseType: !159, size: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !255, file: !121, line: 92, baseType: !162, size: 64, offset: 1280)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !255, file: !121, line: 93, baseType: !271, size: 64, offset: 1344)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !255, file: !121, line: 94, baseType: !43, size: 64, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !255, file: !121, line: 95, baseType: !49, size: 64, offset: 1472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !255, file: !121, line: 96, baseType: !6, size: 32, offset: 1536)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !255, file: !121, line: 98, baseType: !169, size: 160, offset: 1568)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !289, globals: !290, splitDebugInlining: false, nameTableKind: None)
!288 = !{!28}
!289 = !{!43}
!290 = !{!246, !291}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "tmp_fp", scope: !248, file: !249, line: 87, type: !253, isLocal: true, isDefinition: true)
!293 = !{!294, !295, !296, !299, !300, !301}
!294 = !DILocalVariable(name: "fp", arg: 1, scope: !248, file: !249, line: 84, type: !252)
!295 = !DILocalVariable(name: "file_name", arg: 2, scope: !248, file: !249, line: 84, type: !7)
!296 = !DILocalVariable(name: "tempbuf", scope: !297, file: !249, line: 90, type: !8)
!297 = distinct !DILexicalBlock(scope: !298, file: !249, line: 89, column: 5)
!298 = distinct !DILexicalBlock(scope: !248, file: !249, line: 88, column: 7)
!299 = !DILocalVariable(name: "tempbuf_len", scope: !297, file: !249, line: 91, type: !49)
!300 = !DILocalVariable(name: "fd", scope: !297, file: !249, line: 125, type: !6)
!301 = !DILabel(scope: !302, name: "Reset", file: !249, line: 140)
!302 = distinct !DILexicalBlock(scope: !303, file: !249, line: 135, column: 9)
!303 = distinct !DILexicalBlock(scope: !297, file: !249, line: 134, column: 11)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "Version", scope: !306, file: !307, line: 3, type: !46, isLocal: false, isDefinition: true)
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !308, splitDebugInlining: false, nameTableKind: None)
!307 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!308 = !{!304}
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "file_name", scope: !311, file: !312, line: 45, type: !46, isLocal: true, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !313, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!313 = !{!309, !314}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !311, file: !312, line: 55, type: !104, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !318, file: !319, line: 66, type: !354, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !320, globals: !321, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!320 = !{!43, !52}
!321 = !{!322, !348, !316, !350, !352}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "old_file_name", scope: !324, file: !319, line: 304, type: !46, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "verror_at_line", scope: !319, file: !319, line: 298, type: !325, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !318, retainedNodes: !341)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !6, !6, !46, !14, !46, !327}
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !328, line: 52, baseType: !329)
!328 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !330, line: 32, baseType: !331)
!330 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !332, baseType: !333)
!332 = !DIFile(filename: "lib/error.c", directory: "/src")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !334, size: 256, elements: !335)
!334 = !DINamespace(name: "std", scope: null)
!335 = !{!336, !337, !338, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !333, file: !332, baseType: !43, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !333, file: !332, baseType: !43, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !333, file: !332, baseType: !43, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !333, file: !332, baseType: !6, size: 32, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !333, file: !332, baseType: !6, size: 32, offset: 224)
!341 = !{!342, !343, !344, !345, !346, !347}
!342 = !DILocalVariable(name: "status", arg: 1, scope: !324, file: !319, line: 298, type: !6)
!343 = !DILocalVariable(name: "errnum", arg: 2, scope: !324, file: !319, line: 298, type: !6)
!344 = !DILocalVariable(name: "file_name", arg: 3, scope: !324, file: !319, line: 298, type: !46)
!345 = !DILocalVariable(name: "line_number", arg: 4, scope: !324, file: !319, line: 298, type: !14)
!346 = !DILocalVariable(name: "message", arg: 5, scope: !324, file: !319, line: 298, type: !46)
!347 = !DILocalVariable(name: "args", arg: 6, scope: !324, file: !319, line: 298, type: !327)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "old_line_number", scope: !324, file: !319, line: 305, type: !14, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "error_message_count", scope: !318, file: !319, line: 69, type: !14, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !318, file: !319, line: 295, type: !6, isLocal: false, isDefinition: true)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null}
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "program_name", scope: !359, file: !360, line: 31, type: !46, isLocal: false, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, globals: !362, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!361 = !{!8}
!362 = !{!357}
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "utf07FF", scope: !365, file: !366, line: 46, type: !396, isLocal: true, isDefinition: true)
!365 = distinct !DISubprogram(name: "proper_name_lite", scope: !366, file: !366, line: 38, type: !367, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !369, retainedNodes: !371)
!366 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!367 = !DISubroutineType(types: !368)
!368 = !{!46, !46, !46}
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !370, splitDebugInlining: false, nameTableKind: None)
!370 = !{!363}
!371 = !{!372, !373, !374, !375, !380}
!372 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !365, file: !366, line: 38, type: !46)
!373 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !365, file: !366, line: 38, type: !46)
!374 = !DILocalVariable(name: "translation", scope: !365, file: !366, line: 40, type: !46)
!375 = !DILocalVariable(name: "w", scope: !365, file: !366, line: 47, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !377, line: 37, baseType: !378)
!377 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !144, line: 57, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !144, line: 42, baseType: !14)
!380 = !DILocalVariable(name: "mbs", scope: !365, file: !366, line: 48, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !382, line: 6, baseType: !383)
!382 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !384, line: 21, baseType: !385)
!384 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 13, size: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !385, file: !384, line: 15, baseType: !6, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !385, file: !384, line: 20, baseType: !389, size: 32, offset: 32)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !385, file: !384, line: 16, size: 32, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !389, file: !384, line: 18, baseType: !14, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !389, file: !384, line: 19, baseType: !393, size: 32)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 4)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 16, elements: !242)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !399, file: !400, line: 76, type: !465, isLocal: false, isDefinition: true)
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !401, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!401 = !{!28, !402, !12}
!402 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !29, line: 254, baseType: !14, size: 32, elements: !403)
!403 = !{!404, !405, !406}
!404 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!405 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!406 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!407 = !{!6, !48, !49}
!408 = !{!397, !409, !415, !427, !429, !431, !454, !461, !463}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !399, file: !400, line: 92, type: !411, isLocal: false, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 320, elements: !413)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!413 = !{!414}
!414 = !DISubrange(count: 10)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !399, file: !400, line: 1040, type: !417, isLocal: false, isDefinition: true)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !400, line: 56, size: 448, elements: !418)
!418 = !{!419, !420, !421, !425, !426}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !417, file: !400, line: 59, baseType: !28, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !400, line: 62, baseType: !6, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !417, file: !400, line: 66, baseType: !422, size: 256, offset: 64)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !417, file: !400, line: 69, baseType: !46, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !417, file: !400, line: 72, baseType: !46, size: 64, offset: 384)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !399, file: !400, line: 107, type: !417, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "slot0", scope: !399, file: !400, line: 831, type: !88, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "quote", scope: !433, file: !400, line: 228, type: !452, isLocal: true, isDefinition: true)
!433 = distinct !DISubprogram(name: "gettext_quote", scope: !400, file: !400, line: 197, type: !434, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !399, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!46, !46, !28}
!436 = !{!437, !438, !439, !440, !441}
!437 = !DILocalVariable(name: "msgid", arg: 1, scope: !433, file: !400, line: 197, type: !46)
!438 = !DILocalVariable(name: "s", arg: 2, scope: !433, file: !400, line: 197, type: !28)
!439 = !DILocalVariable(name: "translation", scope: !433, file: !400, line: 199, type: !46)
!440 = !DILocalVariable(name: "w", scope: !433, file: !400, line: 229, type: !376)
!441 = !DILocalVariable(name: "mbs", scope: !433, file: !400, line: 230, type: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !382, line: 6, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !384, line: 21, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 13, size: 64, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !444, file: !384, line: 15, baseType: !6, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !444, file: !384, line: 20, baseType: !448, size: 32, offset: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !444, file: !384, line: 16, size: 32, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !448, file: !384, line: 18, baseType: !14, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !448, file: !384, line: 19, baseType: !393, size: 32)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !453)
!453 = !{!243, !395}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "slotvec", scope: !399, file: !400, line: 834, type: !456, isLocal: true, isDefinition: true)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !400, line: 823, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !457, file: !400, line: 825, baseType: !49, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !457, file: !400, line: 826, baseType: !8, size: 64, offset: 64)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "nslots", scope: !399, file: !400, line: 832, type: !6, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "slotvec0", scope: !399, file: !400, line: 833, type: !457, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 704, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 11)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !470, file: !471, line: 26, type: !473, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !472, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!472 = !{!468}
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 376, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 47)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "exit_failure", scope: !478, file: !479, line: 24, type: !481, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !480, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!480 = !{!476}
!481 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "internal_state", scope: !484, file: !485, line: 97, type: !488, isLocal: true, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !486, globals: !487, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!486 = !{!43, !49, !52}
!487 = !{!482}
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !382, line: 6, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !384, line: 21, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 13, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !490, file: !384, line: 15, baseType: !6, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !490, file: !384, line: 20, baseType: !494, size: 32, offset: 32)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !490, file: !384, line: 16, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !494, file: !384, line: 18, baseType: !14, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !494, file: !384, line: 19, baseType: !393, size: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !500, file: !501, line: 506, type: !6, isLocal: true, isDefinition: true)
!500 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !501, file: !501, line: 485, type: !502, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !504, retainedNodes: !506)
!501 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!502 = !DISubroutineType(types: !503)
!503 = !{!6, !6, !6}
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !505, splitDebugInlining: false, nameTableKind: None)
!505 = !{!498}
!506 = !{!507, !508, !509, !510, !513}
!507 = !DILocalVariable(name: "fd", arg: 1, scope: !500, file: !501, line: 485, type: !6)
!508 = !DILocalVariable(name: "target", arg: 2, scope: !500, file: !501, line: 485, type: !6)
!509 = !DILocalVariable(name: "result", scope: !500, file: !501, line: 487, type: !6)
!510 = !DILocalVariable(name: "flags", scope: !511, file: !501, line: 530, type: !6)
!511 = distinct !DILexicalBlock(scope: !512, file: !501, line: 529, column: 5)
!512 = distinct !DILexicalBlock(scope: !500, file: !501, line: 528, column: 7)
!513 = !DILocalVariable(name: "saved_errno", scope: !514, file: !501, line: 533, type: !6)
!514 = distinct !DILexicalBlock(scope: !515, file: !501, line: 532, column: 9)
!515 = distinct !DILexicalBlock(scope: !511, file: !501, line: 531, column: 11)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!518 = distinct !DICompileUnit(language: DW_LANG_C99, file: !519, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!519 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/full-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "717d8293e026c44a771a83b22da54cc2")
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!524 = distinct !DICompileUnit(language: DW_LANG_C99, file: !525, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !526, retainedTypes: !531, splitDebugInlining: false, nameTableKind: None)
!525 = !DIFile(filename: "lib/safe-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "434e548fbeff241cc07e1dbcc7b4611f")
!526 = !{!527}
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !528, line: 36, baseType: !14, size: 32, elements: !529)
!528 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!529 = !{!530}
!530 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!531 = !{!49}
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/mkstemp-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c54cf13a93f038494ed7ea783050e30c")
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !536, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "lib/tmpdir.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6bb1205c798131b3318a3c96a85b8877")
!536 = !{!43, !6}
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !541, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!541 = !{!542}
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !540, line: 40, baseType: !14, size: 32, elements: !543)
!543 = !{!544}
!544 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !547, retainedTypes: !578, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!547 = !{!548, !560}
!548 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !549, file: !546, line: 188, baseType: !14, size: 32, elements: !558)
!549 = distinct !DISubprogram(name: "x2nrealloc", scope: !546, file: !546, line: 176, type: !550, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !553)
!550 = !DISubroutineType(types: !551)
!551 = !{!43, !43, !552, !49}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!553 = !{!554, !555, !556, !557}
!554 = !DILocalVariable(name: "p", arg: 1, scope: !549, file: !546, line: 176, type: !43)
!555 = !DILocalVariable(name: "pn", arg: 2, scope: !549, file: !546, line: 176, type: !552)
!556 = !DILocalVariable(name: "s", arg: 3, scope: !549, file: !546, line: 176, type: !49)
!557 = !DILocalVariable(name: "n", scope: !549, file: !546, line: 178, type: !49)
!558 = !{!559}
!559 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !561, file: !546, line: 228, baseType: !14, size: 32, elements: !558)
!561 = distinct !DISubprogram(name: "xpalloc", scope: !546, file: !546, line: 223, type: !562, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !545, retainedNodes: !568)
!562 = !DISubroutineType(types: !563)
!563 = !{!43, !43, !564, !565, !567, !565}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !566, line: 130, baseType: !567)
!566 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !50, line: 35, baseType: !145)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577}
!569 = !DILocalVariable(name: "pa", arg: 1, scope: !561, file: !546, line: 223, type: !43)
!570 = !DILocalVariable(name: "pn", arg: 2, scope: !561, file: !546, line: 223, type: !564)
!571 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !561, file: !546, line: 223, type: !565)
!572 = !DILocalVariable(name: "n_max", arg: 4, scope: !561, file: !546, line: 223, type: !567)
!573 = !DILocalVariable(name: "s", arg: 5, scope: !561, file: !546, line: 223, type: !565)
!574 = !DILocalVariable(name: "n0", scope: !561, file: !546, line: 230, type: !565)
!575 = !DILocalVariable(name: "n", scope: !561, file: !546, line: 237, type: !565)
!576 = !DILocalVariable(name: "nbytes", scope: !561, file: !546, line: 248, type: !565)
!577 = !DILocalVariable(name: "adjusted_nbytes", scope: !561, file: !546, line: 252, type: !565)
!578 = !{!8, !43, !104, !145, !51}
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !586, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!586 = !DIFile(filename: "lib/fd-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "63ab878cf4b441e9798f87a8e3963108")
!587 = distinct !DICompileUnit(language: DW_LANG_C99, file: !588, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!588 = !DIFile(filename: "lib/dup-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad0f64dd333db5cafacb6809a74d5848")
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!591 = distinct !DICompileUnit(language: DW_LANG_C99, file: !592, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !593, splitDebugInlining: false, nameTableKind: None)
!592 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!593 = !{!104, !51, !43}
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!598 = distinct !DICompileUnit(language: DW_LANG_C99, file: !599, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!599 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !289, splitDebugInlining: false, nameTableKind: None)
!601 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!602 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!603 = !{i32 7, !"Dwarf Version", i32 5}
!604 = !{i32 2, !"Debug Info Version", i32 3}
!605 = !{i32 1, !"wchar_size", i32 4}
!606 = !{i32 1, !"branch-target-enforcement", i32 0}
!607 = !{i32 1, !"sign-return-address", i32 0}
!608 = !{i32 1, !"sign-return-address-all", i32 0}
!609 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!610 = !{i32 7, !"PIC Level", i32 2}
!611 = !{i32 7, !"PIE Level", i32 2}
!612 = !{i32 7, !"uwtable", i32 1}
!613 = !{i32 7, !"frame-pointer", i32 1}
!614 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 112, type: !615, scopeLine: 113, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !6}
!617 = !{!618}
!618 = !DILocalVariable(name: "status", arg: 1, scope: !614, file: !3, line: 112, type: !6)
!619 = !DILocation(line: 0, scope: !614)
!620 = !DILocation(line: 114, column: 14, scope: !621)
!621 = distinct !DILexicalBlock(scope: !614, file: !3, line: 114, column: 7)
!622 = !DILocation(line: 114, column: 7, scope: !614)
!623 = !DILocation(line: 115, column: 5, scope: !624)
!624 = distinct !DILexicalBlock(scope: !621, file: !3, line: 115, column: 5)
!625 = !{!626, !626, i64 0}
!626 = !{!"any pointer", !627, i64 0}
!627 = !{!"omnipotent char", !628, i64 0}
!628 = !{!"Simple C/C++ TBAA"}
!629 = !DILocation(line: 118, column: 7, scope: !630)
!630 = distinct !DILexicalBlock(scope: !621, file: !3, line: 117, column: 5)
!631 = !DILocation(line: 122, column: 7, scope: !630)
!632 = !DILocation(line: 729, column: 3, scope: !633, inlinedAt: !635)
!633 = distinct !DISubprogram(name: "emit_stdin_note", scope: !94, file: !94, line: 727, type: !355, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !634)
!634 = !{}
!635 = distinct !DILocation(line: 126, column: 7, scope: !630)
!636 = !DILocation(line: 736, column: 3, scope: !637, inlinedAt: !638)
!637 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !94, file: !94, line: 734, type: !355, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !634)
!638 = distinct !DILocation(line: 127, column: 7, scope: !630)
!639 = !DILocation(line: 129, column: 7, scope: !630)
!640 = !DILocation(line: 132, column: 7, scope: !630)
!641 = !DILocation(line: 135, column: 7, scope: !630)
!642 = !DILocation(line: 138, column: 7, scope: !630)
!643 = !DILocation(line: 139, column: 7, scope: !630)
!644 = !DILocation(line: 140, column: 7, scope: !630)
!645 = !DILocalVariable(name: "program", arg: 1, scope: !646, file: !94, line: 836, type: !46)
!646 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !94, file: !94, line: 836, type: !647, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !46}
!649 = !{!645, !650, !659, !660, !662, !663}
!650 = !DILocalVariable(name: "infomap", scope: !646, file: !94, line: 838, type: !651)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 896, elements: !657)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !646, file: !94, line: 838, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !653, file: !94, line: 838, baseType: !46, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !653, file: !94, line: 838, baseType: !46, size: 64, offset: 64)
!657 = !{!658}
!658 = !DISubrange(count: 7)
!659 = !DILocalVariable(name: "node", scope: !646, file: !94, line: 848, type: !46)
!660 = !DILocalVariable(name: "map_prog", scope: !646, file: !94, line: 849, type: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!662 = !DILocalVariable(name: "lc_messages", scope: !646, file: !94, line: 861, type: !46)
!663 = !DILocalVariable(name: "url_program", scope: !646, file: !94, line: 874, type: !46)
!664 = !DILocation(line: 0, scope: !646, inlinedAt: !665)
!665 = distinct !DILocation(line: 143, column: 7, scope: !630)
!666 = !DILocation(line: 838, column: 3, scope: !646, inlinedAt: !665)
!667 = !DILocation(line: 838, column: 67, scope: !646, inlinedAt: !665)
!668 = !DILocation(line: 849, column: 36, scope: !646, inlinedAt: !665)
!669 = !DILocation(line: 851, column: 3, scope: !646, inlinedAt: !665)
!670 = !DILocalVariable(name: "__s1", arg: 1, scope: !671, file: !672, line: 1359, type: !46)
!671 = distinct !DISubprogram(name: "streq", scope: !672, file: !672, line: 1359, type: !673, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !675)
!672 = !DIFile(filename: "./lib/string.h", directory: "/src")
!673 = !DISubroutineType(types: !674)
!674 = !{!104, !46, !46}
!675 = !{!670, !676}
!676 = !DILocalVariable(name: "__s2", arg: 2, scope: !671, file: !672, line: 1359, type: !46)
!677 = !DILocation(line: 0, scope: !671, inlinedAt: !678)
!678 = distinct !DILocation(line: 851, column: 33, scope: !646, inlinedAt: !665)
!679 = !DILocation(line: 1361, column: 11, scope: !671, inlinedAt: !678)
!680 = !DILocation(line: 1361, column: 10, scope: !671, inlinedAt: !678)
!681 = !DILocation(line: 852, column: 13, scope: !646, inlinedAt: !665)
!682 = !DILocation(line: 851, column: 20, scope: !646, inlinedAt: !665)
!683 = !{!684, !626, i64 0}
!684 = !{!"infomap", !626, i64 0, !626, i64 8}
!685 = !DILocation(line: 851, column: 10, scope: !646, inlinedAt: !665)
!686 = !DILocation(line: 851, column: 28, scope: !646, inlinedAt: !665)
!687 = distinct !{!687, !669, !681, !688}
!688 = !{!"llvm.loop.mustprogress"}
!689 = !DILocation(line: 854, column: 17, scope: !690, inlinedAt: !665)
!690 = distinct !DILexicalBlock(scope: !646, file: !94, line: 854, column: 7)
!691 = !{!684, !626, i64 8}
!692 = !DILocation(line: 854, column: 7, scope: !690, inlinedAt: !665)
!693 = !DILocation(line: 854, column: 7, scope: !646, inlinedAt: !665)
!694 = !DILocation(line: 857, column: 3, scope: !646, inlinedAt: !665)
!695 = !DILocation(line: 861, column: 29, scope: !646, inlinedAt: !665)
!696 = !DILocation(line: 862, column: 7, scope: !697, inlinedAt: !665)
!697 = distinct !DILexicalBlock(scope: !646, file: !94, line: 862, column: 7)
!698 = !DILocation(line: 862, column: 19, scope: !697, inlinedAt: !665)
!699 = !DILocation(line: 862, column: 22, scope: !697, inlinedAt: !665)
!700 = !DILocation(line: 862, column: 7, scope: !646, inlinedAt: !665)
!701 = !DILocation(line: 868, column: 7, scope: !702, inlinedAt: !665)
!702 = distinct !DILexicalBlock(scope: !697, file: !94, line: 863, column: 5)
!703 = !DILocation(line: 870, column: 5, scope: !702, inlinedAt: !665)
!704 = !DILocation(line: 0, scope: !671, inlinedAt: !705)
!705 = distinct !DILocation(line: 874, column: 29, scope: !646, inlinedAt: !665)
!706 = !DILocation(line: 875, column: 3, scope: !646, inlinedAt: !665)
!707 = !DILocation(line: 877, column: 3, scope: !646, inlinedAt: !665)
!708 = !DILocation(line: 879, column: 1, scope: !646, inlinedAt: !665)
!709 = !DILocation(line: 145, column: 3, scope: !614)
!710 = !DISubprogram(name: "dcgettext", scope: !711, file: !711, line: 51, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!711 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!712 = !DISubroutineType(types: !713)
!713 = !{!8, !46, !46, !6}
!714 = !DISubprogram(name: "fputs_unlocked", scope: !328, file: !328, line: 691, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!715 = !DISubroutineType(types: !716)
!716 = !{!6, !717, !718}
!717 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !46)
!718 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !117)
!719 = !DILocation(line: 0, scope: !93)
!720 = !DILocation(line: 581, column: 7, scope: !102)
!721 = !{!722, !722, i64 0}
!722 = !{!"int", !627, i64 0}
!723 = !DILocation(line: 581, column: 19, scope: !102)
!724 = !DILocation(line: 581, column: 7, scope: !93)
!725 = !DILocation(line: 585, column: 26, scope: !101)
!726 = !DILocation(line: 0, scope: !101)
!727 = !DILocation(line: 586, column: 23, scope: !101)
!728 = !DILocation(line: 586, column: 28, scope: !101)
!729 = !DILocation(line: 586, column: 32, scope: !101)
!730 = !{!627, !627, i64 0}
!731 = !DILocation(line: 586, column: 38, scope: !101)
!732 = !DILocation(line: 0, scope: !671, inlinedAt: !733)
!733 = distinct !DILocation(line: 586, column: 41, scope: !101)
!734 = !DILocation(line: 1361, column: 11, scope: !671, inlinedAt: !733)
!735 = !DILocation(line: 1361, column: 10, scope: !671, inlinedAt: !733)
!736 = !DILocation(line: 586, column: 19, scope: !101)
!737 = !DILocation(line: 587, column: 5, scope: !101)
!738 = !DILocation(line: 588, column: 7, scope: !739)
!739 = distinct !DILexicalBlock(scope: !93, file: !94, line: 588, column: 7)
!740 = !DILocation(line: 588, column: 7, scope: !93)
!741 = !DILocation(line: 590, column: 7, scope: !742)
!742 = distinct !DILexicalBlock(scope: !739, file: !94, line: 589, column: 5)
!743 = !DILocation(line: 591, column: 7, scope: !742)
!744 = !DILocation(line: 595, column: 37, scope: !93)
!745 = !DILocation(line: 595, column: 35, scope: !93)
!746 = !DILocation(line: 596, column: 29, scope: !93)
!747 = !DILocation(line: 597, column: 8, scope: !110)
!748 = !DILocation(line: 597, column: 7, scope: !93)
!749 = !DILocation(line: 604, column: 24, scope: !109)
!750 = !DILocation(line: 604, column: 12, scope: !110)
!751 = !DILocation(line: 0, scope: !108)
!752 = !DILocation(line: 610, column: 16, scope: !108)
!753 = !DILocation(line: 610, column: 7, scope: !108)
!754 = !DILocation(line: 611, column: 21, scope: !108)
!755 = !{!756, !756, i64 0}
!756 = !{!"short", !627, i64 0}
!757 = !DILocation(line: 611, column: 19, scope: !108)
!758 = !DILocation(line: 611, column: 16, scope: !108)
!759 = !DILocation(line: 610, column: 30, scope: !108)
!760 = distinct !{!760, !753, !754, !688}
!761 = !DILocation(line: 612, column: 18, scope: !762)
!762 = distinct !DILexicalBlock(scope: !108, file: !94, line: 612, column: 11)
!763 = !DILocation(line: 612, column: 11, scope: !108)
!764 = !DILocation(line: 620, column: 23, scope: !93)
!765 = !DILocation(line: 625, column: 39, scope: !93)
!766 = !DILocation(line: 626, column: 3, scope: !93)
!767 = !DILocation(line: 626, column: 10, scope: !93)
!768 = !DILocation(line: 626, column: 21, scope: !93)
!769 = !DILocation(line: 628, column: 44, scope: !770)
!770 = distinct !DILexicalBlock(scope: !771, file: !94, line: 628, column: 11)
!771 = distinct !DILexicalBlock(scope: !93, file: !94, line: 627, column: 5)
!772 = !DILocation(line: 628, column: 32, scope: !770)
!773 = !DILocation(line: 628, column: 49, scope: !770)
!774 = !DILocation(line: 628, column: 11, scope: !771)
!775 = !DILocation(line: 630, column: 11, scope: !776)
!776 = distinct !DILexicalBlock(scope: !771, file: !94, line: 630, column: 11)
!777 = !DILocation(line: 630, column: 11, scope: !771)
!778 = !DILocation(line: 632, column: 26, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !94, line: 632, column: 15)
!780 = distinct !DILexicalBlock(scope: !776, file: !94, line: 631, column: 9)
!781 = !DILocation(line: 632, column: 34, scope: !779)
!782 = !DILocation(line: 632, column: 37, scope: !779)
!783 = !DILocation(line: 632, column: 15, scope: !780)
!784 = !DILocation(line: 636, column: 29, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !94, line: 636, column: 15)
!786 = !DILocation(line: 640, column: 16, scope: !771)
!787 = distinct !{!787, !766, !788, !688}
!788 = !DILocation(line: 641, column: 5, scope: !93)
!789 = !DILocation(line: 644, column: 3, scope: !93)
!790 = !DILocation(line: 0, scope: !671, inlinedAt: !791)
!791 = distinct !DILocation(line: 648, column: 31, scope: !93)
!792 = !DILocation(line: 0, scope: !671, inlinedAt: !793)
!793 = distinct !DILocation(line: 649, column: 31, scope: !93)
!794 = !DILocation(line: 0, scope: !671, inlinedAt: !795)
!795 = distinct !DILocation(line: 650, column: 31, scope: !93)
!796 = !DILocation(line: 0, scope: !671, inlinedAt: !797)
!797 = distinct !DILocation(line: 651, column: 31, scope: !93)
!798 = !DILocation(line: 0, scope: !671, inlinedAt: !799)
!799 = distinct !DILocation(line: 652, column: 31, scope: !93)
!800 = !DILocation(line: 0, scope: !671, inlinedAt: !801)
!801 = distinct !DILocation(line: 653, column: 31, scope: !93)
!802 = !DILocation(line: 0, scope: !671, inlinedAt: !803)
!803 = distinct !DILocation(line: 654, column: 31, scope: !93)
!804 = !DILocation(line: 0, scope: !671, inlinedAt: !805)
!805 = distinct !DILocation(line: 655, column: 31, scope: !93)
!806 = !DILocation(line: 0, scope: !671, inlinedAt: !807)
!807 = distinct !DILocation(line: 656, column: 31, scope: !93)
!808 = !DILocation(line: 0, scope: !671, inlinedAt: !809)
!809 = distinct !DILocation(line: 657, column: 31, scope: !93)
!810 = !DILocation(line: 663, column: 7, scope: !811)
!811 = distinct !DILexicalBlock(scope: !93, file: !94, line: 663, column: 7)
!812 = !DILocation(line: 664, column: 7, scope: !811)
!813 = !DILocation(line: 664, column: 10, scope: !811)
!814 = !DILocation(line: 663, column: 7, scope: !93)
!815 = !DILocation(line: 669, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !94, line: 665, column: 5)
!817 = !DILocation(line: 671, column: 5, scope: !816)
!818 = !DILocation(line: 676, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !811, file: !94, line: 673, column: 5)
!820 = !DILocation(line: 679, column: 3, scope: !93)
!821 = !DILocation(line: 683, column: 3, scope: !93)
!822 = !DILocation(line: 686, column: 3, scope: !93)
!823 = !DILocation(line: 688, column: 3, scope: !93)
!824 = !DILocation(line: 691, column: 3, scope: !93)
!825 = !DILocation(line: 695, column: 3, scope: !93)
!826 = !DILocation(line: 696, column: 1, scope: !93)
!827 = !DISubprogram(name: "setlocale", scope: !828, file: !828, line: 122, type: !829, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!828 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!829 = !DISubroutineType(types: !830)
!830 = !{!8, !6, !46}
!831 = !DISubprogram(name: "getenv", scope: !832, file: !832, line: 641, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!832 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!833 = !DISubroutineType(types: !834)
!834 = !{!8, !46}
!835 = !DISubprogram(name: "fwrite_unlocked", scope: !328, file: !328, line: 704, type: !836, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!836 = !DISubroutineType(types: !837)
!837 = !{!49, !838, !49, !49, !718}
!838 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!841 = !DILocation(line: 0, scope: !2)
!842 = !DILocation(line: 502, column: 21, scope: !2)
!843 = !DILocation(line: 502, column: 3, scope: !2)
!844 = !DILocation(line: 503, column: 3, scope: !2)
!845 = !DILocation(line: 504, column: 3, scope: !2)
!846 = !DILocation(line: 505, column: 3, scope: !2)
!847 = !DILocation(line: 507, column: 3, scope: !2)
!848 = !DILocation(line: 509, column: 3, scope: !2)
!849 = !DILocation(line: 509, column: 18, scope: !2)
!850 = !DILocation(line: 514, column: 33, scope: !851)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 512, column: 9)
!852 = distinct !DILexicalBlock(scope: !2, file: !3, line: 510, column: 5)
!853 = !DILocation(line: 515, column: 11, scope: !851)
!854 = !DILocation(line: 517, column: 27, scope: !851)
!855 = !{!856, !856, i64 0}
!856 = !{!"long", !627, i64 0}
!857 = !DILocation(line: 518, column: 11, scope: !851)
!858 = !DILocation(line: 520, column: 23, scope: !851)
!859 = !DILocation(line: 520, column: 21, scope: !851)
!860 = !DILocation(line: 521, column: 11, scope: !851)
!861 = distinct !{!861, !848, !862, !688}
!862 = !DILocation(line: 527, column: 5, scope: !2)
!863 = !DILocation(line: 522, column: 9, scope: !851)
!864 = !DILocation(line: 523, column: 9, scope: !851)
!865 = !DILocation(line: 525, column: 11, scope: !851)
!866 = !DILocation(line: 529, column: 7, scope: !867)
!867 = distinct !DILexicalBlock(scope: !2, file: !3, line: 529, column: 7)
!868 = !DILocation(line: 529, column: 23, scope: !867)
!869 = !DILocation(line: 0, scope: !867)
!870 = !DILocation(line: 529, column: 7, scope: !2)
!871 = !DILocation(line: 531, column: 11, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !3, line: 530, column: 5)
!873 = !DILocation(line: 532, column: 9, scope: !874)
!874 = distinct !DILexicalBlock(scope: !872, file: !3, line: 531, column: 11)
!875 = !DILocation(line: 535, column: 36, scope: !872)
!876 = !DILocation(line: 536, column: 34, scope: !872)
!877 = !{!878, !626, i64 32}
!878 = !{!"re_pattern_buffer", !626, i64 0, !856, i64 8, !856, i64 16, !856, i64 24, !626, i64 32, !626, i64 40, !856, i64 48, !722, i64 56, !722, i64 56, !722, i64 56, !722, i64 56, !722, i64 56, !722, i64 56, !722, i64 56}
!879 = !DILocation(line: 537, column: 36, scope: !872)
!880 = !{!878, !626, i64 40}
!881 = !DILocation(line: 538, column: 54, scope: !872)
!882 = !DILocation(line: 538, column: 23, scope: !872)
!883 = !DILocation(line: 540, column: 11, scope: !884)
!884 = distinct !DILexicalBlock(scope: !872, file: !3, line: 540, column: 11)
!885 = !DILocation(line: 540, column: 11, scope: !872)
!886 = !DILocation(line: 541, column: 9, scope: !884)
!887 = !DILocation(line: 544, column: 38, scope: !867)
!888 = !DILocation(line: 544, column: 51, scope: !867)
!889 = !DILocation(line: 544, column: 36, scope: !867)
!890 = !DILocation(line: 544, column: 18, scope: !867)
!891 = !DILocation(line: 547, column: 26, scope: !2)
!892 = !DILocation(line: 547, column: 3, scope: !2)
!893 = !DILocation(line: 549, column: 24, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 549, column: 11)
!895 = distinct !DILexicalBlock(scope: !2, file: !3, line: 548, column: 5)
!896 = !DILocation(line: 549, column: 11, scope: !895)
!897 = !DILocation(line: 550, column: 9, scope: !894)
!898 = !DILocation(line: 551, column: 17, scope: !895)
!899 = distinct !{!899, !892, !900, !688}
!900 = !DILocation(line: 552, column: 5, scope: !2)
!901 = !DILocation(line: 553, column: 32, scope: !2)
!902 = !DILocation(line: 553, column: 50, scope: !2)
!903 = !DILocation(line: 554, column: 21, scope: !2)
!904 = !DILocation(line: 554, column: 17, scope: !2)
!905 = !DILocation(line: 555, column: 20, scope: !906)
!906 = distinct !DILexicalBlock(scope: !2, file: !3, line: 555, column: 7)
!907 = !DILocation(line: 555, column: 39, scope: !906)
!908 = !DILocation(line: 556, column: 5, scope: !906)
!909 = !DILocation(line: 557, column: 14, scope: !2)
!910 = !DILocation(line: 558, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !2, file: !3, line: 558, column: 7)
!912 = !DILocation(line: 558, column: 7, scope: !2)
!913 = !DILocation(line: 560, column: 25, scope: !914)
!914 = distinct !DILexicalBlock(scope: !911, file: !3, line: 559, column: 5)
!915 = !DILocation(line: 560, column: 56, scope: !914)
!916 = !DILocation(line: 560, column: 55, scope: !914)
!917 = !DILocation(line: 560, column: 52, scope: !914)
!918 = !DILocalVariable(name: "__dest", arg: 1, scope: !919, file: !920, line: 26, type: !923)
!919 = distinct !DISubprogram(name: "memcpy", scope: !920, file: !920, line: 26, type: !921, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !924)
!920 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!921 = !DISubroutineType(types: !922)
!922 = !{!43, !923, !838, !49}
!923 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!924 = !{!918, !925, !926}
!925 = !DILocalVariable(name: "__src", arg: 2, scope: !919, file: !920, line: 26, type: !838)
!926 = !DILocalVariable(name: "__len", arg: 3, scope: !919, file: !920, line: 26, type: !49)
!927 = !DILocation(line: 0, scope: !919, inlinedAt: !928)
!928 = distinct !DILocation(line: 560, column: 7, scope: !914)
!929 = !DILocation(line: 29, column: 10, scope: !919, inlinedAt: !928)
!930 = !DILocation(line: 562, column: 5, scope: !914)
!931 = !DILocation(line: 0, scope: !911)
!932 = !DILocation(line: 568, column: 11, scope: !2)
!933 = !DILocation(line: 568, column: 18, scope: !2)
!934 = !DILocation(line: 0, scope: !239)
!935 = !DILocation(line: 576, column: 24, scope: !936)
!936 = distinct !DILexicalBlock(scope: !239, file: !3, line: 576, column: 5)
!937 = !DILocation(line: 576, column: 5, scope: !239)
!938 = !DILocation(line: 581, column: 3, scope: !2)
!939 = !DILocation(line: 583, column: 7, scope: !940)
!940 = distinct !DILexicalBlock(scope: !2, file: !3, line: 583, column: 7)
!941 = !DILocation(line: 583, column: 23, scope: !940)
!942 = !DILocalVariable(name: "filename", arg: 1, scope: !943, file: !3, line: 449, type: !46)
!943 = distinct !DISubprogram(name: "tac_file", scope: !3, file: !3, line: 449, type: !944, scopeLine: 450, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !946)
!944 = !DISubroutineType(types: !945)
!945 = !{!104, !46}
!946 = !{!942, !947, !948, !950, !951}
!947 = !DILocalVariable(name: "ok", scope: !943, file: !3, line: 451, type: !104)
!948 = !DILocalVariable(name: "file_size", scope: !943, file: !3, line: 452, type: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !328, line: 63, baseType: !143)
!950 = !DILocalVariable(name: "fd", scope: !943, file: !3, line: 453, type: !6)
!951 = !DILocalVariable(name: "is_stdin", scope: !943, file: !3, line: 454, type: !104)
!952 = !DILocation(line: 0, scope: !943, inlinedAt: !953)
!953 = distinct !DILocation(line: 577, column: 13, scope: !936)
!954 = !DILocation(line: 0, scope: !671, inlinedAt: !955)
!955 = distinct !DILocation(line: 454, column: 19, scope: !943, inlinedAt: !953)
!956 = !DILocation(line: 1361, column: 11, scope: !671, inlinedAt: !955)
!957 = !DILocation(line: 1361, column: 10, scope: !671, inlinedAt: !955)
!958 = !DILocation(line: 456, column: 7, scope: !943, inlinedAt: !953)
!959 = !DILocation(line: 458, column: 23, scope: !960, inlinedAt: !953)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 457, column: 5)
!961 = distinct !DILexicalBlock(scope: !943, file: !3, line: 456, column: 7)
!962 = !DILocation(line: 460, column: 18, scope: !960, inlinedAt: !953)
!963 = !DILocation(line: 462, column: 5, scope: !960, inlinedAt: !953)
!964 = !DILocation(line: 465, column: 12, scope: !965, inlinedAt: !953)
!965 = distinct !DILexicalBlock(scope: !961, file: !3, line: 464, column: 5)
!966 = !DILocation(line: 466, column: 14, scope: !967, inlinedAt: !953)
!967 = distinct !DILexicalBlock(scope: !965, file: !3, line: 466, column: 11)
!968 = !DILocation(line: 466, column: 11, scope: !965, inlinedAt: !953)
!969 = !DILocation(line: 468, column: 11, scope: !970, inlinedAt: !953)
!970 = distinct !DILexicalBlock(scope: !967, file: !3, line: 467, column: 9)
!971 = !DILocation(line: 470, column: 11, scope: !970, inlinedAt: !953)
!972 = !DILocation(line: 0, scope: !961, inlinedAt: !953)
!973 = !DILocation(line: 474, column: 15, scope: !943, inlinedAt: !953)
!974 = !DILocation(line: 476, column: 19, scope: !943, inlinedAt: !953)
!975 = !DILocation(line: 476, column: 23, scope: !943, inlinedAt: !953)
!976 = !DILocation(line: 476, column: 26, scope: !943, inlinedAt: !953)
!977 = !DILocation(line: 476, column: 9, scope: !943, inlinedAt: !953)
!978 = !DILocalVariable(name: "input_fd", arg: 1, scope: !979, file: !3, line: 432, type: !6)
!979 = distinct !DISubprogram(name: "tac_nonseekable", scope: !3, file: !3, line: 432, type: !980, scopeLine: 433, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!104, !6, !46}
!982 = !{!978, !983, !984, !985, !986, !987}
!983 = !DILocalVariable(name: "file", arg: 2, scope: !979, file: !3, line: 432, type: !46)
!984 = !DILocalVariable(name: "tmp_stream", scope: !979, file: !3, line: 434, type: !117)
!985 = !DILocalVariable(name: "tmp_file", scope: !979, file: !3, line: 435, type: !8)
!986 = !DILocalVariable(name: "bytes_copied", scope: !979, file: !3, line: 436, type: !949)
!987 = !DILocalVariable(name: "ok", scope: !979, file: !3, line: 440, type: !104)
!988 = !DILocation(line: 0, scope: !979, inlinedAt: !989)
!989 = distinct !DILocation(line: 477, column: 11, scope: !943, inlinedAt: !953)
!990 = !DILocalVariable(name: "g_tmp", arg: 1, scope: !991, file: !3, line: 386, type: !994)
!991 = distinct !DISubprogram(name: "copy_to_temp", scope: !3, file: !3, line: 386, type: !992, scopeLine: 387, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !995)
!992 = !DISubroutineType(types: !993)
!993 = !{!949, !994, !7, !6, !46}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!995 = !{!990, !996, !997, !998, !999, !1000, !1001, !1005, !1009, !1012, !1013}
!996 = !DILocalVariable(name: "g_tempfile", arg: 2, scope: !991, file: !3, line: 386, type: !7)
!997 = !DILocalVariable(name: "input_fd", arg: 3, scope: !991, file: !3, line: 386, type: !6)
!998 = !DILocalVariable(name: "file", arg: 4, scope: !991, file: !3, line: 386, type: !46)
!999 = !DILocalVariable(name: "fp", scope: !991, file: !3, line: 388, type: !117)
!1000 = !DILocalVariable(name: "file_name", scope: !991, file: !3, line: 389, type: !8)
!1001 = !DILocalVariable(name: "bytes_copied", scope: !991, file: !3, line: 390, type: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1003, line: 102, baseType: !1004)
!1003 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !144, line: 73, baseType: !51)
!1005 = !DILocalVariable(name: "bytes_read", scope: !1006, file: !3, line: 396, type: !1007)
!1006 = distinct !DILexicalBlock(scope: !991, file: !3, line: 395, column: 5)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !328, line: 77, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !144, line: 194, baseType: !145)
!1009 = !DILocalVariable(name: "__ptr", scope: !1010, file: !3, line: 405, type: !46)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 405, column: 11)
!1011 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 405, column: 11)
!1012 = !DILocalVariable(name: "__stream", scope: !1010, file: !3, line: 405, type: !117)
!1013 = !DILocalVariable(name: "__cnt", scope: !1010, file: !3, line: 405, type: !49)
!1014 = !DILocation(line: 0, scope: !991, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 436, column: 24, scope: !979, inlinedAt: !989)
!1016 = !DILocation(line: 388, column: 3, scope: !991, inlinedAt: !1015)
!1017 = !DILocation(line: 389, column: 3, scope: !991, inlinedAt: !1015)
!1018 = !DILocation(line: 391, column: 8, scope: !1019, inlinedAt: !1015)
!1019 = distinct !DILexicalBlock(scope: !991, file: !3, line: 391, column: 7)
!1020 = !DILocation(line: 391, column: 7, scope: !991, inlinedAt: !1015)
!1021 = !DILocation(line: 396, column: 44, scope: !1006, inlinedAt: !1015)
!1022 = !DILocation(line: 396, column: 54, scope: !1006, inlinedAt: !1015)
!1023 = !DILocation(line: 396, column: 28, scope: !1006, inlinedAt: !1015)
!1024 = !DILocation(line: 0, scope: !1006, inlinedAt: !1015)
!1025 = !DILocation(line: 397, column: 22, scope: !1026, inlinedAt: !1015)
!1026 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 397, column: 11)
!1027 = !DILocation(line: 397, column: 11, scope: !1006, inlinedAt: !1015)
!1028 = !DILocation(line: 399, column: 22, scope: !1029, inlinedAt: !1015)
!1029 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 399, column: 11)
!1030 = !DILocation(line: 399, column: 11, scope: !1006, inlinedAt: !1015)
!1031 = !DILocation(line: 401, column: 11, scope: !1032, inlinedAt: !1015)
!1032 = distinct !DILexicalBlock(scope: !1029, file: !3, line: 400, column: 9)
!1033 = !DILocation(line: 402, column: 11, scope: !1032, inlinedAt: !1015)
!1034 = !DILocation(line: 0, scope: !1011, inlinedAt: !1015)
!1035 = !DILocation(line: 405, column: 11, scope: !1011, inlinedAt: !1015)
!1036 = !DILocation(line: 405, column: 48, scope: !1011, inlinedAt: !1015)
!1037 = !DILocation(line: 414, column: 20, scope: !1006, inlinedAt: !1015)
!1038 = !DILocation(line: 405, column: 11, scope: !1006, inlinedAt: !1015)
!1039 = !DILocation(line: 407, column: 11, scope: !1040, inlinedAt: !1015)
!1040 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 406, column: 9)
!1041 = !DILocation(line: 408, column: 11, scope: !1040, inlinedAt: !1015)
!1042 = !DILocation(line: 390, column: 13, scope: !991, inlinedAt: !1015)
!1043 = !DILocation(line: 417, column: 7, scope: !1044, inlinedAt: !1015)
!1044 = distinct !DILexicalBlock(scope: !991, file: !3, line: 417, column: 7)
!1045 = !DILocation(line: 417, column: 19, scope: !1044, inlinedAt: !1015)
!1046 = !DILocation(line: 417, column: 7, scope: !991, inlinedAt: !1015)
!1047 = !DILocation(line: 419, column: 7, scope: !1048, inlinedAt: !1015)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 418, column: 5)
!1049 = !DILocation(line: 420, column: 7, scope: !1048, inlinedAt: !1015)
!1050 = !DILocation(line: 426, column: 1, scope: !991, inlinedAt: !1015)
!1051 = !DILocation(line: 437, column: 7, scope: !979, inlinedAt: !989)
!1052 = !DILocation(line: 423, column: 12, scope: !991, inlinedAt: !1015)
!1053 = !DILocation(line: 424, column: 17, scope: !991, inlinedAt: !1015)
!1054 = !DILocation(line: 437, column: 20, scope: !1055, inlinedAt: !989)
!1055 = distinct !DILexicalBlock(scope: !979, file: !3, line: 437, column: 7)
!1056 = !DILocation(line: 440, column: 27, scope: !979, inlinedAt: !989)
!1057 = !DILocation(line: 440, column: 13, scope: !979, inlinedAt: !989)
!1058 = !DILocation(line: 478, column: 11, scope: !943, inlinedAt: !953)
!1059 = !DILocation(line: 480, column: 17, scope: !1060, inlinedAt: !953)
!1060 = distinct !DILexicalBlock(scope: !943, file: !3, line: 480, column: 7)
!1061 = !DILocation(line: 480, column: 20, scope: !1060, inlinedAt: !953)
!1062 = !DILocation(line: 480, column: 31, scope: !1060, inlinedAt: !953)
!1063 = !DILocation(line: 480, column: 7, scope: !943, inlinedAt: !953)
!1064 = !DILocation(line: 482, column: 7, scope: !1065, inlinedAt: !953)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !3, line: 481, column: 5)
!1066 = !DILocation(line: 484, column: 5, scope: !1065, inlinedAt: !953)
!1067 = !DILocation(line: 577, column: 10, scope: !936)
!1068 = !DILocation(line: 576, column: 33, scope: !936)
!1069 = distinct !{!1069, !937, !1070, !688}
!1070 = !DILocation(line: 577, column: 30, scope: !239)
!1071 = !DILocation(line: 583, column: 26, scope: !940)
!1072 = !DILocation(line: 583, column: 47, scope: !940)
!1073 = !DILocation(line: 583, column: 7, scope: !2)
!1074 = !DILocation(line: 585, column: 7, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !940, file: !3, line: 584, column: 5)
!1076 = !DILocation(line: 587, column: 5, scope: !1075)
!1077 = !DILocation(line: 589, column: 3, scope: !2)
!1078 = !DILocation(line: 590, column: 1, scope: !2)
!1079 = !DISubprogram(name: "bindtextdomain", scope: !711, file: !711, line: 86, type: !1080, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!8, !46, !46}
!1082 = !DISubprogram(name: "textdomain", scope: !711, file: !711, line: 82, type: !833, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!1083 = !DISubprogram(name: "atexit", scope: !832, file: !832, line: 602, type: !1084, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!6, !354}
!1086 = !DISubprogram(name: "getopt_long", scope: !183, file: !183, line: 66, type: !1087, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!6, !6, !1089, !46, !1091, !188}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!1092 = !DISubprogram(name: "re_compile_pattern", scope: !65, file: !65, line: 548, type: !1093, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !634)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!46, !46, !49, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!1096 = !DILocation(line: 0, scope: !210)
!1097 = !DILocation(line: 156, column: 34, scope: !210)
!1098 = !DILocation(line: 157, column: 40, scope: !210)
!1099 = !DILocation(line: 157, column: 38, scope: !210)
!1100 = !DILocation(line: 159, column: 8, scope: !220)
!1101 = !DILocation(line: 159, column: 7, scope: !210)
!1102 = !DILocation(line: 168, column: 23, scope: !210)
!1103 = !DILocation(line: 168, column: 3, scope: !210)
!1104 = !DILocation(line: 170, column: 22, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !210, file: !3, line: 169, column: 5)
!1106 = !DILocation(line: 0, scope: !919, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 170, column: 7, scope: !1105)
!1108 = !DILocation(line: 29, column: 10, scope: !919, inlinedAt: !1107)
!1109 = !DILocation(line: 173, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 173, column: 11)
!1111 = !DILocation(line: 173, column: 49, scope: !1110)
!1112 = !DILocation(line: 173, column: 11, scope: !1105)
!1113 = !DILocation(line: 172, column: 13, scope: !1105)
!1114 = !DILocation(line: 171, column: 20, scope: !1105)
!1115 = !DILocation(line: 175, column: 23, scope: !1105)
!1116 = !DILocation(line: 161, column: 11, scope: !218)
!1117 = !DILocation(line: 161, column: 58, scope: !218)
!1118 = !DILocation(line: 161, column: 55, scope: !218)
!1119 = !DILocation(line: 161, column: 11, scope: !219)
!1120 = !DILocation(line: 948, column: 21, scope: !1121, inlinedAt: !1124)
!1121 = distinct !DISubprogram(name: "write_error", scope: !94, file: !94, line: 946, type: !355, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1122)
!1122 = !{!1123}
!1123 = !DILocalVariable(name: "saved_errno", scope: !1121, file: !94, line: 948, type: !6)
!1124 = distinct !DILocation(line: 162, column: 9, scope: !218)
!1125 = !DILocation(line: 0, scope: !1121, inlinedAt: !1124)
!1126 = !DILocation(line: 949, column: 3, scope: !1121, inlinedAt: !1124)
!1127 = !DILocation(line: 950, column: 11, scope: !1121, inlinedAt: !1124)
!1128 = !DILocation(line: 950, column: 3, scope: !1121, inlinedAt: !1124)
!1129 = !DILocation(line: 951, column: 3, scope: !1121, inlinedAt: !1124)
!1130 = !DILocation(line: 952, column: 3, scope: !1121, inlinedAt: !1124)
!1131 = !DILocation(line: 948, column: 21, scope: !1121, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 174, column: 9, scope: !1110)
