; ModuleID = 'src/tail.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.File_spec = type { i8*, i8*, %struct.timespec, i64, i64, i32, i64, i8, i8, i8, i32, i32, i32, i32, i32, i64, i64 }
%struct.pollfd = type { i32, i16, i16 }

!33 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!35 = !DIEnumerator(name: "_ISupper", value: 256)
!36 = !DIEnumerator(name: "_ISlower", value: 512)
!37 = !DIEnumerator(name: "_ISalpha", value: 1024)
!38 = !DIEnumerator(name: "_ISdigit", value: 2048)
!39 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!40 = !DIEnumerator(name: "_ISspace", value: 8192)
!41 = !DIEnumerator(name: "_ISprint", value: 16384)
!42 = !DIEnumerator(name: "_ISgraph", value: 32768)
!43 = !DIEnumerator(name: "_ISblank", value: 1)
!44 = !DIEnumerator(name: "_IScntrl", value: 2)
!45 = !DIEnumerator(name: "_ISpunct", value: 4)
!46 = !DIEnumerator(name: "_ISalnum", value: 8)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 24, baseType: !6, size: 32, elements: !49)
!48 = !DIFile(filename: "./lib/xdectoint.h", directory: "/src", checksumkind: CSK_MD5, checksum: "940e29395e05012ab491478a296c89a0")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "XTOINT_MIN_QUIET", value: 1)
!51 = !DIEnumerator(name: "XTOINT_MAX_QUIET", value: 2)
!52 = !DIEnumerator(name: "XTOINT_MIN_RANGE", value: 4)
!53 = !DIEnumerator(name: "XTOINT_MAX_RANGE", value: 8)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 81, baseType: !55, size: 32, elements: !56)
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "COPY_TO_EOF", value: -1)
!58 = !DIEnumerator(name: "COPY_A_BUFFER", value: -2)
!59 = !{!55, !60, !61, !64, !67, !68, !69, !63, !70, !71, !73, !77, !78}
!60 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!63 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!69 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !74, line: 97, baseType: !75)
!74 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !76, line: 154, baseType: !55)
!76 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !79, line: 63, baseType: !80)
!79 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !76, line: 152, baseType: !69)
!81 = !{!82, !194, !196, !198, !200, !0, !202, !204, !206, !289, !291, !305, !307, !311, !317, !319, !321, !323, !326, !328, !330, !332, !334, !341, !354}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "dummy_stdin", scope: !84, file: !3, line: 2396, type: !77, isLocal: true, isDefinition: true)
!84 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 2347, type: !85, scopeLine: 2348, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!85 = !DISubroutineType(types: !86)
!86 = !{!55, !55, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!88 = !{!89, !90, !91, !92, !93, !98, !99, !100, !137, !138, !140, !142, !144, !146, !176, !177, !179, !181, !184, !187}
!89 = !DILocalVariable(name: "argc", arg: 1, scope: !84, file: !3, line: 2347, type: !55)
!90 = !DILocalVariable(name: "argv", arg: 2, scope: !84, file: !3, line: 2347, type: !87)
!91 = !DILocalVariable(name: "header_mode", scope: !84, file: !3, line: 2349, type: !9)
!92 = !DILocalVariable(name: "ok", scope: !84, file: !3, line: 2350, type: !68)
!93 = !DILocalVariable(name: "n_units", scope: !84, file: !3, line: 2353, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "count_t", file: !3, line: 85, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !96, line: 101, baseType: !97)
!96 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !76, line: 72, baseType: !69)
!98 = !DILocalVariable(name: "n_files", scope: !84, file: !3, line: 2354, type: !55)
!99 = !DILocalVariable(name: "file", scope: !84, file: !3, line: 2355, type: !87)
!100 = !DILocalVariable(name: "F", scope: !84, file: !3, line: 2356, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "File_spec", file: !3, line: 118, size: 832, elements: !103)
!103 = !{!104, !105, !106, !114, !117, !120, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !136}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !3, line: 121, baseType: !77, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prettyname", scope: !102, file: !3, line: 124, baseType: !64, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !102, file: !3, line: 127, baseType: !107, size: 128, offset: 128)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !108, line: 11, size: 128, elements: !109)
!108 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!109 = !{!110, !112}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !107, file: !108, line: 16, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !76, line: 160, baseType: !69)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !107, file: !108, line: 21, baseType: !113, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !76, line: 197, baseType: !69)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !3, line: 128, baseType: !115, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !74, line: 59, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !76, line: 145, baseType: !63)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !3, line: 129, baseType: !118, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !74, line: 47, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !76, line: 148, baseType: !63)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !102, file: !3, line: 130, baseType: !121, size: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !74, line: 69, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !76, line: 150, baseType: !6)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !102, file: !3, line: 134, baseType: !78, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !102, file: !3, line: 139, baseType: !68, size: 8, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "remote", scope: !102, file: !3, line: 142, baseType: !68, size: 8, offset: 520)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tailable", scope: !102, file: !3, line: 146, baseType: !68, size: 8, offset: 528)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !102, file: !3, line: 149, baseType: !55, size: 32, offset: 544)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "errnum", scope: !102, file: !3, line: 153, baseType: !55, size: 32, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "blocking", scope: !102, file: !3, line: 156, baseType: !55, size: 32, offset: 608)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "wd", scope: !102, file: !3, line: 160, baseType: !55, size: 32, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "parent_wd", scope: !102, file: !3, line: 164, baseType: !55, size: 32, offset: 672)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "basename_start", scope: !102, file: !3, line: 167, baseType: !133, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !134, line: 130, baseType: !135)
!134 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !62, line: 35, baseType: !69)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "n_unchanged_stats", scope: !102, file: !3, line: 171, baseType: !94, size: 64, offset: 768)
!137 = !DILocalVariable(name: "obsolete_option", scope: !84, file: !3, line: 2357, type: !68)
!138 = !DILocalVariable(name: "sleep_interval", scope: !84, file: !3, line: 2362, type: !139)
!139 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!140 = !DILocalVariable(name: "p", scope: !141, file: !3, line: 2373, type: !55)
!141 = distinct !DILexicalBlock(scope: !84, file: !3, line: 2372, column: 3)
!142 = !DILocalVariable(name: "found_hyphen", scope: !143, file: !3, line: 2402, type: !68)
!143 = distinct !DILexicalBlock(scope: !84, file: !3, line: 2401, column: 3)
!144 = !DILocalVariable(name: "i", scope: !145, file: !3, line: 2404, type: !55)
!145 = distinct !DILexicalBlock(scope: !143, file: !3, line: 2404, column: 5)
!146 = !DILocalVariable(name: "in_stat", scope: !147, file: !3, line: 2418, type: !149)
!147 = distinct !DILexicalBlock(scope: !148, file: !3, line: 2417, column: 7)
!148 = distinct !DILexicalBlock(scope: !143, file: !3, line: 2416, column: 9)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !150, line: 44, size: 1024, elements: !151)
!150 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!151 = !{!152, !153, !154, !155, !157, !159, !161, !162, !163, !164, !166, !167, !169, !170, !171, !172}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !149, file: !150, line: 46, baseType: !116, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !149, file: !150, line: 47, baseType: !119, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !149, file: !150, line: 48, baseType: !122, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !149, file: !150, line: 49, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !76, line: 151, baseType: !6)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !149, file: !150, line: 50, baseType: !158, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !76, line: 146, baseType: !6)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !149, file: !150, line: 51, baseType: !160, size: 32, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !76, line: 147, baseType: !6)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !149, file: !150, line: 52, baseType: !116, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !149, file: !150, line: 53, baseType: !116, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !149, file: !150, line: 54, baseType: !80, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !149, file: !150, line: 55, baseType: !165, size: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !76, line: 175, baseType: !55)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !149, file: !150, line: 56, baseType: !55, size: 32, offset: 480)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !149, file: !150, line: 57, baseType: !168, size: 64, offset: 512)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !76, line: 180, baseType: !69)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !149, file: !150, line: 65, baseType: !107, size: 128, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !149, file: !150, line: 66, baseType: !107, size: 128, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !149, file: !150, line: 67, baseType: !107, size: 128, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !149, file: !150, line: 79, baseType: !173, size: 64, offset: 960)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DILocalVariable(name: "blocking_stdin", scope: !147, file: !3, line: 2419, type: !68)
!177 = !DILocalVariable(name: "i", scope: !178, file: !3, line: 2437, type: !55)
!178 = distinct !DILexicalBlock(scope: !84, file: !3, line: 2437, column: 3)
!179 = !DILocalVariable(name: "i", scope: !180, file: !3, line: 2449, type: !55)
!180 = distinct !DILexicalBlock(scope: !84, file: !3, line: 2449, column: 3)
!181 = !DILocalVariable(name: "out_stat", scope: !182, file: !3, line: 2456, type: !149)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 2453, column: 5)
!183 = distinct !DILexicalBlock(scope: !84, file: !3, line: 2452, column: 7)
!184 = !DILocalVariable(name: "wd", scope: !185, file: !3, line: 2510, type: !55)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 2509, column: 9)
!186 = distinct !DILexicalBlock(scope: !182, file: !3, line: 2508, column: 11)
!187 = !DILocalVariable(name: "ht", scope: !188, file: !3, line: 2519, type: !190)
!188 = distinct !DILexicalBlock(scope: !189, file: !3, line: 2512, column: 13)
!189 = distinct !DILexicalBlock(scope: !185, file: !3, line: 2511, column: 15)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !192, line: 56, baseType: !193)
!192 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !192, line: 54, flags: DIFlagFwdDecl)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "forever", scope: !2, file: !3, line: 187, type: !68, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "monitor_output", scope: !2, file: !3, line: 190, type: !68, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "from_start", scope: !2, file: !3, line: 193, type: !68, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "print_headers", scope: !2, file: !3, line: 196, type: !68, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 226, type: !68, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "disable_inotify", scope: !2, file: !3, line: 234, type: !68, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !208, file: !209, line: 575, type: !55, isLocal: true, isDefinition: true)
!208 = distinct !DISubprogram(name: "oputs_", scope: !209, file: !209, line: 573, type: !210, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !212)
!209 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!210 = !DISubroutineType(types: !211)
!211 = !{null, !64, !64}
!212 = !{!213, !214, !215, !218, !219, !220, !221, !225, !226, !227, !228, !230, !283, !284, !285, !287, !288}
!213 = !DILocalVariable(name: "program", arg: 1, scope: !208, file: !209, line: 573, type: !64)
!214 = !DILocalVariable(name: "option", arg: 2, scope: !208, file: !209, line: 573, type: !64)
!215 = !DILocalVariable(name: "term", scope: !216, file: !209, line: 585, type: !64)
!216 = distinct !DILexicalBlock(scope: !217, file: !209, line: 582, column: 5)
!217 = distinct !DILexicalBlock(scope: !208, file: !209, line: 581, column: 7)
!218 = !DILocalVariable(name: "double_space", scope: !208, file: !209, line: 594, type: !68)
!219 = !DILocalVariable(name: "first_word", scope: !208, file: !209, line: 595, type: !64)
!220 = !DILocalVariable(name: "option_text", scope: !208, file: !209, line: 596, type: !64)
!221 = !DILocalVariable(name: "s", scope: !222, file: !209, line: 608, type: !64)
!222 = distinct !DILexicalBlock(scope: !223, file: !209, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !209, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !208, file: !209, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !209, line: 609, type: !61)
!226 = !DILocalVariable(name: "anchor_len", scope: !208, file: !209, line: 620, type: !61)
!227 = !DILocalVariable(name: "desc_text", scope: !208, file: !209, line: 625, type: !64)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !209, line: 644, type: !64)
!229 = distinct !DILexicalBlock(scope: !208, file: !209, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !209, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !252, !254, !255, !256, !257, !258, !260, !264, !267, !269, !272, !275, !276, !277, !278, !279}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !55, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !77, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !77, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !77, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !77, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !77, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !77, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !77, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !77, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !77, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !77, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !77, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !253, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !55, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !55, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !80, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !60, size: 16, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !259, size: 8, offset: 1040)
!259 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !261, size: 8, offset: 1048)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 1)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !76, line: 153, baseType: !69)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !253, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !70, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !61, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !55, size: 32, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DILocalVariable(name: "__cnt", scope: !229, file: !209, line: 644, type: !61)
!284 = !DILocalVariable(name: "url_program", scope: !208, file: !209, line: 648, type: !64)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !209, line: 686, type: !64)
!286 = distinct !DILexicalBlock(scope: !208, file: !209, line: 686, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !209, line: 686, type: !231)
!288 = !DILocalVariable(name: "__cnt", scope: !286, file: !209, line: 686, type: !61)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "count_lines", scope: !2, file: !3, line: 180, type: !68, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 252, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 4352, elements: !303)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !296, line: 50, size: 256, elements: !297)
!296 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!297 = !{!298, !299, !300, !302}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !296, line: 52, baseType: !64, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !295, file: !296, line: 55, baseType: !55, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !296, line: 56, baseType: !301, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !295, file: !296, line: 57, baseType: !55, size: 32, offset: 192)
!303 = !{!304}
!304 = !DISubrange(count: 17)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "reopen_inaccessible_files", scope: !2, file: !3, line: 176, type: !68, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "follow_mode_map", scope: !2, file: !3, line: 113, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 64, elements: !174)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "follow_mode_string", scope: !2, file: !3, line: 108, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 192, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!315 = !{!316}
!316 = !DISubrange(count: 3)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "max_n_unchanged_stats_between_opens", scope: !2, file: !3, line: 213, type: !94, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 237, type: !68, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "pids_alloc", scope: !2, file: !3, line: 220, type: !133, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "pids", scope: !2, file: !3, line: 219, type: !325, isLocal: true, isDefinition: true)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !2, file: !3, line: 231, type: !68, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "line_end", scope: !2, file: !3, line: 199, type: !66, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "follow_mode", scope: !2, file: !3, line: 184, type: !14, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "nbpids", scope: !2, file: !3, line: 218, type: !55, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "first_file", scope: !336, file: !3, line: 462, type: !68, isLocal: true, isDefinition: true)
!336 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 460, type: !337, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !64}
!339 = !{!340}
!340 = !DILocalVariable(name: "prettyname", arg: 1, scope: !336, file: !3, line: 460, type: !64)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "whence_msgid", scope: !343, file: !3, line: 417, type: !353, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "xlseek", scope: !3, file: !3, line: 410, type: !344, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{!78, !55, !78, !55, !64}
!346 = !{!347, !348, !349, !350, !351, !352}
!347 = !DILocalVariable(name: "fd", arg: 1, scope: !343, file: !3, line: 410, type: !55)
!348 = !DILocalVariable(name: "offset", arg: 2, scope: !343, file: !3, line: 410, type: !78)
!349 = !DILocalVariable(name: "whence", arg: 3, scope: !343, file: !3, line: 410, type: !55)
!350 = !DILocalVariable(name: "prettyname", arg: 4, scope: !343, file: !3, line: 410, type: !64)
!351 = !DILocalVariable(name: "new_offset", scope: !343, file: !3, line: 412, type: !78)
!352 = !DILocalVariable(name: "joffset", scope: !343, file: !3, line: 422, type: !95)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !315)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "debugged", scope: !356, file: !3, line: 1178, type: !68, isLocal: true, isDefinition: true)
!356 = distinct !DISubprogram(name: "tail_forever", scope: !3, file: !3, line: 1174, type: !357, scopeLine: 1175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !101, !55, !139}
!359 = !{!360, !361, !362, !363, !364, !366, !367, !369, !372, !373, !374, !375, !378, !379, !380, !381}
!360 = !DILocalVariable(name: "f", arg: 1, scope: !356, file: !3, line: 1174, type: !101)
!361 = !DILocalVariable(name: "n_files", arg: 2, scope: !356, file: !3, line: 1174, type: !55)
!362 = !DILocalVariable(name: "sleep_interval", arg: 3, scope: !356, file: !3, line: 1174, type: !139)
!363 = !DILocalVariable(name: "last", scope: !356, file: !3, line: 1176, type: !55)
!364 = !DILocalVariable(name: "blocking", scope: !365, file: !3, line: 1183, type: !68)
!365 = distinct !DILexicalBlock(scope: !356, file: !3, line: 1181, column: 5)
!366 = !DILocalVariable(name: "any_input", scope: !365, file: !3, line: 1194, type: !68)
!367 = !DILocalVariable(name: "i", scope: !368, file: !3, line: 1196, type: !55)
!368 = distinct !DILexicalBlock(scope: !365, file: !3, line: 1196, column: 7)
!369 = !DILocalVariable(name: "stats", scope: !370, file: !3, line: 1198, type: !149)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 1197, column: 9)
!371 = distinct !DILexicalBlock(scope: !368, file: !3, line: 1196, column: 7)
!372 = !DILocalVariable(name: "fd", scope: !370, file: !3, line: 1203, type: !55)
!373 = !DILocalVariable(name: "prettyname", scope: !370, file: !3, line: 1210, type: !64)
!374 = !DILocalVariable(name: "mode", scope: !370, file: !3, line: 1211, type: !121)
!375 = !DILocalVariable(name: "old_flags", scope: !376, file: !3, line: 1215, type: !55)
!376 = distinct !DILexicalBlock(scope: !377, file: !3, line: 1214, column: 13)
!377 = distinct !DILexicalBlock(scope: !370, file: !3, line: 1213, column: 15)
!378 = !DILocalVariable(name: "new_flags", scope: !376, file: !3, line: 1216, type: !55)
!379 = !DILocalVariable(name: "read_unchanged", scope: !370, file: !3, line: 1236, type: !68)
!380 = !DILocalVariable(name: "bytes_to_read", scope: !370, file: !3, line: 1301, type: !94)
!381 = !DILocalVariable(name: "nr", scope: !370, file: !3, line: 1309, type: !94)
!382 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!383 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!384 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!385 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!386 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!387 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!388 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!389 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!390 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "Version", scope: !393, file: !394, line: 3, type: !64, isLocal: false, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !395, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!395 = !{!391}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !398, file: !399, line: 65, type: !403, isLocal: false, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !400, retainedTypes: !401, globals: !402, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!400 = !{!18}
!401 = !{!70, !64, !67}
!402 = !{!396}
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !404, line: 69, baseType: !405)
!404 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{null}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "file_name", scope: !410, file: !411, line: 45, type: !64, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!412 = !{!408, !413}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !410, file: !411, line: 55, type: !68, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !417, file: !418, line: 66, type: !405, isLocal: false, isDefinition: true)
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !419, globals: !420, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!419 = !{!70, !67}
!420 = !{!421, !446, !415, !448, !450}
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "old_file_name", scope: !423, file: !418, line: 304, type: !64, isLocal: true, isDefinition: true)
!423 = distinct !DISubprogram(name: "verror_at_line", scope: !418, file: !418, line: 298, type: !424, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !417, retainedNodes: !439)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !55, !55, !64, !6, !64, !426}
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !79, line: 52, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !428, line: 32, baseType: !429)
!428 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !430, baseType: !431)
!430 = !DIFile(filename: "lib/error.c", directory: "/src")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !432, size: 256, elements: !433)
!432 = !DINamespace(name: "std", scope: null)
!433 = !{!434, !435, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !431, file: !430, baseType: !70, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !431, file: !430, baseType: !70, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !431, file: !430, baseType: !70, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !431, file: !430, baseType: !55, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !431, file: !430, baseType: !55, size: 32, offset: 224)
!439 = !{!440, !441, !442, !443, !444, !445}
!440 = !DILocalVariable(name: "status", arg: 1, scope: !423, file: !418, line: 298, type: !55)
!441 = !DILocalVariable(name: "errnum", arg: 2, scope: !423, file: !418, line: 298, type: !55)
!442 = !DILocalVariable(name: "file_name", arg: 3, scope: !423, file: !418, line: 298, type: !64)
!443 = !DILocalVariable(name: "line_number", arg: 4, scope: !423, file: !418, line: 298, type: !6)
!444 = !DILocalVariable(name: "message", arg: 5, scope: !423, file: !418, line: 298, type: !64)
!445 = !DILocalVariable(name: "args", arg: 6, scope: !423, file: !418, line: 298, type: !426)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "old_line_number", scope: !423, file: !418, line: 305, type: !6, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "error_message_count", scope: !417, file: !418, line: 69, type: !6, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !417, file: !418, line: 295, type: !55, isLocal: false, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !454, file: !455, line: 506, type: !55, isLocal: true, isDefinition: true)
!454 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !455, file: !455, line: 485, type: !456, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !458, retainedNodes: !460)
!455 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!456 = !DISubroutineType(types: !457)
!457 = !{!55, !55, !55}
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !459, splitDebugInlining: false, nameTableKind: None)
!459 = !{!452}
!460 = !{!461, !462, !463, !464, !467}
!461 = !DILocalVariable(name: "fd", arg: 1, scope: !454, file: !455, line: 485, type: !55)
!462 = !DILocalVariable(name: "target", arg: 2, scope: !454, file: !455, line: 485, type: !55)
!463 = !DILocalVariable(name: "result", scope: !454, file: !455, line: 487, type: !55)
!464 = !DILocalVariable(name: "flags", scope: !465, file: !455, line: 530, type: !55)
!465 = distinct !DILexicalBlock(scope: !466, file: !455, line: 529, column: 5)
!466 = distinct !DILexicalBlock(scope: !454, file: !455, line: 528, column: 7)
!467 = !DILocalVariable(name: "saved_errno", scope: !468, file: !455, line: 533, type: !55)
!468 = distinct !DILexicalBlock(scope: !469, file: !455, line: 532, column: 9)
!469 = distinct !DILexicalBlock(scope: !465, file: !455, line: 531, column: 11)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "default_tuning", scope: !472, file: !473, line: 134, type: !477, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !474, globals: !476, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!474 = !{!63, !70, !475, !61}
!475 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!476 = !{!470}
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !192, line: 52, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !192, line: 40, size: 160, elements: !480)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !479, file: !192, line: 45, baseType: !475, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !479, file: !192, line: 46, baseType: !475, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !479, file: !192, line: 47, baseType: !475, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !479, file: !192, line: 48, baseType: !475, size: 32, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !479, file: !192, line: 49, baseType: !68, size: 8, offset: 128)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "program_name", scope: !488, file: !489, line: 31, type: !64, isLocal: false, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C99, file: !489, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, globals: !491, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!490 = !{!77}
!491 = !{!486}
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "utf07FF", scope: !494, file: !495, line: 46, type: !525, isLocal: true, isDefinition: true)
!494 = distinct !DISubprogram(name: "proper_name_lite", scope: !495, file: !495, line: 38, type: !496, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !498, retainedNodes: !500)
!495 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!496 = !DISubroutineType(types: !497)
!497 = !{!64, !64, !64}
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !499, splitDebugInlining: false, nameTableKind: None)
!499 = !{!492}
!500 = !{!501, !502, !503, !504, !509}
!501 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !494, file: !495, line: 38, type: !64)
!502 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !494, file: !495, line: 38, type: !64)
!503 = !DILocalVariable(name: "translation", scope: !494, file: !495, line: 40, type: !64)
!504 = !DILocalVariable(name: "w", scope: !494, file: !495, line: 47, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !506, line: 37, baseType: !507)
!506 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !76, line: 57, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !76, line: 42, baseType: !6)
!509 = !DILocalVariable(name: "mbs", scope: !494, file: !495, line: 48, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !512)
!511 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !514)
!513 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !514, file: !513, line: 15, baseType: !55, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !514, file: !513, line: 20, baseType: !518, size: 32, offset: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !513, line: 16, size: 32, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !518, file: !513, line: 18, baseType: !6, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !518, file: !513, line: 19, baseType: !522, size: 32)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 4)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 16, elements: !174)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !528, file: !529, line: 76, type: !597, isLocal: false, isDefinition: true)
!528 = distinct !DICompileUnit(language: DW_LANG_C99, file: !529, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !530, retainedTypes: !536, globals: !537, splitDebugInlining: false, nameTableKind: None)
!529 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!530 = !{!18, !531, !32}
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !19, line: 254, baseType: !6, size: 32, elements: !532)
!532 = !{!533, !534, !535}
!533 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!534 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!535 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!536 = !{!55, !60, !61}
!537 = !{!526, !538, !544, !556, !558, !563, !586, !593, !595}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !528, file: !529, line: 92, type: !540, isLocal: false, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 320, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!542 = !{!543}
!543 = !DISubrange(count: 10)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !528, file: !529, line: 1040, type: !546, isLocal: false, isDefinition: true)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !529, line: 56, size: 448, elements: !547)
!547 = !{!548, !549, !550, !554, !555}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !546, file: !529, line: 59, baseType: !18, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !529, line: 62, baseType: !55, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !546, file: !529, line: 66, baseType: !551, size: 256, offset: 64)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 8)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !546, file: !529, line: 69, baseType: !64, size: 64, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !546, file: !529, line: 72, baseType: !64, size: 64, offset: 384)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !528, file: !529, line: 107, type: !546, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "slot0", scope: !528, file: !529, line: 831, type: !560, isLocal: true, isDefinition: true)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 256)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quote", scope: !565, file: !529, line: 228, type: !584, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "gettext_quote", scope: !529, file: !529, line: 197, type: !566, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !528, retainedNodes: !568)
!566 = !DISubroutineType(types: !567)
!567 = !{!64, !64, !18}
!568 = !{!569, !570, !571, !572, !573}
!569 = !DILocalVariable(name: "msgid", arg: 1, scope: !565, file: !529, line: 197, type: !64)
!570 = !DILocalVariable(name: "s", arg: 2, scope: !565, file: !529, line: 197, type: !18)
!571 = !DILocalVariable(name: "translation", scope: !565, file: !529, line: 199, type: !64)
!572 = !DILocalVariable(name: "w", scope: !565, file: !529, line: 229, type: !505)
!573 = !DILocalVariable(name: "mbs", scope: !565, file: !529, line: 230, type: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !576, file: !513, line: 15, baseType: !55, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !576, file: !513, line: 20, baseType: !580, size: 32, offset: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !576, file: !513, line: 16, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !580, file: !513, line: 18, baseType: !6, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !580, file: !513, line: 19, baseType: !522, size: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !585)
!585 = !{!175, !524}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "slotvec", scope: !528, file: !529, line: 834, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !529, line: 823, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !529, line: 825, baseType: !61, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !589, file: !529, line: 826, baseType: !77, size: 64, offset: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "nslots", scope: !528, file: !529, line: 832, type: !55, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "slotvec0", scope: !528, file: !529, line: 833, type: !589, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 704, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 11)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !602, file: !603, line: 26, type: !605, isLocal: false, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !604, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!604 = !{!600}
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 376, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 47)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "exit_failure", scope: !610, file: !611, line: 24, type: !613, isLocal: false, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !612, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!612 = !{!608}
!613 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !55)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !616, file: !617, line: 58, type: !642, isLocal: true, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !618, globals: !641, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!618 = !{!77, !619}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !620, line: 24, baseType: !621)
!620 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !622, line: 41, baseType: !623)
!622 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !622, line: 27, size: 1856, elements: !625)
!625 = !{!626, !632, !635, !638, !639}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !624, file: !622, line: 30, baseType: !627, size: 832)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 832, elements: !630)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !622, line: 30, flags: DIFlagFwdDecl)
!630 = !{!631}
!631 = !DISubrange(count: 13)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !624, file: !622, line: 33, baseType: !633, size: 64, offset: 832)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !624, file: !622, line: 34, baseType: !636, size: 64, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !624, file: !622, line: 35, baseType: !636, size: 64, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !624, file: !622, line: 38, baseType: !640, size: 832, offset: 1024)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 832, elements: !630)
!641 = !{!614}
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !619)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "internal_state", scope: !645, file: !646, line: 97, type: !649, isLocal: true, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !647, globals: !648, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!647 = !{!70, !61, !67}
!648 = !{!643}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !511, line: 6, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !513, line: 21, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 13, size: 64, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !651, file: !513, line: 15, baseType: !55, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !651, file: !513, line: 20, baseType: !655, size: 32, offset: 32)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !651, file: !513, line: 16, size: 32, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !655, file: !513, line: 18, baseType: !6, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !655, file: !513, line: 19, baseType: !522, size: 32)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !661, file: !662, line: 211, type: !846, isLocal: true, isDefinition: true)
!661 = distinct !DISubprogram(name: "printf_fetchargs", scope: !662, file: !662, line: 42, type: !663, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !837, retainedNodes: !841)
!662 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!663 = !DISubroutineType(types: !664)
!664 = !{!55, !665, !675}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !428, line: 14, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !667, baseType: !668)
!667 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !432, size: 256, elements: !669)
!669 = !{!670, !671, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !668, file: !667, baseType: !70, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !668, file: !667, baseType: !70, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !668, file: !667, baseType: !70, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !668, file: !667, baseType: !55, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !668, file: !667, baseType: !55, size: 32, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !677, line: 185, baseType: !678)
!677 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 179, size: 1920, elements: !679)
!679 = !{!680, !681, !833}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !678, file: !677, line: 181, baseType: !61, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !678, file: !677, line: 182, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !677, line: 174, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 111, size: 256, elements: !685)
!685 = !{!686, !737}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !677, line: 113, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !677, line: 108, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !677, line: 47, baseType: !6, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!690 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!691 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!692 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!693 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!694 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!695 = !DIEnumerator(name: "TYPE_INT", value: 5)
!696 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!697 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!698 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!699 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!700 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!701 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!702 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!703 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!704 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!705 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!706 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!707 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!708 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!709 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!710 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!711 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!712 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!713 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!714 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!715 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!716 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!717 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!718 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!719 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!720 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!721 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!722 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!723 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!724 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!725 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!726 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!727 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!728 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!729 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!730 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!731 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!732 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!733 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!734 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!735 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!736 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !684, file: !677, line: 172, baseType: !738, size: 128, offset: 128)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !684, file: !677, line: 114, size: 128, elements: !739)
!739 = !{!740, !741, !742, !744, !745, !746, !747, !748, !749, !751, !753, !757, !761, !764, !767, !770, !772, !775, !778, !780, !782, !784, !786, !788, !790, !792, !794, !795, !796, !798, !799, !802, !803, !807, !808, !810, !812, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !738, file: !677, line: 116, baseType: !259, size: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !738, file: !677, line: 117, baseType: !67, size: 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !738, file: !677, line: 118, baseType: !743, size: 16)
!743 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !738, file: !677, line: 119, baseType: !60, size: 16)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !738, file: !677, line: 120, baseType: !55, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !738, file: !677, line: 121, baseType: !6, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !738, file: !677, line: 122, baseType: !69, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !738, file: !677, line: 123, baseType: !63, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !738, file: !677, line: 124, baseType: !750, size: 64)
!750 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !738, file: !677, line: 125, baseType: !752, size: 64)
!752 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !738, file: !677, line: 126, baseType: !754, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !755, line: 24, baseType: !756)
!755 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !76, line: 37, baseType: !259)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !738, file: !677, line: 127, baseType: !758, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !759, line: 24, baseType: !760)
!759 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !76, line: 38, baseType: !67)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !738, file: !677, line: 128, baseType: !762, size: 16)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !755, line: 25, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !76, line: 39, baseType: !743)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !738, file: !677, line: 129, baseType: !765, size: 16)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !759, line: 25, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !76, line: 40, baseType: !60)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !738, file: !677, line: 130, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !755, line: 26, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !76, line: 41, baseType: !55)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !738, file: !677, line: 131, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !759, line: 26, baseType: !508)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !738, file: !677, line: 132, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !755, line: 27, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !76, line: 44, baseType: !69)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !738, file: !677, line: 133, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !759, line: 27, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !76, line: 45, baseType: !63)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !738, file: !677, line: 134, baseType: !779, size: 8)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !96, line: 58, baseType: !259)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !738, file: !677, line: 135, baseType: !781, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !96, line: 71, baseType: !67)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !738, file: !677, line: 136, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !96, line: 60, baseType: !69)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !738, file: !677, line: 137, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !96, line: 73, baseType: !63)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !738, file: !677, line: 138, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !96, line: 61, baseType: !69)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !738, file: !677, line: 139, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !96, line: 74, baseType: !63)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !738, file: !677, line: 140, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !96, line: 62, baseType: !69)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !738, file: !677, line: 141, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !96, line: 75, baseType: !63)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !738, file: !677, line: 142, baseType: !475, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !738, file: !677, line: 143, baseType: !139, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !738, file: !677, line: 144, baseType: !797, size: 128)
!797 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !738, file: !677, line: 145, baseType: !55, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !738, file: !677, line: 147, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !801, line: 20, baseType: !6)
!801 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!802 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !738, file: !677, line: 149, baseType: !64, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !738, file: !677, line: 150, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !62, line: 74, baseType: !6)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !738, file: !677, line: 151, baseType: !70, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !738, file: !677, line: 152, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !738, file: !677, line: 153, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !738, file: !677, line: 154, baseType: !301, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !738, file: !677, line: 155, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !738, file: !677, line: 156, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !738, file: !677, line: 157, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !738, file: !677, line: 158, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !738, file: !677, line: 159, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !738, file: !677, line: 160, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !738, file: !677, line: 161, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !738, file: !677, line: 162, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !738, file: !677, line: 163, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !738, file: !677, line: 164, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !678, file: !677, line: 183, baseType: !834, size: 1792, offset: 128)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 1792, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 7)
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !839, globals: !840, splitDebugInlining: false, nameTableKind: None)
!838 = !{!688}
!839 = !{!70}
!840 = !{!659}
!841 = !{!842, !843, !844, !845}
!842 = !DILocalVariable(name: "args", arg: 1, scope: !661, file: !662, line: 42, type: !665)
!843 = !DILocalVariable(name: "a", arg: 2, scope: !661, file: !662, line: 42, type: !675)
!844 = !DILocalVariable(name: "i", scope: !661, file: !662, line: 44, type: !61)
!845 = !DILocalVariable(name: "ap", scope: !661, file: !662, line: 45, type: !682)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 224, elements: !835)
!847 = distinct !DICompileUnit(language: DW_LANG_C99, file: !848, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "src/iopoll.c", directory: "/src", checksumkind: CSK_MD5, checksum: "994e71aa1d7ebbae5028422474ffd3c4")
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "lib/dirname-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12591251654a6c6fd0490c627594f543")
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/open-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84efcad54206a8ffedf254f32134ee9c")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !862, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/isapipe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5445de1f00883805631d924b7433dad7")
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!866 = !DIFile(filename: "lib/posixver.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b586c85144b881c520e7e1ef1553b215")
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "lib/fd-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "12c3310fb811f6ed0e0fb7e99c1b995b")
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !871, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!871 = !{!872}
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !870, line: 40, baseType: !6, size: 32, elements: !873)
!873 = !{!874}
!874 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !877, retainedTypes: !905, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!877 = !{!878, !890}
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !879, file: !876, line: 188, baseType: !6, size: 32, elements: !888)
!879 = distinct !DISubprogram(name: "x2nrealloc", scope: !876, file: !876, line: 176, type: !880, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !875, retainedNodes: !883)
!880 = !DISubroutineType(types: !881)
!881 = !{!70, !70, !882, !61}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!883 = !{!884, !885, !886, !887}
!884 = !DILocalVariable(name: "p", arg: 1, scope: !879, file: !876, line: 176, type: !70)
!885 = !DILocalVariable(name: "pn", arg: 2, scope: !879, file: !876, line: 176, type: !882)
!886 = !DILocalVariable(name: "s", arg: 3, scope: !879, file: !876, line: 176, type: !61)
!887 = !DILocalVariable(name: "n", scope: !879, file: !876, line: 178, type: !61)
!888 = !{!889}
!889 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !891, file: !876, line: 228, baseType: !6, size: 32, elements: !888)
!891 = distinct !DISubprogram(name: "xpalloc", scope: !876, file: !876, line: 223, type: !892, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !875, retainedNodes: !895)
!892 = !DISubroutineType(types: !893)
!893 = !{!70, !70, !894, !133, !135, !133}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904}
!896 = !DILocalVariable(name: "pa", arg: 1, scope: !891, file: !876, line: 223, type: !70)
!897 = !DILocalVariable(name: "pn", arg: 2, scope: !891, file: !876, line: 223, type: !894)
!898 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !891, file: !876, line: 223, type: !133)
!899 = !DILocalVariable(name: "n_max", arg: 4, scope: !891, file: !876, line: 223, type: !135)
!900 = !DILocalVariable(name: "s", arg: 5, scope: !891, file: !876, line: 223, type: !133)
!901 = !DILocalVariable(name: "n0", scope: !891, file: !876, line: 230, type: !133)
!902 = !DILocalVariable(name: "n", scope: !891, file: !876, line: 237, type: !133)
!903 = !DILocalVariable(name: "nbytes", scope: !891, file: !876, line: 248, type: !133)
!904 = !DILocalVariable(name: "adjusted_nbytes", scope: !891, file: !876, line: 252, type: !133)
!905 = !{!77, !70, !68, !69, !63}
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !910, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!910 = !{!911, !47}
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !912, line: 30, baseType: !6, size: 32, elements: !913)
!912 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!915 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!916 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!917 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!918 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !910, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !923, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/xnanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b6a69034949aee1e9f05553e779b94d2")
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !925, line: 10, baseType: !111)
!925 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !928, retainedTypes: !929, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!928 = !{!911}
!929 = !{!68, !69, !63, !95}
!930 = distinct !DICompileUnit(language: DW_LANG_C99, file: !931, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !932, retainedTypes: !933, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!932 = !{!911, !32}
!933 = !{!55, !60, !77, !68, !63, !934}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !96, line: 102, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !76, line: 73, baseType: !63)
!936 = distinct !DICompileUnit(language: DW_LANG_C99, file: !937, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!937 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!938 = distinct !DICompileUnit(language: DW_LANG_C99, file: !939, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!940 = distinct !DICompileUnit(language: DW_LANG_C99, file: !941, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !942, retainedTypes: !923, splitDebugInlining: false, nameTableKind: None)
!941 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!942 = !{!943}
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !944, line: 44, baseType: !6, size: 32, elements: !945)
!944 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!945 = !{!946}
!946 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!947 = distinct !DICompileUnit(language: DW_LANG_C99, file: !948, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!950 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!952 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !955, splitDebugInlining: false, nameTableKind: None)
!954 = !DIFile(filename: "lib/nanosleep.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ea6d8d4443a961090653c9a262702e98")
!955 = !{!956}
!956 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 37, baseType: !6, size: 32, elements: !957)
!957 = !{!958}
!958 = !DIEnumerator(name: "BILLION", value: 1000000000)
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !961, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!961 = !{!68, !63, !70}
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !963, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !966, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!966 = !{!77, !61, !70, !64, !6}
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!968 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!971 = distinct !DICompileUnit(language: DW_LANG_C99, file: !972, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!973 = distinct !DICompileUnit(language: DW_LANG_C99, file: !974, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!975 = !{!61, !976, !70, !1031}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !677, line: 174, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 111, size: 256, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !978, file: !677, line: 113, baseType: !687, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !978, file: !677, line: 172, baseType: !982, size: 128, offset: 128)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !677, line: 114, size: 128, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !982, file: !677, line: 116, baseType: !259, size: 8)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !982, file: !677, line: 117, baseType: !67, size: 8)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !982, file: !677, line: 118, baseType: !743, size: 16)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !982, file: !677, line: 119, baseType: !60, size: 16)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !982, file: !677, line: 120, baseType: !55, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !982, file: !677, line: 121, baseType: !6, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !982, file: !677, line: 122, baseType: !69, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !982, file: !677, line: 123, baseType: !63, size: 64)
