; ModuleID = 'src/timeout.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.numname = type { i32, [8 x i8] }
%struct.__locale_struct = type { [13 x %struct.__locale_data*], i16*, i32*, i32*, [13 x i8*] }
%struct.__locale_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon.8 }
%union.anon.8 = type { i32 }
%struct.sigaction = type { %union.anon, %struct.__sigset_t, i32, void ()* }
%union.anon = type { void (i32)* }
%struct.__sigset_t = type { [16 x i64] }
%struct.itimerspec = type { %struct.timespec, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct.sigevent = type { %union.sigval, i32, i32, %union.anon.9 }
%union.sigval = type { i8* }
%union.anon.9 = type { %struct.anon.10, [32 x i8] }
%struct.anon.10 = type { void (i64)*, %union.pthread_attr_t* }
%union.pthread_attr_t = type { i64, [56 x i8] }

!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37}
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 46, baseType: !42)
!41 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!42 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !{!47, !49, !55, !58, !61, !63, !65, !67, !0, !150, !152}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "timed_out", scope: !2, file: !3, line: 88, type: !37, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "monitored_pid", scope: !2, file: !3, line: 90, type: !51, isLocal: true, isDefinition: true)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !52, line: 97, baseType: !53)
!52 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !54, line: 154, baseType: !37)
!54 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "kill_after", scope: !2, file: !3, line: 91, type: !57, isLocal: true, isDefinition: true)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "foreground", scope: !2, file: !3, line: 92, type: !60, isLocal: true, isDefinition: true)
!60 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "preserve_status", scope: !2, file: !3, line: 93, type: !60, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "verbose", scope: !2, file: !3, line: 94, type: !60, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "command", scope: !2, file: !3, line: 95, type: !43, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !69, file: !6, line: 575, type: !37, isLocal: true, isDefinition: true)
!69 = distinct !DISubprogram(name: "oputs_", scope: !6, file: !6, line: 573, type: !70, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !72)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !43, !43}
!72 = !{!73, !74, !75, !78, !79, !80, !81, !85, !86, !87, !88, !90, !144, !145, !146, !148, !149}
!73 = !DILocalVariable(name: "program", arg: 1, scope: !69, file: !6, line: 573, type: !43)
!74 = !DILocalVariable(name: "option", arg: 2, scope: !69, file: !6, line: 573, type: !43)
!75 = !DILocalVariable(name: "term", scope: !76, file: !6, line: 585, type: !43)
!76 = distinct !DILexicalBlock(scope: !77, file: !6, line: 582, column: 5)
!77 = distinct !DILexicalBlock(scope: !69, file: !6, line: 581, column: 7)
!78 = !DILocalVariable(name: "double_space", scope: !69, file: !6, line: 594, type: !60)
!79 = !DILocalVariable(name: "first_word", scope: !69, file: !6, line: 595, type: !43)
!80 = !DILocalVariable(name: "option_text", scope: !69, file: !6, line: 596, type: !43)
!81 = !DILocalVariable(name: "s", scope: !82, file: !6, line: 608, type: !43)
!82 = distinct !DILexicalBlock(scope: !83, file: !6, line: 605, column: 5)
!83 = distinct !DILexicalBlock(scope: !84, file: !6, line: 604, column: 12)
!84 = distinct !DILexicalBlock(scope: !69, file: !6, line: 597, column: 7)
!85 = !DILocalVariable(name: "spaces", scope: !82, file: !6, line: 609, type: !40)
!86 = !DILocalVariable(name: "anchor_len", scope: !69, file: !6, line: 620, type: !40)
!87 = !DILocalVariable(name: "desc_text", scope: !69, file: !6, line: 625, type: !43)
!88 = !DILocalVariable(name: "__ptr", scope: !89, file: !6, line: 644, type: !43)
!89 = distinct !DILexicalBlock(scope: !69, file: !6, line: 644, column: 3)
!90 = !DILocalVariable(name: "__stream", scope: !89, file: !6, line: 644, type: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !93, line: 7, baseType: !94)
!93 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !95, line: 49, size: 1728, elements: !96)
!95 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !112, !114, !115, !116, !119, !120, !121, !125, !128, !130, !133, !136, !137, !138, !139, !140}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !94, file: !95, line: 51, baseType: !37, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !94, file: !95, line: 54, baseType: !29, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !94, file: !95, line: 55, baseType: !29, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !94, file: !95, line: 56, baseType: !29, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !94, file: !95, line: 57, baseType: !29, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !94, file: !95, line: 58, baseType: !29, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !94, file: !95, line: 59, baseType: !29, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !94, file: !95, line: 60, baseType: !29, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !94, file: !95, line: 61, baseType: !29, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !94, file: !95, line: 64, baseType: !29, size: 64, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !94, file: !95, line: 65, baseType: !29, size: 64, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !94, file: !95, line: 66, baseType: !29, size: 64, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !94, file: !95, line: 68, baseType: !110, size: 64, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !95, line: 36, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !94, file: !95, line: 70, baseType: !113, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !94, file: !95, line: 72, baseType: !37, size: 32, offset: 896)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !94, file: !95, line: 73, baseType: !37, size: 32, offset: 928)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !94, file: !95, line: 74, baseType: !117, size: 64, offset: 960)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !118)
!118 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !94, file: !95, line: 77, baseType: !39, size: 16, offset: 1024)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !94, file: !95, line: 78, baseType: !38, size: 8, offset: 1040)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !94, file: !95, line: 79, baseType: !122, size: 8, offset: 1048)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !94, file: !95, line: 81, baseType: !126, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !95, line: 43, baseType: null)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !94, file: !95, line: 89, baseType: !129, size: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !118)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !94, file: !95, line: 91, baseType: !131, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !95, line: 37, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !94, file: !95, line: 92, baseType: !134, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !95, line: 38, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !94, file: !95, line: 93, baseType: !113, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !94, file: !95, line: 94, baseType: !31, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !94, file: !95, line: 95, baseType: !40, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !94, file: !95, line: 96, baseType: !37, size: 32, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !94, file: !95, line: 98, baseType: !141, size: 160, offset: 1568)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 20)
!144 = !DILocalVariable(name: "__cnt", scope: !89, file: !6, line: 644, type: !40)
!145 = !DILocalVariable(name: "url_program", scope: !69, file: !6, line: 648, type: !43)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !6, line: 686, type: !43)
!147 = distinct !DILexicalBlock(scope: !69, file: !6, line: 686, column: 3)
!148 = !DILocalVariable(name: "__stream", scope: !147, file: !6, line: 686, type: !91)
!149 = !DILocalVariable(name: "__cnt", scope: !147, file: !6, line: 686, type: !40)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "term_signal", scope: !2, file: !3, line: 89, type: !37, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "term_sig", scope: !2, file: !154, line: 6, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "src/term-sig.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d5de988e1d621d74adbec0ff67a5bdb7")
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 704, elements: !157)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!157 = !{!158}
!158 = !DISubrange(count: 22)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 2048, elements: !169)
!160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !162, line: 50, size: 256, elements: !163)
!162 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!163 = !{!164, !165, !166, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !162, line: 52, baseType: !43, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !161, file: !162, line: 55, baseType: !37, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !161, file: !162, line: 56, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !161, file: !162, line: 57, baseType: !37, size: 32, offset: 192)
!169 = !{!170}
!170 = !DISubrange(count: 8)
!171 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!172 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!173 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!174 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "Version", scope: !177, file: !178, line: 3, type: !43, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !179, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!179 = !{!175}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "file_name", scope: !182, file: !183, line: 45, type: !43, isLocal: true, isDefinition: true)
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !184, splitDebugInlining: false, nameTableKind: None)
!183 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!184 = !{!180, !185}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !182, file: !183, line: 55, type: !60, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !189, file: !190, line: 66, type: !225, isLocal: false, isDefinition: true)
!189 = distinct !DICompileUnit(language: DW_LANG_C99, file: !190, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !191, globals: !192, splitDebugInlining: false, nameTableKind: None)
!190 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!191 = !{!31, !45}
!192 = !{!193, !219, !187, !221, !223}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "old_file_name", scope: !195, file: !190, line: 304, type: !43, isLocal: true, isDefinition: true)
!195 = distinct !DISubprogram(name: "verror_at_line", scope: !190, file: !190, line: 298, type: !196, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !189, retainedNodes: !212)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !37, !37, !43, !7, !43, !198}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !199, line: 52, baseType: !200)
!199 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !201, line: 32, baseType: !202)
!201 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !203, baseType: !204)
!203 = !DIFile(filename: "lib/error.c", directory: "/src")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !205, size: 256, elements: !206)
!205 = !DINamespace(name: "std", scope: null)
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !204, file: !203, baseType: !31, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !204, file: !203, baseType: !31, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !204, file: !203, baseType: !31, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !204, file: !203, baseType: !37, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !204, file: !203, baseType: !37, size: 32, offset: 224)
!212 = !{!213, !214, !215, !216, !217, !218}
!213 = !DILocalVariable(name: "status", arg: 1, scope: !195, file: !190, line: 298, type: !37)
!214 = !DILocalVariable(name: "errnum", arg: 2, scope: !195, file: !190, line: 298, type: !37)
!215 = !DILocalVariable(name: "file_name", arg: 3, scope: !195, file: !190, line: 298, type: !43)
!216 = !DILocalVariable(name: "line_number", arg: 4, scope: !195, file: !190, line: 298, type: !7)
!217 = !DILocalVariable(name: "message", arg: 5, scope: !195, file: !190, line: 298, type: !43)
!218 = !DILocalVariable(name: "args", arg: 6, scope: !195, file: !190, line: 298, type: !198)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "old_line_number", scope: !195, file: !190, line: 305, type: !7, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "error_message_count", scope: !189, file: !190, line: 69, type: !7, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !189, file: !190, line: 295, type: !37, isLocal: false, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "program_name", scope: !230, file: !231, line: 31, type: !43, isLocal: false, isDefinition: true)
!230 = distinct !DICompileUnit(language: DW_LANG_C99, file: !231, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !232, globals: !233, splitDebugInlining: false, nameTableKind: None)
!231 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!232 = !{!29}
!233 = !{!228}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "utf07FF", scope: !236, file: !237, line: 46, type: !267, isLocal: true, isDefinition: true)
!236 = distinct !DISubprogram(name: "proper_name_lite", scope: !237, file: !237, line: 38, type: !238, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !240, retainedNodes: !242)
!237 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!238 = !DISubroutineType(types: !239)
!239 = !{!43, !43, !43}
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !241, splitDebugInlining: false, nameTableKind: None)
!241 = !{!234}
!242 = !{!243, !244, !245, !246, !251}
!243 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !236, file: !237, line: 38, type: !43)
!244 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !236, file: !237, line: 38, type: !43)
!245 = !DILocalVariable(name: "translation", scope: !236, file: !237, line: 40, type: !43)
!246 = !DILocalVariable(name: "w", scope: !236, file: !237, line: 47, type: !247)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !248, line: 37, baseType: !249)
!248 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !54, line: 57, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !54, line: 42, baseType: !7)
!251 = !DILocalVariable(name: "mbs", scope: !236, file: !237, line: 48, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !254)
!253 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !256)
!255 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !256, file: !255, line: 15, baseType: !37, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !256, file: !255, line: 20, baseType: !260, size: 32, offset: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !256, file: !255, line: 16, size: 32, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !260, file: !255, line: 18, baseType: !7, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !260, file: !255, line: 19, baseType: !264, size: 32)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 4)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 16, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !272, file: !273, line: 76, type: !353, isLocal: false, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !274, retainedTypes: !294, globals: !295, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!274 = !{!275, !289, !13}
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !276, line: 42, baseType: !7, size: 32, elements: !277)
!276 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!278 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!279 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!280 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!281 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!282 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!283 = !DIEnumerator(name: "c_quoting_style", value: 5)
!284 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!285 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!286 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!287 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!288 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !276, line: 254, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!292 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!293 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!294 = !{!37, !39, !40}
!295 = !{!270, !296, !302, !312, !314, !319, !342, !349, !351}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !272, file: !273, line: 92, type: !298, isLocal: false, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !300)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!300 = !{!301}
!301 = !DISubrange(count: 10)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !272, file: !273, line: 1040, type: !304, isLocal: false, isDefinition: true)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !273, line: 56, size: 448, elements: !305)
!305 = !{!306, !307, !308, !310, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !304, file: !273, line: 59, baseType: !275, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !273, line: 62, baseType: !37, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !304, file: !273, line: 66, baseType: !309, size: 256, offset: 64)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !169)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !304, file: !273, line: 69, baseType: !43, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !304, file: !273, line: 72, baseType: !43, size: 64, offset: 384)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !272, file: !273, line: 107, type: !304, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "slot0", scope: !272, file: !273, line: 831, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2048, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 256)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "quote", scope: !321, file: !273, line: 228, type: !340, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "gettext_quote", scope: !273, file: !273, line: 197, type: !322, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!43, !43, !275}
!324 = !{!325, !326, !327, !328, !329}
!325 = !DILocalVariable(name: "msgid", arg: 1, scope: !321, file: !273, line: 197, type: !43)
!326 = !DILocalVariable(name: "s", arg: 2, scope: !321, file: !273, line: 197, type: !275)
!327 = !DILocalVariable(name: "translation", scope: !321, file: !273, line: 199, type: !43)
!328 = !DILocalVariable(name: "w", scope: !321, file: !273, line: 229, type: !247)
!329 = !DILocalVariable(name: "mbs", scope: !321, file: !273, line: 230, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !332, file: !255, line: 15, baseType: !37, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !332, file: !255, line: 20, baseType: !336, size: 32, offset: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !255, line: 16, size: 32, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !336, file: !255, line: 18, baseType: !7, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !336, file: !255, line: 19, baseType: !264, size: 32)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !341)
!341 = !{!269, !266}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "slotvec", scope: !272, file: !273, line: 834, type: !344, isLocal: true, isDefinition: true)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !273, line: 823, size: 128, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !273, line: 825, baseType: !40, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !345, file: !273, line: 826, baseType: !29, size: 64, offset: 64)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "nslots", scope: !272, file: !273, line: 832, type: !37, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "slotvec0", scope: !272, file: !273, line: 833, type: !345, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 704, elements: !355)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!355 = !{!356}
!356 = !DISubrange(count: 11)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "numname_table", scope: !359, file: !360, line: 43, type: !363, isLocal: true, isDefinition: true)
!359 = distinct !DICompileUnit(language: DW_LANG_C99, file: !360, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, globals: !362, splitDebugInlining: false, nameTableKind: None)
!360 = !DIFile(filename: "lib/sig2str.c", directory: "/src", checksumkind: CSK_MD5, checksum: "828136ef7ede39101f7053cda7cea598")
!361 = !{!7}
!362 = !{!357}
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 3360, elements: !369)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numname", file: !360, line: 43, size: 96, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !364, file: !360, line: 43, baseType: !37, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !360, line: 43, baseType: !368, size: 64, offset: 32)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !169)
!369 = !{!370}
!370 = !DISubrange(count: 35)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !373, file: !374, line: 26, type: !376, isLocal: false, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !375, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!375 = !{!371}
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 376, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 47)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "exit_failure", scope: !381, file: !382, line: 24, type: !384, isLocal: false, isDefinition: true)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !383, splitDebugInlining: false, nameTableKind: None)
!382 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!383 = !{!379}
!384 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !37)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !387, file: !388, line: 58, type: !412, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !389, globals: !411, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!389 = !{!29, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !391, line: 24, baseType: !392)
!391 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !393, line: 41, baseType: !394)
!393 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !393, line: 27, size: 1856, elements: !396)
!396 = !{!397, !403, !406, !408, !409}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !395, file: !393, line: 30, baseType: !398, size: 832)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 832, elements: !401)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !393, line: 30, flags: DIFlagFwdDecl)
!401 = !{!402}
!402 = !DISubrange(count: 13)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !395, file: !393, line: 33, baseType: !404, size: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !395, file: !393, line: 34, baseType: !407, size: 64, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !395, file: !393, line: 35, baseType: !407, size: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !395, file: !393, line: 38, baseType: !410, size: 832, offset: 1024)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 832, elements: !401)
!411 = !{!385}
!412 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !390)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "internal_state", scope: !415, file: !416, line: 97, type: !419, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !417, globals: !418, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!417 = !{!31, !40, !45}
!418 = !{!413}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !253, line: 6, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !255, line: 21, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 13, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !421, file: !255, line: 15, baseType: !37, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !421, file: !255, line: 20, baseType: !425, size: 32, offset: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !255, line: 16, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !425, file: !255, line: 18, baseType: !7, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !425, file: !255, line: 19, baseType: !264, size: 32)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!430 = !DIFile(filename: "src/operand2sig.c", directory: "/src", checksumkind: CSK_MD5, checksum: "46beb430284fcb3f5c7434dd479a51b3")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/cl-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a67239aa557b1854772fcd1589240f00")
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !435, retainedTypes: !440, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "lib/dtotimespec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "863541a7a9cbed8b745823733251add6")
!435 = !{!436}
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 44, baseType: !7, size: 32, elements: !438)
!437 = !DIFile(filename: "./lib/timespec.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2321879fdee55a014e00353b7423449")
!438 = !{!439}
!439 = !DIEnumerator(name: "TIMESPEC_HZ", value: 1000000000)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !442, line: 10, baseType: !443)
!442 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !54, line: 160, baseType: !118)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !448, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!448 = !{!449}
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 40, baseType: !7, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!452 = !{!31}
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !455, retainedTypes: !486, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!455 = !{!456, !468}
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !457, file: !454, line: 188, baseType: !7, size: 32, elements: !466)
!457 = distinct !DISubprogram(name: "x2nrealloc", scope: !454, file: !454, line: 176, type: !458, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !453, retainedNodes: !461)
!458 = !DISubroutineType(types: !459)
!459 = !{!31, !31, !460, !40}
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!461 = !{!462, !463, !464, !465}
!462 = !DILocalVariable(name: "p", arg: 1, scope: !457, file: !454, line: 176, type: !31)
!463 = !DILocalVariable(name: "pn", arg: 2, scope: !457, file: !454, line: 176, type: !460)
!464 = !DILocalVariable(name: "s", arg: 3, scope: !457, file: !454, line: 176, type: !40)
!465 = !DILocalVariable(name: "n", scope: !457, file: !454, line: 178, type: !40)
!466 = !{!467}
!467 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !469, file: !454, line: 228, baseType: !7, size: 32, elements: !466)
!469 = distinct !DISubprogram(name: "xpalloc", scope: !454, file: !454, line: 223, type: !470, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !453, retainedNodes: !476)
!470 = !DISubroutineType(types: !471)
!471 = !{!31, !31, !472, !473, !475, !473}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !474, line: 130, baseType: !475)
!474 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !41, line: 35, baseType: !118)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485}
!477 = !DILocalVariable(name: "pa", arg: 1, scope: !469, file: !454, line: 223, type: !31)
!478 = !DILocalVariable(name: "pn", arg: 2, scope: !469, file: !454, line: 223, type: !472)
!479 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !469, file: !454, line: 223, type: !473)
!480 = !DILocalVariable(name: "n_max", arg: 4, scope: !469, file: !454, line: 223, type: !475)
!481 = !DILocalVariable(name: "s", arg: 5, scope: !469, file: !454, line: 223, type: !473)
!482 = !DILocalVariable(name: "n0", scope: !469, file: !454, line: 230, type: !473)
!483 = !DILocalVariable(name: "n", scope: !469, file: !454, line: 237, type: !473)
!484 = !DILocalVariable(name: "nbytes", scope: !469, file: !454, line: 248, type: !473)
!485 = !DILocalVariable(name: "adjusted_nbytes", scope: !469, file: !454, line: 252, type: !473)
!486 = !{!29, !31, !60, !118, !42}
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !490, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!490 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !499, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!499 = !{!60, !42, !31}
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !452, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!506 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!507 = !{i32 7, !"Dwarf Version", i32 5}
!508 = !{i32 2, !"Debug Info Version", i32 3}
!509 = !{i32 1, !"wchar_size", i32 4}
!510 = !{i32 1, !"branch-target-enforcement", i32 0}
!511 = !{i32 1, !"sign-return-address", i32 0}
!512 = !{i32 1, !"sign-return-address-all", i32 0}
!513 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!514 = !{i32 7, !"PIC Level", i32 2}
!515 = !{i32 7, !"PIE Level", i32 2}
!516 = !{i32 7, !"uwtable", i32 1}
!517 = !{i32 7, !"frame-pointer", i32 1}
!518 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 264, type: !35, scopeLine: 265, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !519)
!519 = !{!520}
!520 = !DILocalVariable(name: "status", arg: 1, scope: !518, file: !3, line: 264, type: !37)
!521 = !DILocation(line: 0, scope: !518)
!522 = !DILocation(line: 266, column: 14, scope: !523)
!523 = distinct !DILexicalBlock(scope: !518, file: !3, line: 266, column: 7)
!524 = !DILocation(line: 266, column: 7, scope: !518)
!525 = !DILocation(line: 267, column: 5, scope: !526)
!526 = distinct !DILexicalBlock(scope: !523, file: !3, line: 267, column: 5)
!527 = !{!528, !528, i64 0}
!528 = !{!"any pointer", !529, i64 0}
!529 = !{!"omnipotent char", !530, i64 0}
!530 = !{!"Simple C/C++ TBAA"}
!531 = !DILocation(line: 270, column: 7, scope: !532)
!532 = distinct !DILexicalBlock(scope: !523, file: !3, line: 269, column: 5)
!533 = !DILocation(line: 273, column: 7, scope: !532)
!534 = !DILocation(line: 736, column: 3, scope: !535, inlinedAt: !537)
!535 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !6, file: !6, line: 734, type: !226, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!536 = !{}
!537 = distinct !DILocation(line: 277, column: 7, scope: !532)
!538 = !DILocation(line: 279, column: 7, scope: !532)
!539 = !DILocation(line: 285, column: 7, scope: !532)
!540 = !DILocation(line: 290, column: 7, scope: !532)
!541 = !DILocation(line: 295, column: 7, scope: !532)
!542 = !DILocation(line: 301, column: 7, scope: !532)
!543 = !DILocation(line: 306, column: 7, scope: !532)
!544 = !DILocation(line: 307, column: 7, scope: !532)
!545 = !DILocation(line: 309, column: 7, scope: !532)
!546 = !DILocation(line: 314, column: 7, scope: !532)
!547 = !DILocation(line: 320, column: 7, scope: !532)
!548 = !DILocalVariable(name: "program", arg: 1, scope: !549, file: !6, line: 836, type: !43)
!549 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !6, file: !6, line: 836, type: !550, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !43}
!552 = !{!548, !553, !562, !563, !565, !566}
!553 = !DILocalVariable(name: "infomap", scope: !549, file: !6, line: 838, type: !554)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 896, elements: !560)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !549, file: !6, line: 838, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !556, file: !6, line: 838, baseType: !43, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !556, file: !6, line: 838, baseType: !43, size: 64, offset: 64)
!560 = !{!561}
!561 = !DISubrange(count: 7)
!562 = !DILocalVariable(name: "node", scope: !549, file: !6, line: 848, type: !43)
!563 = !DILocalVariable(name: "map_prog", scope: !549, file: !6, line: 849, type: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!565 = !DILocalVariable(name: "lc_messages", scope: !549, file: !6, line: 861, type: !43)
!566 = !DILocalVariable(name: "url_program", scope: !549, file: !6, line: 874, type: !43)
!567 = !DILocation(line: 0, scope: !549, inlinedAt: !568)
!568 = distinct !DILocation(line: 330, column: 7, scope: !532)
!569 = !DILocation(line: 838, column: 3, scope: !549, inlinedAt: !568)
!570 = !DILocation(line: 838, column: 67, scope: !549, inlinedAt: !568)
!571 = !DILocation(line: 849, column: 36, scope: !549, inlinedAt: !568)
!572 = !DILocation(line: 851, column: 3, scope: !549, inlinedAt: !568)
!573 = !DILocalVariable(name: "__s1", arg: 1, scope: !574, file: !575, line: 1359, type: !43)
!574 = distinct !DISubprogram(name: "streq", scope: !575, file: !575, line: 1359, type: !576, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !578)
!575 = !DIFile(filename: "./lib/string.h", directory: "/src")
!576 = !DISubroutineType(types: !577)
!577 = !{!60, !43, !43}
!578 = !{!573, !579}
!579 = !DILocalVariable(name: "__s2", arg: 2, scope: !574, file: !575, line: 1359, type: !43)
!580 = !DILocation(line: 0, scope: !574, inlinedAt: !581)
!581 = distinct !DILocation(line: 851, column: 33, scope: !549, inlinedAt: !568)
!582 = !DILocation(line: 1361, column: 11, scope: !574, inlinedAt: !581)
!583 = !DILocation(line: 1361, column: 10, scope: !574, inlinedAt: !581)
!584 = !DILocation(line: 852, column: 13, scope: !549, inlinedAt: !568)
!585 = !DILocation(line: 851, column: 20, scope: !549, inlinedAt: !568)
!586 = !{!587, !528, i64 0}
!587 = !{!"infomap", !528, i64 0, !528, i64 8}
!588 = !DILocation(line: 851, column: 10, scope: !549, inlinedAt: !568)
!589 = !DILocation(line: 851, column: 28, scope: !549, inlinedAt: !568)
!590 = distinct !{!590, !572, !584, !591}
!591 = !{!"llvm.loop.mustprogress"}
!592 = !DILocation(line: 854, column: 17, scope: !593, inlinedAt: !568)
!593 = distinct !DILexicalBlock(scope: !549, file: !6, line: 854, column: 7)
!594 = !{!587, !528, i64 8}
!595 = !DILocation(line: 854, column: 7, scope: !593, inlinedAt: !568)
!596 = !DILocation(line: 854, column: 7, scope: !549, inlinedAt: !568)
!597 = !DILocation(line: 857, column: 3, scope: !549, inlinedAt: !568)
!598 = !DILocation(line: 861, column: 29, scope: !549, inlinedAt: !568)
!599 = !DILocation(line: 862, column: 7, scope: !600, inlinedAt: !568)
!600 = distinct !DILexicalBlock(scope: !549, file: !6, line: 862, column: 7)
!601 = !DILocation(line: 862, column: 19, scope: !600, inlinedAt: !568)
!602 = !DILocation(line: 862, column: 22, scope: !600, inlinedAt: !568)
!603 = !DILocation(line: 862, column: 7, scope: !549, inlinedAt: !568)
!604 = !DILocation(line: 868, column: 7, scope: !605, inlinedAt: !568)
!605 = distinct !DILexicalBlock(scope: !600, file: !6, line: 863, column: 5)
!606 = !DILocation(line: 870, column: 5, scope: !605, inlinedAt: !568)
!607 = !DILocation(line: 0, scope: !574, inlinedAt: !608)
!608 = distinct !DILocation(line: 874, column: 29, scope: !549, inlinedAt: !568)
!609 = !DILocation(line: 875, column: 3, scope: !549, inlinedAt: !568)
!610 = !DILocation(line: 877, column: 3, scope: !549, inlinedAt: !568)
!611 = !DILocation(line: 879, column: 1, scope: !549, inlinedAt: !568)
!612 = !DILocation(line: 332, column: 3, scope: !518)
!613 = !DISubprogram(name: "dcgettext", scope: !614, file: !614, line: 51, type: !615, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!614 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!615 = !DISubroutineType(types: !616)
!616 = !{!29, !43, !43, !37}
!617 = !DISubprogram(name: "fputs_unlocked", scope: !199, file: !199, line: 691, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!618 = !DISubroutineType(types: !619)
!619 = !{!37, !620, !621}
!620 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!621 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !91)
!622 = !DILocation(line: 0, scope: !69)
!623 = !DILocation(line: 581, column: 7, scope: !77)
!624 = !{!625, !625, i64 0}
!625 = !{!"int", !529, i64 0}
!626 = !DILocation(line: 581, column: 19, scope: !77)
!627 = !DILocation(line: 581, column: 7, scope: !69)
!628 = !DILocation(line: 585, column: 26, scope: !76)
!629 = !DILocation(line: 0, scope: !76)
!630 = !DILocation(line: 586, column: 23, scope: !76)
!631 = !DILocation(line: 586, column: 28, scope: !76)
!632 = !DILocation(line: 586, column: 32, scope: !76)
!633 = !{!529, !529, i64 0}
!634 = !DILocation(line: 586, column: 38, scope: !76)
!635 = !DILocation(line: 0, scope: !574, inlinedAt: !636)
!636 = distinct !DILocation(line: 586, column: 41, scope: !76)
!637 = !DILocation(line: 1361, column: 11, scope: !574, inlinedAt: !636)
!638 = !DILocation(line: 1361, column: 10, scope: !574, inlinedAt: !636)
!639 = !DILocation(line: 586, column: 19, scope: !76)
!640 = !DILocation(line: 587, column: 5, scope: !76)
!641 = !DILocation(line: 588, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !69, file: !6, line: 588, column: 7)
!643 = !DILocation(line: 588, column: 7, scope: !69)
!644 = !DILocation(line: 590, column: 7, scope: !645)
!645 = distinct !DILexicalBlock(scope: !642, file: !6, line: 589, column: 5)
!646 = !DILocation(line: 591, column: 7, scope: !645)
!647 = !DILocation(line: 595, column: 37, scope: !69)
!648 = !DILocation(line: 595, column: 35, scope: !69)
!649 = !DILocation(line: 596, column: 29, scope: !69)
!650 = !DILocation(line: 597, column: 8, scope: !84)
!651 = !DILocation(line: 597, column: 7, scope: !69)
!652 = !DILocation(line: 604, column: 24, scope: !83)
!653 = !DILocation(line: 604, column: 12, scope: !84)
!654 = !DILocation(line: 0, scope: !82)
!655 = !DILocation(line: 610, column: 16, scope: !82)
!656 = !DILocation(line: 610, column: 7, scope: !82)
!657 = !DILocation(line: 611, column: 21, scope: !82)
!658 = !{!659, !659, i64 0}
!659 = !{!"short", !529, i64 0}
!660 = !DILocation(line: 611, column: 19, scope: !82)
!661 = !DILocation(line: 611, column: 16, scope: !82)
!662 = !DILocation(line: 610, column: 30, scope: !82)
!663 = distinct !{!663, !656, !657, !591}
!664 = !DILocation(line: 612, column: 18, scope: !665)
!665 = distinct !DILexicalBlock(scope: !82, file: !6, line: 612, column: 11)
!666 = !DILocation(line: 612, column: 11, scope: !82)
!667 = !DILocation(line: 620, column: 23, scope: !69)
!668 = !DILocation(line: 625, column: 39, scope: !69)
!669 = !DILocation(line: 626, column: 3, scope: !69)
!670 = !DILocation(line: 626, column: 10, scope: !69)
!671 = !DILocation(line: 626, column: 21, scope: !69)
!672 = !DILocation(line: 628, column: 44, scope: !673)
!673 = distinct !DILexicalBlock(scope: !674, file: !6, line: 628, column: 11)
!674 = distinct !DILexicalBlock(scope: !69, file: !6, line: 627, column: 5)
!675 = !DILocation(line: 628, column: 32, scope: !673)
!676 = !DILocation(line: 628, column: 49, scope: !673)
!677 = !DILocation(line: 628, column: 11, scope: !674)
!678 = !DILocation(line: 630, column: 11, scope: !679)
!679 = distinct !DILexicalBlock(scope: !674, file: !6, line: 630, column: 11)
!680 = !DILocation(line: 630, column: 11, scope: !674)
!681 = !DILocation(line: 632, column: 26, scope: !682)
!682 = distinct !DILexicalBlock(scope: !683, file: !6, line: 632, column: 15)
!683 = distinct !DILexicalBlock(scope: !679, file: !6, line: 631, column: 9)
!684 = !DILocation(line: 632, column: 34, scope: !682)
!685 = !DILocation(line: 632, column: 37, scope: !682)
!686 = !DILocation(line: 632, column: 15, scope: !683)
!687 = !DILocation(line: 636, column: 29, scope: !688)
!688 = distinct !DILexicalBlock(scope: !683, file: !6, line: 636, column: 15)
!689 = !DILocation(line: 640, column: 16, scope: !674)
!690 = distinct !{!690, !669, !691, !591}
!691 = !DILocation(line: 641, column: 5, scope: !69)
!692 = !DILocation(line: 644, column: 3, scope: !69)
!693 = !DILocation(line: 0, scope: !574, inlinedAt: !694)
!694 = distinct !DILocation(line: 648, column: 31, scope: !69)
!695 = !DILocation(line: 0, scope: !574, inlinedAt: !696)
!696 = distinct !DILocation(line: 649, column: 31, scope: !69)
!697 = !DILocation(line: 0, scope: !574, inlinedAt: !698)
!698 = distinct !DILocation(line: 650, column: 31, scope: !69)
!699 = !DILocation(line: 0, scope: !574, inlinedAt: !700)
!700 = distinct !DILocation(line: 651, column: 31, scope: !69)
!701 = !DILocation(line: 0, scope: !574, inlinedAt: !702)
!702 = distinct !DILocation(line: 652, column: 31, scope: !69)
!703 = !DILocation(line: 0, scope: !574, inlinedAt: !704)
!704 = distinct !DILocation(line: 653, column: 31, scope: !69)
!705 = !DILocation(line: 0, scope: !574, inlinedAt: !706)
!706 = distinct !DILocation(line: 654, column: 31, scope: !69)
!707 = !DILocation(line: 0, scope: !574, inlinedAt: !708)
!708 = distinct !DILocation(line: 655, column: 31, scope: !69)
!709 = !DILocation(line: 0, scope: !574, inlinedAt: !710)
!710 = distinct !DILocation(line: 656, column: 31, scope: !69)
!711 = !DILocation(line: 0, scope: !574, inlinedAt: !712)
!712 = distinct !DILocation(line: 657, column: 31, scope: !69)
!713 = !DILocation(line: 663, column: 7, scope: !714)
!714 = distinct !DILexicalBlock(scope: !69, file: !6, line: 663, column: 7)
!715 = !DILocation(line: 664, column: 7, scope: !714)
!716 = !DILocation(line: 664, column: 10, scope: !714)
!717 = !DILocation(line: 663, column: 7, scope: !69)
!718 = !DILocation(line: 669, column: 7, scope: !719)
!719 = distinct !DILexicalBlock(scope: !714, file: !6, line: 665, column: 5)
!720 = !DILocation(line: 671, column: 5, scope: !719)
!721 = !DILocation(line: 676, column: 7, scope: !722)
!722 = distinct !DILexicalBlock(scope: !714, file: !6, line: 673, column: 5)
!723 = !DILocation(line: 679, column: 3, scope: !69)
!724 = !DILocation(line: 683, column: 3, scope: !69)
!725 = !DILocation(line: 686, column: 3, scope: !69)
!726 = !DILocation(line: 688, column: 3, scope: !69)
!727 = !DILocation(line: 691, column: 3, scope: !69)
!728 = !DILocation(line: 695, column: 3, scope: !69)
!729 = !DILocation(line: 696, column: 1, scope: !69)
!730 = !DISubprogram(name: "setlocale", scope: !731, file: !731, line: 122, type: !732, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!731 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!732 = !DISubroutineType(types: !733)
!733 = !{!29, !37, !43}
!734 = !DISubprogram(name: "getenv", scope: !735, file: !735, line: 641, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!735 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!736 = !DISubroutineType(types: !737)
!737 = !{!29, !43}
!738 = !DISubprogram(name: "fwrite_unlocked", scope: !199, file: !199, line: 704, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!739 = !DISubroutineType(types: !740)
!740 = !{!40, !741, !40, !40, !621}
!741 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!744 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 508, type: !745, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !748)
!745 = !DISubroutineType(types: !746)
!746 = !{!37, !37, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!748 = !{!749, !750, !751, !752, !753, !764, !765, !769, !771, !772}
!749 = !DILocalVariable(name: "argc", arg: 1, scope: !744, file: !3, line: 508, type: !37)
!750 = !DILocalVariable(name: "argv", arg: 2, scope: !744, file: !3, line: 508, type: !747)
!751 = !DILocalVariable(name: "timeout", scope: !744, file: !3, line: 510, type: !57)
!752 = !DILocalVariable(name: "c", scope: !744, file: !3, line: 511, type: !37)
!753 = !DILocalVariable(name: "orig_set", scope: !744, file: !3, line: 586, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !755, line: 7, baseType: !756)
!755 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "c2b978aaf49d5c0e2b1e9c2e1b7f7848")
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !757, line: 8, baseType: !758)
!757 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "", checksumkind: CSK_MD5, checksum: "acc6b14c0967857fec362a8d433e1cf2")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !757, line: 5, size: 1024, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !758, file: !757, line: 7, baseType: !761, size: 1024)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 16)
!764 = !DILocalVariable(name: "timeout_pid", scope: !744, file: !3, line: 593, type: !51)
!765 = !DILocalVariable(name: "exit_status", scope: !766, file: !3, line: 632, type: !37)
!766 = distinct !DILexicalBlock(scope: !767, file: !3, line: 607, column: 5)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 606, column: 12)
!768 = distinct !DILexicalBlock(scope: !744, file: !3, line: 601, column: 7)
!769 = !DILocalVariable(name: "wait_result", scope: !770, file: !3, line: 638, type: !51)
!770 = distinct !DILexicalBlock(scope: !767, file: !3, line: 637, column: 5)
!771 = !DILocalVariable(name: "status", scope: !770, file: !3, line: 639, type: !37)
!772 = !DILocalVariable(name: "sig", scope: !773, file: !3, line: 662, type: !37)
!773 = distinct !DILexicalBlock(scope: !774, file: !3, line: 661, column: 13)
!774 = distinct !DILexicalBlock(scope: !775, file: !3, line: 660, column: 20)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 658, column: 15)
!776 = distinct !DILexicalBlock(scope: !777, file: !3, line: 657, column: 9)
!777 = distinct !DILexicalBlock(scope: !770, file: !3, line: 650, column: 11)
!778 = !DILocation(line: 0, scope: !744)
!779 = !DILocation(line: 514, column: 21, scope: !744)
!780 = !DILocation(line: 514, column: 3, scope: !744)
!781 = !DILocation(line: 515, column: 3, scope: !744)
!782 = !DILocation(line: 516, column: 3, scope: !744)
!783 = !DILocation(line: 517, column: 3, scope: !744)
!784 = !DILocalVariable(name: "status", arg: 1, scope: !785, file: !6, line: 102, type: !37)
!785 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !6, file: !6, line: 102, type: !35, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !786)
!786 = !{!784}
!787 = !DILocation(line: 0, scope: !785, inlinedAt: !788)
!788 = distinct !DILocation(line: 519, column: 3, scope: !744)
!789 = !DILocation(line: 105, column: 18, scope: !790, inlinedAt: !788)
!790 = distinct !DILexicalBlock(scope: !785, file: !6, line: 104, column: 7)
!791 = !DILocation(line: 520, column: 3, scope: !744)
!792 = !DILocation(line: 522, column: 3, scope: !744)
!793 = !DILocation(line: 522, column: 15, scope: !744)
!794 = !DILocation(line: 528, column: 22, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !3, line: 526, column: 9)
!796 = distinct !DILexicalBlock(scope: !744, file: !3, line: 524, column: 5)
!797 = !DILocation(line: 529, column: 11, scope: !795)
!798 = !DILocation(line: 532, column: 40, scope: !795)
!799 = !DILocation(line: 532, column: 24, scope: !795)
!800 = !DILocation(line: 532, column: 22, scope: !795)
!801 = !{!802, !802, i64 0}
!802 = !{!"double", !529, i64 0}
!803 = !DILocation(line: 533, column: 11, scope: !795)
!804 = !DILocation(line: 536, column: 27, scope: !795)
!805 = !DILocation(line: 537, column: 11, scope: !795)
!806 = !DILocation(line: 540, column: 38, scope: !795)
!807 = !DILocation(line: 540, column: 25, scope: !795)
!808 = !DILocation(line: 540, column: 23, scope: !795)
!809 = !DILocation(line: 541, column: 27, scope: !810)
!810 = distinct !DILexicalBlock(scope: !795, file: !3, line: 541, column: 15)
!811 = !DILocation(line: 541, column: 15, scope: !795)
!812 = distinct !{!812, !792, !813, !591}
!813 = !DILocation(line: 557, column: 5, scope: !744)
!814 = !DILocation(line: 542, column: 13, scope: !810)
!815 = !DILocation(line: 546, column: 19, scope: !795)
!816 = !DILocation(line: 547, column: 11, scope: !795)
!817 = !DILocation(line: 549, column: 9, scope: !795)
!818 = !DILocation(line: 551, column: 9, scope: !795)
!819 = !DILocation(line: 554, column: 11, scope: !795)
!820 = !DILocation(line: 559, column: 14, scope: !821)
!821 = distinct !DILexicalBlock(scope: !744, file: !3, line: 559, column: 7)
!822 = !DILocation(line: 559, column: 12, scope: !821)
!823 = !DILocation(line: 559, column: 21, scope: !821)
!824 = !DILocation(line: 559, column: 7, scope: !744)
!825 = !DILocation(line: 560, column: 5, scope: !821)
!826 = !DILocation(line: 562, column: 40, scope: !744)
!827 = !DILocation(line: 562, column: 29, scope: !744)
!828 = !DILocation(line: 562, column: 13, scope: !744)
!829 = !DILocation(line: 564, column: 11, scope: !744)
!830 = !DILocation(line: 564, column: 8, scope: !744)
!831 = !DILocation(line: 565, column: 13, scope: !744)
!832 = !DILocation(line: 565, column: 11, scope: !744)
!833 = !DILocation(line: 571, column: 8, scope: !834)
!834 = distinct !DILexicalBlock(scope: !744, file: !3, line: 571, column: 7)
!835 = !DILocation(line: 571, column: 7, scope: !744)
!836 = !DILocation(line: 572, column: 5, scope: !834)
!837 = !DILocation(line: 576, column: 20, scope: !744)
!838 = !DILocalVariable(name: "sigterm", arg: 1, scope: !839, file: !3, line: 437, type: !37)
!839 = distinct !DISubprogram(name: "install_cleanup", scope: !3, file: !3, line: 437, type: !35, scopeLine: 438, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !840)
!840 = !{!838, !841, !931, !933}
!841 = !DILocalVariable(name: "sa", scope: !839, file: !3, line: 439, type: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !843, line: 27, size: 1216, elements: !844)
!843 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sigaction.h", directory: "", checksumkind: CSK_MD5, checksum: "95401d18e887df415f59d7a2cb411c28")
!844 = !{!845, !928, !929, !930}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !842, file: !843, line: 38, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !843, line: 31, size: 64, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !846, file: !843, line: 34, baseType: !32, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !846, file: !843, line: 36, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !37, !853, !31}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !855, line: 124, baseType: !856)
!855 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/siginfo_t.h", directory: "", checksumkind: CSK_MD5, checksum: "023cf7b0ef843da262cf07900eda0ac5")
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 36, size: 1024, elements: !857)
!857 = !{!858, !859, !860, !861, !862}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !856, file: !855, line: 38, baseType: !37, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !856, file: !855, line: 40, baseType: !37, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !856, file: !855, line: 42, baseType: !37, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !856, file: !855, line: 48, baseType: !37, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !856, file: !855, line: 123, baseType: !863, size: 896, offset: 128)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !855, line: 51, size: 896, elements: !864)
!864 = !{!865, !869, !875, !887, !893, !902, !917, !922}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !863, file: !855, line: 53, baseType: !866, size: 896)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 896, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 28)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !863, file: !855, line: 60, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 56, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !870, file: !855, line: 58, baseType: !53, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !870, file: !855, line: 59, baseType: !874, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !54, line: 146, baseType: !7)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !863, file: !855, line: 68, baseType: !876, size: 128)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 63, size: 128, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !876, file: !855, line: 65, baseType: !37, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !876, file: !855, line: 66, baseType: !37, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !876, file: !855, line: 67, baseType: !881, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !882, line: 30, baseType: !883)
!882 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigval_t.h", directory: "", checksumkind: CSK_MD5, checksum: "bc7605d16e396c16f725f8da13f6eb20")
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !882, line: 24, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !883, file: !882, line: 26, baseType: !37, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !883, file: !882, line: 27, baseType: !31, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !863, file: !855, line: 76, baseType: !888, size: 128)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 71, size: 128, elements: !889)
!889 = !{!890, !891, !892}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !888, file: !855, line: 73, baseType: !53, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !888, file: !855, line: 74, baseType: !874, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !888, file: !855, line: 75, baseType: !881, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !863, file: !855, line: 86, baseType: !894, size: 256)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 79, size: 256, elements: !895)
!895 = !{!896, !897, !898, !899, !901}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !894, file: !855, line: 81, baseType: !53, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !894, file: !855, line: 82, baseType: !874, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !894, file: !855, line: 83, baseType: !37, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !894, file: !855, line: 84, baseType: !900, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !54, line: 156, baseType: !118)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !894, file: !855, line: 85, baseType: !900, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !863, file: !855, line: 105, baseType: !903, size: 256)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 89, size: 256, elements: !904)
!904 = !{!905, !906, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr", scope: !903, file: !855, line: 91, baseType: !31, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "si_addr_lsb", scope: !903, file: !855, line: 93, baseType: !907, size: 16, offset: 64)
!907 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_bounds", scope: !903, file: !855, line: 104, baseType: !909, size: 128, offset: 128)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !903, file: !855, line: 94, size: 128, elements: !910)
!910 = !{!911, !916}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !909, file: !855, line: 101, baseType: !912, size: 128)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !909, file: !855, line: 97, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !912, file: !855, line: 99, baseType: !31, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !912, file: !855, line: 100, baseType: !31, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !909, file: !855, line: 103, baseType: !250, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !863, file: !855, line: 112, baseType: !918, size: 128)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 108, size: 128, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "si_band", scope: !918, file: !855, line: 110, baseType: !118, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "si_fd", scope: !918, file: !855, line: 111, baseType: !37, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !863, file: !855, line: 121, baseType: !923, size: 128)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !863, file: !855, line: 116, size: 128, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !923, file: !855, line: 118, baseType: !31, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !923, file: !855, line: 119, baseType: !37, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !923, file: !855, line: 120, baseType: !7, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "sa_mask", scope: !842, file: !843, line: 46, baseType: !756, size: 1024, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sa_flags", scope: !842, file: !843, line: 49, baseType: !37, size: 32, offset: 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "sa_restorer", scope: !842, file: !843, line: 52, baseType: !225, size: 64, offset: 1152)
!931 = !DILocalVariable(name: "i", scope: !932, file: !3, line: 445, type: !37)
!932 = distinct !DILexicalBlock(scope: !839, file: !3, line: 445, column: 3)
!933 = !DILocalVariable(name: "s", scope: !934, file: !3, line: 450, type: !37)
!934 = distinct !DILexicalBlock(scope: !839, file: !3, line: 450, column: 3)
!935 = !DILocation(line: 0, scope: !839, inlinedAt: !936)
!936 = distinct !DILocation(line: 576, column: 3, scope: !744)
!937 = !DILocation(line: 439, column: 3, scope: !839, inlinedAt: !936)
!938 = !DILocation(line: 439, column: 20, scope: !839, inlinedAt: !936)
!939 = !DILocation(line: 440, column: 20, scope: !839, inlinedAt: !936)
!940 = !DILocation(line: 440, column: 3, scope: !839, inlinedAt: !936)
!941 = !DILocation(line: 441, column: 6, scope: !839, inlinedAt: !936)
!942 = !DILocation(line: 441, column: 17, scope: !839, inlinedAt: !936)
!943 = !DILocation(line: 442, column: 6, scope: !839, inlinedAt: !936)
!944 = !DILocation(line: 442, column: 15, scope: !839, inlinedAt: !936)
!945 = !{!946, !625, i64 136}
!946 = !{!"sigaction", !529, i64 0, !947, i64 8, !625, i64 136, !528, i64 144}
!947 = !{!"", !529, i64 0}
!948 = !DILocation(line: 0, scope: !932, inlinedAt: !936)
!949 = !DILocation(line: 445, column: 3, scope: !932, inlinedAt: !936)
!950 = !DILocation(line: 450, column: 16, scope: !934, inlinedAt: !936)
!951 = !DILocation(line: 0, scope: !934, inlinedAt: !936)
!952 = !DILocation(line: 450, column: 31, scope: !953, inlinedAt: !936)
!953 = distinct !DILexicalBlock(scope: !934, file: !3, line: 450, column: 3)
!954 = !DILocation(line: 450, column: 28, scope: !953, inlinedAt: !936)
!955 = !DILocation(line: 450, column: 3, scope: !934, inlinedAt: !936)
!956 = !DILocation(line: 446, column: 29, scope: !957, inlinedAt: !936)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 446, column: 9)
!958 = distinct !DILexicalBlock(scope: !932, file: !3, line: 445, column: 3)
!959 = !DILocalVariable(name: "sig", arg: 1, scope: !960, file: !3, line: 422, type: !37)
!960 = distinct !DISubprogram(name: "sig_needs_handling", scope: !3, file: !3, line: 422, type: !961, scopeLine: 423, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !963)
!961 = !DISubroutineType(types: !962)
!962 = !{!60, !37, !37}
!963 = !{!959, !964, !965, !966}
!964 = !DILocalVariable(name: "sigterm", arg: 2, scope: !960, file: !3, line: 422, type: !37)
!965 = !DILocalVariable(name: "old_sa", scope: !960, file: !3, line: 430, type: !842)
!966 = !DILocalVariable(name: "ret", scope: !960, file: !3, line: 432, type: !60)
!967 = !DILocation(line: 0, scope: !960, inlinedAt: !968)
!968 = distinct !DILocation(line: 446, column: 9, scope: !957, inlinedAt: !936)
!969 = !DILocation(line: 424, column: 11, scope: !970, inlinedAt: !968)
!970 = distinct !DILexicalBlock(scope: !960, file: !3, line: 424, column: 7)
!971 = !DILocation(line: 424, column: 22, scope: !970, inlinedAt: !968)
!972 = !DILocation(line: 430, column: 3, scope: !960, inlinedAt: !968)
!973 = !DILocation(line: 430, column: 20, scope: !960, inlinedAt: !968)
!974 = !DILocation(line: 431, column: 3, scope: !960, inlinedAt: !968)
!975 = !DILocation(line: 432, column: 21, scope: !960, inlinedAt: !968)
!976 = !DILocation(line: 432, column: 32, scope: !960, inlinedAt: !968)
!977 = !DILocation(line: 434, column: 1, scope: !960, inlinedAt: !968)
!978 = !DILocation(line: 446, column: 9, scope: !958, inlinedAt: !936)
!979 = !DILocation(line: 447, column: 7, scope: !957, inlinedAt: !936)
!980 = !DILocation(line: 445, column: 44, scope: !958, inlinedAt: !936)
!981 = !DILocation(line: 445, column: 21, scope: !958, inlinedAt: !936)
!982 = distinct !{!982, !949, !983, !591}
!983 = !DILocation(line: 447, column: 40, scope: !932, inlinedAt: !936)
!984 = !DILocation(line: 0, scope: !960, inlinedAt: !985)
!985 = distinct !DILocation(line: 451, column: 9, scope: !986, inlinedAt: !936)
!986 = distinct !DILexicalBlock(scope: !953, file: !3, line: 451, column: 9)
!987 = !DILocation(line: 424, column: 11, scope: !970, inlinedAt: !985)
!988 = !DILocation(line: 424, column: 22, scope: !970, inlinedAt: !985)
!989 = !DILocation(line: 430, column: 3, scope: !960, inlinedAt: !985)
!990 = !DILocation(line: 430, column: 20, scope: !960, inlinedAt: !985)
!991 = !DILocation(line: 431, column: 3, scope: !960, inlinedAt: !985)
!992 = !DILocation(line: 432, column: 21, scope: !960, inlinedAt: !985)
!993 = !DILocation(line: 432, column: 32, scope: !960, inlinedAt: !985)
!994 = !DILocation(line: 434, column: 1, scope: !960, inlinedAt: !985)
!995 = !DILocation(line: 451, column: 9, scope: !953, inlinedAt: !936)
!996 = !DILocation(line: 452, column: 7, scope: !986, inlinedAt: !936)
!997 = !DILocation(line: 450, column: 42, scope: !953, inlinedAt: !936)
!998 = distinct !{!998, !955, !999, !591}
!999 = !DILocation(line: 452, column: 30, scope: !934, inlinedAt: !936)
!1000 = !DILocation(line: 454, column: 3, scope: !839, inlinedAt: !936)
!1001 = !DILocation(line: 455, column: 1, scope: !839, inlinedAt: !936)
!1002 = !DILocation(line: 577, column: 3, scope: !744)
!1003 = !DILocation(line: 578, column: 3, scope: !744)
!1004 = !DILocation(line: 406, column: 3, scope: !1005, inlinedAt: !1008)
!1005 = distinct !DISubprogram(name: "install_sigchld", scope: !3, file: !3, line: 404, type: !226, scopeLine: 405, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1006 = !{!1007}
!1007 = !DILocalVariable(name: "sa", scope: !1005, file: !3, line: 406, type: !842)
!1008 = distinct !DILocation(line: 579, column: 3, scope: !744)
!1009 = !DILocation(line: 406, column: 20, scope: !1005, inlinedAt: !1008)
!1010 = !DILocation(line: 407, column: 20, scope: !1005, inlinedAt: !1008)
!1011 = !DILocation(line: 407, column: 3, scope: !1005, inlinedAt: !1008)
!1012 = !DILocation(line: 408, column: 6, scope: !1005, inlinedAt: !1008)
!1013 = !DILocation(line: 408, column: 17, scope: !1005, inlinedAt: !1008)
!1014 = !DILocation(line: 409, column: 6, scope: !1005, inlinedAt: !1008)
!1015 = !DILocation(line: 409, column: 15, scope: !1005, inlinedAt: !1008)
!1016 = !DILocation(line: 412, column: 3, scope: !1005, inlinedAt: !1008)
!1017 = !DILocation(line: 416, column: 3, scope: !1005, inlinedAt: !1008)
!1018 = !DILocation(line: 417, column: 1, scope: !1005, inlinedAt: !1008)
!1019 = !DILocation(line: 583, column: 3, scope: !744)
!1020 = !DILocation(line: 586, column: 3, scope: !744)
!1021 = !DILocation(line: 586, column: 12, scope: !744)
!1022 = !DILocation(line: 587, column: 27, scope: !744)
!1023 = !DILocalVariable(name: "sigterm", arg: 1, scope: !1024, file: !3, line: 463, type: !37)
!1024 = distinct !DISubprogram(name: "block_cleanup_and_chld", scope: !3, file: !3, line: 463, type: !1025, scopeLine: 464, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !37, !1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!1028 = !{!1023, !1029, !1030, !1031, !1033}
!1029 = !DILocalVariable(name: "old_set", arg: 2, scope: !1024, file: !3, line: 463, type: !1027)
!1030 = !DILocalVariable(name: "block_set", scope: !1024, file: !3, line: 465, type: !754)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !3, line: 468, type: !37)
!1032 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 468, column: 3)
!1033 = !DILocalVariable(name: "s", scope: !1034, file: !3, line: 472, type: !37)
!1034 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 472, column: 3)
!1035 = !DILocation(line: 0, scope: !1024, inlinedAt: !1036)
!1036 = distinct !DILocation(line: 587, column: 3, scope: !744)
!1037 = !DILocation(line: 465, column: 3, scope: !1024, inlinedAt: !1036)
!1038 = !DILocation(line: 465, column: 12, scope: !1024, inlinedAt: !1036)
!1039 = !DILocation(line: 466, column: 3, scope: !1024, inlinedAt: !1036)
!1040 = !DILocation(line: 0, scope: !1032, inlinedAt: !1036)
!1041 = !DILocation(line: 468, column: 3, scope: !1032, inlinedAt: !1036)
!1042 = !DILocation(line: 472, column: 16, scope: !1034, inlinedAt: !1036)
!1043 = !DILocation(line: 0, scope: !1034, inlinedAt: !1036)
!1044 = !DILocation(line: 472, column: 31, scope: !1045, inlinedAt: !1036)
!1045 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 472, column: 3)
!1046 = !DILocation(line: 472, column: 28, scope: !1045, inlinedAt: !1036)
!1047 = !DILocation(line: 472, column: 3, scope: !1034, inlinedAt: !1036)
!1048 = !DILocation(line: 469, column: 29, scope: !1049, inlinedAt: !1036)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 469, column: 9)
!1050 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 468, column: 3)
!1051 = !DILocation(line: 0, scope: !960, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 469, column: 9, scope: !1049, inlinedAt: !1036)
!1053 = !DILocation(line: 424, column: 11, scope: !970, inlinedAt: !1052)
!1054 = !DILocation(line: 424, column: 22, scope: !970, inlinedAt: !1052)
!1055 = !DILocation(line: 430, column: 3, scope: !960, inlinedAt: !1052)
!1056 = !DILocation(line: 430, column: 20, scope: !960, inlinedAt: !1052)
!1057 = !DILocation(line: 431, column: 3, scope: !960, inlinedAt: !1052)
!1058 = !DILocation(line: 432, column: 21, scope: !960, inlinedAt: !1052)
!1059 = !DILocation(line: 432, column: 32, scope: !960, inlinedAt: !1052)
!1060 = !DILocation(line: 434, column: 1, scope: !960, inlinedAt: !1052)
!1061 = !DILocation(line: 469, column: 9, scope: !1050, inlinedAt: !1036)
!1062 = !DILocation(line: 470, column: 7, scope: !1049, inlinedAt: !1036)
!1063 = !DILocation(line: 468, column: 44, scope: !1050, inlinedAt: !1036)
!1064 = !DILocation(line: 468, column: 21, scope: !1050, inlinedAt: !1036)
!1065 = distinct !{!1065, !1041, !1066, !591}
!1066 = !DILocation(line: 470, column: 41, scope: !1032, inlinedAt: !1036)
!1067 = !DILocation(line: 476, column: 3, scope: !1024, inlinedAt: !1036)
!1068 = !DILocation(line: 478, column: 3, scope: !1024, inlinedAt: !1036)
!1069 = !DILocation(line: 480, column: 7, scope: !1070, inlinedAt: !1036)
!1070 = distinct !DILexicalBlock(scope: !1024, file: !3, line: 480, column: 7)
!1071 = !DILocation(line: 480, column: 52, scope: !1070, inlinedAt: !1036)
!1072 = !DILocation(line: 480, column: 7, scope: !1024, inlinedAt: !1036)
!1073 = !DILocation(line: 0, scope: !960, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 473, column: 9, scope: !1075, inlinedAt: !1036)
!1075 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 473, column: 9)
!1076 = !DILocation(line: 424, column: 11, scope: !970, inlinedAt: !1074)
!1077 = !DILocation(line: 424, column: 22, scope: !970, inlinedAt: !1074)
!1078 = !DILocation(line: 430, column: 3, scope: !960, inlinedAt: !1074)
!1079 = !DILocation(line: 430, column: 20, scope: !960, inlinedAt: !1074)
!1080 = !DILocation(line: 431, column: 3, scope: !960, inlinedAt: !1074)
!1081 = !DILocation(line: 432, column: 21, scope: !960, inlinedAt: !1074)
!1082 = !DILocation(line: 432, column: 32, scope: !960, inlinedAt: !1074)
!1083 = !DILocation(line: 434, column: 1, scope: !960, inlinedAt: !1074)
!1084 = !DILocation(line: 473, column: 9, scope: !1045, inlinedAt: !1036)
!1085 = !DILocation(line: 474, column: 7, scope: !1075, inlinedAt: !1036)
!1086 = !DILocation(line: 472, column: 42, scope: !1045, inlinedAt: !1036)
!1087 = distinct !{!1087, !1047, !1088, !591}
!1088 = !DILocation(line: 474, column: 31, scope: !1034, inlinedAt: !1036)
!1089 = !DILocation(line: 481, column: 5, scope: !1070, inlinedAt: !1036)
!1090 = !DILocation(line: 482, column: 1, scope: !1024, inlinedAt: !1036)
!1091 = !DILocation(line: 593, column: 23, scope: !744)
!1092 = !DILocation(line: 600, column: 19, scope: !744)
!1093 = !DILocation(line: 600, column: 17, scope: !744)
!1094 = !DILocation(line: 601, column: 7, scope: !744)
!1095 = !DILocation(line: 603, column: 7, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !768, file: !3, line: 602, column: 5)
!1097 = !DILocation(line: 604, column: 7, scope: !1096)
!1098 = !DILocation(line: 610, column: 32, scope: !766)
!1099 = !DILocation(line: 610, column: 7, scope: !766)
!1100 = !DILocation(line: 615, column: 11, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !766, file: !3, line: 615, column: 11)
!1102 = !DILocation(line: 615, column: 22, scope: !1101)
!1103 = !DILocation(line: 615, column: 11, scope: !766)
!1104 = !DILocation(line: 619, column: 11, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !766, file: !3, line: 619, column: 11)
!1106 = !DILocation(line: 619, column: 54, scope: !1105)
!1107 = !DILocation(line: 619, column: 11, scope: !766)
!1108 = !DILocation(line: 621, column: 11, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 620, column: 9)
!1110 = !DILocation(line: 622, column: 11, scope: !1109)
!1111 = !DILocation(line: 626, column: 7, scope: !766)
!1112 = !DILocation(line: 627, column: 7, scope: !766)
!1113 = !DILocation(line: 629, column: 15, scope: !766)
!1114 = !DILocation(line: 629, column: 7, scope: !766)
!1115 = !DILocation(line: 632, column: 25, scope: !766)
!1116 = !DILocation(line: 632, column: 31, scope: !766)
!1117 = !DILocation(line: 0, scope: !766)
!1118 = !DILocation(line: 633, column: 7, scope: !766)
!1119 = !DILocation(line: 639, column: 7, scope: !770)
!1120 = !DILocation(line: 641, column: 7, scope: !770)
!1121 = !DILocation(line: 647, column: 38, scope: !770)
!1122 = !DILocation(line: 0, scope: !770)
!1123 = !DILocation(line: 647, column: 29, scope: !770)
!1124 = !DILocation(line: 647, column: 72, scope: !770)
!1125 = !DILocation(line: 647, column: 7, scope: !770)
!1126 = !DILocation(line: 648, column: 9, scope: !770)
!1127 = distinct !{!1127, !1125, !1128, !591}
!1128 = !DILocation(line: 648, column: 30, scope: !770)
!1129 = !DILocation(line: 650, column: 23, scope: !777)
!1130 = !DILocation(line: 650, column: 11, scope: !770)
!1131 = !DILocation(line: 653, column: 11, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !777, file: !3, line: 651, column: 9)
!1133 = !DILocation(line: 655, column: 9, scope: !1132)
!1134 = !DILocation(line: 658, column: 15, scope: !775)
!1135 = !DILocation(line: 658, column: 15, scope: !776)
!1136 = !DILocation(line: 659, column: 22, scope: !775)
!1137 = !DILocation(line: 659, column: 13, scope: !775)
!1138 = !DILocation(line: 660, column: 20, scope: !774)
!1139 = !DILocation(line: 660, column: 20, scope: !775)
!1140 = !DILocation(line: 0, scope: !773)
!1141 = !DILocation(line: 663, column: 19, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !773, file: !3, line: 663, column: 19)
!1143 = !DILocation(line: 663, column: 19, scope: !773)
!1144 = !DILocation(line: 664, column: 17, scope: !1142)
!1145 = !DILocation(line: 665, column: 20, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !773, file: !3, line: 665, column: 19)
!1147 = !DILocation(line: 665, column: 30, scope: !1146)
!1148 = !DILocation(line: 490, column: 7, scope: !1149, inlinedAt: !1153)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !3, line: 490, column: 7)
!1150 = distinct !DISubprogram(name: "disable_core_dumps", scope: !3, file: !3, line: 487, type: !1151, scopeLine: 488, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!60}
!1153 = distinct !DILocation(line: 665, column: 33, scope: !1146)
!1154 = !DILocation(line: 490, column: 34, scope: !1149, inlinedAt: !1153)
!1155 = !DILocation(line: 490, column: 7, scope: !1150, inlinedAt: !1153)
!1156 = !DILocation(line: 503, column: 3, scope: !1150, inlinedAt: !1153)
!1157 = !DILocation(line: 665, column: 19, scope: !773)
!1158 = !DILocation(line: 668, column: 19, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 666, column: 17)
!1160 = !DILocation(line: 669, column: 19, scope: !1159)
!1161 = !DILocation(line: 670, column: 19, scope: !1159)
!1162 = !DILocation(line: 671, column: 17, scope: !1159)
!1163 = !DILocation(line: 675, column: 19, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !773, file: !3, line: 675, column: 19)
!1165 = !DILocation(line: 675, column: 29, scope: !1164)
!1166 = !DILocation(line: 676, column: 33, scope: !1164)
!1167 = !DILocation(line: 676, column: 17, scope: !1164)
!1168 = !DILocation(line: 677, column: 28, scope: !773)
!1169 = !DILocation(line: 678, column: 13, scope: !773)
!1170 = !DILocation(line: 682, column: 15, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !774, file: !3, line: 680, column: 13)
!1172 = !DILocation(line: 687, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !770, file: !3, line: 687, column: 11)
!1174 = !DILocation(line: 687, column: 21, scope: !1173)
!1175 = !DILocation(line: 690, column: 5, scope: !767)
!1176 = !DILocation(line: 0, scope: !768)
!1177 = !DILocation(line: 691, column: 1, scope: !744)
!1178 = !DISubprogram(name: "bindtextdomain", scope: !614, file: !614, line: 86, type: !1179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!29, !43, !43}
!1181 = !DISubprogram(name: "textdomain", scope: !614, file: !614, line: 82, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!1182 = !DISubprogram(name: "atexit", scope: !735, file: !735, line: 602, type: !1183, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!37, !225}
!1185 = !DISubprogram(name: "getopt_long", scope: !162, file: !162, line: 66, type: !1186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !536)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!37, !37, !1188, !43, !1190, !167}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!1191 = distinct !DISubprogram(name: "parse_duration", scope: !3, file: !3, line: 371, type: !1192, scopeLine: 372, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1194)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!57, !43}
!1194 = !{!1195, !1196, !1197, !1198}
!1195 = !DILocalVariable(name: "str", arg: 1, scope: !1191, file: !3, line: 371, type: !43)
!1196 = !DILocalVariable(name: "ep", scope: !1191, file: !3, line: 373, type: !29)
!1197 = !DILocalVariable(name: "duration", scope: !1191, file: !3, line: 375, type: !57)
!1198 = !DILocalVariable(name: "s", scope: !1191, file: !3, line: 376, type: !57)
!1199 = !DILocation(line: 0, scope: !1191)
!1200 = !DILocation(line: 373, column: 3, scope: !1191)
!1201 = !DILocation(line: 374, column: 3, scope: !1191)
!1202 = !DILocation(line: 374, column: 9, scope: !1191)
!1203 = !DILocation(line: 375, column: 21, scope: !1191)
!1204 = !DILocation(line: 376, column: 41, scope: !1191)
!1205 = !DILocalVariable(name: "c", arg: 1, scope: !1206, file: !1207, line: 54, type: !57)
