; ModuleID = 'src/touch.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.timespec = type { i64, i64 }
%struct.infomap = type { i8*, i8* }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.table = type { i8*, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 82, type: !173, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !35, globals: !49, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/touch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3e4995e4ab6b9cbcce144b5b354a854")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 42, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256)
!24 = !DIEnumerator(name: "_ISlower", value: 512)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!28 = !DIEnumerator(name: "_ISspace", value: 8192)
!29 = !DIEnumerator(name: "_ISprint", value: 16384)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768)
!31 = !DIEnumerator(name: "_ISblank", value: 1)
!32 = !DIEnumerator(name: "_IScntrl", value: 2)
!33 = !DIEnumerator(name: "_ISpunct", value: 4)
!34 = !DIEnumerator(name: "_ISalnum", value: 8)
!35 = !{!36, !38, !40, !41, !42, !43, !46, !48}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 46, baseType: !45)
!44 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !{!50, !52, !55, !57, !59, !61, !75, !77, !0, !161, !167}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "change_times", scope: !2, file: !3, line: 51, type: !41, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "no_create", scope: !2, file: !3, line: 54, type: !54, isLocal: true, isDefinition: true)
!54 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "use_ref", scope: !2, file: !3, line: 57, type: !54, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "no_dereference", scope: !2, file: !3, line: 60, type: !54, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "amtime_now", scope: !2, file: !3, line: 67, type: !54, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "newtime", scope: !2, file: !3, line: 70, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !73)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !65, line: 11, size: 128, elements: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!66 = !{!67, !71}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !64, file: !65, line: 16, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !69, line: 160, baseType: !70)
!69 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!70 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !64, file: !65, line: 21, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !69, line: 197, baseType: !70)
!73 = !{!74}
!74 = !DISubrange(count: 2)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "ref_file", scope: !2, file: !3, line: 73, type: !38, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !79, file: !80, line: 575, type: !41, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "oputs_", scope: !80, file: !80, line: 573, type: !81, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!80 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!81 = !DISubroutineType(types: !82)
!82 = !{null, !46, !46}
!83 = !{!84, !85, !86, !89, !90, !91, !92, !96, !97, !98, !99, !101, !155, !156, !157, !159, !160}
!84 = !DILocalVariable(name: "program", arg: 1, scope: !79, file: !80, line: 573, type: !46)
!85 = !DILocalVariable(name: "option", arg: 2, scope: !79, file: !80, line: 573, type: !46)
!86 = !DILocalVariable(name: "term", scope: !87, file: !80, line: 585, type: !46)
!87 = distinct !DILexicalBlock(scope: !88, file: !80, line: 582, column: 5)
!88 = distinct !DILexicalBlock(scope: !79, file: !80, line: 581, column: 7)
!89 = !DILocalVariable(name: "double_space", scope: !79, file: !80, line: 594, type: !54)
!90 = !DILocalVariable(name: "first_word", scope: !79, file: !80, line: 595, type: !46)
!91 = !DILocalVariable(name: "option_text", scope: !79, file: !80, line: 596, type: !46)
!92 = !DILocalVariable(name: "s", scope: !93, file: !80, line: 608, type: !46)
!93 = distinct !DILexicalBlock(scope: !94, file: !80, line: 605, column: 5)
!94 = distinct !DILexicalBlock(scope: !95, file: !80, line: 604, column: 12)
!95 = distinct !DILexicalBlock(scope: !79, file: !80, line: 597, column: 7)
!96 = !DILocalVariable(name: "spaces", scope: !93, file: !80, line: 609, type: !43)
!97 = !DILocalVariable(name: "anchor_len", scope: !79, file: !80, line: 620, type: !43)
!98 = !DILocalVariable(name: "desc_text", scope: !79, file: !80, line: 625, type: !46)
!99 = !DILocalVariable(name: "__ptr", scope: !100, file: !80, line: 644, type: !46)
!100 = distinct !DILexicalBlock(scope: !79, file: !80, line: 644, column: 3)
!101 = !DILocalVariable(name: "__stream", scope: !100, file: !80, line: 644, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !104, line: 7, baseType: !105)
!104 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !106, line: 49, size: 1728, elements: !107)
!106 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !123, !125, !126, !127, !129, !130, !132, !136, !139, !141, !144, !147, !148, !149, !150, !151}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !105, file: !106, line: 51, baseType: !41, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !105, file: !106, line: 54, baseType: !38, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !105, file: !106, line: 55, baseType: !38, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !105, file: !106, line: 56, baseType: !38, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !105, file: !106, line: 57, baseType: !38, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !105, file: !106, line: 58, baseType: !38, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !105, file: !106, line: 59, baseType: !38, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !105, file: !106, line: 60, baseType: !38, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !105, file: !106, line: 61, baseType: !38, size: 64, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !105, file: !106, line: 64, baseType: !38, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !105, file: !106, line: 65, baseType: !38, size: 64, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !105, file: !106, line: 66, baseType: !38, size: 64, offset: 704)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !105, file: !106, line: 68, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !106, line: 36, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !105, file: !106, line: 70, baseType: !124, size: 64, offset: 832)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !105, file: !106, line: 72, baseType: !41, size: 32, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !105, file: !106, line: 73, baseType: !41, size: 32, offset: 928)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !105, file: !106, line: 74, baseType: !128, size: 64, offset: 960)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !70)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !105, file: !106, line: 77, baseType: !42, size: 16, offset: 1024)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !105, file: !106, line: 78, baseType: !131, size: 8, offset: 1040)
!131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !105, file: !106, line: 79, baseType: !133, size: 8, offset: 1048)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 1)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !105, file: !106, line: 81, baseType: !137, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !106, line: 43, baseType: null)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !105, file: !106, line: 89, baseType: !140, size: 64, offset: 1152)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !70)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !105, file: !106, line: 91, baseType: !142, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !106, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !105, file: !106, line: 92, baseType: !145, size: 64, offset: 1280)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !106, line: 38, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !105, file: !106, line: 93, baseType: !124, size: 64, offset: 1344)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !105, file: !106, line: 94, baseType: !40, size: 64, offset: 1408)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !105, file: !106, line: 95, baseType: !43, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !105, file: !106, line: 96, baseType: !41, size: 32, offset: 1536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !105, file: !106, line: 98, baseType: !152, size: 160, offset: 1568)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 20)
!155 = !DILocalVariable(name: "__cnt", scope: !100, file: !80, line: 644, type: !43)
!156 = !DILocalVariable(name: "url_program", scope: !79, file: !80, line: 648, type: !46)
!157 = !DILocalVariable(name: "__ptr", scope: !158, file: !80, line: 686, type: !46)
!158 = distinct !DILexicalBlock(scope: !79, file: !80, line: 686, column: 3)
!159 = !DILocalVariable(name: "__stream", scope: !158, file: !80, line: 686, type: !102)
!160 = !DILocalVariable(name: "__cnt", scope: !158, file: !80, line: 686, type: !43)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "time_masks", scope: !2, file: !3, line: 101, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 160, elements: !165)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!165 = !{!166}
!166 = !DISubrange(count: 5)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "time_args", scope: !2, file: !3, line: 95, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 384, elements: !171)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!171 = !{!172}
!172 = !DISubrange(count: 6)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 2048, elements: !183)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !176, line: 50, size: 256, elements: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!177 = !{!178, !179, !180, !182}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 52, baseType: !46, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !175, file: !176, line: 55, baseType: !41, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !175, file: !176, line: 56, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !175, file: !176, line: 57, baseType: !41, size: 32, offset: 192)
!183 = !{!184}
!184 = !DISubrange(count: 8)
!185 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!186 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!187 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!188 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "Version", scope: !191, file: !192, line: 3, type: !46, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !193, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!193 = !{!189}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !196, file: !197, line: 65, type: !201, isLocal: false, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !198, retainedTypes: !199, globals: !200, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!198 = !{!5}
!199 = !{!40, !46, !48}
!200 = !{!194}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !202, line: 69, baseType: !203)
!202 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{null}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "file_name", scope: !208, file: !209, line: 45, type: !46, isLocal: true, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !210, splitDebugInlining: false, nameTableKind: None)
!209 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!210 = !{!206, !211}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !208, file: !209, line: 55, type: !54, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !215, file: !216, line: 66, type: !203, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !217, globals: !218, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!217 = !{!40, !48}
!218 = !{!219, !245, !213, !247, !249}
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "old_file_name", scope: !221, file: !216, line: 304, type: !46, isLocal: true, isDefinition: true)
!221 = distinct !DISubprogram(name: "verror_at_line", scope: !216, file: !216, line: 298, type: !222, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !215, retainedNodes: !238)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !41, !41, !46, !7, !46, !224}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !225, line: 52, baseType: !226)
!225 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !227, line: 32, baseType: !228)
!227 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !229, baseType: !230)
!229 = !DIFile(filename: "lib/error.c", directory: "/src")
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !231, size: 256, elements: !232)
!231 = !DINamespace(name: "std", scope: null)
!232 = !{!233, !234, !235, !236, !237}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !230, file: !229, baseType: !40, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !230, file: !229, baseType: !40, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !230, file: !229, baseType: !40, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !230, file: !229, baseType: !41, size: 32, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !230, file: !229, baseType: !41, size: 32, offset: 224)
!238 = !{!239, !240, !241, !242, !243, !244}
!239 = !DILocalVariable(name: "status", arg: 1, scope: !221, file: !216, line: 298, type: !41)
!240 = !DILocalVariable(name: "errnum", arg: 2, scope: !221, file: !216, line: 298, type: !41)
!241 = !DILocalVariable(name: "file_name", arg: 3, scope: !221, file: !216, line: 298, type: !46)
!242 = !DILocalVariable(name: "line_number", arg: 4, scope: !221, file: !216, line: 298, type: !7)
!243 = !DILocalVariable(name: "message", arg: 5, scope: !221, file: !216, line: 298, type: !46)
!244 = !DILocalVariable(name: "args", arg: 6, scope: !221, file: !216, line: 298, type: !224)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "old_line_number", scope: !221, file: !216, line: 305, type: !7, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "error_message_count", scope: !215, file: !216, line: 69, type: !7, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !215, file: !216, line: 295, type: !41, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "yyval_default", scope: !253, file: !254, line: 1600, type: !590, isLocal: true, isDefinition: true)
!253 = distinct !DISubprogram(name: "yyparse", scope: !254, file: !254, line: 1591, type: !255, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !685)
!254 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!255 = !DISubroutineType(types: !256)
!256 = !{!41, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !259, line: 252, baseType: !260)
!259 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 184, size: 2304, elements: !261)
!261 = !{!262, !263, !267, !268, !269, !270, !271, !281, !282, !283, !284, !285, !290, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !260, file: !259, line: 187, baseType: !46, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !260, file: !259, line: 190, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !265, line: 101, baseType: !266)
!265 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !69, line: 72, baseType: !70)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !260, file: !259, line: 193, baseType: !41, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !260, file: !259, line: 196, baseType: !41, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !260, file: !259, line: 199, baseType: !41, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !260, file: !259, line: 202, baseType: !41, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !260, file: !259, line: 205, baseType: !272, size: 192, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !259, line: 143, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 138, size: 192, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !273, file: !259, line: 140, baseType: !54, size: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !259, line: 141, baseType: !264, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !273, file: !259, line: 142, baseType: !278, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !279, line: 130, baseType: !280)
!279 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !44, line: 35, baseType: !70)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !260, file: !259, line: 206, baseType: !264, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !260, file: !259, line: 207, baseType: !264, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !260, file: !259, line: 208, baseType: !264, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !260, file: !259, line: 209, baseType: !264, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !260, file: !259, line: 210, baseType: !286, size: 128, offset: 704)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !65, line: 11, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !286, file: !65, line: 16, baseType: !68, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !286, file: !65, line: 21, baseType: !72, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !260, file: !259, line: 213, baseType: !291, size: 448, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !259, line: 175, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 165, size: 448, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !292, file: !259, line: 168, baseType: !264, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !292, file: !259, line: 169, baseType: !264, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !292, file: !259, line: 170, baseType: !264, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !292, file: !259, line: 171, baseType: !264, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !292, file: !259, line: 172, baseType: !264, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !292, file: !259, line: 173, baseType: !264, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !292, file: !259, line: 174, baseType: !41, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !260, file: !259, line: 216, baseType: !54, size: 8, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !260, file: !259, line: 217, baseType: !54, size: 8, offset: 1288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !260, file: !259, line: 218, baseType: !278, size: 64, offset: 1344)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !260, file: !259, line: 219, baseType: !278, size: 64, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !260, file: !259, line: 220, baseType: !278, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !260, file: !259, line: 221, baseType: !278, size: 64, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !260, file: !259, line: 222, baseType: !278, size: 64, offset: 1600)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !260, file: !259, line: 223, baseType: !278, size: 64, offset: 1664)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !260, file: !259, line: 224, baseType: !278, size: 64, offset: 1728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !260, file: !259, line: 225, baseType: !54, size: 8, offset: 1792)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !260, file: !259, line: 227, baseType: !54, size: 8, offset: 1800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !260, file: !259, line: 231, baseType: !54, size: 8, offset: 1808)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !260, file: !259, line: 235, baseType: !54, size: 8, offset: 1816)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !260, file: !259, line: 236, baseType: !54, size: 8, offset: 1824)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !260, file: !259, line: 237, baseType: !54, size: 8, offset: 1832)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !260, file: !259, line: 238, baseType: !54, size: 8, offset: 1840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !260, file: !259, line: 239, baseType: !54, size: 8, offset: 1848)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !260, file: !259, line: 240, baseType: !54, size: 8, offset: 1856)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !260, file: !259, line: 243, baseType: !54, size: 8, offset: 1864)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !260, file: !259, line: 246, baseType: !321, size: 384, offset: 1920)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 384, elements: !328)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !259, line: 151, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 146, size: 128, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !323, file: !259, line: 148, baseType: !46, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !259, line: 149, baseType: !41, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !259, line: 150, baseType: !41, size: 32, offset: 96)
!328 = !{!329}
!329 = !DISubrange(count: 3)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !332, retainedTypes: !582, globals: !598, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!332 = !{!333, !393, !420, !425, !429, !579}
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !254, line: 734, baseType: !41, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!335 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!336 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!337 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!338 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!339 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!340 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!341 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!342 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!343 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!344 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!345 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!346 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!347 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!348 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!349 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!350 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!351 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!352 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!353 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!354 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!355 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!356 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!357 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!358 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!359 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!360 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!361 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!362 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!363 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!364 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!365 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!366 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!367 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!368 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!369 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!370 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!371 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!372 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!373 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!374 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!375 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!376 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!377 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!378 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!379 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!380 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!381 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!382 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!383 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!384 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!385 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!386 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!387 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!388 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!389 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!390 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!391 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!392 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !254, line: 676, baseType: !41, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!395 = !DIEnumerator(name: "YYEMPTY", value: -2)
!396 = !DIEnumerator(name: "YYEOF", value: 0)
!397 = !DIEnumerator(name: "YYerror", value: 256)
!398 = !DIEnumerator(name: "YYUNDEF", value: 257)
!399 = !DIEnumerator(name: "tAGO", value: 258)
!400 = !DIEnumerator(name: "tDST", value: 259)
!401 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!402 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!403 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!404 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!405 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!406 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!407 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!408 = !DIEnumerator(name: "tDAY", value: 267)
!409 = !DIEnumerator(name: "tDAYZONE", value: 268)
!410 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!411 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!412 = !DIEnumerator(name: "tMONTH", value: 271)
!413 = !DIEnumerator(name: "tORDINAL", value: 272)
!414 = !DIEnumerator(name: "tZONE", value: 273)
!415 = !DIEnumerator(name: "tSNUMBER", value: 274)
!416 = !DIEnumerator(name: "tUNUMBER", value: 275)
!417 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!418 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!419 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 154, baseType: !7, size: 32, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIEnumerator(name: "MERam", value: 0)
!423 = !DIEnumerator(name: "MERpm", value: 1)
!424 = !DIEnumerator(name: "MER24", value: 2)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 162, baseType: !7, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIEnumerator(name: "BILLION", value: 1000000000)
!428 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !430, file: !259, line: 1781, baseType: !7, size: 32, elements: !577)
!430 = distinct !DISubprogram(name: "parse_datetime_body", scope: !259, file: !259, line: 1767, type: !431, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !440)
!431 = !DISubroutineType(types: !432)
!432 = !{!54, !433, !46, !434, !7, !436, !46}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !437, line: 1039, baseType: !438)
!437 = !DIFile(filename: "./lib/time.h", directory: "/src")
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !437, line: 1039, flags: DIFlagFwdDecl)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !462, !463, !467, !471, !472, !473, !474, !475, !476, !479, !480, !481, !482, !484, !487, !488, !489, !495, !496, !497, !498, !499, !501, !504, !505, !512, !515, !516, !522, !523, !524, !527, !528, !531, !532, !533, !541, !544, !545, !546, !547, !550, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !564, !565, !568, !569, !570, !571, !572, !575, !576}
!441 = !DILocalVariable(name: "result", arg: 1, scope: !430, file: !259, line: 1767, type: !433)
!442 = !DILocalVariable(name: "p", arg: 2, scope: !430, file: !259, line: 1767, type: !46)
!443 = !DILocalVariable(name: "now", arg: 3, scope: !430, file: !259, line: 1768, type: !434)
!444 = !DILocalVariable(name: "flags", arg: 4, scope: !430, file: !259, line: 1768, type: !7)
!445 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !430, file: !259, line: 1769, type: !436)
!446 = !DILocalVariable(name: "tzstring", arg: 6, scope: !430, file: !259, line: 1769, type: !46)
!447 = !DILocalVariable(name: "tm", scope: !430, file: !259, line: 1771, type: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !449, line: 7, size: 448, elements: !450)
!449 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !448, file: !449, line: 9, baseType: !41, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !448, file: !449, line: 10, baseType: !41, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !448, file: !449, line: 11, baseType: !41, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !448, file: !449, line: 12, baseType: !41, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !448, file: !449, line: 13, baseType: !41, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !448, file: !449, line: 14, baseType: !41, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !448, file: !449, line: 15, baseType: !41, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !448, file: !449, line: 16, baseType: !41, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !448, file: !449, line: 17, baseType: !41, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !448, file: !449, line: 20, baseType: !70, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !448, file: !449, line: 21, baseType: !46, size: 64, offset: 384)
!462 = !DILocalVariable(name: "tm0", scope: !430, file: !259, line: 1772, type: !448)
!463 = !DILocalVariable(name: "time_zone_buf", scope: !430, file: !259, line: 1773, type: !464)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 216, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 27)
!467 = !DILocalVariable(name: "dbg_tm", scope: !430, file: !259, line: 1774, type: !468)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 800, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 100)
!471 = !DILocalVariable(name: "ok", scope: !430, file: !259, line: 1775, type: !54)
!472 = !DILocalVariable(name: "input_sentinel", scope: !430, file: !259, line: 1776, type: !46)
!473 = !DILocalVariable(name: "tz1alloc", scope: !430, file: !259, line: 1777, type: !38)
!474 = !DILocalVariable(name: "tz1buf", scope: !430, file: !259, line: 1782, type: !468)
!475 = !DILocalVariable(name: "gettime_buffer", scope: !430, file: !259, line: 1784, type: !286)
!476 = !DILocalVariable(name: "Start", scope: !430, file: !259, line: 1791, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !478, line: 10, baseType: !68)
!478 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!479 = !DILocalVariable(name: "Start_ns", scope: !430, file: !259, line: 1792, type: !41)
!480 = !DILocalVariable(name: "c", scope: !430, file: !259, line: 1794, type: !48)
!481 = !DILocalVariable(name: "tz", scope: !430, file: !259, line: 1798, type: !436)
!482 = !DILocalVariable(name: "rel_time_0", scope: !430, file: !259, line: 1803, type: !483)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!484 = !DILocalVariable(name: "tzbase", scope: !485, file: !259, line: 1807, type: !46)
!485 = distinct !DILexicalBlock(scope: !486, file: !259, line: 1806, column: 5)
!486 = distinct !DILexicalBlock(scope: !430, file: !259, line: 1805, column: 7)
!487 = !DILocalVariable(name: "tzsize", scope: !485, file: !259, line: 1808, type: !278)
!488 = !DILocalVariable(name: "s", scope: !485, file: !259, line: 1809, type: !46)
!489 = !DILocalVariable(name: "tz1", scope: !490, file: !259, line: 1820, type: !436)
!490 = distinct !DILexicalBlock(scope: !491, file: !259, line: 1819, column: 11)
!491 = distinct !DILexicalBlock(scope: !492, file: !259, line: 1818, column: 18)
!492 = distinct !DILexicalBlock(scope: !493, file: !259, line: 1812, column: 13)
!493 = distinct !DILexicalBlock(scope: !494, file: !259, line: 1811, column: 7)
!494 = distinct !DILexicalBlock(scope: !485, file: !259, line: 1811, column: 7)
!495 = !DILocalVariable(name: "tz1string", scope: !490, file: !259, line: 1821, type: !38)
!496 = !DILocalVariable(name: "z", scope: !490, file: !259, line: 1822, type: !38)
!497 = !DILocalVariable(name: "tmp", scope: !430, file: !259, line: 1848, type: !448)
!498 = !DILocalVariable(name: "pc", scope: !430, file: !259, line: 1858, type: !258)
!499 = !DILocalVariable(name: "quarter", scope: !500, file: !259, line: 1903, type: !41)
!500 = distinct !DILexicalBlock(scope: !430, file: !259, line: 1903, column: 3)
!501 = !DILocalVariable(name: "probe", scope: !502, file: !259, line: 1905, type: !477)
!502 = distinct !DILexicalBlock(scope: !503, file: !259, line: 1904, column: 5)
!503 = distinct !DILexicalBlock(scope: !500, file: !259, line: 1903, column: 3)
!504 = !DILocalVariable(name: "probe_tm", scope: !502, file: !259, line: 1908, type: !448)
!505 = !DILocalVariable(name: "mrd", scope: !506, file: !259, line: 2015, type: !46)
!506 = distinct !DILexicalBlock(scope: !507, file: !259, line: 2014, column: 13)
!507 = distinct !DILexicalBlock(scope: !508, file: !259, line: 2013, column: 15)
!508 = distinct !DILexicalBlock(scope: !509, file: !259, line: 2011, column: 9)
!509 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2010, column: 11)
!510 = distinct !DILexicalBlock(scope: !511, file: !259, line: 1982, column: 5)
!511 = distinct !DILexicalBlock(scope: !430, file: !259, line: 1979, column: 7)
!512 = !DILocalVariable(name: "repaired", scope: !513, file: !259, line: 2061, type: !54)
!513 = distinct !DILexicalBlock(scope: !514, file: !259, line: 2060, column: 9)
!514 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2059, column: 11)
!515 = !DILocalVariable(name: "time_zone_seen", scope: !513, file: !259, line: 2062, type: !54)
!516 = !DILocalVariable(name: "tz2buf", scope: !517, file: !259, line: 2075, type: !519)
!517 = distinct !DILexicalBlock(scope: !518, file: !259, line: 2064, column: 13)
!518 = distinct !DILexicalBlock(scope: !513, file: !259, line: 2063, column: 15)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 240, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 30)
!522 = !DILocalVariable(name: "tz2", scope: !517, file: !259, line: 2078, type: !436)
!523 = !DILocalVariable(name: "dbg_ord", scope: !510, file: !259, line: 2105, type: !468)
!524 = !DILocalVariable(name: "dayincr", scope: !525, file: !259, line: 2109, type: !264)
!525 = distinct !DILexicalBlock(scope: !526, file: !259, line: 2108, column: 9)
!526 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2107, column: 11)
!527 = !DILocalVariable(name: "day_ordinal", scope: !525, file: !259, line: 2111, type: !264)
!528 = !DILocalVariable(name: "year", scope: !529, file: !259, line: 2173, type: !41)
!529 = distinct !DILexicalBlock(scope: !530, file: !259, line: 2160, column: 9)
!530 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2159, column: 11)
!531 = !DILocalVariable(name: "month", scope: !529, file: !259, line: 2173, type: !41)
!532 = !DILocalVariable(name: "day", scope: !529, file: !259, line: 2173, type: !41)
!533 = !DILocalVariable(name: "tm_year_buf", scope: !534, file: !259, line: 2247, type: !538)
!534 = distinct !DILexicalBlock(scope: !535, file: !259, line: 2244, column: 17)
!535 = distinct !DILexicalBlock(scope: !536, file: !259, line: 2241, column: 19)
!536 = distinct !DILexicalBlock(scope: !537, file: !259, line: 2202, column: 13)
!537 = distinct !DILexicalBlock(scope: !529, file: !259, line: 2201, column: 15)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 104, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 13)
!541 = !DILocalVariable(name: "overflow", scope: !542, file: !259, line: 2262, type: !54)
!542 = distinct !DILexicalBlock(scope: !543, file: !259, line: 2261, column: 9)
!543 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2260, column: 11)
!544 = !DILocalVariable(name: "utcoff", scope: !542, file: !259, line: 2264, type: !70)
!545 = !DILocalVariable(name: "delta", scope: !542, file: !259, line: 2272, type: !264)
!546 = !DILocalVariable(name: "t1", scope: !542, file: !259, line: 2274, type: !477)
!547 = !DILocalVariable(name: "Starti", scope: !548, file: !259, line: 2288, type: !264)
!548 = distinct !DILexicalBlock(scope: !549, file: !259, line: 2287, column: 9)
!549 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2286, column: 11)
!550 = !DILocalVariable(name: "orig_ns", scope: !551, file: !259, line: 2303, type: !264)
!551 = distinct !DILexicalBlock(scope: !510, file: !259, line: 2302, column: 7)
!552 = !DILocalVariable(name: "sum_ns", scope: !551, file: !259, line: 2304, type: !264)
!553 = !DILocalVariable(name: "normalized_ns", scope: !551, file: !259, line: 2305, type: !41)
!554 = !DILocalVariable(name: "d4", scope: !551, file: !259, line: 2306, type: !41)
!555 = !DILocalVariable(name: "d1", scope: !551, file: !259, line: 2307, type: !264)
!556 = !DILocalVariable(name: "t1", scope: !551, file: !259, line: 2307, type: !264)
!557 = !DILocalVariable(name: "d2", scope: !551, file: !259, line: 2307, type: !264)
!558 = !DILocalVariable(name: "t2", scope: !551, file: !259, line: 2307, type: !264)
!559 = !DILocalVariable(name: "t3", scope: !551, file: !259, line: 2307, type: !264)
!560 = !DILocalVariable(name: "t4", scope: !551, file: !259, line: 2308, type: !477)
!561 = !DILocalVariable(name: "t4i", scope: !562, file: !259, line: 2333, type: !264)
!562 = distinct !DILexicalBlock(scope: !563, file: !259, line: 2327, column: 11)
!563 = distinct !DILexicalBlock(scope: !551, file: !259, line: 2325, column: 13)
!564 = !DILocalVariable(name: "lmt", scope: !562, file: !259, line: 2347, type: !448)
!565 = !DILocalVariable(name: "sec", scope: !566, file: !259, line: 2366, type: !264)
!566 = distinct !DILexicalBlock(scope: !567, file: !259, line: 2357, column: 5)
!567 = distinct !DILexicalBlock(scope: !430, file: !259, line: 2356, column: 7)
!568 = !DILocalVariable(name: "nsec", scope: !566, file: !259, line: 2367, type: !41)
!569 = !DILocalVariable(name: "gmt", scope: !566, file: !259, line: 2371, type: !448)
!570 = !DILocalVariable(name: "lmt", scope: !566, file: !259, line: 2371, type: !448)
!571 = !DILocalVariable(name: "got_utc", scope: !566, file: !259, line: 2372, type: !54)
!572 = !DILocalVariable(name: "got_utcoff", scope: !573, file: !259, line: 2380, type: !54)
!573 = distinct !DILexicalBlock(scope: !574, file: !259, line: 2378, column: 9)
!574 = distinct !DILexicalBlock(scope: !566, file: !259, line: 2377, column: 11)
!575 = !DILocalVariable(name: "utcoff", scope: !573, file: !259, line: 2381, type: !70)
!576 = !DILabel(scope: !430, name: "fail", file: !259, line: 2400)
!577 = !{!578}
!578 = !DIEnumerator(name: "TZBUFSIZE", value: 100)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 1275, baseType: !7, size: 32, elements: !580)
!580 = !{!581}
!581 = !DIEnumerator(name: "TM_YEAR_BASE", value: 1900)
!582 = !{!583, !585, !45, !70, !597, !54}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_t", file: !254, line: 910, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !254, line: 822, baseType: !131)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !254, line: 1063, size: 448, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !586, file: !254, line: 1065, baseType: !583, size: 8)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !586, file: !254, line: 1066, baseType: !590, size: 448)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !254, line: 721, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !254, line: 709, size: 448, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !591, file: !259, line: 583, baseType: !264, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !591, file: !259, line: 584, baseType: !272, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !591, file: !259, line: 585, baseType: !286, size: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !591, file: !259, line: 586, baseType: !291, size: 448)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "yysymbol_kind_t", file: !254, line: 795, baseType: !333)
!598 = !{!251, !599, !605, !610, !612, !614, !616, !621, !635, !641, !643, !648, !650, !652, !656, !661, !665, !670, !673, !677, !682}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "yypact", scope: !330, file: !254, line: 1238, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 968, elements: !603)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!603 = !{!604}
!604 = !DISubrange(count: 121)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "yytranslate", scope: !330, file: !254, line: 1145, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2232, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 279)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "yycheck", scope: !330, file: !254, line: 1311, type: !601, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "yytable", scope: !330, file: !254, line: 1294, type: !601, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "yydefact", scope: !330, file: !254, line: 1258, type: !601, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "yyr2", scope: !330, file: !254, line: 1363, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 760, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 95)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !623, file: !259, line: 351, type: !631, isLocal: true, isDefinition: true)
!623 = distinct !DISubprogram(name: "str_days", scope: !259, file: !259, line: 348, type: !624, scopeLine: 349, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !330, retainedNodes: !626)
!624 = !DISubroutineType(types: !625)
!625 = !{!46, !257, !38, !41}
!626 = !{!627, !628, !629, !630}
!627 = !DILocalVariable(name: "pc", arg: 1, scope: !623, file: !259, line: 348, type: !257)
!628 = !DILocalVariable(name: "buffer", arg: 2, scope: !623, file: !259, line: 348, type: !38)
!629 = !DILocalVariable(name: "n", arg: 3, scope: !623, file: !259, line: 348, type: !41)
!630 = !DILocalVariable(name: "len", scope: !623, file: !259, line: 378, type: !41)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1232, elements: !632)
!632 = !{!633, !634}
!633 = !DISubrange(count: 14)
!634 = !DISubrange(count: 11)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "days_values", scope: !623, file: !259, line: 368, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 224, elements: !638)
!638 = !{!639, !640}
!639 = !DISubrange(count: 7)
!640 = !DISubrange(count: 4)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "yyr1", scope: !330, file: !254, line: 1348, type: !618, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "yypgoto", scope: !330, file: !254, line: 1276, type: !645, isLocal: true, isDefinition: true)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 208, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 26)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !330, file: !254, line: 1284, type: !645, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "yystos", scope: !330, file: !254, line: 1330, type: !601, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "meridian_table", scope: !330, file: !259, line: 1032, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 640, elements: !165)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !330, file: !259, line: 1046, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 3200, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 25)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !330, file: !259, line: 1120, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 512, elements: !664)
!664 = !{!640}
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !330, file: !259, line: 1133, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 6144, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 48)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "dst_table", scope: !330, file: !259, line: 1041, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 128, elements: !134)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "time_units_table", scope: !330, file: !259, line: 1075, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 1408, elements: !676)
!676 = !{!634}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !330, file: !259, line: 1091, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 2688, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 21)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "military_table", scope: !330, file: !259, line: 1193, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 3456, elements: !465)
!685 = !{!686, !687, !688, !689, !690, !692, !693, !694, !696, !698, !699, !701, !703, !704, !705, !706, !707, !708, !709, !712, !714, !715, !717, !719, !727, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!686 = !DILocalVariable(name: "pc", arg: 1, scope: !253, file: !254, line: 1591, type: !257)
!687 = !DILocalVariable(name: "yychar", scope: !253, file: !254, line: 1594, type: !41)
!688 = !DILocalVariable(name: "yylval", scope: !253, file: !254, line: 1601, type: !590)
!689 = !DILocalVariable(name: "yynerrs", scope: !253, file: !254, line: 1604, type: !41)
!690 = !DILocalVariable(name: "yystate", scope: !253, file: !254, line: 1606, type: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "yy_state_fast_t", file: !254, line: 913, baseType: !41)
!692 = !DILocalVariable(name: "yyerrstatus", scope: !253, file: !254, line: 1608, type: !41)
!693 = !DILocalVariable(name: "yystacksize", scope: !253, file: !254, line: 1614, type: !70)
!694 = !DILocalVariable(name: "yyssa", scope: !253, file: !254, line: 1617, type: !695)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 160, elements: !153)
!696 = !DILocalVariable(name: "yyss", scope: !253, file: !254, line: 1618, type: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!698 = !DILocalVariable(name: "yyssp", scope: !253, file: !254, line: 1619, type: !697)
!699 = !DILocalVariable(name: "yyvsa", scope: !253, file: !254, line: 1622, type: !700)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 8960, elements: !153)
!701 = !DILocalVariable(name: "yyvs", scope: !253, file: !254, line: 1623, type: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!703 = !DILocalVariable(name: "yyvsp", scope: !253, file: !254, line: 1624, type: !702)
!704 = !DILocalVariable(name: "yyn", scope: !253, file: !254, line: 1626, type: !41)
!705 = !DILocalVariable(name: "yyresult", scope: !253, file: !254, line: 1628, type: !41)
!706 = !DILocalVariable(name: "yytoken", scope: !253, file: !254, line: 1630, type: !597)
!707 = !DILocalVariable(name: "yyval", scope: !253, file: !254, line: 1633, type: !590)
!708 = !DILocalVariable(name: "yylen", scope: !253, file: !254, line: 1641, type: !41)
!709 = !DILocalVariable(name: "yysize", scope: !710, file: !254, line: 1676, type: !70)
!710 = distinct !DILexicalBlock(scope: !711, file: !254, line: 1674, column: 5)
!711 = distinct !DILexicalBlock(scope: !253, file: !254, line: 1670, column: 7)
!712 = !DILocalVariable(name: "yyss1", scope: !713, file: !254, line: 1706, type: !697)
!713 = distinct !DILexicalBlock(scope: !710, file: !254, line: 1705, column: 7)
!714 = !DILocalVariable(name: "yyptr", scope: !713, file: !254, line: 1707, type: !585)
!715 = !DILocalVariable(name: "yynewbytes", scope: !716, file: !254, line: 1712, type: !70)
!716 = distinct !DILexicalBlock(scope: !713, file: !254, line: 1712, column: 9)
!717 = !DILocalVariable(name: "yynewbytes", scope: !718, file: !254, line: 1713, type: !70)
!718 = distinct !DILexicalBlock(scope: !713, file: !254, line: 1713, column: 9)
!719 = !DILocalVariable(name: "digits", scope: !720, file: !259, line: 830, type: !264)
!720 = distinct !DILexicalBlock(scope: !721, file: !259, line: 829, column: 15)
!721 = distinct !DILexicalBlock(scope: !722, file: !259, line: 828, column: 17)
!722 = distinct !DILexicalBlock(scope: !723, file: !259, line: 827, column: 11)
!723 = distinct !DILexicalBlock(scope: !724, file: !259, line: 826, column: 13)
!724 = distinct !DILexicalBlock(scope: !725, file: !259, line: 820, column: 7)
!725 = !DILexicalBlockFile(scope: !726, file: !259, discriminator: 0)
!726 = distinct !DILexicalBlock(scope: !253, file: !254, line: 1844, column: 5)
!727 = !DILocalVariable(name: "yylhs", scope: !728, file: !254, line: 2500, type: !164)
!728 = distinct !DILexicalBlock(scope: !253, file: !254, line: 2499, column: 3)
!729 = !DILocalVariable(name: "yyi", scope: !728, file: !254, line: 2501, type: !164)
!730 = !DILabel(scope: !253, name: "yynewstate", file: !254, line: 1653)
!731 = !DILabel(scope: !253, name: "yysetstate", file: !254, line: 1662)
!732 = !DILabel(scope: !253, name: "yybackup", file: !254, line: 1743)
!733 = !DILabel(scope: !253, name: "yydefault", file: !254, line: 1817)
!734 = !DILabel(scope: !253, name: "yyreduce", file: !254, line: 1827)
!735 = !DILabel(scope: !253, name: "yyerrlab", file: !254, line: 2513)
!736 = !DILabel(scope: !253, name: "yyerrorlab", file: !254, line: 2551)
!737 = !DILabel(scope: !253, name: "yyerrlab1", file: !254, line: 2570)
!738 = !DILabel(scope: !253, name: "yyacceptlab", file: !254, line: 2615)
!739 = !DILabel(scope: !253, name: "yyabortlab", file: !254, line: 2623)
!740 = !DILabel(scope: !253, name: "yyexhaustedlab", file: !254, line: 2631)
!741 = !DILabel(scope: !253, name: "yyreturnlab", file: !254, line: 2640)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "program_name", scope: !744, file: !745, line: 31, type: !46, isLocal: false, isDefinition: true)
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !746, globals: !747, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!746 = !{!38}
!747 = !{!742}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "utf07FF", scope: !750, file: !751, line: 46, type: !779, isLocal: true, isDefinition: true)
!750 = distinct !DISubprogram(name: "proper_name_lite", scope: !751, file: !751, line: 38, type: !752, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !754, retainedNodes: !756)
!751 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!752 = !DISubroutineType(types: !753)
!753 = !{!46, !46, !46}
!754 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !755, splitDebugInlining: false, nameTableKind: None)
!755 = !{!748}
!756 = !{!757, !758, !759, !760, !765}
!757 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !750, file: !751, line: 38, type: !46)
!758 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !750, file: !751, line: 38, type: !46)
!759 = !DILocalVariable(name: "translation", scope: !750, file: !751, line: 40, type: !46)
!760 = !DILocalVariable(name: "w", scope: !750, file: !751, line: 47, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !762, line: 37, baseType: !763)
!762 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !69, line: 57, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !69, line: 42, baseType: !7)
!765 = !DILocalVariable(name: "mbs", scope: !750, file: !751, line: 48, type: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !767, line: 6, baseType: !768)
!767 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !769, line: 21, baseType: !770)
!769 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 13, size: 64, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !770, file: !769, line: 15, baseType: !41, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !770, file: !769, line: 20, baseType: !774, size: 32, offset: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !770, file: !769, line: 16, size: 32, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !774, file: !769, line: 18, baseType: !7, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !774, file: !769, line: 19, baseType: !778, size: 32)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !664)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 16, elements: !73)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !782, file: !783, line: 76, type: !849, isLocal: false, isDefinition: true)
!782 = distinct !DICompileUnit(language: DW_LANG_C99, file: !783, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !784, retainedTypes: !790, globals: !791, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!784 = !{!5, !785, !20}
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 254, baseType: !7, size: 32, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!788 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!789 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!790 = !{!41, !42, !43}
!791 = !{!780, !792, !798, !808, !810, !815, !838, !845, !847}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !782, file: !783, line: 92, type: !794, isLocal: false, isDefinition: true)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 320, elements: !796)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!796 = !{!797}
!797 = !DISubrange(count: 10)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !782, file: !783, line: 1040, type: !800, isLocal: false, isDefinition: true)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !783, line: 56, size: 448, elements: !801)
!801 = !{!802, !803, !804, !806, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !800, file: !783, line: 59, baseType: !5, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !800, file: !783, line: 62, baseType: !41, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !800, file: !783, line: 66, baseType: !805, size: 256, offset: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !183)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !800, file: !783, line: 69, baseType: !46, size: 64, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !800, file: !783, line: 72, baseType: !46, size: 64, offset: 384)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !782, file: !783, line: 107, type: !800, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "slot0", scope: !782, file: !783, line: 831, type: !812, isLocal: true, isDefinition: true)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 2048, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 256)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "quote", scope: !817, file: !783, line: 228, type: !836, isLocal: true, isDefinition: true)
!817 = distinct !DISubprogram(name: "gettext_quote", scope: !783, file: !783, line: 197, type: !818, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !782, retainedNodes: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{!46, !46, !5}
!820 = !{!821, !822, !823, !824, !825}
!821 = !DILocalVariable(name: "msgid", arg: 1, scope: !817, file: !783, line: 197, type: !46)
!822 = !DILocalVariable(name: "s", arg: 2, scope: !817, file: !783, line: 197, type: !5)
!823 = !DILocalVariable(name: "translation", scope: !817, file: !783, line: 199, type: !46)
!824 = !DILocalVariable(name: "w", scope: !817, file: !783, line: 229, type: !761)
!825 = !DILocalVariable(name: "mbs", scope: !817, file: !783, line: 230, type: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !767, line: 6, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !769, line: 21, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 13, size: 64, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !828, file: !769, line: 15, baseType: !41, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !828, file: !769, line: 20, baseType: !832, size: 32, offset: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !828, file: !769, line: 16, size: 32, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !832, file: !769, line: 18, baseType: !7, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !832, file: !769, line: 19, baseType: !778, size: 32)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !837)
!837 = !{!74, !640}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "slotvec", scope: !782, file: !783, line: 834, type: !840, isLocal: true, isDefinition: true)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !783, line: 823, size: 128, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !841, file: !783, line: 825, baseType: !43, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !841, file: !783, line: 826, baseType: !38, size: 64, offset: 64)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "nslots", scope: !782, file: !783, line: 832, type: !41, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "slotvec0", scope: !782, file: !783, line: 833, type: !841, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 704, elements: !676)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !852, file: !853, line: 26, type: !855, isLocal: false, isDefinition: true)
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!854 = !{!850}
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 376, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 47)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "exit_failure", scope: !860, file: !861, line: 24, type: !863, isLocal: false, isDefinition: true)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !862, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!862 = !{!858}
!863 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "internal_state", scope: !866, file: !867, line: 97, type: !870, isLocal: true, isDefinition: true)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !868, globals: !869, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!868 = !{!40, !43, !48}
!869 = !{!864}
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !767, line: 6, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !769, line: 21, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !769, line: 13, size: 64, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !872, file: !769, line: 15, baseType: !41, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !872, file: !769, line: 20, baseType: !876, size: 32, offset: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !872, file: !769, line: 16, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !876, file: !769, line: 18, baseType: !7, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !876, file: !769, line: 19, baseType: !778, size: 32)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/fdutimensat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7ed4a56b581c8ad87a015a222c14deba")
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!887 = !DIFile(filename: "lib/gettime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a016c544b37f0f09ea51b9ba657379b")
!888 = distinct !DICompileUnit(language: DW_LANG_C99, file: !889, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !890, splitDebugInlining: false, nameTableKind: None)
!889 = !DIFile(filename: "lib/posixtm.c", directory: "/src", checksumkind: CSK_MD5, checksum: "20258436a0437a3ee5470e327c495476")
!890 = !{!54}
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/posixver.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b586c85144b881c520e7e1ef1553b215")
!893 = distinct !DICompileUnit(language: DW_LANG_C99, file: !894, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!894 = !DIFile(filename: "lib/time.c", directory: "/src", checksumkind: CSK_MD5, checksum: "402c2ccc7a3a90dfc8381b5d9f8bcf84")
!895 = !{!40}
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898, retainedTypes: !902, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/time_rz.c", directory: "/src", checksumkind: CSK_MD5, checksum: "77903e6b2ced3335152eaec7e7af65ee")
!898 = !{!899}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !897, line: 82, baseType: !7, size: 32, elements: !900)
!900 = !{!901}
!901 = !DIEnumerator(name: "ABBR_SIZE_MIN", value: 119)
!902 = !{!903, !38}
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !437, line: 1039, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !906, line: 24, size: 128, elements: !907)
!906 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !906, line: 28, baseType: !904, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !905, file: !906, line: 33, baseType: !39, size: 8, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !905, file: !906, line: 45, baseType: !911, offset: 72)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: -1)
!914 = distinct !DICompileUnit(language: DW_LANG_C99, file: !915, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !916, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!915 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!916 = !{!917}
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !915, line: 40, baseType: !7, size: 32, elements: !918)
!918 = !{!919}
!919 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!920 = distinct !DICompileUnit(language: DW_LANG_C99, file: !921, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !922, retainedTypes: !950, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!922 = !{!923, !935}
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !924, file: !921, line: 188, baseType: !7, size: 32, elements: !933)
!924 = distinct !DISubprogram(name: "x2nrealloc", scope: !921, file: !921, line: 176, type: !925, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !920, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{!40, !40, !927, !43}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!928 = !{!929, !930, !931, !932}
!929 = !DILocalVariable(name: "p", arg: 1, scope: !924, file: !921, line: 176, type: !40)
!930 = !DILocalVariable(name: "pn", arg: 2, scope: !924, file: !921, line: 176, type: !927)
!931 = !DILocalVariable(name: "s", arg: 3, scope: !924, file: !921, line: 176, type: !43)
!932 = !DILocalVariable(name: "n", scope: !924, file: !921, line: 178, type: !43)
!933 = !{!934}
!934 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !936, file: !921, line: 228, baseType: !7, size: 32, elements: !933)
!936 = distinct !DISubprogram(name: "xpalloc", scope: !921, file: !921, line: 223, type: !937, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !920, retainedNodes: !940)
!937 = !DISubroutineType(types: !938)
!938 = !{!40, !40, !939, !278, !280, !278}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949}
!941 = !DILocalVariable(name: "pa", arg: 1, scope: !936, file: !921, line: 223, type: !40)
!942 = !DILocalVariable(name: "pn", arg: 2, scope: !936, file: !921, line: 223, type: !939)
!943 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !936, file: !921, line: 223, type: !278)
!944 = !DILocalVariable(name: "n_max", arg: 4, scope: !936, file: !921, line: 223, type: !280)
!945 = !DILocalVariable(name: "s", arg: 5, scope: !936, file: !921, line: 223, type: !278)
!946 = !DILocalVariable(name: "n0", scope: !936, file: !921, line: 230, type: !278)
!947 = !DILocalVariable(name: "n", scope: !936, file: !921, line: 237, type: !278)
!948 = !DILocalVariable(name: "nbytes", scope: !936, file: !921, line: 248, type: !278)
!949 = !DILocalVariable(name: "adjusted_nbytes", scope: !936, file: !921, line: 252, type: !278)
!950 = !{!38, !40, !54, !70, !45}
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !952, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!952 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!954 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!958 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !963, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!963 = !{!54, !45, !40}
!964 = distinct !DICompileUnit(language: DW_LANG_C99, file: !965, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!965 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !895, splitDebugInlining: false, nameTableKind: None)
!969 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!970 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!971 = !{i32 7, !"Dwarf Version", i32 5}
!972 = !{i32 2, !"Debug Info Version", i32 3}
!973 = !{i32 1, !"wchar_size", i32 4}
!974 = !{i32 1, !"branch-target-enforcement", i32 0}
!975 = !{i32 1, !"sign-return-address", i32 0}
!976 = !{i32 1, !"sign-return-address-all", i32 0}
!977 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!978 = !{i32 7, !"PIC Level", i32 2}
!979 = !{i32 7, !"PIE Level", i32 2}
!980 = !{i32 7, !"uwtable", i32 1}
!981 = !{i32 7, !"frame-pointer", i32 1}
!982 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 210, type: !983, scopeLine: 211, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !985)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !41}
!985 = !{!986}
!986 = !DILocalVariable(name: "status", arg: 1, scope: !982, file: !3, line: 210, type: !41)
!987 = !DILocation(line: 0, scope: !982)
!988 = !DILocation(line: 212, column: 14, scope: !989)
!989 = distinct !DILexicalBlock(scope: !982, file: !3, line: 212, column: 7)
!990 = !DILocation(line: 212, column: 7, scope: !982)
!991 = !DILocation(line: 213, column: 5, scope: !992)
!992 = distinct !DILexicalBlock(scope: !989, file: !3, line: 213, column: 5)
!993 = !{!994, !994, i64 0}
!994 = !{!"any pointer", !995, i64 0}
!995 = !{!"omnipotent char", !996, i64 0}
!996 = !{!"Simple C/C++ TBAA"}
!997 = !DILocation(line: 216, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !989, file: !3, line: 215, column: 5)
!999 = !DILocation(line: 217, column: 7, scope: !998)
!1000 = !DILocation(line: 736, column: 3, scope: !1001, inlinedAt: !1003)
!1001 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !80, file: !80, line: 734, type: !204, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1002)
!1002 = !{}
!1003 = distinct !DILocation(line: 227, column: 7, scope: !998)
!1004 = !DILocation(line: 229, column: 7, scope: !998)
!1005 = !DILocation(line: 233, column: 7, scope: !998)
!1006 = !DILocation(line: 237, column: 7, scope: !998)
!1007 = !DILocation(line: 241, column: 7, scope: !998)
!1008 = !DILocation(line: 245, column: 7, scope: !998)
!1009 = !DILocation(line: 250, column: 7, scope: !998)
!1010 = !DILocation(line: 254, column: 7, scope: !998)
!1011 = !DILocation(line: 258, column: 7, scope: !998)
!1012 = !DILocation(line: 263, column: 7, scope: !998)
!1013 = !DILocation(line: 269, column: 7, scope: !998)
!1014 = !DILocation(line: 270, column: 7, scope: !998)
!1015 = !DILocalVariable(name: "program", arg: 1, scope: !1016, file: !80, line: 836, type: !46)
!1016 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !80, file: !80, line: 836, type: !1017, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1019)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{null, !46}
!1019 = !{!1015, !1020, !1028, !1029, !1031, !1032}
!1020 = !DILocalVariable(name: "infomap", scope: !1016, file: !80, line: 838, type: !1021)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 896, elements: !1027)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1016, file: !80, line: 838, size: 128, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1023, file: !80, line: 838, baseType: !46, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1023, file: !80, line: 838, baseType: !46, size: 64, offset: 64)
!1027 = !{!639}
!1028 = !DILocalVariable(name: "node", scope: !1016, file: !80, line: 848, type: !46)
!1029 = !DILocalVariable(name: "map_prog", scope: !1016, file: !80, line: 849, type: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1031 = !DILocalVariable(name: "lc_messages", scope: !1016, file: !80, line: 861, type: !46)
!1032 = !DILocalVariable(name: "url_program", scope: !1016, file: !80, line: 874, type: !46)
!1033 = !DILocation(line: 0, scope: !1016, inlinedAt: !1034)
!1034 = distinct !DILocation(line: 271, column: 7, scope: !998)
!1035 = !DILocation(line: 838, column: 3, scope: !1016, inlinedAt: !1034)
!1036 = !DILocation(line: 838, column: 67, scope: !1016, inlinedAt: !1034)
!1037 = !DILocation(line: 849, column: 36, scope: !1016, inlinedAt: !1034)
!1038 = !DILocation(line: 851, column: 3, scope: !1016, inlinedAt: !1034)
!1039 = !DILocalVariable(name: "__s1", arg: 1, scope: !1040, file: !1041, line: 1359, type: !46)
!1040 = distinct !DISubprogram(name: "streq", scope: !1041, file: !1041, line: 1359, type: !1042, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1044)
!1041 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!54, !46, !46}
!1044 = !{!1039, !1045}
!1045 = !DILocalVariable(name: "__s2", arg: 2, scope: !1040, file: !1041, line: 1359, type: !46)
!1046 = !DILocation(line: 0, scope: !1040, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 851, column: 33, scope: !1016, inlinedAt: !1034)
!1048 = !DILocation(line: 1361, column: 11, scope: !1040, inlinedAt: !1047)
!1049 = !DILocation(line: 1361, column: 10, scope: !1040, inlinedAt: !1047)
!1050 = !DILocation(line: 852, column: 13, scope: !1016, inlinedAt: !1034)
!1051 = !DILocation(line: 851, column: 20, scope: !1016, inlinedAt: !1034)
!1052 = !{!1053, !994, i64 0}
!1053 = !{!"infomap", !994, i64 0, !994, i64 8}
!1054 = !DILocation(line: 851, column: 10, scope: !1016, inlinedAt: !1034)
!1055 = !DILocation(line: 851, column: 28, scope: !1016, inlinedAt: !1034)
!1056 = distinct !{!1056, !1038, !1050, !1057}
!1057 = !{!"llvm.loop.mustprogress"}
!1058 = !DILocation(line: 854, column: 17, scope: !1059, inlinedAt: !1034)
!1059 = distinct !DILexicalBlock(scope: !1016, file: !80, line: 854, column: 7)
!1060 = !{!1053, !994, i64 8}
!1061 = !DILocation(line: 854, column: 7, scope: !1059, inlinedAt: !1034)
!1062 = !DILocation(line: 854, column: 7, scope: !1016, inlinedAt: !1034)
!1063 = !DILocation(line: 857, column: 3, scope: !1016, inlinedAt: !1034)
!1064 = !DILocation(line: 861, column: 29, scope: !1016, inlinedAt: !1034)
!1065 = !DILocation(line: 862, column: 7, scope: !1066, inlinedAt: !1034)
!1066 = distinct !DILexicalBlock(scope: !1016, file: !80, line: 862, column: 7)
!1067 = !DILocation(line: 862, column: 19, scope: !1066, inlinedAt: !1034)
!1068 = !DILocation(line: 862, column: 22, scope: !1066, inlinedAt: !1034)
!1069 = !DILocation(line: 862, column: 7, scope: !1016, inlinedAt: !1034)
!1070 = !DILocation(line: 868, column: 7, scope: !1071, inlinedAt: !1034)
!1071 = distinct !DILexicalBlock(scope: !1066, file: !80, line: 863, column: 5)
!1072 = !DILocation(line: 870, column: 5, scope: !1071, inlinedAt: !1034)
!1073 = !DILocation(line: 0, scope: !1040, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 874, column: 29, scope: !1016, inlinedAt: !1034)
!1075 = !DILocation(line: 875, column: 3, scope: !1016, inlinedAt: !1034)
!1076 = !DILocation(line: 877, column: 3, scope: !1016, inlinedAt: !1034)
!1077 = !DILocation(line: 879, column: 1, scope: !1016, inlinedAt: !1034)
!1078 = !DILocation(line: 273, column: 3, scope: !982)
