; ModuleID = 'src/true.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating success.\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"true\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !31, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !38)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !28, globals: !37, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/true.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ce7e4fa94fdaa872b3d469aaea1081c9")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !{!29, !30, !31, !32, !33, !6, !36}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 46, baseType: !35)
!34 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!35 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!37 = !{!0}
!38 = !{!39, !40, !41, !44, !46, !47, !48, !52, !53, !54, !55, !57, !113, !114, !115, !117, !118}
!39 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!40 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!41 = !DILocalVariable(name: "term", scope: !42, file: !3, line: 585, type: !6)
!42 = distinct !DILexicalBlock(scope: !43, file: !3, line: 582, column: 5)
!43 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!44 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !45)
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!47 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!48 = !DILocalVariable(name: "s", scope: !49, file: !3, line: 608, type: !6)
!49 = distinct !DILexicalBlock(scope: !50, file: !3, line: 605, column: 5)
!50 = distinct !DILexicalBlock(scope: !51, file: !3, line: 604, column: 12)
!51 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!52 = !DILocalVariable(name: "spaces", scope: !49, file: !3, line: 609, type: !33)
!53 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !33)
!54 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!55 = !DILocalVariable(name: "__ptr", scope: !56, file: !3, line: 644, type: !6)
!56 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!57 = !DILocalVariable(name: "__stream", scope: !56, file: !3, line: 644, type: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 7, baseType: !61)
!60 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !63)
!62 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !88, !90, !94, !97, !99, !102, !105, !106, !107, !108, !109}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 51, baseType: !31, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 54, baseType: !29, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 55, baseType: !29, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 56, baseType: !29, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 57, baseType: !29, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 58, baseType: !29, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 59, baseType: !29, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 60, baseType: !29, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 61, baseType: !29, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 64, baseType: !29, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 65, baseType: !29, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 66, baseType: !29, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 72, baseType: !31, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 73, baseType: !31, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!86 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 77, baseType: !32, size: 16, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!89 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 1)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 43, baseType: null)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !61, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !62, line: 37, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !61, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !62, line: 38, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !61, file: !62, line: 93, baseType: !80, size: 64, offset: 1344)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !61, file: !62, line: 94, baseType: !30, size: 64, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 95, baseType: !33, size: 64, offset: 1472)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 96, baseType: !31, size: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 98, baseType: !110, size: 160, offset: 1568)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 20)
!113 = !DILocalVariable(name: "__cnt", scope: !56, file: !3, line: 644, type: !33)
!114 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!115 = !DILocalVariable(name: "__ptr", scope: !116, file: !3, line: 686, type: !6)
!116 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!117 = !DILocalVariable(name: "__stream", scope: !116, file: !3, line: 686, type: !58)
!118 = !DILocalVariable(name: "__cnt", scope: !116, file: !3, line: 686, type: !33)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "Version", scope: !121, file: !122, line: 3, type: !6, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !123, splitDebugInlining: false, nameTableKind: None)
!122 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!123 = !{!119}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "file_name", scope: !126, file: !127, line: 45, type: !6, isLocal: true, isDefinition: true)
!126 = distinct !DICompileUnit(language: DW_LANG_C99, file: !127, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !128, splitDebugInlining: false, nameTableKind: None)
!127 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!128 = !{!124, !129}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !126, file: !127, line: 55, type: !45, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !133, file: !134, line: 66, type: !169, isLocal: false, isDefinition: true)
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !135, globals: !136, splitDebugInlining: false, nameTableKind: None)
!134 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!135 = !{!30, !36}
!136 = !{!137, !163, !131, !165, !167}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "old_file_name", scope: !139, file: !134, line: 304, type: !6, isLocal: true, isDefinition: true)
!139 = distinct !DISubprogram(name: "verror_at_line", scope: !134, file: !134, line: 298, type: !140, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !156)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !31, !31, !6, !14, !6, !142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !143, line: 52, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !145, line: 32, baseType: !146)
!145 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !147, baseType: !148)
!147 = !DIFile(filename: "lib/error.c", directory: "/src")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !149, size: 256, elements: !150)
!149 = !DINamespace(name: "std", scope: null)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !148, file: !147, baseType: !30, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !148, file: !147, baseType: !30, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !148, file: !147, baseType: !30, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !148, file: !147, baseType: !31, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !148, file: !147, baseType: !31, size: 32, offset: 224)
!156 = !{!157, !158, !159, !160, !161, !162}
!157 = !DILocalVariable(name: "status", arg: 1, scope: !139, file: !134, line: 298, type: !31)
!158 = !DILocalVariable(name: "errnum", arg: 2, scope: !139, file: !134, line: 298, type: !31)
!159 = !DILocalVariable(name: "file_name", arg: 3, scope: !139, file: !134, line: 298, type: !6)
!160 = !DILocalVariable(name: "line_number", arg: 4, scope: !139, file: !134, line: 298, type: !14)
!161 = !DILocalVariable(name: "message", arg: 5, scope: !139, file: !134, line: 298, type: !6)
!162 = !DILocalVariable(name: "args", arg: 6, scope: !139, file: !134, line: 298, type: !142)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "old_line_number", scope: !139, file: !134, line: 305, type: !14, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "error_message_count", scope: !133, file: !134, line: 69, type: !14, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !133, file: !134, line: 295, type: !31, isLocal: false, isDefinition: true)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "program_name", scope: !174, file: !175, line: 31, type: !6, isLocal: false, isDefinition: true)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !176, globals: !177, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!176 = !{!29}
!177 = !{!172}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "utf07FF", scope: !180, file: !181, line: 46, type: !211, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "proper_name_lite", scope: !181, file: !181, line: 38, type: !182, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !184, retainedNodes: !186)
!181 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!182 = !DISubroutineType(types: !183)
!183 = !{!6, !6, !6}
!184 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !185, splitDebugInlining: false, nameTableKind: None)
!185 = !{!178}
!186 = !{!187, !188, !189, !190, !195}
!187 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !180, file: !181, line: 38, type: !6)
!188 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !180, file: !181, line: 38, type: !6)
!189 = !DILocalVariable(name: "translation", scope: !180, file: !181, line: 40, type: !6)
!190 = !DILocalVariable(name: "w", scope: !180, file: !181, line: 47, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !192, line: 37, baseType: !193)
!192 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !85, line: 57, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !85, line: 42, baseType: !14)
!195 = !DILocalVariable(name: "mbs", scope: !180, file: !181, line: 48, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !197, line: 6, baseType: !198)
!197 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !199, line: 21, baseType: !200)
!199 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 13, size: 64, elements: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !200, file: !199, line: 15, baseType: !31, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !200, file: !199, line: 20, baseType: !204, size: 32, offset: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !200, file: !199, line: 16, size: 32, elements: !205)
!205 = !{!206, !207}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !204, file: !199, line: 18, baseType: !14, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !204, file: !199, line: 19, baseType: !208, size: 32)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 2)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !216, file: !217, line: 76, type: !299, isLocal: false, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !218, retainedTypes: !238, globals: !239, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!218 = !{!219, !233, !12}
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !220, line: 42, baseType: !14, size: 32, elements: !221)
!220 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!222 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!223 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!224 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!225 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!226 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!227 = !DIEnumerator(name: "c_quoting_style", value: 5)
!228 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!229 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!230 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!231 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!232 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !220, line: 254, baseType: !14, size: 32, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!236 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!237 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!238 = !{!31, !32, !33}
!239 = !{!214, !240, !246, !258, !260, !265, !288, !295, !297}
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !216, file: !217, line: 92, type: !242, isLocal: false, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 320, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!244 = !{!245}
!245 = !DISubrange(count: 10)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !216, file: !217, line: 1040, type: !248, isLocal: false, isDefinition: true)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !217, line: 56, size: 448, elements: !249)
!249 = !{!250, !251, !252, !256, !257}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !248, file: !217, line: 59, baseType: !219, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !217, line: 62, baseType: !31, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !248, file: !217, line: 66, baseType: !253, size: 256, offset: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 8)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !248, file: !217, line: 69, baseType: !6, size: 64, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !248, file: !217, line: 72, baseType: !6, size: 64, offset: 384)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !216, file: !217, line: 107, type: !248, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "slot0", scope: !216, file: !217, line: 831, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 256)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quote", scope: !267, file: !217, line: 228, type: !286, isLocal: true, isDefinition: true)
!267 = distinct !DISubprogram(name: "gettext_quote", scope: !217, file: !217, line: 197, type: !268, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !270)
!268 = !DISubroutineType(types: !269)
!269 = !{!6, !6, !219}
!270 = !{!271, !272, !273, !274, !275}
!271 = !DILocalVariable(name: "msgid", arg: 1, scope: !267, file: !217, line: 197, type: !6)
!272 = !DILocalVariable(name: "s", arg: 2, scope: !267, file: !217, line: 197, type: !219)
!273 = !DILocalVariable(name: "translation", scope: !267, file: !217, line: 199, type: !6)
!274 = !DILocalVariable(name: "w", scope: !267, file: !217, line: 229, type: !191)
!275 = !DILocalVariable(name: "mbs", scope: !267, file: !217, line: 230, type: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !197, line: 6, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !199, line: 21, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 13, size: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !278, file: !199, line: 15, baseType: !31, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !278, file: !199, line: 20, baseType: !282, size: 32, offset: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !278, file: !199, line: 16, size: 32, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !282, file: !199, line: 18, baseType: !14, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !282, file: !199, line: 19, baseType: !208, size: 32)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !287)
!287 = !{!213, !210}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "slotvec", scope: !216, file: !217, line: 834, type: !290, isLocal: true, isDefinition: true)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !217, line: 823, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !291, file: !217, line: 825, baseType: !33, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !291, file: !217, line: 826, baseType: !29, size: 64, offset: 64)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "nslots", scope: !216, file: !217, line: 832, type: !31, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "slotvec0", scope: !216, file: !217, line: 833, type: !291, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 704, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!301 = !{!302}
!302 = !DISubrange(count: 11)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !305, file: !306, line: 26, type: !308, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !307, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!307 = !{!303}
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 47)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "exit_failure", scope: !313, file: !314, line: 24, type: !316, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !315, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!315 = !{!311}
!316 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "internal_state", scope: !319, file: !320, line: 97, type: !323, isLocal: true, isDefinition: true)
!319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !320, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!320 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!321 = !{!30, !33, !36}
!322 = !{!317}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !197, line: 6, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !199, line: 21, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 13, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !325, file: !199, line: 15, baseType: !31, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !325, file: !199, line: 20, baseType: !329, size: 32, offset: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !199, line: 16, size: 32, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !329, file: !199, line: 18, baseType: !14, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !329, file: !199, line: 19, baseType: !208, size: 32)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !337, retainedTypes: !341, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!337 = !{!338}
!338 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !336, line: 40, baseType: !14, size: 32, elements: !339)
!339 = !{!340}
!340 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!341 = !{!30}
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !375, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!344 = !{!345, !357}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !346, file: !343, line: 188, baseType: !14, size: 32, elements: !355)
!346 = distinct !DISubprogram(name: "x2nrealloc", scope: !343, file: !343, line: 176, type: !347, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !350)
!347 = !DISubroutineType(types: !348)
!348 = !{!30, !30, !349, !33}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!350 = !{!351, !352, !353, !354}
!351 = !DILocalVariable(name: "p", arg: 1, scope: !346, file: !343, line: 176, type: !30)
!352 = !DILocalVariable(name: "pn", arg: 2, scope: !346, file: !343, line: 176, type: !349)
!353 = !DILocalVariable(name: "s", arg: 3, scope: !346, file: !343, line: 176, type: !33)
!354 = !DILocalVariable(name: "n", scope: !346, file: !343, line: 178, type: !33)
!355 = !{!356}
!356 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !358, file: !343, line: 228, baseType: !14, size: 32, elements: !355)
!358 = distinct !DISubprogram(name: "xpalloc", scope: !343, file: !343, line: 223, type: !359, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !365)
!359 = !DISubroutineType(types: !360)
!360 = !{!30, !30, !361, !362, !364, !362}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !363, line: 130, baseType: !364)
!363 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !34, line: 35, baseType: !86)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374}
!366 = !DILocalVariable(name: "pa", arg: 1, scope: !358, file: !343, line: 223, type: !30)
!367 = !DILocalVariable(name: "pn", arg: 2, scope: !358, file: !343, line: 223, type: !361)
!368 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !358, file: !343, line: 223, type: !362)
!369 = !DILocalVariable(name: "n_max", arg: 4, scope: !358, file: !343, line: 223, type: !364)
!370 = !DILocalVariable(name: "s", arg: 5, scope: !358, file: !343, line: 223, type: !362)
!371 = !DILocalVariable(name: "n0", scope: !358, file: !343, line: 230, type: !362)
!372 = !DILocalVariable(name: "n", scope: !358, file: !343, line: 237, type: !362)
!373 = !DILocalVariable(name: "nbytes", scope: !358, file: !343, line: 248, type: !362)
!374 = !DILocalVariable(name: "adjusted_nbytes", scope: !358, file: !343, line: 252, type: !362)
!375 = !{!29, !30, !45, !86, !35}
!376 = distinct !DICompileUnit(language: DW_LANG_C99, file: !377, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!377 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !341, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !341, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !388, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!388 = !{!45, !35, !30}
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!391 = distinct !DICompileUnit(language: DW_LANG_C99, file: !392, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!392 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!393 = distinct !DICompileUnit(language: DW_LANG_C99, file: !394, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !341, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!395 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!396 = !{i32 7, !"Dwarf Version", i32 5}
!397 = !{i32 2, !"Debug Info Version", i32 3}
!398 = !{i32 1, !"wchar_size", i32 4}
!399 = !{i32 1, !"branch-target-enforcement", i32 0}
!400 = !{i32 1, !"sign-return-address", i32 0}
!401 = !{i32 1, !"sign-return-address-all", i32 0}
!402 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!403 = !{i32 7, !"PIC Level", i32 2}
!404 = !{i32 7, !"PIE Level", i32 2}
!405 = !{i32 7, !"uwtable", i32 1}
!406 = !{i32 7, !"frame-pointer", i32 1}
!407 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 36, type: !408, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !31}
!410 = !{!411}
!411 = !DILocalVariable(name: "status", arg: 1, scope: !407, file: !10, line: 36, type: !31)
!412 = !DILocation(line: 0, scope: !407)
!413 = !DILocation(line: 38, column: 3, scope: !407)
!414 = !{!415, !415, i64 0}
!415 = !{!"any pointer", !416, i64 0}
!416 = !{!"omnipotent char", !417, i64 0}
!417 = !{!"Simple C/C++ TBAA"}
!418 = !DILocation(line: 43, column: 3, scope: !407)
!419 = !DILocation(line: 47, column: 3, scope: !407)
!420 = !DILocation(line: 48, column: 3, scope: !407)
!421 = !DILocation(line: 49, column: 3, scope: !407)
!422 = !DILocation(line: 50, column: 3, scope: !407)
!423 = !DILocation(line: 51, column: 3, scope: !407)
!424 = !DISubprogram(name: "dcgettext", scope: !425, file: !425, line: 51, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!425 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!426 = !DISubroutineType(types: !427)
!427 = !{!29, !6, !6, !31}
!428 = !{}
!429 = !DILocation(line: 0, scope: !2)
!430 = !DILocation(line: 581, column: 7, scope: !43)
!431 = !{!432, !432, i64 0}
!432 = !{!"int", !416, i64 0}
!433 = !DILocation(line: 581, column: 19, scope: !43)
!434 = !DILocation(line: 581, column: 7, scope: !2)
!435 = !DILocation(line: 585, column: 26, scope: !42)
!436 = !DILocation(line: 0, scope: !42)
!437 = !DILocation(line: 586, column: 23, scope: !42)
!438 = !DILocation(line: 586, column: 28, scope: !42)
!439 = !DILocation(line: 586, column: 32, scope: !42)
!440 = !{!416, !416, i64 0}
!441 = !DILocation(line: 586, column: 38, scope: !42)
!442 = !DILocalVariable(name: "__s1", arg: 1, scope: !443, file: !444, line: 1359, type: !6)
!443 = distinct !DISubprogram(name: "streq", scope: !444, file: !444, line: 1359, type: !445, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !447)
!444 = !DIFile(filename: "./lib/string.h", directory: "/src")
!445 = !DISubroutineType(types: !446)
!446 = !{!45, !6, !6}
!447 = !{!442, !448}
!448 = !DILocalVariable(name: "__s2", arg: 2, scope: !443, file: !444, line: 1359, type: !6)
!449 = !DILocation(line: 0, scope: !443, inlinedAt: !450)
!450 = distinct !DILocation(line: 586, column: 41, scope: !42)
!451 = !DILocation(line: 1361, column: 11, scope: !443, inlinedAt: !450)
!452 = !DILocation(line: 1361, column: 10, scope: !443, inlinedAt: !450)
!453 = !DILocation(line: 586, column: 19, scope: !42)
!454 = !DILocation(line: 587, column: 5, scope: !42)
!455 = !DILocation(line: 588, column: 7, scope: !456)
!456 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!457 = !DILocation(line: 588, column: 7, scope: !2)
!458 = !DILocation(line: 590, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !456, file: !3, line: 589, column: 5)
!460 = !DILocation(line: 591, column: 7, scope: !459)
!461 = !DILocation(line: 595, column: 37, scope: !2)
!462 = !DILocation(line: 595, column: 35, scope: !2)
!463 = !DILocation(line: 596, column: 29, scope: !2)
!464 = !DILocation(line: 597, column: 8, scope: !51)
!465 = !DILocation(line: 597, column: 7, scope: !2)
!466 = !DILocation(line: 604, column: 24, scope: !50)
!467 = !DILocation(line: 604, column: 12, scope: !51)
!468 = !DILocation(line: 0, scope: !49)
!469 = !DILocation(line: 610, column: 16, scope: !49)
!470 = !DILocation(line: 610, column: 7, scope: !49)
!471 = !DILocation(line: 611, column: 21, scope: !49)
!472 = !{!473, !473, i64 0}
!473 = !{!"short", !416, i64 0}
!474 = !DILocation(line: 611, column: 19, scope: !49)
!475 = !DILocation(line: 611, column: 16, scope: !49)
!476 = !DILocation(line: 610, column: 30, scope: !49)
!477 = distinct !{!477, !470, !471, !478}
!478 = !{!"llvm.loop.mustprogress"}
!479 = !DILocation(line: 612, column: 18, scope: !480)
!480 = distinct !DILexicalBlock(scope: !49, file: !3, line: 612, column: 11)
!481 = !DILocation(line: 612, column: 11, scope: !49)
!482 = !DILocation(line: 620, column: 23, scope: !2)
!483 = !DILocation(line: 625, column: 39, scope: !2)
!484 = !DILocation(line: 626, column: 3, scope: !2)
!485 = !DILocation(line: 626, column: 10, scope: !2)
!486 = !DILocation(line: 626, column: 21, scope: !2)
!487 = !DILocation(line: 628, column: 44, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !3, line: 628, column: 11)
!489 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!490 = !DILocation(line: 628, column: 32, scope: !488)
!491 = !DILocation(line: 628, column: 49, scope: !488)
!492 = !DILocation(line: 628, column: 11, scope: !489)
!493 = !DILocation(line: 630, column: 11, scope: !494)
!494 = distinct !DILexicalBlock(scope: !489, file: !3, line: 630, column: 11)
!495 = !DILocation(line: 630, column: 11, scope: !489)
!496 = !DILocation(line: 632, column: 26, scope: !497)
!497 = distinct !DILexicalBlock(scope: !498, file: !3, line: 632, column: 15)
!498 = distinct !DILexicalBlock(scope: !494, file: !3, line: 631, column: 9)
!499 = !DILocation(line: 632, column: 34, scope: !497)
!500 = !DILocation(line: 632, column: 37, scope: !497)
!501 = !DILocation(line: 632, column: 15, scope: !498)
!502 = !DILocation(line: 636, column: 29, scope: !503)
!503 = distinct !DILexicalBlock(scope: !498, file: !3, line: 636, column: 15)
!504 = !DILocation(line: 640, column: 16, scope: !489)
!505 = distinct !{!505, !484, !506, !478}
!506 = !DILocation(line: 641, column: 5, scope: !2)
!507 = !DILocation(line: 644, column: 3, scope: !2)
!508 = !DILocation(line: 0, scope: !443, inlinedAt: !509)
!509 = distinct !DILocation(line: 648, column: 31, scope: !2)
!510 = !DILocation(line: 0, scope: !443, inlinedAt: !511)
!511 = distinct !DILocation(line: 649, column: 31, scope: !2)
!512 = !DILocation(line: 0, scope: !443, inlinedAt: !513)
!513 = distinct !DILocation(line: 650, column: 31, scope: !2)
!514 = !DILocation(line: 0, scope: !443, inlinedAt: !515)
!515 = distinct !DILocation(line: 651, column: 31, scope: !2)
!516 = !DILocation(line: 0, scope: !443, inlinedAt: !517)
!517 = distinct !DILocation(line: 652, column: 31, scope: !2)
!518 = !DILocation(line: 0, scope: !443, inlinedAt: !519)
!519 = distinct !DILocation(line: 653, column: 31, scope: !2)
!520 = !DILocation(line: 0, scope: !443, inlinedAt: !521)
!521 = distinct !DILocation(line: 654, column: 31, scope: !2)
!522 = !DILocation(line: 0, scope: !443, inlinedAt: !523)
!523 = distinct !DILocation(line: 655, column: 31, scope: !2)
!524 = !DILocation(line: 0, scope: !443, inlinedAt: !525)
!525 = distinct !DILocation(line: 656, column: 31, scope: !2)
!526 = !DILocation(line: 0, scope: !443, inlinedAt: !527)
!527 = distinct !DILocation(line: 657, column: 31, scope: !2)
!528 = !DILocation(line: 663, column: 7, scope: !529)
!529 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!530 = !DILocation(line: 664, column: 7, scope: !529)
!531 = !DILocation(line: 664, column: 10, scope: !529)
!532 = !DILocation(line: 663, column: 7, scope: !2)
!533 = !DILocation(line: 669, column: 7, scope: !534)
!534 = distinct !DILexicalBlock(scope: !529, file: !3, line: 665, column: 5)
!535 = !DILocation(line: 671, column: 5, scope: !534)
!536 = !DILocation(line: 676, column: 7, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !3, line: 673, column: 5)
!538 = !DILocation(line: 679, column: 3, scope: !2)
!539 = !DILocation(line: 683, column: 3, scope: !2)
!540 = !DILocation(line: 686, column: 3, scope: !2)
!541 = !DILocation(line: 688, column: 3, scope: !2)
!542 = !DILocation(line: 691, column: 3, scope: !2)
!543 = !DILocation(line: 695, column: 3, scope: !2)
!544 = !DILocation(line: 696, column: 1, scope: !2)
!545 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !546, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !548)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !6}
!548 = !{!549, !550, !559, !560, !562, !563}
!549 = !DILocalVariable(name: "program", arg: 1, scope: !545, file: !3, line: 836, type: !6)
!550 = !DILocalVariable(name: "infomap", scope: !545, file: !3, line: 838, type: !551)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 896, elements: !557)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !545, file: !3, line: 838, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !553, file: !3, line: 838, baseType: !6, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !553, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!557 = !{!558}
!558 = !DISubrange(count: 7)
!559 = !DILocalVariable(name: "node", scope: !545, file: !3, line: 848, type: !6)
!560 = !DILocalVariable(name: "map_prog", scope: !545, file: !3, line: 849, type: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!562 = !DILocalVariable(name: "lc_messages", scope: !545, file: !3, line: 861, type: !6)
!563 = !DILocalVariable(name: "url_program", scope: !545, file: !3, line: 874, type: !6)
!564 = !DILocation(line: 0, scope: !545)
!565 = !DILocation(line: 838, column: 3, scope: !545)
!566 = !DILocation(line: 838, column: 67, scope: !545)
!567 = !DILocation(line: 849, column: 36, scope: !545)
!568 = !DILocation(line: 851, column: 3, scope: !545)
!569 = !DILocation(line: 0, scope: !443, inlinedAt: !570)
!570 = distinct !DILocation(line: 851, column: 33, scope: !545)
!571 = !DILocation(line: 1361, column: 11, scope: !443, inlinedAt: !570)
!572 = !DILocation(line: 1361, column: 10, scope: !443, inlinedAt: !570)
!573 = !DILocation(line: 852, column: 13, scope: !545)
!574 = !DILocation(line: 851, column: 20, scope: !545)
!575 = !{!576, !415, i64 0}
!576 = !{!"infomap", !415, i64 0, !415, i64 8}
!577 = !DILocation(line: 851, column: 10, scope: !545)
!578 = !DILocation(line: 851, column: 28, scope: !545)
!579 = distinct !{!579, !568, !573, !478}
!580 = !DILocation(line: 854, column: 17, scope: !581)
!581 = distinct !DILexicalBlock(scope: !545, file: !3, line: 854, column: 7)
!582 = !{!576, !415, i64 8}
!583 = !DILocation(line: 854, column: 7, scope: !581)
!584 = !DILocation(line: 854, column: 7, scope: !545)
!585 = !DILocation(line: 857, column: 3, scope: !545)
!586 = !DILocation(line: 861, column: 29, scope: !545)
!587 = !DILocation(line: 862, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !545, file: !3, line: 862, column: 7)
!589 = !DILocation(line: 862, column: 19, scope: !588)
!590 = !DILocation(line: 862, column: 22, scope: !588)
!591 = !DILocation(line: 862, column: 7, scope: !545)
!592 = !DILocation(line: 868, column: 7, scope: !593)
!593 = distinct !DILexicalBlock(scope: !588, file: !3, line: 863, column: 5)
!594 = !DILocation(line: 870, column: 5, scope: !593)
!595 = !DILocation(line: 0, scope: !443, inlinedAt: !596)
!596 = distinct !DILocation(line: 874, column: 29, scope: !545)
!597 = !DILocation(line: 875, column: 3, scope: !545)
!598 = !DILocation(line: 877, column: 3, scope: !545)
!599 = !DILocation(line: 879, column: 1, scope: !545)
!600 = !DISubprogram(name: "setlocale", scope: !601, file: !601, line: 122, type: !602, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!601 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!602 = !DISubroutineType(types: !603)
!603 = !{!29, !31, !6}
!604 = !DISubprogram(name: "fputs_unlocked", scope: !143, file: !143, line: 691, type: !605, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!605 = !DISubroutineType(types: !606)
!606 = !{!31, !607, !608}
!607 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!608 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !58)
!609 = !DISubprogram(name: "getenv", scope: !610, file: !610, line: 641, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!610 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!611 = !DISubroutineType(types: !612)
!612 = !{!29, !6}
!613 = !DISubprogram(name: "fwrite_unlocked", scope: !143, file: !143, line: 704, type: !614, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!614 = !DISubroutineType(types: !615)
!615 = !{!33, !616, !33, !33, !608}
!616 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!619 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 55, type: !620, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !623)
!620 = !DISubroutineType(types: !621)
!621 = !{!31, !31, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!623 = !{!624, !625}
!624 = !DILocalVariable(name: "argc", arg: 1, scope: !619, file: !10, line: 55, type: !31)
!625 = !DILocalVariable(name: "argv", arg: 2, scope: !619, file: !10, line: 55, type: !622)
!626 = !DILocation(line: 0, scope: !619)
!627 = !DILocation(line: 59, column: 12, scope: !628)
!628 = distinct !DILexicalBlock(scope: !619, file: !10, line: 59, column: 7)
!629 = !DILocation(line: 59, column: 7, scope: !619)
!630 = !DILocation(line: 62, column: 25, scope: !631)
!631 = distinct !DILexicalBlock(scope: !628, file: !10, line: 60, column: 5)
!632 = !DILocation(line: 62, column: 7, scope: !631)
!633 = !DILocation(line: 63, column: 7, scope: !631)
!634 = !DILocation(line: 64, column: 7, scope: !631)
!635 = !DILocation(line: 65, column: 7, scope: !631)
!636 = !DILocation(line: 69, column: 7, scope: !631)
!637 = !DILocation(line: 71, column: 18, scope: !638)
!638 = distinct !DILexicalBlock(scope: !631, file: !10, line: 71, column: 11)
!639 = !DILocation(line: 0, scope: !443, inlinedAt: !640)
!640 = distinct !DILocation(line: 71, column: 11, scope: !638)
!641 = !DILocation(line: 1361, column: 11, scope: !443, inlinedAt: !640)
!642 = !DILocation(line: 1361, column: 10, scope: !443, inlinedAt: !640)
!643 = !DILocation(line: 71, column: 11, scope: !631)
!644 = !DILocation(line: 72, column: 9, scope: !638)
!645 = !DILocation(line: 0, scope: !443, inlinedAt: !646)
!646 = distinct !DILocation(line: 74, column: 11, scope: !647)
!647 = distinct !DILexicalBlock(scope: !631, file: !10, line: 74, column: 11)
!648 = !DILocation(line: 1361, column: 11, scope: !443, inlinedAt: !646)
!649 = !DILocation(line: 1361, column: 10, scope: !443, inlinedAt: !646)
!650 = !DILocation(line: 74, column: 11, scope: !631)
!651 = !DILocation(line: 75, column: 22, scope: !647)
!652 = !DILocation(line: 75, column: 58, scope: !647)
!653 = !DILocation(line: 75, column: 67, scope: !647)
!654 = !DILocation(line: 75, column: 9, scope: !647)
!655 = !DILocation(line: 79, column: 3, scope: !619)
!656 = !DISubprogram(name: "bindtextdomain", scope: !425, file: !425, line: 86, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!657 = !DISubroutineType(types: !658)
!658 = !{!29, !6, !6}
!659 = !DISubprogram(name: "textdomain", scope: !425, file: !425, line: 82, type: !611, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!660 = !DISubprogram(name: "atexit", scope: !610, file: !610, line: 602, type: !661, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!661 = !DISubroutineType(types: !662)
!662 = !{!31, !169}
!663 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !127, file: !127, line: 50, type: !546, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !664)
!664 = !{!665}
!665 = !DILocalVariable(name: "file", arg: 1, scope: !663, file: !127, line: 50, type: !6)
!666 = !DILocation(line: 0, scope: !663)
!667 = !DILocation(line: 52, column: 13, scope: !663)
!668 = !DILocation(line: 53, column: 1, scope: !663)
!669 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !127, file: !127, line: 87, type: !670, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !45}
!672 = !{!673}
!673 = !DILocalVariable(name: "ignore", arg: 1, scope: !669, file: !127, line: 87, type: !45)
!674 = !DILocation(line: 0, scope: !669)
!675 = !DILocation(line: 89, column: 16, scope: !669)
!676 = !{!677, !677, i64 0}
!677 = !{!"_Bool", !416, i64 0}
!678 = !DILocation(line: 90, column: 1, scope: !669)
!679 = distinct !DISubprogram(name: "close_stdout", scope: !127, file: !127, line: 116, type: !170, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !680)
!680 = !{!681}
!681 = !DILocalVariable(name: "write_error", scope: !682, file: !127, line: 121, type: !6)
!682 = distinct !DILexicalBlock(scope: !683, file: !127, line: 120, column: 5)
!683 = distinct !DILexicalBlock(scope: !679, file: !127, line: 118, column: 7)
!684 = !DILocation(line: 118, column: 21, scope: !683)
!685 = !DILocation(line: 118, column: 7, scope: !683)
!686 = !DILocation(line: 118, column: 29, scope: !683)
!687 = !DILocation(line: 119, column: 7, scope: !683)
!688 = !DILocation(line: 119, column: 12, scope: !683)
!689 = !{i8 0, i8 2}
!690 = !DILocation(line: 119, column: 25, scope: !683)
!691 = !DILocation(line: 119, column: 28, scope: !683)
!692 = !DILocation(line: 119, column: 34, scope: !683)
!693 = !DILocation(line: 118, column: 7, scope: !679)
!694 = !DILocation(line: 121, column: 33, scope: !682)
!695 = !DILocation(line: 0, scope: !682)
!696 = !DILocation(line: 122, column: 11, scope: !697)
!697 = distinct !DILexicalBlock(scope: !682, file: !127, line: 122, column: 11)
!698 = !DILocation(line: 0, scope: !697)
!699 = !DILocation(line: 122, column: 11, scope: !682)
!700 = !DILocation(line: 123, column: 9, scope: !697)
!701 = !DILocation(line: 126, column: 9, scope: !697)
!702 = !DILocation(line: 128, column: 14, scope: !682)
!703 = !DILocation(line: 128, column: 7, scope: !682)
!704 = !DILocation(line: 133, column: 42, scope: !705)
!705 = distinct !DILexicalBlock(scope: !679, file: !127, line: 133, column: 7)
!706 = !DILocation(line: 133, column: 28, scope: !705)
!707 = !DILocation(line: 133, column: 50, scope: !705)
!708 = !DILocation(line: 133, column: 7, scope: !679)
!709 = !DILocation(line: 134, column: 12, scope: !705)
!710 = !DILocation(line: 134, column: 5, scope: !705)
!711 = !DILocation(line: 135, column: 1, scope: !679)
!712 = distinct !DISubprogram(name: "verror", scope: !134, file: !134, line: 251, type: !713, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !715)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !31, !31, !6, !142}
!715 = !{!716, !717, !718, !719}
!716 = !DILocalVariable(name: "status", arg: 1, scope: !712, file: !134, line: 251, type: !31)
!717 = !DILocalVariable(name: "errnum", arg: 2, scope: !712, file: !134, line: 251, type: !31)
!718 = !DILocalVariable(name: "message", arg: 3, scope: !712, file: !134, line: 251, type: !6)
!719 = !DILocalVariable(name: "args", arg: 4, scope: !712, file: !134, line: 251, type: !142)
!720 = !DILocation(line: 0, scope: !712)
!721 = !DILocation(line: 251, column: 1, scope: !712)
!722 = !DILocation(line: 261, column: 3, scope: !712)
!723 = !DILocation(line: 265, column: 7, scope: !724)
!724 = distinct !DILexicalBlock(scope: !712, file: !134, line: 265, column: 7)
!725 = !DILocation(line: 265, column: 7, scope: !712)
!726 = !DILocation(line: 266, column: 5, scope: !724)
!727 = !DILocation(line: 272, column: 7, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !134, line: 268, column: 5)
!729 = !DILocation(line: 276, column: 3, scope: !712)
!730 = !{i64 0, i64 8, !414, i64 8, i64 8, !414, i64 16, i64 8, !414, i64 24, i64 4, !431, i64 28, i64 4, !431}
!731 = !DILocation(line: 282, column: 1, scope: !712)
!732 = distinct !DISubprogram(name: "flush_stdout", scope: !134, file: !134, line: 163, type: !170, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !733)
!733 = !{!734}
!734 = !DILocalVariable(name: "stdout_fd", scope: !732, file: !134, line: 166, type: !31)
!735 = !DILocation(line: 0, scope: !732)
!736 = !DILocalVariable(name: "fd", arg: 1, scope: !737, file: !134, line: 145, type: !31)
!737 = distinct !DISubprogram(name: "is_open", scope: !134, file: !134, line: 145, type: !738, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{!31, !31}
!740 = !{!736}
!741 = !DILocation(line: 0, scope: !737, inlinedAt: !742)
!742 = distinct !DILocation(line: 182, column: 25, scope: !743)
!743 = distinct !DILexicalBlock(scope: !732, file: !134, line: 182, column: 7)
!744 = !DILocation(line: 157, column: 15, scope: !737, inlinedAt: !742)
!745 = !DILocation(line: 182, column: 25, scope: !743)
!746 = !DILocation(line: 182, column: 7, scope: !732)
!747 = !DILocation(line: 184, column: 5, scope: !743)
!748 = !DILocation(line: 185, column: 1, scope: !732)
!749 = distinct !DISubprogram(name: "error_tail", scope: !134, file: !134, line: 219, type: !713, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !750)
!750 = !{!751, !752, !753, !754}
!751 = !DILocalVariable(name: "status", arg: 1, scope: !749, file: !134, line: 219, type: !31)
!752 = !DILocalVariable(name: "errnum", arg: 2, scope: !749, file: !134, line: 219, type: !31)
!753 = !DILocalVariable(name: "message", arg: 3, scope: !749, file: !134, line: 219, type: !6)
!754 = !DILocalVariable(name: "args", arg: 4, scope: !749, file: !134, line: 219, type: !142)
!755 = !DILocation(line: 0, scope: !749)
!756 = !DILocation(line: 219, column: 1, scope: !749)
!757 = !DILocation(line: 229, column: 13, scope: !749)
!758 = !DILocation(line: 229, column: 3, scope: !749)
!759 = !DILocalVariable(name: "__stream", arg: 1, scope: !760, file: !761, line: 132, type: !764)
!760 = distinct !DISubprogram(name: "vfprintf", scope: !761, file: !761, line: 132, type: !762, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !799)
!761 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!762 = !DISubroutineType(types: !763)
!763 = !{!31, !764, !607, !144}
!764 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 7, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !767, file: !62, line: 51, baseType: !31, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !767, file: !62, line: 54, baseType: !29, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !767, file: !62, line: 55, baseType: !29, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !767, file: !62, line: 56, baseType: !29, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !767, file: !62, line: 57, baseType: !29, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !767, file: !62, line: 58, baseType: !29, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !767, file: !62, line: 59, baseType: !29, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !767, file: !62, line: 60, baseType: !29, size: 64, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !767, file: !62, line: 61, baseType: !29, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !767, file: !62, line: 64, baseType: !29, size: 64, offset: 576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !767, file: !62, line: 65, baseType: !29, size: 64, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !767, file: !62, line: 66, baseType: !29, size: 64, offset: 704)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !767, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !767, file: !62, line: 70, baseType: !783, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !767, file: !62, line: 72, baseType: !31, size: 32, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !767, file: !62, line: 73, baseType: !31, size: 32, offset: 928)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !767, file: !62, line: 74, baseType: !84, size: 64, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !767, file: !62, line: 77, baseType: !32, size: 16, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !767, file: !62, line: 78, baseType: !89, size: 8, offset: 1040)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !767, file: !62, line: 79, baseType: !91, size: 8, offset: 1048)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !767, file: !62, line: 81, baseType: !95, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !767, file: !62, line: 89, baseType: !98, size: 64, offset: 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !767, file: !62, line: 91, baseType: !100, size: 64, offset: 1216)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !767, file: !62, line: 92, baseType: !103, size: 64, offset: 1280)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !767, file: !62, line: 93, baseType: !783, size: 64, offset: 1344)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !767, file: !62, line: 94, baseType: !30, size: 64, offset: 1408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !767, file: !62, line: 95, baseType: !33, size: 64, offset: 1472)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !767, file: !62, line: 96, baseType: !31, size: 32, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !767, file: !62, line: 98, baseType: !110, size: 160, offset: 1568)
!799 = !{!759, !800, !801}
!800 = !DILocalVariable(name: "__fmt", arg: 2, scope: !760, file: !761, line: 133, type: !607)
!801 = !DILocalVariable(name: "__ap", arg: 3, scope: !760, file: !761, line: 133, type: !144)
!802 = !DILocation(line: 0, scope: !760, inlinedAt: !803)
!803 = distinct !DILocation(line: 229, column: 3, scope: !749)
!804 = !DILocation(line: 135, column: 10, scope: !760, inlinedAt: !803)
!805 = !{!806, !808}
!806 = distinct !{!806, !807, !"vfprintf.inline: argument 0"}
!807 = distinct !{!807, !"vfprintf.inline"}
!808 = distinct !{!808, !807, !"vfprintf.inline: argument 1"}
!809 = !DILocation(line: 232, column: 3, scope: !749)
!810 = !DILocation(line: 233, column: 7, scope: !811)
!811 = distinct !DILexicalBlock(scope: !749, file: !134, line: 233, column: 7)
!812 = !DILocation(line: 233, column: 7, scope: !749)
!813 = !DILocalVariable(name: "errnum", arg: 1, scope: !814, file: !134, line: 188, type: !31)
!814 = distinct !DISubprogram(name: "print_errno_message", scope: !134, file: !134, line: 188, type: !408, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !815)
!815 = !{!813, !816, !817}
!816 = !DILocalVariable(name: "s", scope: !814, file: !134, line: 190, type: !6)
!817 = !DILocalVariable(name: "errbuf", scope: !814, file: !134, line: 193, type: !818)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 1024)
!821 = !DILocation(line: 0, scope: !814, inlinedAt: !822)
!822 = distinct !DILocation(line: 234, column: 5, scope: !811)
!823 = !DILocation(line: 193, column: 3, scope: !814, inlinedAt: !822)
!824 = !DILocation(line: 193, column: 8, scope: !814, inlinedAt: !822)
!825 = !DILocation(line: 195, column: 7, scope: !814, inlinedAt: !822)
!826 = !DILocation(line: 207, column: 9, scope: !827, inlinedAt: !822)
!827 = distinct !DILexicalBlock(scope: !814, file: !134, line: 207, column: 7)
!828 = !DILocation(line: 207, column: 7, scope: !814, inlinedAt: !822)
!829 = !DILocation(line: 208, column: 9, scope: !827, inlinedAt: !822)
!830 = !DILocation(line: 208, column: 5, scope: !827, inlinedAt: !822)
!831 = !DILocation(line: 214, column: 3, scope: !814, inlinedAt: !822)
!832 = !DILocation(line: 216, column: 1, scope: !814, inlinedAt: !822)
!833 = !DILocation(line: 234, column: 5, scope: !811)
!834 = !DILocation(line: 238, column: 3, scope: !749)
!835 = !DILocalVariable(name: "__c", arg: 1, scope: !836, file: !837, line: 101, type: !31)
!836 = distinct !DISubprogram(name: "putc_unlocked", scope: !837, file: !837, line: 101, type: !838, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !840)
!837 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!838 = !DISubroutineType(types: !839)
!839 = !{!31, !31, !765}
!840 = !{!835, !841}
!841 = !DILocalVariable(name: "__stream", arg: 2, scope: !836, file: !837, line: 101, type: !765)
!842 = !DILocation(line: 0, scope: !836, inlinedAt: !843)
!843 = distinct !DILocation(line: 238, column: 3, scope: !749)
!844 = !DILocation(line: 103, column: 10, scope: !836, inlinedAt: !843)
!845 = !{!846, !415, i64 40}
!846 = !{!"_IO_FILE", !432, i64 0, !415, i64 8, !415, i64 16, !415, i64 24, !415, i64 32, !415, i64 40, !415, i64 48, !415, i64 56, !415, i64 64, !415, i64 72, !415, i64 80, !415, i64 88, !415, i64 96, !415, i64 104, !432, i64 112, !432, i64 116, !847, i64 120, !473, i64 128, !416, i64 130, !416, i64 131, !415, i64 136, !847, i64 144, !415, i64 152, !415, i64 160, !415, i64 168, !415, i64 176, !847, i64 184, !432, i64 192, !416, i64 196}
!847 = !{!"long", !416, i64 0}
!848 = !{!846, !415, i64 48}
!849 = !{!"branch_weights", i32 2000, i32 1}
!850 = !DILocation(line: 240, column: 3, scope: !749)
!851 = !DILocation(line: 241, column: 7, scope: !852)
!852 = distinct !DILexicalBlock(scope: !749, file: !134, line: 241, column: 7)
!853 = !DILocation(line: 241, column: 7, scope: !749)
!854 = !DILocation(line: 242, column: 5, scope: !852)
!855 = !DILocation(line: 243, column: 1, scope: !749)
!856 = !DISubprogram(name: "strerror_r", scope: !857, file: !857, line: 444, type: !858, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!857 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!858 = !DISubroutineType(types: !859)
!859 = !{!29, !31, !29, !33}
!860 = !DISubprogram(name: "fflush_unlocked", scope: !143, file: !143, line: 239, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!861 = !DISubroutineType(types: !862)
!862 = !{!31, !765}
!863 = !DISubprogram(name: "fcntl", scope: !864, file: !864, line: 149, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!864 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!865 = !DISubroutineType(types: !866)
!866 = !{!31, !31, !31, null}
!867 = distinct !DISubprogram(name: "error", scope: !134, file: !134, line: 285, type: !868, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !31, !31, !6, null}
!870 = !{!871, !872, !873, !874}
!871 = !DILocalVariable(name: "status", arg: 1, scope: !867, file: !134, line: 285, type: !31)
!872 = !DILocalVariable(name: "errnum", arg: 2, scope: !867, file: !134, line: 285, type: !31)
!873 = !DILocalVariable(name: "message", arg: 3, scope: !867, file: !134, line: 285, type: !6)
!874 = !DILocalVariable(name: "ap", scope: !867, file: !134, line: 287, type: !142)
!875 = !DILocation(line: 0, scope: !867)
!876 = !DILocation(line: 287, column: 3, scope: !867)
!877 = !DILocation(line: 287, column: 11, scope: !867)
!878 = !DILocation(line: 288, column: 3, scope: !867)
!879 = !DILocation(line: 289, column: 3, scope: !867)
!880 = !DILocation(line: 290, column: 3, scope: !867)
!881 = !DILocation(line: 291, column: 1, scope: !867)
!882 = !DILocation(line: 0, scope: !139)
!883 = !DILocation(line: 298, column: 1, scope: !139)
!884 = !DILocation(line: 302, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !139, file: !134, line: 302, column: 7)
!886 = !DILocation(line: 302, column: 7, scope: !139)
!887 = !DILocation(line: 307, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !889, file: !134, line: 307, column: 11)
!889 = distinct !DILexicalBlock(scope: !885, file: !134, line: 303, column: 5)
!890 = !DILocation(line: 307, column: 27, scope: !888)
!891 = !DILocation(line: 308, column: 11, scope: !888)
!892 = !DILocation(line: 308, column: 28, scope: !888)
!893 = !DILocation(line: 308, column: 25, scope: !888)
!894 = !DILocation(line: 309, column: 15, scope: !888)
!895 = !DILocation(line: 309, column: 33, scope: !888)
!896 = !DILocation(line: 310, column: 19, scope: !888)
!897 = !DILocation(line: 311, column: 22, scope: !888)
!898 = !DILocation(line: 311, column: 56, scope: !888)
!899 = !DILocation(line: 307, column: 11, scope: !889)
!900 = !DILocation(line: 316, column: 21, scope: !889)
!901 = !DILocation(line: 317, column: 23, scope: !889)
!902 = !DILocation(line: 318, column: 5, scope: !889)
!903 = !DILocation(line: 327, column: 3, scope: !139)
!904 = !DILocation(line: 331, column: 7, scope: !905)
!905 = distinct !DILexicalBlock(scope: !139, file: !134, line: 331, column: 7)
!906 = !DILocation(line: 331, column: 7, scope: !139)
!907 = !DILocation(line: 332, column: 5, scope: !905)
!908 = !DILocation(line: 338, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !905, file: !134, line: 334, column: 5)
!910 = !DILocation(line: 346, column: 3, scope: !139)
!911 = !DILocation(line: 350, column: 3, scope: !139)
!912 = !DILocation(line: 356, column: 1, scope: !139)
!913 = distinct !DISubprogram(name: "error_at_line", scope: !134, file: !134, line: 359, type: !914, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !916)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !31, !31, !6, !14, !6, null}
!916 = !{!917, !918, !919, !920, !921, !922}
!917 = !DILocalVariable(name: "status", arg: 1, scope: !913, file: !134, line: 359, type: !31)
!918 = !DILocalVariable(name: "errnum", arg: 2, scope: !913, file: !134, line: 359, type: !31)
!919 = !DILocalVariable(name: "file_name", arg: 3, scope: !913, file: !134, line: 359, type: !6)
!920 = !DILocalVariable(name: "line_number", arg: 4, scope: !913, file: !134, line: 360, type: !14)
!921 = !DILocalVariable(name: "message", arg: 5, scope: !913, file: !134, line: 360, type: !6)
!922 = !DILocalVariable(name: "ap", scope: !913, file: !134, line: 362, type: !142)
!923 = !DILocation(line: 0, scope: !913)
!924 = !DILocation(line: 362, column: 3, scope: !913)
!925 = !DILocation(line: 362, column: 11, scope: !913)
!926 = !DILocation(line: 363, column: 3, scope: !913)
!927 = !DILocation(line: 364, column: 3, scope: !913)
!928 = !DILocation(line: 366, column: 3, scope: !913)
!929 = !DILocation(line: 367, column: 1, scope: !913)
!930 = distinct !DISubprogram(name: "getprogname", scope: !334, file: !334, line: 54, type: !931, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !333, retainedNodes: !428)
!931 = !DISubroutineType(types: !932)
!932 = !{!6}
!933 = !DILocation(line: 58, column: 10, scope: !930)
!934 = !DILocation(line: 58, column: 3, scope: !930)
!935 = distinct !DISubprogram(name: "set_program_name", scope: !175, file: !175, line: 37, type: !546, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !936)
!936 = !{!937, !938, !939}
!937 = !DILocalVariable(name: "argv0", arg: 1, scope: !935, file: !175, line: 37, type: !6)
!938 = !DILocalVariable(name: "slash", scope: !935, file: !175, line: 44, type: !6)
!939 = !DILocalVariable(name: "base", scope: !935, file: !175, line: 45, type: !6)
!940 = !DILocation(line: 0, scope: !935)
!941 = !DILocation(line: 44, column: 23, scope: !935)
!942 = !DILocation(line: 45, column: 22, scope: !935)
!943 = !DILocation(line: 46, column: 17, scope: !944)
!944 = distinct !DILexicalBlock(scope: !935, file: !175, line: 46, column: 7)
!945 = !DILocation(line: 46, column: 9, scope: !944)
!946 = !DILocation(line: 46, column: 25, scope: !944)
!947 = !DILocation(line: 46, column: 40, scope: !944)
!948 = !DILocalVariable(name: "__s1", arg: 1, scope: !949, file: !444, line: 974, type: !617)
!949 = distinct !DISubprogram(name: "memeq", scope: !444, file: !444, line: 974, type: !950, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !174, retainedNodes: !952)
!950 = !DISubroutineType(types: !951)
!951 = !{!45, !617, !617, !33}
!952 = !{!948, !953, !954}
!953 = !DILocalVariable(name: "__s2", arg: 2, scope: !949, file: !444, line: 974, type: !617)
!954 = !DILocalVariable(name: "__n", arg: 3, scope: !949, file: !444, line: 974, type: !33)
!955 = !DILocation(line: 0, scope: !949, inlinedAt: !956)
!956 = distinct !DILocation(line: 46, column: 28, scope: !944)
!957 = !DILocation(line: 976, column: 11, scope: !949, inlinedAt: !956)
!958 = !DILocation(line: 976, column: 10, scope: !949, inlinedAt: !956)
!959 = !DILocation(line: 46, column: 7, scope: !935)
!960 = !DILocation(line: 49, column: 11, scope: !961)
!961 = distinct !DILexicalBlock(scope: !962, file: !175, line: 49, column: 11)
!962 = distinct !DILexicalBlock(scope: !944, file: !175, line: 47, column: 5)
!963 = !DILocation(line: 49, column: 36, scope: !961)
!964 = !DILocation(line: 49, column: 11, scope: !962)
!965 = !DILocation(line: 65, column: 16, scope: !935)
!966 = !DILocation(line: 71, column: 27, scope: !935)
!967 = !DILocation(line: 74, column: 33, scope: !935)
!968 = !DILocation(line: 76, column: 1, scope: !935)
!969 = !DILocation(line: 0, scope: !180)
!970 = !DILocation(line: 40, column: 29, scope: !180)
!971 = !DILocation(line: 41, column: 19, scope: !972)
!972 = distinct !DILexicalBlock(scope: !180, file: !181, line: 41, column: 7)
!973 = !DILocation(line: 41, column: 7, scope: !180)
!974 = !DILocation(line: 47, column: 3, scope: !180)
!975 = !DILocation(line: 48, column: 3, scope: !180)
!976 = !DILocation(line: 48, column: 13, scope: !180)
!977 = !DILocalVariable(name: "ps", arg: 1, scope: !978, file: !979, line: 1135, type: !982)
!978 = distinct !DISubprogram(name: "mbszero", scope: !979, file: !979, line: 1135, type: !980, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !184, retainedNodes: !983)
!979 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!980 = !DISubroutineType(types: !981)
!981 = !{null, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!983 = !{!977}
!984 = !DILocation(line: 0, scope: !978, inlinedAt: !985)
!985 = distinct !DILocation(line: 48, column: 18, scope: !180)
!986 = !DILocalVariable(name: "__dest", arg: 1, scope: !987, file: !988, line: 57, type: !30)
!987 = distinct !DISubprogram(name: "memset", scope: !988, file: !988, line: 57, type: !989, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !184, retainedNodes: !991)
!988 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!989 = !DISubroutineType(types: !990)
!990 = !{!30, !30, !31, !33}
!991 = !{!986, !992, !993}
!992 = !DILocalVariable(name: "__ch", arg: 2, scope: !987, file: !988, line: 57, type: !31)
!993 = !DILocalVariable(name: "__len", arg: 3, scope: !987, file: !988, line: 57, type: !33)
!994 = !DILocation(line: 0, scope: !987, inlinedAt: !995)
!995 = distinct !DILocation(line: 1137, column: 3, scope: !978, inlinedAt: !985)
!996 = !DILocation(line: 59, column: 10, scope: !987, inlinedAt: !995)
!997 = !DILocation(line: 49, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !180, file: !181, line: 49, column: 7)
!999 = !DILocation(line: 49, column: 39, scope: !998)
!1000 = !DILocation(line: 49, column: 44, scope: !998)
!1001 = !DILocation(line: 54, column: 1, scope: !180)
!1002 = !DISubprogram(name: "mbrtoc32", scope: !192, file: !192, line: 57, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !428)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!33, !1005, !607, !33, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !982)
!1008 = distinct !DISubprogram(name: "clone_quoting_options", scope: !217, file: !217, line: 113, type: !1009, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1012)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1011, !1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!1012 = !{!1013, !1014, !1015}
!1013 = !DILocalVariable(name: "o", arg: 1, scope: !1008, file: !217, line: 113, type: !1011)
!1014 = !DILocalVariable(name: "saved_errno", scope: !1008, file: !217, line: 115, type: !31)
!1015 = !DILocalVariable(name: "p", scope: !1008, file: !217, line: 116, type: !1011)
!1016 = !DILocation(line: 0, scope: !1008)
!1017 = !DILocation(line: 115, column: 21, scope: !1008)
!1018 = !DILocation(line: 116, column: 40, scope: !1008)
!1019 = !DILocation(line: 116, column: 31, scope: !1008)
!1020 = !DILocation(line: 118, column: 9, scope: !1008)
!1021 = !DILocation(line: 119, column: 3, scope: !1008)
!1022 = distinct !DISubprogram(name: "get_quoting_style", scope: !217, file: !217, line: 124, type: !1023, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1027)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!219, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!1027 = !{!1028}
!1028 = !DILocalVariable(name: "o", arg: 1, scope: !1022, file: !217, line: 124, type: !1025)
!1029 = !DILocation(line: 0, scope: !1022)
!1030 = !DILocation(line: 126, column: 11, scope: !1022)
!1031 = !DILocation(line: 126, column: 46, scope: !1022)
!1032 = !{!1033, !416, i64 0}
!1033 = !{!"quoting_options", !416, i64 0, !432, i64 4, !416, i64 8, !415, i64 40, !415, i64 48}
!1034 = !DILocation(line: 126, column: 3, scope: !1022)
!1035 = distinct !DISubprogram(name: "set_quoting_style", scope: !217, file: !217, line: 132, type: !1036, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1038)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !1011, !219}
!1038 = !{!1039, !1040}
!1039 = !DILocalVariable(name: "o", arg: 1, scope: !1035, file: !217, line: 132, type: !1011)
!1040 = !DILocalVariable(name: "s", arg: 2, scope: !1035, file: !217, line: 132, type: !219)
!1041 = !DILocation(line: 0, scope: !1035)
!1042 = !DILocation(line: 134, column: 4, scope: !1035)
!1043 = !DILocation(line: 134, column: 39, scope: !1035)
!1044 = !DILocation(line: 134, column: 45, scope: !1035)
!1045 = !DILocation(line: 135, column: 1, scope: !1035)
!1046 = distinct !DISubprogram(name: "set_char_quoting", scope: !217, file: !217, line: 143, type: !1047, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1049)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!31, !1011, !8, !31}
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1056, !1057}
!1050 = !DILocalVariable(name: "o", arg: 1, scope: !1046, file: !217, line: 143, type: !1011)
!1051 = !DILocalVariable(name: "c", arg: 2, scope: !1046, file: !217, line: 143, type: !8)
!1052 = !DILocalVariable(name: "i", arg: 3, scope: !1046, file: !217, line: 143, type: !31)
!1053 = !DILocalVariable(name: "uc", scope: !1046, file: !217, line: 145, type: !36)
!1054 = !DILocalVariable(name: "p", scope: !1046, file: !217, line: 146, type: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!1056 = !DILocalVariable(name: "shift", scope: !1046, file: !217, line: 148, type: !31)
!1057 = !DILocalVariable(name: "r", scope: !1046, file: !217, line: 149, type: !14)
!1058 = !DILocation(line: 0, scope: !1046)
!1059 = !DILocation(line: 147, column: 6, scope: !1046)
!1060 = !DILocation(line: 147, column: 62, scope: !1046)
!1061 = !DILocation(line: 147, column: 57, scope: !1046)
!1062 = !DILocation(line: 148, column: 15, scope: !1046)
!1063 = !DILocation(line: 149, column: 21, scope: !1046)
!1064 = !DILocation(line: 149, column: 24, scope: !1046)
!1065 = !DILocation(line: 149, column: 34, scope: !1046)
!1066 = !DILocation(line: 150, column: 13, scope: !1046)
!1067 = !DILocation(line: 150, column: 19, scope: !1046)
!1068 = !DILocation(line: 150, column: 24, scope: !1046)
!1069 = !DILocation(line: 150, column: 6, scope: !1046)
!1070 = !DILocation(line: 151, column: 3, scope: !1046)
!1071 = distinct !DISubprogram(name: "set_quoting_flags", scope: !217, file: !217, line: 159, type: !1072, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!31, !1011, !31}
!1074 = !{!1075, !1076, !1077}
!1075 = !DILocalVariable(name: "o", arg: 1, scope: !1071, file: !217, line: 159, type: !1011)
!1076 = !DILocalVariable(name: "i", arg: 2, scope: !1071, file: !217, line: 159, type: !31)
!1077 = !DILocalVariable(name: "r", scope: !1071, file: !217, line: 163, type: !31)
!1078 = !DILocation(line: 0, scope: !1071)
!1079 = !DILocation(line: 161, column: 8, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1071, file: !217, line: 161, column: 7)
!1081 = !DILocation(line: 161, column: 7, scope: !1071)
!1082 = !DILocation(line: 163, column: 14, scope: !1071)
!1083 = !{!1033, !432, i64 4}
!1084 = !DILocation(line: 164, column: 12, scope: !1071)
!1085 = !DILocation(line: 165, column: 3, scope: !1071)
!1086 = distinct !DISubprogram(name: "set_custom_quoting", scope: !217, file: !217, line: 169, type: !1087, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1089)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !1011, !6, !6}
!1089 = !{!1090, !1091, !1092}
!1090 = !DILocalVariable(name: "o", arg: 1, scope: !1086, file: !217, line: 169, type: !1011)
!1091 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1086, file: !217, line: 170, type: !6)
!1092 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1086, file: !217, line: 170, type: !6)
!1093 = !DILocation(line: 0, scope: !1086)
!1094 = !DILocation(line: 172, column: 8, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1086, file: !217, line: 172, column: 7)
!1096 = !DILocation(line: 172, column: 7, scope: !1086)
!1097 = !DILocation(line: 174, column: 6, scope: !1086)
!1098 = !DILocation(line: 174, column: 12, scope: !1086)
!1099 = !DILocation(line: 175, column: 8, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1086, file: !217, line: 175, column: 7)
!1101 = !DILocation(line: 175, column: 19, scope: !1100)
!1102 = !DILocation(line: 176, column: 5, scope: !1100)
!1103 = !DILocation(line: 177, column: 6, scope: !1086)
!1104 = !DILocation(line: 177, column: 17, scope: !1086)
!1105 = !{!1033, !415, i64 40}
!1106 = !DILocation(line: 178, column: 6, scope: !1086)
!1107 = !DILocation(line: 178, column: 18, scope: !1086)
!1108 = !{!1033, !415, i64 48}
!1109 = !DILocation(line: 179, column: 1, scope: !1086)
!1110 = distinct !DISubprogram(name: "quotearg_buffer", scope: !217, file: !217, line: 774, type: !1111, scopeLine: 777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!33, !29, !33, !6, !33, !1025}
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1114 = !DILocalVariable(name: "buffer", arg: 1, scope: !1110, file: !217, line: 774, type: !29)
!1115 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1110, file: !217, line: 774, type: !33)
!1116 = !DILocalVariable(name: "arg", arg: 3, scope: !1110, file: !217, line: 775, type: !6)
!1117 = !DILocalVariable(name: "argsize", arg: 4, scope: !1110, file: !217, line: 775, type: !33)
!1118 = !DILocalVariable(name: "o", arg: 5, scope: !1110, file: !217, line: 776, type: !1025)
!1119 = !DILocalVariable(name: "p", scope: !1110, file: !217, line: 778, type: !1025)
!1120 = !DILocalVariable(name: "saved_errno", scope: !1110, file: !217, line: 779, type: !31)
!1121 = !DILocalVariable(name: "r", scope: !1110, file: !217, line: 780, type: !33)
!1122 = !DILocation(line: 0, scope: !1110)
!1123 = !DILocation(line: 778, column: 37, scope: !1110)
!1124 = !DILocation(line: 779, column: 21, scope: !1110)
!1125 = !DILocation(line: 781, column: 43, scope: !1110)
!1126 = !DILocation(line: 781, column: 53, scope: !1110)
!1127 = !DILocation(line: 781, column: 60, scope: !1110)
!1128 = !DILocation(line: 782, column: 43, scope: !1110)
!1129 = !DILocation(line: 782, column: 58, scope: !1110)
!1130 = !DILocation(line: 780, column: 14, scope: !1110)
!1131 = !DILocation(line: 783, column: 9, scope: !1110)
!1132 = !DILocation(line: 784, column: 3, scope: !1110)
!1133 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !217, file: !217, line: 251, type: !1134, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !1138)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!33, !29, !33, !6, !33, !219, !31, !1136, !6, !6}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1163, !1165, !1168, !1169, !1170, !1171, !1174, !1175, !1178, !1182, !1183, !1191, !1194, !1195, !1197, !1198, !1199, !1200}
!1139 = !DILocalVariable(name: "buffer", arg: 1, scope: !1133, file: !217, line: 251, type: !29)
!1140 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1133, file: !217, line: 251, type: !33)
!1141 = !DILocalVariable(name: "arg", arg: 3, scope: !1133, file: !217, line: 252, type: !6)
!1142 = !DILocalVariable(name: "argsize", arg: 4, scope: !1133, file: !217, line: 252, type: !33)
!1143 = !DILocalVariable(name: "quoting_style", arg: 5, scope: !1133, file: !217, line: 253, type: !219)
!1144 = !DILocalVariable(name: "flags", arg: 6, scope: !1133, file: !217, line: 253, type: !31)
!1145 = !DILocalVariable(name: "quote_these_too", arg: 7, scope: !1133, file: !217, line: 254, type: !1136)
!1146 = !DILocalVariable(name: "left_quote", arg: 8, scope: !1133, file: !217, line: 255, type: !6)
!1147 = !DILocalVariable(name: "right_quote", arg: 9, scope: !1133, file: !217, line: 256, type: !6)
!1148 = !DILocalVariable(name: "unibyte_locale", scope: !1133, file: !217, line: 258, type: !45)
!1149 = !DILocalVariable(name: "len", scope: !1133, file: !217, line: 260, type: !33)
!1150 = !DILocalVariable(name: "orig_buffersize", scope: !1133, file: !217, line: 261, type: !33)
!1151 = !DILocalVariable(name: "quote_string", scope: !1133, file: !217, line: 262, type: !6)
!1152 = !DILocalVariable(name: "quote_string_len", scope: !1133, file: !217, line: 263, type: !33)
!1153 = !DILocalVariable(name: "backslash_escapes", scope: !1133, file: !217, line: 264, type: !45)
!1154 = !DILocalVariable(name: "elide_outer_quotes", scope: !1133, file: !217, line: 265, type: !45)
!1155 = !DILocalVariable(name: "encountered_single_quote", scope: !1133, file: !217, line: 266, type: !45)
!1156 = !DILocalVariable(name: "all_c_and_shell_quote_compat", scope: !1133, file: !217, line: 267, type: !45)
!1157 = !DILocalVariable(name: "pending_shell_escape_end", scope: !1133, file: !217, line: 309, type: !45)
!1158 = !DILocalVariable(name: "lq", scope: !1159, file: !217, line: 361, type: !6)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !217, line: 361, column: 11)
!1160 = distinct !DILexicalBlock(scope: !1161, file: !217, line: 360, column: 13)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !217, line: 333, column: 7)
!1162 = distinct !DILexicalBlock(scope: !1133, file: !217, line: 312, column: 5)
!1163 = !DILocalVariable(name: "i", scope: !1164, file: !217, line: 395, type: !33)
!1164 = distinct !DILexicalBlock(scope: !1133, file: !217, line: 395, column: 3)
!1165 = !DILocalVariable(name: "is_right_quote", scope: !1166, file: !217, line: 397, type: !45)
!1166 = distinct !DILexicalBlock(scope: !1167, file: !217, line: 396, column: 5)
!1167 = distinct !DILexicalBlock(scope: !1164, file: !217, line: 395, column: 3)
!1168 = !DILocalVariable(name: "escaping", scope: !1166, file: !217, line: 398, type: !45)
!1169 = !DILocalVariable(name: "c_and_shell_quote_compat", scope: !1166, file: !217, line: 399, type: !45)
!1170 = !DILocalVariable(name: "c", scope: !1166, file: !217, line: 417, type: !36)
!1171 = !DILocalVariable(name: "m", scope: !1172, file: !217, line: 598, type: !33)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !217, line: 596, column: 11)
!1173 = distinct !DILexicalBlock(scope: !1166, file: !217, line: 419, column: 9)
!1174 = !DILocalVariable(name: "printable", scope: !1172, file: !217, line: 600, type: !45)
!1175 = !DILocalVariable(name: "mbs", scope: !1176, file: !217, line: 609, type: !276)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !217, line: 608, column: 15)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !217, line: 602, column: 17)
!1178 = !DILocalVariable(name: "w", scope: !1179, file: !217, line: 618, type: !191)
!1179 = distinct !DILexicalBlock(scope: !1180, file: !217, line: 617, column: 19)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !217, line: 616, column: 17)
!1181 = distinct !DILexicalBlock(scope: !1176, file: !217, line: 616, column: 17)
!1182 = !DILocalVariable(name: "bytes", scope: !1179, file: !217, line: 619, type: !33)
!1183 = !DILocalVariable(name: "j", scope: !1184, file: !217, line: 648, type: !33)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !217, line: 648, column: 29)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !217, line: 647, column: 27)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !217, line: 645, column: 29)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !217, line: 636, column: 23)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !217, line: 628, column: 30)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !217, line: 623, column: 30)
!1190 = distinct !DILexicalBlock(scope: !1179, file: !217, line: 621, column: 25)
!1191 = !DILocalVariable(name: "ilim", scope: !1192, file: !217, line: 674, type: !33)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !217, line: 671, column: 15)
!1193 = distinct !DILexicalBlock(scope: !1172, file: !217, line: 670, column: 17)
!1194 = !DILabel(scope: !1133, name: "process_input", file: !217, line: 308)
!1195 = !DILabel(scope: !1196, name: "c_and_shell_escape", file: !217, line: 502)
!1196 = distinct !DILexicalBlock(scope: !1173, file: !217, line: 478, column: 9)
!1197 = !DILabel(scope: !1196, name: "c_escape", file: !217, line: 507)
!1198 = !DILabel(scope: !1166, name: "store_escape", file: !217, line: 709)
!1199 = !DILabel(scope: !1166, name: "store_c", file: !217, line: 712)
!1200 = !DILabel(scope: !1133, name: "force_outer_quoting_style", file: !217, line: 753)
!1201 = !DILocation(line: 0, scope: !1133)
!1202 = !DILocation(line: 258, column: 25, scope: !1133)
!1203 = !DILocation(line: 258, column: 36, scope: !1133)
!1204 = !DILocation(line: 267, column: 3, scope: !1133)
!1205 = !DILocation(line: 261, column: 10, scope: !1133)
!1206 = !DILocation(line: 262, column: 15, scope: !1133)
!1207 = !DILocation(line: 263, column: 10, scope: !1133)
!1208 = !DILocation(line: 308, column: 2, scope: !1133)
!1209 = !DILocation(line: 311, column: 3, scope: !1133)
!1210 = !DILocation(line: 318, column: 11, scope: !1162)
