; ModuleID = 'src/tsort.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.item = type { i8*, %struct.item*, %struct.item*, i8, i8, i64, %struct.item*, %struct.successor* }
%struct.successor = type { %struct.item*, %struct.successor* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.tokenbuffer = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [100 x i8] c"Usage: %s [OPTION] [FILE]\0AWrite totally ordered list consistent with the partial ordering in FILE.\0A\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"tsort\00", align 1

!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !29, line: 42, baseType: !14, size: 32, elements: !30)
!29 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!31 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!32 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!33 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!34 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!35 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!36 = !DIEnumerator(name: "c_quoting_style", value: 5)
!37 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!38 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!39 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!40 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!41 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 44, baseType: !14, size: 32, elements: !44)
!43 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!46 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!47 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!48 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!49 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!50 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!51 = !{!8, !52, !6, !53, !54, !57, !59}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!53 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 46, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!56 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!0, !61, !148, !150, !168, !170}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !63, file: !64, line: 575, type: !6, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "oputs_", scope: !64, file: !64, line: 573, type: !65, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !67)
!64 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!65 = !DISubroutineType(types: !66)
!66 = !{null, !57, !57}
!67 = !{!68, !69, !70, !73, !75, !76, !77, !81, !82, !83, !84, !86, !142, !143, !144, !146, !147}
!68 = !DILocalVariable(name: "program", arg: 1, scope: !63, file: !64, line: 573, type: !57)
!69 = !DILocalVariable(name: "option", arg: 2, scope: !63, file: !64, line: 573, type: !57)
!70 = !DILocalVariable(name: "term", scope: !71, file: !64, line: 585, type: !57)
!71 = distinct !DILexicalBlock(scope: !72, file: !64, line: 582, column: 5)
!72 = distinct !DILexicalBlock(scope: !63, file: !64, line: 581, column: 7)
!73 = !DILocalVariable(name: "double_space", scope: !63, file: !64, line: 594, type: !74)
!74 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!75 = !DILocalVariable(name: "first_word", scope: !63, file: !64, line: 595, type: !57)
!76 = !DILocalVariable(name: "option_text", scope: !63, file: !64, line: 596, type: !57)
!77 = !DILocalVariable(name: "s", scope: !78, file: !64, line: 608, type: !57)
!78 = distinct !DILexicalBlock(scope: !79, file: !64, line: 605, column: 5)
!79 = distinct !DILexicalBlock(scope: !80, file: !64, line: 604, column: 12)
!80 = distinct !DILexicalBlock(scope: !63, file: !64, line: 597, column: 7)
!81 = !DILocalVariable(name: "spaces", scope: !78, file: !64, line: 609, type: !54)
!82 = !DILocalVariable(name: "anchor_len", scope: !63, file: !64, line: 620, type: !54)
!83 = !DILocalVariable(name: "desc_text", scope: !63, file: !64, line: 625, type: !57)
!84 = !DILocalVariable(name: "__ptr", scope: !85, file: !64, line: 644, type: !57)
!85 = distinct !DILexicalBlock(scope: !63, file: !64, line: 644, column: 3)
!86 = !DILocalVariable(name: "__stream", scope: !85, file: !64, line: 644, type: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !89, line: 7, baseType: !90)
!89 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !91, line: 49, size: 1728, elements: !92)
!91 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !108, !110, !111, !112, !116, !117, !119, !123, !126, !128, !131, !134, !135, !136, !137, !138}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !90, file: !91, line: 51, baseType: !6, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !90, file: !91, line: 54, baseType: !8, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !90, file: !91, line: 55, baseType: !8, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !90, file: !91, line: 56, baseType: !8, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !90, file: !91, line: 57, baseType: !8, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !90, file: !91, line: 58, baseType: !8, size: 64, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !90, file: !91, line: 59, baseType: !8, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !90, file: !91, line: 60, baseType: !8, size: 64, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !90, file: !91, line: 61, baseType: !8, size: 64, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !90, file: !91, line: 64, baseType: !8, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !90, file: !91, line: 65, baseType: !8, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !90, file: !91, line: 66, baseType: !8, size: 64, offset: 704)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !90, file: !91, line: 68, baseType: !106, size: 64, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !91, line: 36, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !90, file: !91, line: 70, baseType: !109, size: 64, offset: 832)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !90, file: !91, line: 72, baseType: !6, size: 32, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !90, file: !91, line: 73, baseType: !6, size: 32, offset: 928)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !90, file: !91, line: 74, baseType: !113, size: 64, offset: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !114, line: 152, baseType: !115)
!114 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!115 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !90, file: !91, line: 77, baseType: !53, size: 16, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !90, file: !91, line: 78, baseType: !118, size: 8, offset: 1040)
!118 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !90, file: !91, line: 79, baseType: !120, size: 8, offset: 1048)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !90, file: !91, line: 81, baseType: !124, size: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !91, line: 43, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !90, file: !91, line: 89, baseType: !127, size: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !114, line: 153, baseType: !115)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !90, file: !91, line: 91, baseType: !129, size: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !91, line: 37, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !90, file: !91, line: 92, baseType: !132, size: 64, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !91, line: 38, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !90, file: !91, line: 93, baseType: !109, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !90, file: !91, line: 94, baseType: !52, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !90, file: !91, line: 95, baseType: !54, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !90, file: !91, line: 96, baseType: !6, size: 32, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !90, file: !91, line: 98, baseType: !139, size: 160, offset: 1568)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 20)
!142 = !DILocalVariable(name: "__cnt", scope: !85, file: !64, line: 644, type: !54)
!143 = !DILocalVariable(name: "url_program", scope: !63, file: !64, line: 648, type: !57)
!144 = !DILocalVariable(name: "__ptr", scope: !145, file: !64, line: 686, type: !57)
!145 = distinct !DILexicalBlock(scope: !63, file: !64, line: 686, column: 3)
!146 = !DILocalVariable(name: "__stream", scope: !145, file: !64, line: 686, type: !87)
!147 = !DILocalVariable(name: "__cnt", scope: !145, file: !64, line: 686, type: !54)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "n_strings", scope: !10, file: !3, line: 72, type: !54, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "head", scope: !10, file: !3, line: 63, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "item", file: !3, line: 51, size: 448, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !153, file: !3, line: 53, baseType: !57, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !153, file: !3, line: 54, baseType: !152, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !153, file: !3, line: 54, baseType: !152, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !153, file: !3, line: 55, baseType: !118, size: 8, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "printed", scope: !153, file: !3, line: 56, baseType: !74, size: 8, offset: 200)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !153, file: !3, line: 57, baseType: !54, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "qlink", scope: !153, file: !3, line: 58, baseType: !152, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !153, file: !3, line: 59, baseType: !163, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "successor", file: !3, line: 44, size: 128, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "suc", scope: !164, file: !3, line: 46, baseType: !152, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !3, line: 47, baseType: !163, size: 64, offset: 64)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "zeros", scope: !10, file: !3, line: 66, type: !152, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "loop", scope: !10, file: !3, line: 69, type: !152, isLocal: true, isDefinition: true)
!172 = !{!173, !174, !175}
!173 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 531, type: !6)
!174 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 531, type: !7)
!175 = !DILocalVariable(name: "c", scope: !176, file: !3, line: 549, type: !6)
!176 = distinct !DILexicalBlock(scope: !2, file: !3, line: 542, column: 5)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 768, elements: !187)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !180, line: 50, size: 256, elements: !181)
!180 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!181 = !{!182, !183, !184, !186}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !179, file: !180, line: 52, baseType: !57, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !179, file: !180, line: 55, baseType: !6, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !179, file: !180, line: 56, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !179, file: !180, line: 57, baseType: !6, size: 32, offset: 192)
!187 = !{!188}
!188 = !DISubrange(count: 3)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "Version", scope: !191, file: !192, line: 3, type: !57, isLocal: false, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !193, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!193 = !{!189}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "file_name", scope: !196, file: !197, line: 45, type: !57, isLocal: true, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !198, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!198 = !{!194, !199}
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !196, file: !197, line: 55, type: !74, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !203, file: !204, line: 66, type: !239, isLocal: false, isDefinition: true)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !205, globals: !206, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!205 = !{!52, !59}
!206 = !{!207, !233, !201, !235, !237}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "old_file_name", scope: !209, file: !204, line: 304, type: !57, isLocal: true, isDefinition: true)
!209 = distinct !DISubprogram(name: "verror_at_line", scope: !204, file: !204, line: 298, type: !210, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !203, retainedNodes: !226)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !6, !6, !57, !14, !57, !212}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !213, line: 52, baseType: !214)
!213 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !215, line: 32, baseType: !216)
!215 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !217, baseType: !218)
!217 = !DIFile(filename: "lib/error.c", directory: "/src")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !219, size: 256, elements: !220)
!219 = !DINamespace(name: "std", scope: null)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !218, file: !217, baseType: !52, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !218, file: !217, baseType: !52, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !218, file: !217, baseType: !52, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !218, file: !217, baseType: !6, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !218, file: !217, baseType: !6, size: 32, offset: 224)
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DILocalVariable(name: "status", arg: 1, scope: !209, file: !204, line: 298, type: !6)
!228 = !DILocalVariable(name: "errnum", arg: 2, scope: !209, file: !204, line: 298, type: !6)
!229 = !DILocalVariable(name: "file_name", arg: 3, scope: !209, file: !204, line: 298, type: !57)
!230 = !DILocalVariable(name: "line_number", arg: 4, scope: !209, file: !204, line: 298, type: !14)
!231 = !DILocalVariable(name: "message", arg: 5, scope: !209, file: !204, line: 298, type: !57)
!232 = !DILocalVariable(name: "args", arg: 6, scope: !209, file: !204, line: 298, type: !212)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "old_line_number", scope: !209, file: !204, line: 305, type: !14, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "error_message_count", scope: !203, file: !204, line: 69, type: !14, isLocal: false, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !203, file: !204, line: 295, type: !6, isLocal: false, isDefinition: true)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{null}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "program_name", scope: !244, file: !245, line: 31, type: !57, isLocal: false, isDefinition: true)
!244 = distinct !DICompileUnit(language: DW_LANG_C99, file: !245, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !246, globals: !247, splitDebugInlining: false, nameTableKind: None)
!245 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!246 = !{!8}
!247 = !{!242}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "utf07FF", scope: !250, file: !251, line: 46, type: !281, isLocal: true, isDefinition: true)
!250 = distinct !DISubprogram(name: "proper_name_lite", scope: !251, file: !251, line: 38, type: !252, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !254, retainedNodes: !256)
!251 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!252 = !DISubroutineType(types: !253)
!253 = !{!57, !57, !57}
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !255, splitDebugInlining: false, nameTableKind: None)
!255 = !{!248}
!256 = !{!257, !258, !259, !260, !265}
!257 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !250, file: !251, line: 38, type: !57)
!258 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !250, file: !251, line: 38, type: !57)
!259 = !DILocalVariable(name: "translation", scope: !250, file: !251, line: 40, type: !57)
!260 = !DILocalVariable(name: "w", scope: !250, file: !251, line: 47, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !262, line: 37, baseType: !263)
!262 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !114, line: 57, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !114, line: 42, baseType: !14)
!265 = !DILocalVariable(name: "mbs", scope: !250, file: !251, line: 48, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !267, line: 6, baseType: !268)
!267 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !269, line: 21, baseType: !270)
!269 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 13, size: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !270, file: !269, line: 15, baseType: !6, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !270, file: !269, line: 20, baseType: !274, size: 32, offset: 32)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !270, file: !269, line: 16, size: 32, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !274, file: !269, line: 18, baseType: !14, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !274, file: !269, line: 19, baseType: !278, size: 32)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 4)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 2)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !286, file: !287, line: 76, type: !355, isLocal: false, isDefinition: true)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !294, globals: !295, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!288 = !{!28, !289, !12}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !29, line: 254, baseType: !14, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!292 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!293 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!294 = !{!6, !53, !54}
!295 = !{!284, !296, !302, !314, !316, !321, !344, !351, !353}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !286, file: !287, line: 92, type: !298, isLocal: false, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 320, elements: !300)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!300 = !{!301}
!301 = !DISubrange(count: 10)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !286, file: !287, line: 1040, type: !304, isLocal: false, isDefinition: true)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !287, line: 56, size: 448, elements: !305)
!305 = !{!306, !307, !308, !312, !313}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !304, file: !287, line: 59, baseType: !28, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !287, line: 62, baseType: !6, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !304, file: !287, line: 66, baseType: !309, size: 256, offset: 64)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 8)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !304, file: !287, line: 69, baseType: !57, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !304, file: !287, line: 72, baseType: !57, size: 64, offset: 384)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !286, file: !287, line: 107, type: !304, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "slot0", scope: !286, file: !287, line: 831, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 256)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "quote", scope: !323, file: !287, line: 228, type: !342, isLocal: true, isDefinition: true)
!323 = distinct !DISubprogram(name: "gettext_quote", scope: !287, file: !287, line: 197, type: !324, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !286, retainedNodes: !326)
!324 = !DISubroutineType(types: !325)
!325 = !{!57, !57, !28}
!326 = !{!327, !328, !329, !330, !331}
!327 = !DILocalVariable(name: "msgid", arg: 1, scope: !323, file: !287, line: 197, type: !57)
!328 = !DILocalVariable(name: "s", arg: 2, scope: !323, file: !287, line: 197, type: !28)
!329 = !DILocalVariable(name: "translation", scope: !323, file: !287, line: 199, type: !57)
!330 = !DILocalVariable(name: "w", scope: !323, file: !287, line: 229, type: !261)
!331 = !DILocalVariable(name: "mbs", scope: !323, file: !287, line: 230, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !267, line: 6, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !269, line: 21, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 13, size: 64, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !334, file: !269, line: 15, baseType: !6, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !334, file: !269, line: 20, baseType: !338, size: 32, offset: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !269, line: 16, size: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !338, file: !269, line: 18, baseType: !14, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !338, file: !269, line: 19, baseType: !278, size: 32)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, elements: !343)
!343 = !{!283, !280}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "slotvec", scope: !286, file: !287, line: 834, type: !346, isLocal: true, isDefinition: true)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !287, line: 823, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !347, file: !287, line: 825, baseType: !54, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !347, file: !287, line: 826, baseType: !8, size: 64, offset: 64)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "nslots", scope: !286, file: !287, line: 832, type: !6, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "slotvec0", scope: !286, file: !287, line: 833, type: !347, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 704, elements: !357)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!357 = !{!358}
!358 = !DISubrange(count: 11)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !361, file: !362, line: 26, type: !364, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C99, file: !362, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !363, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!363 = !{!359}
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 376, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 47)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "exit_failure", scope: !369, file: !370, line: 24, type: !372, isLocal: false, isDefinition: true)
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !371, splitDebugInlining: false, nameTableKind: None)
!370 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!371 = !{!367}
!372 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "internal_state", scope: !375, file: !376, line: 97, type: !379, isLocal: true, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !377, globals: !378, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!377 = !{!52, !54, !59}
!378 = !{!373}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !267, line: 6, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !269, line: 21, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 13, size: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !381, file: !269, line: 15, baseType: !6, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !381, file: !269, line: 20, baseType: !385, size: 32, offset: 32)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !269, line: 16, size: 32, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !385, file: !269, line: 18, baseType: !14, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !385, file: !269, line: 19, baseType: !278, size: 32)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!391 = !{!42}
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !396, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!396 = !{!52}
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !396, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !409, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/readtokens.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bd27ae043f20cb5dd96b528a940c0bf9")
!405 = !{!406}
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 50, baseType: !14, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIEnumerator(name: "bits_per_word", value: 64)
!409 = !{!54, !52, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !413, retainedTypes: !396, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!413 = !{!414}
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !412, line: 40, baseType: !14, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!417 = distinct !DICompileUnit(language: DW_LANG_C99, file: !418, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !419, retainedTypes: !450, splitDebugInlining: false, nameTableKind: None)
!418 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!419 = !{!420, !432}
!420 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !421, file: !418, line: 188, baseType: !14, size: 32, elements: !430)
!421 = distinct !DISubprogram(name: "x2nrealloc", scope: !418, file: !418, line: 176, type: !422, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !417, retainedNodes: !425)
!422 = !DISubroutineType(types: !423)
!423 = !{!52, !52, !424, !54}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!425 = !{!426, !427, !428, !429}
!426 = !DILocalVariable(name: "p", arg: 1, scope: !421, file: !418, line: 176, type: !52)
!427 = !DILocalVariable(name: "pn", arg: 2, scope: !421, file: !418, line: 176, type: !424)
!428 = !DILocalVariable(name: "s", arg: 3, scope: !421, file: !418, line: 176, type: !54)
!429 = !DILocalVariable(name: "n", scope: !421, file: !418, line: 178, type: !54)
!430 = !{!431}
!431 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !433, file: !418, line: 228, baseType: !14, size: 32, elements: !430)
!433 = distinct !DISubprogram(name: "xpalloc", scope: !418, file: !418, line: 223, type: !434, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !417, retainedNodes: !440)
!434 = !DISubroutineType(types: !435)
!435 = !{!52, !52, !436, !437, !439, !437}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !438, line: 130, baseType: !439)
!438 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !55, line: 35, baseType: !115)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449}
!441 = !DILocalVariable(name: "pa", arg: 1, scope: !433, file: !418, line: 223, type: !52)
!442 = !DILocalVariable(name: "pn", arg: 2, scope: !433, file: !418, line: 223, type: !436)
!443 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !433, file: !418, line: 223, type: !437)
!444 = !DILocalVariable(name: "n_max", arg: 4, scope: !433, file: !418, line: 223, type: !439)
!445 = !DILocalVariable(name: "s", arg: 5, scope: !433, file: !418, line: 223, type: !437)
!446 = !DILocalVariable(name: "n0", scope: !433, file: !418, line: 230, type: !437)
!447 = !DILocalVariable(name: "n", scope: !433, file: !418, line: 237, type: !437)
!448 = !DILocalVariable(name: "nbytes", scope: !433, file: !418, line: 248, type: !437)
!449 = !DILocalVariable(name: "adjusted_nbytes", scope: !433, file: !418, line: 252, type: !437)
!450 = !{!8, !52, !74, !115, !56}
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !457, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!457 = !{!74, !56, !52}
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !396, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!464 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!465 = !{i32 7, !"Dwarf Version", i32 5}
!466 = !{i32 2, !"Debug Info Version", i32 3}
!467 = !{i32 1, !"wchar_size", i32 4}
!468 = !{i32 1, !"branch-target-enforcement", i32 0}
!469 = !{i32 1, !"sign-return-address", i32 0}
!470 = !{i32 1, !"sign-return-address-all", i32 0}
!471 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!472 = !{i32 7, !"PIC Level", i32 2}
!473 = !{i32 7, !"PIE Level", i32 2}
!474 = !{i32 7, !"uwtable", i32 1}
!475 = !{i32 7, !"frame-pointer", i32 1}
!476 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 75, type: !477, scopeLine: 76, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !6}
!479 = !{!480}
!480 = !DILocalVariable(name: "status", arg: 1, scope: !476, file: !3, line: 75, type: !6)
!481 = !DILocation(line: 0, scope: !476)
!482 = !DILocation(line: 77, column: 14, scope: !483)
!483 = distinct !DILexicalBlock(scope: !476, file: !3, line: 77, column: 7)
!484 = !DILocation(line: 77, column: 7, scope: !476)
!485 = !DILocation(line: 78, column: 5, scope: !486)
!486 = distinct !DILexicalBlock(scope: !483, file: !3, line: 78, column: 5)
!487 = !{!488, !488, i64 0}
!488 = !{!"any pointer", !489, i64 0}
!489 = !{!"omnipotent char", !490, i64 0}
!490 = !{!"Simple C/C++ TBAA"}
!491 = !DILocation(line: 81, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !483, file: !3, line: 80, column: 5)
!493 = !DILocation(line: 729, column: 3, scope: !494, inlinedAt: !496)
!494 = distinct !DISubprogram(name: "emit_stdin_note", scope: !64, file: !64, line: 727, type: !240, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !495)
!495 = !{}
!496 = distinct !DILocation(line: 86, column: 7, scope: !492)
!497 = !DILocation(line: 88, column: 7, scope: !492)
!498 = !DILocation(line: 91, column: 7, scope: !492)
!499 = !DILocation(line: 92, column: 7, scope: !492)
!500 = !DILocalVariable(name: "program", arg: 1, scope: !501, file: !64, line: 836, type: !57)
!501 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !64, file: !64, line: 836, type: !502, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !57}
!504 = !{!500, !505, !514, !515, !517, !518}
!505 = !DILocalVariable(name: "infomap", scope: !501, file: !64, line: 838, type: !506)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 896, elements: !512)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !501, file: !64, line: 838, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !508, file: !64, line: 838, baseType: !57, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !64, line: 838, baseType: !57, size: 64, offset: 64)
!512 = !{!513}
!513 = !DISubrange(count: 7)
!514 = !DILocalVariable(name: "node", scope: !501, file: !64, line: 848, type: !57)
!515 = !DILocalVariable(name: "map_prog", scope: !501, file: !64, line: 849, type: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!517 = !DILocalVariable(name: "lc_messages", scope: !501, file: !64, line: 861, type: !57)
!518 = !DILocalVariable(name: "url_program", scope: !501, file: !64, line: 874, type: !57)
!519 = !DILocation(line: 0, scope: !501, inlinedAt: !520)
!520 = distinct !DILocation(line: 93, column: 7, scope: !492)
!521 = !DILocation(line: 838, column: 3, scope: !501, inlinedAt: !520)
!522 = !DILocation(line: 838, column: 67, scope: !501, inlinedAt: !520)
!523 = !DILocation(line: 849, column: 36, scope: !501, inlinedAt: !520)
!524 = !DILocation(line: 851, column: 3, scope: !501, inlinedAt: !520)
!525 = !DILocalVariable(name: "__s1", arg: 1, scope: !526, file: !527, line: 1359, type: !57)
!526 = distinct !DISubprogram(name: "streq", scope: !527, file: !527, line: 1359, type: !528, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !530)
!527 = !DIFile(filename: "./lib/string.h", directory: "/src")
!528 = !DISubroutineType(types: !529)
!529 = !{!74, !57, !57}
!530 = !{!525, !531}
!531 = !DILocalVariable(name: "__s2", arg: 2, scope: !526, file: !527, line: 1359, type: !57)
!532 = !DILocation(line: 0, scope: !526, inlinedAt: !533)
!533 = distinct !DILocation(line: 851, column: 33, scope: !501, inlinedAt: !520)
!534 = !DILocation(line: 1361, column: 11, scope: !526, inlinedAt: !533)
!535 = !DILocation(line: 1361, column: 10, scope: !526, inlinedAt: !533)
!536 = !DILocation(line: 852, column: 13, scope: !501, inlinedAt: !520)
!537 = !DILocation(line: 851, column: 20, scope: !501, inlinedAt: !520)
!538 = !{!539, !488, i64 0}
!539 = !{!"infomap", !488, i64 0, !488, i64 8}
!540 = !DILocation(line: 851, column: 10, scope: !501, inlinedAt: !520)
!541 = !DILocation(line: 851, column: 28, scope: !501, inlinedAt: !520)
!542 = distinct !{!542, !524, !536, !543}
!543 = !{!"llvm.loop.mustprogress"}
!544 = !DILocation(line: 854, column: 17, scope: !545, inlinedAt: !520)
!545 = distinct !DILexicalBlock(scope: !501, file: !64, line: 854, column: 7)
!546 = !{!539, !488, i64 8}
!547 = !DILocation(line: 854, column: 7, scope: !545, inlinedAt: !520)
!548 = !DILocation(line: 854, column: 7, scope: !501, inlinedAt: !520)
!549 = !DILocation(line: 857, column: 3, scope: !501, inlinedAt: !520)
!550 = !DILocation(line: 861, column: 29, scope: !501, inlinedAt: !520)
!551 = !DILocation(line: 862, column: 7, scope: !552, inlinedAt: !520)
!552 = distinct !DILexicalBlock(scope: !501, file: !64, line: 862, column: 7)
!553 = !DILocation(line: 862, column: 19, scope: !552, inlinedAt: !520)
!554 = !DILocation(line: 862, column: 22, scope: !552, inlinedAt: !520)
!555 = !DILocation(line: 862, column: 7, scope: !501, inlinedAt: !520)
!556 = !DILocation(line: 868, column: 7, scope: !557, inlinedAt: !520)
!557 = distinct !DILexicalBlock(scope: !552, file: !64, line: 863, column: 5)
!558 = !DILocation(line: 870, column: 5, scope: !557, inlinedAt: !520)
!559 = !DILocation(line: 0, scope: !526, inlinedAt: !560)
!560 = distinct !DILocation(line: 874, column: 29, scope: !501, inlinedAt: !520)
!561 = !DILocation(line: 875, column: 3, scope: !501, inlinedAt: !520)
!562 = !DILocation(line: 877, column: 3, scope: !501, inlinedAt: !520)
!563 = !DILocation(line: 879, column: 1, scope: !501, inlinedAt: !520)
!564 = !DILocation(line: 96, column: 3, scope: !476)
!565 = !DISubprogram(name: "dcgettext", scope: !566, file: !566, line: 51, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!566 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!567 = !DISubroutineType(types: !568)
!568 = !{!8, !57, !57, !6}
!569 = !DISubprogram(name: "fputs_unlocked", scope: !213, file: !213, line: 691, type: !570, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!570 = !DISubroutineType(types: !571)
!571 = !{!6, !572, !573}
!572 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !57)
!573 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!574 = !DILocation(line: 0, scope: !63)
!575 = !DILocation(line: 581, column: 7, scope: !72)
!576 = !{!577, !577, i64 0}
!577 = !{!"int", !489, i64 0}
!578 = !DILocation(line: 581, column: 19, scope: !72)
!579 = !DILocation(line: 581, column: 7, scope: !63)
!580 = !DILocation(line: 585, column: 26, scope: !71)
!581 = !DILocation(line: 0, scope: !71)
!582 = !DILocation(line: 586, column: 23, scope: !71)
!583 = !DILocation(line: 586, column: 28, scope: !71)
!584 = !DILocation(line: 586, column: 32, scope: !71)
!585 = !{!489, !489, i64 0}
!586 = !DILocation(line: 586, column: 38, scope: !71)
!587 = !DILocation(line: 0, scope: !526, inlinedAt: !588)
!588 = distinct !DILocation(line: 586, column: 41, scope: !71)
!589 = !DILocation(line: 1361, column: 11, scope: !526, inlinedAt: !588)
!590 = !DILocation(line: 1361, column: 10, scope: !526, inlinedAt: !588)
!591 = !DILocation(line: 586, column: 19, scope: !71)
!592 = !DILocation(line: 587, column: 5, scope: !71)
!593 = !DILocation(line: 588, column: 7, scope: !594)
!594 = distinct !DILexicalBlock(scope: !63, file: !64, line: 588, column: 7)
!595 = !DILocation(line: 588, column: 7, scope: !63)
!596 = !DILocation(line: 590, column: 7, scope: !597)
!597 = distinct !DILexicalBlock(scope: !594, file: !64, line: 589, column: 5)
!598 = !DILocation(line: 591, column: 7, scope: !597)
!599 = !DILocation(line: 595, column: 37, scope: !63)
!600 = !DILocation(line: 595, column: 35, scope: !63)
!601 = !DILocation(line: 596, column: 29, scope: !63)
!602 = !DILocation(line: 597, column: 8, scope: !80)
!603 = !DILocation(line: 597, column: 7, scope: !63)
!604 = !DILocation(line: 604, column: 24, scope: !79)
!605 = !DILocation(line: 604, column: 12, scope: !80)
!606 = !DILocation(line: 0, scope: !78)
!607 = !DILocation(line: 610, column: 16, scope: !78)
!608 = !DILocation(line: 610, column: 7, scope: !78)
!609 = !DILocation(line: 611, column: 21, scope: !78)
!610 = !{!611, !611, i64 0}
!611 = !{!"short", !489, i64 0}
!612 = !DILocation(line: 611, column: 19, scope: !78)
!613 = !DILocation(line: 611, column: 16, scope: !78)
!614 = !DILocation(line: 610, column: 30, scope: !78)
!615 = distinct !{!615, !608, !609, !543}
!616 = !DILocation(line: 612, column: 18, scope: !617)
!617 = distinct !DILexicalBlock(scope: !78, file: !64, line: 612, column: 11)
!618 = !DILocation(line: 612, column: 11, scope: !78)
!619 = !DILocation(line: 620, column: 23, scope: !63)
!620 = !DILocation(line: 625, column: 39, scope: !63)
!621 = !DILocation(line: 626, column: 3, scope: !63)
!622 = !DILocation(line: 626, column: 10, scope: !63)
!623 = !DILocation(line: 626, column: 21, scope: !63)
!624 = !DILocation(line: 628, column: 44, scope: !625)
!625 = distinct !DILexicalBlock(scope: !626, file: !64, line: 628, column: 11)
!626 = distinct !DILexicalBlock(scope: !63, file: !64, line: 627, column: 5)
!627 = !DILocation(line: 628, column: 32, scope: !625)
!628 = !DILocation(line: 628, column: 49, scope: !625)
!629 = !DILocation(line: 628, column: 11, scope: !626)
!630 = !DILocation(line: 630, column: 11, scope: !631)
!631 = distinct !DILexicalBlock(scope: !626, file: !64, line: 630, column: 11)
!632 = !DILocation(line: 630, column: 11, scope: !626)
!633 = !DILocation(line: 632, column: 26, scope: !634)
!634 = distinct !DILexicalBlock(scope: !635, file: !64, line: 632, column: 15)
!635 = distinct !DILexicalBlock(scope: !631, file: !64, line: 631, column: 9)
!636 = !DILocation(line: 632, column: 34, scope: !634)
!637 = !DILocation(line: 632, column: 37, scope: !634)
!638 = !DILocation(line: 632, column: 15, scope: !635)
!639 = !DILocation(line: 636, column: 29, scope: !640)
!640 = distinct !DILexicalBlock(scope: !635, file: !64, line: 636, column: 15)
!641 = !DILocation(line: 640, column: 16, scope: !626)
!642 = distinct !{!642, !621, !643, !543}
!643 = !DILocation(line: 641, column: 5, scope: !63)
!644 = !DILocation(line: 644, column: 3, scope: !63)
!645 = !DILocation(line: 0, scope: !526, inlinedAt: !646)
!646 = distinct !DILocation(line: 648, column: 31, scope: !63)
!647 = !DILocation(line: 0, scope: !526, inlinedAt: !648)
!648 = distinct !DILocation(line: 649, column: 31, scope: !63)
!649 = !DILocation(line: 0, scope: !526, inlinedAt: !650)
!650 = distinct !DILocation(line: 650, column: 31, scope: !63)
!651 = !DILocation(line: 0, scope: !526, inlinedAt: !652)
!652 = distinct !DILocation(line: 651, column: 31, scope: !63)
!653 = !DILocation(line: 0, scope: !526, inlinedAt: !654)
!654 = distinct !DILocation(line: 652, column: 31, scope: !63)
!655 = !DILocation(line: 0, scope: !526, inlinedAt: !656)
!656 = distinct !DILocation(line: 653, column: 31, scope: !63)
!657 = !DILocation(line: 0, scope: !526, inlinedAt: !658)
!658 = distinct !DILocation(line: 654, column: 31, scope: !63)
!659 = !DILocation(line: 0, scope: !526, inlinedAt: !660)
!660 = distinct !DILocation(line: 655, column: 31, scope: !63)
!661 = !DILocation(line: 0, scope: !526, inlinedAt: !662)
!662 = distinct !DILocation(line: 656, column: 31, scope: !63)
!663 = !DILocation(line: 0, scope: !526, inlinedAt: !664)
!664 = distinct !DILocation(line: 657, column: 31, scope: !63)
!665 = !DILocation(line: 663, column: 7, scope: !666)
!666 = distinct !DILexicalBlock(scope: !63, file: !64, line: 663, column: 7)
!667 = !DILocation(line: 664, column: 7, scope: !666)
!668 = !DILocation(line: 664, column: 10, scope: !666)
!669 = !DILocation(line: 663, column: 7, scope: !63)
!670 = !DILocation(line: 669, column: 7, scope: !671)
!671 = distinct !DILexicalBlock(scope: !666, file: !64, line: 665, column: 5)
!672 = !DILocation(line: 671, column: 5, scope: !671)
!673 = !DILocation(line: 676, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !666, file: !64, line: 673, column: 5)
!675 = !DILocation(line: 679, column: 3, scope: !63)
!676 = !DILocation(line: 683, column: 3, scope: !63)
!677 = !DILocation(line: 686, column: 3, scope: !63)
!678 = !DILocation(line: 688, column: 3, scope: !63)
!679 = !DILocation(line: 691, column: 3, scope: !63)
!680 = !DILocation(line: 695, column: 3, scope: !63)
!681 = !DILocation(line: 696, column: 1, scope: !63)
!682 = !DISubprogram(name: "setlocale", scope: !683, file: !683, line: 122, type: !684, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!683 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!684 = !DISubroutineType(types: !685)
!685 = !{!8, !6, !57}
!686 = !DISubprogram(name: "getenv", scope: !687, file: !687, line: 641, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!687 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!688 = !DISubroutineType(types: !689)
!689 = !{!8, !57}
!690 = !DISubprogram(name: "fwrite_unlocked", scope: !213, file: !213, line: 704, type: !691, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!691 = !DISubroutineType(types: !692)
!692 = !{!54, !693, !54, !54, !573}
!693 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!696 = !DILocation(line: 0, scope: !2)
!697 = !DILocation(line: 534, column: 21, scope: !2)
!698 = !DILocation(line: 534, column: 3, scope: !2)
!699 = !DILocation(line: 535, column: 3, scope: !2)
!700 = !DILocation(line: 536, column: 3, scope: !2)
!701 = !DILocation(line: 537, column: 3, scope: !2)
!702 = !DILocation(line: 539, column: 3, scope: !2)
!703 = !DILocation(line: 541, column: 3, scope: !2)
!704 = !DILocation(line: 549, column: 15, scope: !176)
!705 = !DILocation(line: 0, scope: !176)
!706 = !DILocation(line: 551, column: 11, scope: !176)
!707 = !DILocation(line: 559, column: 9, scope: !708)
!708 = distinct !DILexicalBlock(scope: !176, file: !3, line: 555, column: 9)
!709 = !DILocation(line: 561, column: 9, scope: !708)
!710 = !DILocation(line: 564, column: 11, scope: !708)
!711 = !DILocation(line: 568, column: 18, scope: !712)
!712 = distinct !DILexicalBlock(scope: !2, file: !3, line: 568, column: 7)
!713 = !DILocation(line: 568, column: 16, scope: !712)
!714 = !DILocation(line: 568, column: 9, scope: !712)
!715 = !DILocation(line: 568, column: 7, scope: !2)
!716 = !DILocation(line: 570, column: 7, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !3, line: 569, column: 5)
!718 = !DILocation(line: 571, column: 7, scope: !717)
!719 = !DILocation(line: 574, column: 17, scope: !2)
!720 = !DILocation(line: 574, column: 10, scope: !2)
!721 = !DILocation(line: 574, column: 33, scope: !2)
!722 = !DILocation(line: 574, column: 3, scope: !2)
!723 = !DISubprogram(name: "bindtextdomain", scope: !566, file: !566, line: 86, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!724 = !DISubroutineType(types: !725)
!725 = !{!8, !57, !57}
!726 = !DISubprogram(name: "textdomain", scope: !566, file: !566, line: 82, type: !688, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!727 = !DISubprogram(name: "atexit", scope: !687, file: !687, line: 602, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!728 = !DISubroutineType(types: !729)
!729 = !{!6, !239}
!730 = !DISubprogram(name: "getopt_long", scope: !180, file: !180, line: 66, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!731 = !DISubroutineType(types: !732)
!732 = !{!6, !6, !733, !57, !735, !185}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!736 = distinct !DISubprogram(name: "tsort", scope: !3, file: !3, line: 429, type: !502, scopeLine: 430, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !737)
!737 = !{!738, !739, !740, !741, !742, !749, !750, !751, !753}
!738 = !DILocalVariable(name: "file", arg: 1, scope: !736, file: !3, line: 429, type: !57)
!739 = !DILocalVariable(name: "ok", scope: !736, file: !3, line: 431, type: !74)
!740 = !DILocalVariable(name: "j", scope: !736, file: !3, line: 432, type: !152)
!741 = !DILocalVariable(name: "k", scope: !736, file: !3, line: 433, type: !152)
!742 = !DILocalVariable(name: "tokenbuffer", scope: !736, file: !3, line: 434, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_buffer", file: !744, line: 38, baseType: !745)
!744 = !DIFile(filename: "./lib/readtokens.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75cc48641d199743577b153a0d1c82de")
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tokenbuffer", file: !744, line: 33, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !744, line: 35, baseType: !54, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !745, file: !744, line: 36, baseType: !8, size: 64, offset: 64)
!749 = !DILocalVariable(name: "is_stdin", scope: !736, file: !3, line: 435, type: !74)
!750 = !DILocalVariable(name: "root", scope: !736, file: !3, line: 438, type: !152)
!751 = !DILocalVariable(name: "len", scope: !752, file: !3, line: 450, type: !54)
!752 = distinct !DILexicalBlock(scope: !736, file: !3, line: 448, column: 5)
!753 = !DILocalVariable(name: "p", scope: !754, file: !3, line: 485, type: !163)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 484, column: 9)
!755 = distinct !DILexicalBlock(scope: !736, file: !3, line: 479, column: 5)
!756 = !DILocation(line: 0, scope: !736)
!757 = !DILocation(line: 434, column: 3, scope: !736)
!758 = !DILocation(line: 434, column: 16, scope: !736)
!759 = !DILocation(line: 0, scope: !526, inlinedAt: !760)
!760 = distinct !DILocation(line: 435, column: 19, scope: !736)
!761 = !DILocation(line: 1361, column: 11, scope: !526, inlinedAt: !760)
!762 = !DILocation(line: 1361, column: 10, scope: !526, inlinedAt: !760)
!763 = !DILocalVariable(name: "str", arg: 1, scope: !764, file: !3, line: 101, type: !57)
!764 = distinct !DISubprogram(name: "new_item", scope: !3, file: !3, line: 101, type: !765, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !767)
!765 = !DISubroutineType(types: !766)
!766 = !{!152, !57}
!767 = !{!763, !768}
!768 = !DILocalVariable(name: "k", scope: !764, file: !3, line: 104, type: !152)
!769 = !DILocation(line: 0, scope: !764, inlinedAt: !770)
!770 = distinct !DILocation(line: 438, column: 23, scope: !736)
!771 = !DILocation(line: 104, column: 20, scope: !764, inlinedAt: !770)
!772 = !DILocation(line: 440, column: 17, scope: !773)
!773 = distinct !DILexicalBlock(scope: !736, file: !3, line: 440, column: 7)
!774 = !DILocation(line: 440, column: 42, scope: !773)
!775 = !DILocation(line: 440, column: 22, scope: !773)
!776 = !DILocation(line: 440, column: 7, scope: !736)
!777 = !DILocation(line: 441, column: 5, scope: !773)
!778 = !DILocation(line: 443, column: 12, scope: !736)
!779 = !DILocation(line: 443, column: 3, scope: !736)
!780 = !DILocation(line: 445, column: 3, scope: !736)
!781 = !DILocation(line: 447, column: 3, scope: !736)
!782 = !DILocation(line: 433, column: 16, scope: !736)
!783 = !DILocation(line: 450, column: 31, scope: !752)
!784 = !DILocation(line: 450, column: 20, scope: !752)
!785 = !DILocation(line: 0, scope: !752)
!786 = !DILocation(line: 451, column: 11, scope: !752)
!787 = !DILocation(line: 453, column: 15, scope: !788)
!788 = distinct !DILexicalBlock(scope: !789, file: !3, line: 453, column: 15)
!789 = distinct !DILexicalBlock(scope: !790, file: !3, line: 452, column: 9)
!790 = distinct !DILexicalBlock(scope: !752, file: !3, line: 451, column: 11)
!791 = !DILocalVariable(name: "__stream", arg: 1, scope: !792, file: !793, line: 135, type: !87)
!792 = distinct !DISubprogram(name: "ferror_unlocked", scope: !793, file: !793, line: 135, type: !794, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !796)
!793 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!794 = !DISubroutineType(types: !795)
!795 = !{!6, !87}
!796 = !{!791}
!797 = !DILocation(line: 0, scope: !792, inlinedAt: !798)
!798 = distinct !DILocation(line: 453, column: 15, scope: !788)
!799 = !DILocation(line: 137, column: 10, scope: !792, inlinedAt: !798)
!800 = !{!801, !577, i64 0}
!801 = !{!"_IO_FILE", !577, i64 0, !488, i64 8, !488, i64 16, !488, i64 24, !488, i64 32, !488, i64 40, !488, i64 48, !488, i64 56, !488, i64 64, !488, i64 72, !488, i64 80, !488, i64 88, !488, i64 96, !488, i64 104, !577, i64 112, !577, i64 116, !802, i64 120, !611, i64 128, !489, i64 130, !489, i64 131, !488, i64 136, !802, i64 144, !488, i64 152, !488, i64 160, !488, i64 168, !488, i64 176, !802, i64 184, !577, i64 192, !489, i64 196}
!802 = !{!"long", !489, i64 0}
!803 = !DILocation(line: 453, column: 15, scope: !789)
!804 = !DILocation(line: 454, column: 13, scope: !788)
!805 = !DILocation(line: 458, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !807, file: !3, line: 458, column: 7)
!807 = distinct !DILexicalBlock(scope: !752, file: !3, line: 458, column: 7)
!808 = !DILocation(line: 460, column: 42, scope: !752)
!809 = !{!810, !488, i64 8}
!810 = !{!"tokenbuffer", !802, i64 0, !488, i64 8}
!811 = !DILocalVariable(name: "root", arg: 1, scope: !812, file: !3, line: 119, type: !152)
!812 = distinct !DISubprogram(name: "search_item", scope: !3, file: !3, line: 119, type: !813, scopeLine: 120, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !815)
!813 = !DISubroutineType(types: !814)
!814 = !{!152, !152, !57}
!815 = !{!811, !816, !817, !818, !819, !820, !821, !822, !823}
!816 = !DILocalVariable(name: "str", arg: 2, scope: !812, file: !3, line: 119, type: !57)
!817 = !DILocalVariable(name: "p", scope: !812, file: !3, line: 121, type: !152)
!818 = !DILocalVariable(name: "q", scope: !812, file: !3, line: 121, type: !152)
!819 = !DILocalVariable(name: "r", scope: !812, file: !3, line: 121, type: !152)
!820 = !DILocalVariable(name: "s", scope: !812, file: !3, line: 121, type: !152)
!821 = !DILocalVariable(name: "t", scope: !812, file: !3, line: 121, type: !152)
!822 = !DILocalVariable(name: "a", scope: !812, file: !3, line: 122, type: !6)
!823 = !DILocalVariable(name: "cmp", scope: !824, file: !3, line: 173, type: !6)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 172, column: 13)
!825 = distinct !DILexicalBlock(scope: !826, file: !3, line: 147, column: 9)
!826 = distinct !DILexicalBlock(scope: !827, file: !3, line: 146, column: 11)
!827 = distinct !DILexicalBlock(scope: !812, file: !3, line: 134, column: 5)
!828 = !DILocation(line: 0, scope: !812, inlinedAt: !829)
!829 = distinct !DILocation(line: 460, column: 11, scope: !752)
!830 = !DILocation(line: 126, column: 13, scope: !831, inlinedAt: !829)
!831 = distinct !DILexicalBlock(scope: !812, file: !3, line: 126, column: 7)
!832 = !{!833, !488, i64 16}
!833 = !{!"item", !488, i64 0, !488, i64 8, !488, i64 16, !489, i64 24, !834, i64 25, !802, i64 32, !488, i64 40, !488, i64 48}
!834 = !{!"_Bool", !489, i64 0}
!835 = !DILocation(line: 126, column: 19, scope: !831, inlinedAt: !829)
!836 = !DILocation(line: 126, column: 7, scope: !812, inlinedAt: !829)
!837 = !DILocation(line: 136, column: 27, scope: !827, inlinedAt: !829)
!838 = !{!833, !488, i64 0}
!839 = !DILocation(line: 136, column: 11, scope: !827, inlinedAt: !829)
!840 = !DILocation(line: 137, column: 13, scope: !841, inlinedAt: !829)
!841 = distinct !DILexicalBlock(scope: !827, file: !3, line: 137, column: 11)
!842 = !DILocation(line: 137, column: 11, scope: !827, inlinedAt: !829)
!843 = !DILocation(line: 0, scope: !764, inlinedAt: !844)
!844 = distinct !DILocation(line: 127, column: 27, scope: !831, inlinedAt: !829)
!845 = !DILocation(line: 104, column: 20, scope: !764, inlinedAt: !844)
!846 = !DILocation(line: 105, column: 7, scope: !847, inlinedAt: !844)
!847 = distinct !DILexicalBlock(scope: !764, file: !3, line: 105, column: 7)
!848 = !DILocation(line: 105, column: 7, scope: !764, inlinedAt: !844)
!849 = !DILocation(line: 106, column: 14, scope: !847, inlinedAt: !844)
!850 = !DILocation(line: 106, column: 8, scope: !847, inlinedAt: !844)
!851 = !DILocation(line: 106, column: 12, scope: !847, inlinedAt: !844)
!852 = !DILocation(line: 106, column: 5, scope: !847, inlinedAt: !844)
!853 = !DILocation(line: 127, column: 25, scope: !831, inlinedAt: !829)
!854 = !DILocation(line: 127, column: 5, scope: !831, inlinedAt: !829)
!855 = !DILocation(line: 141, column: 13, scope: !856, inlinedAt: !829)
!856 = distinct !DILexicalBlock(scope: !827, file: !3, line: 141, column: 11)
!857 = !DILocation(line: 141, column: 11, scope: !827, inlinedAt: !829)
!858 = !DILocation(line: 0, scope: !856, inlinedAt: !829)
!859 = !DILocation(line: 146, column: 13, scope: !826, inlinedAt: !829)
!860 = !DILocation(line: 146, column: 11, scope: !827, inlinedAt: !829)
!861 = !DILocation(line: 0, scope: !764, inlinedAt: !862)
!862 = distinct !DILocation(line: 149, column: 15, scope: !825, inlinedAt: !829)
!863 = !DILocation(line: 104, column: 20, scope: !764, inlinedAt: !862)
!864 = !DILocation(line: 105, column: 7, scope: !847, inlinedAt: !862)
!865 = !DILocation(line: 105, column: 7, scope: !764, inlinedAt: !862)
!866 = !DILocation(line: 106, column: 14, scope: !847, inlinedAt: !862)
!867 = !DILocation(line: 106, column: 8, scope: !847, inlinedAt: !862)
!868 = !DILocation(line: 106, column: 12, scope: !847, inlinedAt: !862)
!869 = !DILocation(line: 106, column: 5, scope: !847, inlinedAt: !862)
!870 = !DILocation(line: 0, scope: !871, inlinedAt: !829)
!871 = distinct !DILexicalBlock(scope: !825, file: !3, line: 152, column: 15)
!872 = !DILocation(line: 158, column: 31, scope: !825, inlinedAt: !829)
!873 = !DILocation(line: 158, column: 15, scope: !825, inlinedAt: !829)
!874 = !DILocation(line: 159, column: 17, scope: !875, inlinedAt: !829)
!875 = distinct !DILexicalBlock(scope: !825, file: !3, line: 159, column: 15)
!876 = !DILocation(line: 159, column: 15, scope: !825, inlinedAt: !829)
!877 = !DILocation(line: 161, column: 26, scope: !878, inlinedAt: !829)
!878 = distinct !DILexicalBlock(scope: !875, file: !3, line: 160, column: 13)
!879 = !DILocation(line: 163, column: 13, scope: !878, inlinedAt: !829)
!880 = !DILocation(line: 166, column: 15, scope: !881, inlinedAt: !829)
!881 = distinct !DILexicalBlock(scope: !882, file: !3, line: 166, column: 15)
!882 = distinct !DILexicalBlock(scope: !883, file: !3, line: 166, column: 15)
!883 = distinct !DILexicalBlock(scope: !875, file: !3, line: 165, column: 13)
!884 = !DILocation(line: 166, column: 15, scope: !882, inlinedAt: !829)
!885 = !DILocation(line: 167, column: 26, scope: !883, inlinedAt: !829)
!886 = !DILocation(line: 0, scope: !875, inlinedAt: !829)
!887 = !DILocation(line: 171, column: 20, scope: !825, inlinedAt: !829)
!888 = !DILocation(line: 171, column: 11, scope: !825, inlinedAt: !829)
!889 = !DILocation(line: 173, column: 41, scope: !824, inlinedAt: !829)
!890 = !DILocation(line: 173, column: 25, scope: !824, inlinedAt: !829)
!891 = !DILocation(line: 0, scope: !824, inlinedAt: !829)
!892 = !DILocation(line: 174, column: 23, scope: !893, inlinedAt: !829)
!893 = distinct !DILexicalBlock(scope: !824, file: !3, line: 174, column: 19)
!894 = !DILocation(line: 174, column: 19, scope: !824, inlinedAt: !829)
!895 = !DILocation(line: 176, column: 22, scope: !896, inlinedAt: !829)
!896 = distinct !DILexicalBlock(scope: !893, file: !3, line: 175, column: 17)
!897 = !DILocation(line: 176, column: 30, scope: !896, inlinedAt: !829)
!898 = !{!833, !489, i64 24}
!899 = !DILocation(line: 177, column: 26, scope: !896, inlinedAt: !829)
!900 = !DILocation(line: 178, column: 17, scope: !896, inlinedAt: !829)
!901 = !DILocation(line: 181, column: 19, scope: !902, inlinedAt: !829)
!902 = distinct !DILexicalBlock(scope: !903, file: !3, line: 181, column: 19)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 181, column: 19)
!904 = distinct !DILexicalBlock(scope: !893, file: !3, line: 180, column: 17)
!905 = !DILocation(line: 181, column: 19, scope: !903, inlinedAt: !829)
!906 = !DILocation(line: 182, column: 22, scope: !904, inlinedAt: !829)
!907 = !DILocation(line: 182, column: 30, scope: !904, inlinedAt: !829)
!908 = !DILocation(line: 183, column: 26, scope: !904, inlinedAt: !829)
!909 = !DILocation(line: 0, scope: !893, inlinedAt: !829)
!910 = distinct !{!910, !888, !911, !543}
!911 = !DILocation(line: 185, column: 13, scope: !825, inlinedAt: !829)
!912 = !DILocation(line: 188, column: 18, scope: !913, inlinedAt: !829)
!913 = distinct !DILexicalBlock(scope: !825, file: !3, line: 188, column: 15)
!914 = !DILocation(line: 188, column: 26, scope: !913, inlinedAt: !829)
!915 = !DILocation(line: 188, column: 31, scope: !913, inlinedAt: !829)
!916 = !DILocation(line: 188, column: 15, scope: !913, inlinedAt: !829)
!917 = !DILocation(line: 188, column: 48, scope: !913, inlinedAt: !829)
!918 = !DILocation(line: 188, column: 45, scope: !913, inlinedAt: !829)
!919 = !DILocation(line: 188, column: 15, scope: !825, inlinedAt: !829)
!920 = !DILocation(line: 190, column: 26, scope: !921, inlinedAt: !829)
!921 = distinct !DILexicalBlock(scope: !913, file: !3, line: 189, column: 13)
!922 = !DILocation(line: 191, column: 15, scope: !921, inlinedAt: !829)
!923 = !DILocation(line: 194, column: 18, scope: !924, inlinedAt: !829)
!924 = distinct !DILexicalBlock(scope: !825, file: !3, line: 194, column: 15)
!925 = !DILocation(line: 194, column: 15, scope: !924, inlinedAt: !829)
!926 = !DILocation(line: 194, column: 26, scope: !924, inlinedAt: !829)
!927 = !DILocation(line: 194, column: 15, scope: !825, inlinedAt: !829)
!928 = !DILocation(line: 198, column: 19, scope: !929, inlinedAt: !829)
!929 = distinct !DILexicalBlock(scope: !924, file: !3, line: 195, column: 13)
!930 = !DILocation(line: 200, column: 32, scope: !931, inlinedAt: !829)
!931 = distinct !DILexicalBlock(scope: !932, file: !3, line: 199, column: 17)
!932 = distinct !DILexicalBlock(scope: !929, file: !3, line: 198, column: 19)
!933 = !DILocation(line: 200, column: 22, scope: !931, inlinedAt: !829)
!934 = !DILocation(line: 200, column: 27, scope: !931, inlinedAt: !829)
!935 = !{!833, !488, i64 8}
!936 = !DILocation(line: 202, column: 17, scope: !931, inlinedAt: !829)
!937 = !DILocation(line: 205, column: 33, scope: !938, inlinedAt: !829)
!938 = distinct !DILexicalBlock(scope: !932, file: !3, line: 204, column: 17)
!939 = !DILocation(line: 205, column: 22, scope: !938, inlinedAt: !829)
!940 = !DILocation(line: 205, column: 28, scope: !938, inlinedAt: !829)
!941 = !DILocation(line: 0, scope: !932, inlinedAt: !829)
!942 = !DILocation(line: 208, column: 39, scope: !929, inlinedAt: !829)
!943 = !DILocation(line: 209, column: 13, scope: !929, inlinedAt: !829)
!944 = !DILocation(line: 213, column: 19, scope: !945, inlinedAt: !829)
!945 = distinct !DILexicalBlock(scope: !924, file: !3, line: 211, column: 13)
!946 = !DILocation(line: 215, column: 26, scope: !947, inlinedAt: !829)
!947 = distinct !DILexicalBlock(scope: !948, file: !3, line: 214, column: 17)
!948 = distinct !DILexicalBlock(scope: !945, file: !3, line: 213, column: 19)
!949 = !DILocation(line: 216, column: 33, scope: !947, inlinedAt: !829)
!950 = !DILocation(line: 216, column: 28, scope: !947, inlinedAt: !829)
!951 = !DILocation(line: 217, column: 27, scope: !947, inlinedAt: !829)
!952 = !DILocation(line: 218, column: 32, scope: !947, inlinedAt: !829)
!953 = !DILocation(line: 218, column: 22, scope: !947, inlinedAt: !829)
!954 = !DILocation(line: 218, column: 27, scope: !947, inlinedAt: !829)
!955 = !DILocation(line: 220, column: 17, scope: !947, inlinedAt: !829)
!956 = !DILocation(line: 223, column: 26, scope: !957, inlinedAt: !829)
!957 = distinct !DILexicalBlock(scope: !948, file: !3, line: 222, column: 17)
!958 = !DILocation(line: 224, column: 32, scope: !957, inlinedAt: !829)
!959 = !DILocation(line: 224, column: 27, scope: !957, inlinedAt: !829)
!960 = !DILocation(line: 225, column: 28, scope: !957, inlinedAt: !829)
!961 = !DILocation(line: 226, column: 33, scope: !957, inlinedAt: !829)
!962 = !DILocation(line: 226, column: 22, scope: !957, inlinedAt: !829)
!963 = !DILocation(line: 226, column: 28, scope: !957, inlinedAt: !829)
!964 = !DILocation(line: 0, scope: !948, inlinedAt: !829)
!965 = !DILocation(line: 230, column: 26, scope: !945, inlinedAt: !829)
!966 = !DILocation(line: 231, column: 26, scope: !945, inlinedAt: !829)
!967 = !DILocation(line: 232, column: 22, scope: !968, inlinedAt: !829)
!968 = distinct !DILexicalBlock(scope: !945, file: !3, line: 232, column: 19)
!969 = !DILocation(line: 232, column: 19, scope: !968, inlinedAt: !829)
!970 = !DILocation(line: 232, column: 30, scope: !968, inlinedAt: !829)
!971 = !DILocation(line: 232, column: 19, scope: !945, inlinedAt: !829)
!972 = !DILocation(line: 234, column: 35, scope: !973, inlinedAt: !829)
!973 = distinct !DILexicalBlock(scope: !968, file: !3, line: 234, column: 24)
!974 = !DILocation(line: 234, column: 24, scope: !968, inlinedAt: !829)
!975 = !DILocation(line: 0, scope: !968, inlinedAt: !829)
!976 = !DILocation(line: 236, column: 26, scope: !945, inlinedAt: !829)
!977 = !DILocation(line: 0, scope: !924, inlinedAt: !829)
!978 = !DILocation(line: 240, column: 23, scope: !979, inlinedAt: !829)
!979 = distinct !DILexicalBlock(scope: !825, file: !3, line: 240, column: 15)
!980 = !DILocation(line: 240, column: 17, scope: !979, inlinedAt: !829)
!981 = !DILocation(line: 240, column: 15, scope: !825, inlinedAt: !829)
!982 = !DILocation(line: 241, column: 22, scope: !979, inlinedAt: !829)
!983 = !DILocation(line: 241, column: 13, scope: !979, inlinedAt: !829)
!984 = !DILocation(line: 243, column: 16, scope: !979, inlinedAt: !829)
!985 = !DILocation(line: 243, column: 21, scope: !979, inlinedAt: !829)
!986 = !DILocation(line: 249, column: 14, scope: !987, inlinedAt: !829)
!987 = distinct !DILexicalBlock(scope: !827, file: !3, line: 249, column: 11)
!988 = !DILocation(line: 249, column: 11, scope: !987, inlinedAt: !829)
!989 = !DILocation(line: 249, column: 11, scope: !827, inlinedAt: !829)
!990 = distinct !{!990, !991, !992}
!991 = !DILocation(line: 133, column: 3, scope: !812, inlinedAt: !829)
!992 = !DILocation(line: 256, column: 5, scope: !812, inlinedAt: !829)
!993 = !DILocation(line: 461, column: 11, scope: !994)
!994 = distinct !DILexicalBlock(scope: !752, file: !3, line: 461, column: 11)
!995 = !DILocation(line: 461, column: 11, scope: !752)
!996 = !DILocalVariable(name: "j", arg: 1, scope: !997, file: !3, line: 264, type: !152)
!997 = distinct !DISubprogram(name: "record_relation", scope: !3, file: !3, line: 264, type: !998, scopeLine: 265, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1000)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !152, !152}
!1000 = !{!996, !1001, !1002}
!1001 = !DILocalVariable(name: "k", arg: 2, scope: !997, file: !3, line: 264, type: !152)
!1002 = !DILocalVariable(name: "p", scope: !997, file: !3, line: 266, type: !163)
!1003 = !DILocation(line: 0, scope: !997, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 464, column: 11, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !994, file: !3, line: 462, column: 9)
!1006 = !DILocation(line: 268, column: 18, scope: !1007, inlinedAt: !1004)
!1007 = distinct !DILexicalBlock(scope: !997, file: !3, line: 268, column: 7)
!1008 = !DILocation(line: 268, column: 26, scope: !1007, inlinedAt: !1004)
!1009 = !DILocation(line: 0, scope: !526, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 268, column: 8, scope: !1007, inlinedAt: !1004)
!1011 = !DILocation(line: 1361, column: 11, scope: !526, inlinedAt: !1010)
!1012 = !DILocation(line: 1361, column: 10, scope: !526, inlinedAt: !1010)
!1013 = !DILocation(line: 268, column: 7, scope: !997, inlinedAt: !1004)
!1014 = !DILocation(line: 270, column: 10, scope: !1015, inlinedAt: !1004)
!1015 = distinct !DILexicalBlock(scope: !1007, file: !3, line: 269, column: 5)
!1016 = !DILocation(line: 270, column: 15, scope: !1015, inlinedAt: !1004)
!1017 = !{!833, !802, i64 32}
!1018 = !DILocation(line: 271, column: 11, scope: !1015, inlinedAt: !1004)
!1019 = !DILocation(line: 272, column: 10, scope: !1015, inlinedAt: !1004)
!1020 = !DILocation(line: 272, column: 14, scope: !1015, inlinedAt: !1004)
!1021 = !{!1022, !488, i64 0}
!1022 = !{!"successor", !488, i64 0, !488, i64 8}
!1023 = !DILocation(line: 273, column: 20, scope: !1015, inlinedAt: !1004)
!1024 = !{!833, !488, i64 48}
!1025 = !DILocation(line: 273, column: 10, scope: !1015, inlinedAt: !1004)
!1026 = !DILocation(line: 273, column: 15, scope: !1015, inlinedAt: !1004)
!1027 = !{!1022, !488, i64 8}
!1028 = !DILocation(line: 274, column: 14, scope: !1015, inlinedAt: !1004)
!1029 = !DILocation(line: 275, column: 5, scope: !1015, inlinedAt: !1004)
!1030 = !DILocation(line: 471, column: 9, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !736, file: !3, line: 471, column: 7)
!1032 = !DILocation(line: 471, column: 7, scope: !736)
!1033 = !DILocation(line: 472, column: 5, scope: !1031)
!1034 = !DILocalVariable(name: "root", arg: 1, scope: !1035, file: !3, line: 420, type: !152)
!1035 = distinct !DISubprogram(name: "walk_tree", scope: !3, file: !3, line: 420, type: !1036, scopeLine: 421, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1041)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !152, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!74, !152}
!1041 = !{!1034, !1042}
!1042 = !DILocalVariable(name: "action", arg: 2, scope: !1035, file: !3, line: 420, type: !1038)
!1043 = !DILocation(line: 0, scope: !1035, inlinedAt: !1044)
!1044 = distinct !DILocation(line: 476, column: 3, scope: !736)
!1045 = !DILocation(line: 422, column: 13, scope: !1046, inlinedAt: !1044)
!1046 = distinct !DILexicalBlock(scope: !1035, file: !3, line: 422, column: 7)
!1047 = !DILocation(line: 422, column: 7, scope: !1046, inlinedAt: !1044)
!1048 = !DILocation(line: 422, column: 7, scope: !1035, inlinedAt: !1044)
!1049 = !DILocation(line: 423, column: 5, scope: !1046, inlinedAt: !1044)
!1050 = !DILocation(line: 478, column: 10, scope: !736)
!1051 = !{!802, !802, i64 0}
!1052 = !DILocation(line: 478, column: 20, scope: !736)
!1053 = !DILocation(line: 478, column: 3, scope: !736)
!1054 = !DILocation(line: 0, scope: !1035, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 481, column: 7, scope: !755)
!1056 = !DILocation(line: 422, column: 7, scope: !1035, inlinedAt: !1055)
!1057 = !DILocation(line: 423, column: 5, scope: !1046, inlinedAt: !1055)
!1058 = !DILocation(line: 483, column: 14, scope: !755)
!1059 = !DILocation(line: 483, column: 7, scope: !755)
!1060 = !DILocation(line: 510, column: 11, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !755, file: !3, line: 510, column: 11)
!1062 = !DILocation(line: 485, column: 39, scope: !754)
!1063 = !DILocation(line: 0, scope: !754)
!1064 = !DILocation(line: 488, column: 23, scope: !754)
!1065 = !DILocation(line: 488, column: 11, scope: !754)
!1066 = !DILocation(line: 489, column: 11, scope: !754)
!1067 = !DILocation(line: 489, column: 17, scope: !754)
!1068 = !DILocation(line: 489, column: 25, scope: !754)
!1069 = !{!833, !834, i64 25}
!1070 = !DILocation(line: 490, column: 20, scope: !754)
!1071 = !DILocation(line: 493, column: 11, scope: !754)
!1072 = !DILocation(line: 495, column: 18, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !754, file: !3, line: 494, column: 13)
!1074 = !DILocation(line: 495, column: 23, scope: !1073)
!1075 = !DILocation(line: 495, column: 28, scope: !1073)
!1076 = !DILocation(line: 496, column: 33, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1073, file: !3, line: 496, column: 19)
!1078 = !DILocation(line: 496, column: 19, scope: !1073)
!1079 = !DILocation(line: 498, column: 19, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1077, file: !3, line: 497, column: 17)
!1081 = !DILocation(line: 498, column: 26, scope: !1080)
!1082 = !DILocation(line: 498, column: 32, scope: !1080)
!1083 = !{!833, !488, i64 40}
!1084 = !DILocation(line: 499, column: 25, scope: !1080)
!1085 = !DILocation(line: 500, column: 17, scope: !1080)
!1086 = !DILocation(line: 502, column: 22, scope: !1073)
!1087 = distinct !{!1087, !1071, !1088, !543}
!1088 = !DILocation(line: 503, column: 13, scope: !754)
!1089 = !DILocation(line: 506, column: 24, scope: !754)
!1090 = !DILocation(line: 506, column: 16, scope: !754)
!1091 = distinct !{!1091, !1059, !1092, !543}
!1092 = !DILocation(line: 507, column: 9, scope: !755)
!1093 = !DILocation(line: 510, column: 21, scope: !1061)
!1094 = !DILocation(line: 510, column: 11, scope: !755)
!1095 = !DILocation(line: 513, column: 11, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 511, column: 9)
!1097 = !DILocation(line: 517, column: 11, scope: !1096)
!1098 = !DILocation(line: 0, scope: !1035, inlinedAt: !1099)
!1099 = distinct !DILocation(line: 518, column: 13, scope: !1096)
!1100 = !DILocation(line: 422, column: 7, scope: !1035, inlinedAt: !1099)
!1101 = !DILocation(line: 423, column: 5, scope: !1046, inlinedAt: !1099)
!1102 = !DILocation(line: 519, column: 18, scope: !1096)
!1103 = !DILocation(line: 518, column: 13, scope: !1096)
!1104 = distinct !{!1104, !1097, !1105, !543}
!1105 = !DILocation(line: 519, column: 22, scope: !1096)
!1106 = distinct !{!1106, !1053, !1107, !543}
!1107 = !DILocation(line: 521, column: 5, scope: !736)
!1108 = !DILocation(line: 523, column: 15, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !736, file: !3, line: 523, column: 7)
!1110 = !DILocation(line: 523, column: 7, scope: !1109)
!1111 = !DILocation(line: 523, column: 22, scope: !1109)
!1112 = !DILocation(line: 523, column: 7, scope: !736)
!1113 = !DILocation(line: 524, column: 5, scope: !1109)
!1114 = !DILocation(line: 527, column: 9, scope: !736)
!1115 = !DILocation(line: 527, column: 3, scope: !736)
!1116 = distinct !DISubprogram(name: "count_items", scope: !3, file: !3, line: 279, type: !1039, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1117)
!1117 = !{!1118}
!1118 = !DILocalVariable(name: "unused", arg: 1, scope: !1116, file: !3, line: 279, type: !152)
!1119 = !DILocation(line: 0, scope: !1116)
!1120 = !DILocation(line: 281, column: 12, scope: !1116)
!1121 = !DILocation(line: 282, column: 3, scope: !1116)
!1122 = distinct !DISubprogram(name: "recurse_tree", scope: !3, file: !3, line: 397, type: !1123, scopeLine: 398, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1125)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!74, !152, !1038}
!1125 = !{!1126, !1127}
!1126 = !DILocalVariable(name: "root", arg: 1, scope: !1122, file: !3, line: 397, type: !152)
!1127 = !DILocalVariable(name: "action", arg: 2, scope: !1122, file: !3, line: 397, type: !1038)
!1128 = !DILocation(line: 0, scope: !1122)
!1129 = !DILocation(line: 399, column: 13, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1122, file: !3, line: 399, column: 7)
!1131 = !DILocation(line: 399, column: 18, scope: !1130)
!1132 = !DILocation(line: 399, column: 26, scope: !1130)
!1133 = !DILocation(line: 399, column: 35, scope: !1130)
!1134 = !DILocation(line: 399, column: 41, scope: !1130)
!1135 = !DILocation(line: 399, column: 7, scope: !1122)
!1136 = !DILocation(line: 400, column: 12, scope: !1130)
!1137 = !{i1 (%struct.item*)* @count_items, i1 (%struct.item*)* @detect_loop, i1 (%struct.item*)* @scan_zeros}
!1138 = !DILocation(line: 400, column: 5, scope: !1130)
!1139 = !DILocation(line: 404, column: 13, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 404, column: 13)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 403, column: 11)
!1142 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 402, column: 5)
!1143 = !DILocation(line: 404, column: 13, scope: !1141)
!1144 = !DILocation(line: 406, column: 11, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 406, column: 11)
!1146 = !DILocation(line: 406, column: 11, scope: !1142)
!1147 = !DILocation(line: 408, column: 17, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 408, column: 11)
!1149 = !DILocation(line: 408, column: 23, scope: !1148)
!1150 = !DILocation(line: 408, column: 11, scope: !1142)
!1151 = !DILocation(line: 409, column: 13, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 409, column: 13)
!1153 = !DILocation(line: 409, column: 13, scope: !1148)
!1154 = !DILocation(line: 413, column: 3, scope: !1122)
!1155 = !DILocation(line: 414, column: 1, scope: !1122)
!1156 = distinct !DISubprogram(name: "scan_zeros", scope: !3, file: !3, line: 286, type: !1039, scopeLine: 287, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1157)
!1157 = !{!1158}
!1158 = !DILocalVariable(name: "k", arg: 1, scope: !1156, file: !3, line: 286, type: !152)
!1159 = !DILocation(line: 0, scope: !1156)
!1160 = !DILocation(line: 289, column: 10, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 289, column: 7)
!1162 = !DILocation(line: 289, column: 16, scope: !1161)
!1163 = !DILocation(line: 289, column: 21, scope: !1161)
!1164 = !DILocation(line: 289, column: 28, scope: !1161)
!1165 = !{i8 0, i8 2}
!1166 = !DILocation(line: 289, column: 7, scope: !1156)
!1167 = !DILocation(line: 291, column: 11, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !3, line: 291, column: 11)
!1169 = distinct !DILexicalBlock(scope: !1161, file: !3, line: 290, column: 5)
!1170 = !DILocation(line: 291, column: 16, scope: !1168)
!1171 = !DILocation(line: 291, column: 11, scope: !1169)
!1172 = !DILocation(line: 0, scope: !1168)
!1173 = !DILocation(line: 296, column: 13, scope: !1169)
!1174 = !DILocation(line: 297, column: 5, scope: !1169)
!1175 = !DILocation(line: 299, column: 3, scope: !1156)
!1176 = !DISubprogram(name: "puts", scope: !213, file: !213, line: 661, type: !1177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !495)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!6, !57}
!1179 = distinct !DISubprogram(name: "detect_loop", scope: !3, file: !3, line: 321, type: !1039, scopeLine: 322, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !1180)
!1180 = !{!1181, !1182, !1188, !1195, !1198}
!1181 = !DILocalVariable(name: "k", arg: 1, scope: !1179, file: !3, line: 321, type: !152)
!1182 = !DILocalVariable(name: "p", scope: !1183, file: !3, line: 333, type: !1187)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 332, column: 9)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 328, column: 11)
!1185 = distinct !DILexicalBlock(scope: !1186, file: !3, line: 324, column: 5)
!1186 = distinct !DILexicalBlock(scope: !1179, file: !3, line: 323, column: 7)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!1188 = !DILocalVariable(name: "tmp", scope: !1189, file: !3, line: 344, type: !152)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 343, column: 25)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 340, column: 21)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !3, line: 339, column: 23)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 338, column: 17)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 337, column: 19)
!1194 = distinct !DILexicalBlock(scope: !1183, file: !3, line: 336, column: 13)
!1195 = !DILocalVariable(name: "s", scope: !1196, file: !3, line: 352, type: !163)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 350, column: 29)
!1197 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 349, column: 31)
!1198 = !DILocalVariable(name: "tmp", scope: !1199, file: !3, line: 367, type: !152)
!1199 = distinct !DILexicalBlock(scope: !1190, file: !3, line: 366, column: 25)
!1200 = !DILocation(line: 0, scope: !1179)
!1201 = !DILocation(line: 323, column: 10, scope: !1186)
!1202 = !DILocation(line: 323, column: 16, scope: !1186)
!1203 = !DILocation(line: 323, column: 7, scope: !1179)
!1204 = !DILocation(line: 328, column: 11, scope: !1184)
!1205 = !DILocation(line: 328, column: 16, scope: !1184)
!1206 = !DILocation(line: 328, column: 11, scope: !1185)
!1207 = !DILocation(line: 333, column: 38, scope: !1183)
!1208 = !DILocation(line: 0, scope: !1183)
!1209 = !DILocation(line: 335, column: 18, scope: !1183)
!1210 = !DILocation(line: 335, column: 11, scope: !1183)
!1211 = !DILocation(line: 337, column: 25, scope: !1193)
!1212 = !DILocation(line: 337, column: 29, scope: !1193)
!1213 = !DILocation(line: 337, column: 19, scope: !1194)
!1214 = !DILocation(line: 385, column: 26, scope: !1194)
!1215 = distinct !{!1215, !1210, !1216, !543}
!1216 = !DILocation(line: 386, column: 13, scope: !1183)
!1217 = !DILocation(line: 339, column: 26, scope: !1191)
!1218 = !DILocation(line: 339, column: 23, scope: !1191)
!1219 = !DILocation(line: 339, column: 23, scope: !1192)
!1220 = !DILocation(line: 344, column: 52, scope: !1189)
!1221 = !DILocation(line: 0, scope: !1189)
!1222 = !DILocation(line: 346, column: 27, scope: !1189)
!1223 = !DILocation(line: 349, column: 31, scope: !1197)
!1224 = !DILocation(line: 349, column: 36, scope: !1197)
!1225 = !DILocation(line: 349, column: 31, scope: !1189)
!1226 = !DILocation(line: 361, column: 33, scope: !1189)
!1227 = !DILocation(line: 361, column: 39, scope: !1189)
!1228 = !DILocation(line: 362, column: 32, scope: !1189)
!1229 = !DILocation(line: 342, column: 23, scope: !1190)
!1230 = !DILocation(line: 352, column: 53, scope: !1196)
!1231 = !DILocation(line: 0, scope: !1196)
!1232 = !DILocation(line: 353, column: 34, scope: !1196)
!1233 = !DILocation(line: 353, column: 39, scope: !1196)
!1234 = !DILocation(line: 353, column: 44, scope: !1196)
!1235 = !DILocation(line: 354, column: 39, scope: !1196)
!1236 = !DILocation(line: 354, column: 34, scope: !1196)
!1237 = !DILocation(line: 365, column: 23, scope: !1190)
!1238 = !DILocation(line: 367, column: 52, scope: !1199)
!1239 = !DILocation(line: 0, scope: !1199)
!1240 = !DILocation(line: 369, column: 39, scope: !1199)
!1241 = distinct !{!1241, !1237, !1242, !543}
!1242 = !DILocation(line: 371, column: 25, scope: !1190)
!1243 = !DILocation(line: 379, column: 32, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1191, file: !3, line: 378, column: 21)
!1245 = !DILocation(line: 381, column: 23, scope: !1244)
!1246 = !DILocation(line: 0, scope: !1184)
!1247 = !DILocation(line: 391, column: 1, scope: !1179)
!1248 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !197, file: !197, line: 50, type: !502, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !196, retainedNodes: !1249)
!1249 = !{!1250}
!1250 = !DILocalVariable(name: "file", arg: 1, scope: !1248, file: !197, line: 50, type: !57)
!1251 = !DILocation(line: 0, scope: !1248)
!1252 = !DILocation(line: 52, column: 13, scope: !1248)
!1253 = !DILocation(line: 53, column: 1, scope: !1248)
!1254 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !197, file: !197, line: 87, type: !1255, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !196, retainedNodes: !1257)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{null, !74}
!1257 = !{!1258}
!1258 = !DILocalVariable(name: "ignore", arg: 1, scope: !1254, file: !197, line: 87, type: !74)
!1259 = !DILocation(line: 0, scope: !1254)
!1260 = !DILocation(line: 89, column: 16, scope: !1254)
!1261 = !{!834, !834, i64 0}
!1262 = !DILocation(line: 90, column: 1, scope: !1254)
!1263 = distinct !DISubprogram(name: "close_stdout", scope: !197, file: !197, line: 116, type: !240, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !196, retainedNodes: !1264)
!1264 = !{!1265}
