; ModuleID = 'src/tty.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [67 x i8] c"Print the file name of the terminal connected to standard input.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"tty\00", align 1
@.str.4 = private unnamed_addr constant [76 x i8] c"  -s, --silent, --quiet\0A         print nothing, only return an exit status\0A\00", align 1

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !39, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/tty.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19d46bb11b698354da53d591921bc5e9")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 33, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11}
!8 = !DIEnumerator(name: "TTY_STDIN_NOTTY", value: 1)
!9 = !DIEnumerator(name: "TTY_USAGE", value: 2)
!10 = !DIEnumerator(name: "TTY_WRITE_ERROR", value: 3)
!11 = !DIEnumerator(name: "TTY_TTYNAME_FAILURE", value: 4)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !6, size: 32, elements: !14)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26}
!15 = !DIEnumerator(name: "_ISupper", value: 256)
!16 = !DIEnumerator(name: "_ISlower", value: 512)
!17 = !DIEnumerator(name: "_ISalpha", value: 1024)
!18 = !DIEnumerator(name: "_ISdigit", value: 2048)
!19 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!20 = !DIEnumerator(name: "_ISspace", value: 8192)
!21 = !DIEnumerator(name: "_ISprint", value: 16384)
!22 = !DIEnumerator(name: "_ISgraph", value: 32768)
!23 = !DIEnumerator(name: "_ISblank", value: 1)
!24 = !DIEnumerator(name: "_IScntrl", value: 2)
!25 = !DIEnumerator(name: "_ISpunct", value: 4)
!26 = !DIEnumerator(name: "_ISalnum", value: 8)
!27 = !{!28, !30, !31, !32, !33, !36, !38}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 46, baseType: !35)
!34 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!35 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40, !43, !0}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "silent", scope: !2, file: !3, line: 47, type: !42, isLocal: true, isDefinition: true)
!42 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !45, file: !46, line: 575, type: !31, isLocal: true, isDefinition: true)
!45 = distinct !DISubprogram(name: "oputs_", scope: !46, file: !46, line: 573, type: !47, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !49)
!46 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !36, !36}
!49 = !{!50, !51, !52, !55, !56, !57, !58, !62, !63, !64, !65, !67, !123, !124, !125, !127, !128}
!50 = !DILocalVariable(name: "program", arg: 1, scope: !45, file: !46, line: 573, type: !36)
!51 = !DILocalVariable(name: "option", arg: 2, scope: !45, file: !46, line: 573, type: !36)
!52 = !DILocalVariable(name: "term", scope: !53, file: !46, line: 585, type: !36)
!53 = distinct !DILexicalBlock(scope: !54, file: !46, line: 582, column: 5)
!54 = distinct !DILexicalBlock(scope: !45, file: !46, line: 581, column: 7)
!55 = !DILocalVariable(name: "double_space", scope: !45, file: !46, line: 594, type: !42)
!56 = !DILocalVariable(name: "first_word", scope: !45, file: !46, line: 595, type: !36)
!57 = !DILocalVariable(name: "option_text", scope: !45, file: !46, line: 596, type: !36)
!58 = !DILocalVariable(name: "s", scope: !59, file: !46, line: 608, type: !36)
!59 = distinct !DILexicalBlock(scope: !60, file: !46, line: 605, column: 5)
!60 = distinct !DILexicalBlock(scope: !61, file: !46, line: 604, column: 12)
!61 = distinct !DILexicalBlock(scope: !45, file: !46, line: 597, column: 7)
!62 = !DILocalVariable(name: "spaces", scope: !59, file: !46, line: 609, type: !33)
!63 = !DILocalVariable(name: "anchor_len", scope: !45, file: !46, line: 620, type: !33)
!64 = !DILocalVariable(name: "desc_text", scope: !45, file: !46, line: 625, type: !36)
!65 = !DILocalVariable(name: "__ptr", scope: !66, file: !46, line: 644, type: !36)
!66 = distinct !DILexicalBlock(scope: !45, file: !46, line: 644, column: 3)
!67 = !DILocalVariable(name: "__stream", scope: !66, file: !46, line: 644, type: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 7, baseType: !71)
!70 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 49, size: 1728, elements: !73)
!72 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !89, !91, !92, !93, !97, !98, !100, !104, !107, !109, !112, !115, !116, !117, !118, !119}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 51, baseType: !31, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 54, baseType: !28, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 55, baseType: !28, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 56, baseType: !28, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 57, baseType: !28, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 58, baseType: !28, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 59, baseType: !28, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 60, baseType: !28, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 61, baseType: !28, size: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 64, baseType: !28, size: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 65, baseType: !28, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 66, baseType: !28, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 68, baseType: !87, size: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 36, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 70, baseType: !90, size: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 72, baseType: !31, size: 32, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 73, baseType: !31, size: 32, offset: 928)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 74, baseType: !94, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !95, line: 152, baseType: !96)
!95 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!96 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 77, baseType: !32, size: 16, offset: 1024)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 78, baseType: !99, size: 8, offset: 1040)
!99 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 79, baseType: !101, size: 8, offset: 1048)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 81, baseType: !105, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 43, baseType: null)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 89, baseType: !108, size: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !95, line: 153, baseType: !96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !71, file: !72, line: 91, baseType: !110, size: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !72, line: 37, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !71, file: !72, line: 92, baseType: !113, size: 64, offset: 1280)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !72, line: 38, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !71, file: !72, line: 93, baseType: !90, size: 64, offset: 1344)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !71, file: !72, line: 94, baseType: !30, size: 64, offset: 1408)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 95, baseType: !33, size: 64, offset: 1472)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 96, baseType: !31, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 98, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DILocalVariable(name: "__cnt", scope: !66, file: !46, line: 644, type: !33)
!124 = !DILocalVariable(name: "url_program", scope: !45, file: !46, line: 648, type: !36)
!125 = !DILocalVariable(name: "__ptr", scope: !126, file: !46, line: 686, type: !36)
!126 = distinct !DILexicalBlock(scope: !45, file: !46, line: 686, column: 3)
!127 = !DILocalVariable(name: "__stream", scope: !126, file: !46, line: 686, type: !68)
!128 = !DILocalVariable(name: "__cnt", scope: !126, file: !46, line: 686, type: !33)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 1280, elements: !139)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !132, line: 50, size: 256, elements: !133)
!132 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!133 = !{!134, !135, !136, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !132, line: 52, baseType: !36, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !131, file: !132, line: 55, baseType: !31, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !131, file: !132, line: 56, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !131, file: !132, line: 57, baseType: !31, size: 32, offset: 192)
!139 = !{!140}
!140 = !DISubrange(count: 5)
!141 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "Version", scope: !144, file: !145, line: 3, type: !36, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !146, splitDebugInlining: false, nameTableKind: None)
!145 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!146 = !{!142}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "file_name", scope: !149, file: !150, line: 45, type: !36, isLocal: true, isDefinition: true)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !151, splitDebugInlining: false, nameTableKind: None)
!150 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!151 = !{!147, !152}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !149, file: !150, line: 55, type: !42, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !156, file: !157, line: 66, type: !192, isLocal: false, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !158, globals: !159, splitDebugInlining: false, nameTableKind: None)
!157 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!158 = !{!30, !38}
!159 = !{!160, !186, !154, !188, !190}
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "old_file_name", scope: !162, file: !157, line: 304, type: !36, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "verror_at_line", scope: !157, file: !157, line: 298, type: !163, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !179)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !31, !31, !36, !6, !36, !165}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !166, line: 52, baseType: !167)
!166 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !168, line: 32, baseType: !169)
!168 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !170, baseType: !171)
!170 = !DIFile(filename: "lib/error.c", directory: "/src")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !172, size: 256, elements: !173)
!172 = !DINamespace(name: "std", scope: null)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !171, file: !170, baseType: !30, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !171, file: !170, baseType: !30, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !171, file: !170, baseType: !30, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !171, file: !170, baseType: !31, size: 32, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !171, file: !170, baseType: !31, size: 32, offset: 224)
!179 = !{!180, !181, !182, !183, !184, !185}
!180 = !DILocalVariable(name: "status", arg: 1, scope: !162, file: !157, line: 298, type: !31)
!181 = !DILocalVariable(name: "errnum", arg: 2, scope: !162, file: !157, line: 298, type: !31)
!182 = !DILocalVariable(name: "file_name", arg: 3, scope: !162, file: !157, line: 298, type: !36)
!183 = !DILocalVariable(name: "line_number", arg: 4, scope: !162, file: !157, line: 298, type: !6)
!184 = !DILocalVariable(name: "message", arg: 5, scope: !162, file: !157, line: 298, type: !36)
!185 = !DILocalVariable(name: "args", arg: 6, scope: !162, file: !157, line: 298, type: !165)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "old_line_number", scope: !162, file: !157, line: 305, type: !6, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "error_message_count", scope: !156, file: !157, line: 69, type: !6, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !156, file: !157, line: 295, type: !31, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null}
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "program_name", scope: !197, file: !198, line: 31, type: !36, isLocal: false, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !199, globals: !200, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!199 = !{!28}
!200 = !{!195}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "utf07FF", scope: !203, file: !204, line: 46, type: !234, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "proper_name_lite", scope: !204, file: !204, line: 38, type: !205, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !207, retainedNodes: !209)
!204 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!205 = !DISubroutineType(types: !206)
!206 = !{!36, !36, !36}
!207 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !208, splitDebugInlining: false, nameTableKind: None)
!208 = !{!201}
!209 = !{!210, !211, !212, !213, !218}
!210 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !203, file: !204, line: 38, type: !36)
!211 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !203, file: !204, line: 38, type: !36)
!212 = !DILocalVariable(name: "translation", scope: !203, file: !204, line: 40, type: !36)
!213 = !DILocalVariable(name: "w", scope: !203, file: !204, line: 47, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !215, line: 37, baseType: !216)
!215 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !95, line: 57, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 42, baseType: !6)
!218 = !DILocalVariable(name: "mbs", scope: !203, file: !204, line: 48, type: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !220, line: 6, baseType: !221)
!220 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !222, line: 21, baseType: !223)
!222 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 13, size: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !223, file: !222, line: 15, baseType: !31, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !223, file: !222, line: 20, baseType: !227, size: 32, offset: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !222, line: 16, size: 32, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !227, file: !222, line: 18, baseType: !6, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !227, file: !222, line: 19, baseType: !231, size: 32)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 2)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !239, file: !240, line: 76, type: !322, isLocal: false, isDefinition: true)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !240, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !241, retainedTypes: !261, globals: !262, splitDebugInlining: false, nameTableKind: None)
!240 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!241 = !{!242, !256, !12}
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !243, line: 42, baseType: !6, size: 32, elements: !244)
!243 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!245 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!246 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!247 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!248 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!249 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!250 = !DIEnumerator(name: "c_quoting_style", value: 5)
!251 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!252 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!253 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!254 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!255 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !243, line: 254, baseType: !6, size: 32, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!259 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!260 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!261 = !{!31, !32, !33}
!262 = !{!237, !263, !269, !281, !283, !288, !311, !318, !320}
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !239, file: !240, line: 92, type: !265, isLocal: false, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 320, elements: !267)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!267 = !{!268}
!268 = !DISubrange(count: 10)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !239, file: !240, line: 1040, type: !271, isLocal: false, isDefinition: true)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !240, line: 56, size: 448, elements: !272)
!272 = !{!273, !274, !275, !279, !280}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !271, file: !240, line: 59, baseType: !242, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !240, line: 62, baseType: !31, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !271, file: !240, line: 66, baseType: !276, size: 256, offset: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !271, file: !240, line: 69, baseType: !36, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !271, file: !240, line: 72, baseType: !36, size: 64, offset: 384)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !239, file: !240, line: 107, type: !271, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "slot0", scope: !239, file: !240, line: 831, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 256)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "quote", scope: !290, file: !240, line: 228, type: !309, isLocal: true, isDefinition: true)
!290 = distinct !DISubprogram(name: "gettext_quote", scope: !240, file: !240, line: 197, type: !291, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !293)
!291 = !DISubroutineType(types: !292)
!292 = !{!36, !36, !242}
!293 = !{!294, !295, !296, !297, !298}
!294 = !DILocalVariable(name: "msgid", arg: 1, scope: !290, file: !240, line: 197, type: !36)
!295 = !DILocalVariable(name: "s", arg: 2, scope: !290, file: !240, line: 197, type: !242)
!296 = !DILocalVariable(name: "translation", scope: !290, file: !240, line: 199, type: !36)
!297 = !DILocalVariable(name: "w", scope: !290, file: !240, line: 229, type: !214)
!298 = !DILocalVariable(name: "mbs", scope: !290, file: !240, line: 230, type: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !220, line: 6, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !222, line: 21, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 13, size: 64, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !301, file: !222, line: 15, baseType: !31, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !301, file: !222, line: 20, baseType: !305, size: 32, offset: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !222, line: 16, size: 32, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !305, file: !222, line: 18, baseType: !6, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !305, file: !222, line: 19, baseType: !231, size: 32)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !310)
!310 = !{!236, !233}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "slotvec", scope: !239, file: !240, line: 834, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !240, line: 823, size: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !314, file: !240, line: 825, baseType: !33, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !314, file: !240, line: 826, baseType: !28, size: 64, offset: 64)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "nslots", scope: !239, file: !240, line: 832, type: !31, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "slotvec0", scope: !239, file: !240, line: 833, type: !314, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 704, elements: !324)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!324 = !{!325}
!325 = !DISubrange(count: 11)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !328, file: !329, line: 26, type: !331, isLocal: false, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !330, splitDebugInlining: false, nameTableKind: None)
!329 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!330 = !{!326}
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 376, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 47)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "exit_failure", scope: !336, file: !337, line: 24, type: !339, isLocal: false, isDefinition: true)
!336 = distinct !DICompileUnit(language: DW_LANG_C99, file: !337, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !338, splitDebugInlining: false, nameTableKind: None)
!337 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!338 = !{!334}
!339 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !31)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "internal_state", scope: !342, file: !343, line: 97, type: !346, isLocal: true, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !344, globals: !345, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!344 = !{!30, !33, !38}
!345 = !{!340}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !220, line: 6, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !222, line: 21, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 13, size: 64, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !348, file: !222, line: 15, baseType: !31, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !348, file: !222, line: 20, baseType: !352, size: 32, offset: 32)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !348, file: !222, line: 16, size: 32, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !352, file: !222, line: 18, baseType: !6, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !352, file: !222, line: 19, baseType: !231, size: 32)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !360, retainedTypes: !364, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!360 = !{!361}
!361 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !359, line: 40, baseType: !6, size: 32, elements: !362)
!362 = !{!363}
!363 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!364 = !{!30}
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !367, retainedTypes: !398, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!367 = !{!368, !380}
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !369, file: !366, line: 188, baseType: !6, size: 32, elements: !378)
!369 = distinct !DISubprogram(name: "x2nrealloc", scope: !366, file: !366, line: 176, type: !370, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !365, retainedNodes: !373)
!370 = !DISubroutineType(types: !371)
!371 = !{!30, !30, !372, !33}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!373 = !{!374, !375, !376, !377}
!374 = !DILocalVariable(name: "p", arg: 1, scope: !369, file: !366, line: 176, type: !30)
!375 = !DILocalVariable(name: "pn", arg: 2, scope: !369, file: !366, line: 176, type: !372)
!376 = !DILocalVariable(name: "s", arg: 3, scope: !369, file: !366, line: 176, type: !33)
!377 = !DILocalVariable(name: "n", scope: !369, file: !366, line: 178, type: !33)
!378 = !{!379}
!379 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !381, file: !366, line: 228, baseType: !6, size: 32, elements: !378)
!381 = distinct !DISubprogram(name: "xpalloc", scope: !366, file: !366, line: 223, type: !382, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !365, retainedNodes: !388)
!382 = !DISubroutineType(types: !383)
!383 = !{!30, !30, !384, !385, !387, !385}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !386, line: 130, baseType: !387)
!386 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !34, line: 35, baseType: !96)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397}
!389 = !DILocalVariable(name: "pa", arg: 1, scope: !381, file: !366, line: 223, type: !30)
!390 = !DILocalVariable(name: "pn", arg: 2, scope: !381, file: !366, line: 223, type: !384)
!391 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !381, file: !366, line: 223, type: !385)
!392 = !DILocalVariable(name: "n_max", arg: 4, scope: !381, file: !366, line: 223, type: !387)
!393 = !DILocalVariable(name: "s", arg: 5, scope: !381, file: !366, line: 223, type: !385)
!394 = !DILocalVariable(name: "n0", scope: !381, file: !366, line: 230, type: !385)
!395 = !DILocalVariable(name: "n", scope: !381, file: !366, line: 237, type: !385)
!396 = !DILocalVariable(name: "nbytes", scope: !381, file: !366, line: 248, type: !385)
!397 = !DILocalVariable(name: "adjusted_nbytes", scope: !381, file: !366, line: 252, type: !385)
!398 = !{!28, !30, !42, !96, !35}
!399 = distinct !DICompileUnit(language: DW_LANG_C99, file: !400, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!400 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!411 = !{!42, !35, !30}
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !364, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!418 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!419 = !{i32 7, !"Dwarf Version", i32 5}
!420 = !{i32 2, !"Debug Info Version", i32 3}
!421 = !{i32 1, !"wchar_size", i32 4}
!422 = !{i32 1, !"branch-target-enforcement", i32 0}
!423 = !{i32 1, !"sign-return-address", i32 0}
!424 = !{i32 1, !"sign-return-address-all", i32 0}
!425 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!426 = !{i32 7, !"PIC Level", i32 2}
!427 = !{i32 7, !"PIE Level", i32 2}
!428 = !{i32 7, !"uwtable", i32 1}
!429 = !{i32 7, !"frame-pointer", i32 1}
!430 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 59, type: !431, scopeLine: 60, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !433)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !31}
!433 = !{!434}
!434 = !DILocalVariable(name: "status", arg: 1, scope: !430, file: !3, line: 59, type: !31)
!435 = !DILocation(line: 0, scope: !430)
!436 = !DILocation(line: 61, column: 14, scope: !437)
!437 = distinct !DILexicalBlock(scope: !430, file: !3, line: 61, column: 7)
!438 = !DILocation(line: 61, column: 7, scope: !430)
!439 = !DILocation(line: 62, column: 5, scope: !440)
!440 = distinct !DILexicalBlock(scope: !437, file: !3, line: 62, column: 5)
!441 = !{!442, !442, i64 0}
!442 = !{!"any pointer", !443, i64 0}
!443 = !{!"omnipotent char", !444, i64 0}
!444 = !{!"Simple C/C++ TBAA"}
!445 = !DILocation(line: 65, column: 7, scope: !446)
!446 = distinct !DILexicalBlock(scope: !437, file: !3, line: 64, column: 5)
!447 = !DILocation(line: 66, column: 7, scope: !446)
!448 = !DILocation(line: 70, column: 7, scope: !446)
!449 = !DILocation(line: 74, column: 7, scope: !446)
!450 = !DILocation(line: 75, column: 7, scope: !446)
!451 = !DILocalVariable(name: "program", arg: 1, scope: !452, file: !46, line: 836, type: !36)
!452 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !46, file: !46, line: 836, type: !453, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !36}
!455 = !{!451, !456, !465, !466, !468, !469}
!456 = !DILocalVariable(name: "infomap", scope: !452, file: !46, line: 838, type: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 896, elements: !463)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !452, file: !46, line: 838, size: 128, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !459, file: !46, line: 838, baseType: !36, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !46, line: 838, baseType: !36, size: 64, offset: 64)
!463 = !{!464}
!464 = !DISubrange(count: 7)
!465 = !DILocalVariable(name: "node", scope: !452, file: !46, line: 848, type: !36)
!466 = !DILocalVariable(name: "map_prog", scope: !452, file: !46, line: 849, type: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!468 = !DILocalVariable(name: "lc_messages", scope: !452, file: !46, line: 861, type: !36)
!469 = !DILocalVariable(name: "url_program", scope: !452, file: !46, line: 874, type: !36)
!470 = !DILocation(line: 0, scope: !452, inlinedAt: !471)
!471 = distinct !DILocation(line: 76, column: 7, scope: !446)
!472 = !DILocation(line: 838, column: 3, scope: !452, inlinedAt: !471)
!473 = !DILocation(line: 838, column: 67, scope: !452, inlinedAt: !471)
!474 = !DILocation(line: 849, column: 36, scope: !452, inlinedAt: !471)
!475 = !DILocation(line: 851, column: 3, scope: !452, inlinedAt: !471)
!476 = !DILocalVariable(name: "__s1", arg: 1, scope: !477, file: !478, line: 1359, type: !36)
!477 = distinct !DISubprogram(name: "streq", scope: !478, file: !478, line: 1359, type: !479, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !481)
!478 = !DIFile(filename: "./lib/string.h", directory: "/src")
!479 = !DISubroutineType(types: !480)
!480 = !{!42, !36, !36}
!481 = !{!476, !482}
!482 = !DILocalVariable(name: "__s2", arg: 2, scope: !477, file: !478, line: 1359, type: !36)
!483 = !DILocation(line: 0, scope: !477, inlinedAt: !484)
!484 = distinct !DILocation(line: 851, column: 33, scope: !452, inlinedAt: !471)
!485 = !DILocation(line: 1361, column: 11, scope: !477, inlinedAt: !484)
!486 = !DILocation(line: 1361, column: 10, scope: !477, inlinedAt: !484)
!487 = !DILocation(line: 852, column: 13, scope: !452, inlinedAt: !471)
!488 = !DILocation(line: 851, column: 20, scope: !452, inlinedAt: !471)
!489 = !{!490, !442, i64 0}
!490 = !{!"infomap", !442, i64 0, !442, i64 8}
!491 = !DILocation(line: 851, column: 10, scope: !452, inlinedAt: !471)
!492 = !DILocation(line: 851, column: 28, scope: !452, inlinedAt: !471)
!493 = distinct !{!493, !475, !487, !494}
!494 = !{!"llvm.loop.mustprogress"}
!495 = !DILocation(line: 854, column: 17, scope: !496, inlinedAt: !471)
!496 = distinct !DILexicalBlock(scope: !452, file: !46, line: 854, column: 7)
!497 = !{!490, !442, i64 8}
!498 = !DILocation(line: 854, column: 7, scope: !496, inlinedAt: !471)
!499 = !DILocation(line: 854, column: 7, scope: !452, inlinedAt: !471)
!500 = !DILocation(line: 857, column: 3, scope: !452, inlinedAt: !471)
!501 = !DILocation(line: 861, column: 29, scope: !452, inlinedAt: !471)
!502 = !DILocation(line: 862, column: 7, scope: !503, inlinedAt: !471)
!503 = distinct !DILexicalBlock(scope: !452, file: !46, line: 862, column: 7)
!504 = !DILocation(line: 862, column: 19, scope: !503, inlinedAt: !471)
!505 = !DILocation(line: 862, column: 22, scope: !503, inlinedAt: !471)
!506 = !DILocation(line: 862, column: 7, scope: !452, inlinedAt: !471)
!507 = !DILocation(line: 868, column: 7, scope: !508, inlinedAt: !471)
!508 = distinct !DILexicalBlock(scope: !503, file: !46, line: 863, column: 5)
!509 = !DILocation(line: 870, column: 5, scope: !508, inlinedAt: !471)
!510 = !DILocation(line: 0, scope: !477, inlinedAt: !511)
!511 = distinct !DILocation(line: 874, column: 29, scope: !452, inlinedAt: !471)
!512 = !DILocation(line: 875, column: 3, scope: !452, inlinedAt: !471)
!513 = !DILocation(line: 877, column: 3, scope: !452, inlinedAt: !471)
!514 = !DILocation(line: 879, column: 1, scope: !452, inlinedAt: !471)
!515 = !DILocation(line: 78, column: 3, scope: !430)
!516 = !DISubprogram(name: "dcgettext", scope: !517, file: !517, line: 51, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!517 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!518 = !DISubroutineType(types: !519)
!519 = !{!28, !36, !36, !31}
!520 = !{}
!521 = !DISubprogram(name: "fputs_unlocked", scope: !166, file: !166, line: 691, type: !522, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!522 = !DISubroutineType(types: !523)
!523 = !{!31, !524, !525}
!524 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !36)
!525 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!526 = !DILocation(line: 0, scope: !45)
!527 = !DILocation(line: 581, column: 7, scope: !54)
!528 = !{!529, !529, i64 0}
!529 = !{!"int", !443, i64 0}
!530 = !DILocation(line: 581, column: 19, scope: !54)
!531 = !DILocation(line: 581, column: 7, scope: !45)
!532 = !DILocation(line: 585, column: 26, scope: !53)
!533 = !DILocation(line: 0, scope: !53)
!534 = !DILocation(line: 586, column: 23, scope: !53)
!535 = !DILocation(line: 586, column: 28, scope: !53)
!536 = !DILocation(line: 586, column: 32, scope: !53)
!537 = !{!443, !443, i64 0}
!538 = !DILocation(line: 586, column: 38, scope: !53)
!539 = !DILocation(line: 0, scope: !477, inlinedAt: !540)
!540 = distinct !DILocation(line: 586, column: 41, scope: !53)
!541 = !DILocation(line: 1361, column: 11, scope: !477, inlinedAt: !540)
!542 = !DILocation(line: 1361, column: 10, scope: !477, inlinedAt: !540)
!543 = !DILocation(line: 586, column: 19, scope: !53)
!544 = !DILocation(line: 587, column: 5, scope: !53)
!545 = !DILocation(line: 588, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !45, file: !46, line: 588, column: 7)
!547 = !DILocation(line: 588, column: 7, scope: !45)
!548 = !DILocation(line: 590, column: 7, scope: !549)
!549 = distinct !DILexicalBlock(scope: !546, file: !46, line: 589, column: 5)
!550 = !DILocation(line: 591, column: 7, scope: !549)
!551 = !DILocation(line: 595, column: 37, scope: !45)
!552 = !DILocation(line: 595, column: 35, scope: !45)
!553 = !DILocation(line: 596, column: 29, scope: !45)
!554 = !DILocation(line: 597, column: 8, scope: !61)
!555 = !DILocation(line: 597, column: 7, scope: !45)
!556 = !DILocation(line: 604, column: 24, scope: !60)
!557 = !DILocation(line: 604, column: 12, scope: !61)
!558 = !DILocation(line: 0, scope: !59)
!559 = !DILocation(line: 610, column: 16, scope: !59)
!560 = !DILocation(line: 610, column: 7, scope: !59)
!561 = !DILocation(line: 611, column: 21, scope: !59)
!562 = !{!563, !563, i64 0}
!563 = !{!"short", !443, i64 0}
!564 = !DILocation(line: 611, column: 19, scope: !59)
!565 = !DILocation(line: 611, column: 16, scope: !59)
!566 = !DILocation(line: 610, column: 30, scope: !59)
!567 = distinct !{!567, !560, !561, !494}
!568 = !DILocation(line: 612, column: 18, scope: !569)
!569 = distinct !DILexicalBlock(scope: !59, file: !46, line: 612, column: 11)
!570 = !DILocation(line: 612, column: 11, scope: !59)
!571 = !DILocation(line: 620, column: 23, scope: !45)
!572 = !DILocation(line: 625, column: 39, scope: !45)
!573 = !DILocation(line: 626, column: 3, scope: !45)
!574 = !DILocation(line: 626, column: 10, scope: !45)
!575 = !DILocation(line: 626, column: 21, scope: !45)
!576 = !DILocation(line: 628, column: 44, scope: !577)
!577 = distinct !DILexicalBlock(scope: !578, file: !46, line: 628, column: 11)
!578 = distinct !DILexicalBlock(scope: !45, file: !46, line: 627, column: 5)
!579 = !DILocation(line: 628, column: 32, scope: !577)
!580 = !DILocation(line: 628, column: 49, scope: !577)
!581 = !DILocation(line: 628, column: 11, scope: !578)
!582 = !DILocation(line: 630, column: 11, scope: !583)
!583 = distinct !DILexicalBlock(scope: !578, file: !46, line: 630, column: 11)
!584 = !DILocation(line: 630, column: 11, scope: !578)
!585 = !DILocation(line: 632, column: 26, scope: !586)
!586 = distinct !DILexicalBlock(scope: !587, file: !46, line: 632, column: 15)
!587 = distinct !DILexicalBlock(scope: !583, file: !46, line: 631, column: 9)
!588 = !DILocation(line: 632, column: 34, scope: !586)
!589 = !DILocation(line: 632, column: 37, scope: !586)
!590 = !DILocation(line: 632, column: 15, scope: !587)
!591 = !DILocation(line: 636, column: 29, scope: !592)
!592 = distinct !DILexicalBlock(scope: !587, file: !46, line: 636, column: 15)
!593 = !DILocation(line: 640, column: 16, scope: !578)
!594 = distinct !{!594, !573, !595, !494}
!595 = !DILocation(line: 641, column: 5, scope: !45)
!596 = !DILocation(line: 644, column: 3, scope: !45)
!597 = !DILocation(line: 0, scope: !477, inlinedAt: !598)
!598 = distinct !DILocation(line: 648, column: 31, scope: !45)
!599 = !DILocation(line: 0, scope: !477, inlinedAt: !600)
!600 = distinct !DILocation(line: 649, column: 31, scope: !45)
!601 = !DILocation(line: 0, scope: !477, inlinedAt: !602)
!602 = distinct !DILocation(line: 650, column: 31, scope: !45)
!603 = !DILocation(line: 0, scope: !477, inlinedAt: !604)
!604 = distinct !DILocation(line: 651, column: 31, scope: !45)
!605 = !DILocation(line: 0, scope: !477, inlinedAt: !606)
!606 = distinct !DILocation(line: 652, column: 31, scope: !45)
!607 = !DILocation(line: 0, scope: !477, inlinedAt: !608)
!608 = distinct !DILocation(line: 653, column: 31, scope: !45)
!609 = !DILocation(line: 0, scope: !477, inlinedAt: !610)
!610 = distinct !DILocation(line: 654, column: 31, scope: !45)
!611 = !DILocation(line: 0, scope: !477, inlinedAt: !612)
!612 = distinct !DILocation(line: 655, column: 31, scope: !45)
!613 = !DILocation(line: 0, scope: !477, inlinedAt: !614)
!614 = distinct !DILocation(line: 656, column: 31, scope: !45)
!615 = !DILocation(line: 0, scope: !477, inlinedAt: !616)
!616 = distinct !DILocation(line: 657, column: 31, scope: !45)
!617 = !DILocation(line: 663, column: 7, scope: !618)
!618 = distinct !DILexicalBlock(scope: !45, file: !46, line: 663, column: 7)
!619 = !DILocation(line: 664, column: 7, scope: !618)
!620 = !DILocation(line: 664, column: 10, scope: !618)
!621 = !DILocation(line: 663, column: 7, scope: !45)
!622 = !DILocation(line: 669, column: 7, scope: !623)
!623 = distinct !DILexicalBlock(scope: !618, file: !46, line: 665, column: 5)
!624 = !DILocation(line: 671, column: 5, scope: !623)
!625 = !DILocation(line: 676, column: 7, scope: !626)
!626 = distinct !DILexicalBlock(scope: !618, file: !46, line: 673, column: 5)
!627 = !DILocation(line: 679, column: 3, scope: !45)
!628 = !DILocation(line: 683, column: 3, scope: !45)
!629 = !DILocation(line: 686, column: 3, scope: !45)
!630 = !DILocation(line: 688, column: 3, scope: !45)
!631 = !DILocation(line: 691, column: 3, scope: !45)
!632 = !DILocation(line: 695, column: 3, scope: !45)
!633 = !DILocation(line: 696, column: 1, scope: !45)
!634 = !DISubprogram(name: "setlocale", scope: !635, file: !635, line: 122, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!635 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!636 = !DISubroutineType(types: !637)
!637 = !{!28, !31, !36}
!638 = !DISubprogram(name: "getenv", scope: !639, file: !639, line: 641, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!639 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!640 = !DISubroutineType(types: !641)
!641 = !{!28, !36}
!642 = !DISubprogram(name: "fwrite_unlocked", scope: !166, file: !166, line: 704, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!643 = !DISubroutineType(types: !644)
!644 = !{!33, !645, !33, !33, !525}
!645 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!648 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 82, type: !649, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !652)
!649 = !DISubroutineType(types: !650)
!650 = !{!31, !31, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!652 = !{!653, !654, !655, !656, !657, !658}
!653 = !DILocalVariable(name: "argc", arg: 1, scope: !648, file: !3, line: 82, type: !31)
!654 = !DILocalVariable(name: "argv", arg: 2, scope: !648, file: !3, line: 82, type: !651)
!655 = !DILocalVariable(name: "optc", scope: !648, file: !3, line: 84, type: !31)
!656 = !DILocalVariable(name: "status", scope: !648, file: !3, line: 121, type: !31)
!657 = !DILocalVariable(name: "tty", scope: !648, file: !3, line: 122, type: !36)
!658 = !DILocalVariable(name: "ttyname_err", scope: !659, file: !3, line: 128, type: !31)
!659 = distinct !DILexicalBlock(scope: !660, file: !3, line: 127, column: 5)
!660 = distinct !DILexicalBlock(scope: !648, file: !3, line: 124, column: 7)
!661 = !DILocation(line: 0, scope: !648)
!662 = !DILocation(line: 87, column: 21, scope: !648)
!663 = !DILocation(line: 87, column: 3, scope: !648)
!664 = !DILocation(line: 88, column: 3, scope: !648)
!665 = !DILocation(line: 89, column: 3, scope: !648)
!666 = !DILocation(line: 90, column: 3, scope: !648)
!667 = !DILocalVariable(name: "status", arg: 1, scope: !668, file: !46, line: 102, type: !31)
!668 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !46, file: !46, line: 102, type: !431, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !669)
!669 = !{!667}
!670 = !DILocation(line: 0, scope: !668, inlinedAt: !671)
!671 = distinct !DILocation(line: 92, column: 3, scope: !648)
!672 = !DILocation(line: 105, column: 18, scope: !673, inlinedAt: !671)
!673 = distinct !DILexicalBlock(scope: !668, file: !46, line: 104, column: 7)
!674 = !DILocation(line: 93, column: 3, scope: !648)
!675 = !DILocation(line: 95, column: 3, scope: !648)
!676 = !DILocation(line: 95, column: 18, scope: !648)
!677 = !DILocation(line: 100, column: 18, scope: !678)
!678 = distinct !DILexicalBlock(scope: !679, file: !3, line: 98, column: 9)
!679 = distinct !DILexicalBlock(scope: !648, file: !3, line: 96, column: 5)
!680 = distinct !{!680, !675, !681, !494}
!681 = !DILocation(line: 110, column: 5, scope: !648)
!682 = !DILocation(line: 103, column: 9, scope: !678)
!683 = !DILocation(line: 105, column: 9, scope: !678)
!684 = !DILocation(line: 108, column: 11, scope: !678)
!685 = !DILocation(line: 112, column: 7, scope: !686)
!686 = distinct !DILexicalBlock(scope: !648, file: !3, line: 112, column: 7)
!687 = !DILocation(line: 112, column: 14, scope: !686)
!688 = !DILocation(line: 112, column: 7, scope: !648)
!689 = !DILocation(line: 114, column: 7, scope: !690)
!690 = distinct !DILexicalBlock(scope: !686, file: !3, line: 113, column: 5)
!691 = !DILocation(line: 115, column: 7, scope: !690)
!692 = !DILocation(line: 118, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !648, file: !3, line: 118, column: 7)
!694 = !DILocation(line: 118, column: 7, scope: !648)
!695 = !DILocation(line: 119, column: 12, scope: !693)
!696 = !DILocation(line: 119, column: 5, scope: !693)
!697 = !DILocation(line: 122, column: 21, scope: !648)
!698 = !DILocation(line: 124, column: 7, scope: !660)
!699 = !DILocation(line: 124, column: 7, scope: !648)
!700 = !DILocation(line: 128, column: 25, scope: !659)
!701 = !DILocation(line: 0, scope: !659)
!702 = !DILocation(line: 129, column: 11, scope: !703)
!703 = distinct !DILexicalBlock(scope: !659, file: !3, line: 129, column: 11)
!704 = !DILocation(line: 129, column: 11, scope: !659)
!705 = !DILocation(line: 130, column: 9, scope: !703)
!706 = !DILocation(line: 131, column: 13, scope: !659)
!707 = !DILocation(line: 0, scope: !660)
!708 = !DILocation(line: 135, column: 3, scope: !648)
!709 = !DILocation(line: 137, column: 1, scope: !648)
!710 = !DISubprogram(name: "bindtextdomain", scope: !517, file: !517, line: 86, type: !711, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!711 = !DISubroutineType(types: !712)
!712 = !{!28, !36, !36}
!713 = !DISubprogram(name: "textdomain", scope: !517, file: !517, line: 82, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!714 = !DISubprogram(name: "atexit", scope: !639, file: !639, line: 602, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!715 = !DISubroutineType(types: !716)
!716 = !{!31, !192}
!717 = !DISubprogram(name: "getopt_long", scope: !132, file: !132, line: 66, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!718 = !DISubroutineType(types: !719)
!719 = !{!31, !31, !720, !36, !722, !137}
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!723 = !DISubprogram(name: "isatty", scope: !724, file: !724, line: 809, type: !725, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!724 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!725 = !DISubroutineType(types: !726)
!726 = !{!31, !31}
!727 = !DISubprogram(name: "ttyname", scope: !724, file: !724, line: 799, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!728 = !DISubroutineType(types: !729)
!729 = !{!28, !31}
!730 = !DISubprogram(name: "puts", scope: !166, file: !166, line: 661, type: !731, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!731 = !DISubroutineType(types: !732)
!732 = !{!31, !36}
!733 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !150, file: !150, line: 50, type: !453, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !149, retainedNodes: !734)
!734 = !{!735}
!735 = !DILocalVariable(name: "file", arg: 1, scope: !733, file: !150, line: 50, type: !36)
!736 = !DILocation(line: 0, scope: !733)
!737 = !DILocation(line: 52, column: 13, scope: !733)
!738 = !DILocation(line: 53, column: 1, scope: !733)
!739 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !150, file: !150, line: 87, type: !740, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !149, retainedNodes: !742)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !42}
!742 = !{!743}
!743 = !DILocalVariable(name: "ignore", arg: 1, scope: !739, file: !150, line: 87, type: !42)
!744 = !DILocation(line: 0, scope: !739)
!745 = !DILocation(line: 89, column: 16, scope: !739)
!746 = !{!747, !747, i64 0}
!747 = !{!"_Bool", !443, i64 0}
!748 = !DILocation(line: 90, column: 1, scope: !739)
!749 = distinct !DISubprogram(name: "close_stdout", scope: !150, file: !150, line: 116, type: !193, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !149, retainedNodes: !750)
!750 = !{!751}
!751 = !DILocalVariable(name: "write_error", scope: !752, file: !150, line: 121, type: !36)
!752 = distinct !DILexicalBlock(scope: !753, file: !150, line: 120, column: 5)
!753 = distinct !DILexicalBlock(scope: !749, file: !150, line: 118, column: 7)
!754 = !DILocation(line: 118, column: 21, scope: !753)
!755 = !DILocation(line: 118, column: 7, scope: !753)
!756 = !DILocation(line: 118, column: 29, scope: !753)
!757 = !DILocation(line: 119, column: 7, scope: !753)
!758 = !DILocation(line: 119, column: 12, scope: !753)
!759 = !{i8 0, i8 2}
!760 = !DILocation(line: 119, column: 25, scope: !753)
!761 = !DILocation(line: 119, column: 28, scope: !753)
!762 = !DILocation(line: 119, column: 34, scope: !753)
!763 = !DILocation(line: 118, column: 7, scope: !749)
!764 = !DILocation(line: 121, column: 33, scope: !752)
!765 = !DILocation(line: 0, scope: !752)
!766 = !DILocation(line: 122, column: 11, scope: !767)
!767 = distinct !DILexicalBlock(scope: !752, file: !150, line: 122, column: 11)
!768 = !DILocation(line: 0, scope: !767)
!769 = !DILocation(line: 122, column: 11, scope: !752)
!770 = !DILocation(line: 123, column: 9, scope: !767)
!771 = !DILocation(line: 126, column: 9, scope: !767)
!772 = !DILocation(line: 128, column: 14, scope: !752)
!773 = !DILocation(line: 128, column: 7, scope: !752)
!774 = !DILocation(line: 133, column: 42, scope: !775)
!775 = distinct !DILexicalBlock(scope: !749, file: !150, line: 133, column: 7)
!776 = !DILocation(line: 133, column: 28, scope: !775)
!777 = !DILocation(line: 133, column: 50, scope: !775)
!778 = !DILocation(line: 133, column: 7, scope: !749)
!779 = !DILocation(line: 134, column: 12, scope: !775)
!780 = !DILocation(line: 134, column: 5, scope: !775)
!781 = !DILocation(line: 135, column: 1, scope: !749)
!782 = distinct !DISubprogram(name: "verror", scope: !157, file: !157, line: 251, type: !783, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !785)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !31, !31, !36, !165}
!785 = !{!786, !787, !788, !789}
!786 = !DILocalVariable(name: "status", arg: 1, scope: !782, file: !157, line: 251, type: !31)
!787 = !DILocalVariable(name: "errnum", arg: 2, scope: !782, file: !157, line: 251, type: !31)
!788 = !DILocalVariable(name: "message", arg: 3, scope: !782, file: !157, line: 251, type: !36)
!789 = !DILocalVariable(name: "args", arg: 4, scope: !782, file: !157, line: 251, type: !165)
!790 = !DILocation(line: 0, scope: !782)
!791 = !DILocation(line: 251, column: 1, scope: !782)
!792 = !DILocation(line: 261, column: 3, scope: !782)
!793 = !DILocation(line: 265, column: 7, scope: !794)
!794 = distinct !DILexicalBlock(scope: !782, file: !157, line: 265, column: 7)
!795 = !DILocation(line: 265, column: 7, scope: !782)
!796 = !DILocation(line: 266, column: 5, scope: !794)
!797 = !DILocation(line: 272, column: 7, scope: !798)
!798 = distinct !DILexicalBlock(scope: !794, file: !157, line: 268, column: 5)
!799 = !DILocation(line: 276, column: 3, scope: !782)
!800 = !{i64 0, i64 8, !441, i64 8, i64 8, !441, i64 16, i64 8, !441, i64 24, i64 4, !528, i64 28, i64 4, !528}
!801 = !DILocation(line: 282, column: 1, scope: !782)
!802 = distinct !DISubprogram(name: "flush_stdout", scope: !157, file: !157, line: 163, type: !193, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !803)
!803 = !{!804}
!804 = !DILocalVariable(name: "stdout_fd", scope: !802, file: !157, line: 166, type: !31)
!805 = !DILocation(line: 0, scope: !802)
!806 = !DILocalVariable(name: "fd", arg: 1, scope: !807, file: !157, line: 145, type: !31)
!807 = distinct !DISubprogram(name: "is_open", scope: !157, file: !157, line: 145, type: !725, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !808)
!808 = !{!806}
!809 = !DILocation(line: 0, scope: !807, inlinedAt: !810)
!810 = distinct !DILocation(line: 182, column: 25, scope: !811)
!811 = distinct !DILexicalBlock(scope: !802, file: !157, line: 182, column: 7)
!812 = !DILocation(line: 157, column: 15, scope: !807, inlinedAt: !810)
!813 = !DILocation(line: 182, column: 25, scope: !811)
!814 = !DILocation(line: 182, column: 7, scope: !802)
!815 = !DILocation(line: 184, column: 5, scope: !811)
!816 = !DILocation(line: 185, column: 1, scope: !802)
!817 = distinct !DISubprogram(name: "error_tail", scope: !157, file: !157, line: 219, type: !783, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !818)
!818 = !{!819, !820, !821, !822}
!819 = !DILocalVariable(name: "status", arg: 1, scope: !817, file: !157, line: 219, type: !31)
!820 = !DILocalVariable(name: "errnum", arg: 2, scope: !817, file: !157, line: 219, type: !31)
!821 = !DILocalVariable(name: "message", arg: 3, scope: !817, file: !157, line: 219, type: !36)
!822 = !DILocalVariable(name: "args", arg: 4, scope: !817, file: !157, line: 219, type: !165)
!823 = !DILocation(line: 0, scope: !817)
!824 = !DILocation(line: 219, column: 1, scope: !817)
!825 = !DILocation(line: 229, column: 13, scope: !817)
!826 = !DILocation(line: 229, column: 3, scope: !817)
!827 = !DILocalVariable(name: "__stream", arg: 1, scope: !828, file: !829, line: 132, type: !832)
!828 = distinct !DISubprogram(name: "vfprintf", scope: !829, file: !829, line: 132, type: !830, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !867)
!829 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!830 = !DISubroutineType(types: !831)
!831 = !{!31, !832, !524, !167}
!832 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 7, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 49, size: 1728, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !835, file: !72, line: 51, baseType: !31, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !835, file: !72, line: 54, baseType: !28, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !835, file: !72, line: 55, baseType: !28, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !835, file: !72, line: 56, baseType: !28, size: 64, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !835, file: !72, line: 57, baseType: !28, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !835, file: !72, line: 58, baseType: !28, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !835, file: !72, line: 59, baseType: !28, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !835, file: !72, line: 60, baseType: !28, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !835, file: !72, line: 61, baseType: !28, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !835, file: !72, line: 64, baseType: !28, size: 64, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !835, file: !72, line: 65, baseType: !28, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !835, file: !72, line: 66, baseType: !28, size: 64, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !835, file: !72, line: 68, baseType: !87, size: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !835, file: !72, line: 70, baseType: !851, size: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !835, file: !72, line: 72, baseType: !31, size: 32, offset: 896)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !835, file: !72, line: 73, baseType: !31, size: 32, offset: 928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !835, file: !72, line: 74, baseType: !94, size: 64, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !835, file: !72, line: 77, baseType: !32, size: 16, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !835, file: !72, line: 78, baseType: !99, size: 8, offset: 1040)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !835, file: !72, line: 79, baseType: !101, size: 8, offset: 1048)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !835, file: !72, line: 81, baseType: !105, size: 64, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !835, file: !72, line: 89, baseType: !108, size: 64, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !835, file: !72, line: 91, baseType: !110, size: 64, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !835, file: !72, line: 92, baseType: !113, size: 64, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !835, file: !72, line: 93, baseType: !851, size: 64, offset: 1344)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !835, file: !72, line: 94, baseType: !30, size: 64, offset: 1408)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !835, file: !72, line: 95, baseType: !33, size: 64, offset: 1472)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !835, file: !72, line: 96, baseType: !31, size: 32, offset: 1536)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !835, file: !72, line: 98, baseType: !120, size: 160, offset: 1568)
!867 = !{!827, !868, !869}
!868 = !DILocalVariable(name: "__fmt", arg: 2, scope: !828, file: !829, line: 133, type: !524)
!869 = !DILocalVariable(name: "__ap", arg: 3, scope: !828, file: !829, line: 133, type: !167)
!870 = !DILocation(line: 0, scope: !828, inlinedAt: !871)
!871 = distinct !DILocation(line: 229, column: 3, scope: !817)
!872 = !DILocation(line: 135, column: 10, scope: !828, inlinedAt: !871)
!873 = !{!874, !876}
!874 = distinct !{!874, !875, !"vfprintf.inline: argument 0"}
!875 = distinct !{!875, !"vfprintf.inline"}
!876 = distinct !{!876, !875, !"vfprintf.inline: argument 1"}
!877 = !DILocation(line: 232, column: 3, scope: !817)
!878 = !DILocation(line: 233, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !817, file: !157, line: 233, column: 7)
!880 = !DILocation(line: 233, column: 7, scope: !817)
!881 = !DILocalVariable(name: "errnum", arg: 1, scope: !882, file: !157, line: 188, type: !31)
!882 = distinct !DISubprogram(name: "print_errno_message", scope: !157, file: !157, line: 188, type: !431, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !883)
!883 = !{!881, !884, !885}
!884 = !DILocalVariable(name: "s", scope: !882, file: !157, line: 190, type: !36)
!885 = !DILocalVariable(name: "errbuf", scope: !882, file: !157, line: 193, type: !886)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8192, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 1024)
!889 = !DILocation(line: 0, scope: !882, inlinedAt: !890)
!890 = distinct !DILocation(line: 234, column: 5, scope: !879)
!891 = !DILocation(line: 193, column: 3, scope: !882, inlinedAt: !890)
!892 = !DILocation(line: 193, column: 8, scope: !882, inlinedAt: !890)
!893 = !DILocation(line: 195, column: 7, scope: !882, inlinedAt: !890)
!894 = !DILocation(line: 207, column: 9, scope: !895, inlinedAt: !890)
!895 = distinct !DILexicalBlock(scope: !882, file: !157, line: 207, column: 7)
!896 = !DILocation(line: 207, column: 7, scope: !882, inlinedAt: !890)
!897 = !DILocation(line: 208, column: 9, scope: !895, inlinedAt: !890)
!898 = !DILocation(line: 208, column: 5, scope: !895, inlinedAt: !890)
!899 = !DILocation(line: 214, column: 3, scope: !882, inlinedAt: !890)
!900 = !DILocation(line: 216, column: 1, scope: !882, inlinedAt: !890)
!901 = !DILocation(line: 234, column: 5, scope: !879)
!902 = !DILocation(line: 238, column: 3, scope: !817)
!903 = !DILocalVariable(name: "__c", arg: 1, scope: !904, file: !905, line: 101, type: !31)
!904 = distinct !DISubprogram(name: "putc_unlocked", scope: !905, file: !905, line: 101, type: !906, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !908)
!905 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!906 = !DISubroutineType(types: !907)
!907 = !{!31, !31, !833}
!908 = !{!903, !909}
!909 = !DILocalVariable(name: "__stream", arg: 2, scope: !904, file: !905, line: 101, type: !833)
!910 = !DILocation(line: 0, scope: !904, inlinedAt: !911)
!911 = distinct !DILocation(line: 238, column: 3, scope: !817)
!912 = !DILocation(line: 103, column: 10, scope: !904, inlinedAt: !911)
!913 = !{!914, !442, i64 40}
!914 = !{!"_IO_FILE", !529, i64 0, !442, i64 8, !442, i64 16, !442, i64 24, !442, i64 32, !442, i64 40, !442, i64 48, !442, i64 56, !442, i64 64, !442, i64 72, !442, i64 80, !442, i64 88, !442, i64 96, !442, i64 104, !529, i64 112, !529, i64 116, !915, i64 120, !563, i64 128, !443, i64 130, !443, i64 131, !442, i64 136, !915, i64 144, !442, i64 152, !442, i64 160, !442, i64 168, !442, i64 176, !915, i64 184, !529, i64 192, !443, i64 196}
!915 = !{!"long", !443, i64 0}
!916 = !{!914, !442, i64 48}
!917 = !{!"branch_weights", i32 2000, i32 1}
!918 = !DILocation(line: 240, column: 3, scope: !817)
!919 = !DILocation(line: 241, column: 7, scope: !920)
!920 = distinct !DILexicalBlock(scope: !817, file: !157, line: 241, column: 7)
!921 = !DILocation(line: 241, column: 7, scope: !817)
!922 = !DILocation(line: 242, column: 5, scope: !920)
!923 = !DILocation(line: 243, column: 1, scope: !817)
!924 = !DISubprogram(name: "strerror_r", scope: !925, file: !925, line: 444, type: !926, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!925 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!926 = !DISubroutineType(types: !927)
!927 = !{!28, !31, !28, !33}
!928 = !DISubprogram(name: "fflush_unlocked", scope: !166, file: !166, line: 239, type: !929, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!929 = !DISubroutineType(types: !930)
!930 = !{!31, !833}
!931 = !DISubprogram(name: "fcntl", scope: !932, file: !932, line: 149, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!932 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!933 = !DISubroutineType(types: !934)
!934 = !{!31, !31, !31, null}
!935 = distinct !DISubprogram(name: "error", scope: !157, file: !157, line: 285, type: !936, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !938)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !31, !31, !36, null}
!938 = !{!939, !940, !941, !942}
!939 = !DILocalVariable(name: "status", arg: 1, scope: !935, file: !157, line: 285, type: !31)
!940 = !DILocalVariable(name: "errnum", arg: 2, scope: !935, file: !157, line: 285, type: !31)
!941 = !DILocalVariable(name: "message", arg: 3, scope: !935, file: !157, line: 285, type: !36)
!942 = !DILocalVariable(name: "ap", scope: !935, file: !157, line: 287, type: !165)
!943 = !DILocation(line: 0, scope: !935)
!944 = !DILocation(line: 287, column: 3, scope: !935)
!945 = !DILocation(line: 287, column: 11, scope: !935)
!946 = !DILocation(line: 288, column: 3, scope: !935)
!947 = !DILocation(line: 289, column: 3, scope: !935)
!948 = !DILocation(line: 290, column: 3, scope: !935)
!949 = !DILocation(line: 291, column: 1, scope: !935)
!950 = !DILocation(line: 0, scope: !162)
!951 = !DILocation(line: 298, column: 1, scope: !162)
!952 = !DILocation(line: 302, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !162, file: !157, line: 302, column: 7)
!954 = !DILocation(line: 302, column: 7, scope: !162)
!955 = !DILocation(line: 307, column: 11, scope: !956)
!956 = distinct !DILexicalBlock(scope: !957, file: !157, line: 307, column: 11)
!957 = distinct !DILexicalBlock(scope: !953, file: !157, line: 303, column: 5)
!958 = !DILocation(line: 307, column: 27, scope: !956)
!959 = !DILocation(line: 308, column: 11, scope: !956)
!960 = !DILocation(line: 308, column: 28, scope: !956)
!961 = !DILocation(line: 308, column: 25, scope: !956)
!962 = !DILocation(line: 309, column: 15, scope: !956)
!963 = !DILocation(line: 309, column: 33, scope: !956)
!964 = !DILocation(line: 310, column: 19, scope: !956)
!965 = !DILocation(line: 311, column: 22, scope: !956)
!966 = !DILocation(line: 311, column: 56, scope: !956)
!967 = !DILocation(line: 307, column: 11, scope: !957)
!968 = !DILocation(line: 316, column: 21, scope: !957)
!969 = !DILocation(line: 317, column: 23, scope: !957)
!970 = !DILocation(line: 318, column: 5, scope: !957)
!971 = !DILocation(line: 327, column: 3, scope: !162)
!972 = !DILocation(line: 331, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !162, file: !157, line: 331, column: 7)
!974 = !DILocation(line: 331, column: 7, scope: !162)
!975 = !DILocation(line: 332, column: 5, scope: !973)
!976 = !DILocation(line: 338, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !973, file: !157, line: 334, column: 5)
!978 = !DILocation(line: 346, column: 3, scope: !162)
!979 = !DILocation(line: 350, column: 3, scope: !162)
!980 = !DILocation(line: 356, column: 1, scope: !162)
!981 = distinct !DISubprogram(name: "error_at_line", scope: !157, file: !157, line: 359, type: !982, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !31, !31, !36, !6, !36, null}
!984 = !{!985, !986, !987, !988, !989, !990}
!985 = !DILocalVariable(name: "status", arg: 1, scope: !981, file: !157, line: 359, type: !31)
!986 = !DILocalVariable(name: "errnum", arg: 2, scope: !981, file: !157, line: 359, type: !31)
!987 = !DILocalVariable(name: "file_name", arg: 3, scope: !981, file: !157, line: 359, type: !36)
!988 = !DILocalVariable(name: "line_number", arg: 4, scope: !981, file: !157, line: 360, type: !6)
!989 = !DILocalVariable(name: "message", arg: 5, scope: !981, file: !157, line: 360, type: !36)
!990 = !DILocalVariable(name: "ap", scope: !981, file: !157, line: 362, type: !165)
!991 = !DILocation(line: 0, scope: !981)
!992 = !DILocation(line: 362, column: 3, scope: !981)
!993 = !DILocation(line: 362, column: 11, scope: !981)
!994 = !DILocation(line: 363, column: 3, scope: !981)
!995 = !DILocation(line: 364, column: 3, scope: !981)
!996 = !DILocation(line: 366, column: 3, scope: !981)
!997 = !DILocation(line: 367, column: 1, scope: !981)
!998 = distinct !DISubprogram(name: "getprogname", scope: !357, file: !357, line: 54, type: !999, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !356, retainedNodes: !520)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!36}
!1001 = !DILocation(line: 58, column: 10, scope: !998)
!1002 = !DILocation(line: 58, column: 3, scope: !998)
!1003 = distinct !DISubprogram(name: "set_program_name", scope: !198, file: !198, line: 37, type: !453, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DILocalVariable(name: "argv0", arg: 1, scope: !1003, file: !198, line: 37, type: !36)
!1006 = !DILocalVariable(name: "slash", scope: !1003, file: !198, line: 44, type: !36)
!1007 = !DILocalVariable(name: "base", scope: !1003, file: !198, line: 45, type: !36)
!1008 = !DILocation(line: 0, scope: !1003)
!1009 = !DILocation(line: 44, column: 23, scope: !1003)
!1010 = !DILocation(line: 45, column: 22, scope: !1003)
!1011 = !DILocation(line: 46, column: 17, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1003, file: !198, line: 46, column: 7)
!1013 = !DILocation(line: 46, column: 9, scope: !1012)
!1014 = !DILocation(line: 46, column: 25, scope: !1012)
!1015 = !DILocation(line: 46, column: 40, scope: !1012)
!1016 = !DILocalVariable(name: "__s1", arg: 1, scope: !1017, file: !478, line: 974, type: !646)
!1017 = distinct !DISubprogram(name: "memeq", scope: !478, file: !478, line: 974, type: !1018, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !1020)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!42, !646, !646, !33}
!1020 = !{!1016, !1021, !1022}
!1021 = !DILocalVariable(name: "__s2", arg: 2, scope: !1017, file: !478, line: 974, type: !646)
!1022 = !DILocalVariable(name: "__n", arg: 3, scope: !1017, file: !478, line: 974, type: !33)
!1023 = !DILocation(line: 0, scope: !1017, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 46, column: 28, scope: !1012)
!1025 = !DILocation(line: 976, column: 11, scope: !1017, inlinedAt: !1024)
!1026 = !DILocation(line: 976, column: 10, scope: !1017, inlinedAt: !1024)
!1027 = !DILocation(line: 46, column: 7, scope: !1003)
!1028 = !DILocation(line: 49, column: 11, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1030, file: !198, line: 49, column: 11)
!1030 = distinct !DILexicalBlock(scope: !1012, file: !198, line: 47, column: 5)
!1031 = !DILocation(line: 49, column: 36, scope: !1029)
!1032 = !DILocation(line: 49, column: 11, scope: !1030)
!1033 = !DILocation(line: 65, column: 16, scope: !1003)
!1034 = !DILocation(line: 71, column: 27, scope: !1003)
!1035 = !DILocation(line: 74, column: 33, scope: !1003)
!1036 = !DILocation(line: 76, column: 1, scope: !1003)
!1037 = !DILocation(line: 0, scope: !203)
!1038 = !DILocation(line: 40, column: 29, scope: !203)
!1039 = !DILocation(line: 41, column: 19, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !203, file: !204, line: 41, column: 7)
!1041 = !DILocation(line: 41, column: 7, scope: !203)
!1042 = !DILocation(line: 47, column: 3, scope: !203)
!1043 = !DILocation(line: 48, column: 3, scope: !203)
!1044 = !DILocation(line: 48, column: 13, scope: !203)
!1045 = !DILocalVariable(name: "ps", arg: 1, scope: !1046, file: !1047, line: 1135, type: !1050)
!1046 = distinct !DISubprogram(name: "mbszero", scope: !1047, file: !1047, line: 1135, type: !1048, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !207, retainedNodes: !1051)
!1047 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!1051 = !{!1045}
!1052 = !DILocation(line: 0, scope: !1046, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 48, column: 18, scope: !203)
!1054 = !DILocalVariable(name: "__dest", arg: 1, scope: !1055, file: !1056, line: 57, type: !30)
!1055 = distinct !DISubprogram(name: "memset", scope: !1056, file: !1056, line: 57, type: !1057, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !207, retainedNodes: !1059)
!1056 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!30, !30, !31, !33}
!1059 = !{!1054, !1060, !1061}
!1060 = !DILocalVariable(name: "__ch", arg: 2, scope: !1055, file: !1056, line: 57, type: !31)
!1061 = !DILocalVariable(name: "__len", arg: 3, scope: !1055, file: !1056, line: 57, type: !33)
!1062 = !DILocation(line: 0, scope: !1055, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 1137, column: 3, scope: !1046, inlinedAt: !1053)
!1064 = !DILocation(line: 59, column: 10, scope: !1055, inlinedAt: !1063)
!1065 = !DILocation(line: 49, column: 7, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !203, file: !204, line: 49, column: 7)
!1067 = !DILocation(line: 49, column: 39, scope: !1066)
!1068 = !DILocation(line: 49, column: 44, scope: !1066)
!1069 = !DILocation(line: 54, column: 1, scope: !203)
!1070 = !DISubprogram(name: "mbrtoc32", scope: !215, file: !215, line: 57, type: !1071, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !520)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!33, !1073, !524, !33, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1050)
!1076 = distinct !DISubprogram(name: "clone_quoting_options", scope: !240, file: !240, line: 113, type: !1077, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1080)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1079, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!1080 = !{!1081, !1082, !1083}
!1081 = !DILocalVariable(name: "o", arg: 1, scope: !1076, file: !240, line: 113, type: !1079)
!1082 = !DILocalVariable(name: "saved_errno", scope: !1076, file: !240, line: 115, type: !31)
!1083 = !DILocalVariable(name: "p", scope: !1076, file: !240, line: 116, type: !1079)
!1084 = !DILocation(line: 0, scope: !1076)
!1085 = !DILocation(line: 115, column: 21, scope: !1076)
!1086 = !DILocation(line: 116, column: 40, scope: !1076)
!1087 = !DILocation(line: 116, column: 31, scope: !1076)
!1088 = !DILocation(line: 118, column: 9, scope: !1076)
!1089 = !DILocation(line: 119, column: 3, scope: !1076)
!1090 = distinct !DISubprogram(name: "get_quoting_style", scope: !240, file: !240, line: 124, type: !1091, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1095)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!242, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!1095 = !{!1096}
!1096 = !DILocalVariable(name: "o", arg: 1, scope: !1090, file: !240, line: 124, type: !1093)
!1097 = !DILocation(line: 0, scope: !1090)
!1098 = !DILocation(line: 126, column: 11, scope: !1090)
!1099 = !DILocation(line: 126, column: 46, scope: !1090)
!1100 = !{!1101, !443, i64 0}
!1101 = !{!"quoting_options", !443, i64 0, !529, i64 4, !443, i64 8, !442, i64 40, !442, i64 48}
!1102 = !DILocation(line: 126, column: 3, scope: !1090)
!1103 = distinct !DISubprogram(name: "set_quoting_style", scope: !240, file: !240, line: 132, type: !1104, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1106)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{null, !1079, !242}
!1106 = !{!1107, !1108}
!1107 = !DILocalVariable(name: "o", arg: 1, scope: !1103, file: !240, line: 132, type: !1079)
!1108 = !DILocalVariable(name: "s", arg: 2, scope: !1103, file: !240, line: 132, type: !242)
!1109 = !DILocation(line: 0, scope: !1103)
!1110 = !DILocation(line: 134, column: 4, scope: !1103)
!1111 = !DILocation(line: 134, column: 39, scope: !1103)
!1112 = !DILocation(line: 134, column: 45, scope: !1103)
!1113 = !DILocation(line: 135, column: 1, scope: !1103)
!1114 = distinct !DISubprogram(name: "set_char_quoting", scope: !240, file: !240, line: 143, type: !1115, scopeLine: 144, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1117)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!31, !1079, !29, !31}
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1124, !1125}
!1118 = !DILocalVariable(name: "o", arg: 1, scope: !1114, file: !240, line: 143, type: !1079)
!1119 = !DILocalVariable(name: "c", arg: 2, scope: !1114, file: !240, line: 143, type: !29)
!1120 = !DILocalVariable(name: "i", arg: 3, scope: !1114, file: !240, line: 143, type: !31)
!1121 = !DILocalVariable(name: "uc", scope: !1114, file: !240, line: 145, type: !38)
!1122 = !DILocalVariable(name: "p", scope: !1114, file: !240, line: 146, type: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1124 = !DILocalVariable(name: "shift", scope: !1114, file: !240, line: 148, type: !31)
!1125 = !DILocalVariable(name: "r", scope: !1114, file: !240, line: 149, type: !6)
!1126 = !DILocation(line: 0, scope: !1114)
!1127 = !DILocation(line: 147, column: 6, scope: !1114)
!1128 = !DILocation(line: 147, column: 62, scope: !1114)
!1129 = !DILocation(line: 147, column: 57, scope: !1114)
!1130 = !DILocation(line: 148, column: 15, scope: !1114)
!1131 = !DILocation(line: 149, column: 21, scope: !1114)
!1132 = !DILocation(line: 149, column: 24, scope: !1114)
!1133 = !DILocation(line: 149, column: 34, scope: !1114)
!1134 = !DILocation(line: 150, column: 13, scope: !1114)
!1135 = !DILocation(line: 150, column: 19, scope: !1114)
!1136 = !DILocation(line: 150, column: 24, scope: !1114)
!1137 = !DILocation(line: 150, column: 6, scope: !1114)
!1138 = !DILocation(line: 151, column: 3, scope: !1114)
!1139 = distinct !DISubprogram(name: "set_quoting_flags", scope: !240, file: !240, line: 159, type: !1140, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1142)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!31, !1079, !31}
!1142 = !{!1143, !1144, !1145}
!1143 = !DILocalVariable(name: "o", arg: 1, scope: !1139, file: !240, line: 159, type: !1079)
!1144 = !DILocalVariable(name: "i", arg: 2, scope: !1139, file: !240, line: 159, type: !31)
!1145 = !DILocalVariable(name: "r", scope: !1139, file: !240, line: 163, type: !31)
!1146 = !DILocation(line: 0, scope: !1139)
!1147 = !DILocation(line: 161, column: 8, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1139, file: !240, line: 161, column: 7)
!1149 = !DILocation(line: 161, column: 7, scope: !1139)
!1150 = !DILocation(line: 163, column: 14, scope: !1139)
!1151 = !{!1101, !529, i64 4}
!1152 = !DILocation(line: 164, column: 12, scope: !1139)
!1153 = !DILocation(line: 165, column: 3, scope: !1139)
!1154 = distinct !DISubprogram(name: "set_custom_quoting", scope: !240, file: !240, line: 169, type: !1155, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1157)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{null, !1079, !36, !36}
!1157 = !{!1158, !1159, !1160}
!1158 = !DILocalVariable(name: "o", arg: 1, scope: !1154, file: !240, line: 169, type: !1079)
!1159 = !DILocalVariable(name: "left_quote", arg: 2, scope: !1154, file: !240, line: 170, type: !36)
!1160 = !DILocalVariable(name: "right_quote", arg: 3, scope: !1154, file: !240, line: 170, type: !36)
!1161 = !DILocation(line: 0, scope: !1154)
!1162 = !DILocation(line: 172, column: 8, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1154, file: !240, line: 172, column: 7)
!1164 = !DILocation(line: 172, column: 7, scope: !1154)
!1165 = !DILocation(line: 174, column: 6, scope: !1154)
!1166 = !DILocation(line: 174, column: 12, scope: !1154)
!1167 = !DILocation(line: 175, column: 8, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1154, file: !240, line: 175, column: 7)
!1169 = !DILocation(line: 175, column: 19, scope: !1168)
!1170 = !DILocation(line: 176, column: 5, scope: !1168)
!1171 = !DILocation(line: 177, column: 6, scope: !1154)
!1172 = !DILocation(line: 177, column: 17, scope: !1154)
!1173 = !{!1101, !442, i64 40}
!1174 = !DILocation(line: 178, column: 6, scope: !1154)
!1175 = !DILocation(line: 178, column: 18, scope: !1154)
!1176 = !{!1101, !442, i64 48}
!1177 = !DILocation(line: 179, column: 1, scope: !1154)
!1178 = distinct !DISubprogram(name: "quotearg_buffer", scope: !240, file: !240, line: 774, type: !1179, scopeLine: 777, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1181)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!33, !28, !33, !36, !33, !1093}
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1182 = !DILocalVariable(name: "buffer", arg: 1, scope: !1178, file: !240, line: 774, type: !28)
!1183 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1178, file: !240, line: 774, type: !33)
!1184 = !DILocalVariable(name: "arg", arg: 3, scope: !1178, file: !240, line: 775, type: !36)
!1185 = !DILocalVariable(name: "argsize", arg: 4, scope: !1178, file: !240, line: 775, type: !33)
!1186 = !DILocalVariable(name: "o", arg: 5, scope: !1178, file: !240, line: 776, type: !1093)
!1187 = !DILocalVariable(name: "p", scope: !1178, file: !240, line: 778, type: !1093)
!1188 = !DILocalVariable(name: "saved_errno", scope: !1178, file: !240, line: 779, type: !31)
!1189 = !DILocalVariable(name: "r", scope: !1178, file: !240, line: 780, type: !33)
!1190 = !DILocation(line: 0, scope: !1178)
!1191 = !DILocation(line: 778, column: 37, scope: !1178)
!1192 = !DILocation(line: 779, column: 21, scope: !1178)
!1193 = !DILocation(line: 781, column: 43, scope: !1178)
!1194 = !DILocation(line: 781, column: 53, scope: !1178)
!1195 = !DILocation(line: 781, column: 60, scope: !1178)
!1196 = !DILocation(line: 782, column: 43, scope: !1178)
!1197 = !DILocation(line: 782, column: 58, scope: !1178)
!1198 = !DILocation(line: 780, column: 14, scope: !1178)
!1199 = !DILocation(line: 783, column: 9, scope: !1178)
!1200 = !DILocation(line: 784, column: 3, scope: !1178)
!1201 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !240, file: !240, line: 251, type: !1202, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !1206)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!33, !28, !33, !36, !33, !242, !31, !1204, !36, !36}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1231, !1233, !1236, !1237, !1238, !1239, !1242, !1243, !1246, !1250, !1251, !1259, !1262, !1263, !1265, !1266, !1267, !1268}
!1207 = !DILocalVariable(name: "buffer", arg: 1, scope: !1201, file: !240, line: 251, type: !28)
!1208 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1201, file: !240, line: 251, type: !33)
