; ModuleID = 'src/uname.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [65 x i8] c"Print certain system information.  With no OPTION, same as -s.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [6 x i8] c"uname\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"arch\00", align 1

!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !33, globals: !42, splitDebugInlining: false, nameTableKind: None)
!11 = !{!12, !18}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uname_modes", file: !13, line: 1, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "src/uname.h", directory: "/src", checksumkind: CSK_MD5, checksum: "44f2d6a16060460070884486e185db64")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "UNAME_UNAME", value: 0)
!17 = !DIEnumerator(name: "UNAME_ARCH", value: 1)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !19, line: 46, baseType: !14, size: 32, elements: !20)
!19 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "_ISupper", value: 256)
!22 = !DIEnumerator(name: "_ISlower", value: 512)
!23 = !DIEnumerator(name: "_ISalpha", value: 1024)
!24 = !DIEnumerator(name: "_ISdigit", value: 2048)
!25 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!26 = !DIEnumerator(name: "_ISspace", value: 8192)
!27 = !DIEnumerator(name: "_ISprint", value: 16384)
!28 = !DIEnumerator(name: "_ISgraph", value: 32768)
!29 = !DIEnumerator(name: "_ISblank", value: 1)
!30 = !DIEnumerator(name: "_IScntrl", value: 2)
!31 = !DIEnumerator(name: "_ISpunct", value: 4)
!32 = !DIEnumerator(name: "_ISalnum", value: 8)
!33 = !{!6, !34, !35, !38, !40, !8, !41}
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 46, baseType: !37)
!36 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!37 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!40 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!42 = !{!0, !43, !130, !144, !149}
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !45, file: !46, line: 575, type: !6, isLocal: true, isDefinition: true)
!45 = distinct !DISubprogram(name: "oputs_", scope: !46, file: !46, line: 573, type: !47, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !49)
!46 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!47 = !DISubroutineType(types: !48)
!48 = !{null, !38, !38}
!49 = !{!50, !51, !52, !55, !57, !58, !59, !63, !64, !65, !66, !68, !124, !125, !126, !128, !129}
!50 = !DILocalVariable(name: "program", arg: 1, scope: !45, file: !46, line: 573, type: !38)
!51 = !DILocalVariable(name: "option", arg: 2, scope: !45, file: !46, line: 573, type: !38)
!52 = !DILocalVariable(name: "term", scope: !53, file: !46, line: 585, type: !38)
!53 = distinct !DILexicalBlock(scope: !54, file: !46, line: 582, column: 5)
!54 = distinct !DILexicalBlock(scope: !45, file: !46, line: 581, column: 7)
!55 = !DILocalVariable(name: "double_space", scope: !45, file: !46, line: 594, type: !56)
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DILocalVariable(name: "first_word", scope: !45, file: !46, line: 595, type: !38)
!58 = !DILocalVariable(name: "option_text", scope: !45, file: !46, line: 596, type: !38)
!59 = !DILocalVariable(name: "s", scope: !60, file: !46, line: 608, type: !38)
!60 = distinct !DILexicalBlock(scope: !61, file: !46, line: 605, column: 5)
!61 = distinct !DILexicalBlock(scope: !62, file: !46, line: 604, column: 12)
!62 = distinct !DILexicalBlock(scope: !45, file: !46, line: 597, column: 7)
!63 = !DILocalVariable(name: "spaces", scope: !60, file: !46, line: 609, type: !35)
!64 = !DILocalVariable(name: "anchor_len", scope: !45, file: !46, line: 620, type: !35)
!65 = !DILocalVariable(name: "desc_text", scope: !45, file: !46, line: 625, type: !38)
!66 = !DILocalVariable(name: "__ptr", scope: !67, file: !46, line: 644, type: !38)
!67 = distinct !DILexicalBlock(scope: !45, file: !46, line: 644, column: 3)
!68 = !DILocalVariable(name: "__stream", scope: !67, file: !46, line: 644, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !72)
!71 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 49, size: 1728, elements: !74)
!73 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !90, !92, !93, !94, !98, !99, !101, !105, !108, !110, !113, !116, !117, !118, !119, !120}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !72, file: !73, line: 51, baseType: !6, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !72, file: !73, line: 54, baseType: !8, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !72, file: !73, line: 55, baseType: !8, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !72, file: !73, line: 56, baseType: !8, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !72, file: !73, line: 57, baseType: !8, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !72, file: !73, line: 58, baseType: !8, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !72, file: !73, line: 59, baseType: !8, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !72, file: !73, line: 60, baseType: !8, size: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !72, file: !73, line: 61, baseType: !8, size: 64, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !72, file: !73, line: 64, baseType: !8, size: 64, offset: 576)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !72, file: !73, line: 65, baseType: !8, size: 64, offset: 640)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !72, file: !73, line: 66, baseType: !8, size: 64, offset: 704)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !72, file: !73, line: 68, baseType: !88, size: 64, offset: 768)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !73, line: 36, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !72, file: !73, line: 70, baseType: !91, size: 64, offset: 832)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !72, file: !73, line: 72, baseType: !6, size: 32, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !72, file: !73, line: 73, baseType: !6, size: 32, offset: 928)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !72, file: !73, line: 74, baseType: !95, size: 64, offset: 960)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !96, line: 152, baseType: !97)
!96 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!97 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !72, file: !73, line: 77, baseType: !34, size: 16, offset: 1024)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !72, file: !73, line: 78, baseType: !100, size: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !72, file: !73, line: 79, baseType: !102, size: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !72, file: !73, line: 81, baseType: !106, size: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !73, line: 43, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !72, file: !73, line: 89, baseType: !109, size: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !96, line: 153, baseType: !97)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !72, file: !73, line: 91, baseType: !111, size: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !73, line: 37, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !72, file: !73, line: 92, baseType: !114, size: 64, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !73, line: 38, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !72, file: !73, line: 93, baseType: !91, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !72, file: !73, line: 94, baseType: !41, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !72, file: !73, line: 95, baseType: !35, size: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !72, file: !73, line: 96, baseType: !6, size: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !72, file: !73, line: 98, baseType: !121, size: 160, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !DILocalVariable(name: "__cnt", scope: !67, file: !46, line: 644, type: !35)
!125 = !DILocalVariable(name: "url_program", scope: !45, file: !46, line: 648, type: !38)
!126 = !DILocalVariable(name: "__ptr", scope: !127, file: !46, line: 686, type: !38)
!127 = distinct !DILexicalBlock(scope: !45, file: !46, line: 686, column: 3)
!128 = !DILocalVariable(name: "__stream", scope: !127, file: !46, line: 686, type: !69)
!129 = !DILocalVariable(name: "__cnt", scope: !127, file: !46, line: 686, type: !35)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !10, file: !3, line: 100, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 768, elements: !142)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !135, line: 50, size: 256, elements: !136)
!135 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!136 = !{!137, !138, !139, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !135, line: 52, baseType: !38, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !134, file: !135, line: 55, baseType: !6, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !134, file: !135, line: 56, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !135, line: 57, baseType: !6, size: 32, offset: 192)
!142 = !{!143}
!143 = !DISubrange(count: 3)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !10, file: !3, line: 82, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3584, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 14)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "printed", scope: !151, file: !3, line: 172, type: !56, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 170, type: !152, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{null, !38}
!154 = !{!155}
!155 = !DILocalVariable(name: "element", arg: 1, scope: !151, file: !3, line: 170, type: !38)
!156 = !{!157, !158, !159, !160, !175, !178}
!157 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 289, type: !6)
!158 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 289, type: !7)
!159 = !DILocalVariable(name: "toprint", scope: !2, file: !3, line: 294, type: !14)
!160 = !DILocalVariable(name: "name", scope: !161, file: !3, line: 313, type: !163)
!161 = distinct !DILexicalBlock(scope: !162, file: !3, line: 312, column: 5)
!162 = distinct !DILexicalBlock(scope: !2, file: !3, line: 309, column: 7)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !164, line: 48, size: 3120, elements: !165)
!164 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/utsname.h", directory: "", checksumkind: CSK_MD5, checksum: "025e6c1b1c47580289242d1d03561cee")
!165 = !{!166, !170, !171, !172, !173, !174}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !163, file: !164, line: 51, baseType: !167, size: 520)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 520, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 65)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !163, file: !164, line: 54, baseType: !167, size: 520, offset: 520)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !163, file: !164, line: 57, baseType: !167, size: 520, offset: 1040)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !163, file: !164, line: 59, baseType: !167, size: 520, offset: 1560)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !163, file: !164, line: 62, baseType: !167, size: 520, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !163, file: !164, line: 67, baseType: !167, size: 520, offset: 2600)
!175 = !DILocalVariable(name: "element", scope: !176, file: !3, line: 332, type: !38)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 331, column: 5)
!177 = distinct !DILexicalBlock(scope: !2, file: !3, line: 330, column: 7)
!178 = !DILocalVariable(name: "element", scope: !179, file: !3, line: 366, type: !38)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 365, column: 5)
!180 = distinct !DILexicalBlock(scope: !2, file: !3, line: 364, column: 7)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "uname_mode", scope: !187, file: !188, line: 2, type: !12, isLocal: false, isDefinition: true)
!187 = distinct !DICompileUnit(language: DW_LANG_C99, file: !188, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !189, globals: !190, splitDebugInlining: false, nameTableKind: None)
!188 = !DIFile(filename: "src/uname-uname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "355b38a68e18f877bfa709b962231397")
!189 = !{!12}
!190 = !{!185}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "Version", scope: !193, file: !194, line: 3, type: !38, isLocal: false, isDefinition: true)
!193 = distinct !DICompileUnit(language: DW_LANG_C99, file: !194, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !195, splitDebugInlining: false, nameTableKind: None)
!194 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!195 = !{!191}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !199, line: 45, type: !38, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !200, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!200 = !{!196, !201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !199, line: 55, type: !56, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !205, file: !206, line: 66, type: !241, isLocal: false, isDefinition: true)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !207, globals: !208, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!207 = !{!41, !40}
!208 = !{!209, !235, !203, !237, !239}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "old_file_name", scope: !211, file: !206, line: 304, type: !38, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "verror_at_line", scope: !206, file: !206, line: 298, type: !212, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !228)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !6, !6, !38, !14, !38, !214}
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !215, line: 52, baseType: !216)
!215 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !217, line: 32, baseType: !218)
!217 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !219, baseType: !220)
!219 = !DIFile(filename: "lib/error.c", directory: "/src")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !221, size: 256, elements: !222)
!221 = !DINamespace(name: "std", scope: null)
!222 = !{!223, !224, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !220, file: !219, baseType: !41, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !220, file: !219, baseType: !41, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !220, file: !219, baseType: !41, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !220, file: !219, baseType: !6, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !220, file: !219, baseType: !6, size: 32, offset: 224)
!228 = !{!229, !230, !231, !232, !233, !234}
!229 = !DILocalVariable(name: "status", arg: 1, scope: !211, file: !206, line: 298, type: !6)
!230 = !DILocalVariable(name: "errnum", arg: 2, scope: !211, file: !206, line: 298, type: !6)
!231 = !DILocalVariable(name: "file_name", arg: 3, scope: !211, file: !206, line: 298, type: !38)
!232 = !DILocalVariable(name: "line_number", arg: 4, scope: !211, file: !206, line: 298, type: !14)
!233 = !DILocalVariable(name: "message", arg: 5, scope: !211, file: !206, line: 298, type: !38)
!234 = !DILocalVariable(name: "args", arg: 6, scope: !211, file: !206, line: 298, type: !214)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "old_line_number", scope: !211, file: !206, line: 305, type: !14, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "error_message_count", scope: !205, file: !206, line: 69, type: !14, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !205, file: !206, line: 295, type: !6, isLocal: false, isDefinition: true)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "program_name", scope: !246, file: !247, line: 31, type: !38, isLocal: false, isDefinition: true)
!246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !247, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !248, globals: !249, splitDebugInlining: false, nameTableKind: None)
!247 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!248 = !{!8}
!249 = !{!244}
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "utf07FF", scope: !252, file: !253, line: 46, type: !283, isLocal: true, isDefinition: true)
!252 = distinct !DISubprogram(name: "proper_name_lite", scope: !253, file: !253, line: 38, type: !254, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !256, retainedNodes: !258)
!253 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!254 = !DISubroutineType(types: !255)
!255 = !{!38, !38, !38}
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !257, splitDebugInlining: false, nameTableKind: None)
!257 = !{!250}
!258 = !{!259, !260, !261, !262, !267}
!259 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !252, file: !253, line: 38, type: !38)
!260 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !252, file: !253, line: 38, type: !38)
!261 = !DILocalVariable(name: "translation", scope: !252, file: !253, line: 40, type: !38)
!262 = !DILocalVariable(name: "w", scope: !252, file: !253, line: 47, type: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !264, line: 37, baseType: !265)
!264 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !96, line: 57, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !96, line: 42, baseType: !14)
!267 = !DILocalVariable(name: "mbs", scope: !252, file: !253, line: 48, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !269, line: 6, baseType: !270)
!269 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !271, line: 21, baseType: !272)
!271 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 13, size: 64, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !272, file: !271, line: 15, baseType: !6, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !272, file: !271, line: 20, baseType: !276, size: 32, offset: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !272, file: !271, line: 16, size: 32, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !276, file: !271, line: 18, baseType: !14, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !276, file: !271, line: 19, baseType: !280, size: 32)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 4)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 2)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !288, file: !289, line: 76, type: !369, isLocal: false, isDefinition: true)
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !290, retainedTypes: !310, globals: !311, splitDebugInlining: false, nameTableKind: None)
!289 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!290 = !{!291, !305, !18}
!291 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !292, line: 42, baseType: !14, size: 32, elements: !293)
!292 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!294 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!295 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!296 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!297 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!298 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!299 = !DIEnumerator(name: "c_quoting_style", value: 5)
!300 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!301 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!302 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!303 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!304 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !292, line: 254, baseType: !14, size: 32, elements: !306)
!306 = !{!307, !308, !309}
!307 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!308 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!309 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!310 = !{!6, !34, !35}
!311 = !{!286, !312, !318, !328, !330, !335, !358, !365, !367}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !288, file: !289, line: 92, type: !314, isLocal: false, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 320, elements: !316)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!316 = !{!317}
!317 = !DISubrange(count: 10)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !288, file: !289, line: 1040, type: !320, isLocal: false, isDefinition: true)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !289, line: 56, size: 448, elements: !321)
!321 = !{!322, !323, !324, !326, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !320, file: !289, line: 59, baseType: !291, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !289, line: 62, baseType: !6, size: 32, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !320, file: !289, line: 66, baseType: !325, size: 256, offset: 64)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !182)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !320, file: !289, line: 69, baseType: !38, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !320, file: !289, line: 72, baseType: !38, size: 64, offset: 384)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !288, file: !289, line: 107, type: !320, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "slot0", scope: !288, file: !289, line: 831, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 256)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "quote", scope: !337, file: !289, line: 228, type: !356, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "gettext_quote", scope: !289, file: !289, line: 197, type: !338, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !288, retainedNodes: !340)
!338 = !DISubroutineType(types: !339)
!339 = !{!38, !38, !291}
!340 = !{!341, !342, !343, !344, !345}
!341 = !DILocalVariable(name: "msgid", arg: 1, scope: !337, file: !289, line: 197, type: !38)
!342 = !DILocalVariable(name: "s", arg: 2, scope: !337, file: !289, line: 197, type: !291)
!343 = !DILocalVariable(name: "translation", scope: !337, file: !289, line: 199, type: !38)
!344 = !DILocalVariable(name: "w", scope: !337, file: !289, line: 229, type: !263)
!345 = !DILocalVariable(name: "mbs", scope: !337, file: !289, line: 230, type: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !269, line: 6, baseType: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !271, line: 21, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 13, size: 64, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !348, file: !271, line: 15, baseType: !6, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !348, file: !271, line: 20, baseType: !352, size: 32, offset: 32)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !348, file: !271, line: 16, size: 32, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !352, file: !271, line: 18, baseType: !14, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !352, file: !271, line: 19, baseType: !280, size: 32)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 64, elements: !357)
!357 = !{!285, !282}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "slotvec", scope: !288, file: !289, line: 834, type: !360, isLocal: true, isDefinition: true)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !289, line: 823, size: 128, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !289, line: 825, baseType: !35, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !361, file: !289, line: 826, baseType: !8, size: 64, offset: 64)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "nslots", scope: !288, file: !289, line: 832, type: !6, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "slotvec0", scope: !288, file: !289, line: 833, type: !361, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 704, elements: !371)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!371 = !{!372}
!372 = !DISubrange(count: 11)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !375, file: !376, line: 26, type: !378, isLocal: false, isDefinition: true)
!375 = distinct !DICompileUnit(language: DW_LANG_C99, file: !376, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !377, splitDebugInlining: false, nameTableKind: None)
!376 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!377 = !{!373}
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 376, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 47)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "exit_failure", scope: !383, file: !384, line: 24, type: !386, isLocal: false, isDefinition: true)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !385, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!385 = !{!381}
!386 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "internal_state", scope: !389, file: !390, line: 97, type: !393, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !391, globals: !392, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!391 = !{!41, !35, !40}
!392 = !{!387}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !269, line: 6, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !271, line: 21, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 13, size: 64, elements: !396)
!396 = !{!397, !398}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !395, file: !271, line: 15, baseType: !6, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !395, file: !271, line: 20, baseType: !399, size: 32, offset: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !271, line: 16, size: 32, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !399, file: !271, line: 18, baseType: !14, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !399, file: !271, line: 19, baseType: !280, size: 32)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !407, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!407 = !{!408}
!408 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !406, line: 40, baseType: !14, size: 32, elements: !409)
!409 = !{!410}
!410 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!411 = !{!41}
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !414, retainedTypes: !445, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!414 = !{!415, !427}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !416, file: !413, line: 188, baseType: !14, size: 32, elements: !425)
!416 = distinct !DISubprogram(name: "x2nrealloc", scope: !413, file: !413, line: 176, type: !417, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !420)
!417 = !DISubroutineType(types: !418)
!418 = !{!41, !41, !419, !35}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!420 = !{!421, !422, !423, !424}
!421 = !DILocalVariable(name: "p", arg: 1, scope: !416, file: !413, line: 176, type: !41)
!422 = !DILocalVariable(name: "pn", arg: 2, scope: !416, file: !413, line: 176, type: !419)
!423 = !DILocalVariable(name: "s", arg: 3, scope: !416, file: !413, line: 176, type: !35)
!424 = !DILocalVariable(name: "n", scope: !416, file: !413, line: 178, type: !35)
!425 = !{!426}
!426 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !428, file: !413, line: 228, baseType: !14, size: 32, elements: !425)
!428 = distinct !DISubprogram(name: "xpalloc", scope: !413, file: !413, line: 223, type: !429, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !435)
!429 = !DISubroutineType(types: !430)
!430 = !{!41, !41, !431, !432, !434, !432}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !433, line: 130, baseType: !434)
!433 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !36, line: 35, baseType: !97)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444}
!436 = !DILocalVariable(name: "pa", arg: 1, scope: !428, file: !413, line: 223, type: !41)
!437 = !DILocalVariable(name: "pn", arg: 2, scope: !428, file: !413, line: 223, type: !431)
!438 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !428, file: !413, line: 223, type: !432)
!439 = !DILocalVariable(name: "n_max", arg: 4, scope: !428, file: !413, line: 223, type: !434)
!440 = !DILocalVariable(name: "s", arg: 5, scope: !428, file: !413, line: 223, type: !432)
!441 = !DILocalVariable(name: "n0", scope: !428, file: !413, line: 230, type: !432)
!442 = !DILocalVariable(name: "n", scope: !428, file: !413, line: 237, type: !432)
!443 = !DILocalVariable(name: "nbytes", scope: !428, file: !413, line: 248, type: !432)
!444 = !DILocalVariable(name: "adjusted_nbytes", scope: !428, file: !413, line: 252, type: !432)
!445 = !{!8, !41, !56, !97, !37}
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!448 = distinct !DICompileUnit(language: DW_LANG_C99, file: !449, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!449 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!458 = !{!56, !37, !41}
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !411, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!465 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!466 = !{i32 7, !"Dwarf Version", i32 5}
!467 = !{i32 2, !"Debug Info Version", i32 3}
!468 = !{i32 1, !"wchar_size", i32 4}
!469 = !{i32 1, !"branch-target-enforcement", i32 0}
!470 = !{i32 1, !"sign-return-address", i32 0}
!471 = !{i32 1, !"sign-return-address-all", i32 0}
!472 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!473 = !{i32 7, !"PIC Level", i32 2}
!474 = !{i32 7, !"PIE Level", i32 2}
!475 = !{i32 7, !"uwtable", i32 1}
!476 = !{i32 7, !"frame-pointer", i32 1}
!477 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 108, type: !478, scopeLine: 109, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !6}
!480 = !{!481}
!481 = !DILocalVariable(name: "status", arg: 1, scope: !477, file: !3, line: 108, type: !6)
!482 = !DILocation(line: 0, scope: !477)
!483 = !DILocation(line: 110, column: 14, scope: !484)
!484 = distinct !DILexicalBlock(scope: !477, file: !3, line: 110, column: 7)
!485 = !DILocation(line: 110, column: 7, scope: !477)
!486 = !DILocation(line: 111, column: 5, scope: !487)
!487 = distinct !DILexicalBlock(scope: !484, file: !3, line: 111, column: 5)
!488 = !{!489, !489, i64 0}
!489 = !{!"any pointer", !490, i64 0}
!490 = !{!"omnipotent char", !491, i64 0}
!491 = !{!"Simple C/C++ TBAA"}
!492 = !DILocation(line: 114, column: 7, scope: !493)
!493 = distinct !DILexicalBlock(scope: !484, file: !3, line: 113, column: 5)
!494 = !DILocation(line: 116, column: 11, scope: !495)
!495 = distinct !DILexicalBlock(scope: !493, file: !3, line: 116, column: 11)
!496 = !{!490, !490, i64 0}
!497 = !DILocation(line: 116, column: 22, scope: !495)
!498 = !DILocation(line: 116, column: 11, scope: !493)
!499 = !DILocation(line: 118, column: 11, scope: !500)
!500 = distinct !DILexicalBlock(scope: !495, file: !3, line: 117, column: 9)
!501 = !DILocation(line: 122, column: 11, scope: !500)
!502 = !DILocation(line: 126, column: 11, scope: !500)
!503 = !DILocation(line: 129, column: 11, scope: !500)
!504 = !DILocation(line: 132, column: 11, scope: !500)
!505 = !DILocation(line: 135, column: 11, scope: !500)
!506 = !DILocation(line: 138, column: 11, scope: !500)
!507 = !DILocation(line: 141, column: 11, scope: !500)
!508 = !DILocation(line: 144, column: 11, scope: !500)
!509 = !DILocation(line: 147, column: 11, scope: !500)
!510 = !DILocation(line: 150, column: 9, scope: !500)
!511 = !DILocation(line: 153, column: 11, scope: !512)
!512 = distinct !DILexicalBlock(scope: !495, file: !3, line: 152, column: 9)
!513 = !DILocation(line: 159, column: 7, scope: !493)
!514 = !DILocation(line: 160, column: 7, scope: !493)
!515 = !DILocation(line: 161, column: 28, scope: !493)
!516 = !DILocalVariable(name: "program", arg: 1, scope: !517, file: !46, line: 836, type: !38)
!517 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !46, file: !46, line: 836, type: !152, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !518)
!518 = !{!516, !519, !528, !529, !531, !532}
!519 = !DILocalVariable(name: "infomap", scope: !517, file: !46, line: 838, type: !520)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 896, elements: !526)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !517, file: !46, line: 838, size: 128, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !522, file: !46, line: 838, baseType: !38, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !522, file: !46, line: 838, baseType: !38, size: 64, offset: 64)
!526 = !{!527}
!527 = !DISubrange(count: 7)
!528 = !DILocalVariable(name: "node", scope: !517, file: !46, line: 848, type: !38)
!529 = !DILocalVariable(name: "map_prog", scope: !517, file: !46, line: 849, type: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!531 = !DILocalVariable(name: "lc_messages", scope: !517, file: !46, line: 861, type: !38)
!532 = !DILocalVariable(name: "url_program", scope: !517, file: !46, line: 874, type: !38)
!533 = !DILocation(line: 0, scope: !517, inlinedAt: !534)
!534 = distinct !DILocation(line: 161, column: 7, scope: !493)
!535 = !DILocation(line: 838, column: 3, scope: !517, inlinedAt: !534)
!536 = !DILocation(line: 838, column: 67, scope: !517, inlinedAt: !534)
!537 = !DILocation(line: 849, column: 36, scope: !517, inlinedAt: !534)
!538 = !DILocation(line: 851, column: 3, scope: !517, inlinedAt: !534)
!539 = !DILocalVariable(name: "__s1", arg: 1, scope: !540, file: !541, line: 1359, type: !38)
!540 = distinct !DISubprogram(name: "streq", scope: !541, file: !541, line: 1359, type: !542, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !544)
!541 = !DIFile(filename: "./lib/string.h", directory: "/src")
!542 = !DISubroutineType(types: !543)
!543 = !{!56, !38, !38}
!544 = !{!539, !545}
!545 = !DILocalVariable(name: "__s2", arg: 2, scope: !540, file: !541, line: 1359, type: !38)
!546 = !DILocation(line: 0, scope: !540, inlinedAt: !547)
!547 = distinct !DILocation(line: 851, column: 33, scope: !517, inlinedAt: !534)
!548 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !547)
!549 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !547)
!550 = !DILocation(line: 852, column: 13, scope: !517, inlinedAt: !534)
!551 = !DILocation(line: 851, column: 20, scope: !517, inlinedAt: !534)
!552 = !{!553, !489, i64 0}
!553 = !{!"infomap", !489, i64 0, !489, i64 8}
!554 = !DILocation(line: 851, column: 10, scope: !517, inlinedAt: !534)
!555 = !DILocation(line: 851, column: 28, scope: !517, inlinedAt: !534)
!556 = distinct !{!556, !538, !550, !557}
!557 = !{!"llvm.loop.mustprogress"}
!558 = !DILocation(line: 854, column: 17, scope: !559, inlinedAt: !534)
!559 = distinct !DILexicalBlock(scope: !517, file: !46, line: 854, column: 7)
!560 = !{!553, !489, i64 8}
!561 = !DILocation(line: 854, column: 7, scope: !559, inlinedAt: !534)
!562 = !DILocation(line: 854, column: 7, scope: !517, inlinedAt: !534)
!563 = !DILocation(line: 857, column: 3, scope: !517, inlinedAt: !534)
!564 = !DILocation(line: 861, column: 29, scope: !517, inlinedAt: !534)
!565 = !DILocation(line: 862, column: 7, scope: !566, inlinedAt: !534)
!566 = distinct !DILexicalBlock(scope: !517, file: !46, line: 862, column: 7)
!567 = !DILocation(line: 862, column: 19, scope: !566, inlinedAt: !534)
!568 = !DILocation(line: 862, column: 22, scope: !566, inlinedAt: !534)
!569 = !DILocation(line: 862, column: 7, scope: !517, inlinedAt: !534)
!570 = !DILocation(line: 868, column: 7, scope: !571, inlinedAt: !534)
!571 = distinct !DILexicalBlock(scope: !566, file: !46, line: 863, column: 5)
!572 = !DILocation(line: 870, column: 5, scope: !571, inlinedAt: !534)
!573 = !DILocation(line: 0, scope: !540, inlinedAt: !574)
!574 = distinct !DILocation(line: 874, column: 29, scope: !517, inlinedAt: !534)
!575 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !574)
!576 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !574)
!577 = !DILocation(line: 874, column: 29, scope: !517, inlinedAt: !534)
!578 = !DILocation(line: 875, column: 3, scope: !517, inlinedAt: !534)
!579 = !DILocation(line: 877, column: 3, scope: !517, inlinedAt: !534)
!580 = !DILocation(line: 879, column: 1, scope: !517, inlinedAt: !534)
!581 = !DILocation(line: 163, column: 3, scope: !477)
!582 = !DISubprogram(name: "dcgettext", scope: !583, file: !583, line: 51, type: !584, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!583 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!584 = !DISubroutineType(types: !585)
!585 = !{!8, !38, !38, !6}
!586 = !{}
!587 = !DISubprogram(name: "fputs_unlocked", scope: !215, file: !215, line: 691, type: !588, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!588 = !DISubroutineType(types: !589)
!589 = !{!6, !590, !591}
!590 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !38)
!591 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!592 = !DILocation(line: 0, scope: !45)
!593 = !DILocation(line: 581, column: 7, scope: !54)
!594 = !{!595, !595, i64 0}
!595 = !{!"int", !490, i64 0}
!596 = !DILocation(line: 581, column: 19, scope: !54)
!597 = !DILocation(line: 581, column: 7, scope: !45)
!598 = !DILocation(line: 585, column: 26, scope: !53)
!599 = !DILocation(line: 0, scope: !53)
!600 = !DILocation(line: 586, column: 23, scope: !53)
!601 = !DILocation(line: 586, column: 28, scope: !53)
!602 = !DILocation(line: 586, column: 32, scope: !53)
!603 = !DILocation(line: 586, column: 38, scope: !53)
!604 = !DILocation(line: 0, scope: !540, inlinedAt: !605)
!605 = distinct !DILocation(line: 586, column: 41, scope: !53)
!606 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !605)
!607 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !605)
!608 = !DILocation(line: 586, column: 19, scope: !53)
!609 = !DILocation(line: 587, column: 5, scope: !53)
!610 = !DILocation(line: 588, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !45, file: !46, line: 588, column: 7)
!612 = !DILocation(line: 588, column: 7, scope: !45)
!613 = !DILocation(line: 590, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !46, line: 589, column: 5)
!615 = !DILocation(line: 591, column: 7, scope: !614)
!616 = !DILocation(line: 595, column: 37, scope: !45)
!617 = !DILocation(line: 595, column: 35, scope: !45)
!618 = !DILocation(line: 596, column: 29, scope: !45)
!619 = !DILocation(line: 597, column: 8, scope: !62)
!620 = !DILocation(line: 597, column: 7, scope: !45)
!621 = !DILocation(line: 604, column: 24, scope: !61)
!622 = !DILocation(line: 604, column: 12, scope: !62)
!623 = !DILocation(line: 0, scope: !60)
!624 = !DILocation(line: 610, column: 16, scope: !60)
!625 = !DILocation(line: 610, column: 7, scope: !60)
!626 = !DILocation(line: 611, column: 21, scope: !60)
!627 = !{!628, !628, i64 0}
!628 = !{!"short", !490, i64 0}
!629 = !DILocation(line: 611, column: 19, scope: !60)
!630 = !DILocation(line: 611, column: 16, scope: !60)
!631 = !DILocation(line: 610, column: 30, scope: !60)
!632 = distinct !{!632, !625, !626, !557}
!633 = !DILocation(line: 612, column: 18, scope: !634)
!634 = distinct !DILexicalBlock(scope: !60, file: !46, line: 612, column: 11)
!635 = !DILocation(line: 612, column: 11, scope: !60)
!636 = !DILocation(line: 618, column: 5, scope: !60)
!637 = !DILocation(line: 620, column: 23, scope: !45)
!638 = !DILocation(line: 625, column: 39, scope: !45)
!639 = !DILocation(line: 626, column: 3, scope: !45)
!640 = !DILocation(line: 626, column: 10, scope: !45)
!641 = !DILocation(line: 626, column: 21, scope: !45)
!642 = !DILocation(line: 628, column: 44, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !46, line: 628, column: 11)
!644 = distinct !DILexicalBlock(scope: !45, file: !46, line: 627, column: 5)
!645 = !DILocation(line: 628, column: 32, scope: !643)
!646 = !DILocation(line: 628, column: 49, scope: !643)
!647 = !DILocation(line: 628, column: 11, scope: !644)
!648 = !DILocation(line: 630, column: 11, scope: !649)
!649 = distinct !DILexicalBlock(scope: !644, file: !46, line: 630, column: 11)
!650 = !DILocation(line: 630, column: 11, scope: !644)
!651 = !DILocation(line: 632, column: 26, scope: !652)
!652 = distinct !DILexicalBlock(scope: !653, file: !46, line: 632, column: 15)
!653 = distinct !DILexicalBlock(scope: !649, file: !46, line: 631, column: 9)
!654 = !DILocation(line: 632, column: 34, scope: !652)
!655 = !DILocation(line: 632, column: 37, scope: !652)
!656 = !DILocation(line: 632, column: 15, scope: !653)
!657 = !DILocation(line: 636, column: 29, scope: !658)
!658 = distinct !DILexicalBlock(scope: !653, file: !46, line: 636, column: 15)
!659 = !DILocation(line: 640, column: 16, scope: !644)
!660 = distinct !{!660, !639, !661, !557}
!661 = !DILocation(line: 641, column: 5, scope: !45)
!662 = !DILocation(line: 644, column: 3, scope: !45)
!663 = !DILocation(line: 0, scope: !540, inlinedAt: !664)
!664 = distinct !DILocation(line: 648, column: 31, scope: !45)
!665 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !664)
!666 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !664)
!667 = !DILocation(line: 648, column: 31, scope: !45)
!668 = !DILocation(line: 0, scope: !540, inlinedAt: !669)
!669 = distinct !DILocation(line: 649, column: 31, scope: !45)
!670 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !669)
!671 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !669)
!672 = !DILocation(line: 649, column: 31, scope: !45)
!673 = !DILocation(line: 0, scope: !540, inlinedAt: !674)
!674 = distinct !DILocation(line: 650, column: 31, scope: !45)
!675 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !674)
!676 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !674)
!677 = !DILocation(line: 650, column: 31, scope: !45)
!678 = !DILocation(line: 0, scope: !540, inlinedAt: !679)
!679 = distinct !DILocation(line: 651, column: 31, scope: !45)
!680 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !679)
!681 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !679)
!682 = !DILocation(line: 651, column: 31, scope: !45)
!683 = !DILocation(line: 0, scope: !540, inlinedAt: !684)
!684 = distinct !DILocation(line: 652, column: 31, scope: !45)
!685 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !684)
!686 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !684)
!687 = !DILocation(line: 652, column: 31, scope: !45)
!688 = !DILocation(line: 0, scope: !540, inlinedAt: !689)
!689 = distinct !DILocation(line: 653, column: 31, scope: !45)
!690 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !689)
!691 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !689)
!692 = !DILocation(line: 653, column: 31, scope: !45)
!693 = !DILocation(line: 0, scope: !540, inlinedAt: !694)
!694 = distinct !DILocation(line: 654, column: 31, scope: !45)
!695 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !694)
!696 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !694)
!697 = !DILocation(line: 654, column: 31, scope: !45)
!698 = !DILocation(line: 0, scope: !540, inlinedAt: !699)
!699 = distinct !DILocation(line: 655, column: 31, scope: !45)
!700 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !699)
!701 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !699)
!702 = !DILocation(line: 655, column: 31, scope: !45)
!703 = !DILocation(line: 0, scope: !540, inlinedAt: !704)
!704 = distinct !DILocation(line: 656, column: 31, scope: !45)
!705 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !704)
!706 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !704)
!707 = !DILocation(line: 656, column: 31, scope: !45)
!708 = !DILocation(line: 0, scope: !540, inlinedAt: !709)
!709 = distinct !DILocation(line: 657, column: 31, scope: !45)
!710 = !DILocation(line: 1361, column: 11, scope: !540, inlinedAt: !709)
!711 = !DILocation(line: 1361, column: 10, scope: !540, inlinedAt: !709)
!712 = !DILocation(line: 657, column: 31, scope: !45)
!713 = !DILocation(line: 663, column: 7, scope: !714)
!714 = distinct !DILexicalBlock(scope: !45, file: !46, line: 663, column: 7)
!715 = !DILocation(line: 664, column: 7, scope: !714)
!716 = !DILocation(line: 664, column: 10, scope: !714)
!717 = !DILocation(line: 663, column: 7, scope: !45)
!718 = !DILocation(line: 669, column: 7, scope: !719)
!719 = distinct !DILexicalBlock(scope: !714, file: !46, line: 665, column: 5)
!720 = !DILocation(line: 671, column: 5, scope: !719)
!721 = !DILocation(line: 676, column: 7, scope: !722)
!722 = distinct !DILexicalBlock(scope: !714, file: !46, line: 673, column: 5)
!723 = !DILocation(line: 679, column: 3, scope: !45)
!724 = !DILocation(line: 683, column: 3, scope: !45)
!725 = !DILocation(line: 686, column: 3, scope: !45)
!726 = !DILocation(line: 688, column: 3, scope: !45)
!727 = !DILocation(line: 691, column: 3, scope: !45)
!728 = !DILocation(line: 695, column: 3, scope: !45)
!729 = !DILocation(line: 696, column: 1, scope: !45)
!730 = !DISubprogram(name: "setlocale", scope: !731, file: !731, line: 122, type: !732, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!731 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!732 = !DISubroutineType(types: !733)
!733 = !{!8, !6, !38}
!734 = !DISubprogram(name: "getenv", scope: !735, file: !735, line: 641, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!735 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!736 = !DISubroutineType(types: !737)
!737 = !{!8, !38}
!738 = !DISubprogram(name: "fwrite_unlocked", scope: !215, file: !215, line: 704, type: !739, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!739 = !DISubroutineType(types: !740)
!740 = !{!35, !741, !35, !35, !591}
!741 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!744 = !DILocation(line: 0, scope: !2)
!745 = !DILocation(line: 297, column: 21, scope: !2)
!746 = !DILocation(line: 297, column: 3, scope: !2)
!747 = !DILocation(line: 298, column: 3, scope: !2)
!748 = !DILocation(line: 299, column: 3, scope: !2)
!749 = !DILocation(line: 300, column: 3, scope: !2)
!750 = !DILocation(line: 302, column: 3, scope: !2)
!751 = !DILocalVariable(name: "argc", arg: 1, scope: !752, file: !3, line: 202, type: !6)
!752 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 202, type: !4, scopeLine: 203, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !753)
!753 = !{!751, !754, !755, !756}
!754 = !DILocalVariable(name: "argv", arg: 2, scope: !752, file: !3, line: 202, type: !7)
!755 = !DILocalVariable(name: "c", scope: !752, file: !3, line: 204, type: !6)
!756 = !DILocalVariable(name: "toprint", scope: !752, file: !3, line: 205, type: !14)
!757 = !DILocation(line: 0, scope: !752, inlinedAt: !758)
!758 = distinct !DILocation(line: 304, column: 13, scope: !2)
!759 = !DILocation(line: 207, column: 7, scope: !760, inlinedAt: !758)
!760 = distinct !DILexicalBlock(scope: !752, file: !3, line: 207, column: 7)
!761 = !DILocation(line: 207, column: 18, scope: !760, inlinedAt: !758)
!762 = !DILocation(line: 207, column: 7, scope: !752, inlinedAt: !758)
!763 = !DILocation(line: 209, column: 19, scope: !764, inlinedAt: !758)
!764 = distinct !DILexicalBlock(scope: !760, file: !3, line: 208, column: 5)
!765 = !DILocation(line: 209, column: 7, scope: !764, inlinedAt: !758)
!766 = !DILocation(line: 215, column: 13, scope: !767, inlinedAt: !758)
!767 = distinct !DILexicalBlock(scope: !768, file: !3, line: 214, column: 13)
!768 = distinct !DILexicalBlock(scope: !764, file: !3, line: 212, column: 9)
!769 = !DILocation(line: 217, column: 13, scope: !767, inlinedAt: !758)
!770 = !DILocation(line: 220, column: 15, scope: !767, inlinedAt: !758)
!771 = !DILocation(line: 227, column: 19, scope: !772, inlinedAt: !758)
!772 = distinct !DILexicalBlock(scope: !760, file: !3, line: 226, column: 5)
!773 = !DILocation(line: 227, column: 7, scope: !772, inlinedAt: !758)
!774 = !DILocation(line: 238, column: 23, scope: !775, inlinedAt: !758)
!775 = distinct !DILexicalBlock(scope: !776, file: !3, line: 232, column: 13)
!776 = distinct !DILexicalBlock(scope: !772, file: !3, line: 230, column: 9)
!777 = !DILocation(line: 239, column: 15, scope: !775, inlinedAt: !758)
!778 = !DILocation(line: 242, column: 23, scope: !775, inlinedAt: !758)
!779 = !DILocation(line: 243, column: 15, scope: !775, inlinedAt: !758)
!780 = !DILocation(line: 246, column: 23, scope: !775, inlinedAt: !758)
!781 = !DILocation(line: 247, column: 15, scope: !775, inlinedAt: !758)
!782 = !DILocation(line: 250, column: 23, scope: !775, inlinedAt: !758)
!783 = !DILocation(line: 251, column: 15, scope: !775, inlinedAt: !758)
!784 = !DILocation(line: 254, column: 23, scope: !775, inlinedAt: !758)
!785 = !DILocation(line: 255, column: 15, scope: !775, inlinedAt: !758)
!786 = !DILocation(line: 258, column: 23, scope: !775, inlinedAt: !758)
!787 = !DILocation(line: 259, column: 15, scope: !775, inlinedAt: !758)
!788 = !DILocation(line: 262, column: 23, scope: !775, inlinedAt: !758)
!789 = !DILocation(line: 263, column: 15, scope: !775, inlinedAt: !758)
!790 = !DILocation(line: 266, column: 23, scope: !775, inlinedAt: !758)
!791 = !DILocation(line: 267, column: 15, scope: !775, inlinedAt: !758)
!792 = distinct !{!792, !773, !793, !557}
!793 = !DILocation(line: 276, column: 9, scope: !772, inlinedAt: !758)
!794 = !DILocation(line: 269, column: 13, scope: !775, inlinedAt: !758)
!795 = !DILocation(line: 271, column: 13, scope: !775, inlinedAt: !758)
!796 = !DILocation(line: 274, column: 15, scope: !775, inlinedAt: !758)
!797 = !DILocation(line: 279, column: 15, scope: !798, inlinedAt: !758)
!798 = distinct !DILexicalBlock(scope: !752, file: !3, line: 279, column: 7)
!799 = !DILocation(line: 279, column: 12, scope: !798, inlinedAt: !758)
!800 = !DILocation(line: 279, column: 7, scope: !752, inlinedAt: !758)
!801 = !DILocation(line: 281, column: 7, scope: !802, inlinedAt: !758)
!802 = distinct !DILexicalBlock(scope: !798, file: !3, line: 280, column: 5)
!803 = !DILocation(line: 282, column: 7, scope: !802, inlinedAt: !758)
!804 = !DILocation(line: 306, column: 15, scope: !805)
!805 = distinct !DILexicalBlock(scope: !2, file: !3, line: 306, column: 7)
!806 = !DILocation(line: 306, column: 7, scope: !2)
!807 = !DILocation(line: 310, column: 8, scope: !162)
!808 = !DILocation(line: 309, column: 7, scope: !2)
!809 = !DILocation(line: 313, column: 7, scope: !161)
!810 = !DILocation(line: 313, column: 22, scope: !161)
!811 = !DILocation(line: 315, column: 11, scope: !812)
!812 = distinct !DILexicalBlock(scope: !161, file: !3, line: 315, column: 11)
!813 = !DILocation(line: 315, column: 25, scope: !812)
!814 = !DILocation(line: 315, column: 11, scope: !161)
!815 = !DILocation(line: 316, column: 9, scope: !812)
!816 = !DILocation(line: 318, column: 19, scope: !817)
!817 = distinct !DILexicalBlock(scope: !161, file: !3, line: 318, column: 11)
!818 = !DILocation(line: 318, column: 11, scope: !161)
!819 = !DILocalVariable(name: "element", arg: 1, scope: !820, file: !3, line: 184, type: !38)
!820 = distinct !DISubprogram(name: "print_element_env", scope: !3, file: !3, line: 184, type: !47, scopeLine: 185, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !821)
!821 = !{!819, !822}
!822 = !DILocalVariable(name: "envvar", arg: 2, scope: !820, file: !3, line: 184, type: !38)
!823 = !DILocation(line: 0, scope: !820, inlinedAt: !824)
!824 = distinct !DILocation(line: 319, column: 9, scope: !817)
!825 = !DILocation(line: 0, scope: !151, inlinedAt: !826)
!826 = distinct !DILocation(line: 194, column: 3, scope: !820, inlinedAt: !824)
!827 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !826)
!828 = distinct !DILexicalBlock(scope: !151, file: !3, line: 173, column: 7)
!829 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !826)
!830 = !DILocalVariable(name: "__c", arg: 1, scope: !831, file: !832, line: 108, type: !6)
!831 = distinct !DISubprogram(name: "putchar_unlocked", scope: !832, file: !832, line: 108, type: !833, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !835)
!832 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!833 = !DISubroutineType(types: !834)
!834 = !{!6, !6}
!835 = !{!830}
!836 = !DILocation(line: 0, scope: !831, inlinedAt: !837)
!837 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !826)
!838 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !837)
!839 = !{!840, !489, i64 40}
!840 = !{!"_IO_FILE", !595, i64 0, !489, i64 8, !489, i64 16, !489, i64 24, !489, i64 32, !489, i64 40, !489, i64 48, !489, i64 56, !489, i64 64, !489, i64 72, !489, i64 80, !489, i64 88, !489, i64 96, !489, i64 104, !595, i64 112, !595, i64 116, !841, i64 120, !628, i64 128, !490, i64 130, !490, i64 131, !489, i64 136, !841, i64 144, !489, i64 152, !489, i64 160, !489, i64 168, !489, i64 176, !841, i64 184, !595, i64 192, !490, i64 196}
!841 = !{!"long", !490, i64 0}
!842 = !{!840, !489, i64 48}
!843 = !{!"branch_weights", i32 2000, i32 1}
!844 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !826)
!845 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !826)
!846 = !DILocation(line: 319, column: 9, scope: !817)
!847 = !DILocation(line: 320, column: 19, scope: !848)
!848 = distinct !DILexicalBlock(scope: !161, file: !3, line: 320, column: 11)
!849 = !DILocation(line: 320, column: 11, scope: !161)
!850 = !DILocation(line: 321, column: 28, scope: !848)
!851 = !DILocation(line: 0, scope: !820, inlinedAt: !852)
!852 = distinct !DILocation(line: 321, column: 9, scope: !848)
!853 = !DILocation(line: 0, scope: !151, inlinedAt: !854)
!854 = distinct !DILocation(line: 194, column: 3, scope: !820, inlinedAt: !852)
!855 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !854)
!856 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !854)
!857 = !DILocation(line: 0, scope: !831, inlinedAt: !858)
!858 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !854)
!859 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !858)
!860 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !854)
!861 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !854)
!862 = !DILocation(line: 321, column: 9, scope: !848)
!863 = !DILocation(line: 322, column: 19, scope: !864)
!864 = distinct !DILexicalBlock(scope: !161, file: !3, line: 322, column: 11)
!865 = !DILocation(line: 322, column: 11, scope: !161)
!866 = !DILocation(line: 323, column: 28, scope: !864)
!867 = !DILocation(line: 0, scope: !820, inlinedAt: !868)
!868 = distinct !DILocation(line: 323, column: 9, scope: !864)
!869 = !DILocation(line: 0, scope: !151, inlinedAt: !870)
!870 = distinct !DILocation(line: 194, column: 3, scope: !820, inlinedAt: !868)
!871 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !870)
!872 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !870)
!873 = !DILocation(line: 0, scope: !831, inlinedAt: !874)
!874 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !870)
!875 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !874)
!876 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !870)
!877 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !870)
!878 = !DILocation(line: 323, column: 9, scope: !864)
!879 = !DILocation(line: 324, column: 19, scope: !880)
!880 = distinct !DILexicalBlock(scope: !161, file: !3, line: 324, column: 11)
!881 = !DILocation(line: 324, column: 11, scope: !161)
!882 = !DILocation(line: 325, column: 28, scope: !880)
!883 = !DILocation(line: 0, scope: !820, inlinedAt: !884)
!884 = distinct !DILocation(line: 325, column: 9, scope: !880)
!885 = !DILocation(line: 0, scope: !151, inlinedAt: !886)
!886 = distinct !DILocation(line: 194, column: 3, scope: !820, inlinedAt: !884)
!887 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !886)
!888 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !886)
!889 = !DILocation(line: 0, scope: !831, inlinedAt: !890)
!890 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !886)
!891 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !890)
!892 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !886)
!893 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !886)
!894 = !DILocation(line: 325, column: 9, scope: !880)
!895 = !DILocation(line: 326, column: 19, scope: !896)
!896 = distinct !DILexicalBlock(scope: !161, file: !3, line: 326, column: 11)
!897 = !DILocation(line: 326, column: 11, scope: !161)
!898 = !DILocation(line: 327, column: 28, scope: !896)
!899 = !DILocation(line: 0, scope: !820, inlinedAt: !900)
!900 = distinct !DILocation(line: 327, column: 9, scope: !896)
!901 = !DILocation(line: 0, scope: !151, inlinedAt: !902)
!902 = distinct !DILocation(line: 194, column: 3, scope: !820, inlinedAt: !900)
!903 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !902)
!904 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !902)
!905 = !DILocation(line: 0, scope: !831, inlinedAt: !906)
!906 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !902)
!907 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !906)
!908 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !902)
!909 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !902)
!910 = !DILocation(line: 327, column: 9, scope: !896)
!911 = !DILocation(line: 328, column: 5, scope: !162)
!912 = !DILocation(line: 328, column: 5, scope: !161)
!913 = !DILocation(line: 330, column: 15, scope: !177)
!914 = !DILocation(line: 330, column: 7, scope: !2)
!915 = !DILocation(line: 0, scope: !176)
!916 = !DILocation(line: 0, scope: !151, inlinedAt: !917)
!917 = distinct !DILocation(line: 361, column: 9, scope: !918)
!918 = distinct !DILexicalBlock(scope: !176, file: !3, line: 360, column: 11)
!919 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !917)
!920 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !917)
!921 = !DILocation(line: 0, scope: !831, inlinedAt: !922)
!922 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !917)
!923 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !922)
!924 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !917)
!925 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !917)
!926 = !DILocation(line: 361, column: 9, scope: !918)
!927 = !DILocation(line: 364, column: 15, scope: !180)
!928 = !DILocation(line: 364, column: 7, scope: !2)
!929 = !DILocation(line: 0, scope: !179)
!930 = !DILocation(line: 0, scope: !151, inlinedAt: !931)
!931 = distinct !DILocation(line: 386, column: 9, scope: !932)
!932 = distinct !DILexicalBlock(scope: !179, file: !3, line: 385, column: 11)
!933 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !931)
!934 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !931)
!935 = !DILocation(line: 0, scope: !831, inlinedAt: !936)
!936 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !931)
!937 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !936)
!938 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !931)
!939 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !931)
!940 = !DILocation(line: 386, column: 9, scope: !932)
!941 = !DILocation(line: 389, column: 15, scope: !942)
!942 = distinct !DILexicalBlock(scope: !2, file: !3, line: 389, column: 7)
!943 = !DILocation(line: 389, column: 7, scope: !2)
!944 = !DILocation(line: 0, scope: !151, inlinedAt: !945)
!945 = distinct !DILocation(line: 390, column: 5, scope: !942)
!946 = !DILocation(line: 173, column: 7, scope: !828, inlinedAt: !945)
!947 = !DILocation(line: 173, column: 7, scope: !151, inlinedAt: !945)
!948 = !DILocation(line: 0, scope: !831, inlinedAt: !949)
!949 = distinct !DILocation(line: 174, column: 5, scope: !828, inlinedAt: !945)
!950 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !949)
!951 = !DILocation(line: 175, column: 11, scope: !151, inlinedAt: !945)
!952 = !DILocation(line: 176, column: 3, scope: !151, inlinedAt: !945)
!953 = !DILocation(line: 390, column: 5, scope: !942)
!954 = !DILocation(line: 0, scope: !831, inlinedAt: !955)
!955 = distinct !DILocation(line: 392, column: 3, scope: !2)
!956 = !DILocation(line: 110, column: 10, scope: !831, inlinedAt: !955)
!957 = !DILocation(line: 394, column: 3, scope: !2)
!958 = !DISubprogram(name: "bindtextdomain", scope: !583, file: !583, line: 86, type: !959, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!959 = !DISubroutineType(types: !960)
!960 = !{!8, !38, !38}
!961 = !DISubprogram(name: "textdomain", scope: !583, file: !583, line: 82, type: !736, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!962 = !DISubprogram(name: "atexit", scope: !735, file: !735, line: 602, type: !963, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!963 = !DISubroutineType(types: !964)
!964 = !{!6, !241}
!965 = !DISubprogram(name: "getopt_long", scope: !135, file: !135, line: 66, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!966 = !DISubroutineType(types: !967)
!967 = !{!6, !6, !968, !38, !970, !140}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!971 = !DISubprogram(name: "uname", scope: !164, file: !164, line: 81, type: !972, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!972 = !DISubroutineType(types: !973)
!973 = !{!6, !974}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!975 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !199, file: !199, line: 50, type: !152, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !976)
!976 = !{!977}
!977 = !DILocalVariable(name: "file", arg: 1, scope: !975, file: !199, line: 50, type: !38)
!978 = !DILocation(line: 0, scope: !975)
!979 = !DILocation(line: 52, column: 13, scope: !975)
!980 = !DILocation(line: 53, column: 1, scope: !975)
!981 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !199, file: !199, line: 87, type: !982, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !984)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !56}
!984 = !{!985}
!985 = !DILocalVariable(name: "ignore", arg: 1, scope: !981, file: !199, line: 87, type: !56)
!986 = !DILocation(line: 0, scope: !981)
!987 = !DILocation(line: 89, column: 16, scope: !981)
!988 = !{!989, !989, i64 0}
!989 = !{!"_Bool", !490, i64 0}
!990 = !DILocation(line: 90, column: 1, scope: !981)
!991 = distinct !DISubprogram(name: "close_stdout", scope: !199, file: !199, line: 116, type: !242, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !198, retainedNodes: !992)
!992 = !{!993}
!993 = !DILocalVariable(name: "write_error", scope: !994, file: !199, line: 121, type: !38)
!994 = distinct !DILexicalBlock(scope: !995, file: !199, line: 120, column: 5)
!995 = distinct !DILexicalBlock(scope: !991, file: !199, line: 118, column: 7)
!996 = !DILocation(line: 118, column: 21, scope: !995)
!997 = !DILocation(line: 118, column: 7, scope: !995)
!998 = !DILocation(line: 118, column: 29, scope: !995)
!999 = !DILocation(line: 119, column: 7, scope: !995)
!1000 = !DILocation(line: 119, column: 12, scope: !995)
!1001 = !{i8 0, i8 2}
!1002 = !DILocation(line: 119, column: 25, scope: !995)
!1003 = !DILocation(line: 119, column: 28, scope: !995)
!1004 = !DILocation(line: 119, column: 34, scope: !995)
!1005 = !DILocation(line: 118, column: 7, scope: !991)
!1006 = !DILocation(line: 121, column: 33, scope: !994)
!1007 = !DILocation(line: 0, scope: !994)
!1008 = !DILocation(line: 122, column: 11, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !994, file: !199, line: 122, column: 11)
!1010 = !DILocation(line: 0, scope: !1009)
!1011 = !DILocation(line: 122, column: 11, scope: !994)
!1012 = !DILocation(line: 123, column: 9, scope: !1009)
!1013 = !DILocation(line: 126, column: 9, scope: !1009)
!1014 = !DILocation(line: 128, column: 14, scope: !994)
!1015 = !DILocation(line: 128, column: 7, scope: !994)
!1016 = !DILocation(line: 133, column: 42, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !991, file: !199, line: 133, column: 7)
!1018 = !DILocation(line: 133, column: 28, scope: !1017)
!1019 = !DILocation(line: 133, column: 50, scope: !1017)
!1020 = !DILocation(line: 133, column: 7, scope: !991)
!1021 = !DILocation(line: 134, column: 12, scope: !1017)
!1022 = !DILocation(line: 134, column: 5, scope: !1017)
!1023 = !DILocation(line: 135, column: 1, scope: !991)
!1024 = distinct !DISubprogram(name: "verror", scope: !206, file: !206, line: 251, type: !1025, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1027)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !6, !6, !38, !214}
!1027 = !{!1028, !1029, !1030, !1031}
!1028 = !DILocalVariable(name: "status", arg: 1, scope: !1024, file: !206, line: 251, type: !6)
!1029 = !DILocalVariable(name: "errnum", arg: 2, scope: !1024, file: !206, line: 251, type: !6)
!1030 = !DILocalVariable(name: "message", arg: 3, scope: !1024, file: !206, line: 251, type: !38)
!1031 = !DILocalVariable(name: "args", arg: 4, scope: !1024, file: !206, line: 251, type: !214)
!1032 = !DILocation(line: 0, scope: !1024)
!1033 = !DILocation(line: 251, column: 1, scope: !1024)
!1034 = !DILocation(line: 261, column: 3, scope: !1024)
!1035 = !DILocation(line: 265, column: 7, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1024, file: !206, line: 265, column: 7)
!1037 = !DILocation(line: 265, column: 7, scope: !1024)
!1038 = !DILocation(line: 266, column: 5, scope: !1036)
!1039 = !DILocation(line: 272, column: 7, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !206, line: 268, column: 5)
!1041 = !DILocation(line: 276, column: 3, scope: !1024)
!1042 = !{i64 0, i64 8, !488, i64 8, i64 8, !488, i64 16, i64 8, !488, i64 24, i64 4, !594, i64 28, i64 4, !594}
!1043 = !DILocation(line: 282, column: 1, scope: !1024)
!1044 = distinct !DISubprogram(name: "flush_stdout", scope: !206, file: !206, line: 163, type: !242, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1045)
!1045 = !{!1046}
!1046 = !DILocalVariable(name: "stdout_fd", scope: !1044, file: !206, line: 166, type: !6)
!1047 = !DILocation(line: 0, scope: !1044)
!1048 = !DILocalVariable(name: "fd", arg: 1, scope: !1049, file: !206, line: 145, type: !6)
!1049 = distinct !DISubprogram(name: "is_open", scope: !206, file: !206, line: 145, type: !833, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1050)
!1050 = !{!1048}
!1051 = !DILocation(line: 0, scope: !1049, inlinedAt: !1052)
!1052 = distinct !DILocation(line: 182, column: 25, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1044, file: !206, line: 182, column: 7)
!1054 = !DILocation(line: 157, column: 15, scope: !1049, inlinedAt: !1052)
!1055 = !DILocation(line: 182, column: 25, scope: !1053)
!1056 = !DILocation(line: 182, column: 7, scope: !1044)
!1057 = !DILocation(line: 184, column: 5, scope: !1053)
!1058 = !DILocation(line: 185, column: 1, scope: !1044)
!1059 = distinct !DISubprogram(name: "error_tail", scope: !206, file: !206, line: 219, type: !1025, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DILocalVariable(name: "status", arg: 1, scope: !1059, file: !206, line: 219, type: !6)
!1062 = !DILocalVariable(name: "errnum", arg: 2, scope: !1059, file: !206, line: 219, type: !6)
!1063 = !DILocalVariable(name: "message", arg: 3, scope: !1059, file: !206, line: 219, type: !38)
!1064 = !DILocalVariable(name: "args", arg: 4, scope: !1059, file: !206, line: 219, type: !214)
!1065 = !DILocation(line: 0, scope: !1059)
!1066 = !DILocation(line: 219, column: 1, scope: !1059)
!1067 = !DILocation(line: 229, column: 13, scope: !1059)
!1068 = !DILocation(line: 229, column: 3, scope: !1059)
!1069 = !DILocalVariable(name: "__stream", arg: 1, scope: !1070, file: !1071, line: 132, type: !1074)
!1070 = distinct !DISubprogram(name: "vfprintf", scope: !1071, file: !1071, line: 132, type: !1072, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1109)
!1071 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!6, !1074, !590, !216}
!1074 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !71, line: 7, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !73, line: 49, size: 1728, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1077, file: !73, line: 51, baseType: !6, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1077, file: !73, line: 54, baseType: !8, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1077, file: !73, line: 55, baseType: !8, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1077, file: !73, line: 56, baseType: !8, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1077, file: !73, line: 57, baseType: !8, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1077, file: !73, line: 58, baseType: !8, size: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1077, file: !73, line: 59, baseType: !8, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1077, file: !73, line: 60, baseType: !8, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1077, file: !73, line: 61, baseType: !8, size: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1077, file: !73, line: 64, baseType: !8, size: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1077, file: !73, line: 65, baseType: !8, size: 64, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1077, file: !73, line: 66, baseType: !8, size: 64, offset: 704)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1077, file: !73, line: 68, baseType: !88, size: 64, offset: 768)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1077, file: !73, line: 70, baseType: !1093, size: 64, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1077, file: !73, line: 72, baseType: !6, size: 32, offset: 896)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1077, file: !73, line: 73, baseType: !6, size: 32, offset: 928)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1077, file: !73, line: 74, baseType: !95, size: 64, offset: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1077, file: !73, line: 77, baseType: !34, size: 16, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1077, file: !73, line: 78, baseType: !100, size: 8, offset: 1040)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1077, file: !73, line: 79, baseType: !102, size: 8, offset: 1048)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1077, file: !73, line: 81, baseType: !106, size: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1077, file: !73, line: 89, baseType: !109, size: 64, offset: 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1077, file: !73, line: 91, baseType: !111, size: 64, offset: 1216)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1077, file: !73, line: 92, baseType: !114, size: 64, offset: 1280)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1077, file: !73, line: 93, baseType: !1093, size: 64, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1077, file: !73, line: 94, baseType: !41, size: 64, offset: 1408)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1077, file: !73, line: 95, baseType: !35, size: 64, offset: 1472)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1077, file: !73, line: 96, baseType: !6, size: 32, offset: 1536)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1077, file: !73, line: 98, baseType: !121, size: 160, offset: 1568)
!1109 = !{!1069, !1110, !1111}
!1110 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1070, file: !1071, line: 133, type: !590)
!1111 = !DILocalVariable(name: "__ap", arg: 3, scope: !1070, file: !1071, line: 133, type: !216)
!1112 = !DILocation(line: 0, scope: !1070, inlinedAt: !1113)
!1113 = distinct !DILocation(line: 229, column: 3, scope: !1059)
!1114 = !DILocation(line: 135, column: 10, scope: !1070, inlinedAt: !1113)
!1115 = !{!1116, !1118}
!1116 = distinct !{!1116, !1117, !"vfprintf.inline: argument 0"}
!1117 = distinct !{!1117, !"vfprintf.inline"}
!1118 = distinct !{!1118, !1117, !"vfprintf.inline: argument 1"}
!1119 = !DILocation(line: 232, column: 3, scope: !1059)
!1120 = !DILocation(line: 233, column: 7, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1059, file: !206, line: 233, column: 7)
!1122 = !DILocation(line: 233, column: 7, scope: !1059)
!1123 = !DILocalVariable(name: "errnum", arg: 1, scope: !1124, file: !206, line: 188, type: !6)
!1124 = distinct !DISubprogram(name: "print_errno_message", scope: !206, file: !206, line: 188, type: !478, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1125)
!1125 = !{!1123, !1126, !1127}
!1126 = !DILocalVariable(name: "s", scope: !1124, file: !206, line: 190, type: !38)
!1127 = !DILocalVariable(name: "errbuf", scope: !1124, file: !206, line: 193, type: !1128)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8192, elements: !1129)
!1129 = !{!1130}
!1130 = !DISubrange(count: 1024)
!1131 = !DILocation(line: 0, scope: !1124, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 234, column: 5, scope: !1121)
!1133 = !DILocation(line: 193, column: 3, scope: !1124, inlinedAt: !1132)
!1134 = !DILocation(line: 193, column: 8, scope: !1124, inlinedAt: !1132)
!1135 = !DILocation(line: 195, column: 7, scope: !1124, inlinedAt: !1132)
!1136 = !DILocation(line: 207, column: 9, scope: !1137, inlinedAt: !1132)
!1137 = distinct !DILexicalBlock(scope: !1124, file: !206, line: 207, column: 7)
!1138 = !DILocation(line: 207, column: 7, scope: !1124, inlinedAt: !1132)
!1139 = !DILocation(line: 208, column: 9, scope: !1137, inlinedAt: !1132)
!1140 = !DILocation(line: 208, column: 5, scope: !1137, inlinedAt: !1132)
!1141 = !DILocation(line: 214, column: 3, scope: !1124, inlinedAt: !1132)
!1142 = !DILocation(line: 216, column: 1, scope: !1124, inlinedAt: !1132)
!1143 = !DILocation(line: 234, column: 5, scope: !1121)
!1144 = !DILocation(line: 238, column: 3, scope: !1059)
!1145 = !DILocalVariable(name: "__c", arg: 1, scope: !1146, file: !832, line: 101, type: !6)
!1146 = distinct !DISubprogram(name: "putc_unlocked", scope: !832, file: !832, line: 101, type: !1147, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1149)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!6, !6, !1075}
!1149 = !{!1145, !1150}
!1150 = !DILocalVariable(name: "__stream", arg: 2, scope: !1146, file: !832, line: 101, type: !1075)
!1151 = !DILocation(line: 0, scope: !1146, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 238, column: 3, scope: !1059)
!1153 = !DILocation(line: 103, column: 10, scope: !1146, inlinedAt: !1152)
!1154 = !DILocation(line: 240, column: 3, scope: !1059)
!1155 = !DILocation(line: 241, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1059, file: !206, line: 241, column: 7)
!1157 = !DILocation(line: 241, column: 7, scope: !1059)
!1158 = !DILocation(line: 242, column: 5, scope: !1156)
!1159 = !DILocation(line: 243, column: 1, scope: !1059)
!1160 = !DISubprogram(name: "strerror_r", scope: !1161, file: !1161, line: 444, type: !1162, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!1161 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!8, !6, !8, !35}
!1164 = !DISubprogram(name: "fflush_unlocked", scope: !215, file: !215, line: 239, type: !1165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!6, !1075}
!1167 = !DISubprogram(name: "fcntl", scope: !1168, file: !1168, line: 149, type: !1169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !586)
!1168 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!6, !6, !6, null}
!1171 = distinct !DISubprogram(name: "error", scope: !206, file: !206, line: 285, type: !1172, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !1174)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{null, !6, !6, !38, null}
!1174 = !{!1175, !1176, !1177, !1178}
!1175 = !DILocalVariable(name: "status", arg: 1, scope: !1171, file: !206, line: 285, type: !6)
!1176 = !DILocalVariable(name: "errnum", arg: 2, scope: !1171, file: !206, line: 285, type: !6)
!1177 = !DILocalVariable(name: "message", arg: 3, scope: !1171, file: !206, line: 285, type: !38)
!1178 = !DILocalVariable(name: "ap", scope: !1171, file: !206, line: 287, type: !214)
!1179 = !DILocation(line: 0, scope: !1171)
!1180 = !DILocation(line: 287, column: 3, scope: !1171)
!1181 = !DILocation(line: 287, column: 11, scope: !1171)
!1182 = !DILocation(line: 288, column: 3, scope: !1171)
!1183 = !DILocation(line: 289, column: 3, scope: !1171)
!1184 = !DILocation(line: 290, column: 3, scope: !1171)
!1185 = !DILocation(line: 291, column: 1, scope: !1171)
!1186 = !DILocation(line: 0, scope: !211)
!1187 = !DILocation(line: 298, column: 1, scope: !211)
!1188 = !DILocation(line: 302, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !211, file: !206, line: 302, column: 7)
!1190 = !DILocation(line: 302, column: 7, scope: !211)
!1191 = !DILocation(line: 307, column: 11, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !206, line: 307, column: 11)
!1193 = distinct !DILexicalBlock(scope: !1189, file: !206, line: 303, column: 5)
!1194 = !DILocation(line: 307, column: 27, scope: !1192)
!1195 = !DILocation(line: 308, column: 11, scope: !1192)
!1196 = !DILocation(line: 308, column: 28, scope: !1192)
!1197 = !DILocation(line: 308, column: 25, scope: !1192)
!1198 = !DILocation(line: 309, column: 15, scope: !1192)
!1199 = !DILocation(line: 309, column: 33, scope: !1192)
!1200 = !DILocation(line: 310, column: 19, scope: !1192)
!1201 = !DILocation(line: 311, column: 22, scope: !1192)
!1202 = !DILocation(line: 311, column: 56, scope: !1192)
!1203 = !DILocation(line: 307, column: 11, scope: !1193)
!1204 = !DILocation(line: 316, column: 21, scope: !1193)
!1205 = !DILocation(line: 317, column: 23, scope: !1193)
!1206 = !DILocation(line: 318, column: 5, scope: !1193)
!1207 = !DILocation(line: 327, column: 3, scope: !211)
!1208 = !DILocation(line: 331, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !211, file: !206, line: 331, column: 7)
!1210 = !DILocation(line: 331, column: 7, scope: !211)
!1211 = !DILocation(line: 332, column: 5, scope: !1209)
!1212 = !DILocation(line: 338, column: 7, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1209, file: !206, line: 334, column: 5)
