; ModuleID = 'src/unexpand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.mbbuf_t = type { i8*, %struct._IO_FILE*, i64, i64, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert blanks in each FILE to tabs, writing to standard output.\0A\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"unexpand\00", align 1
@.str.4 = private unnamed_addr constant [73 x i8] c"  -a, --all\0A         convert all blanks, instead of just initial blanks\0A\00", align 1

!3 = !DIFile(filename: "src/unexpand.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2f40f86ff2e1751a61c8225ac9d0fd19")
!4 = !{!5, !21, !25, !28}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256)
!10 = !DIEnumerator(name: "_ISlower", value: 512)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!14 = !DIEnumerator(name: "_ISspace", value: 8192)
!15 = !DIEnumerator(name: "_ISprint", value: 16384)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768)
!17 = !DIEnumerator(name: "_ISblank", value: 1)
!18 = !DIEnumerator(name: "_IScntrl", value: 2)
!19 = !DIEnumerator(name: "_ISpunct", value: 4)
!20 = !DIEnumerator(name: "_ISalnum", value: 8)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 127, baseType: !7, size: 32, elements: !23)
!22 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!23 = !{!24}
!24 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 131, baseType: !7, size: 32, elements: !26)
!26 = !{!27}
!27 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !22, line: 130, baseType: !7, size: 32, elements: !29)
!29 = !{!30}
!30 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!31 = !{!32, !34, !35, !36, !37, !38, !39, !40, !42, !44}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!36 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!37 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !41, line: 46, baseType: !37)
!41 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !{!46, !0, !131}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !48, file: !49, line: 575, type: !38, isLocal: true, isDefinition: true)
!48 = distinct !DISubprogram(name: "oputs_", scope: !49, file: !49, line: 573, type: !50, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !52)
!49 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!50 = !DISubroutineType(types: !51)
!51 = !{null, !42, !42}
!52 = !{!53, !54, !55, !58, !59, !60, !61, !65, !66, !67, !68, !70, !125, !126, !127, !129, !130}
!53 = !DILocalVariable(name: "program", arg: 1, scope: !48, file: !49, line: 573, type: !42)
!54 = !DILocalVariable(name: "option", arg: 2, scope: !48, file: !49, line: 573, type: !42)
!55 = !DILocalVariable(name: "term", scope: !56, file: !49, line: 585, type: !42)
!56 = distinct !DILexicalBlock(scope: !57, file: !49, line: 582, column: 5)
!57 = distinct !DILexicalBlock(scope: !48, file: !49, line: 581, column: 7)
!58 = !DILocalVariable(name: "double_space", scope: !48, file: !49, line: 594, type: !35)
!59 = !DILocalVariable(name: "first_word", scope: !48, file: !49, line: 595, type: !42)
!60 = !DILocalVariable(name: "option_text", scope: !48, file: !49, line: 596, type: !42)
!61 = !DILocalVariable(name: "s", scope: !62, file: !49, line: 608, type: !42)
!62 = distinct !DILexicalBlock(scope: !63, file: !49, line: 605, column: 5)
!63 = distinct !DILexicalBlock(scope: !64, file: !49, line: 604, column: 12)
!64 = distinct !DILexicalBlock(scope: !48, file: !49, line: 597, column: 7)
!65 = !DILocalVariable(name: "spaces", scope: !62, file: !49, line: 609, type: !40)
!66 = !DILocalVariable(name: "anchor_len", scope: !48, file: !49, line: 620, type: !40)
!67 = !DILocalVariable(name: "desc_text", scope: !48, file: !49, line: 625, type: !42)
!68 = !DILocalVariable(name: "__ptr", scope: !69, file: !49, line: 644, type: !42)
!69 = distinct !DILexicalBlock(scope: !48, file: !49, line: 644, column: 3)
!70 = !DILocalVariable(name: "__stream", scope: !69, file: !49, line: 644, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 7, baseType: !74)
!73 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !94, !95, !96, !99, !100, !102, !106, !109, !111, !114, !117, !118, !119, !120, !121}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !38, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !32, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !32, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !32, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !32, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !32, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !32, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !32, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !32, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !32, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !32, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !32, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !93, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !38, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !38, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !97, size: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !36)
!98 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !39, size: 16, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!101 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 1)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !36)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !93, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !34, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !40, size: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !38, size: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !122, size: 160, offset: 1568)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 20)
!125 = !DILocalVariable(name: "__cnt", scope: !69, file: !49, line: 644, type: !40)
!126 = !DILocalVariable(name: "url_program", scope: !48, file: !49, line: 648, type: !42)
!127 = !DILocalVariable(name: "__ptr", scope: !128, file: !49, line: 686, type: !42)
!128 = distinct !DILexicalBlock(scope: !48, file: !49, line: 686, column: 3)
!129 = !DILocalVariable(name: "__stream", scope: !128, file: !49, line: 686, type: !71)
!130 = !DILocalVariable(name: "__cnt", scope: !128, file: !49, line: 686, type: !40)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "line_in", scope: !133, file: !3, line: 127, type: !197, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "unexpand", scope: !3, file: !3, line: 114, type: !134, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !136)
!134 = !DISubroutineType(types: !135)
!135 = !{null}
!136 = !{!137, !138, !139, !152, !164, !165, !171, !172, !173, !174, !175, !176, !180, !183, !186, !191, !192, !193, !195, !196}
!137 = !DILocalVariable(name: "fp", scope: !133, file: !3, line: 117, type: !71)
!138 = !DILocalVariable(name: "pending_blank", scope: !133, file: !3, line: 122, type: !32)
!139 = !DILocalVariable(name: "mbbuf", scope: !133, file: !3, line: 128, type: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !141, line: 50, baseType: !142)
!141 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 43, size: 320, elements: !143)
!143 = !{!144, !145, !146, !150, !151}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !142, file: !141, line: 45, baseType: !32, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !142, file: !141, line: 46, baseType: !71, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !142, file: !141, line: 47, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !148, line: 130, baseType: !149)
!148 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !41, line: 35, baseType: !36)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !142, file: !141, line: 48, baseType: !147, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !142, file: !141, line: 49, baseType: !147, size: 64, offset: 256)
!152 = !DILocalVariable(name: "g", scope: !153, file: !3, line: 139, type: !154)
!153 = distinct !DILexicalBlock(scope: !133, file: !3, line: 137, column: 5)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !22, line: 143, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 138, size: 64, elements: !156)
!156 = !{!157, !162, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !155, file: !22, line: 140, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !159, line: 37, baseType: !160)
!159 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !98, line: 57, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 42, baseType: !7)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !155, file: !22, line: 141, baseType: !44, size: 8, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !155, file: !22, line: 142, baseType: !44, size: 8, offset: 40)
!164 = !DILocalVariable(name: "convert", scope: !153, file: !3, line: 142, type: !35)
!165 = !DILocalVariable(name: "column", scope: !153, file: !3, line: 149, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !167, line: 20, baseType: !168)
!167 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !169, line: 101, baseType: !170)
!169 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !98, line: 72, baseType: !36)
!171 = !DILocalVariable(name: "next_tab_column", scope: !153, file: !3, line: 152, type: !166)
!172 = !DILocalVariable(name: "tab_index", scope: !153, file: !3, line: 155, type: !147)
!173 = !DILocalVariable(name: "one_blank_before_tab_stop", scope: !153, file: !3, line: 158, type: !35)
!174 = !DILocalVariable(name: "prev_blank", scope: !153, file: !3, line: 163, type: !35)
!175 = !DILocalVariable(name: "pending", scope: !153, file: !3, line: 166, type: !147)
!176 = !DILocalVariable(name: "blank", scope: !177, file: !3, line: 179, type: !35)
!177 = distinct !DILexicalBlock(scope: !178, file: !3, line: 178, column: 13)
!178 = distinct !DILexicalBlock(scope: !179, file: !3, line: 177, column: 15)
!179 = distinct !DILexicalBlock(scope: !153, file: !3, line: 172, column: 9)
!180 = !DILocalVariable(name: "last_tab", scope: !181, file: !3, line: 183, type: !35)
!181 = distinct !DILexicalBlock(scope: !182, file: !3, line: 182, column: 17)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 181, column: 19)
!183 = !DILocalVariable(name: "width", scope: !184, file: !3, line: 239, type: !38)
!184 = distinct !DILexicalBlock(scope: !185, file: !3, line: 238, column: 17)
!185 = distinct !DILexicalBlock(scope: !182, file: !3, line: 229, column: 24)
!186 = !DILocalVariable(name: "__ptr", scope: !187, file: !3, line: 248, type: !42)
!187 = distinct !DILexicalBlock(scope: !188, file: !3, line: 248, column: 23)
!188 = distinct !DILexicalBlock(scope: !189, file: !3, line: 248, column: 23)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 245, column: 17)
!190 = distinct !DILexicalBlock(scope: !177, file: !3, line: 244, column: 19)
!191 = !DILocalVariable(name: "__stream", scope: !187, file: !3, line: 248, type: !71)
!192 = !DILocalVariable(name: "__cnt", scope: !187, file: !3, line: 248, type: !40)
!193 = !DILocalVariable(name: "__ptr", scope: !194, file: !3, line: 264, type: !42)
!194 = distinct !DILexicalBlock(scope: !179, file: !3, line: 264, column: 11)
!195 = !DILocalVariable(name: "__stream", scope: !194, file: !3, line: 264, type: !71)
!196 = !DILocalVariable(name: "__cnt", scope: !194, file: !3, line: 264, type: !40)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2097152, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 262144)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1536, elements: !210)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !203, line: 50, size: 256, elements: !204)
!203 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 52, baseType: !42, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !202, file: !203, line: 55, baseType: !38, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !203, line: 56, baseType: !208, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !202, file: !203, line: 57, baseType: !38, size: 32, offset: 192)
!210 = !{!211}
!211 = !DISubrange(count: 6)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !214, file: !215, line: 30, type: !35, isLocal: false, isDefinition: true)
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !216, retainedTypes: !240, globals: !241, splitDebugInlining: false, nameTableKind: None)
!215 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!216 = !{!5, !217, !231}
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !218, line: 42, baseType: !7, size: 32, elements: !219)
!218 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!220 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!221 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!222 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!223 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!224 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!225 = !DIEnumerator(name: "c_quoting_style", value: 5)
!226 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!227 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!228 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!229 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!230 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 44, baseType: !7, size: 32, elements: !233)
!232 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!233 = !{!234, !235, !236, !237, !238, !239}
!234 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!235 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!236 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!237 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!238 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!239 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!240 = !{!38, !39, !35, !36, !37, !34, !40, !42, !44}
!241 = !{!212, !242, !244, !289, !291, !293, !296, !298, !300, !302, !304, !306, !311, !314}
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "exit_status", scope: !214, file: !215, line: 69, type: !38, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "prev_file", scope: !246, file: !215, line: 351, type: !32, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "next_file", scope: !215, file: !215, line: 349, type: !247, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !214, retainedNodes: !283)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 7, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !251, file: !75, line: 51, baseType: !38, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !251, file: !75, line: 54, baseType: !32, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !251, file: !75, line: 55, baseType: !32, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !251, file: !75, line: 56, baseType: !32, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !251, file: !75, line: 57, baseType: !32, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !251, file: !75, line: 58, baseType: !32, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !251, file: !75, line: 59, baseType: !32, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !251, file: !75, line: 60, baseType: !32, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !251, file: !75, line: 61, baseType: !32, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !251, file: !75, line: 64, baseType: !32, size: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !251, file: !75, line: 65, baseType: !32, size: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !251, file: !75, line: 66, baseType: !32, size: 64, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !251, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !251, file: !75, line: 70, baseType: !267, size: 64, offset: 832)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !251, file: !75, line: 72, baseType: !38, size: 32, offset: 896)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !251, file: !75, line: 73, baseType: !38, size: 32, offset: 928)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !251, file: !75, line: 74, baseType: !97, size: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !251, file: !75, line: 77, baseType: !39, size: 16, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !251, file: !75, line: 78, baseType: !101, size: 8, offset: 1040)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !251, file: !75, line: 79, baseType: !103, size: 8, offset: 1048)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !251, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !251, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !251, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !251, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !251, file: !75, line: 93, baseType: !267, size: 64, offset: 1344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !251, file: !75, line: 94, baseType: !34, size: 64, offset: 1408)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !251, file: !75, line: 95, baseType: !40, size: 64, offset: 1472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !251, file: !75, line: 96, baseType: !38, size: 32, offset: 1536)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !251, file: !75, line: 98, baseType: !122, size: 160, offset: 1568)
!283 = !{!284, !285, !286}
!284 = !DILocalVariable(name: "fp", arg: 1, scope: !246, file: !215, line: 349, type: !249)
!285 = !DILocalVariable(name: "file", scope: !246, file: !215, line: 352, type: !32)
!286 = !DILocalVariable(name: "err", scope: !287, file: !215, line: 356, type: !38)
!287 = distinct !DILexicalBlock(scope: !288, file: !215, line: 355, column: 5)
!288 = distinct !DILexicalBlock(scope: !246, file: !215, line: 354, column: 7)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "max_column_width", scope: !214, file: !215, line: 42, type: !147, isLocal: false, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !214, file: !215, line: 54, type: !147, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "tab_list", scope: !214, file: !215, line: 47, type: !295, isLocal: true, isDefinition: true)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !214, file: !215, line: 50, type: !147, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "extend_size", scope: !214, file: !215, line: 36, type: !166, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "increment_size", scope: !214, file: !215, line: 39, type: !166, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "tab_size", scope: !214, file: !215, line: 33, type: !166, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !214, file: !215, line: 66, type: !35, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !214, file: !215, line: 60, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 128, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 2)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "file_list", scope: !214, file: !215, line: 57, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !316, file: !49, line: 575, type: !38, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "oputs_", scope: !49, file: !49, line: 573, type: !50, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !214, retainedNodes: !317)
!317 = !{!318, !319, !320, !323, !324, !325, !326, !330, !331, !332, !333, !335, !336, !337, !338, !340, !341}
!318 = !DILocalVariable(name: "program", arg: 1, scope: !316, file: !49, line: 573, type: !42)
!319 = !DILocalVariable(name: "option", arg: 2, scope: !316, file: !49, line: 573, type: !42)
!320 = !DILocalVariable(name: "term", scope: !321, file: !49, line: 585, type: !42)
!321 = distinct !DILexicalBlock(scope: !322, file: !49, line: 582, column: 5)
!322 = distinct !DILexicalBlock(scope: !316, file: !49, line: 581, column: 7)
!323 = !DILocalVariable(name: "double_space", scope: !316, file: !49, line: 594, type: !35)
!324 = !DILocalVariable(name: "first_word", scope: !316, file: !49, line: 595, type: !42)
!325 = !DILocalVariable(name: "option_text", scope: !316, file: !49, line: 596, type: !42)
!326 = !DILocalVariable(name: "s", scope: !327, file: !49, line: 608, type: !42)
!327 = distinct !DILexicalBlock(scope: !328, file: !49, line: 605, column: 5)
!328 = distinct !DILexicalBlock(scope: !329, file: !49, line: 604, column: 12)
!329 = distinct !DILexicalBlock(scope: !316, file: !49, line: 597, column: 7)
!330 = !DILocalVariable(name: "spaces", scope: !327, file: !49, line: 609, type: !40)
!331 = !DILocalVariable(name: "anchor_len", scope: !316, file: !49, line: 620, type: !40)
!332 = !DILocalVariable(name: "desc_text", scope: !316, file: !49, line: 625, type: !42)
!333 = !DILocalVariable(name: "__ptr", scope: !334, file: !49, line: 644, type: !42)
!334 = distinct !DILexicalBlock(scope: !316, file: !49, line: 644, column: 3)
!335 = !DILocalVariable(name: "__stream", scope: !334, file: !49, line: 644, type: !249)
!336 = !DILocalVariable(name: "__cnt", scope: !334, file: !49, line: 644, type: !40)
!337 = !DILocalVariable(name: "url_program", scope: !316, file: !49, line: 648, type: !42)
!338 = !DILocalVariable(name: "__ptr", scope: !339, file: !49, line: 686, type: !42)
!339 = distinct !DILexicalBlock(scope: !316, file: !49, line: 686, column: 3)
!340 = !DILocalVariable(name: "__stream", scope: !339, file: !49, line: 686, type: !249)
!341 = !DILocalVariable(name: "__cnt", scope: !339, file: !49, line: 686, type: !40)
!342 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "Version", scope: !345, file: !346, line: 3, type: !42, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !347, splitDebugInlining: false, nameTableKind: None)
!346 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!347 = !{!343}
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "file_name", scope: !350, file: !351, line: 45, type: !42, isLocal: true, isDefinition: true)
!350 = distinct !DICompileUnit(language: DW_LANG_C99, file: !351, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !352, splitDebugInlining: false, nameTableKind: None)
!351 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!352 = !{!348, !353}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !350, file: !351, line: 55, type: !35, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !357, file: !358, line: 66, type: !393, isLocal: false, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!359 = !{!34, !44}
!360 = !{!361, !387, !355, !389, !391}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "old_file_name", scope: !363, file: !358, line: 304, type: !42, isLocal: true, isDefinition: true)
!363 = distinct !DISubprogram(name: "verror_at_line", scope: !358, file: !358, line: 298, type: !364, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !357, retainedNodes: !380)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !38, !38, !42, !7, !42, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !367, line: 52, baseType: !368)
!367 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !369, line: 32, baseType: !370)
!369 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !371, baseType: !372)
!371 = !DIFile(filename: "lib/error.c", directory: "/src")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !373, size: 256, elements: !374)
!373 = !DINamespace(name: "std", scope: null)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !372, file: !371, baseType: !34, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !372, file: !371, baseType: !34, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !372, file: !371, baseType: !34, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !372, file: !371, baseType: !38, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !372, file: !371, baseType: !38, size: 32, offset: 224)
!380 = !{!381, !382, !383, !384, !385, !386}
!381 = !DILocalVariable(name: "status", arg: 1, scope: !363, file: !358, line: 298, type: !38)
!382 = !DILocalVariable(name: "errnum", arg: 2, scope: !363, file: !358, line: 298, type: !38)
!383 = !DILocalVariable(name: "file_name", arg: 3, scope: !363, file: !358, line: 298, type: !42)
!384 = !DILocalVariable(name: "line_number", arg: 4, scope: !363, file: !358, line: 298, type: !7)
!385 = !DILocalVariable(name: "message", arg: 5, scope: !363, file: !358, line: 298, type: !42)
!386 = !DILocalVariable(name: "args", arg: 6, scope: !363, file: !358, line: 298, type: !366)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "old_line_number", scope: !363, file: !358, line: 305, type: !7, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "error_message_count", scope: !357, file: !358, line: 69, type: !7, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !357, file: !358, line: 295, type: !38, isLocal: false, isDefinition: true)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "program_name", scope: !396, file: !397, line: 31, type: !42, isLocal: false, isDefinition: true)
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !398, globals: !399, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!398 = !{!32}
!399 = !{!394}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "utf07FF", scope: !402, file: !403, line: 46, type: !429, isLocal: true, isDefinition: true)
!402 = distinct !DISubprogram(name: "proper_name_lite", scope: !403, file: !403, line: 38, type: !404, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !406, retainedNodes: !408)
!403 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!404 = !DISubroutineType(types: !405)
!405 = !{!42, !42, !42}
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !407, splitDebugInlining: false, nameTableKind: None)
!407 = !{!400}
!408 = !{!409, !410, !411, !412, !413}
!409 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !402, file: !403, line: 38, type: !42)
!410 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !402, file: !403, line: 38, type: !42)
!411 = !DILocalVariable(name: "translation", scope: !402, file: !403, line: 40, type: !42)
!412 = !DILocalVariable(name: "w", scope: !402, file: !403, line: 47, type: !158)
!413 = !DILocalVariable(name: "mbs", scope: !402, file: !403, line: 48, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !415, line: 6, baseType: !416)
!415 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !417, line: 21, baseType: !418)
!417 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 13, size: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !418, file: !417, line: 15, baseType: !38, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !418, file: !417, line: 20, baseType: !422, size: 32, offset: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !418, file: !417, line: 16, size: 32, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !422, file: !417, line: 18, baseType: !7, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !422, file: !417, line: 19, baseType: !426, size: 32)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 4)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 16, elements: !309)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !432, file: !433, line: 76, type: !501, isLocal: false, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !440, globals: !441, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!434 = !{!217, !435, !5}
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !218, line: 254, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!438 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!439 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!440 = !{!38, !39, !40}
!441 = !{!430, !442, !448, !460, !462, !467, !490, !497, !499}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !432, file: !433, line: 92, type: !444, isLocal: false, isDefinition: true)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 320, elements: !446)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!446 = !{!447}
!447 = !DISubrange(count: 10)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !432, file: !433, line: 1040, type: !450, isLocal: false, isDefinition: true)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !433, line: 56, size: 448, elements: !451)
!451 = !{!452, !453, !454, !458, !459}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !450, file: !433, line: 59, baseType: !217, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !433, line: 62, baseType: !38, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !450, file: !433, line: 66, baseType: !455, size: 256, offset: 64)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !450, file: !433, line: 69, baseType: !42, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !450, file: !433, line: 72, baseType: !42, size: 64, offset: 384)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !432, file: !433, line: 107, type: !450, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "slot0", scope: !432, file: !433, line: 831, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 2048, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 256)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "quote", scope: !469, file: !433, line: 228, type: !488, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "gettext_quote", scope: !433, file: !433, line: 197, type: !470, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !432, retainedNodes: !472)
!470 = !DISubroutineType(types: !471)
!471 = !{!42, !42, !217}
!472 = !{!473, !474, !475, !476, !477}
!473 = !DILocalVariable(name: "msgid", arg: 1, scope: !469, file: !433, line: 197, type: !42)
!474 = !DILocalVariable(name: "s", arg: 2, scope: !469, file: !433, line: 197, type: !217)
!475 = !DILocalVariable(name: "translation", scope: !469, file: !433, line: 199, type: !42)
!476 = !DILocalVariable(name: "w", scope: !469, file: !433, line: 229, type: !158)
!477 = !DILocalVariable(name: "mbs", scope: !469, file: !433, line: 230, type: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !415, line: 6, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !417, line: 21, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 13, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !480, file: !417, line: 15, baseType: !38, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !480, file: !417, line: 20, baseType: !484, size: 32, offset: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !417, line: 16, size: 32, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !484, file: !417, line: 18, baseType: !7, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !484, file: !417, line: 19, baseType: !426, size: 32)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 64, elements: !489)
!489 = !{!310, !428}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "slotvec", scope: !432, file: !433, line: 834, type: !492, isLocal: true, isDefinition: true)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !433, line: 823, size: 128, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !493, file: !433, line: 825, baseType: !40, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !493, file: !433, line: 826, baseType: !32, size: 64, offset: 64)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "nslots", scope: !432, file: !433, line: 832, type: !38, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "slotvec0", scope: !432, file: !433, line: 833, type: !493, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 704, elements: !503)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!503 = !{!504}
!504 = !DISubrange(count: 11)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !507, file: !508, line: 26, type: !510, isLocal: false, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !509, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!509 = !{!505}
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 376, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 47)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "exit_failure", scope: !515, file: !516, line: 24, type: !518, isLocal: false, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !517, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!517 = !{!513}
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !38)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "internal_state", scope: !521, file: !522, line: 97, type: !525, isLocal: true, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !523, globals: !524, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!523 = !{!34, !40, !44}
!524 = !{!519}
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !415, line: 6, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !417, line: 21, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 13, size: 64, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !527, file: !417, line: 15, baseType: !38, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !527, file: !417, line: 20, baseType: !531, size: 32, offset: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !527, file: !417, line: 16, size: 32, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !531, file: !417, line: 18, baseType: !7, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !531, file: !417, line: 19, baseType: !426, size: 32)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !537, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!537 = !{!231}
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!542 = !{!34}
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !551, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!551 = !{!552}
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !550, line: 40, baseType: !7, size: 32, elements: !553)
!553 = !{!554}
!554 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !557, retainedTypes: !585, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!557 = !{!558, !570}
!558 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !559, file: !556, line: 188, baseType: !7, size: 32, elements: !568)
!559 = distinct !DISubprogram(name: "x2nrealloc", scope: !556, file: !556, line: 176, type: !560, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !555, retainedNodes: !563)
!560 = !DISubroutineType(types: !561)
!561 = !{!34, !34, !562, !40}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!563 = !{!564, !565, !566, !567}
!564 = !DILocalVariable(name: "p", arg: 1, scope: !559, file: !556, line: 176, type: !34)
!565 = !DILocalVariable(name: "pn", arg: 2, scope: !559, file: !556, line: 176, type: !562)
!566 = !DILocalVariable(name: "s", arg: 3, scope: !559, file: !556, line: 176, type: !40)
!567 = !DILocalVariable(name: "n", scope: !559, file: !556, line: 178, type: !40)
!568 = !{!569}
!569 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !571, file: !556, line: 228, baseType: !7, size: 32, elements: !568)
!571 = distinct !DISubprogram(name: "xpalloc", scope: !556, file: !556, line: 223, type: !572, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !555, retainedNodes: !575)
!572 = !DISubroutineType(types: !573)
!573 = !{!34, !34, !574, !147, !149, !147}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584}
!576 = !DILocalVariable(name: "pa", arg: 1, scope: !571, file: !556, line: 223, type: !34)
!577 = !DILocalVariable(name: "pn", arg: 2, scope: !571, file: !556, line: 223, type: !574)
!578 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !571, file: !556, line: 223, type: !147)
!579 = !DILocalVariable(name: "n_max", arg: 4, scope: !571, file: !556, line: 223, type: !149)
!580 = !DILocalVariable(name: "s", arg: 5, scope: !571, file: !556, line: 223, type: !147)
!581 = !DILocalVariable(name: "n0", scope: !571, file: !556, line: 230, type: !147)
!582 = !DILocalVariable(name: "n", scope: !571, file: !556, line: 237, type: !147)
!583 = !DILocalVariable(name: "nbytes", scope: !571, file: !556, line: 248, type: !147)
!584 = !DILocalVariable(name: "adjusted_nbytes", scope: !571, file: !556, line: 252, type: !147)
!585 = !{!32, !34, !35, !36, !37}
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !589, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!591 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!592 = distinct !DICompileUnit(language: DW_LANG_C99, file: !593, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !594, splitDebugInlining: false, nameTableKind: None)
!593 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!594 = !{!35, !37, !34}
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!597 = distinct !DICompileUnit(language: DW_LANG_C99, file: !598, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!598 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!599 = distinct !DICompileUnit(language: DW_LANG_C99, file: !600, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !542, splitDebugInlining: false, nameTableKind: None)
!600 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!601 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!602 = !{i32 7, !"Dwarf Version", i32 5}
!603 = !{i32 2, !"Debug Info Version", i32 3}
!604 = !{i32 1, !"wchar_size", i32 4}
!605 = !{i32 1, !"branch-target-enforcement", i32 0}
!606 = !{i32 1, !"sign-return-address", i32 0}
!607 = !{i32 1, !"sign-return-address-all", i32 0}
!608 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!609 = !{i32 7, !"PIC Level", i32 2}
!610 = !{i32 7, !"PIE Level", i32 2}
!611 = !{i32 7, !"uwtable", i32 1}
!612 = !{i32 7, !"frame-pointer", i32 1}
!613 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 73, type: !614, scopeLine: 74, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !38}
!616 = !{!617}
!617 = !DILocalVariable(name: "status", arg: 1, scope: !613, file: !3, line: 73, type: !38)
!618 = !DILocation(line: 0, scope: !613)
!619 = !DILocation(line: 75, column: 14, scope: !620)
!620 = distinct !DILexicalBlock(scope: !613, file: !3, line: 75, column: 7)
!621 = !DILocation(line: 75, column: 7, scope: !613)
!622 = !DILocation(line: 76, column: 5, scope: !623)
!623 = distinct !DILexicalBlock(scope: !620, file: !3, line: 76, column: 5)
!624 = !{!625, !625, i64 0}
!625 = !{!"any pointer", !626, i64 0}
!626 = !{!"omnipotent char", !627, i64 0}
!627 = !{!"Simple C/C++ TBAA"}
!628 = !DILocation(line: 79, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !620, file: !3, line: 78, column: 5)
!630 = !DILocation(line: 83, column: 7, scope: !629)
!631 = !DILocation(line: 729, column: 3, scope: !632, inlinedAt: !634)
!632 = distinct !DISubprogram(name: "emit_stdin_note", scope: !49, file: !49, line: 727, type: !134, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !633)
!633 = !{}
!634 = distinct !DILocation(line: 87, column: 7, scope: !629)
!635 = !DILocation(line: 736, column: 3, scope: !636, inlinedAt: !637)
!636 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !49, file: !49, line: 734, type: !134, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !633)
!637 = distinct !DILocation(line: 88, column: 7, scope: !629)
!638 = !DILocation(line: 90, column: 7, scope: !629)
!639 = !DILocation(line: 94, column: 7, scope: !629)
!640 = !DILocation(line: 98, column: 7, scope: !629)
!641 = !DILocation(line: 102, column: 7, scope: !629)
!642 = !DILocation(line: 103, column: 7, scope: !629)
!643 = !DILocation(line: 104, column: 7, scope: !629)
!644 = !DILocalVariable(name: "program", arg: 1, scope: !645, file: !49, line: 836, type: !42)
!645 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !49, file: !49, line: 836, type: !646, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !42}
!648 = !{!644, !649, !658, !659, !661, !662}
!649 = !DILocalVariable(name: "infomap", scope: !645, file: !49, line: 838, type: !650)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 896, elements: !656)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !645, file: !49, line: 838, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !652, file: !49, line: 838, baseType: !42, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !652, file: !49, line: 838, baseType: !42, size: 64, offset: 64)
!656 = !{!657}
!657 = !DISubrange(count: 7)
!658 = !DILocalVariable(name: "node", scope: !645, file: !49, line: 848, type: !42)
!659 = !DILocalVariable(name: "map_prog", scope: !645, file: !49, line: 849, type: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!661 = !DILocalVariable(name: "lc_messages", scope: !645, file: !49, line: 861, type: !42)
!662 = !DILocalVariable(name: "url_program", scope: !645, file: !49, line: 874, type: !42)
!663 = !DILocation(line: 0, scope: !645, inlinedAt: !664)
!664 = distinct !DILocation(line: 105, column: 7, scope: !629)
!665 = !DILocation(line: 838, column: 3, scope: !645, inlinedAt: !664)
!666 = !DILocation(line: 838, column: 67, scope: !645, inlinedAt: !664)
!667 = !DILocation(line: 849, column: 36, scope: !645, inlinedAt: !664)
!668 = !DILocation(line: 851, column: 3, scope: !645, inlinedAt: !664)
!669 = !DILocalVariable(name: "__s1", arg: 1, scope: !670, file: !671, line: 1359, type: !42)
!670 = distinct !DISubprogram(name: "streq", scope: !671, file: !671, line: 1359, type: !672, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !674)
!671 = !DIFile(filename: "./lib/string.h", directory: "/src")
!672 = !DISubroutineType(types: !673)
!673 = !{!35, !42, !42}
!674 = !{!669, !675}
!675 = !DILocalVariable(name: "__s2", arg: 2, scope: !670, file: !671, line: 1359, type: !42)
!676 = !DILocation(line: 0, scope: !670, inlinedAt: !677)
!677 = distinct !DILocation(line: 851, column: 33, scope: !645, inlinedAt: !664)
!678 = !DILocation(line: 1361, column: 11, scope: !670, inlinedAt: !677)
!679 = !DILocation(line: 1361, column: 10, scope: !670, inlinedAt: !677)
!680 = !DILocation(line: 852, column: 13, scope: !645, inlinedAt: !664)
!681 = !DILocation(line: 851, column: 20, scope: !645, inlinedAt: !664)
!682 = !{!683, !625, i64 0}
!683 = !{!"infomap", !625, i64 0, !625, i64 8}
!684 = !DILocation(line: 851, column: 10, scope: !645, inlinedAt: !664)
!685 = !DILocation(line: 851, column: 28, scope: !645, inlinedAt: !664)
!686 = distinct !{!686, !668, !680, !687}
!687 = !{!"llvm.loop.mustprogress"}
!688 = !DILocation(line: 854, column: 17, scope: !689, inlinedAt: !664)
!689 = distinct !DILexicalBlock(scope: !645, file: !49, line: 854, column: 7)
!690 = !{!683, !625, i64 8}
!691 = !DILocation(line: 854, column: 7, scope: !689, inlinedAt: !664)
!692 = !DILocation(line: 854, column: 7, scope: !645, inlinedAt: !664)
!693 = !DILocation(line: 857, column: 3, scope: !645, inlinedAt: !664)
!694 = !DILocation(line: 861, column: 29, scope: !645, inlinedAt: !664)
!695 = !DILocation(line: 862, column: 7, scope: !696, inlinedAt: !664)
!696 = distinct !DILexicalBlock(scope: !645, file: !49, line: 862, column: 7)
!697 = !DILocation(line: 862, column: 19, scope: !696, inlinedAt: !664)
!698 = !DILocation(line: 862, column: 22, scope: !696, inlinedAt: !664)
!699 = !DILocation(line: 862, column: 7, scope: !645, inlinedAt: !664)
!700 = !DILocation(line: 868, column: 7, scope: !701, inlinedAt: !664)
!701 = distinct !DILexicalBlock(scope: !696, file: !49, line: 863, column: 5)
!702 = !DILocation(line: 870, column: 5, scope: !701, inlinedAt: !664)
!703 = !DILocation(line: 0, scope: !670, inlinedAt: !704)
!704 = distinct !DILocation(line: 874, column: 29, scope: !645, inlinedAt: !664)
!705 = !DILocation(line: 875, column: 3, scope: !645, inlinedAt: !664)
!706 = !DILocation(line: 877, column: 3, scope: !645, inlinedAt: !664)
!707 = !DILocation(line: 879, column: 1, scope: !645, inlinedAt: !664)
!708 = !DILocation(line: 107, column: 3, scope: !613)
!709 = !DISubprogram(name: "dcgettext", scope: !710, file: !710, line: 51, type: !711, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !633)
!710 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!711 = !DISubroutineType(types: !712)
!712 = !{!32, !42, !42, !38}
!713 = !DISubprogram(name: "fputs_unlocked", scope: !367, file: !367, line: 691, type: !714, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !633)
!714 = !DISubroutineType(types: !715)
!715 = !{!38, !716, !717}
!716 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !42)
!717 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!718 = !DILocation(line: 0, scope: !48)
!719 = !DILocation(line: 581, column: 7, scope: !57)
!720 = !{!721, !721, i64 0}
!721 = !{!"int", !626, i64 0}
!722 = !DILocation(line: 581, column: 19, scope: !57)
!723 = !DILocation(line: 581, column: 7, scope: !48)
!724 = !DILocation(line: 585, column: 26, scope: !56)
!725 = !DILocation(line: 0, scope: !56)
!726 = !DILocation(line: 586, column: 23, scope: !56)
!727 = !DILocation(line: 586, column: 28, scope: !56)
!728 = !DILocation(line: 586, column: 32, scope: !56)
!729 = !{!626, !626, i64 0}
!730 = !DILocation(line: 586, column: 38, scope: !56)
!731 = !DILocation(line: 0, scope: !670, inlinedAt: !732)
!732 = distinct !DILocation(line: 586, column: 41, scope: !56)
!733 = !DILocation(line: 1361, column: 11, scope: !670, inlinedAt: !732)
!734 = !DILocation(line: 1361, column: 10, scope: !670, inlinedAt: !732)
!735 = !DILocation(line: 586, column: 19, scope: !56)
!736 = !DILocation(line: 587, column: 5, scope: !56)
!737 = !DILocation(line: 588, column: 7, scope: !738)
!738 = distinct !DILexicalBlock(scope: !48, file: !49, line: 588, column: 7)
!739 = !DILocation(line: 588, column: 7, scope: !48)
!740 = !DILocation(line: 590, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !738, file: !49, line: 589, column: 5)
!742 = !DILocation(line: 591, column: 7, scope: !741)
!743 = !DILocation(line: 595, column: 37, scope: !48)
!744 = !DILocation(line: 595, column: 35, scope: !48)
!745 = !DILocation(line: 596, column: 29, scope: !48)
!746 = !DILocation(line: 597, column: 8, scope: !64)
!747 = !DILocation(line: 597, column: 7, scope: !48)
!748 = !DILocation(line: 604, column: 24, scope: !63)
!749 = !DILocation(line: 604, column: 12, scope: !64)
!750 = !DILocation(line: 0, scope: !62)
!751 = !DILocation(line: 610, column: 16, scope: !62)
!752 = !DILocation(line: 610, column: 7, scope: !62)
!753 = !DILocation(line: 611, column: 21, scope: !62)
!754 = !{!755, !755, i64 0}
!755 = !{!"short", !626, i64 0}
!756 = !DILocation(line: 611, column: 19, scope: !62)
!757 = !DILocation(line: 611, column: 16, scope: !62)
!758 = !DILocation(line: 610, column: 30, scope: !62)
!759 = distinct !{!759, !752, !753, !687}
!760 = !DILocation(line: 612, column: 18, scope: !761)
!761 = distinct !DILexicalBlock(scope: !62, file: !49, line: 612, column: 11)
!762 = !DILocation(line: 612, column: 11, scope: !62)
!763 = !DILocation(line: 620, column: 23, scope: !48)
!764 = !DILocation(line: 625, column: 39, scope: !48)
!765 = !DILocation(line: 626, column: 3, scope: !48)
!766 = !DILocation(line: 626, column: 10, scope: !48)
!767 = !DILocation(line: 626, column: 21, scope: !48)
!768 = !DILocation(line: 628, column: 44, scope: !769)
!769 = distinct !DILexicalBlock(scope: !770, file: !49, line: 628, column: 11)
!770 = distinct !DILexicalBlock(scope: !48, file: !49, line: 627, column: 5)
!771 = !DILocation(line: 628, column: 32, scope: !769)
!772 = !DILocation(line: 628, column: 49, scope: !769)
!773 = !DILocation(line: 628, column: 11, scope: !770)
!774 = !DILocation(line: 630, column: 11, scope: !775)
!775 = distinct !DILexicalBlock(scope: !770, file: !49, line: 630, column: 11)
!776 = !DILocation(line: 630, column: 11, scope: !770)
!777 = !DILocation(line: 632, column: 26, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !49, line: 632, column: 15)
!779 = distinct !DILexicalBlock(scope: !775, file: !49, line: 631, column: 9)
!780 = !DILocation(line: 632, column: 34, scope: !778)
!781 = !DILocation(line: 632, column: 37, scope: !778)
!782 = !DILocation(line: 632, column: 15, scope: !779)
!783 = !DILocation(line: 636, column: 29, scope: !784)
!784 = distinct !DILexicalBlock(scope: !779, file: !49, line: 636, column: 15)
!785 = !DILocation(line: 640, column: 16, scope: !770)
!786 = distinct !{!786, !765, !787, !687}
!787 = !DILocation(line: 641, column: 5, scope: !48)
!788 = !DILocation(line: 644, column: 3, scope: !48)
!789 = !DILocation(line: 0, scope: !670, inlinedAt: !790)
!790 = distinct !DILocation(line: 648, column: 31, scope: !48)
!791 = !DILocation(line: 0, scope: !670, inlinedAt: !792)
!792 = distinct !DILocation(line: 649, column: 31, scope: !48)
!793 = !DILocation(line: 0, scope: !670, inlinedAt: !794)
!794 = distinct !DILocation(line: 650, column: 31, scope: !48)
!795 = !DILocation(line: 0, scope: !670, inlinedAt: !796)
!796 = distinct !DILocation(line: 651, column: 31, scope: !48)
!797 = !DILocation(line: 0, scope: !670, inlinedAt: !798)
!798 = distinct !DILocation(line: 652, column: 31, scope: !48)
!799 = !DILocation(line: 0, scope: !670, inlinedAt: !800)
!800 = distinct !DILocation(line: 653, column: 31, scope: !48)
!801 = !DILocation(line: 0, scope: !670, inlinedAt: !802)
!802 = distinct !DILocation(line: 654, column: 31, scope: !48)
!803 = !DILocation(line: 0, scope: !670, inlinedAt: !804)
!804 = distinct !DILocation(line: 655, column: 31, scope: !48)
!805 = !DILocation(line: 0, scope: !670, inlinedAt: !806)
!806 = distinct !DILocation(line: 656, column: 31, scope: !48)
!807 = !DILocation(line: 0, scope: !670, inlinedAt: !808)
!808 = distinct !DILocation(line: 657, column: 31, scope: !48)
!809 = !DILocation(line: 663, column: 7, scope: !810)
!810 = distinct !DILexicalBlock(scope: !48, file: !49, line: 663, column: 7)
!811 = !DILocation(line: 664, column: 7, scope: !810)
!812 = !DILocation(line: 664, column: 10, scope: !810)
!813 = !DILocation(line: 663, column: 7, scope: !48)
!814 = !DILocation(line: 669, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !810, file: !49, line: 665, column: 5)
!816 = !DILocation(line: 671, column: 5, scope: !815)
!817 = !DILocation(line: 676, column: 7, scope: !818)
!818 = distinct !DILexicalBlock(scope: !810, file: !49, line: 673, column: 5)
!819 = !DILocation(line: 679, column: 3, scope: !48)
!820 = !DILocation(line: 683, column: 3, scope: !48)
!821 = !DILocation(line: 686, column: 3, scope: !48)
!822 = !DILocation(line: 688, column: 3, scope: !48)
!823 = !DILocation(line: 691, column: 3, scope: !48)
!824 = !DILocation(line: 695, column: 3, scope: !48)
!825 = !DILocation(line: 696, column: 1, scope: !48)
!826 = !DISubprogram(name: "setlocale", scope: !827, file: !827, line: 122, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !633)
!827 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!828 = !DISubroutineType(types: !829)
!829 = !{!32, !38, !42}
!830 = !DISubprogram(name: "getenv", scope: !831, file: !831, line: 641, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !633)
!831 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!832 = !DISubroutineType(types: !833)
!833 = !{!32, !42}
!834 = !DISubprogram(name: "fwrite_unlocked", scope: !367, file: !367, line: 704, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !633)
!835 = !DISubroutineType(types: !836)
!836 = !{!40, !837, !40, !40, !717}
!837 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!840 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 273, type: !841, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!38, !38, !313}
!843 = !{!844, !845, !846, !847, !848, !849}
!844 = !DILocalVariable(name: "argc", arg: 1, scope: !840, file: !3, line: 273, type: !38)
!845 = !DILocalVariable(name: "argv", arg: 2, scope: !840, file: !3, line: 273, type: !313)
!846 = !DILocalVariable(name: "have_tabval", scope: !840, file: !3, line: 275, type: !35)
!847 = !DILocalVariable(name: "tabval", scope: !840, file: !3, line: 276, type: !166)
!848 = !DILocalVariable(name: "c", scope: !840, file: !3, line: 277, type: !38)
!849 = !DILocalVariable(name: "convert_first_only", scope: !840, file: !3, line: 281, type: !35)
!850 = !DILocation(line: 0, scope: !840)
!851 = !DILocation(line: 284, column: 21, scope: !840)
!852 = !DILocation(line: 284, column: 3, scope: !840)
!853 = !DILocation(line: 285, column: 3, scope: !840)
!854 = !DILocation(line: 286, column: 3, scope: !840)
!855 = !DILocation(line: 287, column: 3, scope: !840)
!856 = !DILocation(line: 289, column: 3, scope: !840)
!857 = !DILocation(line: 291, column: 3, scope: !840)
!858 = !DILocation(line: 291, column: 15, scope: !840)
!859 = distinct !{!859, !857, !860, !687}
!860 = !DILocation(line: 325, column: 5, scope: !840)
!861 = !DILocation(line: 297, column: 11, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !3, line: 295, column: 9)
!863 = distinct !DILexicalBlock(scope: !840, file: !3, line: 293, column: 5)
!864 = !DILocation(line: 299, column: 31, scope: !862)
!865 = !{!866, !866, i64 0}
!866 = !{!"_Bool", !626, i64 0}
!867 = !DILocation(line: 300, column: 11, scope: !862)
!868 = !DILocation(line: 302, column: 31, scope: !862)
!869 = !DILocation(line: 303, column: 28, scope: !862)
!870 = !DILocation(line: 303, column: 11, scope: !862)
!871 = !DILocation(line: 304, column: 11, scope: !862)
!872 = !DILocation(line: 309, column: 15, scope: !862)
!873 = !DILocation(line: 310, column: 13, scope: !874)
!874 = distinct !DILexicalBlock(scope: !862, file: !3, line: 309, column: 15)
!875 = !DILocation(line: 313, column: 9, scope: !862)
!876 = !DILocation(line: 314, column: 9, scope: !862)
!877 = !DILocation(line: 316, column: 15, scope: !862)
!878 = !DILocation(line: 321, column: 16, scope: !879)
!879 = distinct !DILexicalBlock(scope: !862, file: !3, line: 321, column: 15)
!880 = !DILocation(line: 321, column: 15, scope: !862)
!881 = !DILocation(line: 322, column: 13, scope: !879)
!882 = !DILocation(line: 327, column: 7, scope: !840)
!883 = !DILocation(line: 328, column: 25, scope: !884)
!884 = distinct !DILexicalBlock(scope: !840, file: !3, line: 327, column: 7)
!885 = !DILocation(line: 328, column: 5, scope: !884)
!886 = !DILocation(line: 330, column: 7, scope: !840)
!887 = !DILocation(line: 331, column: 5, scope: !888)
!888 = distinct !DILexicalBlock(scope: !840, file: !3, line: 330, column: 7)
!889 = !DILocation(line: 333, column: 3, scope: !840)
!890 = !DILocation(line: 335, column: 19, scope: !840)
!891 = !DILocation(line: 335, column: 26, scope: !840)
!892 = !DILocation(line: 335, column: 18, scope: !840)
!893 = !DILocation(line: 335, column: 3, scope: !840)
!894 = !DILocation(line: 117, column: 14, scope: !133, inlinedAt: !895)
!895 = distinct !DILocation(line: 337, column: 3, scope: !840)
!896 = !DILocation(line: 0, scope: !133, inlinedAt: !895)
!897 = !DILocation(line: 124, column: 8, scope: !898, inlinedAt: !895)
!898 = distinct !DILexicalBlock(scope: !133, file: !3, line: 124, column: 7)
!899 = !DILocation(line: 124, column: 7, scope: !133, inlinedAt: !895)
!900 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !901, file: !141, line: 56, type: !904)
!901 = distinct !DISubprogram(name: "mbbuf_init", scope: !141, file: !141, line: 56, type: !902, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !904, !32, !147, !71}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!905 = !{!900, !906, !907, !908}
!906 = !DILocalVariable(name: "buffer", arg: 2, scope: !901, file: !141, line: 56, type: !32)
!907 = !DILocalVariable(name: "size", arg: 3, scope: !901, file: !141, line: 56, type: !147)
!908 = !DILocalVariable(name: "fp", arg: 4, scope: !901, file: !141, line: 56, type: !71)
!909 = !DILocation(line: 0, scope: !901, inlinedAt: !910)
!910 = distinct !DILocation(line: 129, column: 3, scope: !133, inlinedAt: !895)
!911 = !DILocation(line: 134, column: 29, scope: !133, inlinedAt: !895)
!912 = !{!913, !913, i64 0}
!913 = !{!"long", !626, i64 0}
!914 = !DILocation(line: 134, column: 62, scope: !133, inlinedAt: !895)
!915 = !DILocation(line: 134, column: 19, scope: !133, inlinedAt: !895)
!916 = !DILocation(line: 136, column: 3, scope: !133, inlinedAt: !895)
!917 = !DILocation(line: 61, column: 13, scope: !901, inlinedAt: !910)
!918 = !DILocation(line: 0, scope: !153, inlinedAt: !895)
!919 = !DILocation(line: 155, column: 7, scope: !153, inlinedAt: !895)
!920 = !DILocation(line: 155, column: 13, scope: !153, inlinedAt: !895)
!921 = !DILocation(line: 171, column: 7, scope: !153, inlinedAt: !895)
!922 = !DILocation(line: 173, column: 11, scope: !179, inlinedAt: !895)
!923 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !924, file: !141, line: 71, type: !904)
!924 = distinct !DISubprogram(name: "mbbuf_get_char", scope: !141, file: !141, line: 71, type: !925, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{!154, !904}
!927 = !{!923, !928, !929, !932}
!928 = !DILocalVariable(name: "available", scope: !924, file: !141, line: 73, type: !147)
!929 = !DILocalVariable(name: "start", scope: !930, file: !141, line: 77, type: !147)
!930 = distinct !DILexicalBlock(scope: !931, file: !141, line: 76, column: 5)
!931 = distinct !DILexicalBlock(scope: !924, file: !141, line: 75, column: 7)
!932 = !DILocalVariable(name: "g", scope: !924, file: !141, line: 92, type: !154)
!933 = !DILocation(line: 0, scope: !924, inlinedAt: !934)
!934 = distinct !DILocation(line: 173, column: 23, scope: !179, inlinedAt: !895)
!935 = !DILocation(line: 73, column: 35, scope: !924, inlinedAt: !934)
!936 = !DILocation(line: 75, column: 17, scope: !931, inlinedAt: !934)
!937 = !DILocation(line: 75, column: 32, scope: !931, inlinedAt: !934)
!938 = !DILocalVariable(name: "__stream", arg: 1, scope: !939, file: !940, line: 128, type: !71)
!939 = distinct !DISubprogram(name: "feof_unlocked", scope: !940, file: !940, line: 128, type: !941, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !943)
!940 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!941 = !DISubroutineType(types: !942)
!942 = !{!38, !71}
!943 = !{!938}
!944 = !DILocation(line: 0, scope: !939, inlinedAt: !945)
!945 = distinct !DILocation(line: 75, column: 37, scope: !931, inlinedAt: !934)
!946 = !DILocation(line: 130, column: 10, scope: !939, inlinedAt: !945)
!947 = !{!948, !721, i64 0}
!948 = !{!"_IO_FILE", !721, i64 0, !625, i64 8, !625, i64 16, !625, i64 24, !625, i64 32, !625, i64 40, !625, i64 48, !625, i64 56, !625, i64 64, !625, i64 72, !625, i64 80, !625, i64 88, !625, i64 96, !625, i64 104, !721, i64 112, !721, i64 116, !913, i64 120, !755, i64 128, !626, i64 130, !626, i64 131, !625, i64 136, !913, i64 144, !625, i64 152, !625, i64 160, !625, i64 168, !625, i64 176, !913, i64 184, !721, i64 192, !626, i64 196}
!949 = !DILocation(line: 75, column: 37, scope: !931, inlinedAt: !934)
!950 = !DILocation(line: 75, column: 7, scope: !924, inlinedAt: !934)
!951 = !DILocation(line: 78, column: 15, scope: !952, inlinedAt: !934)
!952 = distinct !DILexicalBlock(scope: !930, file: !141, line: 78, column: 11)
!953 = !DILocation(line: 78, column: 11, scope: !930, inlinedAt: !934)
!954 = !DILocation(line: 82, column: 49, scope: !955, inlinedAt: !934)
!955 = distinct !DILexicalBlock(scope: !952, file: !141, line: 81, column: 9)
!956 = !DILocalVariable(name: "__dest", arg: 1, scope: !957, file: !958, line: 34, type: !34)
!957 = distinct !DISubprogram(name: "memmove", scope: !958, file: !958, line: 34, type: !959, scopeLine: 35, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!958 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!959 = !DISubroutineType(types: !960)
!960 = !{!34, !34, !838, !40}
!961 = !{!956, !962, !963}
!962 = !DILocalVariable(name: "__src", arg: 2, scope: !957, file: !958, line: 34, type: !838)
!963 = !DILocalVariable(name: "__len", arg: 3, scope: !957, file: !958, line: 34, type: !40)
!964 = !DILocation(line: 0, scope: !957, inlinedAt: !965)
!965 = distinct !DILocation(line: 82, column: 11, scope: !955, inlinedAt: !934)
!966 = !DILocation(line: 36, column: 10, scope: !957, inlinedAt: !965)
!967 = !DILocation(line: 0, scope: !930, inlinedAt: !934)
!968 = !DILocation(line: 0, scope: !952, inlinedAt: !934)
!969 = !DILocation(line: 85, column: 23, scope: !930, inlinedAt: !934)
!970 = !DILocation(line: 86, column: 41, scope: !930, inlinedAt: !934)
!971 = !DILocation(line: 89, column: 5, scope: !930, inlinedAt: !934)
!972 = !DILocation(line: 90, column: 17, scope: !973, inlinedAt: !934)
!973 = distinct !DILexicalBlock(scope: !924, file: !141, line: 90, column: 7)
!974 = !DILocation(line: 90, column: 7, scope: !924, inlinedAt: !934)
!975 = !DILocation(line: 92, column: 39, scope: !924, inlinedAt: !934)
!976 = !DILocalVariable(name: "p", arg: 1, scope: !977, file: !22, line: 230, type: !42)
!977 = distinct !DISubprogram(name: "mcel_scan", scope: !22, file: !22, line: 230, type: !978, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{!154, !42, !42}
!980 = !{!976, !981, !982, !983, !994, !995}
!981 = !DILocalVariable(name: "lim", arg: 2, scope: !977, file: !22, line: 230, type: !42)
!982 = !DILocalVariable(name: "c", scope: !977, file: !22, line: 235, type: !33)
!983 = !DILocalVariable(name: "mbs", scope: !977, file: !22, line: 244, type: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !415, line: 6, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !417, line: 21, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 13, size: 64, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !986, file: !417, line: 15, baseType: !38, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !986, file: !417, line: 20, baseType: !990, size: 32, offset: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !417, line: 16, size: 32, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !990, file: !417, line: 18, baseType: !7, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !990, file: !417, line: 19, baseType: !426, size: 32)
!994 = !DILocalVariable(name: "ch", scope: !977, file: !22, line: 267, type: !158)
!995 = !DILocalVariable(name: "len", scope: !977, file: !22, line: 268, type: !40)
!996 = !DILocation(line: 0, scope: !977, inlinedAt: !997)
!997 = distinct !DILocation(line: 92, column: 14, scope: !924, inlinedAt: !934)
!998 = !DILocation(line: 235, column: 12, scope: !977, inlinedAt: !997)
!999 = !DILocalVariable(name: "c", arg: 1, scope: !1000, file: !22, line: 215, type: !33)
!1000 = distinct !DISubprogram(name: "mcel_isbasic", scope: !22, file: !22, line: 215, type: !1001, scopeLine: 216, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1003)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!35, !33}
!1003 = !{!999}
!1004 = !DILocation(line: 0, scope: !1000, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 236, column: 7, scope: !1006, inlinedAt: !997)
!1006 = distinct !DILexicalBlock(scope: !977, file: !22, line: 236, column: 7)
!1007 = !DILocation(line: 217, column: 10, scope: !1000, inlinedAt: !1005)
!1008 = !DILocation(line: 236, column: 7, scope: !977, inlinedAt: !997)
!1009 = !DILocalVariable(name: "len", arg: 2, scope: !1010, file: !22, line: 167, type: !40)
!1010 = distinct !DISubprogram(name: "mcel_ch", scope: !22, file: !22, line: 167, type: !1011, scopeLine: 168, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!154, !158, !40}
!1013 = !{!1014, !1009}
!1014 = !DILocalVariable(name: "ch", arg: 1, scope: !1010, file: !22, line: 167, type: !158)
!1015 = !DILocation(line: 0, scope: !1010, inlinedAt: !1016)
!1016 = distinct !DILocation(line: 237, column: 12, scope: !1006, inlinedAt: !997)
!1017 = !DILocation(line: 172, column: 3, scope: !1010, inlinedAt: !1016)
!1018 = !DILocation(line: 237, column: 5, scope: !1006, inlinedAt: !997)
!1019 = !DILocation(line: 93, column: 39, scope: !924, inlinedAt: !934)
!1020 = !DILocation(line: 244, column: 3, scope: !977, inlinedAt: !997)
!1021 = !DILocation(line: 244, column: 13, scope: !977, inlinedAt: !997)
!1022 = !DILocation(line: 244, column: 30, scope: !977, inlinedAt: !997)
!1023 = !{!1024, !721, i64 0}
!1024 = !{!"", !721, i64 0, !626, i64 4}
!1025 = !DILocation(line: 267, column: 3, scope: !977, inlinedAt: !997)
!1026 = !DILocation(line: 268, column: 38, scope: !977, inlinedAt: !997)
!1027 = !DILocation(line: 268, column: 16, scope: !977, inlinedAt: !997)
!1028 = !DILocation(line: 274, column: 7, scope: !1029, inlinedAt: !997)
!1029 = distinct !DILexicalBlock(scope: !977, file: !22, line: 274, column: 7)
!1030 = !DILocation(line: 274, column: 7, scope: !977, inlinedAt: !997)
!1031 = !{!"branch_weights", i32 1, i32 2000}
!1032 = !DILocalVariable(name: "err", arg: 1, scope: !1033, file: !22, line: 175, type: !44)
!1033 = distinct !DISubprogram(name: "mcel_err", scope: !22, file: !22, line: 175, type: !1034, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!154, !44}
!1036 = !{!1032}
!1037 = !DILocation(line: 0, scope: !1033, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 275, column: 12, scope: !1029, inlinedAt: !997)
!1039 = !DILocation(line: 178, column: 3, scope: !1033, inlinedAt: !1038)
!1040 = !DILocation(line: 275, column: 5, scope: !1029, inlinedAt: !997)
!1041 = !DILocation(line: 279, column: 19, scope: !977, inlinedAt: !997)
!1042 = !DILocation(line: 0, scope: !1010, inlinedAt: !1043)
!1043 = distinct !DILocation(line: 279, column: 10, scope: !977, inlinedAt: !997)
!1044 = !DILocation(line: 169, column: 3, scope: !1010, inlinedAt: !1043)
!1045 = !DILocation(line: 170, column: 3, scope: !1010, inlinedAt: !1043)
!1046 = !DILocation(line: 171, column: 3, scope: !1010, inlinedAt: !1043)
!1047 = !DILocation(line: 172, column: 3, scope: !1010, inlinedAt: !1043)
!1048 = !DILocation(line: 279, column: 3, scope: !977, inlinedAt: !997)
!1049 = !DILocation(line: 280, column: 1, scope: !977, inlinedAt: !997)
!1050 = !DILocation(line: 94, column: 9, scope: !1051, inlinedAt: !934)
!1051 = distinct !DILexicalBlock(scope: !924, file: !141, line: 94, column: 7)
!1052 = !DILocation(line: 94, column: 7, scope: !924, inlinedAt: !934)
!1053 = !DILocation(line: 92, column: 14, scope: !924, inlinedAt: !934)
!1054 = !DILocation(line: 95, column: 22, scope: !1051, inlinedAt: !934)
!1055 = !DILocation(line: 95, column: 5, scope: !1051, inlinedAt: !934)
!1056 = !DILocation(line: 99, column: 30, scope: !1057, inlinedAt: !934)
!1057 = distinct !DILexicalBlock(scope: !1051, file: !141, line: 97, column: 5)
!1058 = !DILocation(line: 99, column: 14, scope: !1057, inlinedAt: !934)
!1059 = !DILocation(line: 0, scope: !1051, inlinedAt: !934)
!1060 = !DILocation(line: 173, column: 23, scope: !179, inlinedAt: !895)
!1061 = !DILocation(line: 173, column: 51, scope: !179, inlinedAt: !895)
!1062 = !DILocation(line: 174, column: 18, scope: !179, inlinedAt: !895)
!1063 = !DILocation(line: 174, column: 27, scope: !179, inlinedAt: !895)
!1064 = distinct !{!1064, !922, !1065, !687}
!1065 = !DILocation(line: 175, column: 60, scope: !179, inlinedAt: !895)
!1066 = !DILocation(line: 177, column: 15, scope: !179, inlinedAt: !895)
!1067 = !DILocalVariable(name: "wc", arg: 1, scope: !1068, file: !49, line: 178, type: !158)
!1068 = distinct !DISubprogram(name: "c32issep", scope: !49, file: !49, line: 178, type: !1069, scopeLine: 179, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1071)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!35, !158}
!1071 = !{!1067}
!1072 = !DILocation(line: 0, scope: !1068, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 179, column: 28, scope: !177, inlinedAt: !895)
!1074 = !DILocalVariable(name: "wc", arg: 1, scope: !1075, file: !1076, line: 770, type: !1079)
!1075 = distinct !DISubprogram(name: "c32isblank", scope: !1076, file: !1076, line: 770, type: !1077, scopeLine: 771, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1081)
!1076 = !DIFile(filename: "./lib/uchar.h", directory: "/src")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!38, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1080, line: 20, baseType: !7)
!1080 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1081 = !{!1074}
!1082 = !DILocation(line: 0, scope: !1075, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 181, column: 13, scope: !1068, inlinedAt: !1073)
!1084 = !DILocation(line: 776, column: 10, scope: !1075, inlinedAt: !1083)
!1085 = !DILocation(line: 181, column: 11, scope: !1068, inlinedAt: !1073)
!1086 = !DILocation(line: 0, scope: !177, inlinedAt: !895)
!1087 = !DILocation(line: 181, column: 19, scope: !177, inlinedAt: !895)
!1088 = !DILocation(line: 183, column: 19, scope: !181, inlinedAt: !895)
!1089 = !DILocation(line: 0, scope: !181, inlinedAt: !895)
!1090 = !DILocation(line: 185, column: 37, scope: !181, inlinedAt: !895)
!1091 = !DILocation(line: 188, column: 23, scope: !1092, inlinedAt: !895)
!1092 = distinct !DILexicalBlock(scope: !181, file: !3, line: 188, column: 23)
!1093 = !{i8 0, i8 2}
!1094 = !DILocation(line: 191, column: 23, scope: !181, inlinedAt: !895)
!1095 = !DILocation(line: 193, column: 32, scope: !1096, inlinedAt: !895)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !3, line: 193, column: 27)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !3, line: 192, column: 21)
!1098 = distinct !DILexicalBlock(scope: !181, file: !3, line: 191, column: 23)
!1099 = !DILocation(line: 193, column: 27, scope: !1097, inlinedAt: !895)
!1100 = !DILocation(line: 197, column: 31, scope: !1101, inlinedAt: !895)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !3, line: 197, column: 31)
!1102 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 194, column: 25)
!1103 = !DILocation(line: 197, column: 31, scope: !1102, inlinedAt: !895)
!1104 = !DILocalVariable(name: "wc", arg: 1, scope: !1105, file: !1076, line: 1004, type: !158)
!1105 = distinct !DISubprogram(name: "c32width", scope: !1076, file: !1076, line: 1004, type: !1106, scopeLine: 1005, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1108)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!38, !158}
!1108 = !{!1104}
!1109 = !DILocation(line: 0, scope: !1105, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 202, column: 37, scope: !1111, inlinedAt: !895)
!1111 = distinct !DILexicalBlock(scope: !1096, file: !3, line: 201, column: 25)
!1112 = !DILocation(line: 1010, column: 10, scope: !1105, inlinedAt: !1110)
!1113 = !DILocation(line: 202, column: 37, scope: !1111, inlinedAt: !895)
!1114 = !DILocation(line: 202, column: 34, scope: !1111, inlinedAt: !895)
!1115 = !DILocation(line: 204, column: 45, scope: !1116, inlinedAt: !895)
!1116 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 204, column: 31)
!1117 = !DILocation(line: 219, column: 31, scope: !1118, inlinedAt: !895)
!1118 = distinct !DILexicalBlock(scope: !1111, file: !3, line: 219, column: 31)
!1119 = !DILocalVariable(name: "__c", arg: 1, scope: !1120, file: !940, line: 101, type: !38)
!1120 = distinct !DISubprogram(name: "putc_unlocked", scope: !940, file: !940, line: 101, type: !1121, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!38, !38, !71}
!1123 = !{!1119, !1124}
!1124 = !DILocalVariable(name: "__stream", arg: 2, scope: !1120, file: !940, line: 101, type: !71)
!1125 = !DILocation(line: 0, scope: !1120, inlinedAt: !1126)
!1126 = distinct !DILocation(line: 219, column: 31, scope: !1118, inlinedAt: !895)
!1127 = !DILocation(line: 103, column: 10, scope: !1120, inlinedAt: !1126)
!1128 = !{!948, !625, i64 40}
!1129 = !{!948, !625, i64 48}
!1130 = !{!"branch_weights", i32 2000, i32 1}
!1131 = !DILocation(line: 219, column: 31, scope: !1111, inlinedAt: !895)
!1132 = !DILocation(line: 219, column: 51, scope: !1118, inlinedAt: !895)
!1133 = !DILocation(line: 948, column: 21, scope: !1134, inlinedAt: !1137)
!1134 = distinct !DISubprogram(name: "write_error", scope: !49, file: !49, line: 946, type: !134, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1135)
!1135 = !{!1136}
!1136 = !DILocalVariable(name: "saved_errno", scope: !1134, file: !49, line: 948, type: !38)
!1137 = distinct !DILocation(line: 220, column: 29, scope: !1118, inlinedAt: !895)
!1138 = !DILocation(line: 0, scope: !1134, inlinedAt: !1137)
!1139 = !DILocation(line: 949, column: 3, scope: !1134, inlinedAt: !1137)
!1140 = !DILocation(line: 950, column: 11, scope: !1134, inlinedAt: !1137)
!1141 = !DILocation(line: 950, column: 3, scope: !1134, inlinedAt: !1137)
!1142 = !DILocation(line: 951, column: 3, scope: !1134, inlinedAt: !1137)
!1143 = !DILocation(line: 952, column: 3, scope: !1134, inlinedAt: !1137)
!1144 = !DILocation(line: 0, scope: !1096, inlinedAt: !895)
!1145 = !DILocation(line: 226, column: 33, scope: !1097, inlinedAt: !895)
!1146 = !DILocation(line: 0, scope: !179, inlinedAt: !895)
!1147 = !DILocation(line: 227, column: 21, scope: !1097, inlinedAt: !895)
!1148 = !DILocation(line: 228, column: 17, scope: !182, inlinedAt: !895)
