; ModuleID = 'src/users.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.gl_utmp = type { i8*, i8*, i8*, i8*, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.utmp_alloc = type { %struct.gl_utmp*, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }

!10 = !DIFile(filename: "src/users.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e4916078fe75a2e005e9df4bd6e108b")
!11 = !{!12, !20, !35}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 305, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "./lib/readutmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "dbf57f6f8baa17fafca98ee518780aad")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "READ_UTMP_CHECK_PIDS", value: 1)
!17 = !DIEnumerator(name: "READ_UTMP_USER_PROCESS", value: 2)
!18 = !DIEnumerator(name: "READ_UTMP_BOOT_TIME", value: 4)
!19 = !DIEnumerator(name: "READ_UTMP_NO_BOOT_TIME", value: 8)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !14, size: 32, elements: !22)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!23 = !DIEnumerator(name: "_ISupper", value: 256)
!24 = !DIEnumerator(name: "_ISlower", value: 512)
!25 = !DIEnumerator(name: "_ISalpha", value: 1024)
!26 = !DIEnumerator(name: "_ISdigit", value: 2048)
!27 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!28 = !DIEnumerator(name: "_ISspace", value: 8192)
!29 = !DIEnumerator(name: "_ISprint", value: 16384)
!30 = !DIEnumerator(name: "_ISgraph", value: 32768)
!31 = !DIEnumerator(name: "_ISblank", value: 1)
!32 = !DIEnumerator(name: "_IScntrl", value: 2)
!33 = !DIEnumerator(name: "_ISpunct", value: 4)
!34 = !DIEnumerator(name: "_ISalnum", value: 8)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !36, line: 42, baseType: !14, size: 32, elements: !37)
!36 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!38 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!39 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!40 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!41 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!42 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!43 = !DIEnumerator(name: "c_quoting_style", value: 5)
!44 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!45 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!46 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!47 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!48 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!49 = !{!6, !50, !51, !52, !53, !56, !57}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !54, line: 46, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!55 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!56 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!59 = !{!0}
!60 = !{!61, !62, !63, !66, !68, !69, !70, !74, !75, !76, !77, !79, !135, !136, !137, !139, !140}
!61 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!62 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!63 = !DILocalVariable(name: "term", scope: !64, file: !3, line: 585, type: !6)
!64 = distinct !DILexicalBlock(scope: !65, file: !3, line: 582, column: 5)
!65 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!66 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !67)
!67 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!69 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!70 = !DILocalVariable(name: "s", scope: !71, file: !3, line: 608, type: !6)
!71 = distinct !DILexicalBlock(scope: !72, file: !3, line: 605, column: 5)
!72 = distinct !DILexicalBlock(scope: !73, file: !3, line: 604, column: 12)
!73 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!74 = !DILocalVariable(name: "spaces", scope: !71, file: !3, line: 609, type: !53)
!75 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !53)
!76 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!77 = !DILocalVariable(name: "__ptr", scope: !78, file: !3, line: 644, type: !6)
!78 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!79 = !DILocalVariable(name: "__stream", scope: !78, file: !3, line: 644, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !51, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !58, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !58, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !58, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !58, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !58, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !58, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !58, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !58, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !58, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !58, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !58, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !51, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !51, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!108 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !52, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !50, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !53, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !51, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocalVariable(name: "__cnt", scope: !78, file: !3, line: 644, type: !53)
!136 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!137 = !DILocalVariable(name: "__ptr", scope: !138, file: !3, line: 686, type: !6)
!138 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!139 = !DILocalVariable(name: "__stream", scope: !138, file: !3, line: 686, type: !80)
!140 = !DILocalVariable(name: "__cnt", scope: !138, file: !3, line: 686, type: !53)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "Version", scope: !143, file: !144, line: 3, type: !6, isLocal: false, isDefinition: true)
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !145, splitDebugInlining: false, nameTableKind: None)
!144 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!145 = !{!141}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "file_name", scope: !148, file: !149, line: 45, type: !6, isLocal: true, isDefinition: true)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !150, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!150 = !{!146, !151}
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !148, file: !149, line: 55, type: !67, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !155, file: !156, line: 66, type: !191, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !157, globals: !158, splitDebugInlining: false, nameTableKind: None)
!156 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!157 = !{!50, !56}
!158 = !{!159, !185, !153, !187, !189}
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "old_file_name", scope: !161, file: !156, line: 304, type: !6, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "verror_at_line", scope: !156, file: !156, line: 298, type: !162, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !178)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !51, !51, !6, !14, !6, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !165, line: 52, baseType: !166)
!165 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !167, line: 32, baseType: !168)
!167 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !169, baseType: !170)
!169 = !DIFile(filename: "lib/error.c", directory: "/src")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !171, size: 256, elements: !172)
!171 = !DINamespace(name: "std", scope: null)
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !170, file: !169, baseType: !50, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !170, file: !169, baseType: !50, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !170, file: !169, baseType: !50, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !170, file: !169, baseType: !51, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !170, file: !169, baseType: !51, size: 32, offset: 224)
!178 = !{!179, !180, !181, !182, !183, !184}
!179 = !DILocalVariable(name: "status", arg: 1, scope: !161, file: !156, line: 298, type: !51)
!180 = !DILocalVariable(name: "errnum", arg: 2, scope: !161, file: !156, line: 298, type: !51)
!181 = !DILocalVariable(name: "file_name", arg: 3, scope: !161, file: !156, line: 298, type: !6)
!182 = !DILocalVariable(name: "line_number", arg: 4, scope: !161, file: !156, line: 298, type: !14)
!183 = !DILocalVariable(name: "message", arg: 5, scope: !161, file: !156, line: 298, type: !6)
!184 = !DILocalVariable(name: "args", arg: 6, scope: !161, file: !156, line: 298, type: !164)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "old_line_number", scope: !161, file: !156, line: 305, type: !14, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "error_message_count", scope: !155, file: !156, line: 69, type: !14, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !155, file: !156, line: 295, type: !51, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "long_options", scope: !196, file: !197, line: 34, type: !199, isLocal: true, isDefinition: true)
!196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !197, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !198, splitDebugInlining: false, nameTableKind: None)
!197 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!198 = !{!194}
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 768, elements: !209)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !202, line: 50, size: 256, elements: !203)
!202 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!203 = !{!204, !205, !206, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !202, line: 52, baseType: !6, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !201, file: !202, line: 55, baseType: !51, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !201, file: !202, line: 56, baseType: !207, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !202, line: 57, baseType: !51, size: 32, offset: 192)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !214, line: 31, type: !6, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !215, globals: !216, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!215 = !{!58}
!216 = !{!211}
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "utf07FF", scope: !219, file: !220, line: 46, type: !250, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "proper_name_lite", scope: !220, file: !220, line: 38, type: !221, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !223, retainedNodes: !225)
!220 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!221 = !DISubroutineType(types: !222)
!222 = !{!6, !6, !6}
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !224, splitDebugInlining: false, nameTableKind: None)
!224 = !{!217}
!225 = !{!226, !227, !228, !229, !234}
!226 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !219, file: !220, line: 38, type: !6)
!227 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !219, file: !220, line: 38, type: !6)
!228 = !DILocalVariable(name: "translation", scope: !219, file: !220, line: 40, type: !6)
!229 = !DILocalVariable(name: "w", scope: !219, file: !220, line: 47, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !231, line: 37, baseType: !232)
!231 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !107, line: 57, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !107, line: 42, baseType: !14)
!234 = !DILocalVariable(name: "mbs", scope: !219, file: !220, line: 48, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !237)
!236 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !239)
!238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !239, file: !238, line: 15, baseType: !51, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !239, file: !238, line: 20, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !239, file: !238, line: 16, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !243, file: !238, line: 18, baseType: !14, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !243, file: !238, line: 19, baseType: !247, size: 32)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 4)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 2)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !255, file: !256, line: 76, type: !324, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !257, retainedTypes: !263, globals: !264, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!257 = !{!35, !258, !20}
!258 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !36, line: 254, baseType: !14, size: 32, elements: !259)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!261 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!262 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!263 = !{!51, !52, !53}
!264 = !{!253, !265, !271, !283, !285, !290, !313, !320, !322}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !255, file: !256, line: 92, type: !267, isLocal: false, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 320, elements: !269)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!269 = !{!270}
!270 = !DISubrange(count: 10)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !255, file: !256, line: 1040, type: !273, isLocal: false, isDefinition: true)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !256, line: 56, size: 448, elements: !274)
!274 = !{!275, !276, !277, !281, !282}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !273, file: !256, line: 59, baseType: !35, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !256, line: 62, baseType: !51, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !273, file: !256, line: 66, baseType: !278, size: 256, offset: 64)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !273, file: !256, line: 69, baseType: !6, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !273, file: !256, line: 72, baseType: !6, size: 64, offset: 384)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !255, file: !256, line: 107, type: !273, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "slot0", scope: !255, file: !256, line: 831, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 256)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "quote", scope: !292, file: !256, line: 228, type: !311, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "gettext_quote", scope: !256, file: !256, line: 197, type: !293, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !255, retainedNodes: !295)
!293 = !DISubroutineType(types: !294)
!294 = !{!6, !6, !35}
!295 = !{!296, !297, !298, !299, !300}
!296 = !DILocalVariable(name: "msgid", arg: 1, scope: !292, file: !256, line: 197, type: !6)
!297 = !DILocalVariable(name: "s", arg: 2, scope: !292, file: !256, line: 197, type: !35)
!298 = !DILocalVariable(name: "translation", scope: !292, file: !256, line: 199, type: !6)
!299 = !DILocalVariable(name: "w", scope: !292, file: !256, line: 229, type: !230)
!300 = !DILocalVariable(name: "mbs", scope: !292, file: !256, line: 230, type: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !303, file: !238, line: 15, baseType: !51, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !303, file: !238, line: 20, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !303, file: !238, line: 16, size: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !307, file: !238, line: 18, baseType: !14, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !307, file: !238, line: 19, baseType: !247, size: 32)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !312)
!312 = !{!252, !249}
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "slotvec", scope: !255, file: !256, line: 834, type: !315, isLocal: true, isDefinition: true)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !256, line: 823, size: 128, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !316, file: !256, line: 825, baseType: !53, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !256, line: 826, baseType: !58, size: 64, offset: 64)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "nslots", scope: !255, file: !256, line: 832, type: !51, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "slotvec0", scope: !255, file: !256, line: 833, type: !316, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 704, elements: !326)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!326 = !{!327}
!327 = !DISubrange(count: 11)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !330, file: !331, line: 26, type: !333, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C99, file: !331, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !332, splitDebugInlining: false, nameTableKind: None)
!331 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!332 = !{!328}
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 47)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "exit_failure", scope: !338, file: !339, line: 24, type: !341, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !340, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!340 = !{!336}
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "internal_state", scope: !344, file: !345, line: 97, type: !348, isLocal: true, isDefinition: true)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !345, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !346, globals: !347, splitDebugInlining: false, nameTableKind: None)
!345 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!346 = !{!50, !53, !56}
!347 = !{!342}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !236, line: 6, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !238, line: 21, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !238, line: 13, size: 64, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !350, file: !238, line: 15, baseType: !51, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !350, file: !238, line: 20, baseType: !354, size: 32, offset: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !350, file: !238, line: 16, size: 32, elements: !355)
!355 = !{!356, !357}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !354, file: !238, line: 18, baseType: !14, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !354, file: !238, line: 19, baseType: !247, size: 32)
!358 = distinct !DICompileUnit(language: DW_LANG_C99, file: !359, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!359 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !362, retainedTypes: !363, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!362 = !{!12}
!363 = !{!58, !50, !364, !398, !53}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !367, line: 55, size: 3200, elements: !368)
!367 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!368 = !{!369, !371, !373, !377, !378, !379, !380, !385, !386, !394, !397}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !366, file: !367, line: 57, baseType: !370, size: 16)
!370 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !366, file: !367, line: 58, baseType: !372, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !107, line: 154, baseType: !51)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !366, file: !367, line: 59, baseType: !374, size: 256, offset: 64)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !366, file: !367, line: 61, baseType: !247, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !366, file: !367, line: 63, baseType: !374, size: 256, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !366, file: !367, line: 65, baseType: !287, size: 2048, offset: 608)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !366, file: !367, line: 67, baseType: !381, size: 32, offset: 2656)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !367, line: 42, size: 32, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !381, file: !367, line: 45, baseType: !370, size: 16)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !381, file: !367, line: 46, baseType: !370, size: 16, offset: 16)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !366, file: !367, line: 81, baseType: !108, size: 64, offset: 2688)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !366, file: !367, line: 82, baseType: !387, size: 128, offset: 2752)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !388, line: 8, size: 128, elements: !389)
!388 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!389 = !{!390, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !387, file: !388, line: 14, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !107, line: 160, baseType: !108)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !387, file: !388, line: 15, baseType: !393, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !107, line: 162, baseType: !108)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !366, file: !367, line: 84, baseType: !395, size: 128, offset: 2880)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 128, elements: !248)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !107, line: 41, baseType: !51)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !366, file: !367, line: 85, baseType: !132, size: 160, offset: 3008)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !399, line: 87, baseType: !108)
!399 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !402, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!402 = !{!403}
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !401, line: 40, baseType: !14, size: 32, elements: !404)
!404 = !{!405}
!405 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!406 = !{!50}
!407 = distinct !DICompileUnit(language: DW_LANG_C99, file: !408, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !409, retainedTypes: !440, splitDebugInlining: false, nameTableKind: None)
!408 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!409 = !{!410, !422}
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !411, file: !408, line: 188, baseType: !14, size: 32, elements: !420)
!411 = distinct !DISubprogram(name: "x2nrealloc", scope: !408, file: !408, line: 176, type: !412, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !407, retainedNodes: !415)
!412 = !DISubroutineType(types: !413)
!413 = !{!50, !50, !414, !53}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!415 = !{!416, !417, !418, !419}
!416 = !DILocalVariable(name: "p", arg: 1, scope: !411, file: !408, line: 176, type: !50)
!417 = !DILocalVariable(name: "pn", arg: 2, scope: !411, file: !408, line: 176, type: !414)
!418 = !DILocalVariable(name: "s", arg: 3, scope: !411, file: !408, line: 176, type: !53)
!419 = !DILocalVariable(name: "n", scope: !411, file: !408, line: 178, type: !53)
!420 = !{!421}
!421 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !423, file: !408, line: 228, baseType: !14, size: 32, elements: !420)
!423 = distinct !DISubprogram(name: "xpalloc", scope: !408, file: !408, line: 223, type: !424, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !407, retainedNodes: !430)
!424 = !DISubroutineType(types: !425)
!425 = !{!50, !50, !426, !427, !429, !427}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !428, line: 130, baseType: !429)
!428 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !54, line: 35, baseType: !108)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439}
!431 = !DILocalVariable(name: "pa", arg: 1, scope: !423, file: !408, line: 223, type: !50)
!432 = !DILocalVariable(name: "pn", arg: 2, scope: !423, file: !408, line: 223, type: !426)
!433 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !423, file: !408, line: 223, type: !427)
!434 = !DILocalVariable(name: "n_max", arg: 4, scope: !423, file: !408, line: 223, type: !429)
!435 = !DILocalVariable(name: "s", arg: 5, scope: !423, file: !408, line: 223, type: !427)
!436 = !DILocalVariable(name: "n0", scope: !423, file: !408, line: 230, type: !427)
!437 = !DILocalVariable(name: "n", scope: !423, file: !408, line: 237, type: !427)
!438 = !DILocalVariable(name: "nbytes", scope: !423, file: !408, line: 248, type: !427)
!439 = !DILocalVariable(name: "adjusted_nbytes", scope: !423, file: !408, line: 252, type: !427)
!440 = !{!58, !50, !67, !108, !55}
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!449 = distinct !DICompileUnit(language: DW_LANG_C99, file: !450, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!450 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!451 = distinct !DICompileUnit(language: DW_LANG_C99, file: !452, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!452 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !454, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!455 = !{!67, !55, !50}
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!458 = distinct !DICompileUnit(language: DW_LANG_C99, file: !459, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!459 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!462 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!463 = !{i32 7, !"Dwarf Version", i32 5}
!464 = !{i32 2, !"Debug Info Version", i32 3}
!465 = !{i32 1, !"wchar_size", i32 4}
!466 = !{i32 1, !"branch-target-enforcement", i32 0}
!467 = !{i32 1, !"sign-return-address", i32 0}
!468 = !{i32 1, !"sign-return-address-all", i32 0}
!469 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!470 = !{i32 7, !"PIC Level", i32 2}
!471 = !{i32 7, !"PIE Level", i32 2}
!472 = !{i32 7, !"uwtable", i32 1}
!473 = !{i32 7, !"frame-pointer", i32 1}
!474 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 96, type: !475, scopeLine: 97, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !477)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !51}
!477 = !{!478}
!478 = !DILocalVariable(name: "status", arg: 1, scope: !474, file: !10, line: 96, type: !51)
!479 = !DILocation(line: 0, scope: !474)
!480 = !DILocation(line: 98, column: 14, scope: !481)
!481 = distinct !DILexicalBlock(scope: !474, file: !10, line: 98, column: 7)
!482 = !DILocation(line: 98, column: 7, scope: !474)
!483 = !DILocation(line: 99, column: 5, scope: !484)
!484 = distinct !DILexicalBlock(scope: !481, file: !10, line: 99, column: 5)
!485 = !{!486, !486, i64 0}
!486 = !{!"any pointer", !487, i64 0}
!487 = !{!"omnipotent char", !488, i64 0}
!488 = !{!"Simple C/C++ TBAA"}
!489 = !DILocation(line: 102, column: 7, scope: !490)
!490 = distinct !DILexicalBlock(scope: !481, file: !10, line: 101, column: 5)
!491 = !DILocation(line: 103, column: 7, scope: !490)
!492 = !DILocation(line: 109, column: 7, scope: !490)
!493 = !DILocation(line: 110, column: 7, scope: !490)
!494 = !DILocalVariable(name: "program", arg: 1, scope: !495, file: !3, line: 836, type: !6)
!495 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !496, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !6}
!498 = !{!494, !499, !508, !509, !511, !512}
!499 = !DILocalVariable(name: "infomap", scope: !495, file: !3, line: 838, type: !500)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 896, elements: !506)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !495, file: !3, line: 838, size: 128, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !502, file: !3, line: 838, baseType: !6, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !502, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!506 = !{!507}
!507 = !DISubrange(count: 7)
!508 = !DILocalVariable(name: "node", scope: !495, file: !3, line: 848, type: !6)
!509 = !DILocalVariable(name: "map_prog", scope: !495, file: !3, line: 849, type: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!511 = !DILocalVariable(name: "lc_messages", scope: !495, file: !3, line: 861, type: !6)
!512 = !DILocalVariable(name: "url_program", scope: !495, file: !3, line: 874, type: !6)
!513 = !DILocation(line: 0, scope: !495, inlinedAt: !514)
!514 = distinct !DILocation(line: 111, column: 7, scope: !490)
!515 = !DILocation(line: 838, column: 3, scope: !495, inlinedAt: !514)
!516 = !DILocation(line: 838, column: 67, scope: !495, inlinedAt: !514)
!517 = !DILocation(line: 849, column: 36, scope: !495, inlinedAt: !514)
!518 = !DILocation(line: 851, column: 3, scope: !495, inlinedAt: !514)
!519 = !DILocalVariable(name: "__s1", arg: 1, scope: !520, file: !521, line: 1359, type: !6)
!520 = distinct !DISubprogram(name: "streq", scope: !521, file: !521, line: 1359, type: !522, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !524)
!521 = !DIFile(filename: "./lib/string.h", directory: "/src")
!522 = !DISubroutineType(types: !523)
!523 = !{!67, !6, !6}
!524 = !{!519, !525}
!525 = !DILocalVariable(name: "__s2", arg: 2, scope: !520, file: !521, line: 1359, type: !6)
!526 = !DILocation(line: 0, scope: !520, inlinedAt: !527)
!527 = distinct !DILocation(line: 851, column: 33, scope: !495, inlinedAt: !514)
!528 = !DILocation(line: 1361, column: 11, scope: !520, inlinedAt: !527)
!529 = !DILocation(line: 1361, column: 10, scope: !520, inlinedAt: !527)
!530 = !DILocation(line: 852, column: 13, scope: !495, inlinedAt: !514)
!531 = !DILocation(line: 851, column: 20, scope: !495, inlinedAt: !514)
!532 = !{!533, !486, i64 0}
!533 = !{!"infomap", !486, i64 0, !486, i64 8}
!534 = !DILocation(line: 851, column: 10, scope: !495, inlinedAt: !514)
!535 = !DILocation(line: 851, column: 28, scope: !495, inlinedAt: !514)
!536 = distinct !{!536, !518, !530, !537}
!537 = !{!"llvm.loop.mustprogress"}
!538 = !DILocation(line: 854, column: 17, scope: !539, inlinedAt: !514)
!539 = distinct !DILexicalBlock(scope: !495, file: !3, line: 854, column: 7)
!540 = !{!533, !486, i64 8}
!541 = !DILocation(line: 854, column: 7, scope: !539, inlinedAt: !514)
!542 = !DILocation(line: 854, column: 7, scope: !495, inlinedAt: !514)
!543 = !DILocation(line: 857, column: 3, scope: !495, inlinedAt: !514)
!544 = !DILocation(line: 861, column: 29, scope: !495, inlinedAt: !514)
!545 = !DILocation(line: 862, column: 7, scope: !546, inlinedAt: !514)
!546 = distinct !DILexicalBlock(scope: !495, file: !3, line: 862, column: 7)
!547 = !DILocation(line: 862, column: 19, scope: !546, inlinedAt: !514)
!548 = !DILocation(line: 862, column: 22, scope: !546, inlinedAt: !514)
!549 = !DILocation(line: 862, column: 7, scope: !495, inlinedAt: !514)
!550 = !DILocation(line: 868, column: 7, scope: !551, inlinedAt: !514)
!551 = distinct !DILexicalBlock(scope: !546, file: !3, line: 863, column: 5)
!552 = !DILocation(line: 870, column: 5, scope: !551, inlinedAt: !514)
!553 = !DILocation(line: 0, scope: !520, inlinedAt: !554)
!554 = distinct !DILocation(line: 874, column: 29, scope: !495, inlinedAt: !514)
!555 = !DILocation(line: 875, column: 3, scope: !495, inlinedAt: !514)
!556 = !DILocation(line: 877, column: 3, scope: !495, inlinedAt: !514)
!557 = !DILocation(line: 879, column: 1, scope: !495, inlinedAt: !514)
!558 = !DILocation(line: 113, column: 3, scope: !474)
!559 = !DISubprogram(name: "dcgettext", scope: !560, file: !560, line: 51, type: !561, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!560 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!561 = !DISubroutineType(types: !562)
!562 = !{!58, !6, !6, !51}
!563 = !{}
!564 = !DILocation(line: 0, scope: !2)
!565 = !DILocation(line: 581, column: 7, scope: !65)
!566 = !{!567, !567, i64 0}
!567 = !{!"int", !487, i64 0}
!568 = !DILocation(line: 581, column: 19, scope: !65)
!569 = !DILocation(line: 581, column: 7, scope: !2)
!570 = !DILocation(line: 585, column: 26, scope: !64)
!571 = !DILocation(line: 0, scope: !64)
!572 = !DILocation(line: 586, column: 23, scope: !64)
!573 = !DILocation(line: 586, column: 28, scope: !64)
!574 = !DILocation(line: 586, column: 32, scope: !64)
!575 = !{!487, !487, i64 0}
!576 = !DILocation(line: 586, column: 38, scope: !64)
!577 = !DILocation(line: 0, scope: !520, inlinedAt: !578)
!578 = distinct !DILocation(line: 586, column: 41, scope: !64)
!579 = !DILocation(line: 1361, column: 11, scope: !520, inlinedAt: !578)
!580 = !DILocation(line: 1361, column: 10, scope: !520, inlinedAt: !578)
!581 = !DILocation(line: 586, column: 19, scope: !64)
!582 = !DILocation(line: 587, column: 5, scope: !64)
!583 = !DILocation(line: 588, column: 7, scope: !584)
!584 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!585 = !DILocation(line: 588, column: 7, scope: !2)
!586 = !DILocation(line: 590, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !3, line: 589, column: 5)
!588 = !DILocation(line: 591, column: 7, scope: !587)
!589 = !DILocation(line: 595, column: 37, scope: !2)
!590 = !DILocation(line: 595, column: 35, scope: !2)
!591 = !DILocation(line: 596, column: 29, scope: !2)
!592 = !DILocation(line: 597, column: 8, scope: !73)
!593 = !DILocation(line: 597, column: 7, scope: !2)
!594 = !DILocation(line: 604, column: 24, scope: !72)
!595 = !DILocation(line: 604, column: 12, scope: !73)
!596 = !DILocation(line: 0, scope: !71)
!597 = !DILocation(line: 610, column: 16, scope: !71)
!598 = !DILocation(line: 610, column: 7, scope: !71)
!599 = !DILocation(line: 611, column: 21, scope: !71)
!600 = !{!601, !601, i64 0}
!601 = !{!"short", !487, i64 0}
!602 = !DILocation(line: 611, column: 19, scope: !71)
!603 = !DILocation(line: 611, column: 16, scope: !71)
!604 = !DILocation(line: 610, column: 30, scope: !71)
!605 = distinct !{!605, !598, !599, !537}
!606 = !DILocation(line: 612, column: 18, scope: !607)
!607 = distinct !DILexicalBlock(scope: !71, file: !3, line: 612, column: 11)
!608 = !DILocation(line: 612, column: 11, scope: !71)
!609 = !DILocation(line: 620, column: 23, scope: !2)
!610 = !DILocation(line: 625, column: 39, scope: !2)
!611 = !DILocation(line: 626, column: 3, scope: !2)
!612 = !DILocation(line: 626, column: 10, scope: !2)
!613 = !DILocation(line: 626, column: 21, scope: !2)
!614 = !DILocation(line: 628, column: 44, scope: !615)
!615 = distinct !DILexicalBlock(scope: !616, file: !3, line: 628, column: 11)
!616 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!617 = !DILocation(line: 628, column: 32, scope: !615)
!618 = !DILocation(line: 628, column: 49, scope: !615)
!619 = !DILocation(line: 628, column: 11, scope: !616)
!620 = !DILocation(line: 630, column: 11, scope: !621)
!621 = distinct !DILexicalBlock(scope: !616, file: !3, line: 630, column: 11)
!622 = !DILocation(line: 630, column: 11, scope: !616)
!623 = !DILocation(line: 632, column: 26, scope: !624)
!624 = distinct !DILexicalBlock(scope: !625, file: !3, line: 632, column: 15)
!625 = distinct !DILexicalBlock(scope: !621, file: !3, line: 631, column: 9)
!626 = !DILocation(line: 632, column: 34, scope: !624)
!627 = !DILocation(line: 632, column: 37, scope: !624)
!628 = !DILocation(line: 632, column: 15, scope: !625)
!629 = !DILocation(line: 636, column: 29, scope: !630)
!630 = distinct !DILexicalBlock(scope: !625, file: !3, line: 636, column: 15)
!631 = !DILocation(line: 640, column: 16, scope: !616)
!632 = distinct !{!632, !611, !633, !537}
!633 = !DILocation(line: 641, column: 5, scope: !2)
!634 = !DILocation(line: 644, column: 3, scope: !2)
!635 = !DILocation(line: 0, scope: !520, inlinedAt: !636)
!636 = distinct !DILocation(line: 648, column: 31, scope: !2)
!637 = !DILocation(line: 0, scope: !520, inlinedAt: !638)
!638 = distinct !DILocation(line: 649, column: 31, scope: !2)
!639 = !DILocation(line: 0, scope: !520, inlinedAt: !640)
!640 = distinct !DILocation(line: 650, column: 31, scope: !2)
!641 = !DILocation(line: 0, scope: !520, inlinedAt: !642)
!642 = distinct !DILocation(line: 651, column: 31, scope: !2)
!643 = !DILocation(line: 0, scope: !520, inlinedAt: !644)
!644 = distinct !DILocation(line: 652, column: 31, scope: !2)
!645 = !DILocation(line: 0, scope: !520, inlinedAt: !646)
!646 = distinct !DILocation(line: 653, column: 31, scope: !2)
!647 = !DILocation(line: 0, scope: !520, inlinedAt: !648)
!648 = distinct !DILocation(line: 654, column: 31, scope: !2)
!649 = !DILocation(line: 0, scope: !520, inlinedAt: !650)
!650 = distinct !DILocation(line: 655, column: 31, scope: !2)
!651 = !DILocation(line: 0, scope: !520, inlinedAt: !652)
!652 = distinct !DILocation(line: 656, column: 31, scope: !2)
!653 = !DILocation(line: 0, scope: !520, inlinedAt: !654)
!654 = distinct !DILocation(line: 657, column: 31, scope: !2)
!655 = !DILocation(line: 663, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!657 = !DILocation(line: 664, column: 7, scope: !656)
!658 = !DILocation(line: 664, column: 10, scope: !656)
!659 = !DILocation(line: 663, column: 7, scope: !2)
!660 = !DILocation(line: 669, column: 7, scope: !661)
!661 = distinct !DILexicalBlock(scope: !656, file: !3, line: 665, column: 5)
!662 = !DILocation(line: 671, column: 5, scope: !661)
!663 = !DILocation(line: 676, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !656, file: !3, line: 673, column: 5)
!665 = !DILocation(line: 679, column: 3, scope: !2)
!666 = !DILocation(line: 683, column: 3, scope: !2)
!667 = !DILocation(line: 686, column: 3, scope: !2)
!668 = !DILocation(line: 688, column: 3, scope: !2)
!669 = !DILocation(line: 691, column: 3, scope: !2)
!670 = !DILocation(line: 695, column: 3, scope: !2)
!671 = !DILocation(line: 696, column: 1, scope: !2)
!672 = !DISubprogram(name: "setlocale", scope: !673, file: !673, line: 122, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!673 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!674 = !DISubroutineType(types: !675)
!675 = !{!58, !51, !6}
!676 = !DISubprogram(name: "fputs_unlocked", scope: !165, file: !165, line: 691, type: !677, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!677 = !DISubroutineType(types: !678)
!678 = !{!51, !679, !680}
!679 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!680 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!681 = !DISubprogram(name: "getenv", scope: !682, file: !682, line: 641, type: !683, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!682 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!683 = !DISubroutineType(types: !684)
!684 = !{!58, !6}
!685 = !DISubprogram(name: "fwrite_unlocked", scope: !165, file: !165, line: 704, type: !686, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!686 = !DISubroutineType(types: !687)
!687 = !{!53, !688, !53, !53, !680}
!688 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!691 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 117, type: !692, scopeLine: 118, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !694)
!692 = !DISubroutineType(types: !693)
!693 = !{!51, !51, !57}
!694 = !{!695, !696}
!695 = !DILocalVariable(name: "argc", arg: 1, scope: !691, file: !10, line: 117, type: !51)
!696 = !DILocalVariable(name: "argv", arg: 2, scope: !691, file: !10, line: 117, type: !57)
!697 = !DILocation(line: 0, scope: !691)
!698 = !DILocation(line: 120, column: 21, scope: !691)
!699 = !DILocation(line: 120, column: 3, scope: !691)
!700 = !DILocation(line: 121, column: 3, scope: !691)
!701 = !DILocation(line: 122, column: 3, scope: !691)
!702 = !DILocation(line: 123, column: 3, scope: !691)
!703 = !DILocation(line: 125, column: 3, scope: !691)
!704 = !DILocation(line: 128, column: 36, scope: !691)
!705 = !DILocation(line: 128, column: 58, scope: !691)
!706 = !DILocation(line: 127, column: 3, scope: !691)
!707 = !DILocation(line: 131, column: 18, scope: !691)
!708 = !DILocation(line: 131, column: 16, scope: !691)
!709 = !DILocation(line: 131, column: 3, scope: !691)
!710 = !DILocation(line: 134, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !691, file: !10, line: 132, column: 5)
!712 = !DILocation(line: 135, column: 7, scope: !711)
!713 = !DILocation(line: 138, column: 14, scope: !711)
!714 = !DILocation(line: 138, column: 7, scope: !711)
!715 = !DILocation(line: 139, column: 7, scope: !711)
!716 = !DILocation(line: 142, column: 7, scope: !711)
!717 = !DILocation(line: 143, column: 7, scope: !711)
!718 = !DILocation(line: 146, column: 3, scope: !691)
!719 = !DISubprogram(name: "bindtextdomain", scope: !560, file: !560, line: 86, type: !720, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!720 = !DISubroutineType(types: !721)
!721 = !{!58, !6, !6}
!722 = !DISubprogram(name: "textdomain", scope: !560, file: !560, line: 82, type: !683, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!723 = !DISubprogram(name: "atexit", scope: !682, file: !682, line: 602, type: !724, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!724 = !DISubroutineType(types: !725)
!725 = !{!51, !191}
!726 = distinct !DISubprogram(name: "users", scope: !10, file: !10, line: 82, type: !727, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !6, !51}
!729 = !{!730, !731, !732, !733}
!730 = !DILocalVariable(name: "filename", arg: 1, scope: !726, file: !10, line: 82, type: !6)
!731 = !DILocalVariable(name: "options", arg: 2, scope: !726, file: !10, line: 82, type: !51)
!732 = !DILocalVariable(name: "n_users", scope: !726, file: !10, line: 84, type: !427)
!733 = !DILocalVariable(name: "utmp_buf", scope: !726, file: !10, line: 85, type: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !13, line: 92, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !13, line: 65, size: 576, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !749, !752, !753, !754}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !736, file: !13, line: 69, baseType: !58, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !736, file: !13, line: 70, baseType: !58, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !736, file: !13, line: 71, baseType: !58, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !736, file: !13, line: 72, baseType: !58, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !736, file: !13, line: 74, baseType: !743, size: 128, offset: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !744, line: 11, size: 128, elements: !745)
!744 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !743, file: !744, line: 16, baseType: !391, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !743, file: !744, line: 21, baseType: !748, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !107, line: 197, baseType: !108)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !736, file: !13, line: 75, baseType: !750, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !751, line: 97, baseType: !372)
!751 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !736, file: !13, line: 76, baseType: !750, size: 32, offset: 416)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !736, file: !13, line: 77, baseType: !370, size: 16, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !736, file: !13, line: 79, baseType: !755, size: 64, offset: 480)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !13, line: 79, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !755, file: !13, line: 79, baseType: !51, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !755, file: !13, line: 79, baseType: !51, size: 32, offset: 32)
!759 = !DILocation(line: 0, scope: !726)
!760 = !DILocation(line: 84, column: 3, scope: !726)
!761 = !DILocation(line: 85, column: 3, scope: !726)
!762 = !DILocation(line: 86, column: 11, scope: !726)
!763 = !DILocation(line: 87, column: 7, scope: !764)
!764 = distinct !DILexicalBlock(scope: !726, file: !10, line: 87, column: 7)
!765 = !DILocation(line: 87, column: 58, scope: !764)
!766 = !DILocation(line: 87, column: 7, scope: !726)
!767 = !DILocation(line: 88, column: 5, scope: !764)
!768 = !DILocation(line: 90, column: 23, scope: !726)
!769 = !{!770, !770, i64 0}
!770 = !{!"long", !487, i64 0}
!771 = !DILocation(line: 90, column: 32, scope: !726)
!772 = !DILocalVariable(name: "n", arg: 1, scope: !773, file: !10, line: 45, type: !427)
!773 = distinct !DISubprogram(name: "list_entries_users", scope: !10, file: !10, line: 45, type: !774, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !778)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !427, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!778 = !{!772, !779, !780, !781, !782, !786, !788, !791}
!779 = !DILocalVariable(name: "this", arg: 2, scope: !773, file: !10, line: 45, type: !776)
!780 = !DILocalVariable(name: "u", scope: !773, file: !10, line: 47, type: !57)
!781 = !DILocalVariable(name: "n_entries", scope: !773, file: !10, line: 48, type: !427)
!782 = !DILocalVariable(name: "trimmed_name", scope: !783, file: !10, line: 54, type: !58)
!783 = distinct !DILexicalBlock(scope: !784, file: !10, line: 53, column: 9)
!784 = distinct !DILexicalBlock(scope: !785, file: !10, line: 52, column: 11)
!785 = distinct !DILexicalBlock(scope: !773, file: !10, line: 51, column: 5)
!786 = !DILocalVariable(name: "i", scope: !787, file: !10, line: 66, type: !427)
!787 = distinct !DILexicalBlock(scope: !773, file: !10, line: 66, column: 3)
!788 = !DILocalVariable(name: "c", scope: !789, file: !10, line: 68, type: !8)
!789 = distinct !DILexicalBlock(scope: !790, file: !10, line: 67, column: 5)
!790 = distinct !DILexicalBlock(scope: !787, file: !10, line: 66, column: 3)
!791 = !DILocalVariable(name: "i", scope: !792, file: !10, line: 73, type: !427)
!792 = distinct !DILexicalBlock(scope: !773, file: !10, line: 73, column: 3)
!793 = !DILocation(line: 0, scope: !773, inlinedAt: !794)
!794 = distinct !DILocation(line: 90, column: 3, scope: !726)
!795 = !DILocation(line: 47, column: 14, scope: !773, inlinedAt: !794)
!796 = !DILocation(line: 50, column: 3, scope: !773, inlinedAt: !794)
!797 = !DILocation(line: 64, column: 3, scope: !773, inlinedAt: !794)
!798 = !DILocation(line: 0, scope: !787, inlinedAt: !794)
!799 = !DILocation(line: 66, column: 3, scope: !787, inlinedAt: !794)
!800 = !DILocation(line: 50, column: 11, scope: !773, inlinedAt: !794)
!801 = !DILocation(line: 52, column: 11, scope: !784, inlinedAt: !794)
!802 = !{!803, !486, i64 0}
!803 = !{!"gl_utmp", !486, i64 0, !486, i64 8, !486, i64 16, !486, i64 24, !804, i64 32, !567, i64 48, !567, i64 52, !601, i64 56, !805, i64 60}
!804 = !{!"timespec", !770, i64 0, !770, i64 8}
!805 = !{!"", !567, i64 0, !567, i64 4}
!806 = !{!803, !601, i64 56}
!807 = !DILocation(line: 52, column: 11, scope: !785, inlinedAt: !794)
!808 = !DILocation(line: 56, column: 26, scope: !783, inlinedAt: !794)
!809 = !DILocation(line: 0, scope: !783, inlinedAt: !794)
!810 = !DILocation(line: 58, column: 11, scope: !783, inlinedAt: !794)
!811 = !DILocation(line: 58, column: 24, scope: !783, inlinedAt: !794)
!812 = !DILocation(line: 59, column: 11, scope: !783, inlinedAt: !794)
!813 = !DILocation(line: 60, column: 9, scope: !783, inlinedAt: !794)
!814 = !DILocation(line: 61, column: 11, scope: !785, inlinedAt: !794)
!815 = distinct !{!815, !796, !816, !537}
!816 = !DILocation(line: 62, column: 5, scope: !773, inlinedAt: !794)
!817 = !DILocation(line: 66, column: 23, scope: !790, inlinedAt: !794)
!818 = !DILocation(line: 68, column: 19, scope: !789, inlinedAt: !794)
!819 = !DILocation(line: 0, scope: !789, inlinedAt: !794)
!820 = !DILocation(line: 69, column: 7, scope: !789, inlinedAt: !794)
!821 = !DILocation(line: 70, column: 7, scope: !789, inlinedAt: !794)
!822 = !DILocalVariable(name: "__c", arg: 1, scope: !823, file: !824, line: 108, type: !51)
!823 = distinct !DISubprogram(name: "putchar_unlocked", scope: !824, file: !824, line: 108, type: !825, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !827)
!824 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!825 = !DISubroutineType(types: !826)
!826 = !{!51, !51}
!827 = !{!822}
!828 = !DILocation(line: 0, scope: !823, inlinedAt: !829)
!829 = distinct !DILocation(line: 70, column: 7, scope: !789, inlinedAt: !794)
!830 = !DILocation(line: 110, column: 10, scope: !823, inlinedAt: !829)
!831 = !{!832, !486, i64 40}
!832 = !{!"_IO_FILE", !567, i64 0, !486, i64 8, !486, i64 16, !486, i64 24, !486, i64 32, !486, i64 40, !486, i64 48, !486, i64 56, !486, i64 64, !486, i64 72, !486, i64 80, !486, i64 88, !486, i64 96, !486, i64 104, !567, i64 112, !567, i64 116, !770, i64 120, !601, i64 128, !487, i64 130, !487, i64 131, !486, i64 136, !770, i64 144, !486, i64 152, !486, i64 160, !486, i64 168, !486, i64 176, !770, i64 184, !567, i64 192, !487, i64 196}
!833 = !{!832, !486, i64 48}
!834 = !{!"branch_weights", i32 2000, i32 1}
!835 = !DILocation(line: 66, column: 37, scope: !790, inlinedAt: !794)
!836 = distinct !{!836, !799, !837, !537}
!837 = !DILocation(line: 71, column: 5, scope: !787, inlinedAt: !794)
!838 = !DILocation(line: 0, scope: !792, inlinedAt: !794)
!839 = !DILocation(line: 74, column: 11, scope: !840, inlinedAt: !794)
!840 = distinct !DILexicalBlock(scope: !792, file: !10, line: 73, column: 3)
!841 = !DILocation(line: 74, column: 5, scope: !840, inlinedAt: !794)
!842 = !DILocation(line: 73, column: 37, scope: !840, inlinedAt: !794)
!843 = !DILocation(line: 73, column: 23, scope: !840, inlinedAt: !794)
!844 = !DILocation(line: 73, column: 3, scope: !792, inlinedAt: !794)
!845 = distinct !{!845, !844, !846, !537}
!846 = !DILocation(line: 74, column: 15, scope: !792, inlinedAt: !794)
!847 = !DILocation(line: 75, column: 3, scope: !773, inlinedAt: !794)
!848 = !DILocation(line: 92, column: 9, scope: !726)
!849 = !DILocation(line: 92, column: 3, scope: !726)
!850 = !DILocation(line: 93, column: 1, scope: !726)
!851 = distinct !DISubprogram(name: "userid_compare", scope: !10, file: !10, line: 37, type: !852, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !854)
!852 = !DISubroutineType(types: !853)
!853 = !{!51, !689, !689}
!854 = !{!855, !856, !857, !858}
!855 = !DILocalVariable(name: "v_a", arg: 1, scope: !851, file: !10, line: 37, type: !689)
!856 = !DILocalVariable(name: "v_b", arg: 2, scope: !851, file: !10, line: 37, type: !689)
!857 = !DILocalVariable(name: "a", scope: !851, file: !10, line: 39, type: !57)
!858 = !DILocalVariable(name: "b", scope: !851, file: !10, line: 40, type: !57)
!859 = !DILocation(line: 0, scope: !851)
!860 = !DILocation(line: 39, column: 14, scope: !851)
!861 = !DILocation(line: 40, column: 14, scope: !851)
!862 = !DILocation(line: 41, column: 18, scope: !851)
!863 = !DILocation(line: 41, column: 22, scope: !851)
!864 = !DILocation(line: 41, column: 10, scope: !851)
!865 = !DILocation(line: 41, column: 3, scope: !851)
!866 = !DISubprogram(name: "qsort", scope: !682, file: !682, line: 838, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !50, !53, !53, !869}
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !682, line: 816, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!871 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !149, file: !149, line: 50, type: !496, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !872)
!872 = !{!873}
!873 = !DILocalVariable(name: "file", arg: 1, scope: !871, file: !149, line: 50, type: !6)
!874 = !DILocation(line: 0, scope: !871)
!875 = !DILocation(line: 52, column: 13, scope: !871)
!876 = !DILocation(line: 53, column: 1, scope: !871)
!877 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !149, file: !149, line: 87, type: !878, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !880)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !67}
!880 = !{!881}
!881 = !DILocalVariable(name: "ignore", arg: 1, scope: !877, file: !149, line: 87, type: !67)
!882 = !DILocation(line: 0, scope: !877)
!883 = !DILocation(line: 89, column: 16, scope: !877)
!884 = !{!885, !885, i64 0}
!885 = !{!"_Bool", !487, i64 0}
!886 = !DILocation(line: 90, column: 1, scope: !877)
!887 = distinct !DISubprogram(name: "close_stdout", scope: !149, file: !149, line: 116, type: !192, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !148, retainedNodes: !888)
!888 = !{!889}
!889 = !DILocalVariable(name: "write_error", scope: !890, file: !149, line: 121, type: !6)
!890 = distinct !DILexicalBlock(scope: !891, file: !149, line: 120, column: 5)
!891 = distinct !DILexicalBlock(scope: !887, file: !149, line: 118, column: 7)
!892 = !DILocation(line: 118, column: 21, scope: !891)
!893 = !DILocation(line: 118, column: 7, scope: !891)
!894 = !DILocation(line: 118, column: 29, scope: !891)
!895 = !DILocation(line: 119, column: 7, scope: !891)
!896 = !DILocation(line: 119, column: 12, scope: !891)
!897 = !{i8 0, i8 2}
!898 = !DILocation(line: 119, column: 25, scope: !891)
!899 = !DILocation(line: 119, column: 28, scope: !891)
!900 = !DILocation(line: 119, column: 34, scope: !891)
!901 = !DILocation(line: 118, column: 7, scope: !887)
!902 = !DILocation(line: 121, column: 33, scope: !890)
!903 = !DILocation(line: 0, scope: !890)
!904 = !DILocation(line: 122, column: 11, scope: !905)
!905 = distinct !DILexicalBlock(scope: !890, file: !149, line: 122, column: 11)
!906 = !DILocation(line: 0, scope: !905)
!907 = !DILocation(line: 122, column: 11, scope: !890)
!908 = !DILocation(line: 123, column: 9, scope: !905)
!909 = !DILocation(line: 126, column: 9, scope: !905)
!910 = !DILocation(line: 128, column: 14, scope: !890)
!911 = !DILocation(line: 128, column: 7, scope: !890)
!912 = !DILocation(line: 133, column: 42, scope: !913)
!913 = distinct !DILexicalBlock(scope: !887, file: !149, line: 133, column: 7)
!914 = !DILocation(line: 133, column: 28, scope: !913)
!915 = !DILocation(line: 133, column: 50, scope: !913)
!916 = !DILocation(line: 133, column: 7, scope: !887)
!917 = !DILocation(line: 134, column: 12, scope: !913)
!918 = !DILocation(line: 134, column: 5, scope: !913)
!919 = !DILocation(line: 135, column: 1, scope: !887)
!920 = distinct !DISubprogram(name: "verror", scope: !156, file: !156, line: 251, type: !921, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !51, !51, !6, !164}
!923 = !{!924, !925, !926, !927}
!924 = !DILocalVariable(name: "status", arg: 1, scope: !920, file: !156, line: 251, type: !51)
!925 = !DILocalVariable(name: "errnum", arg: 2, scope: !920, file: !156, line: 251, type: !51)
!926 = !DILocalVariable(name: "message", arg: 3, scope: !920, file: !156, line: 251, type: !6)
!927 = !DILocalVariable(name: "args", arg: 4, scope: !920, file: !156, line: 251, type: !164)
!928 = !DILocation(line: 0, scope: !920)
!929 = !DILocation(line: 251, column: 1, scope: !920)
!930 = !DILocation(line: 261, column: 3, scope: !920)
!931 = !DILocation(line: 265, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !920, file: !156, line: 265, column: 7)
!933 = !DILocation(line: 265, column: 7, scope: !920)
!934 = !DILocation(line: 266, column: 5, scope: !932)
!935 = !DILocation(line: 272, column: 7, scope: !936)
!936 = distinct !DILexicalBlock(scope: !932, file: !156, line: 268, column: 5)
!937 = !DILocation(line: 276, column: 3, scope: !920)
!938 = !{i64 0, i64 8, !485, i64 8, i64 8, !485, i64 16, i64 8, !485, i64 24, i64 4, !566, i64 28, i64 4, !566}
!939 = !DILocation(line: 282, column: 1, scope: !920)
!940 = distinct !DISubprogram(name: "flush_stdout", scope: !156, file: !156, line: 163, type: !192, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !941)
!941 = !{!942}
!942 = !DILocalVariable(name: "stdout_fd", scope: !940, file: !156, line: 166, type: !51)
!943 = !DILocation(line: 0, scope: !940)
!944 = !DILocalVariable(name: "fd", arg: 1, scope: !945, file: !156, line: 145, type: !51)
!945 = distinct !DISubprogram(name: "is_open", scope: !156, file: !156, line: 145, type: !825, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !946)
!946 = !{!944}
!947 = !DILocation(line: 0, scope: !945, inlinedAt: !948)
!948 = distinct !DILocation(line: 182, column: 25, scope: !949)
!949 = distinct !DILexicalBlock(scope: !940, file: !156, line: 182, column: 7)
!950 = !DILocation(line: 157, column: 15, scope: !945, inlinedAt: !948)
!951 = !DILocation(line: 182, column: 25, scope: !949)
!952 = !DILocation(line: 182, column: 7, scope: !940)
!953 = !DILocation(line: 184, column: 5, scope: !949)
!954 = !DILocation(line: 185, column: 1, scope: !940)
!955 = distinct !DISubprogram(name: "error_tail", scope: !156, file: !156, line: 219, type: !921, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !956)
!956 = !{!957, !958, !959, !960}
!957 = !DILocalVariable(name: "status", arg: 1, scope: !955, file: !156, line: 219, type: !51)
!958 = !DILocalVariable(name: "errnum", arg: 2, scope: !955, file: !156, line: 219, type: !51)
!959 = !DILocalVariable(name: "message", arg: 3, scope: !955, file: !156, line: 219, type: !6)
!960 = !DILocalVariable(name: "args", arg: 4, scope: !955, file: !156, line: 219, type: !164)
!961 = !DILocation(line: 0, scope: !955)
!962 = !DILocation(line: 219, column: 1, scope: !955)
!963 = !DILocation(line: 229, column: 13, scope: !955)
!964 = !DILocation(line: 229, column: 3, scope: !955)
!965 = !DILocalVariable(name: "__stream", arg: 1, scope: !966, file: !967, line: 132, type: !970)
!966 = distinct !DISubprogram(name: "vfprintf", scope: !967, file: !967, line: 132, type: !968, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !1005)
!967 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!968 = !DISubroutineType(types: !969)
!969 = !{!51, !970, !679, !166}
!970 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !973, file: !84, line: 51, baseType: !51, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !973, file: !84, line: 54, baseType: !58, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !973, file: !84, line: 55, baseType: !58, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !973, file: !84, line: 56, baseType: !58, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !973, file: !84, line: 57, baseType: !58, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !973, file: !84, line: 58, baseType: !58, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !973, file: !84, line: 59, baseType: !58, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !973, file: !84, line: 60, baseType: !58, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !973, file: !84, line: 61, baseType: !58, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !973, file: !84, line: 64, baseType: !58, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !973, file: !84, line: 65, baseType: !58, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !973, file: !84, line: 66, baseType: !58, size: 64, offset: 704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !973, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !973, file: !84, line: 70, baseType: !989, size: 64, offset: 832)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !973, file: !84, line: 72, baseType: !51, size: 32, offset: 896)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !973, file: !84, line: 73, baseType: !51, size: 32, offset: 928)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !973, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !973, file: !84, line: 77, baseType: !52, size: 16, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !973, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !973, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !973, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !973, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !973, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !973, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !973, file: !84, line: 93, baseType: !989, size: 64, offset: 1344)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !973, file: !84, line: 94, baseType: !50, size: 64, offset: 1408)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !973, file: !84, line: 95, baseType: !53, size: 64, offset: 1472)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !973, file: !84, line: 96, baseType: !51, size: 32, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !973, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!1005 = !{!965, !1006, !1007}
!1006 = !DILocalVariable(name: "__fmt", arg: 2, scope: !966, file: !967, line: 133, type: !679)
!1007 = !DILocalVariable(name: "__ap", arg: 3, scope: !966, file: !967, line: 133, type: !166)
!1008 = !DILocation(line: 0, scope: !966, inlinedAt: !1009)
!1009 = distinct !DILocation(line: 229, column: 3, scope: !955)
!1010 = !DILocation(line: 135, column: 10, scope: !966, inlinedAt: !1009)
!1011 = !{!1012, !1014}
!1012 = distinct !{!1012, !1013, !"vfprintf.inline: argument 0"}
!1013 = distinct !{!1013, !"vfprintf.inline"}
!1014 = distinct !{!1014, !1013, !"vfprintf.inline: argument 1"}
!1015 = !DILocation(line: 232, column: 3, scope: !955)
!1016 = !DILocation(line: 233, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !955, file: !156, line: 233, column: 7)
!1018 = !DILocation(line: 233, column: 7, scope: !955)
!1019 = !DILocalVariable(name: "errnum", arg: 1, scope: !1020, file: !156, line: 188, type: !51)
!1020 = distinct !DISubprogram(name: "print_errno_message", scope: !156, file: !156, line: 188, type: !475, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !1021)
!1021 = !{!1019, !1022, !1023}
!1022 = !DILocalVariable(name: "s", scope: !1020, file: !156, line: 190, type: !6)
!1023 = !DILocalVariable(name: "errbuf", scope: !1020, file: !156, line: 193, type: !1024)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 1024)
!1027 = !DILocation(line: 0, scope: !1020, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 234, column: 5, scope: !1017)
!1029 = !DILocation(line: 193, column: 3, scope: !1020, inlinedAt: !1028)
!1030 = !DILocation(line: 193, column: 8, scope: !1020, inlinedAt: !1028)
!1031 = !DILocation(line: 195, column: 7, scope: !1020, inlinedAt: !1028)
!1032 = !DILocation(line: 207, column: 9, scope: !1033, inlinedAt: !1028)
!1033 = distinct !DILexicalBlock(scope: !1020, file: !156, line: 207, column: 7)
!1034 = !DILocation(line: 207, column: 7, scope: !1020, inlinedAt: !1028)
!1035 = !DILocation(line: 208, column: 9, scope: !1033, inlinedAt: !1028)
!1036 = !DILocation(line: 208, column: 5, scope: !1033, inlinedAt: !1028)
!1037 = !DILocation(line: 214, column: 3, scope: !1020, inlinedAt: !1028)
!1038 = !DILocation(line: 216, column: 1, scope: !1020, inlinedAt: !1028)
!1039 = !DILocation(line: 234, column: 5, scope: !1017)
!1040 = !DILocation(line: 238, column: 3, scope: !955)
!1041 = !DILocalVariable(name: "__c", arg: 1, scope: !1042, file: !824, line: 101, type: !51)
!1042 = distinct !DISubprogram(name: "putc_unlocked", scope: !824, file: !824, line: 101, type: !1043, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !1045)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!51, !51, !971}
!1045 = !{!1041, !1046}
!1046 = !DILocalVariable(name: "__stream", arg: 2, scope: !1042, file: !824, line: 101, type: !971)
!1047 = !DILocation(line: 0, scope: !1042, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 238, column: 3, scope: !955)
!1049 = !DILocation(line: 103, column: 10, scope: !1042, inlinedAt: !1048)
!1050 = !DILocation(line: 240, column: 3, scope: !955)
!1051 = !DILocation(line: 241, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !955, file: !156, line: 241, column: 7)
!1053 = !DILocation(line: 241, column: 7, scope: !955)
!1054 = !DILocation(line: 242, column: 5, scope: !1052)
!1055 = !DILocation(line: 243, column: 1, scope: !955)
!1056 = !DISubprogram(name: "strerror_r", scope: !1057, file: !1057, line: 444, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!1057 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!58, !51, !58, !53}
!1060 = !DISubprogram(name: "fflush_unlocked", scope: !165, file: !165, line: 239, type: !1061, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!51, !971}
!1063 = !DISubprogram(name: "fcntl", scope: !1064, file: !1064, line: 149, type: !1065, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !563)
!1064 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!51, !51, !51, null}
!1067 = distinct !DISubprogram(name: "error", scope: !156, file: !156, line: 285, type: !1068, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !1070)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !51, !51, !6, null}
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DILocalVariable(name: "status", arg: 1, scope: !1067, file: !156, line: 285, type: !51)
!1072 = !DILocalVariable(name: "errnum", arg: 2, scope: !1067, file: !156, line: 285, type: !51)
!1073 = !DILocalVariable(name: "message", arg: 3, scope: !1067, file: !156, line: 285, type: !6)
!1074 = !DILocalVariable(name: "ap", scope: !1067, file: !156, line: 287, type: !164)
!1075 = !DILocation(line: 0, scope: !1067)
!1076 = !DILocation(line: 287, column: 3, scope: !1067)
!1077 = !DILocation(line: 287, column: 11, scope: !1067)
!1078 = !DILocation(line: 288, column: 3, scope: !1067)
!1079 = !DILocation(line: 289, column: 3, scope: !1067)
!1080 = !DILocation(line: 290, column: 3, scope: !1067)
!1081 = !DILocation(line: 291, column: 1, scope: !1067)
!1082 = !DILocation(line: 0, scope: !161)
!1083 = !DILocation(line: 298, column: 1, scope: !161)
!1084 = !DILocation(line: 302, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !161, file: !156, line: 302, column: 7)
!1086 = !DILocation(line: 302, column: 7, scope: !161)
!1087 = !DILocation(line: 307, column: 11, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !156, line: 307, column: 11)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !156, line: 303, column: 5)
!1090 = !DILocation(line: 307, column: 27, scope: !1088)
!1091 = !DILocation(line: 308, column: 11, scope: !1088)
!1092 = !DILocation(line: 308, column: 28, scope: !1088)
!1093 = !DILocation(line: 308, column: 25, scope: !1088)
!1094 = !DILocation(line: 309, column: 15, scope: !1088)
!1095 = !DILocation(line: 309, column: 33, scope: !1088)
!1096 = !DILocation(line: 310, column: 19, scope: !1088)
!1097 = !DILocation(line: 311, column: 22, scope: !1088)
!1098 = !DILocation(line: 311, column: 56, scope: !1088)
!1099 = !DILocation(line: 307, column: 11, scope: !1089)
!1100 = !DILocation(line: 316, column: 21, scope: !1089)
!1101 = !DILocation(line: 317, column: 23, scope: !1089)
!1102 = !DILocation(line: 318, column: 5, scope: !1089)
!1103 = !DILocation(line: 327, column: 3, scope: !161)
!1104 = !DILocation(line: 331, column: 7, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !161, file: !156, line: 331, column: 7)
!1106 = !DILocation(line: 331, column: 7, scope: !161)
!1107 = !DILocation(line: 332, column: 5, scope: !1105)
!1108 = !DILocation(line: 338, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1105, file: !156, line: 334, column: 5)
!1110 = !DILocation(line: 346, column: 3, scope: !161)
!1111 = !DILocation(line: 350, column: 3, scope: !161)
!1112 = !DILocation(line: 356, column: 1, scope: !161)
!1113 = distinct !DISubprogram(name: "error_at_line", scope: !156, file: !156, line: 359, type: !1114, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !155, retainedNodes: !1116)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{null, !51, !51, !6, !14, !6, null}
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122}
!1117 = !DILocalVariable(name: "status", arg: 1, scope: !1113, file: !156, line: 359, type: !51)
!1118 = !DILocalVariable(name: "errnum", arg: 2, scope: !1113, file: !156, line: 359, type: !51)
!1119 = !DILocalVariable(name: "file_name", arg: 3, scope: !1113, file: !156, line: 359, type: !6)
!1120 = !DILocalVariable(name: "line_number", arg: 4, scope: !1113, file: !156, line: 360, type: !14)
!1121 = !DILocalVariable(name: "message", arg: 5, scope: !1113, file: !156, line: 360, type: !6)
!1122 = !DILocalVariable(name: "ap", scope: !1113, file: !156, line: 362, type: !164)
!1123 = !DILocation(line: 0, scope: !1113)
!1124 = !DILocation(line: 362, column: 3, scope: !1113)
!1125 = !DILocation(line: 362, column: 11, scope: !1113)
!1126 = !DILocation(line: 363, column: 3, scope: !1113)
!1127 = !DILocation(line: 364, column: 3, scope: !1113)
!1128 = !DILocation(line: 366, column: 3, scope: !1113)
!1129 = !DILocation(line: 367, column: 1, scope: !1113)
!1130 = distinct !DISubprogram(name: "getprogname", scope: !359, file: !359, line: 54, type: !1131, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !358, retainedNodes: !563)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!6}
!1133 = !DILocation(line: 58, column: 10, scope: !1130)
!1134 = !DILocation(line: 58, column: 3, scope: !1130)
!1135 = distinct !DISubprogram(name: "parse_long_options", scope: !197, file: !197, line: 45, type: !1136, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !196, retainedNodes: !1139)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !51, !57, !6, !6, !6, !1138, null}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1150}
!1140 = !DILocalVariable(name: "argc", arg: 1, scope: !1135, file: !197, line: 45, type: !51)
!1141 = !DILocalVariable(name: "argv", arg: 2, scope: !1135, file: !197, line: 46, type: !57)
!1142 = !DILocalVariable(name: "command_name", arg: 3, scope: !1135, file: !197, line: 47, type: !6)
!1143 = !DILocalVariable(name: "package", arg: 4, scope: !1135, file: !197, line: 48, type: !6)
!1144 = !DILocalVariable(name: "version", arg: 5, scope: !1135, file: !197, line: 49, type: !6)
!1145 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1135, file: !197, line: 50, type: !1138)
!1146 = !DILocalVariable(name: "saved_opterr", scope: !1135, file: !197, line: 53, type: !51)
!1147 = !DILocalVariable(name: "c", scope: !1148, file: !197, line: 60, type: !51)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !197, line: 59, column: 5)
!1149 = distinct !DILexicalBlock(scope: !1135, file: !197, line: 58, column: 7)
!1150 = !DILocalVariable(name: "authors", scope: !1151, file: !197, line: 71, type: !1155)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !197, line: 70, column: 15)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !197, line: 64, column: 13)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !197, line: 62, column: 9)
!1154 = distinct !DILexicalBlock(scope: !1148, file: !197, line: 61, column: 11)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !165, line: 52, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !167, line: 32, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1158, baseType: !1159)
!1158 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !171, size: 256, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1159, file: !1158, line: 71, baseType: !50, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1159, file: !1158, line: 71, baseType: !50, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1159, file: !1158, line: 71, baseType: !50, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1159, file: !1158, line: 71, baseType: !51, size: 32, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1159, file: !1158, line: 71, baseType: !51, size: 32, offset: 224)
!1166 = !DILocation(line: 0, scope: !1135)
!1167 = !DILocation(line: 53, column: 22, scope: !1135)
!1168 = !DILocation(line: 56, column: 10, scope: !1135)
!1169 = !DILocation(line: 58, column: 12, scope: !1149)
!1170 = !DILocation(line: 58, column: 7, scope: !1135)
!1171 = !DILocation(line: 60, column: 15, scope: !1148)
!1172 = !DILocation(line: 0, scope: !1148)
!1173 = !DILocation(line: 61, column: 11, scope: !1148)
!1174 = !DILocation(line: 66, column: 15, scope: !1152)
!1175 = !DILocation(line: 67, column: 15, scope: !1152)
!1176 = !DILocation(line: 71, column: 17, scope: !1151)
!1177 = !DILocation(line: 71, column: 25, scope: !1151)
!1178 = !DILocation(line: 72, column: 17, scope: !1151)
!1179 = !DILocation(line: 73, column: 33, scope: !1151)
!1180 = !DILocation(line: 73, column: 17, scope: !1151)
!1181 = !DILocation(line: 74, column: 17, scope: !1151)
