; ModuleID = 'src/wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.Tokens = type { i64, i8**, i64*, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }

!22 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!24 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!25 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!26 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!27 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!28 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!29 = !DIEnumerator(name: "c_quoting_style", value: 5)
!30 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!31 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!32 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!33 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!34 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "total_type", file: !3, line: 119, baseType: !7, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "total_auto", value: 0)
!38 = !DIEnumerator(name: "total_always", value: 1)
!39 = !DIEnumerator(name: "total_only", value: 2)
!40 = !DIEnumerator(name: "total_never", value: 3)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !42, line: 34, baseType: !7, size: 32, elements: !43)
!42 = !DIFile(filename: "./lib/argv-iter.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bca66fd38704bf57eca45a83894fca25")
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "AI_ERR_OK", value: 1)
!45 = !DIEnumerator(name: "AI_ERR_EOF", value: 2)
!46 = !DIEnumerator(name: "AI_ERR_MEM", value: 3)
!47 = !DIEnumerator(name: "AI_ERR_READ", value: 4)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 44, baseType: !7, size: 32, elements: !50)
!49 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!52 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!53 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!54 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!55 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!56 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 79, baseType: !7, size: 32, elements: !59)
!58 = !DIFile(filename: "src/ioblksize.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f13fda6387359f0e51e261e99a350a45")
!59 = !{!60}
!60 = !DIEnumerator(name: "IO_BUFSIZE", value: 262144)
!61 = !{!62, !63, !65, !67, !68, !69, !72, !74, !75}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!71 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!76 = !{!77, !274, !279, !281, !283, !288, !290, !292, !294, !296, !298, !300, !302, !306, !308, !310, !312, !314, !316, !318, !0, !320, !322, !353, !367, !373, !379, !381, !415}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "stdin_only", scope: !79, file: !3, line: 921, type: !273, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 792, type: !80, scopeLine: 793, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !83)
!80 = !DISubroutineType(types: !81)
!81 = !{!67, !67, !82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!83 = !{!84, !85, !86, !87, !92, !93, !94, !139, !199, !202, !205, !206, !209, !264, !265, !266, !267, !268, !270}
!84 = !DILocalVariable(name: "argc", arg: 1, scope: !79, file: !3, line: 792, type: !67)
!85 = !DILocalVariable(name: "argv", arg: 2, scope: !79, file: !3, line: 792, type: !82)
!86 = !DILocalVariable(name: "optc", scope: !79, file: !3, line: 794, type: !67)
!87 = !DILocalVariable(name: "nfiles", scope: !79, file: !3, line: 795, type: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !89, line: 130, baseType: !90)
!89 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !70, line: 35, baseType: !91)
!91 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!92 = !DILocalVariable(name: "files", scope: !79, file: !3, line: 796, type: !82)
!93 = !DILocalVariable(name: "files_from", scope: !79, file: !3, line: 797, type: !65)
!94 = !DILocalVariable(name: "fstatus", scope: !79, file: !3, line: 798, type: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 85, size: 1088, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !96, file: !3, line: 89, baseType: !67, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !96, file: !3, line: 92, baseType: !100, size: 1024, offset: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !101, line: 44, size: 1024, elements: !102)
!101 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!102 = !{!103, !106, !108, !110, !112, !114, !116, !117, !118, !120, !122, !123, !125, !133, !134, !135}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !100, file: !101, line: 46, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !105, line: 145, baseType: !71)
!105 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !100, file: !101, line: 47, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !105, line: 148, baseType: !71)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !100, file: !101, line: 48, baseType: !109, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !105, line: 150, baseType: !7)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !100, file: !101, line: 49, baseType: !111, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !105, line: 151, baseType: !7)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !100, file: !101, line: 50, baseType: !113, size: 32, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !105, line: 146, baseType: !7)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !100, file: !101, line: 51, baseType: !115, size: 32, offset: 224)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !105, line: 147, baseType: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !100, file: !101, line: 52, baseType: !104, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !100, file: !101, line: 53, baseType: !104, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !100, file: !101, line: 54, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 152, baseType: !91)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !100, file: !101, line: 55, baseType: !121, size: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !105, line: 175, baseType: !67)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !100, file: !101, line: 56, baseType: !67, size: 32, offset: 480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !100, file: !101, line: 57, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !105, line: 180, baseType: !91)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !100, file: !101, line: 65, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !105, line: 160, baseType: !91)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !105, line: 197, baseType: !91)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !100, file: !101, line: 66, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !100, file: !101, line: 67, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !100, file: !101, line: 79, baseType: !136, size: 64, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 2)
!139 = !DILocalVariable(name: "tok", scope: !79, file: !3, line: 799, type: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !141, line: 32, size: 2304, elements: !142)
!141 = !DIFile(filename: "./lib/readtokens0.h", directory: "/src", checksumkind: CSK_MD5, checksum: "bcc2e7cb98b6844cbfd13d7bab31a60d")
!142 = !{!143, !144, !145, !147, !197, !198}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !140, file: !141, line: 34, baseType: !69, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !140, file: !141, line: 35, baseType: !82, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !140, file: !141, line: 36, baseType: !146, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !140, file: !141, line: 37, baseType: !148, size: 704, offset: 192)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !149, line: 210, size: 704, elements: !150)
!149 = !DIFile(filename: "./lib/obstack.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8dc5712d9cd0944565da172aee39448c")
!150 = !{!151, !152, !162, !163, !164, !165, !170, !171, !182, !193, !194, !195, !196}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !148, file: !149, line: 212, baseType: !69, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !148, file: !149, line: 213, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !149, line: 203, size: 128, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !154, file: !149, line: 205, baseType: !65, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !149, line: 206, baseType: !153, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !154, file: !149, line: 207, baseType: !159, offset: 128)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: -1)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !148, file: !149, line: 214, baseType: !65, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !148, file: !149, line: 215, baseType: !65, size: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !148, file: !149, line: 216, baseType: !65, size: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !148, file: !149, line: 221, baseType: !166, size: 64, offset: 320)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !149, line: 217, size: 64, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tempint", scope: !166, file: !149, line: 219, baseType: !69, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tempptr", scope: !166, file: !149, line: 220, baseType: !62, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !148, file: !149, line: 222, baseType: !69, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !148, file: !149, line: 229, baseType: !172, size: 64, offset: 448)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !149, line: 225, size: 64, elements: !173)
!173 = !{!174, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !172, file: !149, line: 227, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!62, !69}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !172, file: !149, line: 228, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!62, !62, !69}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !148, file: !149, line: 234, baseType: !183, size: 64, offset: 512)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !149, line: 230, size: 64, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !183, file: !149, line: 232, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !62}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !183, file: !149, line: 233, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !62, !62}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !148, file: !149, line: 236, baseType: !62, size: 64, offset: 576)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !148, file: !149, line: 237, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !148, file: !149, line: 238, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !148, file: !149, line: 242, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !140, file: !141, line: 38, baseType: !148, size: 704, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !140, file: !141, line: 39, baseType: !148, size: 704, offset: 1600)
!199 = !DILocalVariable(name: "i", scope: !200, file: !3, line: 864, type: !67)
!200 = distinct !DILexicalBlock(scope: !201, file: !3, line: 864, column: 5)
!201 = distinct !DILexicalBlock(scope: !79, file: !3, line: 863, column: 7)
!202 = !DILocalVariable(name: "i", scope: !203, file: !3, line: 867, type: !67)
!203 = distinct !DILexicalBlock(scope: !204, file: !3, line: 867, column: 5)
!204 = distinct !DILexicalBlock(scope: !79, file: !3, line: 866, column: 7)
!205 = !DILocalVariable(name: "read_tokens", scope: !79, file: !3, line: 870, type: !75)
!206 = !DILocalVariable(name: "ai", scope: !79, file: !3, line: 871, type: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !42, line: 32, flags: DIFlagFwdDecl)
!209 = !DILocalVariable(name: "stream", scope: !210, file: !3, line: 874, type: !212)
!210 = distinct !DILexicalBlock(scope: !211, file: !3, line: 873, column: 5)
!211 = distinct !DILexicalBlock(scope: !79, file: !3, line: 872, column: 7)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !214, line: 7, baseType: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !216, line: 49, size: 1728, elements: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !233, !235, !236, !237, !238, !239, !241, !245, !248, !250, !253, !256, !257, !258, !259, !260}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !215, file: !216, line: 51, baseType: !67, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !215, file: !216, line: 54, baseType: !65, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !215, file: !216, line: 55, baseType: !65, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !215, file: !216, line: 56, baseType: !65, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !215, file: !216, line: 57, baseType: !65, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !215, file: !216, line: 58, baseType: !65, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !215, file: !216, line: 59, baseType: !65, size: 64, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !215, file: !216, line: 60, baseType: !65, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !215, file: !216, line: 61, baseType: !65, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !215, file: !216, line: 64, baseType: !65, size: 64, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !215, file: !216, line: 65, baseType: !65, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !215, file: !216, line: 66, baseType: !65, size: 64, offset: 704)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !215, file: !216, line: 68, baseType: !231, size: 64, offset: 768)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !216, line: 36, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !215, file: !216, line: 70, baseType: !234, size: 64, offset: 832)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !215, file: !216, line: 72, baseType: !67, size: 32, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !215, file: !216, line: 73, baseType: !67, size: 32, offset: 928)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !215, file: !216, line: 74, baseType: !119, size: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !215, file: !216, line: 77, baseType: !68, size: 16, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !215, file: !216, line: 78, baseType: !240, size: 8, offset: 1040)
!240 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !215, file: !216, line: 79, baseType: !242, size: 8, offset: 1048)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 8, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 1)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !215, file: !216, line: 81, baseType: !246, size: 64, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !216, line: 43, baseType: null)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !215, file: !216, line: 89, baseType: !249, size: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 153, baseType: !91)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !215, file: !216, line: 91, baseType: !251, size: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !216, line: 37, flags: DIFlagFwdDecl)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !215, file: !216, line: 92, baseType: !254, size: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !216, line: 38, flags: DIFlagFwdDecl)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !215, file: !216, line: 93, baseType: !234, size: 64, offset: 1344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !215, file: !216, line: 94, baseType: !62, size: 64, offset: 1408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !215, file: !216, line: 95, baseType: !69, size: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !215, file: !216, line: 96, baseType: !67, size: 32, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !215, file: !216, line: 98, baseType: !261, size: 160, offset: 1568)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 160, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 20)
!264 = !DILocalVariable(name: "st", scope: !210, file: !3, line: 898, type: !100)
!265 = !DILocalVariable(name: "ok", scope: !79, file: !3, line: 936, type: !75)
!266 = !DILocalVariable(name: "ai_err", scope: !79, file: !3, line: 937, type: !41)
!267 = !DILocalVariable(name: "file_name", scope: !79, file: !3, line: 938, type: !65)
!268 = !DILocalVariable(name: "i", scope: !269, file: !3, line: 939, type: !67)
!269 = distinct !DILexicalBlock(scope: !79, file: !3, line: 939, column: 3)
!270 = !DILocalVariable(name: "skip_file", scope: !271, file: !3, line: 941, type: !75)
!271 = distinct !DILexicalBlock(scope: !272, file: !3, line: 940, column: 5)
!272 = distinct !DILexicalBlock(scope: !269, file: !3, line: 939, column: 3)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 64, elements: !243)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "wc_isprint", scope: !2, file: !3, line: 51, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "wc_isspace", scope: !2, file: !3, line: 52, type: !276, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "debug", scope: !2, file: !3, line: 54, type: !75, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !285, isLocal: true, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !286, line: 102, baseType: !287)
!286 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !105, line: 73, baseType: !71)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !285, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !285, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "total_lines_overflow", scope: !2, file: !3, line: 62, type: !75, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "total_words_overflow", scope: !2, file: !3, line: 63, type: !75, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "total_chars_overflow", scope: !2, file: !3, line: 64, type: !75, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "total_bytes_overflow", scope: !2, file: !3, line: 65, type: !75, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 66, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !286, line: 101, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !105, line: 72, baseType: !91)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 69, type: !75, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 69, type: !75, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 69, type: !75, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 69, type: !75, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 70, type: !75, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 73, type: !67, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 76, type: !75, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !2, file: !3, line: 82, type: !75, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !324, file: !325, line: 575, type: !67, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "oputs_", scope: !325, file: !325, line: 573, type: !326, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!325 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!326 = !DISubroutineType(types: !327)
!327 = !{null, !72, !72}
!328 = !{!329, !330, !331, !334, !335, !336, !337, !341, !342, !343, !344, !346, !347, !348, !349, !351, !352}
!329 = !DILocalVariable(name: "program", arg: 1, scope: !324, file: !325, line: 573, type: !72)
!330 = !DILocalVariable(name: "option", arg: 2, scope: !324, file: !325, line: 573, type: !72)
!331 = !DILocalVariable(name: "term", scope: !332, file: !325, line: 585, type: !72)
!332 = distinct !DILexicalBlock(scope: !333, file: !325, line: 582, column: 5)
!333 = distinct !DILexicalBlock(scope: !324, file: !325, line: 581, column: 7)
!334 = !DILocalVariable(name: "double_space", scope: !324, file: !325, line: 594, type: !75)
!335 = !DILocalVariable(name: "first_word", scope: !324, file: !325, line: 595, type: !72)
!336 = !DILocalVariable(name: "option_text", scope: !324, file: !325, line: 596, type: !72)
!337 = !DILocalVariable(name: "s", scope: !338, file: !325, line: 608, type: !72)
!338 = distinct !DILexicalBlock(scope: !339, file: !325, line: 605, column: 5)
!339 = distinct !DILexicalBlock(scope: !340, file: !325, line: 604, column: 12)
!340 = distinct !DILexicalBlock(scope: !324, file: !325, line: 597, column: 7)
!341 = !DILocalVariable(name: "spaces", scope: !338, file: !325, line: 609, type: !69)
!342 = !DILocalVariable(name: "anchor_len", scope: !324, file: !325, line: 620, type: !69)
!343 = !DILocalVariable(name: "desc_text", scope: !324, file: !325, line: 625, type: !72)
!344 = !DILocalVariable(name: "__ptr", scope: !345, file: !325, line: 644, type: !72)
!345 = distinct !DILexicalBlock(scope: !324, file: !325, line: 644, column: 3)
!346 = !DILocalVariable(name: "__stream", scope: !345, file: !325, line: 644, type: !212)
!347 = !DILocalVariable(name: "__cnt", scope: !345, file: !325, line: 644, type: !69)
!348 = !DILocalVariable(name: "url_program", scope: !324, file: !325, line: 648, type: !72)
!349 = !DILocalVariable(name: "__ptr", scope: !350, file: !325, line: 686, type: !72)
!350 = distinct !DILexicalBlock(scope: !324, file: !325, line: 686, column: 3)
!351 = !DILocalVariable(name: "__stream", scope: !350, file: !325, line: 686, type: !212)
!352 = !DILocalVariable(name: "__cnt", scope: !350, file: !325, line: 686, type: !69)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 104, type: !355, isLocal: true, isDefinition: true)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 2816, elements: !365)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !358, line: 50, size: 256, elements: !359)
!358 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!359 = !{!360, !361, !362, !364}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !358, line: 52, baseType: !72, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !357, file: !358, line: 55, baseType: !67, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !357, file: !358, line: 56, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !357, file: !358, line: 57, baseType: !67, size: 32, offset: 192)
!365 = !{!366}
!366 = !DISubrange(count: 11)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "total_types", scope: !2, file: !3, line: 130, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 128, elements: !371)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!371 = !{!372}
!372 = !DISubrange(count: 4)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "total_args", scope: !2, file: !3, line: 126, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 320, elements: !377)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!377 = !{!378}
!378 = !DISubrange(count: 5)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "total_mode", scope: !2, file: !3, line: 135, type: !35, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "use_neon", scope: !383, file: !3, line: 322, type: !240, isLocal: true, isDefinition: true)
!383 = distinct !DISubprogram(name: "wc_lines", scope: !3, file: !3, line: 305, type: !384, scopeLine: 306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !392)
!384 = !DISubroutineType(types: !385)
!385 = !{!386, !67}
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wc_lines", file: !387, line: 2, size: 192, elements: !388)
!387 = !DIFile(filename: "src/wc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f73f6c91eb8849cde32b7f2c7fc10330")
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !386, file: !387, line: 2, baseType: !67, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !386, file: !387, line: 2, baseType: !304, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !386, file: !387, line: 2, baseType: !304, size: 64, offset: 128)
!392 = !{!393, !394, !395, !396, !397, !402, !406, !407, !408, !412}
!393 = !DILocalVariable(name: "fd", arg: 1, scope: !383, file: !3, line: 305, type: !67)
!394 = !DILocalVariable(name: "lines", scope: !383, file: !3, line: 329, type: !304)
!395 = !DILocalVariable(name: "bytes", scope: !383, file: !3, line: 329, type: !304)
!396 = !DILocalVariable(name: "long_lines", scope: !383, file: !3, line: 330, type: !75)
!397 = !DILocalVariable(name: "buf", scope: !398, file: !3, line: 334, type: !399)
!398 = distinct !DILexicalBlock(scope: !383, file: !3, line: 333, column: 5)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2097160, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 262145)
!402 = !DILocalVariable(name: "bytes_read", scope: !398, file: !3, line: 335, type: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !404, line: 77, baseType: !405)
!404 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !105, line: 194, baseType: !91)
!406 = !DILocalVariable(name: "end", scope: !398, file: !3, line: 340, type: !65)
!407 = !DILocalVariable(name: "buflines", scope: !398, file: !3, line: 341, type: !88)
!408 = !DILocalVariable(name: "p", scope: !409, file: !3, line: 346, type: !65)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 346, column: 11)
!410 = distinct !DILexicalBlock(scope: !411, file: !3, line: 344, column: 9)
!411 = distinct !DILexicalBlock(scope: !398, file: !3, line: 343, column: 11)
!412 = !DILocalVariable(name: "p", scope: !413, file: !3, line: 353, type: !65)
!413 = distinct !DILexicalBlock(scope: !414, file: !3, line: 353, column: 11)
!414 = distinct !DILexicalBlock(scope: !411, file: !3, line: 350, column: 9)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !417, file: !3, line: 268, type: !432, isLocal: true, isDefinition: true)
!417 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 261, type: !418, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !285, !285, !285, !285, !304, !72}
!420 = !{!421, !422, !423, !424, !425, !426, !427, !428}
!421 = !DILocalVariable(name: "lines", arg: 1, scope: !417, file: !3, line: 261, type: !285)
!422 = !DILocalVariable(name: "words", arg: 2, scope: !417, file: !3, line: 262, type: !285)
!423 = !DILocalVariable(name: "chars", arg: 3, scope: !417, file: !3, line: 263, type: !285)
!424 = !DILocalVariable(name: "bytes", arg: 4, scope: !417, file: !3, line: 264, type: !285)
!425 = !DILocalVariable(name: "linelength", arg: 5, scope: !417, file: !3, line: 265, type: !304)
!426 = !DILocalVariable(name: "file", arg: 6, scope: !417, file: !3, line: 266, type: !72)
!427 = !DILocalVariable(name: "format_int", scope: !417, file: !3, line: 269, type: !72)
!428 = !DILocalVariable(name: "buf", scope: !417, file: !3, line: 270, type: !429)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 168, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 21)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 40, elements: !377)
!433 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!434 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!435 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!436 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!437 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!438 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!439 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "Version", scope: !442, file: !443, line: 3, type: !72, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !444, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!444 = !{!440}
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !447, file: !448, line: 65, type: !452, isLocal: false, isDefinition: true)
!447 = distinct !DICompileUnit(language: DW_LANG_C99, file: !448, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !449, retainedTypes: !450, globals: !451, splitDebugInlining: false, nameTableKind: None)
!448 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!449 = !{!21}
!450 = !{!62, !72, !74}
!451 = !{!445}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !453, line: 69, baseType: !454)
!453 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "file_name", scope: !459, file: !460, line: 45, type: !72, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !461, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!461 = !{!457, !462}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !459, file: !460, line: 55, type: !75, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !466, file: !467, line: 25, type: !75, isLocal: false, isDefinition: true)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !467, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !468, splitDebugInlining: false, nameTableKind: None)
!467 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!468 = !{!464, !469}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "hwcaps", scope: !471, file: !467, line: 45, type: !72, isLocal: true, isDefinition: true)
!471 = distinct !DISubprogram(name: "hwcap_allowed", scope: !467, file: !467, line: 28, type: !472, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!75, !72}
!474 = !{!475, !476, !481, !482, !483}
!475 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !471, file: !467, line: 28, type: !72)
!476 = !DILocalVariable(name: "tunables_start", scope: !477, file: !467, line: 50, type: !72)
!477 = distinct !DILexicalBlock(scope: !478, file: !467, line: 49, column: 9)
!478 = distinct !DILexicalBlock(scope: !479, file: !467, line: 48, column: 11)
!479 = distinct !DILexicalBlock(scope: !480, file: !467, line: 47, column: 5)
!480 = distinct !DILexicalBlock(scope: !471, file: !467, line: 46, column: 7)
!481 = !DILocalVariable(name: "last_hwcaps", scope: !477, file: !467, line: 51, type: !72)
!482 = !DILocalVariable(name: "sentinel", scope: !471, file: !467, line: 67, type: !72)
!483 = !DILocalVariable(name: "cap", scope: !471, file: !467, line: 70, type: !72)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !486, file: !487, line: 66, type: !454, isLocal: false, isDefinition: true)
!486 = distinct !DICompileUnit(language: DW_LANG_C99, file: !487, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !488, globals: !489, splitDebugInlining: false, nameTableKind: None)
!487 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!488 = !{!62, !74}
!489 = !{!490, !515, !484, !517, !519}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "old_file_name", scope: !492, file: !487, line: 304, type: !72, isLocal: true, isDefinition: true)
!492 = distinct !DISubprogram(name: "verror_at_line", scope: !487, file: !487, line: 298, type: !493, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !486, retainedNodes: !508)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !67, !67, !72, !7, !72, !495}
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !404, line: 52, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !497, line: 32, baseType: !498)
!497 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !499, baseType: !500)
!499 = !DIFile(filename: "lib/error.c", directory: "/src")
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !501, size: 256, elements: !502)
!501 = !DINamespace(name: "std", scope: null)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !500, file: !499, baseType: !62, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !500, file: !499, baseType: !62, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !500, file: !499, baseType: !62, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !500, file: !499, baseType: !67, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !500, file: !499, baseType: !67, size: 32, offset: 224)
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DILocalVariable(name: "status", arg: 1, scope: !492, file: !487, line: 298, type: !67)
!510 = !DILocalVariable(name: "errnum", arg: 2, scope: !492, file: !487, line: 298, type: !67)
!511 = !DILocalVariable(name: "file_name", arg: 3, scope: !492, file: !487, line: 298, type: !72)
!512 = !DILocalVariable(name: "line_number", arg: 4, scope: !492, file: !487, line: 298, type: !7)
!513 = !DILocalVariable(name: "message", arg: 5, scope: !492, file: !487, line: 298, type: !72)
!514 = !DILocalVariable(name: "args", arg: 6, scope: !492, file: !487, line: 298, type: !495)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "old_line_number", scope: !492, file: !487, line: 305, type: !7, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "error_message_count", scope: !486, file: !487, line: 69, type: !7, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !486, file: !487, line: 295, type: !67, isLocal: false, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "internal_state", scope: !523, file: !524, line: 97, type: !527, isLocal: true, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !525, globals: !526, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!525 = !{!62, !69, !74}
!526 = !{!521}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !528, line: 6, baseType: !529)
!528 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !530, line: 21, baseType: !531)
!530 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 13, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !531, file: !530, line: 15, baseType: !67, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !531, file: !530, line: 20, baseType: !535, size: 32, offset: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !531, file: !530, line: 16, size: 32, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !535, file: !530, line: 18, baseType: !7, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !535, file: !530, line: 19, baseType: !539, size: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 32, elements: !371)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "program_name", scope: !542, file: !543, line: 31, type: !72, isLocal: false, isDefinition: true)
!542 = distinct !DICompileUnit(language: DW_LANG_C99, file: !543, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !544, globals: !545, splitDebugInlining: false, nameTableKind: None)
!543 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!544 = !{!65}
!545 = !{!540}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "utf07FF", scope: !548, file: !549, line: 46, type: !574, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "proper_name_lite", scope: !549, file: !549, line: 38, type: !550, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !552, retainedNodes: !554)
!549 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!550 = !DISubroutineType(types: !551)
!551 = !{!72, !72, !72}
!552 = distinct !DICompileUnit(language: DW_LANG_C99, file: !549, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !553, splitDebugInlining: false, nameTableKind: None)
!553 = !{!546}
!554 = !{!555, !556, !557, !558, !563}
!555 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !548, file: !549, line: 38, type: !72)
!556 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !548, file: !549, line: 38, type: !72)
!557 = !DILocalVariable(name: "translation", scope: !548, file: !549, line: 40, type: !72)
!558 = !DILocalVariable(name: "w", scope: !548, file: !549, line: 47, type: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !560, line: 37, baseType: !561)
!560 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !105, line: 57, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !105, line: 42, baseType: !7)
!563 = !DILocalVariable(name: "mbs", scope: !548, file: !549, line: 48, type: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !528, line: 6, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !530, line: 21, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 13, size: 64, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !566, file: !530, line: 15, baseType: !67, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !566, file: !530, line: 20, baseType: !570, size: 32, offset: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !566, file: !530, line: 16, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !570, file: !530, line: 18, baseType: !7, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !570, file: !530, line: 19, baseType: !539, size: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 16, elements: !137)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !577, file: !578, line: 76, type: !644, isLocal: false, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !579, retainedTypes: !585, globals: !586, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!579 = !{!21, !580, !5}
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !22, line: 254, baseType: !7, size: 32, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!583 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!584 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!585 = !{!67, !68, !69}
!586 = !{!575, !587, !593, !605, !607, !610, !633, !640, !642}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !577, file: !578, line: 92, type: !589, isLocal: false, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 320, elements: !591)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!591 = !{!592}
!592 = !DISubrange(count: 10)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !577, file: !578, line: 1040, type: !595, isLocal: false, isDefinition: true)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !578, line: 56, size: 448, elements: !596)
!596 = !{!597, !598, !599, !603, !604}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !595, file: !578, line: 59, baseType: !21, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !578, line: 62, baseType: !67, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !595, file: !578, line: 66, baseType: !600, size: 256, offset: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !595, file: !578, line: 69, baseType: !72, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !595, file: !578, line: 72, baseType: !72, size: 64, offset: 384)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !577, file: !578, line: 107, type: !595, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "slot0", scope: !577, file: !578, line: 831, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 2048, elements: !277)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "quote", scope: !612, file: !578, line: 228, type: !631, isLocal: true, isDefinition: true)
!612 = distinct !DISubprogram(name: "gettext_quote", scope: !578, file: !578, line: 197, type: !613, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{!72, !72, !21}
!615 = !{!616, !617, !618, !619, !620}
!616 = !DILocalVariable(name: "msgid", arg: 1, scope: !612, file: !578, line: 197, type: !72)
!617 = !DILocalVariable(name: "s", arg: 2, scope: !612, file: !578, line: 197, type: !21)
!618 = !DILocalVariable(name: "translation", scope: !612, file: !578, line: 199, type: !72)
!619 = !DILocalVariable(name: "w", scope: !612, file: !578, line: 229, type: !559)
!620 = !DILocalVariable(name: "mbs", scope: !612, file: !578, line: 230, type: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !528, line: 6, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !530, line: 21, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 13, size: 64, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !623, file: !530, line: 15, baseType: !67, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !623, file: !530, line: 20, baseType: !627, size: 32, offset: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !530, line: 16, size: 32, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !627, file: !530, line: 18, baseType: !7, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !627, file: !530, line: 19, baseType: !539, size: 32)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 64, elements: !632)
!632 = !{!138, !372}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "slotvec", scope: !577, file: !578, line: 834, type: !635, isLocal: true, isDefinition: true)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !578, line: 823, size: 128, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !636, file: !578, line: 825, baseType: !69, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !636, file: !578, line: 826, baseType: !65, size: 64, offset: 64)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "nslots", scope: !577, file: !578, line: 832, type: !67, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "slotvec0", scope: !577, file: !578, line: 833, type: !636, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 704, elements: !365)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !647, file: !648, line: 26, type: !650, isLocal: false, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !649, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!649 = !{!645}
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 376, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 47)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !655, file: !656, line: 53, type: !454, isLocal: false, isDefinition: true)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !656, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!656 = !DIFile(filename: "lib/obstack.c", directory: "/src", checksumkind: CSK_MD5, checksum: "47f5bbc27e7c2d5a5cc3aab9403d8d27")
!657 = !{!75, !62, !65, !71}
!658 = !{!653}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "exit_failure", scope: !661, file: !662, line: 24, type: !664, isLocal: false, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C99, file: !662, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!663 = !{!659}
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "lib/argv-iter.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0e394449b22995c9f56acaf5026a67a")
!667 = !{!41}
!668 = !{!62}
!669 = distinct !DICompileUnit(language: DW_LANG_C99, file: !670, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!670 = !DIFile(filename: "lib/btowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a7b66f5e99f59c6c11b5045aee41d6bc")
!671 = !{!69}
!672 = distinct !DICompileUnit(language: DW_LANG_C99, file: !673, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !674, splitDebugInlining: false, nameTableKind: None)
!673 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!674 = !{!48}
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!679 = distinct !DICompileUnit(language: DW_LANG_C99, file: !680, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!681 = distinct !DICompileUnit(language: DW_LANG_C99, file: !682, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !687, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!687 = !{!304}
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !690, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!690 = !{!285}
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!693 = distinct !DICompileUnit(language: DW_LANG_C99, file: !694, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !695, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/physmem.c", directory: "/src", checksumkind: CSK_MD5, checksum: "df355a32f7975afeeeba505b6287e039")
!695 = !{!696}
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !697, line: 71, baseType: !7, size: 32, elements: !698)
!697 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!699 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0)
!700 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1)
!701 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2)
!702 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3)
!703 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4)
!704 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5)
!705 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6)
!706 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7)
!707 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8)
!708 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9)
!709 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10)
!710 = !DIEnumerator(name: "_SC_TIMERS", value: 11)
!711 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12)
!712 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13)
!713 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14)
!714 = !DIEnumerator(name: "_SC_FSYNC", value: 15)
!715 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16)
!716 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17)
!717 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18)
!718 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19)
!719 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20)
!720 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21)
!721 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22)
!722 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23)
!723 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24)
!724 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25)
!725 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26)
!726 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27)
!727 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28)
!728 = !DIEnumerator(name: "_SC_VERSION", value: 29)
!729 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30)
!730 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31)
!731 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32)
!732 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33)
!733 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34)
!734 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35)
!735 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36)
!736 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37)
!737 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38)
!738 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39)
!739 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40)
!740 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41)
!741 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42)
!742 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43)
!743 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44)
!744 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45)
!745 = !DIEnumerator(name: "_SC_2_VERSION", value: 46)
!746 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47)
!747 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48)
!748 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49)
!749 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50)
!750 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51)
!751 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52)
!752 = !DIEnumerator(name: "_SC_PII", value: 53)
!753 = !DIEnumerator(name: "_SC_PII_XTI", value: 54)
!754 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55)
!755 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56)
!756 = !DIEnumerator(name: "_SC_PII_OSI", value: 57)
!757 = !DIEnumerator(name: "_SC_POLL", value: 58)
!758 = !DIEnumerator(name: "_SC_SELECT", value: 59)
!759 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60)
!760 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60)
!761 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61)
!762 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62)
!763 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63)
!764 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64)
!765 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65)
!766 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66)
!767 = !DIEnumerator(name: "_SC_THREADS", value: 67)
!768 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68)
!769 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69)
!770 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70)
!771 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71)
!772 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72)
!773 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73)
!774 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74)
!775 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75)
!776 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76)
!777 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77)
!778 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78)
!779 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79)
!780 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80)
!781 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81)
!782 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82)
!783 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83)
!784 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84)
!785 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85)
!786 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86)
!787 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87)
!788 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88)
!789 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89)
!790 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90)
!791 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91)
!792 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92)
!793 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93)
!794 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94)
!795 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95)
!796 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96)
!797 = !DIEnumerator(name: "_SC_2_UPE", value: 97)
!798 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98)
!799 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99)
!800 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100)
!801 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101)
!802 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102)
!803 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103)
!804 = !DIEnumerator(name: "_SC_INT_MAX", value: 104)
!805 = !DIEnumerator(name: "_SC_INT_MIN", value: 105)
!806 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106)
!807 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107)
!808 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108)
!809 = !DIEnumerator(name: "_SC_NZERO", value: 109)
!810 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110)
!811 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111)
!812 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112)
!813 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113)
!814 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114)
!815 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115)
!816 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116)
!817 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117)
!818 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118)
!819 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119)
!820 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120)
!821 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121)
!822 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122)
!823 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123)
!824 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124)
!825 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125)
!826 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126)
!827 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127)
!828 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128)
!829 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129)
!830 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130)
!831 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131)
!832 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132)
!833 = !DIEnumerator(name: "_SC_BARRIERS", value: 133)
!834 = !DIEnumerator(name: "_SC_BASE", value: 134)
!835 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135)
!836 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136)
!837 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137)
!838 = !DIEnumerator(name: "_SC_CPUTIME", value: 138)
!839 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139)
!840 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140)
!841 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141)
!842 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142)
!843 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143)
!844 = !DIEnumerator(name: "_SC_FIFO", value: 144)
!845 = !DIEnumerator(name: "_SC_PIPE", value: 145)
!846 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146)
!847 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147)
!848 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148)
!849 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149)
!850 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150)
!851 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151)
!852 = !DIEnumerator(name: "_SC_NETWORKING", value: 152)
!853 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153)
!854 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154)
!855 = !DIEnumerator(name: "_SC_REGEXP", value: 155)
!856 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156)
!857 = !DIEnumerator(name: "_SC_SHELL", value: 157)
!858 = !DIEnumerator(name: "_SC_SIGNALS", value: 158)
!859 = !DIEnumerator(name: "_SC_SPAWN", value: 159)
!860 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160)
!861 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161)
!862 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162)
!863 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163)
!864 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164)
!865 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165)
!866 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166)
!867 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167)
!868 = !DIEnumerator(name: "_SC_2_PBS", value: 168)
!869 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169)
!870 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170)
!871 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171)
!872 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172)
!873 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173)
!874 = !DIEnumerator(name: "_SC_STREAMS", value: 174)
!875 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175)
!876 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176)
!877 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177)
!878 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178)
!879 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179)
!880 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180)
!881 = !DIEnumerator(name: "_SC_TRACE", value: 181)
!882 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182)
!883 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183)
!884 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184)
!885 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185)
!886 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186)
!887 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187)
!888 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188)
!889 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189)
!890 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190)
!891 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_SIZE", value: 191)
!892 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_ASSOC", value: 192)
!893 = !DIEnumerator(name: "_SC_LEVEL2_CACHE_LINESIZE", value: 193)
!894 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_SIZE", value: 194)
!895 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_ASSOC", value: 195)
!896 = !DIEnumerator(name: "_SC_LEVEL3_CACHE_LINESIZE", value: 196)
!897 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_SIZE", value: 197)
!898 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_ASSOC", value: 198)
!899 = !DIEnumerator(name: "_SC_LEVEL4_CACHE_LINESIZE", value: 199)
!900 = !DIEnumerator(name: "_SC_IPV6", value: 235)
!901 = !DIEnumerator(name: "_SC_RAW_SOCKETS", value: 236)
!902 = !DIEnumerator(name: "_SC_V7_ILP32_OFF32", value: 237)
!903 = !DIEnumerator(name: "_SC_V7_ILP32_OFFBIG", value: 238)
!904 = !DIEnumerator(name: "_SC_V7_LP64_OFF64", value: 239)
!905 = !DIEnumerator(name: "_SC_V7_LPBIG_OFFBIG", value: 240)
!906 = !DIEnumerator(name: "_SC_SS_REPL_MAX", value: 241)
!907 = !DIEnumerator(name: "_SC_TRACE_EVENT_NAME_MAX", value: 242)
!908 = !DIEnumerator(name: "_SC_TRACE_NAME_MAX", value: 243)
!909 = !DIEnumerator(name: "_SC_TRACE_SYS_MAX", value: 244)
!910 = !DIEnumerator(name: "_SC_TRACE_USER_EVENT_MAX", value: 245)
!911 = !DIEnumerator(name: "_SC_XOPEN_STREAMS", value: 246)
!912 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_INHERIT", value: 247)
!913 = !DIEnumerator(name: "_SC_THREAD_ROBUST_PRIO_PROTECT", value: 248)
!914 = !DIEnumerator(name: "_SC_MINSIGSTKSZ", value: 249)
!915 = !DIEnumerator(name: "_SC_SIGSTKSZ", value: 250)
!916 = !{!917}
!917 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !920, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/readtokens0.c", directory: "/src", checksumkind: CSK_MD5, checksum: "339d3ea775042044fcc90ab5fdb88379")
!920 = !{!62, !921, !65, !69, !922, !71}
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "_OBSTACK_CPTR", file: !149, line: 145, baseType: !71)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!925 = !{!926}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !924, line: 40, baseType: !7, size: 32, elements: !927)
!927 = !{!928}
!928 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !931, retainedTypes: !958, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!931 = !{!932, !943}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !933, file: !930, line: 188, baseType: !7, size: 32, elements: !941)
!933 = distinct !DISubprogram(name: "x2nrealloc", scope: !930, file: !930, line: 176, type: !934, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !929, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{!62, !62, !146, !69}
!936 = !{!937, !938, !939, !940}
!937 = !DILocalVariable(name: "p", arg: 1, scope: !933, file: !930, line: 176, type: !62)
!938 = !DILocalVariable(name: "pn", arg: 2, scope: !933, file: !930, line: 176, type: !146)
!939 = !DILocalVariable(name: "s", arg: 3, scope: !933, file: !930, line: 176, type: !69)
!940 = !DILocalVariable(name: "n", scope: !933, file: !930, line: 178, type: !69)
!941 = !{!942}
!942 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !944, file: !930, line: 228, baseType: !7, size: 32, elements: !941)
!944 = distinct !DISubprogram(name: "xpalloc", scope: !930, file: !930, line: 223, type: !945, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !929, retainedNodes: !948)
!945 = !DISubroutineType(types: !946)
!946 = !{!62, !62, !947, !88, !90, !88}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957}
!949 = !DILocalVariable(name: "pa", arg: 1, scope: !944, file: !930, line: 223, type: !62)
!950 = !DILocalVariable(name: "pn", arg: 2, scope: !944, file: !930, line: 223, type: !947)
!951 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !944, file: !930, line: 223, type: !88)
!952 = !DILocalVariable(name: "n_max", arg: 4, scope: !944, file: !930, line: 223, type: !90)
!953 = !DILocalVariable(name: "s", arg: 5, scope: !944, file: !930, line: 223, type: !88)
!954 = !DILocalVariable(name: "n0", scope: !944, file: !930, line: 230, type: !88)
!955 = !DILocalVariable(name: "n", scope: !944, file: !930, line: 237, type: !88)
!956 = !DILocalVariable(name: "nbytes", scope: !944, file: !930, line: 248, type: !88)
!957 = !DILocalVariable(name: "adjusted_nbytes", scope: !944, file: !930, line: 252, type: !88)
!958 = !{!65, !62, !75, !91, !71}
!959 = distinct !DICompileUnit(language: DW_LANG_C99, file: !960, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!961 = distinct !DICompileUnit(language: DW_LANG_C99, file: !962, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!963 = distinct !DICompileUnit(language: DW_LANG_C99, file: !964, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!964 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!965 = distinct !DICompileUnit(language: DW_LANG_C99, file: !966, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !544, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "lib/full-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "717d8293e026c44a771a83b22da54cc2")
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !968, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!968 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !971, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!971 = !{!75, !71, !62}
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !974, retainedTypes: !671, splitDebugInlining: false, nameTableKind: None)
!973 = !DIFile(filename: "lib/safe-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "434e548fbeff241cc07e1dbcc7b4611f")
!974 = !{!975}
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !976, line: 36, baseType: !7, size: 32, elements: !977)
!976 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!977 = !{!978}
!978 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !980, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!980 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !668, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "src/wc_neon.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8c9243a5ca88ff691fdd64a6be8e2cf2")
!985 = !{!986, !994, !997, !999, !1000, !1004, !1009}
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8x16_t", file: !987, line: 67, baseType: !988)
!987 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/arm_neon.h", directory: "", checksumkind: CSK_MD5, checksum: "37fb554efe2b385870d7e3a32d344cd0")
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 128, flags: DIFlagVector, elements: !992)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !990, line: 24, baseType: !991)
!990 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !105, line: 38, baseType: !74)
!992 = !{!993}
!993 = !DISubrange(count: 16)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !995, line: 27, baseType: !996)
!995 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !105, line: 44, baseType: !91)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64x2_t", file: !987, line: 65, baseType: !998)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 128, flags: DIFlagVector, elements: !137)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8x16_t", file: !987, line: 59, baseType: !1001)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 128, flags: DIFlagVector, elements: !992)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !995, line: 24, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !105, line: 37, baseType: !240)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16x8_t", file: !987, line: 61, baseType: !1005)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 128, flags: DIFlagVector, elements: !601)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !995, line: 25, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !105, line: 39, baseType: !1008)
!1008 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32x4_t", file: !987, line: 63, baseType: !1010)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 128, flags: DIFlagVector, elements: !371)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !995, line: 26, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !105, line: 41, baseType: !67)
!1013 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!1014 = !{i32 7, !"Dwarf Version", i32 5}
!1015 = !{i32 2, !"Debug Info Version", i32 3}
!1016 = !{i32 1, !"wchar_size", i32 4}
!1017 = !{i32 1, !"branch-target-enforcement", i32 0}
!1018 = !{i32 1, !"sign-return-address", i32 0}
!1019 = !{i32 1, !"sign-return-address-all", i32 0}
!1020 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!1021 = !{i32 7, !"PIC Level", i32 2}
!1022 = !{i32 7, !"PIE Level", i32 2}
!1023 = !{i32 7, !"uwtable", i32 1}
!1024 = !{i32 7, !"frame-pointer", i32 1}
!1025 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 183, type: !1026, scopeLine: 184, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !67}
!1028 = !{!1029}
!1029 = !DILocalVariable(name: "status", arg: 1, scope: !1025, file: !3, line: 183, type: !67)
!1030 = !DILocation(line: 0, scope: !1025)
!1031 = !DILocation(line: 185, column: 14, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 185, column: 7)
!1033 = !DILocation(line: 185, column: 7, scope: !1025)
!1034 = !DILocation(line: 186, column: 5, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 186, column: 5)
!1036 = !{!1037, !1037, i64 0}
!1037 = !{!"any pointer", !1038, i64 0}
!1038 = !{!"omnipotent char", !1039, i64 0}
!1039 = !{!"Simple C/C++ TBAA"}
!1040 = !DILocation(line: 189, column: 7, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 188, column: 5)
!1042 = !DILocation(line: 194, column: 7, scope: !1041)
!1043 = !DILocation(line: 729, column: 3, scope: !1044, inlinedAt: !1046)
!1044 = distinct !DISubprogram(name: "emit_stdin_note", scope: !325, file: !325, line: 727, type: !455, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1045)
!1045 = !{}
!1046 = distinct !DILocation(line: 200, column: 7, scope: !1041)
!1047 = !DILocation(line: 202, column: 7, scope: !1041)
!1048 = !DILocation(line: 207, column: 7, scope: !1041)
!1049 = !DILocation(line: 211, column: 7, scope: !1041)
!1050 = !DILocation(line: 215, column: 7, scope: !1041)
!1051 = !DILocation(line: 219, column: 7, scope: !1041)
!1052 = !DILocation(line: 223, column: 7, scope: !1041)
!1053 = !DILocation(line: 229, column: 7, scope: !1041)
!1054 = !DILocation(line: 233, column: 7, scope: !1041)
!1055 = !DILocation(line: 237, column: 7, scope: !1041)
!1056 = !DILocation(line: 242, column: 7, scope: !1041)
!1057 = !DILocation(line: 243, column: 7, scope: !1041)
!1058 = !DILocalVariable(name: "program", arg: 1, scope: !1059, file: !325, line: 836, type: !72)
!1059 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !325, file: !325, line: 836, type: !1060, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1062)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !72}
!1062 = !{!1058, !1063, !1072, !1073, !1075, !1076}
!1063 = !DILocalVariable(name: "infomap", scope: !1059, file: !325, line: 838, type: !1064)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 896, elements: !1070)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1059, file: !325, line: 838, size: 128, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1066, file: !325, line: 838, baseType: !72, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1066, file: !325, line: 838, baseType: !72, size: 64, offset: 64)
!1070 = !{!1071}
!1071 = !DISubrange(count: 7)
!1072 = !DILocalVariable(name: "node", scope: !1059, file: !325, line: 848, type: !72)
!1073 = !DILocalVariable(name: "map_prog", scope: !1059, file: !325, line: 849, type: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1075 = !DILocalVariable(name: "lc_messages", scope: !1059, file: !325, line: 861, type: !72)
!1076 = !DILocalVariable(name: "url_program", scope: !1059, file: !325, line: 874, type: !72)
!1077 = !DILocation(line: 0, scope: !1059, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 244, column: 7, scope: !1041)
!1079 = !DILocation(line: 838, column: 3, scope: !1059, inlinedAt: !1078)
!1080 = !DILocation(line: 838, column: 67, scope: !1059, inlinedAt: !1078)
!1081 = !DILocation(line: 849, column: 36, scope: !1059, inlinedAt: !1078)
!1082 = !DILocation(line: 851, column: 3, scope: !1059, inlinedAt: !1078)
!1083 = !DILocalVariable(name: "__s1", arg: 1, scope: !1084, file: !1085, line: 1359, type: !72)
!1084 = distinct !DISubprogram(name: "streq", scope: !1085, file: !1085, line: 1359, type: !1086, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1088)
!1085 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!75, !72, !72}
!1088 = !{!1083, !1089}
!1089 = !DILocalVariable(name: "__s2", arg: 2, scope: !1084, file: !1085, line: 1359, type: !72)
!1090 = !DILocation(line: 0, scope: !1084, inlinedAt: !1091)
!1091 = distinct !DILocation(line: 851, column: 33, scope: !1059, inlinedAt: !1078)
!1092 = !DILocation(line: 1361, column: 11, scope: !1084, inlinedAt: !1091)
!1093 = !DILocation(line: 1361, column: 10, scope: !1084, inlinedAt: !1091)
!1094 = !DILocation(line: 852, column: 13, scope: !1059, inlinedAt: !1078)
!1095 = !DILocation(line: 851, column: 20, scope: !1059, inlinedAt: !1078)
!1096 = !{!1097, !1037, i64 0}
!1097 = !{!"infomap", !1037, i64 0, !1037, i64 8}
!1098 = !DILocation(line: 851, column: 10, scope: !1059, inlinedAt: !1078)
!1099 = !DILocation(line: 851, column: 28, scope: !1059, inlinedAt: !1078)
!1100 = distinct !{!1100, !1082, !1094, !1101}
!1101 = !{!"llvm.loop.mustprogress"}
!1102 = !DILocation(line: 854, column: 17, scope: !1103, inlinedAt: !1078)
!1103 = distinct !DILexicalBlock(scope: !1059, file: !325, line: 854, column: 7)
!1104 = !{!1097, !1037, i64 8}
