; ModuleID = 'src/who.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { i8*, i32, i32*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.gl_utmp = type { i8*, i8*, i8*, i8*, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }

!70 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 102, type: !63, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 107, type: !63, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 110, type: !63, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 114, type: !63, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 117, type: !63, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 120, type: !63, isLocal: true, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 123, type: !63, isLocal: true, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 126, type: !63, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 129, type: !63, isLocal: true, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 132, type: !63, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 135, type: !63, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 138, type: !63, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 141, type: !63, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 145, type: !55, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 146, type: !50, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !101, file: !43, line: 575, type: !50, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "oputs_", scope: !43, file: !43, line: 573, type: !102, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !104)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !55, !55}
!104 = !{!105, !106, !107, !110, !111, !112, !113, !117, !118, !119, !120, !122, !176, !177, !178, !180, !181}
!105 = !DILocalVariable(name: "program", arg: 1, scope: !101, file: !43, line: 573, type: !55)
!106 = !DILocalVariable(name: "option", arg: 2, scope: !101, file: !43, line: 573, type: !55)
!107 = !DILocalVariable(name: "term", scope: !108, file: !43, line: 585, type: !55)
!108 = distinct !DILexicalBlock(scope: !109, file: !43, line: 582, column: 5)
!109 = distinct !DILexicalBlock(scope: !101, file: !43, line: 581, column: 7)
!110 = !DILocalVariable(name: "double_space", scope: !101, file: !43, line: 594, type: !63)
!111 = !DILocalVariable(name: "first_word", scope: !101, file: !43, line: 595, type: !55)
!112 = !DILocalVariable(name: "option_text", scope: !101, file: !43, line: 596, type: !55)
!113 = !DILocalVariable(name: "s", scope: !114, file: !43, line: 608, type: !55)
!114 = distinct !DILexicalBlock(scope: !115, file: !43, line: 605, column: 5)
!115 = distinct !DILexicalBlock(scope: !116, file: !43, line: 604, column: 12)
!116 = distinct !DILexicalBlock(scope: !101, file: !43, line: 597, column: 7)
!117 = !DILocalVariable(name: "spaces", scope: !114, file: !43, line: 609, type: !52)
!118 = !DILocalVariable(name: "anchor_len", scope: !101, file: !43, line: 620, type: !52)
!119 = !DILocalVariable(name: "desc_text", scope: !101, file: !43, line: 625, type: !55)
!120 = !DILocalVariable(name: "__ptr", scope: !121, file: !43, line: 644, type: !55)
!121 = distinct !DILexicalBlock(scope: !101, file: !43, line: 644, column: 3)
!122 = !DILocalVariable(name: "__stream", scope: !121, file: !43, line: 644, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !125, line: 7, baseType: !126)
!125 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !127, line: 49, size: 1728, elements: !128)
!127 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !144, !146, !147, !148, !150, !151, !153, !157, !160, !162, !165, !168, !169, !170, !171, !172}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !126, file: !127, line: 51, baseType: !50, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !126, file: !127, line: 54, baseType: !47, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !126, file: !127, line: 55, baseType: !47, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !126, file: !127, line: 56, baseType: !47, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !126, file: !127, line: 57, baseType: !47, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !126, file: !127, line: 58, baseType: !47, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !126, file: !127, line: 59, baseType: !47, size: 64, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !126, file: !127, line: 60, baseType: !47, size: 64, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !126, file: !127, line: 61, baseType: !47, size: 64, offset: 512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !126, file: !127, line: 64, baseType: !47, size: 64, offset: 576)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !126, file: !127, line: 65, baseType: !47, size: 64, offset: 640)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !126, file: !127, line: 66, baseType: !47, size: 64, offset: 704)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !126, file: !127, line: 68, baseType: !142, size: 64, offset: 768)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !127, line: 36, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !126, file: !127, line: 70, baseType: !145, size: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !126, file: !127, line: 72, baseType: !50, size: 32, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !126, file: !127, line: 73, baseType: !50, size: 32, offset: 928)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !126, file: !127, line: 74, baseType: !149, size: 64, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !61, line: 152, baseType: !62)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !126, file: !127, line: 77, baseType: !51, size: 16, offset: 1024)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !126, file: !127, line: 78, baseType: !152, size: 8, offset: 1040)
!152 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !126, file: !127, line: 79, baseType: !154, size: 8, offset: 1048)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 1)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !126, file: !127, line: 81, baseType: !158, size: 64, offset: 1088)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !127, line: 43, baseType: null)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !126, file: !127, line: 89, baseType: !161, size: 64, offset: 1152)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !61, line: 153, baseType: !62)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !126, file: !127, line: 91, baseType: !163, size: 64, offset: 1216)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !127, line: 37, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !126, file: !127, line: 92, baseType: !166, size: 64, offset: 1280)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !127, line: 38, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !126, file: !127, line: 93, baseType: !145, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !126, file: !127, line: 94, baseType: !49, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !126, file: !127, line: 95, baseType: !52, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !126, file: !127, line: 96, baseType: !50, size: 32, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !126, file: !127, line: 98, baseType: !173, size: 160, offset: 1568)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 160, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 20)
!176 = !DILocalVariable(name: "__cnt", scope: !121, file: !43, line: 644, type: !52)
!177 = !DILocalVariable(name: "url_program", scope: !101, file: !43, line: 648, type: !55)
!178 = !DILocalVariable(name: "__ptr", scope: !179, file: !43, line: 686, type: !55)
!179 = distinct !DILexicalBlock(scope: !101, file: !43, line: 686, column: 3)
!180 = !DILocalVariable(name: "__stream", scope: !179, file: !43, line: 686, type: !123)
!181 = !DILocalVariable(name: "__cnt", scope: !179, file: !43, line: 686, type: !52)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "mesg", scope: !184, file: !3, line: 232, type: !208, isLocal: true, isDefinition: true)
!184 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 227, type: !185, scopeLine: 231, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !55, !56, !55, !55, !55, !55, !55, !55}
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !201, !205, !206}
!188 = !DILocalVariable(name: "user", arg: 1, scope: !184, file: !3, line: 227, type: !55)
!189 = !DILocalVariable(name: "state", arg: 2, scope: !184, file: !3, line: 227, type: !56)
!190 = !DILocalVariable(name: "line", arg: 3, scope: !184, file: !3, line: 228, type: !55)
!191 = !DILocalVariable(name: "time_str", arg: 4, scope: !184, file: !3, line: 229, type: !55)
!192 = !DILocalVariable(name: "idle", arg: 5, scope: !184, file: !3, line: 229, type: !55)
!193 = !DILocalVariable(name: "pid", arg: 6, scope: !184, file: !3, line: 229, type: !55)
!194 = !DILocalVariable(name: "comment", arg: 7, scope: !184, file: !3, line: 230, type: !55)
!195 = !DILocalVariable(name: "exitstr", arg: 8, scope: !184, file: !3, line: 230, type: !55)
!196 = !DILocalVariable(name: "buf", scope: !184, file: !3, line: 233, type: !47)
!197 = !DILocalVariable(name: "x_idle", scope: !184, file: !3, line: 234, type: !198)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DILocalVariable(name: "x_pid", scope: !184, file: !3, line: 235, type: !202)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 104, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 13)
!205 = !DILocalVariable(name: "x_exitstr", scope: !184, file: !3, line: 236, type: !47)
!206 = !DILocalVariable(name: "p", scope: !207, file: !3, line: 282, type: !47)
!207 = distinct !DILexicalBlock(scope: !184, file: !3, line: 280, column: 3)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 24, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 3)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "hoststr", scope: !213, file: !3, line: 319, type: !47, isLocal: true, isDefinition: true)
!213 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 312, type: !214, scopeLine: 313, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !216, !58}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !6, line: 92, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !6, line: 65, size: 576, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !232, !236, !237, !239}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !219, file: !6, line: 69, baseType: !47, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !219, file: !6, line: 70, baseType: !47, size: 64, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !219, file: !6, line: 71, baseType: !47, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !219, file: !6, line: 72, baseType: !47, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !219, file: !6, line: 74, baseType: !226, size: 128, offset: 256)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !227, line: 11, size: 128, elements: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !226, file: !227, line: 16, baseType: !60, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !226, file: !227, line: 21, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !61, line: 197, baseType: !62)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !219, file: !6, line: 75, baseType: !233, size: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !234, line: 97, baseType: !235)
!234 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !61, line: 154, baseType: !50)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !219, file: !6, line: 76, baseType: !233, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !219, file: !6, line: 77, baseType: !238, size: 16, offset: 448)
!238 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !219, file: !6, line: 79, baseType: !240, size: 64, offset: 480)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !219, file: !6, line: 79, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !240, file: !6, line: 79, baseType: !50, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !240, file: !6, line: 79, baseType: !50, size: 32, offset: 32)
!244 = !{!245, !246, !247, !278, !279, !280, !284, !288, !289, !290, !291, !294, !295, !296, !302, !303, !305}
!245 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !213, file: !3, line: 312, type: !216)
!246 = !DILocalVariable(name: "boottime", arg: 2, scope: !213, file: !3, line: 312, type: !58)
!247 = !DILocalVariable(name: "stats", scope: !213, file: !3, line: 314, type: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !249, line: 44, size: 1024, elements: !250)
!249 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!250 = !{!251, !253, !255, !257, !259, !261, !263, !264, !265, !266, !268, !269, !271, !272, !273, !274}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !248, file: !249, line: 46, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !61, line: 145, baseType: !54)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !248, file: !249, line: 47, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !61, line: 148, baseType: !54)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !248, file: !249, line: 48, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !61, line: 150, baseType: !7)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !248, file: !249, line: 49, baseType: !258, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !61, line: 151, baseType: !7)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !248, file: !249, line: 50, baseType: !260, size: 32, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !61, line: 146, baseType: !7)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !248, file: !249, line: 51, baseType: !262, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !61, line: 147, baseType: !7)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !248, file: !249, line: 52, baseType: !252, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !248, file: !249, line: 53, baseType: !252, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !248, file: !249, line: 54, baseType: !149, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !248, file: !249, line: 55, baseType: !267, size: 32, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !61, line: 175, baseType: !50)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !248, file: !249, line: 56, baseType: !50, size: 32, offset: 480)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !248, file: !249, line: 57, baseType: !270, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !61, line: 180, baseType: !62)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !248, file: !249, line: 65, baseType: !226, size: 128, offset: 576)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !248, file: !249, line: 66, baseType: !226, size: 128, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !248, file: !249, line: 67, baseType: !226, size: 128, offset: 832)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !248, file: !249, line: 79, baseType: !275, size: 64, offset: 960)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 64, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 2)
!278 = !DILocalVariable(name: "last_change", scope: !213, file: !3, line: 315, type: !58)
!279 = !DILocalVariable(name: "mesg", scope: !213, file: !3, line: 316, type: !48)
!280 = !DILocalVariable(name: "idlestr", scope: !213, file: !3, line: 317, type: !281)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 56, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 7)
!284 = !DILocalVariable(name: "pidstr", scope: !213, file: !3, line: 318, type: !285)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 12)
!288 = !DILocalVariable(name: "line", scope: !213, file: !3, line: 325, type: !47)
!289 = !DILocalVariable(name: "space", scope: !213, file: !3, line: 326, type: !47)
!290 = !DILocalVariable(name: "dirfd", scope: !213, file: !3, line: 329, type: !50)
!291 = !DILocalVariable(name: "host", scope: !292, file: !3, line: 363, type: !47)
!292 = distinct !DILexicalBlock(scope: !293, file: !3, line: 362, column: 5)
!293 = distinct !DILexicalBlock(scope: !213, file: !3, line: 361, column: 7)
!294 = !DILocalVariable(name: "display", scope: !292, file: !3, line: 364, type: !47)
!295 = !DILocalVariable(name: "ut_host", scope: !292, file: !3, line: 365, type: !47)
!296 = !DILocalVariable(name: "needed", scope: !297, file: !3, line: 383, type: !299)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 382, column: 9)
!298 = distinct !DILexicalBlock(scope: !292, file: !3, line: 381, column: 11)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !300, line: 130, baseType: !301)
!300 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !53, line: 35, baseType: !62)
!302 = !DILocalVariable(name: "p", scope: !297, file: !3, line: 389, type: !47)
!303 = !DILocalVariable(name: "needed", scope: !304, file: !3, line: 397, type: !299)
!304 = distinct !DILexicalBlock(scope: !298, file: !3, line: 396, column: 9)
!305 = !DILocalVariable(name: "p", scope: !304, file: !3, line: 403, type: !47)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "hostlen", scope: !213, file: !3, line: 321, type: !299, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !213, file: !3, line: 334, type: !50, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "now", scope: !312, file: !3, line: 182, type: !58, isLocal: true, isDefinition: true)
!312 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 180, type: !313, scopeLine: 181, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !315)
!313 = !DISubroutineType(types: !314)
!314 = !{!55, !58, !58}
!315 = !{!316, !317, !318}
!316 = !DILocalVariable(name: "when", arg: 1, scope: !312, file: !3, line: 180, type: !58)
!317 = !DILocalVariable(name: "boottime", arg: 2, scope: !312, file: !3, line: 180, type: !58)
!318 = !DILocalVariable(name: "seconds_idle", scope: !312, file: !3, line: 187, type: !50)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !312, file: !3, line: 196, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 6)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "buf", scope: !326, file: !3, line: 211, type: !347, isLocal: true, isDefinition: true)
!326 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 209, type: !327, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !329)
!327 = !DISubroutineType(types: !328)
!328 = !{!55, !216}
!329 = !{!330, !331}
!330 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !326, file: !3, line: 209, type: !216)
!331 = !DILocalVariable(name: "tmp", scope: !326, file: !3, line: 212, type: !332)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !334, line: 7, size: 448, elements: !335)
!334 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !333, file: !334, line: 9, baseType: !50, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !333, file: !334, line: 10, baseType: !50, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !333, file: !334, line: 11, baseType: !50, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !333, file: !334, line: 12, baseType: !50, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !333, file: !334, line: 13, baseType: !50, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !333, file: !334, line: 14, baseType: !50, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !333, file: !334, line: 15, baseType: !50, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !333, file: !334, line: 16, baseType: !50, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !333, file: !334, line: 17, baseType: !50, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !333, file: !334, line: 20, baseType: !62, size: 64, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !333, file: !334, line: 21, baseType: !55, size: 64, offset: 384)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 264, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 33)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "runlevline", scope: !352, file: !3, line: 504, type: !47, isLocal: true, isDefinition: true)
!352 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 502, type: !353, scopeLine: 503, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !216}
!355 = !{!356, !357, !358}
!356 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !352, file: !3, line: 502, type: !216)
!357 = !DILocalVariable(name: "last", scope: !352, file: !3, line: 505, type: !57)
!358 = !DILocalVariable(name: "curr", scope: !352, file: !3, line: 506, type: !57)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "comment", scope: !352, file: !3, line: 504, type: !47, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "exitstr", scope: !363, file: !3, line: 449, type: !47, isLocal: true, isDefinition: true)
!363 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 447, type: !353, scopeLine: 448, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !364)
!364 = !{!365, !366, !367}
!365 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !363, file: !3, line: 447, type: !216)
!366 = !DILocalVariable(name: "comment", scope: !363, file: !3, line: 450, type: !47)
!367 = !DILocalVariable(name: "pidstr", scope: !363, file: !3, line: 451, type: !285)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 4608, elements: !378)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !371, line: 50, size: 256, elements: !372)
!371 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!372 = !{!373, !374, !375, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !371, line: 52, baseType: !55, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !370, file: !371, line: 55, baseType: !50, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !371, line: 56, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !370, file: !371, line: 57, baseType: !50, size: 32, offset: 192)
!378 = !{!379}
!379 = !DISubrange(count: 18)
!380 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!382 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!383 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!384 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!385 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!386 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!387 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!388 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!389 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!390 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!391 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!392 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!393 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!394 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "Version", scope: !397, file: !398, line: 3, type: !55, isLocal: false, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!399 = !{!395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "last_cherror", scope: !402, file: !403, line: 28, type: !50, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !404, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!404 = !{!405, !400}
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "hints", scope: !407, file: !403, line: 63, type: !415, isLocal: true, isDefinition: true)
!407 = distinct !DISubprogram(name: "canon_host_r", scope: !403, file: !403, line: 61, type: !408, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!47, !55, !376}
!410 = !{!411, !412, !413, !439, !440}
!411 = !DILocalVariable(name: "host", arg: 1, scope: !407, file: !403, line: 61, type: !55)
!412 = !DILocalVariable(name: "cherror", arg: 2, scope: !407, file: !403, line: 61, type: !376)
!413 = !DILocalVariable(name: "res", scope: !407, file: !403, line: 66, type: !414)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !416, line: 565, size: 384, elements: !417)
!416 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!417 = !{!418, !419, !420, !421, !422, !426, !437, !438}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !415, file: !416, line: 567, baseType: !50, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !415, file: !416, line: 568, baseType: !50, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !415, file: !416, line: 569, baseType: !50, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !415, file: !416, line: 570, baseType: !50, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !415, file: !416, line: 571, baseType: !423, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !424, line: 33, baseType: !425)
!424 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !61, line: 210, baseType: !7)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !415, file: !416, line: 572, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !424, line: 180, size: 128, elements: !429)
!429 = !{!430, !433}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !428, file: !424, line: 182, baseType: !431, size: 16)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !432, line: 28, baseType: !51)
!432 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !428, file: !424, line: 183, baseType: !434, size: 112, offset: 16)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 112, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 14)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !415, file: !416, line: 573, baseType: !47, size: 64, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !415, file: !416, line: 574, baseType: !414, size: 64, offset: 320)
!439 = !DILocalVariable(name: "status", scope: !407, file: !403, line: 67, type: !50)
!440 = !DILocalVariable(name: "retval", scope: !407, file: !403, line: 69, type: !47)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "file_name", scope: !443, file: !444, line: 45, type: !55, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!445 = !{!441, !446}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !443, file: !444, line: 55, type: !63, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !450, file: !451, line: 66, type: !486, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !451, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !452, globals: !453, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!452 = !{!49, !57}
!453 = !{!454, !480, !448, !482, !484}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "old_file_name", scope: !456, file: !451, line: 304, type: !55, isLocal: true, isDefinition: true)
!456 = distinct !DISubprogram(name: "verror_at_line", scope: !451, file: !451, line: 298, type: !457, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !450, retainedNodes: !473)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !50, !50, !55, !7, !55, !459}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !460, line: 52, baseType: !461)
!460 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !462, line: 32, baseType: !463)
!462 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !464, baseType: !465)
!464 = !DIFile(filename: "lib/error.c", directory: "/src")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !466, size: 256, elements: !467)
!466 = !DINamespace(name: "std", scope: null)
!467 = !{!468, !469, !470, !471, !472}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !465, file: !464, baseType: !49, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !465, file: !464, baseType: !49, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !465, file: !464, baseType: !49, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !465, file: !464, baseType: !50, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !465, file: !464, baseType: !50, size: 32, offset: 224)
!473 = !{!474, !475, !476, !477, !478, !479}
!474 = !DILocalVariable(name: "status", arg: 1, scope: !456, file: !451, line: 298, type: !50)
!475 = !DILocalVariable(name: "errnum", arg: 2, scope: !456, file: !451, line: 298, type: !50)
!476 = !DILocalVariable(name: "file_name", arg: 3, scope: !456, file: !451, line: 298, type: !55)
!477 = !DILocalVariable(name: "line_number", arg: 4, scope: !456, file: !451, line: 298, type: !7)
!478 = !DILocalVariable(name: "message", arg: 5, scope: !456, file: !451, line: 298, type: !55)
!479 = !DILocalVariable(name: "args", arg: 6, scope: !456, file: !451, line: 298, type: !459)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "old_line_number", scope: !456, file: !451, line: 305, type: !7, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "error_message_count", scope: !450, file: !451, line: 69, type: !7, isLocal: false, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !450, file: !451, line: 295, type: !50, isLocal: false, isDefinition: true)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DISubroutineType(types: !488)
!488 = !{null}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "program_name", scope: !491, file: !492, line: 31, type: !55, isLocal: false, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !493, globals: !494, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!493 = !{!47}
!494 = !{!489}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "utf07FF", scope: !497, file: !498, line: 46, type: !528, isLocal: true, isDefinition: true)
!497 = distinct !DISubprogram(name: "proper_name_lite", scope: !498, file: !498, line: 38, type: !499, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !501, retainedNodes: !503)
!498 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!499 = !DISubroutineType(types: !500)
!500 = !{!55, !55, !55}
!501 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !502, splitDebugInlining: false, nameTableKind: None)
!502 = !{!495}
!503 = !{!504, !505, !506, !507, !512}
!504 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !497, file: !498, line: 38, type: !55)
!505 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !497, file: !498, line: 38, type: !55)
!506 = !DILocalVariable(name: "translation", scope: !497, file: !498, line: 40, type: !55)
!507 = !DILocalVariable(name: "w", scope: !497, file: !498, line: 47, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !509, line: 37, baseType: !510)
!509 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !61, line: 57, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !61, line: 42, baseType: !7)
!512 = !DILocalVariable(name: "mbs", scope: !497, file: !498, line: 48, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !514, line: 6, baseType: !515)
!514 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !516, line: 21, baseType: !517)
!516 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 13, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !517, file: !516, line: 15, baseType: !50, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !517, file: !516, line: 20, baseType: !521, size: 32, offset: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !516, line: 16, size: 32, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !521, file: !516, line: 18, baseType: !7, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !521, file: !516, line: 19, baseType: !525, size: 32)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 4)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 16, elements: !276)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !531, file: !532, line: 76, type: !598, isLocal: false, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !533, retainedTypes: !539, globals: !540, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!533 = !{!28, !534, !13}
!534 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !29, line: 254, baseType: !7, size: 32, elements: !535)
!535 = !{!536, !537, !538}
!536 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!537 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!538 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!539 = !{!50, !51, !52}
!540 = !{!529, !541, !547, !557, !559, !564, !587, !594, !596}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !531, file: !532, line: 92, type: !543, isLocal: false, isDefinition: true)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 320, elements: !545)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!545 = !{!546}
!546 = !DISubrange(count: 10)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !531, file: !532, line: 1040, type: !549, isLocal: false, isDefinition: true)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !532, line: 56, size: 448, elements: !550)
!550 = !{!551, !552, !553, !555, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !549, file: !532, line: 59, baseType: !28, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !549, file: !532, line: 62, baseType: !50, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !549, file: !532, line: 66, baseType: !554, size: 256, offset: 64)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !199)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !549, file: !532, line: 69, baseType: !55, size: 64, offset: 320)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !549, file: !532, line: 72, baseType: !55, size: 64, offset: 384)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !531, file: !532, line: 107, type: !549, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "slot0", scope: !531, file: !532, line: 831, type: !561, isLocal: true, isDefinition: true)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2048, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 256)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "quote", scope: !566, file: !532, line: 228, type: !585, isLocal: true, isDefinition: true)
!566 = distinct !DISubprogram(name: "gettext_quote", scope: !532, file: !532, line: 197, type: !567, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !531, retainedNodes: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!55, !55, !28}
!569 = !{!570, !571, !572, !573, !574}
!570 = !DILocalVariable(name: "msgid", arg: 1, scope: !566, file: !532, line: 197, type: !55)
!571 = !DILocalVariable(name: "s", arg: 2, scope: !566, file: !532, line: 197, type: !28)
!572 = !DILocalVariable(name: "translation", scope: !566, file: !532, line: 199, type: !55)
!573 = !DILocalVariable(name: "w", scope: !566, file: !532, line: 229, type: !508)
!574 = !DILocalVariable(name: "mbs", scope: !566, file: !532, line: 230, type: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !514, line: 6, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !516, line: 21, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 13, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !577, file: !516, line: 15, baseType: !50, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !577, file: !516, line: 20, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !516, line: 16, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !581, file: !516, line: 18, baseType: !7, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !581, file: !516, line: 19, baseType: !525, size: 32)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !586)
!586 = !{!277, !527}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "slotvec", scope: !531, file: !532, line: 834, type: !589, isLocal: true, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !532, line: 823, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !532, line: 825, baseType: !52, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !532, line: 826, baseType: !47, size: 64, offset: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "nslots", scope: !531, file: !532, line: 832, type: !50, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "slotvec0", scope: !531, file: !532, line: 833, type: !590, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 704, elements: !600)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!600 = !{!601}
!601 = !DISubrange(count: 11)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !604, file: !605, line: 26, type: !607, isLocal: false, isDefinition: true)
!604 = distinct !DICompileUnit(language: DW_LANG_C99, file: !605, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !606, splitDebugInlining: false, nameTableKind: None)
!605 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!606 = !{!602}
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 376, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 47)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "exit_failure", scope: !612, file: !613, line: 24, type: !615, isLocal: false, isDefinition: true)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !614, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!614 = !{!610}
!615 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !50)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "internal_state", scope: !618, file: !619, line: 97, type: !622, isLocal: true, isDefinition: true)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !620, globals: !621, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!620 = !{!49, !52, !57}
!621 = !{!616}
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !514, line: 6, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !516, line: 21, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 13, size: 64, elements: !625)
!625 = !{!626, !627}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !624, file: !516, line: 15, baseType: !50, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !624, file: !516, line: 20, baseType: !628, size: 32, offset: 32)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !624, file: !516, line: 16, size: 32, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !628, file: !516, line: 18, baseType: !7, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !628, file: !516, line: 19, baseType: !525, size: 32)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !634, file: !635, line: 211, type: !819, isLocal: true, isDefinition: true)
!634 = distinct !DISubprogram(name: "printf_fetchargs", scope: !635, file: !635, line: 42, type: !636, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !810, retainedNodes: !814)
!635 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!636 = !DISubroutineType(types: !637)
!637 = !{!50, !638, !648}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !462, line: 14, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !640, baseType: !641)
!640 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !466, size: 256, elements: !642)
!642 = !{!643, !644, !645, !646, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !641, file: !640, baseType: !49, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !641, file: !640, baseType: !49, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !641, file: !640, baseType: !49, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !641, file: !640, baseType: !50, size: 32, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !641, file: !640, baseType: !50, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !650, line: 185, baseType: !651)
!650 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 179, size: 1920, elements: !652)
!652 = !{!653, !654, !808}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !651, file: !650, line: 181, baseType: !52, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !651, file: !650, line: 182, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !650, line: 174, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 111, size: 256, elements: !658)
!658 = !{!659, !710}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !657, file: !650, line: 113, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !650, line: 108, baseType: !661)
!661 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !650, line: 47, baseType: !7, size: 32, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!663 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!664 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!665 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!666 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!667 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!668 = !DIEnumerator(name: "TYPE_INT", value: 5)
!669 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!670 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!671 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!672 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!673 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!674 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!675 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!676 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!677 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!678 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!679 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!680 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!681 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!682 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!683 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!684 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!685 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!686 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!687 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!688 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!689 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!690 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!691 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!692 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!693 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!694 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!695 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!696 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!697 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!698 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!699 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!700 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!701 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!702 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!703 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!704 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!705 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!706 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!707 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!708 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!709 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !657, file: !650, line: 172, baseType: !711, size: 128, offset: 128)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !650, line: 114, size: 128, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !723, !725, !729, !733, !736, !739, !742, !744, !747, !750, !753, !755, !757, !759, !761, !763, !765, !767, !769, !771, !773, !774, !777, !778, !782, !783, !785, !787, !788, !790, !792, !794, !796, !798, !800, !802, !804, !806}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !711, file: !650, line: 116, baseType: !152, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !711, file: !650, line: 117, baseType: !57, size: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !711, file: !650, line: 118, baseType: !238, size: 16)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !711, file: !650, line: 119, baseType: !51, size: 16)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !711, file: !650, line: 120, baseType: !50, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !711, file: !650, line: 121, baseType: !7, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !711, file: !650, line: 122, baseType: !62, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !711, file: !650, line: 123, baseType: !54, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !711, file: !650, line: 124, baseType: !722, size: 64)
!722 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !711, file: !650, line: 125, baseType: !724, size: 64)
!724 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !711, file: !650, line: 126, baseType: !726, size: 8)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !727, line: 24, baseType: !728)
!727 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !61, line: 37, baseType: !152)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !711, file: !650, line: 127, baseType: !730, size: 8)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !731, line: 24, baseType: !732)
!731 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !61, line: 38, baseType: !57)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !711, file: !650, line: 128, baseType: !734, size: 16)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !727, line: 25, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !61, line: 39, baseType: !238)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !711, file: !650, line: 129, baseType: !737, size: 16)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !731, line: 25, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !61, line: 40, baseType: !51)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !711, file: !650, line: 130, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !727, line: 26, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !61, line: 41, baseType: !50)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !711, file: !650, line: 131, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !731, line: 26, baseType: !511)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !711, file: !650, line: 132, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !727, line: 27, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !61, line: 44, baseType: !62)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !711, file: !650, line: 133, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !731, line: 27, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !61, line: 45, baseType: !54)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !711, file: !650, line: 134, baseType: !751, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !752, line: 58, baseType: !152)
!752 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!753 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !711, file: !650, line: 135, baseType: !754, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !752, line: 71, baseType: !57)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !711, file: !650, line: 136, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !752, line: 60, baseType: !62)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !711, file: !650, line: 137, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !752, line: 73, baseType: !54)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !711, file: !650, line: 138, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !752, line: 61, baseType: !62)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !711, file: !650, line: 139, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !752, line: 74, baseType: !54)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !711, file: !650, line: 140, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !752, line: 62, baseType: !62)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !711, file: !650, line: 141, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !752, line: 75, baseType: !54)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !711, file: !650, line: 142, baseType: !768, size: 32)
!768 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !711, file: !650, line: 143, baseType: !770, size: 64)
!770 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !711, file: !650, line: 144, baseType: !772, size: 128)
!772 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !711, file: !650, line: 145, baseType: !50, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !711, file: !650, line: 147, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !776, line: 20, baseType: !7)
!776 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !711, file: !650, line: 149, baseType: !55, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !711, file: !650, line: 150, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !53, line: 74, baseType: !7)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !711, file: !650, line: 151, baseType: !49, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !711, file: !650, line: 152, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !711, file: !650, line: 153, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !711, file: !650, line: 154, baseType: !376, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !711, file: !650, line: 155, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !711, file: !650, line: 156, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !711, file: !650, line: 157, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !711, file: !650, line: 158, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !711, file: !650, line: 159, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !711, file: !650, line: 160, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !711, file: !650, line: 161, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !711, file: !650, line: 162, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !711, file: !650, line: 163, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !711, file: !650, line: 164, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !651, file: !650, line: 183, baseType: !809, size: 1792, offset: 128)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 1792, elements: !282)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811, retainedTypes: !812, globals: !813, splitDebugInlining: false, nameTableKind: None)
!811 = !{!661}
!812 = !{!49}
!813 = !{!632}
!814 = !{!815, !816, !817, !818}
!815 = !DILocalVariable(name: "args", arg: 1, scope: !634, file: !635, line: 42, type: !638)
!816 = !DILocalVariable(name: "a", arg: 2, scope: !634, file: !635, line: 42, type: !648)
!817 = !DILocalVariable(name: "i", scope: !634, file: !635, line: 44, type: !52)
!818 = !DILocalVariable(name: "ap", scope: !634, file: !635, line: 45, type: !655)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 224, elements: !282)
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!822 = distinct !DICompileUnit(language: DW_LANG_C99, file: !823, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !826, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !752, line: 101, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !61, line: 72, baseType: !62)
!829 = distinct !DICompileUnit(language: DW_LANG_C99, file: !830, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !831, retainedTypes: !832, splitDebugInlining: false, nameTableKind: None)
!830 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!831 = !{!5}
!832 = !{!47, !49, !833, !863, !52}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !836, line: 55, size: 3200, elements: !837)
!836 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!837 = !{!838, !839, !840, !844, !845, !846, !847, !852, !853, !860, !862}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !835, file: !836, line: 57, baseType: !238, size: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !835, file: !836, line: 58, baseType: !235, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !835, file: !836, line: 59, baseType: !841, size: 256, offset: 64)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 256, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !835, file: !836, line: 61, baseType: !525, size: 32, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !835, file: !836, line: 63, baseType: !841, size: 256, offset: 352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !835, file: !836, line: 65, baseType: !561, size: 2048, offset: 608)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !835, file: !836, line: 67, baseType: !848, size: 32, offset: 2656)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !836, line: 42, size: 32, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !848, file: !836, line: 45, baseType: !238, size: 16)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !848, file: !836, line: 46, baseType: !238, size: 16, offset: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !835, file: !836, line: 81, baseType: !62, size: 64, offset: 2688)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !835, file: !836, line: 82, baseType: !854, size: 128, offset: 2752)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !855, line: 8, size: 128, elements: !856)
!855 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !854, file: !855, line: 14, baseType: !60, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !854, file: !855, line: 15, baseType: !859, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !61, line: 162, baseType: !62)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !835, file: !836, line: 84, baseType: !861, size: 128, offset: 2880)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 128, elements: !526)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !835, file: !836, line: 85, baseType: !173, size: 160, offset: 3008)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !752, line: 87, baseType: !62)
!864 = distinct !DICompileUnit(language: DW_LANG_C99, file: !865, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !867, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/str_endswith.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f777039c63d98023cc5b8cc1412acaf8")
!870 = distinct !DICompileUnit(language: DW_LANG_C99, file: !871, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!871 = !DIFile(filename: "lib/time.c", directory: "/src", checksumkind: CSK_MD5, checksum: "402c2ccc7a3a90dfc8381b5d9f8bcf84")
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !874, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!874 = !{!875}
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !873, line: 40, baseType: !7, size: 32, elements: !876)
!876 = !{!877}
!877 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !908, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!880 = !{!881, !893}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !882, file: !879, line: 188, baseType: !7, size: 32, elements: !891)
!882 = distinct !DISubprogram(name: "x2nrealloc", scope: !879, file: !879, line: 176, type: !883, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !886)
!883 = !DISubroutineType(types: !884)
!884 = !{!49, !49, !885, !52}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!886 = !{!887, !888, !889, !890}
!887 = !DILocalVariable(name: "p", arg: 1, scope: !882, file: !879, line: 176, type: !49)
!888 = !DILocalVariable(name: "pn", arg: 2, scope: !882, file: !879, line: 176, type: !885)
!889 = !DILocalVariable(name: "s", arg: 3, scope: !882, file: !879, line: 176, type: !52)
!890 = !DILocalVariable(name: "n", scope: !882, file: !879, line: 178, type: !52)
!891 = !{!892}
!892 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !894, file: !879, line: 228, baseType: !7, size: 32, elements: !891)
!894 = distinct !DISubprogram(name: "xpalloc", scope: !879, file: !879, line: 223, type: !895, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !898)
!895 = !DISubroutineType(types: !896)
!896 = !{!49, !49, !897, !299, !301, !299}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907}
!899 = !DILocalVariable(name: "pa", arg: 1, scope: !894, file: !879, line: 223, type: !49)
!900 = !DILocalVariable(name: "pn", arg: 2, scope: !894, file: !879, line: 223, type: !897)
!901 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !894, file: !879, line: 223, type: !299)
!902 = !DILocalVariable(name: "n_max", arg: 4, scope: !894, file: !879, line: 223, type: !301)
!903 = !DILocalVariable(name: "s", arg: 5, scope: !894, file: !879, line: 223, type: !299)
!904 = !DILocalVariable(name: "n0", scope: !894, file: !879, line: 230, type: !299)
!905 = !DILocalVariable(name: "n", scope: !894, file: !879, line: 237, type: !299)
!906 = !DILocalVariable(name: "nbytes", scope: !894, file: !879, line: 248, type: !299)
!907 = !DILocalVariable(name: "adjusted_nbytes", scope: !894, file: !879, line: 252, type: !299)
!908 = !{!47, !49, !63, !62, !54}
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "lib/xasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "284d06af3d9f59048744c48dba404142")
!913 = distinct !DICompileUnit(language: DW_LANG_C99, file: !914, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!914 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !918, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!918 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!919 = distinct !DICompileUnit(language: DW_LANG_C99, file: !920, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!920 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !925, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!925 = !{!63, !54, !49}
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !928, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!928 = !{!49, !47}
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "lib/vaszprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "69851cb8a605f8ae9d51cb31a58ffe0c")
!931 = distinct !DICompileUnit(language: DW_LANG_C99, file: !932, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811, retainedTypes: !933, splitDebugInlining: false, nameTableKind: None)
!932 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!933 = !{!47, !52, !49, !55, !7}
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !811, retainedTypes: !936, splitDebugInlining: false, nameTableKind: None)
!935 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!936 = !{!52, !937, !49, !992}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !650, line: 174, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 111, size: 256, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !939, file: !650, line: 113, baseType: !660, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !939, file: !650, line: 172, baseType: !943, size: 128, offset: 128)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !650, line: 114, size: 128, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !943, file: !650, line: 116, baseType: !152, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !943, file: !650, line: 117, baseType: !57, size: 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !943, file: !650, line: 118, baseType: !238, size: 16)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !943, file: !650, line: 119, baseType: !51, size: 16)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !943, file: !650, line: 120, baseType: !50, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !943, file: !650, line: 121, baseType: !7, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !943, file: !650, line: 122, baseType: !62, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !943, file: !650, line: 123, baseType: !54, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !943, file: !650, line: 124, baseType: !722, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !943, file: !650, line: 125, baseType: !724, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !943, file: !650, line: 126, baseType: !726, size: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !943, file: !650, line: 127, baseType: !730, size: 8)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !943, file: !650, line: 128, baseType: !734, size: 16)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !943, file: !650, line: 129, baseType: !737, size: 16)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !943, file: !650, line: 130, baseType: !740, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !943, file: !650, line: 131, baseType: !743, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !943, file: !650, line: 132, baseType: !745, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !943, file: !650, line: 133, baseType: !748, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !943, file: !650, line: 134, baseType: !751, size: 8)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !943, file: !650, line: 135, baseType: !754, size: 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !943, file: !650, line: 136, baseType: !756, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !943, file: !650, line: 137, baseType: !758, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !943, file: !650, line: 138, baseType: !760, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !943, file: !650, line: 139, baseType: !762, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !943, file: !650, line: 140, baseType: !764, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !943, file: !650, line: 141, baseType: !766, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !943, file: !650, line: 142, baseType: !768, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !943, file: !650, line: 143, baseType: !770, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !943, file: !650, line: 144, baseType: !772, size: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !943, file: !650, line: 145, baseType: !50, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !943, file: !650, line: 147, baseType: !775, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !943, file: !650, line: 149, baseType: !55, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !943, file: !650, line: 150, baseType: !779, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !943, file: !650, line: 151, baseType: !49, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !943, file: !650, line: 152, baseType: !784, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !943, file: !650, line: 153, baseType: !786, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !943, file: !650, line: 154, baseType: !376, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !943, file: !650, line: 155, baseType: !789, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !943, file: !650, line: 156, baseType: !791, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !943, file: !650, line: 157, baseType: !793, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !943, file: !650, line: 158, baseType: !795, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !943, file: !650, line: 159, baseType: !797, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !943, file: !650, line: 160, baseType: !799, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !943, file: !650, line: 161, baseType: !801, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !943, file: !650, line: 162, baseType: !803, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !943, file: !650, line: 163, baseType: !805, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !943, file: !650, line: 164, baseType: !807, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_directive", file: !994, line: 67, baseType: !995)
!994 = !DIFile(filename: "./lib/printf-parse.h", directory: "/src", checksumkind: CSK_MD5, checksum: "237aad770a29c3543ea42bd8398d6057")
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !994, line: 53, size: 704, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dir_start", scope: !995, file: !994, line: 55, baseType: !55, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dir_end", scope: !995, file: !994, line: 56, baseType: !55, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !995, file: !994, line: 57, baseType: !50, size: 32, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "width_start", scope: !995, file: !994, line: 58, baseType: !55, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "width_end", scope: !995, file: !994, line: 59, baseType: !55, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "width_arg_index", scope: !995, file: !994, line: 60, baseType: !52, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "precision_start", scope: !995, file: !994, line: 61, baseType: !55, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "precision_end", scope: !995, file: !994, line: 62, baseType: !55, size: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "precision_arg_index", scope: !995, file: !994, line: 63, baseType: !52, size: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "conversion", scope: !995, file: !994, line: 64, baseType: !48, size: 8, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "arg_index", scope: !995, file: !994, line: 65, baseType: !52, size: 64, offset: 640)
!1008 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!1009 = !{i32 7, !"Dwarf Version", i32 5}
!1010 = !{i32 2, !"Debug Info Version", i32 3}
!1011 = !{i32 1, !"wchar_size", i32 4}
