; ModuleID = 'src/whoami.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [85 x i8] c"Print the user name associated with the current effective user ID.\0ASame as id -un.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [7 x i8] c"whoami\00", align 1
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !35, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !41)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !28, globals: !40, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/whoami.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5c047d082e30b773191158ad69a0e0a3")
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !{!6, !29, !30, !35, !36, !37, !39}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !31, line: 102, baseType: !32)
!31 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !33, line: 73, baseType: !34)
!33 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!34 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !38, line: 46, baseType: !34)
!38 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!0}
!41 = !{!42, !43, !44, !47, !49, !50, !51, !55, !56, !57, !58, !60, !116, !117, !118, !120, !121}
!42 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!43 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!44 = !DILocalVariable(name: "term", scope: !45, file: !3, line: 585, type: !6)
!45 = distinct !DILexicalBlock(scope: !46, file: !3, line: 582, column: 5)
!46 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!47 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !48)
!48 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!49 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!50 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!51 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 608, type: !6)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 605, column: 5)
!53 = distinct !DILexicalBlock(scope: !54, file: !3, line: 604, column: 12)
!54 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!55 = !DILocalVariable(name: "spaces", scope: !52, file: !3, line: 609, type: !37)
!56 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !37)
!57 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!58 = !DILocalVariable(name: "__ptr", scope: !59, file: !3, line: 644, type: !6)
!59 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!60 = !DILocalVariable(name: "__stream", scope: !59, file: !3, line: 644, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !83, !85, !86, !87, !90, !91, !93, !97, !100, !102, !105, !108, !109, !110, !111, !112}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !35, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !69, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !69, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !69, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !69, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !69, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !69, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !69, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !69, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !69, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !69, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !35, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !35, size: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !33, line: 152, baseType: !89)
!89 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !36, size: 16, offset: 1024)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !33, line: 153, baseType: !89)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !84, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !29, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !37, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !35, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DILocalVariable(name: "__cnt", scope: !59, file: !3, line: 644, type: !37)
!117 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!118 = !DILocalVariable(name: "__ptr", scope: !119, file: !3, line: 686, type: !6)
!119 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!120 = !DILocalVariable(name: "__stream", scope: !119, file: !3, line: 686, type: !61)
!121 = !DILocalVariable(name: "__cnt", scope: !119, file: !3, line: 686, type: !37)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "Version", scope: !124, file: !125, line: 3, type: !6, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!126 = !{!122}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "file_name", scope: !129, file: !130, line: 45, type: !6, isLocal: true, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !131, splitDebugInlining: false, nameTableKind: None)
!130 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!131 = !{!127, !132}
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !129, file: !130, line: 55, type: !48, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !136, file: !137, line: 66, type: !172, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !138, globals: !139, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!138 = !{!29, !39}
!139 = !{!140, !166, !134, !168, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "old_file_name", scope: !142, file: !137, line: 304, type: !6, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "verror_at_line", scope: !137, file: !137, line: 298, type: !143, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !159)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !35, !35, !6, !14, !6, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !146, line: 52, baseType: !147)
!146 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !148, line: 32, baseType: !149)
!148 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !150, baseType: !151)
!150 = !DIFile(filename: "lib/error.c", directory: "/src")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !152, size: 256, elements: !153)
!152 = !DINamespace(name: "std", scope: null)
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !151, file: !150, baseType: !29, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !151, file: !150, baseType: !29, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !151, file: !150, baseType: !29, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !151, file: !150, baseType: !35, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !151, file: !150, baseType: !35, size: 32, offset: 224)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(name: "status", arg: 1, scope: !142, file: !137, line: 298, type: !35)
!161 = !DILocalVariable(name: "errnum", arg: 2, scope: !142, file: !137, line: 298, type: !35)
!162 = !DILocalVariable(name: "file_name", arg: 3, scope: !142, file: !137, line: 298, type: !6)
!163 = !DILocalVariable(name: "line_number", arg: 4, scope: !142, file: !137, line: 298, type: !14)
!164 = !DILocalVariable(name: "message", arg: 5, scope: !142, file: !137, line: 298, type: !6)
!165 = !DILocalVariable(name: "args", arg: 6, scope: !142, file: !137, line: 298, type: !145)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "old_line_number", scope: !142, file: !137, line: 305, type: !14, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "error_message_count", scope: !136, file: !137, line: 69, type: !14, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !136, file: !137, line: 295, type: !35, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "long_options", scope: !177, file: !178, line: 34, type: !180, isLocal: true, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !179, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!179 = !{!175}
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 768, elements: !190)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !183, line: 50, size: 256, elements: !184)
!183 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!184 = !{!185, !186, !187, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !183, line: 52, baseType: !6, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !182, file: !183, line: 55, baseType: !35, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !183, line: 56, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !182, file: !183, line: 57, baseType: !35, size: 32, offset: 192)
!190 = !{!191}
!191 = !DISubrange(count: 3)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "program_name", scope: !194, file: !195, line: 31, type: !6, isLocal: false, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !196, globals: !197, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!196 = !{!69}
!197 = !{!192}
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "utf07FF", scope: !200, file: !201, line: 46, type: !231, isLocal: true, isDefinition: true)
!200 = distinct !DISubprogram(name: "proper_name_lite", scope: !201, file: !201, line: 38, type: !202, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !204, retainedNodes: !206)
!201 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!202 = !DISubroutineType(types: !203)
!203 = !{!6, !6, !6}
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !205, splitDebugInlining: false, nameTableKind: None)
!205 = !{!198}
!206 = !{!207, !208, !209, !210, !215}
!207 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !200, file: !201, line: 38, type: !6)
!208 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !200, file: !201, line: 38, type: !6)
!209 = !DILocalVariable(name: "translation", scope: !200, file: !201, line: 40, type: !6)
!210 = !DILocalVariable(name: "w", scope: !200, file: !201, line: 47, type: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !212, line: 37, baseType: !213)
!212 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !33, line: 57, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 42, baseType: !14)
!215 = !DILocalVariable(name: "mbs", scope: !200, file: !201, line: 48, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !217, line: 6, baseType: !218)
!217 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !219, line: 21, baseType: !220)
!219 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 13, size: 64, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !220, file: !219, line: 15, baseType: !35, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !220, file: !219, line: 20, baseType: !224, size: 32, offset: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !220, file: !219, line: 16, size: 32, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !224, file: !219, line: 18, baseType: !14, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !224, file: !219, line: 19, baseType: !228, size: 32)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 4)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 2)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !236, file: !237, line: 76, type: !319, isLocal: false, isDefinition: true)
!236 = distinct !DICompileUnit(language: DW_LANG_C99, file: !237, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !238, retainedTypes: !258, globals: !259, splitDebugInlining: false, nameTableKind: None)
!237 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!238 = !{!239, !253, !12}
!239 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !240, line: 42, baseType: !14, size: 32, elements: !241)
!240 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!242 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!243 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!244 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!245 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!246 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!247 = !DIEnumerator(name: "c_quoting_style", value: 5)
!248 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!249 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!250 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!251 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!252 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !240, line: 254, baseType: !14, size: 32, elements: !254)
!254 = !{!255, !256, !257}
!255 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!256 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!257 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!258 = !{!35, !36, !37}
!259 = !{!234, !260, !266, !278, !280, !285, !308, !315, !317}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !236, file: !237, line: 92, type: !262, isLocal: false, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 320, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!264 = !{!265}
!265 = !DISubrange(count: 10)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !236, file: !237, line: 1040, type: !268, isLocal: false, isDefinition: true)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !237, line: 56, size: 448, elements: !269)
!269 = !{!270, !271, !272, !276, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !268, file: !237, line: 59, baseType: !239, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !237, line: 62, baseType: !35, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !268, file: !237, line: 66, baseType: !273, size: 256, offset: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !268, file: !237, line: 69, baseType: !6, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !268, file: !237, line: 72, baseType: !6, size: 64, offset: 384)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !236, file: !237, line: 107, type: !268, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "slot0", scope: !236, file: !237, line: 831, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 256)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "quote", scope: !287, file: !237, line: 228, type: !306, isLocal: true, isDefinition: true)
!287 = distinct !DISubprogram(name: "gettext_quote", scope: !237, file: !237, line: 197, type: !288, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !290)
!288 = !DISubroutineType(types: !289)
!289 = !{!6, !6, !239}
!290 = !{!291, !292, !293, !294, !295}
!291 = !DILocalVariable(name: "msgid", arg: 1, scope: !287, file: !237, line: 197, type: !6)
!292 = !DILocalVariable(name: "s", arg: 2, scope: !287, file: !237, line: 197, type: !239)
!293 = !DILocalVariable(name: "translation", scope: !287, file: !237, line: 199, type: !6)
!294 = !DILocalVariable(name: "w", scope: !287, file: !237, line: 229, type: !211)
!295 = !DILocalVariable(name: "mbs", scope: !287, file: !237, line: 230, type: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !217, line: 6, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !219, line: 21, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 13, size: 64, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !298, file: !219, line: 15, baseType: !35, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !298, file: !219, line: 20, baseType: !302, size: 32, offset: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !219, line: 16, size: 32, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !302, file: !219, line: 18, baseType: !14, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !302, file: !219, line: 19, baseType: !228, size: 32)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !307)
!307 = !{!233, !230}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "slotvec", scope: !236, file: !237, line: 834, type: !310, isLocal: true, isDefinition: true)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !237, line: 823, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !311, file: !237, line: 825, baseType: !37, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !311, file: !237, line: 826, baseType: !69, size: 64, offset: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "nslots", scope: !236, file: !237, line: 832, type: !35, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "slotvec0", scope: !236, file: !237, line: 833, type: !311, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 704, elements: !321)
!320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!321 = !{!322}
!322 = !DISubrange(count: 11)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !325, file: !326, line: 26, type: !328, isLocal: false, isDefinition: true)
!325 = distinct !DICompileUnit(language: DW_LANG_C99, file: !326, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !327, splitDebugInlining: false, nameTableKind: None)
!326 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!327 = !{!323}
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 47)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "exit_failure", scope: !333, file: !334, line: 24, type: !336, isLocal: false, isDefinition: true)
!333 = distinct !DICompileUnit(language: DW_LANG_C99, file: !334, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !335, splitDebugInlining: false, nameTableKind: None)
!334 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!335 = !{!331}
!336 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !35)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "internal_state", scope: !339, file: !340, line: 97, type: !343, isLocal: true, isDefinition: true)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !341, globals: !342, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!341 = !{!29, !37, !39}
!342 = !{!337}
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !217, line: 6, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !219, line: 21, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 13, size: 64, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !345, file: !219, line: 15, baseType: !35, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !345, file: !219, line: 20, baseType: !349, size: 32, offset: 32)
!349 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !345, file: !219, line: 16, size: 32, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !349, file: !219, line: 18, baseType: !14, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !349, file: !219, line: 19, baseType: !228, size: 32)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !354, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!354 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !357, retainedTypes: !361, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!357 = !{!358}
!358 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !356, line: 40, baseType: !14, size: 32, elements: !359)
!359 = !{!360}
!360 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!361 = !{!29}
!362 = distinct !DICompileUnit(language: DW_LANG_C99, file: !363, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !364, retainedTypes: !395, splitDebugInlining: false, nameTableKind: None)
!363 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!364 = !{!365, !377}
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !366, file: !363, line: 188, baseType: !14, size: 32, elements: !375)
!366 = distinct !DISubprogram(name: "x2nrealloc", scope: !363, file: !363, line: 176, type: !367, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !362, retainedNodes: !370)
!367 = !DISubroutineType(types: !368)
!368 = !{!29, !29, !369, !37}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!370 = !{!371, !372, !373, !374}
!371 = !DILocalVariable(name: "p", arg: 1, scope: !366, file: !363, line: 176, type: !29)
!372 = !DILocalVariable(name: "pn", arg: 2, scope: !366, file: !363, line: 176, type: !369)
!373 = !DILocalVariable(name: "s", arg: 3, scope: !366, file: !363, line: 176, type: !37)
!374 = !DILocalVariable(name: "n", scope: !366, file: !363, line: 178, type: !37)
!375 = !{!376}
!376 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !378, file: !363, line: 228, baseType: !14, size: 32, elements: !375)
!378 = distinct !DISubprogram(name: "xpalloc", scope: !363, file: !363, line: 223, type: !379, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !362, retainedNodes: !385)
!379 = !DISubroutineType(types: !380)
!380 = !{!29, !29, !381, !382, !384, !382}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !383, line: 130, baseType: !384)
!383 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !38, line: 35, baseType: !89)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394}
!386 = !DILocalVariable(name: "pa", arg: 1, scope: !378, file: !363, line: 223, type: !29)
!387 = !DILocalVariable(name: "pn", arg: 2, scope: !378, file: !363, line: 223, type: !381)
!388 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !378, file: !363, line: 223, type: !382)
!389 = !DILocalVariable(name: "n_max", arg: 4, scope: !378, file: !363, line: 223, type: !384)
!390 = !DILocalVariable(name: "s", arg: 5, scope: !378, file: !363, line: 223, type: !382)
!391 = !DILocalVariable(name: "n0", scope: !378, file: !363, line: 230, type: !382)
!392 = !DILocalVariable(name: "n", scope: !378, file: !363, line: 237, type: !382)
!393 = !DILocalVariable(name: "nbytes", scope: !378, file: !363, line: 248, type: !382)
!394 = !DILocalVariable(name: "adjusted_nbytes", scope: !378, file: !363, line: 252, type: !382)
!395 = !{!69, !29, !48, !89, !34}
!396 = distinct !DICompileUnit(language: DW_LANG_C99, file: !397, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!397 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !408, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!408 = !{!48, !34, !29}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!410 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !361, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!415 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!416 = !{i32 7, !"Dwarf Version", i32 5}
!417 = !{i32 2, !"Debug Info Version", i32 3}
!418 = !{i32 1, !"wchar_size", i32 4}
!419 = !{i32 1, !"branch-target-enforcement", i32 0}
!420 = !{i32 1, !"sign-return-address", i32 0}
!421 = !{i32 1, !"sign-return-address-all", i32 0}
!422 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!423 = !{i32 7, !"PIC Level", i32 2}
!424 = !{i32 7, !"PIE Level", i32 2}
!425 = !{i32 7, !"uwtable", i32 1}
!426 = !{i32 7, !"frame-pointer", i32 1}
!427 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 36, type: !428, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !35}
!430 = !{!431}
!431 = !DILocalVariable(name: "status", arg: 1, scope: !427, file: !10, line: 36, type: !35)
!432 = !DILocation(line: 0, scope: !427)
!433 = !DILocation(line: 38, column: 14, scope: !434)
!434 = distinct !DILexicalBlock(scope: !427, file: !10, line: 38, column: 7)
!435 = !DILocation(line: 38, column: 7, scope: !427)
!436 = !DILocation(line: 39, column: 5, scope: !437)
!437 = distinct !DILexicalBlock(scope: !434, file: !10, line: 39, column: 5)
!438 = !{!439, !439, i64 0}
!439 = !{!"any pointer", !440, i64 0}
!440 = !{!"omnipotent char", !441, i64 0}
!441 = !{!"Simple C/C++ TBAA"}
!442 = !DILocation(line: 42, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !434, file: !10, line: 41, column: 5)
!444 = !DILocation(line: 43, column: 7, scope: !443)
!445 = !DILocation(line: 48, column: 7, scope: !443)
!446 = !DILocation(line: 49, column: 7, scope: !443)
!447 = !DILocalVariable(name: "program", arg: 1, scope: !448, file: !3, line: 836, type: !6)
!448 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !449, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !6}
!451 = !{!447, !452, !461, !462, !464, !465}
!452 = !DILocalVariable(name: "infomap", scope: !448, file: !3, line: 838, type: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 896, elements: !459)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !448, file: !3, line: 838, size: 128, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !455, file: !3, line: 838, baseType: !6, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !455, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!459 = !{!460}
!460 = !DISubrange(count: 7)
!461 = !DILocalVariable(name: "node", scope: !448, file: !3, line: 848, type: !6)
!462 = !DILocalVariable(name: "map_prog", scope: !448, file: !3, line: 849, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!464 = !DILocalVariable(name: "lc_messages", scope: !448, file: !3, line: 861, type: !6)
!465 = !DILocalVariable(name: "url_program", scope: !448, file: !3, line: 874, type: !6)
!466 = !DILocation(line: 0, scope: !448, inlinedAt: !467)
!467 = distinct !DILocation(line: 50, column: 7, scope: !443)
!468 = !DILocation(line: 838, column: 3, scope: !448, inlinedAt: !467)
!469 = !DILocation(line: 838, column: 67, scope: !448, inlinedAt: !467)
!470 = !DILocation(line: 849, column: 36, scope: !448, inlinedAt: !467)
!471 = !DILocation(line: 851, column: 3, scope: !448, inlinedAt: !467)
!472 = !DILocalVariable(name: "__s1", arg: 1, scope: !473, file: !474, line: 1359, type: !6)
!473 = distinct !DISubprogram(name: "streq", scope: !474, file: !474, line: 1359, type: !475, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !477)
!474 = !DIFile(filename: "./lib/string.h", directory: "/src")
!475 = !DISubroutineType(types: !476)
!476 = !{!48, !6, !6}
!477 = !{!472, !478}
!478 = !DILocalVariable(name: "__s2", arg: 2, scope: !473, file: !474, line: 1359, type: !6)
!479 = !DILocation(line: 0, scope: !473, inlinedAt: !480)
!480 = distinct !DILocation(line: 851, column: 33, scope: !448, inlinedAt: !467)
!481 = !DILocation(line: 1361, column: 11, scope: !473, inlinedAt: !480)
!482 = !DILocation(line: 1361, column: 10, scope: !473, inlinedAt: !480)
!483 = !DILocation(line: 852, column: 13, scope: !448, inlinedAt: !467)
!484 = !DILocation(line: 851, column: 20, scope: !448, inlinedAt: !467)
!485 = !{!486, !439, i64 0}
!486 = !{!"infomap", !439, i64 0, !439, i64 8}
!487 = !DILocation(line: 851, column: 10, scope: !448, inlinedAt: !467)
!488 = !DILocation(line: 851, column: 28, scope: !448, inlinedAt: !467)
!489 = distinct !{!489, !471, !483, !490}
!490 = !{!"llvm.loop.mustprogress"}
!491 = !DILocation(line: 854, column: 17, scope: !492, inlinedAt: !467)
!492 = distinct !DILexicalBlock(scope: !448, file: !3, line: 854, column: 7)
!493 = !{!486, !439, i64 8}
!494 = !DILocation(line: 854, column: 7, scope: !492, inlinedAt: !467)
!495 = !DILocation(line: 854, column: 7, scope: !448, inlinedAt: !467)
!496 = !DILocation(line: 857, column: 3, scope: !448, inlinedAt: !467)
!497 = !DILocation(line: 861, column: 29, scope: !448, inlinedAt: !467)
!498 = !DILocation(line: 862, column: 7, scope: !499, inlinedAt: !467)
!499 = distinct !DILexicalBlock(scope: !448, file: !3, line: 862, column: 7)
!500 = !DILocation(line: 862, column: 19, scope: !499, inlinedAt: !467)
!501 = !DILocation(line: 862, column: 22, scope: !499, inlinedAt: !467)
!502 = !DILocation(line: 862, column: 7, scope: !448, inlinedAt: !467)
!503 = !DILocation(line: 868, column: 7, scope: !504, inlinedAt: !467)
!504 = distinct !DILexicalBlock(scope: !499, file: !3, line: 863, column: 5)
!505 = !DILocation(line: 870, column: 5, scope: !504, inlinedAt: !467)
!506 = !DILocation(line: 0, scope: !473, inlinedAt: !507)
!507 = distinct !DILocation(line: 874, column: 29, scope: !448, inlinedAt: !467)
!508 = !DILocation(line: 875, column: 3, scope: !448, inlinedAt: !467)
!509 = !DILocation(line: 877, column: 3, scope: !448, inlinedAt: !467)
!510 = !DILocation(line: 879, column: 1, scope: !448, inlinedAt: !467)
!511 = !DILocation(line: 52, column: 3, scope: !427)
!512 = !DISubprogram(name: "dcgettext", scope: !513, file: !513, line: 51, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!513 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!514 = !DISubroutineType(types: !515)
!515 = !{!69, !6, !6, !35}
!516 = !{}
!517 = !DISubprogram(name: "fputs_unlocked", scope: !146, file: !146, line: 691, type: !518, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!518 = !DISubroutineType(types: !519)
!519 = !{!35, !520, !521}
!520 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!521 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!522 = !DILocation(line: 0, scope: !2)
!523 = !DILocation(line: 581, column: 7, scope: !46)
!524 = !{!525, !525, i64 0}
!525 = !{!"int", !440, i64 0}
!526 = !DILocation(line: 581, column: 19, scope: !46)
!527 = !DILocation(line: 581, column: 7, scope: !2)
!528 = !DILocation(line: 585, column: 26, scope: !45)
!529 = !DILocation(line: 0, scope: !45)
!530 = !DILocation(line: 586, column: 23, scope: !45)
!531 = !DILocation(line: 586, column: 28, scope: !45)
!532 = !DILocation(line: 586, column: 32, scope: !45)
!533 = !{!440, !440, i64 0}
!534 = !DILocation(line: 586, column: 38, scope: !45)
!535 = !DILocation(line: 0, scope: !473, inlinedAt: !536)
!536 = distinct !DILocation(line: 586, column: 41, scope: !45)
!537 = !DILocation(line: 1361, column: 11, scope: !473, inlinedAt: !536)
!538 = !DILocation(line: 1361, column: 10, scope: !473, inlinedAt: !536)
!539 = !DILocation(line: 586, column: 19, scope: !45)
!540 = !DILocation(line: 587, column: 5, scope: !45)
!541 = !DILocation(line: 588, column: 7, scope: !542)
!542 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!543 = !DILocation(line: 588, column: 7, scope: !2)
!544 = !DILocation(line: 590, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !3, line: 589, column: 5)
!546 = !DILocation(line: 591, column: 7, scope: !545)
!547 = !DILocation(line: 595, column: 37, scope: !2)
!548 = !DILocation(line: 595, column: 35, scope: !2)
!549 = !DILocation(line: 596, column: 29, scope: !2)
!550 = !DILocation(line: 597, column: 8, scope: !54)
!551 = !DILocation(line: 597, column: 7, scope: !2)
!552 = !DILocation(line: 604, column: 24, scope: !53)
!553 = !DILocation(line: 604, column: 12, scope: !54)
!554 = !DILocation(line: 0, scope: !52)
!555 = !DILocation(line: 610, column: 16, scope: !52)
!556 = !DILocation(line: 610, column: 7, scope: !52)
!557 = !DILocation(line: 611, column: 21, scope: !52)
!558 = !{!559, !559, i64 0}
!559 = !{!"short", !440, i64 0}
!560 = !DILocation(line: 611, column: 19, scope: !52)
!561 = !DILocation(line: 611, column: 16, scope: !52)
!562 = !DILocation(line: 610, column: 30, scope: !52)
!563 = distinct !{!563, !556, !557, !490}
!564 = !DILocation(line: 612, column: 18, scope: !565)
!565 = distinct !DILexicalBlock(scope: !52, file: !3, line: 612, column: 11)
!566 = !DILocation(line: 612, column: 11, scope: !52)
!567 = !DILocation(line: 620, column: 23, scope: !2)
!568 = !DILocation(line: 625, column: 39, scope: !2)
!569 = !DILocation(line: 626, column: 3, scope: !2)
!570 = !DILocation(line: 626, column: 10, scope: !2)
!571 = !DILocation(line: 626, column: 21, scope: !2)
!572 = !DILocation(line: 628, column: 44, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 628, column: 11)
!574 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!575 = !DILocation(line: 628, column: 32, scope: !573)
!576 = !DILocation(line: 628, column: 49, scope: !573)
!577 = !DILocation(line: 628, column: 11, scope: !574)
!578 = !DILocation(line: 630, column: 11, scope: !579)
!579 = distinct !DILexicalBlock(scope: !574, file: !3, line: 630, column: 11)
!580 = !DILocation(line: 630, column: 11, scope: !574)
!581 = !DILocation(line: 632, column: 26, scope: !582)
!582 = distinct !DILexicalBlock(scope: !583, file: !3, line: 632, column: 15)
!583 = distinct !DILexicalBlock(scope: !579, file: !3, line: 631, column: 9)
!584 = !DILocation(line: 632, column: 34, scope: !582)
!585 = !DILocation(line: 632, column: 37, scope: !582)
!586 = !DILocation(line: 632, column: 15, scope: !583)
!587 = !DILocation(line: 636, column: 29, scope: !588)
!588 = distinct !DILexicalBlock(scope: !583, file: !3, line: 636, column: 15)
!589 = !DILocation(line: 640, column: 16, scope: !574)
!590 = distinct !{!590, !569, !591, !490}
!591 = !DILocation(line: 641, column: 5, scope: !2)
!592 = !DILocation(line: 644, column: 3, scope: !2)
!593 = !DILocation(line: 0, scope: !473, inlinedAt: !594)
!594 = distinct !DILocation(line: 648, column: 31, scope: !2)
!595 = !DILocation(line: 0, scope: !473, inlinedAt: !596)
!596 = distinct !DILocation(line: 649, column: 31, scope: !2)
!597 = !DILocation(line: 0, scope: !473, inlinedAt: !598)
!598 = distinct !DILocation(line: 650, column: 31, scope: !2)
!599 = !DILocation(line: 0, scope: !473, inlinedAt: !600)
!600 = distinct !DILocation(line: 651, column: 31, scope: !2)
!601 = !DILocation(line: 0, scope: !473, inlinedAt: !602)
!602 = distinct !DILocation(line: 652, column: 31, scope: !2)
!603 = !DILocation(line: 0, scope: !473, inlinedAt: !604)
!604 = distinct !DILocation(line: 653, column: 31, scope: !2)
!605 = !DILocation(line: 0, scope: !473, inlinedAt: !606)
!606 = distinct !DILocation(line: 654, column: 31, scope: !2)
!607 = !DILocation(line: 0, scope: !473, inlinedAt: !608)
!608 = distinct !DILocation(line: 655, column: 31, scope: !2)
!609 = !DILocation(line: 0, scope: !473, inlinedAt: !610)
!610 = distinct !DILocation(line: 656, column: 31, scope: !2)
!611 = !DILocation(line: 0, scope: !473, inlinedAt: !612)
!612 = distinct !DILocation(line: 657, column: 31, scope: !2)
!613 = !DILocation(line: 663, column: 7, scope: !614)
!614 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!615 = !DILocation(line: 664, column: 7, scope: !614)
!616 = !DILocation(line: 664, column: 10, scope: !614)
!617 = !DILocation(line: 663, column: 7, scope: !2)
!618 = !DILocation(line: 669, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !614, file: !3, line: 665, column: 5)
!620 = !DILocation(line: 671, column: 5, scope: !619)
!621 = !DILocation(line: 676, column: 7, scope: !622)
!622 = distinct !DILexicalBlock(scope: !614, file: !3, line: 673, column: 5)
!623 = !DILocation(line: 679, column: 3, scope: !2)
!624 = !DILocation(line: 683, column: 3, scope: !2)
!625 = !DILocation(line: 686, column: 3, scope: !2)
!626 = !DILocation(line: 688, column: 3, scope: !2)
!627 = !DILocation(line: 691, column: 3, scope: !2)
!628 = !DILocation(line: 695, column: 3, scope: !2)
!629 = !DILocation(line: 696, column: 1, scope: !2)
!630 = !DISubprogram(name: "setlocale", scope: !631, file: !631, line: 122, type: !632, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!631 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!632 = !DISubroutineType(types: !633)
!633 = !{!69, !35, !6}
!634 = !DISubprogram(name: "getenv", scope: !635, file: !635, line: 641, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!635 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!636 = !DISubroutineType(types: !637)
!637 = !{!69, !6}
!638 = !DISubprogram(name: "fwrite_unlocked", scope: !146, file: !146, line: 704, type: !639, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!639 = !DISubroutineType(types: !640)
!640 = !{!37, !641, !37, !37, !521}
!641 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!644 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 56, type: !645, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !648)
!645 = !DISubroutineType(types: !646)
!646 = !{!35, !35, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!648 = !{!649, !650, !651, !655, !656}
!649 = !DILocalVariable(name: "argc", arg: 1, scope: !644, file: !10, line: 56, type: !35)
!650 = !DILocalVariable(name: "argv", arg: 2, scope: !644, file: !10, line: 56, type: !647)
!651 = !DILocalVariable(name: "NO_UID", scope: !644, file: !10, line: 58, type: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !653, line: 79, baseType: !654)
!653 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !33, line: 146, baseType: !14)
!655 = !DILocalVariable(name: "uid", scope: !644, file: !10, line: 79, type: !652)
!656 = !DILocalVariable(name: "pw", scope: !644, file: !10, line: 80, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !659, line: 49, size: 384, elements: !660)
!659 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!660 = !{!661, !662, !663, !664, !666, !667, !668}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !658, file: !659, line: 51, baseType: !69, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !658, file: !659, line: 52, baseType: !69, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !658, file: !659, line: 54, baseType: !654, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !658, file: !659, line: 55, baseType: !665, size: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !33, line: 147, baseType: !14)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !658, file: !659, line: 56, baseType: !69, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !658, file: !659, line: 57, baseType: !69, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !658, file: !659, line: 58, baseType: !69, size: 64, offset: 320)
!669 = !DILocation(line: 0, scope: !644)
!670 = !DILocation(line: 61, column: 21, scope: !644)
!671 = !DILocation(line: 61, column: 3, scope: !644)
!672 = !DILocation(line: 62, column: 3, scope: !644)
!673 = !DILocation(line: 63, column: 3, scope: !644)
!674 = !DILocation(line: 64, column: 3, scope: !644)
!675 = !DILocation(line: 66, column: 3, scope: !644)
!676 = !DILocation(line: 69, column: 36, scope: !644)
!677 = !DILocation(line: 69, column: 58, scope: !644)
!678 = !DILocation(line: 68, column: 3, scope: !644)
!679 = !DILocation(line: 72, column: 7, scope: !680)
!680 = distinct !DILexicalBlock(scope: !644, file: !10, line: 72, column: 7)
!681 = !DILocation(line: 72, column: 14, scope: !680)
!682 = !DILocation(line: 72, column: 7, scope: !644)
!683 = !DILocation(line: 74, column: 7, scope: !684)
!684 = distinct !DILexicalBlock(scope: !680, file: !10, line: 73, column: 5)
!685 = !DILocation(line: 75, column: 7, scope: !684)
!686 = !DILocation(line: 78, column: 3, scope: !644)
!687 = !DILocation(line: 78, column: 9, scope: !644)
!688 = !DILocation(line: 79, column: 15, scope: !644)
!689 = !DILocation(line: 80, column: 27, scope: !644)
!690 = !DILocation(line: 80, column: 37, scope: !644)
!691 = !DILocation(line: 80, column: 40, scope: !644)
!692 = !DILocation(line: 80, column: 23, scope: !644)
!693 = !DILocation(line: 80, column: 55, scope: !644)
!694 = !DILocation(line: 81, column: 8, scope: !695)
!695 = distinct !DILexicalBlock(scope: !644, file: !10, line: 81, column: 7)
!696 = !DILocation(line: 81, column: 7, scope: !644)
!697 = !DILocation(line: 82, column: 5, scope: !695)
!698 = !DILocation(line: 84, column: 13, scope: !644)
!699 = !{!700, !439, i64 0}
!700 = !{!"passwd", !439, i64 0, !439, i64 8, !525, i64 16, !525, i64 20, !439, i64 24, !439, i64 32, !439, i64 40}
!701 = !DILocation(line: 84, column: 3, scope: !644)
!702 = !DILocation(line: 85, column: 3, scope: !644)
!703 = !DISubprogram(name: "bindtextdomain", scope: !513, file: !513, line: 86, type: !704, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!704 = !DISubroutineType(types: !705)
!705 = !{!69, !6, !6}
!706 = !DISubprogram(name: "textdomain", scope: !513, file: !513, line: 82, type: !636, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!707 = !DISubprogram(name: "atexit", scope: !635, file: !635, line: 602, type: !708, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!708 = !DISubroutineType(types: !709)
!709 = !{!35, !172}
!710 = !DISubprogram(name: "geteuid", scope: !711, file: !711, line: 700, type: !712, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!711 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!712 = !DISubroutineType(types: !713)
!713 = !{!654}
!714 = !DISubprogram(name: "getpwuid", scope: !659, file: !659, line: 110, type: !715, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!715 = !DISubroutineType(types: !716)
!716 = !{!657, !654}
!717 = !DISubprogram(name: "puts", scope: !146, file: !146, line: 661, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!718 = !DISubroutineType(types: !719)
!719 = !{!35, !6}
!720 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !130, file: !130, line: 50, type: !449, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !721)
!721 = !{!722}
!722 = !DILocalVariable(name: "file", arg: 1, scope: !720, file: !130, line: 50, type: !6)
!723 = !DILocation(line: 0, scope: !720)
!724 = !DILocation(line: 52, column: 13, scope: !720)
!725 = !DILocation(line: 53, column: 1, scope: !720)
!726 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !130, file: !130, line: 87, type: !727, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !729)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !48}
!729 = !{!730}
!730 = !DILocalVariable(name: "ignore", arg: 1, scope: !726, file: !130, line: 87, type: !48)
!731 = !DILocation(line: 0, scope: !726)
!732 = !DILocation(line: 89, column: 16, scope: !726)
!733 = !{!734, !734, i64 0}
!734 = !{!"_Bool", !440, i64 0}
!735 = !DILocation(line: 90, column: 1, scope: !726)
!736 = distinct !DISubprogram(name: "close_stdout", scope: !130, file: !130, line: 116, type: !173, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !737)
!737 = !{!738}
!738 = !DILocalVariable(name: "write_error", scope: !739, file: !130, line: 121, type: !6)
!739 = distinct !DILexicalBlock(scope: !740, file: !130, line: 120, column: 5)
!740 = distinct !DILexicalBlock(scope: !736, file: !130, line: 118, column: 7)
!741 = !DILocation(line: 118, column: 21, scope: !740)
!742 = !DILocation(line: 118, column: 7, scope: !740)
!743 = !DILocation(line: 118, column: 29, scope: !740)
!744 = !DILocation(line: 119, column: 7, scope: !740)
!745 = !DILocation(line: 119, column: 12, scope: !740)
!746 = !{i8 0, i8 2}
!747 = !DILocation(line: 119, column: 25, scope: !740)
!748 = !DILocation(line: 119, column: 28, scope: !740)
!749 = !DILocation(line: 119, column: 34, scope: !740)
!750 = !DILocation(line: 118, column: 7, scope: !736)
!751 = !DILocation(line: 121, column: 33, scope: !739)
!752 = !DILocation(line: 0, scope: !739)
!753 = !DILocation(line: 122, column: 11, scope: !754)
!754 = distinct !DILexicalBlock(scope: !739, file: !130, line: 122, column: 11)
!755 = !DILocation(line: 0, scope: !754)
!756 = !DILocation(line: 122, column: 11, scope: !739)
!757 = !DILocation(line: 123, column: 9, scope: !754)
!758 = !DILocation(line: 126, column: 9, scope: !754)
!759 = !DILocation(line: 128, column: 14, scope: !739)
!760 = !DILocation(line: 128, column: 7, scope: !739)
!761 = !DILocation(line: 133, column: 42, scope: !762)
!762 = distinct !DILexicalBlock(scope: !736, file: !130, line: 133, column: 7)
!763 = !DILocation(line: 133, column: 28, scope: !762)
!764 = !DILocation(line: 133, column: 50, scope: !762)
!765 = !DILocation(line: 133, column: 7, scope: !736)
!766 = !DILocation(line: 134, column: 12, scope: !762)
!767 = !DILocation(line: 134, column: 5, scope: !762)
!768 = !DILocation(line: 135, column: 1, scope: !736)
!769 = distinct !DISubprogram(name: "verror", scope: !137, file: !137, line: 251, type: !770, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !772)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !35, !35, !6, !145}
!772 = !{!773, !774, !775, !776}
!773 = !DILocalVariable(name: "status", arg: 1, scope: !769, file: !137, line: 251, type: !35)
!774 = !DILocalVariable(name: "errnum", arg: 2, scope: !769, file: !137, line: 251, type: !35)
!775 = !DILocalVariable(name: "message", arg: 3, scope: !769, file: !137, line: 251, type: !6)
!776 = !DILocalVariable(name: "args", arg: 4, scope: !769, file: !137, line: 251, type: !145)
!777 = !DILocation(line: 0, scope: !769)
!778 = !DILocation(line: 251, column: 1, scope: !769)
!779 = !DILocation(line: 261, column: 3, scope: !769)
!780 = !DILocation(line: 265, column: 7, scope: !781)
!781 = distinct !DILexicalBlock(scope: !769, file: !137, line: 265, column: 7)
!782 = !DILocation(line: 265, column: 7, scope: !769)
!783 = !DILocation(line: 266, column: 5, scope: !781)
!784 = !DILocation(line: 272, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !137, line: 268, column: 5)
!786 = !DILocation(line: 276, column: 3, scope: !769)
!787 = !{i64 0, i64 8, !438, i64 8, i64 8, !438, i64 16, i64 8, !438, i64 24, i64 4, !524, i64 28, i64 4, !524}
!788 = !DILocation(line: 282, column: 1, scope: !769)
!789 = distinct !DISubprogram(name: "flush_stdout", scope: !137, file: !137, line: 163, type: !173, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !790)
!790 = !{!791}
!791 = !DILocalVariable(name: "stdout_fd", scope: !789, file: !137, line: 166, type: !35)
!792 = !DILocation(line: 0, scope: !789)
!793 = !DILocalVariable(name: "fd", arg: 1, scope: !794, file: !137, line: 145, type: !35)
!794 = distinct !DISubprogram(name: "is_open", scope: !137, file: !137, line: 145, type: !795, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!35, !35}
!797 = !{!793}
!798 = !DILocation(line: 0, scope: !794, inlinedAt: !799)
!799 = distinct !DILocation(line: 182, column: 25, scope: !800)
!800 = distinct !DILexicalBlock(scope: !789, file: !137, line: 182, column: 7)
!801 = !DILocation(line: 157, column: 15, scope: !794, inlinedAt: !799)
!802 = !DILocation(line: 182, column: 25, scope: !800)
!803 = !DILocation(line: 182, column: 7, scope: !789)
!804 = !DILocation(line: 184, column: 5, scope: !800)
!805 = !DILocation(line: 185, column: 1, scope: !789)
!806 = distinct !DISubprogram(name: "error_tail", scope: !137, file: !137, line: 219, type: !770, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !807)
!807 = !{!808, !809, !810, !811}
!808 = !DILocalVariable(name: "status", arg: 1, scope: !806, file: !137, line: 219, type: !35)
!809 = !DILocalVariable(name: "errnum", arg: 2, scope: !806, file: !137, line: 219, type: !35)
!810 = !DILocalVariable(name: "message", arg: 3, scope: !806, file: !137, line: 219, type: !6)
!811 = !DILocalVariable(name: "args", arg: 4, scope: !806, file: !137, line: 219, type: !145)
!812 = !DILocation(line: 0, scope: !806)
!813 = !DILocation(line: 219, column: 1, scope: !806)
!814 = !DILocation(line: 229, column: 13, scope: !806)
!815 = !DILocation(line: 229, column: 3, scope: !806)
!816 = !DILocalVariable(name: "__stream", arg: 1, scope: !817, file: !818, line: 132, type: !821)
!817 = distinct !DISubprogram(name: "vfprintf", scope: !818, file: !818, line: 132, type: !819, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !856)
!818 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!819 = !DISubroutineType(types: !820)
!820 = !{!35, !821, !520, !147}
!821 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !824, file: !65, line: 51, baseType: !35, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !824, file: !65, line: 54, baseType: !69, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !824, file: !65, line: 55, baseType: !69, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !824, file: !65, line: 56, baseType: !69, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !824, file: !65, line: 57, baseType: !69, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !824, file: !65, line: 58, baseType: !69, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !824, file: !65, line: 59, baseType: !69, size: 64, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !824, file: !65, line: 60, baseType: !69, size: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !824, file: !65, line: 61, baseType: !69, size: 64, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !824, file: !65, line: 64, baseType: !69, size: 64, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !824, file: !65, line: 65, baseType: !69, size: 64, offset: 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !824, file: !65, line: 66, baseType: !69, size: 64, offset: 704)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !824, file: !65, line: 68, baseType: !81, size: 64, offset: 768)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !824, file: !65, line: 70, baseType: !840, size: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !824, file: !65, line: 72, baseType: !35, size: 32, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !824, file: !65, line: 73, baseType: !35, size: 32, offset: 928)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !824, file: !65, line: 74, baseType: !88, size: 64, offset: 960)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !824, file: !65, line: 77, baseType: !36, size: 16, offset: 1024)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !824, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !824, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !824, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !824, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !824, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !824, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !824, file: !65, line: 93, baseType: !840, size: 64, offset: 1344)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !824, file: !65, line: 94, baseType: !29, size: 64, offset: 1408)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !824, file: !65, line: 95, baseType: !37, size: 64, offset: 1472)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !824, file: !65, line: 96, baseType: !35, size: 32, offset: 1536)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !824, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!856 = !{!816, !857, !858}
!857 = !DILocalVariable(name: "__fmt", arg: 2, scope: !817, file: !818, line: 133, type: !520)
!858 = !DILocalVariable(name: "__ap", arg: 3, scope: !817, file: !818, line: 133, type: !147)
!859 = !DILocation(line: 0, scope: !817, inlinedAt: !860)
!860 = distinct !DILocation(line: 229, column: 3, scope: !806)
!861 = !DILocation(line: 135, column: 10, scope: !817, inlinedAt: !860)
!862 = !{!863, !865}
!863 = distinct !{!863, !864, !"vfprintf.inline: argument 0"}
!864 = distinct !{!864, !"vfprintf.inline"}
!865 = distinct !{!865, !864, !"vfprintf.inline: argument 1"}
!866 = !DILocation(line: 232, column: 3, scope: !806)
!867 = !DILocation(line: 233, column: 7, scope: !868)
!868 = distinct !DILexicalBlock(scope: !806, file: !137, line: 233, column: 7)
!869 = !DILocation(line: 233, column: 7, scope: !806)
!870 = !DILocalVariable(name: "errnum", arg: 1, scope: !871, file: !137, line: 188, type: !35)
!871 = distinct !DISubprogram(name: "print_errno_message", scope: !137, file: !137, line: 188, type: !428, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !872)
!872 = !{!870, !873, !874}
!873 = !DILocalVariable(name: "s", scope: !871, file: !137, line: 190, type: !6)
!874 = !DILocalVariable(name: "errbuf", scope: !871, file: !137, line: 193, type: !875)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8192, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 1024)
!878 = !DILocation(line: 0, scope: !871, inlinedAt: !879)
!879 = distinct !DILocation(line: 234, column: 5, scope: !868)
!880 = !DILocation(line: 193, column: 3, scope: !871, inlinedAt: !879)
!881 = !DILocation(line: 193, column: 8, scope: !871, inlinedAt: !879)
!882 = !DILocation(line: 195, column: 7, scope: !871, inlinedAt: !879)
!883 = !DILocation(line: 207, column: 9, scope: !884, inlinedAt: !879)
!884 = distinct !DILexicalBlock(scope: !871, file: !137, line: 207, column: 7)
!885 = !DILocation(line: 207, column: 7, scope: !871, inlinedAt: !879)
!886 = !DILocation(line: 208, column: 9, scope: !884, inlinedAt: !879)
!887 = !DILocation(line: 208, column: 5, scope: !884, inlinedAt: !879)
!888 = !DILocation(line: 214, column: 3, scope: !871, inlinedAt: !879)
!889 = !DILocation(line: 216, column: 1, scope: !871, inlinedAt: !879)
!890 = !DILocation(line: 234, column: 5, scope: !868)
!891 = !DILocation(line: 238, column: 3, scope: !806)
!892 = !DILocalVariable(name: "__c", arg: 1, scope: !893, file: !894, line: 101, type: !35)
!893 = distinct !DISubprogram(name: "putc_unlocked", scope: !894, file: !894, line: 101, type: !895, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !897)
!894 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!895 = !DISubroutineType(types: !896)
!896 = !{!35, !35, !822}
!897 = !{!892, !898}
!898 = !DILocalVariable(name: "__stream", arg: 2, scope: !893, file: !894, line: 101, type: !822)
!899 = !DILocation(line: 0, scope: !893, inlinedAt: !900)
!900 = distinct !DILocation(line: 238, column: 3, scope: !806)
!901 = !DILocation(line: 103, column: 10, scope: !893, inlinedAt: !900)
!902 = !{!903, !439, i64 40}
!903 = !{!"_IO_FILE", !525, i64 0, !439, i64 8, !439, i64 16, !439, i64 24, !439, i64 32, !439, i64 40, !439, i64 48, !439, i64 56, !439, i64 64, !439, i64 72, !439, i64 80, !439, i64 88, !439, i64 96, !439, i64 104, !525, i64 112, !525, i64 116, !904, i64 120, !559, i64 128, !440, i64 130, !440, i64 131, !439, i64 136, !904, i64 144, !439, i64 152, !439, i64 160, !439, i64 168, !439, i64 176, !904, i64 184, !525, i64 192, !440, i64 196}
!904 = !{!"long", !440, i64 0}
!905 = !{!903, !439, i64 48}
!906 = !{!"branch_weights", i32 2000, i32 1}
!907 = !DILocation(line: 240, column: 3, scope: !806)
!908 = !DILocation(line: 241, column: 7, scope: !909)
!909 = distinct !DILexicalBlock(scope: !806, file: !137, line: 241, column: 7)
!910 = !DILocation(line: 241, column: 7, scope: !806)
!911 = !DILocation(line: 242, column: 5, scope: !909)
!912 = !DILocation(line: 243, column: 1, scope: !806)
!913 = !DISubprogram(name: "strerror_r", scope: !914, file: !914, line: 444, type: !915, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!914 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!915 = !DISubroutineType(types: !916)
!916 = !{!69, !35, !69, !37}
!917 = !DISubprogram(name: "fflush_unlocked", scope: !146, file: !146, line: 239, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!918 = !DISubroutineType(types: !919)
!919 = !{!35, !822}
!920 = !DISubprogram(name: "fcntl", scope: !921, file: !921, line: 149, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!921 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!922 = !DISubroutineType(types: !923)
!923 = !{!35, !35, !35, null}
!924 = distinct !DISubprogram(name: "error", scope: !137, file: !137, line: 285, type: !925, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !927)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !35, !35, !6, null}
!927 = !{!928, !929, !930, !931}
!928 = !DILocalVariable(name: "status", arg: 1, scope: !924, file: !137, line: 285, type: !35)
!929 = !DILocalVariable(name: "errnum", arg: 2, scope: !924, file: !137, line: 285, type: !35)
!930 = !DILocalVariable(name: "message", arg: 3, scope: !924, file: !137, line: 285, type: !6)
!931 = !DILocalVariable(name: "ap", scope: !924, file: !137, line: 287, type: !145)
!932 = !DILocation(line: 0, scope: !924)
!933 = !DILocation(line: 287, column: 3, scope: !924)
!934 = !DILocation(line: 287, column: 11, scope: !924)
!935 = !DILocation(line: 288, column: 3, scope: !924)
!936 = !DILocation(line: 289, column: 3, scope: !924)
!937 = !DILocation(line: 290, column: 3, scope: !924)
!938 = !DILocation(line: 291, column: 1, scope: !924)
!939 = !DILocation(line: 0, scope: !142)
!940 = !DILocation(line: 298, column: 1, scope: !142)
!941 = !DILocation(line: 302, column: 7, scope: !942)
!942 = distinct !DILexicalBlock(scope: !142, file: !137, line: 302, column: 7)
!943 = !DILocation(line: 302, column: 7, scope: !142)
!944 = !DILocation(line: 307, column: 11, scope: !945)
!945 = distinct !DILexicalBlock(scope: !946, file: !137, line: 307, column: 11)
!946 = distinct !DILexicalBlock(scope: !942, file: !137, line: 303, column: 5)
!947 = !DILocation(line: 307, column: 27, scope: !945)
!948 = !DILocation(line: 308, column: 11, scope: !945)
!949 = !DILocation(line: 308, column: 28, scope: !945)
!950 = !DILocation(line: 308, column: 25, scope: !945)
!951 = !DILocation(line: 309, column: 15, scope: !945)
!952 = !DILocation(line: 309, column: 33, scope: !945)
!953 = !DILocation(line: 310, column: 19, scope: !945)
!954 = !DILocation(line: 311, column: 22, scope: !945)
!955 = !DILocation(line: 311, column: 56, scope: !945)
!956 = !DILocation(line: 307, column: 11, scope: !946)
!957 = !DILocation(line: 316, column: 21, scope: !946)
!958 = !DILocation(line: 317, column: 23, scope: !946)
!959 = !DILocation(line: 318, column: 5, scope: !946)
!960 = !DILocation(line: 327, column: 3, scope: !142)
!961 = !DILocation(line: 331, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !142, file: !137, line: 331, column: 7)
!963 = !DILocation(line: 331, column: 7, scope: !142)
!964 = !DILocation(line: 332, column: 5, scope: !962)
!965 = !DILocation(line: 338, column: 7, scope: !966)
!966 = distinct !DILexicalBlock(scope: !962, file: !137, line: 334, column: 5)
!967 = !DILocation(line: 346, column: 3, scope: !142)
!968 = !DILocation(line: 350, column: 3, scope: !142)
!969 = !DILocation(line: 356, column: 1, scope: !142)
!970 = distinct !DISubprogram(name: "error_at_line", scope: !137, file: !137, line: 359, type: !971, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !973)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !35, !35, !6, !14, !6, null}
!973 = !{!974, !975, !976, !977, !978, !979}
!974 = !DILocalVariable(name: "status", arg: 1, scope: !970, file: !137, line: 359, type: !35)
!975 = !DILocalVariable(name: "errnum", arg: 2, scope: !970, file: !137, line: 359, type: !35)
!976 = !DILocalVariable(name: "file_name", arg: 3, scope: !970, file: !137, line: 359, type: !6)
!977 = !DILocalVariable(name: "line_number", arg: 4, scope: !970, file: !137, line: 360, type: !14)
!978 = !DILocalVariable(name: "message", arg: 5, scope: !970, file: !137, line: 360, type: !6)
!979 = !DILocalVariable(name: "ap", scope: !970, file: !137, line: 362, type: !145)
!980 = !DILocation(line: 0, scope: !970)
!981 = !DILocation(line: 362, column: 3, scope: !970)
!982 = !DILocation(line: 362, column: 11, scope: !970)
!983 = !DILocation(line: 363, column: 3, scope: !970)
!984 = !DILocation(line: 364, column: 3, scope: !970)
!985 = !DILocation(line: 366, column: 3, scope: !970)
!986 = !DILocation(line: 367, column: 1, scope: !970)
!987 = distinct !DISubprogram(name: "getprogname", scope: !354, file: !354, line: 54, type: !988, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !353, retainedNodes: !516)
!988 = !DISubroutineType(types: !989)
!989 = !{!6}
!990 = !DILocation(line: 58, column: 10, scope: !987)
!991 = !DILocation(line: 58, column: 3, scope: !987)
!992 = distinct !DISubprogram(name: "parse_long_options", scope: !178, file: !178, line: 45, type: !993, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !177, retainedNodes: !996)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !35, !647, !6, !6, !6, !995, null}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1007}
!997 = !DILocalVariable(name: "argc", arg: 1, scope: !992, file: !178, line: 45, type: !35)
!998 = !DILocalVariable(name: "argv", arg: 2, scope: !992, file: !178, line: 46, type: !647)
!999 = !DILocalVariable(name: "command_name", arg: 3, scope: !992, file: !178, line: 47, type: !6)
!1000 = !DILocalVariable(name: "package", arg: 4, scope: !992, file: !178, line: 48, type: !6)
!1001 = !DILocalVariable(name: "version", arg: 5, scope: !992, file: !178, line: 49, type: !6)
!1002 = !DILocalVariable(name: "usage_func", arg: 6, scope: !992, file: !178, line: 50, type: !995)
!1003 = !DILocalVariable(name: "saved_opterr", scope: !992, file: !178, line: 53, type: !35)
!1004 = !DILocalVariable(name: "c", scope: !1005, file: !178, line: 60, type: !35)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !178, line: 59, column: 5)
!1006 = distinct !DILexicalBlock(scope: !992, file: !178, line: 58, column: 7)
!1007 = !DILocalVariable(name: "authors", scope: !1008, file: !178, line: 71, type: !1012)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !178, line: 70, column: 15)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !178, line: 64, column: 13)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !178, line: 62, column: 9)
!1011 = distinct !DILexicalBlock(scope: !1005, file: !178, line: 61, column: 11)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !146, line: 52, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !148, line: 32, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1015, baseType: !1016)
!1015 = !DIFile(filename: "lib/long-options.c", directory: "/src")
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !152, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1016, file: !1015, line: 71, baseType: !29, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1016, file: !1015, line: 71, baseType: !29, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1016, file: !1015, line: 71, baseType: !29, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1016, file: !1015, line: 71, baseType: !35, size: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1016, file: !1015, line: 71, baseType: !35, size: 32, offset: 224)
!1023 = !DILocation(line: 0, scope: !992)
!1024 = !DILocation(line: 53, column: 22, scope: !992)
!1025 = !DILocation(line: 56, column: 10, scope: !992)
!1026 = !DILocation(line: 58, column: 12, scope: !1006)
!1027 = !DILocation(line: 58, column: 7, scope: !992)
!1028 = !DILocation(line: 60, column: 15, scope: !1005)
!1029 = !DILocation(line: 0, scope: !1005)
!1030 = !DILocation(line: 61, column: 11, scope: !1005)
!1031 = !DILocation(line: 66, column: 15, scope: !1009)
!1032 = !DILocation(line: 67, column: 15, scope: !1009)
!1033 = !DILocation(line: 71, column: 17, scope: !1008)
!1034 = !DILocation(line: 71, column: 25, scope: !1008)
!1035 = !DILocation(line: 72, column: 17, scope: !1008)
!1036 = !DILocation(line: 73, column: 33, scope: !1008)
!1037 = !DILocation(line: 73, column: 17, scope: !1008)
!1038 = !DILocation(line: 74, column: 17, scope: !1008)
!1039 = !DILocation(line: 85, column: 10, scope: !992)
!1040 = !DILocation(line: 89, column: 10, scope: !992)
!1041 = !DILocation(line: 90, column: 1, scope: !992)
!1042 = !DISubprogram(name: "getopt_long", scope: !183, file: !183, line: 66, type: !1043, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!35, !35, !1045, !6, !1047, !188}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!1048 = distinct !DISubprogram(name: "parse_gnu_standard_options_only", scope: !178, file: !178, line: 98, type: !1049, scopeLine: 106, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !177, retainedNodes: !1051)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !35, !647, !6, !6, !6, !48, !995, null}
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1052 = !DILocalVariable(name: "argc", arg: 1, scope: !1048, file: !178, line: 98, type: !35)
!1053 = !DILocalVariable(name: "argv", arg: 2, scope: !1048, file: !178, line: 99, type: !647)
!1054 = !DILocalVariable(name: "command_name", arg: 3, scope: !1048, file: !178, line: 100, type: !6)
!1055 = !DILocalVariable(name: "package", arg: 4, scope: !1048, file: !178, line: 101, type: !6)
!1056 = !DILocalVariable(name: "version", arg: 5, scope: !1048, file: !178, line: 102, type: !6)
!1057 = !DILocalVariable(name: "scan_all", arg: 6, scope: !1048, file: !178, line: 103, type: !48)
!1058 = !DILocalVariable(name: "usage_func", arg: 7, scope: !1048, file: !178, line: 104, type: !995)
!1059 = !DILocalVariable(name: "saved_opterr", scope: !1048, file: !178, line: 107, type: !35)
!1060 = !DILocalVariable(name: "optstring", scope: !1048, file: !178, line: 112, type: !6)
!1061 = !DILocalVariable(name: "c", scope: !1048, file: !178, line: 114, type: !35)
!1062 = !DILocalVariable(name: "authors", scope: !1063, file: !178, line: 125, type: !1012)
!1063 = distinct !DILexicalBlock(scope: !1064, file: !178, line: 124, column: 11)
!1064 = distinct !DILexicalBlock(scope: !1065, file: !178, line: 118, column: 9)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !178, line: 116, column: 5)
!1066 = distinct !DILexicalBlock(scope: !1048, file: !178, line: 115, column: 7)
!1067 = !DILocation(line: 0, scope: !1048)
!1068 = !DILocation(line: 107, column: 22, scope: !1048)
!1069 = !DILocation(line: 110, column: 10, scope: !1048)
!1070 = !DILocation(line: 112, column: 27, scope: !1048)
!1071 = !DILocation(line: 114, column: 11, scope: !1048)
!1072 = !DILocation(line: 115, column: 7, scope: !1048)
!1073 = !DILocation(line: 125, column: 13, scope: !1063)
!1074 = !DILocation(line: 125, column: 21, scope: !1063)
!1075 = !DILocation(line: 126, column: 13, scope: !1063)
!1076 = !DILocation(line: 127, column: 29, scope: !1063)
!1077 = !DILocation(line: 127, column: 13, scope: !1063)
!1078 = !DILocation(line: 128, column: 13, scope: !1063)
!1079 = !DILocation(line: 132, column: 26, scope: !1064)
!1080 = !DILocation(line: 133, column: 11, scope: !1064)
!1081 = !DILocation(line: 0, scope: !1064)
!1082 = !DILocation(line: 138, column: 10, scope: !1048)
!1083 = !DILocation(line: 139, column: 1, scope: !1048)
!1084 = distinct !DISubprogram(name: "set_program_name", scope: !195, file: !195, line: 37, type: !449, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DILocalVariable(name: "argv0", arg: 1, scope: !1084, file: !195, line: 37, type: !6)
!1087 = !DILocalVariable(name: "slash", scope: !1084, file: !195, line: 44, type: !6)
!1088 = !DILocalVariable(name: "base", scope: !1084, file: !195, line: 45, type: !6)
!1089 = !DILocation(line: 0, scope: !1084)
!1090 = !DILocation(line: 44, column: 23, scope: !1084)
!1091 = !DILocation(line: 45, column: 22, scope: !1084)
!1092 = !DILocation(line: 46, column: 17, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1084, file: !195, line: 46, column: 7)
!1094 = !DILocation(line: 46, column: 9, scope: !1093)
!1095 = !DILocation(line: 46, column: 25, scope: !1093)
!1096 = !DILocation(line: 46, column: 40, scope: !1093)
!1097 = !DILocalVariable(name: "__s1", arg: 1, scope: !1098, file: !474, line: 974, type: !642)
!1098 = distinct !DISubprogram(name: "memeq", scope: !474, file: !474, line: 974, type: !1099, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !194, retainedNodes: !1101)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!48, !642, !642, !37}
!1101 = !{!1097, !1102, !1103}
!1102 = !DILocalVariable(name: "__s2", arg: 2, scope: !1098, file: !474, line: 974, type: !642)
!1103 = !DILocalVariable(name: "__n", arg: 3, scope: !1098, file: !474, line: 974, type: !37)
!1104 = !DILocation(line: 0, scope: !1098, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 46, column: 28, scope: !1093)
!1106 = !DILocation(line: 976, column: 11, scope: !1098, inlinedAt: !1105)
!1107 = !DILocation(line: 976, column: 10, scope: !1098, inlinedAt: !1105)
!1108 = !DILocation(line: 46, column: 7, scope: !1084)
!1109 = !DILocation(line: 49, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !195, line: 49, column: 11)
!1111 = distinct !DILexicalBlock(scope: !1093, file: !195, line: 47, column: 5)
!1112 = !DILocation(line: 49, column: 36, scope: !1110)
!1113 = !DILocation(line: 49, column: 11, scope: !1111)
!1114 = !DILocation(line: 65, column: 16, scope: !1084)
!1115 = !DILocation(line: 71, column: 27, scope: !1084)
!1116 = !DILocation(line: 74, column: 33, scope: !1084)
!1117 = !DILocation(line: 76, column: 1, scope: !1084)
!1118 = !DILocation(line: 0, scope: !200)
!1119 = !DILocation(line: 40, column: 29, scope: !200)
!1120 = !DILocation(line: 41, column: 19, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !200, file: !201, line: 41, column: 7)
!1122 = !DILocation(line: 41, column: 7, scope: !200)
!1123 = !DILocation(line: 47, column: 3, scope: !200)
!1124 = !DILocation(line: 48, column: 3, scope: !200)
!1125 = !DILocation(line: 48, column: 13, scope: !200)
!1126 = !DILocalVariable(name: "ps", arg: 1, scope: !1127, file: !1128, line: 1135, type: !1131)
!1127 = distinct !DISubprogram(name: "mbszero", scope: !1128, file: !1128, line: 1135, type: !1129, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !204, retainedNodes: !1132)
!1128 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!1132 = !{!1126}
!1133 = !DILocation(line: 0, scope: !1127, inlinedAt: !1134)
!1134 = distinct !DILocation(line: 48, column: 18, scope: !200)
!1135 = !DILocalVariable(name: "__dest", arg: 1, scope: !1136, file: !1137, line: 57, type: !29)
!1136 = distinct !DISubprogram(name: "memset", scope: !1137, file: !1137, line: 57, type: !1138, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !204, retainedNodes: !1140)
!1137 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!29, !29, !35, !37}
!1140 = !{!1135, !1141, !1142}
!1141 = !DILocalVariable(name: "__ch", arg: 2, scope: !1136, file: !1137, line: 57, type: !35)
!1142 = !DILocalVariable(name: "__len", arg: 3, scope: !1136, file: !1137, line: 57, type: !37)
!1143 = !DILocation(line: 0, scope: !1136, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 1137, column: 3, scope: !1127, inlinedAt: !1134)
!1145 = !DILocation(line: 59, column: 10, scope: !1136, inlinedAt: !1144)
!1146 = !DILocation(line: 49, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !200, file: !201, line: 49, column: 7)
!1148 = !DILocation(line: 49, column: 39, scope: !1147)
!1149 = !DILocation(line: 49, column: 44, scope: !1147)
!1150 = !DILocation(line: 54, column: 1, scope: !200)
!1151 = !DISubprogram(name: "mbrtoc32", scope: !212, file: !212, line: 57, type: !1152, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !516)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!37, !1154, !520, !37, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1131)
!1157 = distinct !DISubprogram(name: "clone_quoting_options", scope: !237, file: !237, line: 113, type: !1158, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !1161)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!1160, !1160}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!1161 = !{!1162, !1163, !1164}
!1162 = !DILocalVariable(name: "o", arg: 1, scope: !1157, file: !237, line: 113, type: !1160)
!1163 = !DILocalVariable(name: "saved_errno", scope: !1157, file: !237, line: 115, type: !35)
!1164 = !DILocalVariable(name: "p", scope: !1157, file: !237, line: 116, type: !1160)
!1165 = !DILocation(line: 0, scope: !1157)
!1166 = !DILocation(line: 115, column: 21, scope: !1157)
!1167 = !DILocation(line: 116, column: 40, scope: !1157)
!1168 = !DILocation(line: 116, column: 31, scope: !1157)
!1169 = !DILocation(line: 118, column: 9, scope: !1157)
!1170 = !DILocation(line: 119, column: 3, scope: !1157)
!1171 = distinct !DISubprogram(name: "get_quoting_style", scope: !237, file: !237, line: 124, type: !1172, scopeLine: 125, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !1176)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!239, !1174}
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "o", arg: 1, scope: !1171, file: !237, line: 124, type: !1174)
!1178 = !DILocation(line: 0, scope: !1171)
!1179 = !DILocation(line: 126, column: 11, scope: !1171)
!1180 = !DILocation(line: 126, column: 46, scope: !1171)
!1181 = !{!1182, !440, i64 0}
!1182 = !{!"quoting_options", !440, i64 0, !525, i64 4, !440, i64 8, !439, i64 40, !439, i64 48}
!1183 = !DILocation(line: 126, column: 3, scope: !1171)
!1184 = distinct !DISubprogram(name: "set_quoting_style", scope: !237, file: !237, line: 132, type: !1185, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !236, retainedNodes: !1187)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !1160, !239}
!1187 = !{!1188, !1189}
!1188 = !DILocalVariable(name: "o", arg: 1, scope: !1184, file: !237, line: 132, type: !1160)
!1189 = !DILocalVariable(name: "s", arg: 2, scope: !1184, file: !237, line: 132, type: !239)
!1190 = !DILocation(line: 0, scope: !1184)
!1191 = !DILocation(line: 134, column: 4, scope: !1184)
!1192 = !DILocation(line: 134, column: 39, scope: !1184)
!1193 = !DILocation(line: 134, column: 45, scope: !1184)
