; ModuleID = 'src/yes.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.infomap = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.iovec = type { i8*, i64 }
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s [STRING]...\0A  or:  %s OPTION\0A\00", align 1
@.str.2 = private unnamed_addr constant [65 x i8] c"Repeatedly output a line with all specified STRING(s), or 'y'.\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"yes\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !2, file: !3, line: 575, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "oputs_", scope: !3, file: !3, line: 573, type: !4, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !41)
!3 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !10, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !31, globals: !40, splitDebugInlining: false, nameTableKind: None)
!10 = !DIFile(filename: "src/yes.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e168110abf014226da6862ea552ec304")
!11 = !{!12, !28}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 46, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27}
!16 = !DIEnumerator(name: "_ISupper", value: 256)
!17 = !DIEnumerator(name: "_ISlower", value: 512)
!18 = !DIEnumerator(name: "_ISalpha", value: 1024)
!19 = !DIEnumerator(name: "_ISdigit", value: 2048)
!20 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!21 = !DIEnumerator(name: "_ISspace", value: 8192)
!22 = !DIEnumerator(name: "_ISprint", value: 16384)
!23 = !DIEnumerator(name: "_ISgraph", value: 32768)
!24 = !DIEnumerator(name: "_ISblank", value: 1)
!25 = !DIEnumerator(name: "_IScntrl", value: 2)
!26 = !DIEnumerator(name: "_ISpunct", value: 4)
!27 = !DIEnumerator(name: "_ISalnum", value: 8)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 81, baseType: !14, size: 32, elements: !29)
!29 = !{!30}
!30 = !DIEnumerator(name: "SPLICE_PIPE_SIZE", value: 524288)
!31 = !{!6, !32, !33, !34, !35, !38, !39}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 46, baseType: !37)
!36 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!37 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!40 = !{!0}
!41 = !{!42, !43, !44, !47, !49, !50, !51, !55, !56, !57, !58, !60, !116, !117, !118, !120, !121}
!42 = !DILocalVariable(name: "program", arg: 1, scope: !2, file: !3, line: 573, type: !6)
!43 = !DILocalVariable(name: "option", arg: 2, scope: !2, file: !3, line: 573, type: !6)
!44 = !DILocalVariable(name: "term", scope: !45, file: !3, line: 585, type: !6)
!45 = distinct !DILexicalBlock(scope: !46, file: !3, line: 582, column: 5)
!46 = distinct !DILexicalBlock(scope: !2, file: !3, line: 581, column: 7)
!47 = !DILocalVariable(name: "double_space", scope: !2, file: !3, line: 594, type: !48)
!48 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!49 = !DILocalVariable(name: "first_word", scope: !2, file: !3, line: 595, type: !6)
!50 = !DILocalVariable(name: "option_text", scope: !2, file: !3, line: 596, type: !6)
!51 = !DILocalVariable(name: "s", scope: !52, file: !3, line: 608, type: !6)
!52 = distinct !DILexicalBlock(scope: !53, file: !3, line: 605, column: 5)
!53 = distinct !DILexicalBlock(scope: !54, file: !3, line: 604, column: 12)
!54 = distinct !DILexicalBlock(scope: !2, file: !3, line: 597, column: 7)
!55 = !DILocalVariable(name: "spaces", scope: !52, file: !3, line: 609, type: !35)
!56 = !DILocalVariable(name: "anchor_len", scope: !2, file: !3, line: 620, type: !35)
!57 = !DILocalVariable(name: "desc_text", scope: !2, file: !3, line: 625, type: !6)
!58 = !DILocalVariable(name: "__ptr", scope: !59, file: !3, line: 644, type: !6)
!59 = distinct !DILexicalBlock(scope: !2, file: !3, line: 644, column: 3)
!60 = !DILocalVariable(name: "__stream", scope: !59, file: !3, line: 644, type: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !66)
!65 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !82, !84, !85, !86, !90, !91, !93, !97, !100, !102, !105, !108, !109, !110, !111, !112}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !33, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !39, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !39, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !39, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !39, size: 64, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !39, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !39, size: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !39, size: 64, offset: 448)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !39, size: 64, offset: 512)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !39, size: 64, offset: 576)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !39, size: 64, offset: 640)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !39, size: 64, offset: 704)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !83, size: 64, offset: 832)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !33, size: 32, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !33, size: 32, offset: 928)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !87, size: 64, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !88, line: 152, baseType: !89)
!88 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!89 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !34, size: 16, offset: 1024)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !88, line: 153, baseType: !89)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !83, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !32, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !35, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !33, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DILocalVariable(name: "__cnt", scope: !59, file: !3, line: 644, type: !35)
!117 = !DILocalVariable(name: "url_program", scope: !2, file: !3, line: 648, type: !6)
!118 = !DILocalVariable(name: "__ptr", scope: !119, file: !3, line: 686, type: !6)
!119 = distinct !DILexicalBlock(scope: !2, file: !3, line: 686, column: 3)
!120 = !DILocalVariable(name: "__stream", scope: !119, file: !3, line: 686, type: !61)
!121 = !DILocalVariable(name: "__cnt", scope: !119, file: !3, line: 686, type: !35)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "Version", scope: !124, file: !125, line: 3, type: !6, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!126 = !{!122}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "file_name", scope: !129, file: !130, line: 45, type: !6, isLocal: true, isDefinition: true)
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !131, splitDebugInlining: false, nameTableKind: None)
!130 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!131 = !{!127, !132}
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !129, file: !130, line: 55, type: !48, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !136, file: !137, line: 66, type: !172, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !138, globals: !139, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!138 = !{!32, !38}
!139 = !{!140, !166, !134, !168, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "old_file_name", scope: !142, file: !137, line: 304, type: !6, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "verror_at_line", scope: !137, file: !137, line: 298, type: !143, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !159)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !33, !33, !6, !14, !6, !145}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !146, line: 52, baseType: !147)
!146 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !148, line: 32, baseType: !149)
!148 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4de3cbd931b589d291e5c39387aecf82")
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !150, baseType: !151)
!150 = !DIFile(filename: "lib/error.c", directory: "/src")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !152, size: 256, elements: !153)
!152 = !DINamespace(name: "std", scope: null)
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !151, file: !150, baseType: !32, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !151, file: !150, baseType: !32, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !151, file: !150, baseType: !32, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !151, file: !150, baseType: !33, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !151, file: !150, baseType: !33, size: 32, offset: 224)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DILocalVariable(name: "status", arg: 1, scope: !142, file: !137, line: 298, type: !33)
!161 = !DILocalVariable(name: "errnum", arg: 2, scope: !142, file: !137, line: 298, type: !33)
!162 = !DILocalVariable(name: "file_name", arg: 3, scope: !142, file: !137, line: 298, type: !6)
!163 = !DILocalVariable(name: "line_number", arg: 4, scope: !142, file: !137, line: 298, type: !14)
!164 = !DILocalVariable(name: "message", arg: 5, scope: !142, file: !137, line: 298, type: !6)
!165 = !DILocalVariable(name: "args", arg: 6, scope: !142, file: !137, line: 298, type: !145)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "old_line_number", scope: !142, file: !137, line: 305, type: !14, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "error_message_count", scope: !136, file: !137, line: 69, type: !14, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !136, file: !137, line: 295, type: !33, isLocal: false, isDefinition: true)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !177, file: !178, line: 506, type: !33, isLocal: true, isDefinition: true)
!177 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !178, file: !178, line: 485, type: !179, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !183)
!178 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!179 = !DISubroutineType(types: !180)
!180 = !{!33, !33, !33}
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !182, splitDebugInlining: false, nameTableKind: None)
!182 = !{!175}
!183 = !{!184, !185, !186, !187, !190}
!184 = !DILocalVariable(name: "fd", arg: 1, scope: !177, file: !178, line: 485, type: !33)
!185 = !DILocalVariable(name: "target", arg: 2, scope: !177, file: !178, line: 485, type: !33)
!186 = !DILocalVariable(name: "result", scope: !177, file: !178, line: 487, type: !33)
!187 = !DILocalVariable(name: "flags", scope: !188, file: !178, line: 530, type: !33)
!188 = distinct !DILexicalBlock(scope: !189, file: !178, line: 529, column: 5)
!189 = distinct !DILexicalBlock(scope: !177, file: !178, line: 528, column: 7)
!190 = !DILocalVariable(name: "saved_errno", scope: !191, file: !178, line: 533, type: !33)
!191 = distinct !DILexicalBlock(scope: !192, file: !178, line: 532, column: 9)
!192 = distinct !DILexicalBlock(scope: !188, file: !178, line: 531, column: 11)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "long_options", scope: !195, file: !196, line: 34, type: !198, isLocal: true, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !197, splitDebugInlining: false, nameTableKind: None)
!196 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!197 = !{!193}
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 768, elements: !208)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !201, line: 50, size: 256, elements: !202)
!201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!202 = !{!203, !204, !205, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !201, line: 52, baseType: !6, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !200, file: !201, line: 55, baseType: !33, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 56, baseType: !206, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !200, file: !201, line: 57, baseType: !33, size: 32, offset: 192)
!208 = !{!209}
!209 = !DISubrange(count: 3)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "program_name", scope: !212, file: !213, line: 31, type: !6, isLocal: false, isDefinition: true)
!212 = distinct !DICompileUnit(language: DW_LANG_C99, file: !213, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !214, globals: !215, splitDebugInlining: false, nameTableKind: None)
!213 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!214 = !{!39}
!215 = !{!210}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "utf07FF", scope: !218, file: !219, line: 46, type: !249, isLocal: true, isDefinition: true)
!218 = distinct !DISubprogram(name: "proper_name_lite", scope: !219, file: !219, line: 38, type: !220, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !222, retainedNodes: !224)
!219 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!220 = !DISubroutineType(types: !221)
!221 = !{!6, !6, !6}
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !223, splitDebugInlining: false, nameTableKind: None)
!223 = !{!216}
!224 = !{!225, !226, !227, !228, !233}
!225 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !218, file: !219, line: 38, type: !6)
!226 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !218, file: !219, line: 38, type: !6)
!227 = !DILocalVariable(name: "translation", scope: !218, file: !219, line: 40, type: !6)
!228 = !DILocalVariable(name: "w", scope: !218, file: !219, line: 47, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !230, line: 37, baseType: !231)
!230 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !88, line: 57, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !88, line: 42, baseType: !14)
!233 = !DILocalVariable(name: "mbs", scope: !218, file: !219, line: 48, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !236)
!235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !238)
!237 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !238, file: !237, line: 15, baseType: !33, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !238, file: !237, line: 20, baseType: !242, size: 32, offset: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !238, file: !237, line: 16, size: 32, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !242, file: !237, line: 18, baseType: !14, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !242, file: !237, line: 19, baseType: !246, size: 32)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 4)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 2)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !254, file: !255, line: 76, type: !337, isLocal: false, isDefinition: true)
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !256, retainedTypes: !276, globals: !277, splitDebugInlining: false, nameTableKind: None)
!255 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!256 = !{!257, !271, !12}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !258, line: 42, baseType: !14, size: 32, elements: !259)
!258 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!259 = !{!260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!260 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!261 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!262 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!263 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!264 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!265 = !DIEnumerator(name: "c_quoting_style", value: 5)
!266 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!267 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!268 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!269 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!270 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !258, line: 254, baseType: !14, size: 32, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!274 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!275 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!276 = !{!33, !34, !35}
!277 = !{!252, !278, !284, !296, !298, !303, !326, !333, !335}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !254, file: !255, line: 92, type: !280, isLocal: false, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 320, elements: !282)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!282 = !{!283}
!283 = !DISubrange(count: 10)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !254, file: !255, line: 1040, type: !286, isLocal: false, isDefinition: true)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !255, line: 56, size: 448, elements: !287)
!287 = !{!288, !289, !290, !294, !295}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !286, file: !255, line: 59, baseType: !257, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !255, line: 62, baseType: !33, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !286, file: !255, line: 66, baseType: !291, size: 256, offset: 64)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !286, file: !255, line: 69, baseType: !6, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !286, file: !255, line: 72, baseType: !6, size: 64, offset: 384)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !254, file: !255, line: 107, type: !286, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "slot0", scope: !254, file: !255, line: 831, type: !300, isLocal: true, isDefinition: true)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 256)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "quote", scope: !305, file: !255, line: 228, type: !324, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "gettext_quote", scope: !255, file: !255, line: 197, type: !306, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !254, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{!6, !6, !257}
!308 = !{!309, !310, !311, !312, !313}
!309 = !DILocalVariable(name: "msgid", arg: 1, scope: !305, file: !255, line: 197, type: !6)
!310 = !DILocalVariable(name: "s", arg: 2, scope: !305, file: !255, line: 197, type: !257)
!311 = !DILocalVariable(name: "translation", scope: !305, file: !255, line: 199, type: !6)
!312 = !DILocalVariable(name: "w", scope: !305, file: !255, line: 229, type: !229)
!313 = !DILocalVariable(name: "mbs", scope: !305, file: !255, line: 230, type: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !316, file: !237, line: 15, baseType: !33, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !316, file: !237, line: 20, baseType: !320, size: 32, offset: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !237, line: 16, size: 32, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !320, file: !237, line: 18, baseType: !14, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !320, file: !237, line: 19, baseType: !246, size: 32)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !325)
!325 = !{!251, !248}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "slotvec", scope: !254, file: !255, line: 834, type: !328, isLocal: true, isDefinition: true)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !255, line: 823, size: 128, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !329, file: !255, line: 825, baseType: !35, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !329, file: !255, line: 826, baseType: !39, size: 64, offset: 64)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "nslots", scope: !254, file: !255, line: 832, type: !33, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "slotvec0", scope: !254, file: !255, line: 833, type: !329, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 704, elements: !339)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!339 = !{!340}
!340 = !DISubrange(count: 11)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !343, file: !344, line: 26, type: !346, isLocal: false, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !345, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!345 = !{!341}
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 376, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 47)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "exit_failure", scope: !351, file: !352, line: 24, type: !354, isLocal: false, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !353, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!353 = !{!349}
!354 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "internal_state", scope: !357, file: !358, line: 97, type: !361, isLocal: true, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!358 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!359 = !{!32, !35, !38}
!360 = !{!355}
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !235, line: 6, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !237, line: 21, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 13, size: 64, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !363, file: !237, line: 15, baseType: !33, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !363, file: !237, line: 20, baseType: !367, size: 32, offset: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !237, line: 16, size: 32, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !367, file: !237, line: 18, baseType: !14, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !367, file: !237, line: 19, baseType: !246, size: 32)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "have_pipe2_really", scope: !373, file: !374, line: 54, type: !33, isLocal: true, isDefinition: true)
!373 = distinct !DISubprogram(name: "rpl_pipe2", scope: !374, file: !374, line: 39, type: !375, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !379)
!374 = !DIFile(filename: "lib/pipe2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b2941420442dd7afd7b1a45758b7ccee")
!375 = !DISubroutineType(types: !376)
!376 = !{!33, !206, !33}
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !378, splitDebugInlining: false, nameTableKind: None)
!378 = !{!371}
!379 = !{!380, !381, !382, !384, !388, !391, !394, !396}
!380 = !DILocalVariable(name: "fd", arg: 1, scope: !373, file: !374, line: 39, type: !206)
!381 = !DILocalVariable(name: "flags", arg: 2, scope: !373, file: !374, line: 39, type: !33)
!382 = !DILocalVariable(name: "tmp", scope: !373, file: !374, line: 44, type: !383)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 64, elements: !250)
!384 = !DILocalVariable(name: "result", scope: !385, file: !374, line: 57, type: !33)
!385 = distinct !DILexicalBlock(scope: !386, file: !374, line: 56, column: 7)
!386 = distinct !DILexicalBlock(scope: !387, file: !374, line: 55, column: 9)
!387 = distinct !DILexicalBlock(scope: !373, file: !374, line: 52, column: 3)
!388 = !DILocalVariable(name: "fcntl_flags", scope: !389, file: !374, line: 117, type: !33)
!389 = distinct !DILexicalBlock(scope: !390, file: !374, line: 116, column: 5)
!390 = distinct !DILexicalBlock(scope: !373, file: !374, line: 115, column: 7)
!391 = !DILocalVariable(name: "fcntl_flags", scope: !392, file: !374, line: 128, type: !33)
!392 = distinct !DILexicalBlock(scope: !393, file: !374, line: 127, column: 5)
!393 = distinct !DILexicalBlock(scope: !373, file: !374, line: 126, column: 7)
!394 = !DILocalVariable(name: "saved_errno", scope: !395, file: !374, line: 157, type: !33)
!395 = distinct !DILexicalBlock(scope: !373, file: !374, line: 156, column: 3)
!396 = !DILabel(scope: !373, name: "fail", file: !374, line: 155)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!399 = !{!6}
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "lib/isapipe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5445de1f00883805631d924b7433dad7")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/pipe2-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f5a0d0feff89b6f036d8f7a6e8480abb")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !408, retainedTypes: !413, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!408 = !{!409}
!409 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !410, line: 36, baseType: !14, size: 32, elements: !411)
!410 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!411 = !{!412}
!412 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!413 = !{!35}
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !420, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!416 = !{!417}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 40, baseType: !14, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!420 = !{!32}
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !423, retainedTypes: !454, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!423 = !{!424, !436}
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !425, file: !422, line: 188, baseType: !14, size: 32, elements: !434)
!425 = distinct !DISubprogram(name: "x2nrealloc", scope: !422, file: !422, line: 176, type: !426, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !421, retainedNodes: !429)
!426 = !DISubroutineType(types: !427)
!427 = !{!32, !32, !428, !35}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!429 = !{!430, !431, !432, !433}
!430 = !DILocalVariable(name: "p", arg: 1, scope: !425, file: !422, line: 176, type: !32)
!431 = !DILocalVariable(name: "pn", arg: 2, scope: !425, file: !422, line: 176, type: !428)
!432 = !DILocalVariable(name: "s", arg: 3, scope: !425, file: !422, line: 176, type: !35)
!433 = !DILocalVariable(name: "n", scope: !425, file: !422, line: 178, type: !35)
!434 = !{!435}
!435 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !437, file: !422, line: 228, baseType: !14, size: 32, elements: !434)
!437 = distinct !DISubprogram(name: "xpalloc", scope: !422, file: !422, line: 223, type: !438, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !421, retainedNodes: !444)
!438 = !DISubroutineType(types: !439)
!439 = !{!32, !32, !440, !441, !443, !441}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !442, line: 130, baseType: !443)
!442 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !36, line: 35, baseType: !89)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453}
!445 = !DILocalVariable(name: "pa", arg: 1, scope: !437, file: !422, line: 223, type: !32)
!446 = !DILocalVariable(name: "pn", arg: 2, scope: !437, file: !422, line: 223, type: !440)
!447 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !437, file: !422, line: 223, type: !441)
!448 = !DILocalVariable(name: "n_max", arg: 4, scope: !437, file: !422, line: 223, type: !443)
!449 = !DILocalVariable(name: "s", arg: 5, scope: !437, file: !422, line: 223, type: !441)
!450 = !DILocalVariable(name: "n0", scope: !437, file: !422, line: 230, type: !441)
!451 = !DILocalVariable(name: "n", scope: !437, file: !422, line: 237, type: !441)
!452 = !DILocalVariable(name: "nbytes", scope: !437, file: !422, line: 248, type: !441)
!453 = !DILocalVariable(name: "adjusted_nbytes", scope: !437, file: !422, line: 252, type: !441)
!454 = !{!39, !32, !48, !89, !37}
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!461 = distinct !DICompileUnit(language: DW_LANG_C99, file: !462, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/fd-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "63ab878cf4b441e9798f87a8e3963108")
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "lib/dup-safer-flag.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad0f64dd333db5cafacb6809a74d5848")
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !420, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !420, splitDebugInlining: false, nameTableKind: None)
!468 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!469 = distinct !DICompileUnit(language: DW_LANG_C99, file: !470, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !471, splitDebugInlining: false, nameTableKind: None)
!470 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!471 = !{!48, !37, !32}
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !475, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!475 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !420, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!478 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!479 = !{i32 7, !"Dwarf Version", i32 5}
!480 = !{i32 2, !"Debug Info Version", i32 3}
!481 = !{i32 1, !"wchar_size", i32 4}
!482 = !{i32 1, !"branch-target-enforcement", i32 0}
!483 = !{i32 1, !"sign-return-address", i32 0}
!484 = !{i32 1, !"sign-return-address-all", i32 0}
!485 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!486 = !{i32 7, !"PIC Level", i32 2}
!487 = !{i32 7, !"PIE Level", i32 2}
!488 = !{i32 7, !"uwtable", i32 1}
!489 = !{i32 7, !"frame-pointer", i32 1}
!490 = distinct !DISubprogram(name: "usage", scope: !10, file: !10, line: 38, type: !491, scopeLine: 39, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !493)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !33}
!493 = !{!494}
!494 = !DILocalVariable(name: "status", arg: 1, scope: !490, file: !10, line: 38, type: !33)
!495 = !DILocation(line: 0, scope: !490)
!496 = !DILocation(line: 40, column: 14, scope: !497)
!497 = distinct !DILexicalBlock(scope: !490, file: !10, line: 40, column: 7)
!498 = !DILocation(line: 40, column: 7, scope: !490)
!499 = !DILocation(line: 41, column: 5, scope: !500)
!500 = distinct !DILexicalBlock(scope: !497, file: !10, line: 41, column: 5)
!501 = !{!502, !502, i64 0}
!502 = !{!"any pointer", !503, i64 0}
!503 = !{!"omnipotent char", !504, i64 0}
!504 = !{!"Simple C/C++ TBAA"}
!505 = !DILocation(line: 44, column: 7, scope: !506)
!506 = distinct !DILexicalBlock(scope: !497, file: !10, line: 43, column: 5)
!507 = !DILocation(line: 50, column: 7, scope: !506)
!508 = !DILocation(line: 54, column: 7, scope: !506)
!509 = !DILocation(line: 55, column: 7, scope: !506)
!510 = !DILocalVariable(name: "program", arg: 1, scope: !511, file: !3, line: 836, type: !6)
!511 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !3, file: !3, line: 836, type: !512, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !6}
!514 = !{!510, !515, !524, !525, !527, !528}
!515 = !DILocalVariable(name: "infomap", scope: !511, file: !3, line: 838, type: !516)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 896, elements: !522)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !511, file: !3, line: 838, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !518, file: !3, line: 838, baseType: !6, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !518, file: !3, line: 838, baseType: !6, size: 64, offset: 64)
!522 = !{!523}
!523 = !DISubrange(count: 7)
!524 = !DILocalVariable(name: "node", scope: !511, file: !3, line: 848, type: !6)
!525 = !DILocalVariable(name: "map_prog", scope: !511, file: !3, line: 849, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!527 = !DILocalVariable(name: "lc_messages", scope: !511, file: !3, line: 861, type: !6)
!528 = !DILocalVariable(name: "url_program", scope: !511, file: !3, line: 874, type: !6)
!529 = !DILocation(line: 0, scope: !511, inlinedAt: !530)
!530 = distinct !DILocation(line: 56, column: 7, scope: !506)
!531 = !DILocation(line: 838, column: 3, scope: !511, inlinedAt: !530)
!532 = !DILocation(line: 838, column: 67, scope: !511, inlinedAt: !530)
!533 = !DILocation(line: 849, column: 36, scope: !511, inlinedAt: !530)
!534 = !DILocation(line: 851, column: 3, scope: !511, inlinedAt: !530)
!535 = !DILocalVariable(name: "__s1", arg: 1, scope: !536, file: !537, line: 1359, type: !6)
!536 = distinct !DISubprogram(name: "streq", scope: !537, file: !537, line: 1359, type: !538, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !540)
!537 = !DIFile(filename: "./lib/string.h", directory: "/src")
!538 = !DISubroutineType(types: !539)
!539 = !{!48, !6, !6}
!540 = !{!535, !541}
!541 = !DILocalVariable(name: "__s2", arg: 2, scope: !536, file: !537, line: 1359, type: !6)
!542 = !DILocation(line: 0, scope: !536, inlinedAt: !543)
!543 = distinct !DILocation(line: 851, column: 33, scope: !511, inlinedAt: !530)
!544 = !DILocation(line: 1361, column: 11, scope: !536, inlinedAt: !543)
!545 = !DILocation(line: 1361, column: 10, scope: !536, inlinedAt: !543)
!546 = !DILocation(line: 852, column: 13, scope: !511, inlinedAt: !530)
!547 = !DILocation(line: 851, column: 20, scope: !511, inlinedAt: !530)
!548 = !{!549, !502, i64 0}
!549 = !{!"infomap", !502, i64 0, !502, i64 8}
!550 = !DILocation(line: 851, column: 10, scope: !511, inlinedAt: !530)
!551 = !DILocation(line: 851, column: 28, scope: !511, inlinedAt: !530)
!552 = distinct !{!552, !534, !546, !553}
!553 = !{!"llvm.loop.mustprogress"}
!554 = !DILocation(line: 854, column: 17, scope: !555, inlinedAt: !530)
!555 = distinct !DILexicalBlock(scope: !511, file: !3, line: 854, column: 7)
!556 = !{!549, !502, i64 8}
!557 = !DILocation(line: 854, column: 7, scope: !555, inlinedAt: !530)
!558 = !DILocation(line: 854, column: 7, scope: !511, inlinedAt: !530)
!559 = !DILocation(line: 857, column: 3, scope: !511, inlinedAt: !530)
!560 = !DILocation(line: 861, column: 29, scope: !511, inlinedAt: !530)
!561 = !DILocation(line: 862, column: 7, scope: !562, inlinedAt: !530)
!562 = distinct !DILexicalBlock(scope: !511, file: !3, line: 862, column: 7)
!563 = !DILocation(line: 862, column: 19, scope: !562, inlinedAt: !530)
!564 = !DILocation(line: 862, column: 22, scope: !562, inlinedAt: !530)
!565 = !DILocation(line: 862, column: 7, scope: !511, inlinedAt: !530)
!566 = !DILocation(line: 868, column: 7, scope: !567, inlinedAt: !530)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 863, column: 5)
!568 = !DILocation(line: 870, column: 5, scope: !567, inlinedAt: !530)
!569 = !DILocation(line: 0, scope: !536, inlinedAt: !570)
!570 = distinct !DILocation(line: 874, column: 29, scope: !511, inlinedAt: !530)
!571 = !DILocation(line: 875, column: 3, scope: !511, inlinedAt: !530)
!572 = !DILocation(line: 877, column: 3, scope: !511, inlinedAt: !530)
!573 = !DILocation(line: 879, column: 1, scope: !511, inlinedAt: !530)
!574 = !DILocation(line: 58, column: 3, scope: !490)
!575 = !DISubprogram(name: "dcgettext", scope: !576, file: !576, line: 51, type: !577, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!576 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!577 = !DISubroutineType(types: !578)
!578 = !{!39, !6, !6, !33}
!579 = !{}
!580 = !DISubprogram(name: "fputs_unlocked", scope: !146, file: !146, line: 691, type: !581, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!581 = !DISubroutineType(types: !582)
!582 = !{!33, !583, !584}
!583 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!584 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !61)
!585 = !DILocation(line: 0, scope: !2)
!586 = !DILocation(line: 581, column: 7, scope: !46)
!587 = !{!588, !588, i64 0}
!588 = !{!"int", !503, i64 0}
!589 = !DILocation(line: 581, column: 19, scope: !46)
!590 = !DILocation(line: 581, column: 7, scope: !2)
!591 = !DILocation(line: 585, column: 26, scope: !45)
!592 = !DILocation(line: 0, scope: !45)
!593 = !DILocation(line: 586, column: 23, scope: !45)
!594 = !DILocation(line: 586, column: 28, scope: !45)
!595 = !DILocation(line: 586, column: 32, scope: !45)
!596 = !{!503, !503, i64 0}
!597 = !DILocation(line: 586, column: 38, scope: !45)
!598 = !DILocation(line: 0, scope: !536, inlinedAt: !599)
!599 = distinct !DILocation(line: 586, column: 41, scope: !45)
!600 = !DILocation(line: 1361, column: 11, scope: !536, inlinedAt: !599)
!601 = !DILocation(line: 1361, column: 10, scope: !536, inlinedAt: !599)
!602 = !DILocation(line: 586, column: 19, scope: !45)
!603 = !DILocation(line: 587, column: 5, scope: !45)
!604 = !DILocation(line: 588, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !2, file: !3, line: 588, column: 7)
!606 = !DILocation(line: 588, column: 7, scope: !2)
!607 = !DILocation(line: 590, column: 7, scope: !608)
!608 = distinct !DILexicalBlock(scope: !605, file: !3, line: 589, column: 5)
!609 = !DILocation(line: 591, column: 7, scope: !608)
!610 = !DILocation(line: 595, column: 37, scope: !2)
!611 = !DILocation(line: 595, column: 35, scope: !2)
!612 = !DILocation(line: 596, column: 29, scope: !2)
!613 = !DILocation(line: 597, column: 8, scope: !54)
!614 = !DILocation(line: 597, column: 7, scope: !2)
!615 = !DILocation(line: 604, column: 24, scope: !53)
!616 = !DILocation(line: 604, column: 12, scope: !54)
!617 = !DILocation(line: 0, scope: !52)
!618 = !DILocation(line: 610, column: 16, scope: !52)
!619 = !DILocation(line: 610, column: 7, scope: !52)
!620 = !DILocation(line: 611, column: 21, scope: !52)
!621 = !{!622, !622, i64 0}
!622 = !{!"short", !503, i64 0}
!623 = !DILocation(line: 611, column: 19, scope: !52)
!624 = !DILocation(line: 611, column: 16, scope: !52)
!625 = !DILocation(line: 610, column: 30, scope: !52)
!626 = distinct !{!626, !619, !620, !553}
!627 = !DILocation(line: 612, column: 18, scope: !628)
!628 = distinct !DILexicalBlock(scope: !52, file: !3, line: 612, column: 11)
!629 = !DILocation(line: 612, column: 11, scope: !52)
!630 = !DILocation(line: 620, column: 23, scope: !2)
!631 = !DILocation(line: 625, column: 39, scope: !2)
!632 = !DILocation(line: 626, column: 3, scope: !2)
!633 = !DILocation(line: 626, column: 10, scope: !2)
!634 = !DILocation(line: 626, column: 21, scope: !2)
!635 = !DILocation(line: 628, column: 44, scope: !636)
!636 = distinct !DILexicalBlock(scope: !637, file: !3, line: 628, column: 11)
!637 = distinct !DILexicalBlock(scope: !2, file: !3, line: 627, column: 5)
!638 = !DILocation(line: 628, column: 32, scope: !636)
!639 = !DILocation(line: 628, column: 49, scope: !636)
!640 = !DILocation(line: 628, column: 11, scope: !637)
!641 = !DILocation(line: 630, column: 11, scope: !642)
!642 = distinct !DILexicalBlock(scope: !637, file: !3, line: 630, column: 11)
!643 = !DILocation(line: 630, column: 11, scope: !637)
!644 = !DILocation(line: 632, column: 26, scope: !645)
!645 = distinct !DILexicalBlock(scope: !646, file: !3, line: 632, column: 15)
!646 = distinct !DILexicalBlock(scope: !642, file: !3, line: 631, column: 9)
!647 = !DILocation(line: 632, column: 34, scope: !645)
!648 = !DILocation(line: 632, column: 37, scope: !645)
!649 = !DILocation(line: 632, column: 15, scope: !646)
!650 = !DILocation(line: 636, column: 29, scope: !651)
!651 = distinct !DILexicalBlock(scope: !646, file: !3, line: 636, column: 15)
!652 = !DILocation(line: 640, column: 16, scope: !637)
!653 = distinct !{!653, !632, !654, !553}
!654 = !DILocation(line: 641, column: 5, scope: !2)
!655 = !DILocation(line: 644, column: 3, scope: !2)
!656 = !DILocation(line: 0, scope: !536, inlinedAt: !657)
!657 = distinct !DILocation(line: 648, column: 31, scope: !2)
!658 = !DILocation(line: 0, scope: !536, inlinedAt: !659)
!659 = distinct !DILocation(line: 649, column: 31, scope: !2)
!660 = !DILocation(line: 0, scope: !536, inlinedAt: !661)
!661 = distinct !DILocation(line: 650, column: 31, scope: !2)
!662 = !DILocation(line: 0, scope: !536, inlinedAt: !663)
!663 = distinct !DILocation(line: 651, column: 31, scope: !2)
!664 = !DILocation(line: 0, scope: !536, inlinedAt: !665)
!665 = distinct !DILocation(line: 652, column: 31, scope: !2)
!666 = !DILocation(line: 0, scope: !536, inlinedAt: !667)
!667 = distinct !DILocation(line: 653, column: 31, scope: !2)
!668 = !DILocation(line: 0, scope: !536, inlinedAt: !669)
!669 = distinct !DILocation(line: 654, column: 31, scope: !2)
!670 = !DILocation(line: 0, scope: !536, inlinedAt: !671)
!671 = distinct !DILocation(line: 655, column: 31, scope: !2)
!672 = !DILocation(line: 0, scope: !536, inlinedAt: !673)
!673 = distinct !DILocation(line: 656, column: 31, scope: !2)
!674 = !DILocation(line: 0, scope: !536, inlinedAt: !675)
!675 = distinct !DILocation(line: 657, column: 31, scope: !2)
!676 = !DILocation(line: 663, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !2, file: !3, line: 663, column: 7)
!678 = !DILocation(line: 664, column: 7, scope: !677)
!679 = !DILocation(line: 664, column: 10, scope: !677)
!680 = !DILocation(line: 663, column: 7, scope: !2)
!681 = !DILocation(line: 669, column: 7, scope: !682)
!682 = distinct !DILexicalBlock(scope: !677, file: !3, line: 665, column: 5)
!683 = !DILocation(line: 671, column: 5, scope: !682)
!684 = !DILocation(line: 676, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !677, file: !3, line: 673, column: 5)
!686 = !DILocation(line: 679, column: 3, scope: !2)
!687 = !DILocation(line: 683, column: 3, scope: !2)
!688 = !DILocation(line: 686, column: 3, scope: !2)
!689 = !DILocation(line: 688, column: 3, scope: !2)
!690 = !DILocation(line: 691, column: 3, scope: !2)
!691 = !DILocation(line: 695, column: 3, scope: !2)
!692 = !DILocation(line: 696, column: 1, scope: !2)
!693 = !DISubprogram(name: "setlocale", scope: !694, file: !694, line: 122, type: !695, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!694 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!695 = !DISubroutineType(types: !696)
!696 = !{!39, !33, !6}
!697 = !DISubprogram(name: "getenv", scope: !698, file: !698, line: 641, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!698 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!699 = !DISubroutineType(types: !700)
!700 = !{!39, !6}
!701 = !DISubprogram(name: "fwrite_unlocked", scope: !146, file: !146, line: 704, type: !702, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!702 = !DISubroutineType(types: !703)
!703 = !{!35, !704, !35, !35, !584}
!704 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!707 = distinct !DISubprogram(name: "main", scope: !10, file: !10, line: 201, type: !708, scopeLine: 202, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !711)
!708 = !DISubroutineType(types: !709)
!709 = !{!33, !33, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !725}
!712 = !DILocalVariable(name: "argc", arg: 1, scope: !707, file: !10, line: 201, type: !33)
!713 = !DILocalVariable(name: "argv", arg: 2, scope: !707, file: !10, line: 201, type: !710)
!714 = !DILocalVariable(name: "operands", scope: !707, file: !10, line: 215, type: !710)
!715 = !DILocalVariable(name: "operand_lim", scope: !707, file: !10, line: 216, type: !710)
!716 = !DILocalVariable(name: "bufalloc", scope: !707, file: !10, line: 222, type: !35)
!717 = !DILocalVariable(name: "reuse_operand_strings", scope: !707, file: !10, line: 223, type: !48)
!718 = !DILocalVariable(name: "operandp", scope: !707, file: !10, line: 224, type: !710)
!719 = !DILocalVariable(name: "operand_len", scope: !720, file: !10, line: 227, type: !35)
!720 = distinct !DILexicalBlock(scope: !707, file: !10, line: 226, column: 5)
!721 = !DILocalVariable(name: "buf", scope: !707, file: !10, line: 249, type: !39)
!722 = !DILocalVariable(name: "bufused", scope: !707, file: !10, line: 250, type: !35)
!723 = !DILocalVariable(name: "operand_len", scope: !724, file: !10, line: 254, type: !35)
!724 = distinct !DILexicalBlock(scope: !707, file: !10, line: 253, column: 5)
!725 = !DILocalVariable(name: "copysize", scope: !707, file: !10, line: 263, type: !441)
!726 = !DILocation(line: 0, scope: !707)
!727 = !DILocation(line: 204, column: 21, scope: !707)
!728 = !DILocation(line: 204, column: 3, scope: !707)
!729 = !DILocation(line: 205, column: 3, scope: !707)
!730 = !DILocation(line: 206, column: 3, scope: !707)
!731 = !DILocation(line: 207, column: 3, scope: !707)
!732 = !DILocation(line: 209, column: 3, scope: !707)
!733 = !DILocation(line: 212, column: 36, scope: !707)
!734 = !DILocation(line: 212, column: 58, scope: !707)
!735 = !DILocation(line: 211, column: 3, scope: !707)
!736 = !DILocation(line: 215, column: 28, scope: !707)
!737 = !DILocation(line: 215, column: 26, scope: !707)
!738 = !DILocation(line: 216, column: 29, scope: !707)
!739 = !DILocation(line: 217, column: 14, scope: !740)
!740 = distinct !DILexicalBlock(scope: !707, file: !10, line: 217, column: 7)
!741 = !DILocation(line: 217, column: 7, scope: !707)
!742 = !DILocation(line: 218, column: 17, scope: !740)
!743 = !DILocation(line: 218, column: 20, scope: !740)
!744 = !DILocation(line: 218, column: 5, scope: !740)
!745 = !DILocation(line: 227, column: 36, scope: !720)
!746 = !DILocation(line: 227, column: 28, scope: !720)
!747 = !DILocation(line: 0, scope: !720)
!748 = !DILocation(line: 228, column: 16, scope: !720)
!749 = !DILocation(line: 229, column: 20, scope: !750)
!750 = distinct !DILexicalBlock(scope: !720, file: !10, line: 229, column: 11)
!751 = !DILocation(line: 229, column: 24, scope: !750)
!752 = !DILocation(line: 230, column: 11, scope: !750)
!753 = !DILocation(line: 230, column: 24, scope: !750)
!754 = !DILocation(line: 230, column: 38, scope: !750)
!755 = !DILocation(line: 230, column: 45, scope: !750)
!756 = !DILocation(line: 230, column: 42, scope: !750)
!757 = !DILocation(line: 229, column: 11, scope: !720)
!758 = !DILocation(line: 228, column: 31, scope: !720)
!759 = !DILocation(line: 236, column: 16, scope: !760)
!760 = distinct !DILexicalBlock(scope: !707, file: !10, line: 236, column: 7)
!761 = !DILocation(line: 236, column: 7, scope: !707)
!762 = !DILocation(line: 249, column: 15, scope: !707)
!763 = !DILocation(line: 249, column: 51, scope: !707)
!764 = !DILocation(line: 252, column: 3, scope: !707)
!765 = !DILocation(line: 254, column: 36, scope: !724)
!766 = !DILocation(line: 254, column: 28, scope: !724)
!767 = !DILocation(line: 0, scope: !724)
!768 = !DILocation(line: 255, column: 11, scope: !724)
!769 = !DILocation(line: 256, column: 21, scope: !770)
!770 = distinct !DILexicalBlock(scope: !724, file: !10, line: 255, column: 11)
!771 = !DILocalVariable(name: "__dest", arg: 1, scope: !772, file: !773, line: 26, type: !776)
!772 = distinct !DISubprogram(name: "memcpy", scope: !773, file: !773, line: 26, type: !774, scopeLine: 28, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !777)
!773 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!774 = !DISubroutineType(types: !775)
!775 = !{!32, !776, !704, !35}
!776 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !32)
!777 = !{!771, !778, !779}
!778 = !DILocalVariable(name: "__src", arg: 2, scope: !772, file: !773, line: 26, type: !704)
!779 = !DILocalVariable(name: "__len", arg: 3, scope: !772, file: !773, line: 26, type: !35)
!780 = !DILocation(line: 0, scope: !772, inlinedAt: !781)
!781 = distinct !DILocation(line: 256, column: 9, scope: !770)
!782 = !DILocation(line: 29, column: 10, scope: !772, inlinedAt: !781)
!783 = !DILocation(line: 256, column: 9, scope: !770)
!784 = !DILocation(line: 257, column: 15, scope: !724)
!785 = !DILocation(line: 258, column: 18, scope: !724)
!786 = !DILocation(line: 258, column: 7, scope: !724)
!787 = !DILocation(line: 258, column: 22, scope: !724)
!788 = !DILocation(line: 260, column: 10, scope: !707)
!789 = !DILocation(line: 260, column: 21, scope: !707)
!790 = !DILocation(line: 259, column: 5, scope: !724)
!791 = distinct !{!791, !764, !792, !553}
!792 = !DILocation(line: 260, column: 34, scope: !707)
!793 = !DILocation(line: 261, column: 20, scope: !707)
!794 = !DILocation(line: 268, column: 7, scope: !795)
!795 = distinct !DILexicalBlock(scope: !707, file: !10, line: 268, column: 7)
!796 = !DILocation(line: 268, column: 49, scope: !795)
!797 = !DILocation(line: 269, column: 7, scope: !795)
!798 = !DILocalVariable(name: "buf", arg: 1, scope: !799, file: !10, line: 113, type: !6)
!799 = distinct !DISubprogram(name: "splice_write", scope: !10, file: !10, line: 113, type: !800, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !802)
!800 = !DISubroutineType(types: !801)
!801 = !{!48, !6, !441}
!802 = !{!798, !803, !804, !805, !806, !807, !808, !809, !810, !811, !820, !822, !825, !828, !830, !833}
!803 = !DILocalVariable(name: "copysize", arg: 2, scope: !799, file: !10, line: 113, type: !441)
!804 = !DILocalVariable(name: "output_started", scope: !799, file: !10, line: 115, type: !48)
!805 = !DILocalVariable(name: "page_size", scope: !799, file: !10, line: 117, type: !441)
!806 = !DILocalVariable(name: "stdout_is_pipe", scope: !799, file: !10, line: 119, type: !48)
!807 = !DILocalVariable(name: "pipefd", scope: !799, file: !10, line: 123, type: !383)
!808 = !DILocalVariable(name: "splice_bufsize", scope: !799, file: !10, line: 124, type: !441)
!809 = !DILocalVariable(name: "splice_buf", scope: !799, file: !10, line: 125, type: !39)
!810 = !DILocalVariable(name: "vmsplice_fd", scope: !799, file: !10, line: 149, type: !33)
!811 = !DILocalVariable(name: "iov", scope: !812, file: !10, line: 153, type: !815)
!812 = distinct !DILexicalBlock(scope: !813, file: !10, line: 152, column: 5)
!813 = distinct !DILexicalBlock(scope: !814, file: !10, line: 151, column: 3)
!814 = distinct !DILexicalBlock(scope: !799, file: !10, line: 151, column: 3)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !816, line: 26, size: 128, elements: !817)
!816 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_iovec.h", directory: "", checksumkind: CSK_MD5, checksum: "906dd4c9f8205bfe8a00a7ac49f298dc")
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !815, file: !816, line: 28, baseType: !32, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !815, file: !816, line: 29, baseType: !35, size: 64, offset: 64)
!820 = !DILocalVariable(name: "flags", scope: !821, file: !10, line: 161, type: !14)
!821 = distinct !DILexicalBlock(scope: !812, file: !10, line: 157, column: 9)
!822 = !DILocalVariable(name: "n", scope: !821, file: !10, line: 162, type: !823)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !146, line: 77, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !88, line: 194, baseType: !89)
!825 = !DILocalVariable(name: "remaining", scope: !826, file: !10, line: 174, type: !441)
!826 = distinct !DILexicalBlock(scope: !827, file: !10, line: 173, column: 9)
!827 = distinct !DILexicalBlock(scope: !812, file: !10, line: 172, column: 11)
!828 = !DILocalVariable(name: "s", scope: !829, file: !10, line: 177, type: !823)
!829 = distinct !DILexicalBlock(scope: !826, file: !10, line: 176, column: 13)
!830 = !DILocalVariable(name: "saved_errno", scope: !831, file: !10, line: 190, type: !33)
!831 = distinct !DILexicalBlock(scope: !832, file: !10, line: 189, column: 5)
!832 = distinct !DILexicalBlock(scope: !799, file: !10, line: 188, column: 7)
!833 = !DILabel(scope: !799, name: "done", file: !10, line: 187)
!834 = !DILocation(line: 0, scope: !799, inlinedAt: !835)
!835 = distinct !DILocation(line: 269, column: 10, scope: !795)
!836 = !DILocation(line: 117, column: 21, scope: !799, inlinedAt: !835)
!837 = !DILocation(line: 119, column: 25, scope: !799, inlinedAt: !835)
!838 = !DILocation(line: 119, column: 49, scope: !799, inlinedAt: !835)
!839 = !DILocation(line: 123, column: 3, scope: !799, inlinedAt: !835)
!840 = !DILocation(line: 123, column: 7, scope: !799, inlinedAt: !835)
!841 = !DILocation(line: 127, column: 7, scope: !799, inlinedAt: !835)
!842 = !DILocalVariable(name: "fd", arg: 1, scope: !843, file: !10, line: 89, type: !33)
!843 = distinct !DISubprogram(name: "pipe_splice_size", scope: !10, file: !10, line: 89, type: !844, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !846)
!844 = !DISubroutineType(types: !845)
!845 = !{!441, !33, !441}
!846 = !{!842, !847, !848, !849}
!847 = !DILocalVariable(name: "copysize", arg: 2, scope: !843, file: !10, line: 89, type: !441)
!848 = !DILocalVariable(name: "pipe_cap", scope: !843, file: !10, line: 91, type: !33)
!849 = !DILocalVariable(name: "buf_cap", scope: !843, file: !10, line: 99, type: !35)
!850 = !DILocation(line: 0, scope: !843, inlinedAt: !851)
!851 = distinct !DILocation(line: 128, column: 22, scope: !852, inlinedAt: !835)
!852 = distinct !DILexicalBlock(scope: !799, file: !10, line: 127, column: 7)
!853 = !DILocation(line: 93, column: 19, scope: !854, inlinedAt: !851)
!854 = distinct !DILexicalBlock(scope: !843, file: !10, line: 93, column: 7)
!855 = !DILocation(line: 93, column: 63, scope: !854, inlinedAt: !851)
!856 = !DILocation(line: 93, column: 7, scope: !843, inlinedAt: !851)
!857 = !DILocation(line: 94, column: 16, scope: !854, inlinedAt: !851)
!858 = !DILocation(line: 94, column: 5, scope: !854, inlinedAt: !851)
!859 = !DILocation(line: 131, column: 18, scope: !860, inlinedAt: !835)
!860 = distinct !DILexicalBlock(scope: !861, file: !10, line: 131, column: 11)
!861 = distinct !DILexicalBlock(scope: !852, file: !10, line: 130, column: 5)
!862 = !DILocation(line: 131, column: 11, scope: !860, inlinedAt: !835)
!863 = !DILocation(line: 131, column: 29, scope: !860, inlinedAt: !835)
!864 = !DILocation(line: 131, column: 11, scope: !861, inlinedAt: !835)
!865 = !DILocation(line: 198, column: 1, scope: !799, inlinedAt: !835)
!866 = !DILocation(line: 268, column: 7, scope: !707)
!867 = !DILocation(line: 133, column: 42, scope: !861, inlinedAt: !835)
!868 = !DILocation(line: 0, scope: !843, inlinedAt: !869)
!869 = distinct !DILocation(line: 133, column: 24, scope: !861, inlinedAt: !835)
!870 = !DILocation(line: 93, column: 19, scope: !854, inlinedAt: !869)
!871 = !DILocation(line: 93, column: 63, scope: !854, inlinedAt: !869)
!872 = !DILocation(line: 93, column: 7, scope: !843, inlinedAt: !869)
!873 = !DILocation(line: 94, column: 16, scope: !854, inlinedAt: !869)
!874 = !DILocation(line: 94, column: 5, scope: !854, inlinedAt: !869)
!875 = !DILocation(line: 0, scope: !852, inlinedAt: !835)
!876 = !DILocation(line: 136, column: 22, scope: !877, inlinedAt: !835)
!877 = distinct !DILexicalBlock(scope: !799, file: !10, line: 136, column: 7)
!878 = !DILocation(line: 136, column: 7, scope: !799, inlinedAt: !835)
!879 = !DILocalVariable(name: "alignment", arg: 1, scope: !880, file: !881, line: 90, type: !441)
!880 = distinct !DISubprogram(name: "alignalloc", scope: !881, file: !881, line: 90, type: !882, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !884)
!881 = !DIFile(filename: "./lib/alignalloc.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0a7d01653c1483fdd96283992acf95d0")
!882 = !DISubroutineType(types: !883)
!883 = !{!32, !441, !441}
!884 = !{!879, !885}
!885 = !DILocalVariable(name: "size", arg: 2, scope: !880, file: !881, line: 90, type: !441)
!886 = !DILocation(line: 0, scope: !880, inlinedAt: !887)
!887 = distinct !DILocation(line: 141, column: 23, scope: !888, inlinedAt: !835)
!888 = distinct !DILexicalBlock(scope: !799, file: !10, line: 141, column: 7)
!889 = !DILocation(line: 98, column: 10, scope: !880, inlinedAt: !887)
!890 = !DILocation(line: 141, column: 21, scope: !888, inlinedAt: !835)
!891 = !DILocation(line: 141, column: 7, scope: !799, inlinedAt: !835)
!892 = !DILocalVariable(name: "dest", arg: 1, scope: !893, file: !10, line: 65, type: !39)
!893 = distinct !DISubprogram(name: "repeat_pattern", scope: !10, file: !10, line: 65, type: !894, scopeLine: 66, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !896)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !39, !6, !441, !441}
!896 = !{!892, !897, !898, !899, !900, !902}
!897 = !DILocalVariable(name: "src", arg: 2, scope: !893, file: !10, line: 65, type: !6)
!898 = !DILocalVariable(name: "srcsize", arg: 3, scope: !893, file: !10, line: 65, type: !441)
!899 = !DILocalVariable(name: "bufsize", arg: 4, scope: !893, file: !10, line: 65, type: !441)
!900 = !DILocalVariable(name: "filled", scope: !901, file: !10, line: 69, type: !441)
!901 = distinct !DILexicalBlock(scope: !893, file: !10, line: 69, column: 3)
!902 = !DILocalVariable(name: "chunk", scope: !903, file: !10, line: 71, type: !441)
!903 = distinct !DILexicalBlock(scope: !904, file: !10, line: 70, column: 5)
!904 = distinct !DILexicalBlock(scope: !901, file: !10, line: 69, column: 3)
!905 = !DILocation(line: 0, scope: !893, inlinedAt: !906)
!906 = distinct !DILocation(line: 144, column: 3, scope: !799, inlinedAt: !835)
!907 = !DILocation(line: 67, column: 12, scope: !908, inlinedAt: !906)
!908 = distinct !DILexicalBlock(scope: !893, file: !10, line: 67, column: 7)
!909 = !DILocation(line: 67, column: 7, scope: !893, inlinedAt: !906)
!910 = !DILocation(line: 0, scope: !772, inlinedAt: !911)
!911 = distinct !DILocation(line: 68, column: 5, scope: !908, inlinedAt: !906)
!912 = !DILocation(line: 29, column: 10, scope: !772, inlinedAt: !911)
!913 = !DILocation(line: 68, column: 5, scope: !908, inlinedAt: !906)
!914 = !DILocation(line: 0, scope: !901, inlinedAt: !906)
!915 = !DILocation(line: 69, column: 39, scope: !904, inlinedAt: !906)
!916 = !DILocation(line: 69, column: 3, scope: !901, inlinedAt: !906)
!917 = !DILocation(line: 71, column: 21, scope: !903, inlinedAt: !906)
!918 = !DILocation(line: 0, scope: !903, inlinedAt: !906)
!919 = !DILocation(line: 72, column: 20, scope: !903, inlinedAt: !906)
!920 = !DILocation(line: 0, scope: !772, inlinedAt: !921)
!921 = distinct !DILocation(line: 72, column: 7, scope: !903, inlinedAt: !906)
!922 = !DILocation(line: 29, column: 10, scope: !772, inlinedAt: !921)
!923 = !DILocation(line: 73, column: 14, scope: !903, inlinedAt: !906)
!924 = distinct !{!924, !916, !925, !553}
!925 = !DILocation(line: 74, column: 5, scope: !901, inlinedAt: !906)
!926 = !DILocation(line: 149, column: 21, scope: !799, inlinedAt: !835)
!927 = !DILocation(line: 151, column: 3, scope: !799, inlinedAt: !835)
!928 = !DILocation(line: 115, column: 8, scope: !799, inlinedAt: !835)
!929 = !DILocation(line: 153, column: 7, scope: !812, inlinedAt: !835)
!930 = !DILocation(line: 153, column: 20, scope: !812, inlinedAt: !835)
!931 = !DILocation(line: 153, column: 26, scope: !812, inlinedAt: !835)
!932 = !{!933, !502, i64 0}
!933 = !{!"iovec", !502, i64 0, !934, i64 8}
!934 = !{!"long", !503, i64 0}
!935 = !DILocation(line: 0, scope: !812, inlinedAt: !835)
!936 = !{!933, !934, i64 8}
!937 = !DILocation(line: 156, column: 7, scope: !812, inlinedAt: !835)
!938 = !DILocation(line: 165, column: 15, scope: !821, inlinedAt: !835)
!939 = !DILocation(line: 167, column: 39, scope: !821, inlinedAt: !835)
!940 = !DILocation(line: 167, column: 48, scope: !821, inlinedAt: !835)
!941 = !DILocation(line: 167, column: 24, scope: !821, inlinedAt: !835)
!942 = !DILocation(line: 168, column: 23, scope: !821, inlinedAt: !835)
!943 = !DILocation(line: 156, column: 26, scope: !812, inlinedAt: !835)
!944 = !DILocation(line: 161, column: 44, scope: !821, inlinedAt: !835)
!945 = !DILocation(line: 161, column: 32, scope: !821, inlinedAt: !835)
!946 = !DILocation(line: 0, scope: !821, inlinedAt: !835)
!947 = !DILocation(line: 162, column: 23, scope: !821, inlinedAt: !835)
!948 = !DILocation(line: 163, column: 17, scope: !949, inlinedAt: !835)
!949 = distinct !DILexicalBlock(scope: !821, file: !10, line: 163, column: 15)
!950 = !DILocation(line: 163, column: 15, scope: !821, inlinedAt: !835)
!951 = !DILocation(line: 185, column: 5, scope: !813, inlinedAt: !835)
!952 = !DILocation(line: 172, column: 11, scope: !812, inlinedAt: !835)
!953 = !DILocation(line: 0, scope: !826, inlinedAt: !835)
!954 = !DILocation(line: 177, column: 35, scope: !829, inlinedAt: !835)
!955 = !DILocation(line: 177, column: 27, scope: !829, inlinedAt: !835)
!956 = !DILocation(line: 0, scope: !829, inlinedAt: !835)
!957 = !DILocation(line: 179, column: 21, scope: !958, inlinedAt: !835)
!958 = distinct !DILexicalBlock(scope: !829, file: !10, line: 179, column: 19)
!959 = distinct !{!959, !960, !961, !553}
!960 = !DILocation(line: 175, column: 11, scope: !826, inlinedAt: !835)
!961 = !DILocation(line: 183, column: 13, scope: !826, inlinedAt: !835)
!962 = !DILocation(line: 179, column: 19, scope: !829, inlinedAt: !835)
!963 = !DILocation(line: 175, column: 28, scope: !826, inlinedAt: !835)
!964 = distinct !{!964, !960, !961, !553}
!965 = !DILocation(line: 188, column: 7, scope: !832, inlinedAt: !835)
!966 = !DILocation(line: 187, column: 1, scope: !799, inlinedAt: !835)
!967 = !DILocation(line: 188, column: 17, scope: !832, inlinedAt: !835)
!968 = !DILocation(line: 188, column: 7, scope: !799, inlinedAt: !835)
!969 = !DILocation(line: 190, column: 25, scope: !831, inlinedAt: !835)
!970 = !DILocation(line: 0, scope: !831, inlinedAt: !835)
!971 = !DILocation(line: 191, column: 7, scope: !831, inlinedAt: !835)
!972 = !DILocation(line: 192, column: 14, scope: !831, inlinedAt: !835)
!973 = !DILocation(line: 192, column: 7, scope: !831, inlinedAt: !835)
!974 = !DILocation(line: 193, column: 13, scope: !831, inlinedAt: !835)
!975 = !DILocation(line: 194, column: 5, scope: !831, inlinedAt: !835)
!976 = !DILocalVariable(name: "ptr", arg: 1, scope: !977, file: !881, line: 75, type: !32)
!977 = distinct !DISubprogram(name: "alignfree", scope: !881, file: !881, line: 75, type: !978, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !980)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !32}
!980 = !{!976}
!981 = !DILocation(line: 0, scope: !977, inlinedAt: !982)
!982 = distinct !DILocation(line: 195, column: 3, scope: !799, inlinedAt: !835)
!983 = !DILocation(line: 77, column: 3, scope: !977, inlinedAt: !982)
!984 = !DILocation(line: 272, column: 37, scope: !985)
!985 = distinct !DILexicalBlock(scope: !795, file: !10, line: 270, column: 5)
!986 = !DILocation(line: 273, column: 19, scope: !987)
!987 = distinct !DILexicalBlock(scope: !985, file: !10, line: 273, column: 11)
!988 = !DILocation(line: 273, column: 11, scope: !985)
!989 = !DILocation(line: 0, scope: !893, inlinedAt: !990)
!990 = distinct !DILocation(line: 274, column: 9, scope: !987)
!991 = !DILocation(line: 0, scope: !901, inlinedAt: !990)
!992 = !DILocation(line: 71, column: 21, scope: !903, inlinedAt: !990)
!993 = !DILocation(line: 0, scope: !903, inlinedAt: !990)
!994 = !DILocation(line: 72, column: 20, scope: !903, inlinedAt: !990)
!995 = !DILocation(line: 0, scope: !772, inlinedAt: !996)
!996 = distinct !DILocation(line: 72, column: 7, scope: !903, inlinedAt: !990)
!997 = !DILocation(line: 29, column: 10, scope: !772, inlinedAt: !996)
!998 = !DILocation(line: 73, column: 14, scope: !903, inlinedAt: !990)
!999 = !DILocation(line: 69, column: 39, scope: !904, inlinedAt: !990)
!1000 = !DILocation(line: 69, column: 3, scope: !901, inlinedAt: !990)
!1001 = distinct !{!1001, !1000, !1002, !553}
!1002 = !DILocation(line: 74, column: 5, scope: !901, inlinedAt: !990)
!1003 = !DILocation(line: 275, column: 7, scope: !985)
!1004 = !DILocation(line: 275, column: 14, scope: !985)
!1005 = !DILocation(line: 275, column: 55, scope: !985)
!1006 = distinct !{!1006, !1003, !1007, !553}
!1007 = !DILocation(line: 276, column: 9, scope: !985)
!1008 = !DILocation(line: 279, column: 3, scope: !707)
!1009 = !DILocation(line: 281, column: 1, scope: !707)
!1010 = !DISubprogram(name: "bindtextdomain", scope: !576, file: !576, line: 86, type: !1011, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!39, !6, !6}
!1013 = !DISubprogram(name: "textdomain", scope: !576, file: !576, line: 82, type: !699, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1014 = !DISubprogram(name: "atexit", scope: !698, file: !698, line: 602, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!33, !172}
!1017 = !DISubprogram(name: "getpagesize", scope: !1018, file: !1018, line: 1011, type: !1019, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1018 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!33}
!1021 = !DISubprogram(name: "vmsplice", scope: !1022, file: !1022, line: 414, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1022 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/fcntl-linux.h", directory: "", checksumkind: CSK_MD5, checksum: "1c3bf9fc3309d17651ecfc421f385bcf")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!824, !33, !1025, !35, !14}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!1027 = !DISubprogram(name: "splice", scope: !1022, file: !1022, line: 421, type: !1028, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!824, !33, !1030, !33, !1030, !35, !14}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!1031 = !DISubprogram(name: "close", scope: !1018, file: !1018, line: 358, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !579)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!33, !33}
!1034 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !130, file: !130, line: 50, type: !512, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !1035)
!1035 = !{!1036}
!1036 = !DILocalVariable(name: "file", arg: 1, scope: !1034, file: !130, line: 50, type: !6)
!1037 = !DILocation(line: 0, scope: !1034)
!1038 = !DILocation(line: 52, column: 13, scope: !1034)
!1039 = !DILocation(line: 53, column: 1, scope: !1034)
!1040 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !130, file: !130, line: 87, type: !1041, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !1043)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !48}
!1043 = !{!1044}
!1044 = !DILocalVariable(name: "ignore", arg: 1, scope: !1040, file: !130, line: 87, type: !48)
!1045 = !DILocation(line: 0, scope: !1040)
!1046 = !DILocation(line: 89, column: 16, scope: !1040)
!1047 = !{!1048, !1048, i64 0}
!1048 = !{!"_Bool", !503, i64 0}
!1049 = !DILocation(line: 90, column: 1, scope: !1040)
!1050 = distinct !DISubprogram(name: "close_stdout", scope: !130, file: !130, line: 116, type: !173, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !129, retainedNodes: !1051)
!1051 = !{!1052}
!1052 = !DILocalVariable(name: "write_error", scope: !1053, file: !130, line: 121, type: !6)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !130, line: 120, column: 5)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !130, line: 118, column: 7)
!1055 = !DILocation(line: 118, column: 21, scope: !1054)
!1056 = !DILocation(line: 118, column: 7, scope: !1054)
!1057 = !DILocation(line: 118, column: 29, scope: !1054)
!1058 = !DILocation(line: 119, column: 7, scope: !1054)
!1059 = !DILocation(line: 119, column: 12, scope: !1054)
!1060 = !{i8 0, i8 2}
!1061 = !DILocation(line: 119, column: 25, scope: !1054)
!1062 = !DILocation(line: 119, column: 28, scope: !1054)
!1063 = !DILocation(line: 119, column: 34, scope: !1054)
!1064 = !DILocation(line: 118, column: 7, scope: !1050)
!1065 = !DILocation(line: 121, column: 33, scope: !1053)
!1066 = !DILocation(line: 0, scope: !1053)
!1067 = !DILocation(line: 122, column: 11, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1053, file: !130, line: 122, column: 11)
!1069 = !DILocation(line: 0, scope: !1068)
!1070 = !DILocation(line: 122, column: 11, scope: !1053)
!1071 = !DILocation(line: 123, column: 9, scope: !1068)
!1072 = !DILocation(line: 126, column: 9, scope: !1068)
!1073 = !DILocation(line: 128, column: 14, scope: !1053)
!1074 = !DILocation(line: 128, column: 7, scope: !1053)
!1075 = !DILocation(line: 133, column: 42, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1050, file: !130, line: 133, column: 7)
!1077 = !DILocation(line: 133, column: 28, scope: !1076)
!1078 = !DILocation(line: 133, column: 50, scope: !1076)
!1079 = !DILocation(line: 133, column: 7, scope: !1050)
!1080 = !DILocation(line: 134, column: 12, scope: !1076)
!1081 = !DILocation(line: 134, column: 5, scope: !1076)
!1082 = !DILocation(line: 135, column: 1, scope: !1050)
!1083 = distinct !DISubprogram(name: "verror", scope: !137, file: !137, line: 251, type: !1084, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1086)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !33, !33, !6, !145}
!1086 = !{!1087, !1088, !1089, !1090}
!1087 = !DILocalVariable(name: "status", arg: 1, scope: !1083, file: !137, line: 251, type: !33)
!1088 = !DILocalVariable(name: "errnum", arg: 2, scope: !1083, file: !137, line: 251, type: !33)
!1089 = !DILocalVariable(name: "message", arg: 3, scope: !1083, file: !137, line: 251, type: !6)
!1090 = !DILocalVariable(name: "args", arg: 4, scope: !1083, file: !137, line: 251, type: !145)
!1091 = !DILocation(line: 0, scope: !1083)
!1092 = !DILocation(line: 251, column: 1, scope: !1083)
!1093 = !DILocation(line: 261, column: 3, scope: !1083)
!1094 = !DILocation(line: 265, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1083, file: !137, line: 265, column: 7)
!1096 = !DILocation(line: 265, column: 7, scope: !1083)
!1097 = !DILocation(line: 266, column: 5, scope: !1095)
!1098 = !DILocation(line: 272, column: 7, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1095, file: !137, line: 268, column: 5)
!1100 = !DILocation(line: 276, column: 3, scope: !1083)
!1101 = !{i64 0, i64 8, !501, i64 8, i64 8, !501, i64 16, i64 8, !501, i64 24, i64 4, !587, i64 28, i64 4, !587}
!1102 = !DILocation(line: 282, column: 1, scope: !1083)
!1103 = distinct !DISubprogram(name: "flush_stdout", scope: !137, file: !137, line: 163, type: !173, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1104)
!1104 = !{!1105}
!1105 = !DILocalVariable(name: "stdout_fd", scope: !1103, file: !137, line: 166, type: !33)
!1106 = !DILocation(line: 0, scope: !1103)
!1107 = !DILocalVariable(name: "fd", arg: 1, scope: !1108, file: !137, line: 145, type: !33)
!1108 = distinct !DISubprogram(name: "is_open", scope: !137, file: !137, line: 145, type: !1032, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1109)
!1109 = !{!1107}
!1110 = !DILocation(line: 0, scope: !1108, inlinedAt: !1111)
!1111 = distinct !DILocation(line: 182, column: 25, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1103, file: !137, line: 182, column: 7)
!1113 = !DILocation(line: 157, column: 15, scope: !1108, inlinedAt: !1111)
!1114 = !DILocation(line: 182, column: 25, scope: !1112)
!1115 = !DILocation(line: 182, column: 7, scope: !1103)
!1116 = !DILocation(line: 184, column: 5, scope: !1112)
!1117 = !DILocation(line: 185, column: 1, scope: !1103)
!1118 = distinct !DISubprogram(name: "error_tail", scope: !137, file: !137, line: 219, type: !1084, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1119)
!1119 = !{!1120, !1121, !1122, !1123}
!1120 = !DILocalVariable(name: "status", arg: 1, scope: !1118, file: !137, line: 219, type: !33)
!1121 = !DILocalVariable(name: "errnum", arg: 2, scope: !1118, file: !137, line: 219, type: !33)
!1122 = !DILocalVariable(name: "message", arg: 3, scope: !1118, file: !137, line: 219, type: !6)
!1123 = !DILocalVariable(name: "args", arg: 4, scope: !1118, file: !137, line: 219, type: !145)
!1124 = !DILocation(line: 0, scope: !1118)
!1125 = !DILocation(line: 219, column: 1, scope: !1118)
!1126 = !DILocation(line: 229, column: 13, scope: !1118)
!1127 = !DILocation(line: 229, column: 3, scope: !1118)
!1128 = !DILocalVariable(name: "__stream", arg: 1, scope: !1129, file: !1130, line: 132, type: !1133)
!1129 = distinct !DISubprogram(name: "vfprintf", scope: !1130, file: !1130, line: 132, type: !1131, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1168)
!1130 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!33, !1133, !583, !147}
!1133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1136, file: !65, line: 51, baseType: !33, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1136, file: !65, line: 54, baseType: !39, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1136, file: !65, line: 55, baseType: !39, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1136, file: !65, line: 56, baseType: !39, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1136, file: !65, line: 57, baseType: !39, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1136, file: !65, line: 58, baseType: !39, size: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1136, file: !65, line: 59, baseType: !39, size: 64, offset: 384)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1136, file: !65, line: 60, baseType: !39, size: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1136, file: !65, line: 61, baseType: !39, size: 64, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1136, file: !65, line: 64, baseType: !39, size: 64, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1136, file: !65, line: 65, baseType: !39, size: 64, offset: 640)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1136, file: !65, line: 66, baseType: !39, size: 64, offset: 704)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1136, file: !65, line: 68, baseType: !80, size: 64, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1136, file: !65, line: 70, baseType: !1152, size: 64, offset: 832)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1136, file: !65, line: 72, baseType: !33, size: 32, offset: 896)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1136, file: !65, line: 73, baseType: !33, size: 32, offset: 928)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1136, file: !65, line: 74, baseType: !87, size: 64, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1136, file: !65, line: 77, baseType: !34, size: 16, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1136, file: !65, line: 78, baseType: !92, size: 8, offset: 1040)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1136, file: !65, line: 79, baseType: !94, size: 8, offset: 1048)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1136, file: !65, line: 81, baseType: !98, size: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1136, file: !65, line: 89, baseType: !101, size: 64, offset: 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1136, file: !65, line: 91, baseType: !103, size: 64, offset: 1216)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1136, file: !65, line: 92, baseType: !106, size: 64, offset: 1280)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1136, file: !65, line: 93, baseType: !1152, size: 64, offset: 1344)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1136, file: !65, line: 94, baseType: !32, size: 64, offset: 1408)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1136, file: !65, line: 95, baseType: !35, size: 64, offset: 1472)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1136, file: !65, line: 96, baseType: !33, size: 32, offset: 1536)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1136, file: !65, line: 98, baseType: !113, size: 160, offset: 1568)
!1168 = !{!1128, !1169, !1170}
!1169 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1129, file: !1130, line: 133, type: !583)
!1170 = !DILocalVariable(name: "__ap", arg: 3, scope: !1129, file: !1130, line: 133, type: !147)
