; ModuleID = 'src/b2sum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [39 x i8] c"Print or check %s (%d-bit) checksums.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"BLAKE2b\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [40 x i8] c"Legacy interface to the cksum utility.\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [6 x i8] c"b2sum\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [45 x i8] c"  -b, --binary\0A         read in binary mode\0A\00", align 1, !dbg !29

!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1852, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 35)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1866, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 2)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1868, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 54)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1893, type: !226, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !110, file: !2, line: 194, type: !308, isLocal: true, isDefinition: true)
!308 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "min_digest_line_length", scope: !110, file: !2, line: 197, type: !311, isLocal: true, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !312, line: 130, baseType: !313)
!312 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !201, line: 35, baseType: !314)
!314 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "digest_hex_bytes", scope: !110, file: !2, line: 200, type: !311, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "digest_length", scope: !110, file: !2, line: 241, type: !311, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !132, line: 729, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 56)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !132, line: 736, type: !71, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !328, file: !132, line: 575, type: !133, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "oputs_", scope: !132, file: !132, line: 573, type: !329, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !331)
!329 = !DISubroutineType(cc: DW_CC_nocall, types: !330)
!330 = !{null, !202, !202}
!331 = !{!332, !333, !334, !337, !338, !339, !340, !344, !345, !346, !347, !349, !400, !401, !402, !404, !405}
!332 = !DILocalVariable(name: "program", arg: 1, scope: !328, file: !132, line: 573, type: !202)
!333 = !DILocalVariable(name: "option", arg: 2, scope: !328, file: !132, line: 573, type: !202)
!334 = !DILocalVariable(name: "term", scope: !335, file: !132, line: 585, type: !202)
!335 = distinct !DILexicalBlock(scope: !336, file: !132, line: 582, column: 5)
!336 = distinct !DILexicalBlock(scope: !328, file: !132, line: 581, column: 7)
!337 = !DILocalVariable(name: "double_space", scope: !328, file: !132, line: 594, type: !308)
!338 = !DILocalVariable(name: "first_word", scope: !328, file: !132, line: 595, type: !202)
!339 = !DILocalVariable(name: "option_text", scope: !328, file: !132, line: 596, type: !202)
!340 = !DILocalVariable(name: "s", scope: !341, file: !132, line: 608, type: !202)
!341 = distinct !DILexicalBlock(scope: !342, file: !132, line: 605, column: 5)
!342 = distinct !DILexicalBlock(scope: !343, file: !132, line: 604, column: 12)
!343 = distinct !DILexicalBlock(scope: !328, file: !132, line: 597, column: 7)
!344 = !DILocalVariable(name: "spaces", scope: !341, file: !132, line: 609, type: !200)
!345 = !DILocalVariable(name: "anchor_len", scope: !328, file: !132, line: 620, type: !200)
!346 = !DILocalVariable(name: "desc_text", scope: !328, file: !132, line: 625, type: !202)
!347 = !DILocalVariable(name: "__ptr", scope: !348, file: !132, line: 644, type: !202)
!348 = distinct !DILexicalBlock(scope: !328, file: !132, line: 644, column: 3)
!349 = !DILocalVariable(name: "__stream", scope: !348, file: !132, line: 644, type: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !352, line: 7, baseType: !353)
!352 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !354, line: 49, size: 1728, elements: !355)
!354 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!355 = !{!356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !371, !373, !374, !375, !377, !378, !380, !381, !384, !386, !389, !392, !393, !394, !395, !396}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !353, file: !354, line: 51, baseType: !133, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !353, file: !354, line: 54, baseType: !197, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !353, file: !354, line: 55, baseType: !197, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !353, file: !354, line: 56, baseType: !197, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !353, file: !354, line: 57, baseType: !197, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !353, file: !354, line: 58, baseType: !197, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !353, file: !354, line: 59, baseType: !197, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !353, file: !354, line: 60, baseType: !197, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !353, file: !354, line: 61, baseType: !197, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !353, file: !354, line: 64, baseType: !197, size: 64, offset: 576)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !353, file: !354, line: 65, baseType: !197, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !353, file: !354, line: 66, baseType: !197, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !353, file: !354, line: 68, baseType: !369, size: 64, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !354, line: 36, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !353, file: !354, line: 70, baseType: !372, size: 64, offset: 832)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !353, file: !354, line: 72, baseType: !133, size: 32, offset: 896)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !353, file: !354, line: 73, baseType: !133, size: 32, offset: 928)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !353, file: !354, line: 74, baseType: !376, size: 64, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !182, line: 152, baseType: !314)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !353, file: !354, line: 77, baseType: !199, size: 16, offset: 1024)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !353, file: !354, line: 78, baseType: !379, size: 8, offset: 1040)
!379 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !353, file: !354, line: 79, baseType: !209, size: 8, offset: 1048)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !353, file: !354, line: 81, baseType: !382, size: 64, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !354, line: 43, baseType: null)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !353, file: !354, line: 89, baseType: !385, size: 64, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !182, line: 153, baseType: !314)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !353, file: !354, line: 91, baseType: !387, size: 64, offset: 1216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !354, line: 37, flags: DIFlagFwdDecl)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !353, file: !354, line: 92, baseType: !390, size: 64, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !354, line: 38, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !353, file: !354, line: 93, baseType: !372, size: 64, offset: 1344)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !353, file: !354, line: 94, baseType: !198, size: 64, offset: 1408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !353, file: !354, line: 95, baseType: !200, size: 64, offset: 1472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !353, file: !354, line: 96, baseType: !133, size: 32, offset: 1536)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !353, file: !354, line: 98, baseType: !397, size: 160, offset: 1568)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 20)
!400 = !DILocalVariable(name: "__cnt", scope: !348, file: !132, line: 644, type: !200)
!401 = !DILocalVariable(name: "url_program", scope: !328, file: !132, line: 648, type: !202)
!402 = !DILocalVariable(name: "__ptr", scope: !403, file: !132, line: 686, type: !202)
!403 = distinct !DILexicalBlock(scope: !328, file: !132, line: 686, column: 3)
!404 = !DILocalVariable(name: "__stream", scope: !403, file: !132, line: 686, type: !350)
!405 = !DILocalVariable(name: "__cnt", scope: !403, file: !132, line: 686, type: !200)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !132, line: 585, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 5)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !132, line: 586, type: !408, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !132, line: 595, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 4)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !132, line: 620, type: !26, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !296, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !132, line: 648, type: !408, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !415, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !132, line: 649, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 3)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !132, line: 650, type: !408, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !132, line: 651, type: !26, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !132, line: 652, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 7)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !132, line: 653, type: !16, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !132, line: 654, type: !214, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !132, line: 655, type: !214, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !132, line: 656, type: !214, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !132, line: 657, type: !214, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !132, line: 663, type: !437, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !132, line: 664, type: !214, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 17)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !132, line: 669, type: !21, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !226, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !132, line: 676, type: !465, isLocal: true, isDefinition: true)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 61)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !132, line: 679, type: !428, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !132, line: 683, type: !408, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !132, line: 688, type: !408, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !132, line: 691, type: !16, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !132, line: 839, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 16)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !132, line: 840, type: !483, isLocal: true, isDefinition: true)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 22)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !132, line: 841, type: !226, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !132, line: 862, type: !415, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !132, line: 868, type: !61, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !132, line: 875, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 27)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !51, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !132, line: 877, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 12)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !437, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 460, type: !26, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !226, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 462, type: !26, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !437, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !408, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !437, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !415, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 467, type: !408, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 476, type: !437, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 477, type: !408, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !408, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !16, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "status_only", scope: !110, file: !2, line: 204, type: !308, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "warn", scope: !110, file: !2, line: 208, type: !308, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "quiet", scope: !110, file: !2, line: 214, type: !308, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !110, file: !2, line: 211, type: !308, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "strict", scope: !110, file: !2, line: 218, type: !308, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "digest_delim", scope: !110, file: !2, line: 224, type: !204, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "raw_digest", scope: !110, file: !2, line: 232, type: !308, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1390, type: !296, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1393, type: !428, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1410, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 28)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1440, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 47)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !16, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1461, type: !397, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !26, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1490, type: !437, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1492, type: !428, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1512, type: !226, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1520, type: !555, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 42)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1528, type: !95, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 43)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1536, type: !95, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !31, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1544, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 46)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1552, type: !595, isLocal: true, isDefinition: true)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 25)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !110, file: !2, line: 221, type: !133, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "bin2hex", scope: !602, file: !2, line: 1345, type: !612, isLocal: true, isDefinition: true)
!602 = distinct !DISubprogram(name: "hex_equal", scope: !2, file: !2, line: 1343, type: !603, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !607)
!603 = !DISubroutineType(types: !604)
!604 = !{!308, !605, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!607 = !{!608, !609, !610, !611}
!608 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !602, file: !2, line: 1343, type: !605)
!609 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !602, file: !2, line: 1343, type: !605)
!610 = !DILocalVariable(name: "digest_bin_bytes", scope: !602, file: !2, line: 1349, type: !311)
!611 = !DILocalVariable(name: "cnt", scope: !602, file: !2, line: 1353, type: !311)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 128, elements: !479)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !132, line: 952, type: !501, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1282, type: !415, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1292, type: !428, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !408, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1309, type: !408, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 717, type: !415, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1152, type: !428, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1156, type: !428, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1160, type: !428, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 3584, elements: !232)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !634, line: 50, size: 256, elements: !635)
!634 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!635 = !{!636, !637, !638, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !634, line: 52, baseType: !202, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !633, file: !634, line: 55, baseType: !133, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !633, file: !634, line: 56, baseType: !639, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !633, file: !634, line: 57, baseType: !133, size: 32, offset: 192)
!641 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!644 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!645 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!646 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!647 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !650, file: !651, line: 27, type: !688, isLocal: true, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !661, globals: !669, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!652 = !{!653}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !654, line: 42, baseType: !114, size: 32, elements: !655)
!654 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!657 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!658 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!659 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!660 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!661 = !{!662, !664, !605, !198, !667}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !665, line: 24, baseType: !666)
!665 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !182, line: 38, baseType: !204)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !665, line: 27, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !182, line: 45, baseType: !178)
!669 = !{!648, !670, !684}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "memset_v", scope: !672, file: !673, line: 161, type: !679, isLocal: true, isDefinition: true)
!672 = distinct !DISubprogram(name: "secure_zero_memory", scope: !673, file: !673, line: 159, type: !674, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !676)
!673 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!674 = !DISubroutineType(types: !675)
!675 = !{null, !198, !200}
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "v", arg: 1, scope: !672, file: !673, line: 159, type: !198)
!678 = !DILocalVariable(name: "n", arg: 2, scope: !672, file: !673, line: 159, type: !200)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!198, !198, !133, !200}
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !650, file: !651, line: 35, type: !686, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 1536, elements: !687)
!687 = !{!503, !480}
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 512, elements: !17)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !692, line: 3, type: !226, isLocal: true, isDefinition: true)
!692 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "Version", scope: !695, file: !692, line: 3, type: !202, isLocal: false, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !696, splitDebugInlining: false, nameTableKind: None)
!696 = !{!690, !693}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "file_name", scope: !699, file: !700, line: 45, type: !202, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !701, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!701 = !{!702, !704, !706, !708, !697, !710}
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !700, line: 121, type: !437, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !700, line: 121, type: !501, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !700, line: 123, type: !437, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !700, line: 126, type: !428, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !699, file: !700, line: 55, type: !308, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !714, file: !715, line: 66, type: !766, isLocal: false, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C11, file: !715, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !716, globals: !717, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!716 = !{!198, !204}
!717 = !{!718, !720, !745, !747, !749, !751, !712, !753, !755, !757, !759, !764}
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !715, line: 272, type: !408, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "old_file_name", scope: !722, file: !715, line: 304, type: !202, isLocal: true, isDefinition: true)
!722 = distinct !DISubprogram(name: "verror_at_line", scope: !715, file: !715, line: 298, type: !723, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !714, retainedNodes: !738)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !133, !133, !202, !114, !202, !725}
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !726, line: 52, baseType: !727)
!726 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !728, line: 14, baseType: !729)
!728 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !730, baseType: !731)
!730 = !DIFile(filename: "lib/error.c", directory: "/src")
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !732)
!732 = !{!733, !734, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !731, file: !730, baseType: !198, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !731, file: !730, baseType: !198, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !731, file: !730, baseType: !198, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !731, file: !730, baseType: !133, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !731, file: !730, baseType: !133, size: 32, offset: 224)
!738 = !{!739, !740, !741, !742, !743, !744}
!739 = !DILocalVariable(name: "status", arg: 1, scope: !722, file: !715, line: 298, type: !133)
!740 = !DILocalVariable(name: "errnum", arg: 2, scope: !722, file: !715, line: 298, type: !133)
!741 = !DILocalVariable(name: "file_name", arg: 3, scope: !722, file: !715, line: 298, type: !202)
!742 = !DILocalVariable(name: "line_number", arg: 4, scope: !722, file: !715, line: 298, type: !114)
!743 = !DILocalVariable(name: "message", arg: 5, scope: !722, file: !715, line: 298, type: !202)
!744 = !DILocalVariable(name: "args", arg: 6, scope: !722, file: !715, line: 298, type: !725)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "old_line_number", scope: !722, file: !715, line: 305, type: !114, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !715, line: 338, type: !415, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !715, line: 346, type: !16, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !715, line: 346, type: !296, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "error_message_count", scope: !714, file: !715, line: 69, type: !114, isLocal: false, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !714, file: !715, line: 295, type: !133, isLocal: false, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !715, line: 208, type: !437, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !715, line: 208, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 21)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !715, line: 214, type: !408, isLocal: true, isDefinition: true)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "program_name", scope: !771, file: !772, line: 31, type: !202, isLocal: false, isDefinition: true)
!771 = distinct !DICompileUnit(language: DW_LANG_C11, file: !772, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !773, globals: !774, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!773 = !{!197}
!774 = !{!769, !775, !777}
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !772, line: 46, type: !16, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !772, line: 49, type: !415, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "utf07FF", scope: !781, file: !782, line: 46, type: !809, isLocal: true, isDefinition: true)
!781 = distinct !DISubprogram(name: "proper_name_lite", scope: !782, file: !782, line: 38, type: !783, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !785, retainedNodes: !787)
!782 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!783 = !DISubroutineType(types: !784)
!784 = !{!202, !202, !202}
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !782, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !786, splitDebugInlining: false, nameTableKind: None)
!786 = !{!779}
!787 = !{!788, !789, !790, !791, !796}
!788 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !781, file: !782, line: 38, type: !202)
!789 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !781, file: !782, line: 38, type: !202)
!790 = !DILocalVariable(name: "translation", scope: !781, file: !782, line: 40, type: !202)
!791 = !DILocalVariable(name: "w", scope: !781, file: !782, line: 47, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !793, line: 37, baseType: !794)
!793 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !182, line: 57, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !182, line: 42, baseType: !114)
!796 = !DILocalVariable(name: "mbs", scope: !781, file: !782, line: 48, type: !797)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !798, line: 6, baseType: !799)
!798 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !800, line: 21, baseType: !801)
!800 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 13, size: 64, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !801, file: !800, line: 15, baseType: !133, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !801, file: !800, line: 20, baseType: !805, size: 32, offset: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !801, file: !800, line: 16, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !805, file: !800, line: 18, baseType: !114, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !805, file: !800, line: 19, baseType: !415, size: 32)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 16, elements: !297)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !812, line: 78, type: !16, isLocal: true, isDefinition: true)
!812 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !812, line: 79, type: !26, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !812, line: 80, type: !240, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !812, line: 81, type: !240, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !812, line: 82, type: !397, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !812, line: 83, type: !296, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !812, line: 84, type: !16, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !812, line: 85, type: !437, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !812, line: 86, type: !437, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !812, line: 87, type: !16, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !833, file: !812, line: 76, type: !905, isLocal: false, isDefinition: true)
!833 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !834, retainedTypes: !840, globals: !841, splitDebugInlining: false, nameTableKind: None)
!834 = !{!152, !835, !137}
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !153, line: 254, baseType: !114, size: 32, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!838 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!839 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!840 = !{!133, !199, !200}
!841 = !{!810, !813, !815, !817, !819, !821, !823, !825, !827, !829, !831, !842, !846, !856, !858, !863, !865, !867, !869, !871, !894, !901, !903}
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !833, file: !812, line: 92, type: !844, isLocal: false, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 320, elements: !215)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !833, file: !812, line: 1040, type: !848, isLocal: false, isDefinition: true)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !812, line: 56, size: 448, elements: !849)
!849 = !{!850, !851, !852, !854, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !848, file: !812, line: 59, baseType: !152, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !848, file: !812, line: 62, baseType: !133, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !848, file: !812, line: 66, baseType: !853, size: 256, offset: 64)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !17)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !848, file: !812, line: 69, baseType: !202, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !848, file: !812, line: 72, baseType: !202, size: 64, offset: 384)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !833, file: !812, line: 107, type: !848, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "slot0", scope: !833, file: !812, line: 831, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 256)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !812, line: 321, type: !296, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !812, line: 357, type: !296, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !812, line: 358, type: !296, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !812, line: 199, type: !437, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "quote", scope: !873, file: !812, line: 228, type: !892, isLocal: true, isDefinition: true)
!873 = distinct !DISubprogram(name: "gettext_quote", scope: !812, file: !812, line: 197, type: !874, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !833, retainedNodes: !876)
!874 = !DISubroutineType(types: !875)
!875 = !{!202, !202, !152}
!876 = !{!877, !878, !879, !880, !881}
!877 = !DILocalVariable(name: "msgid", arg: 1, scope: !873, file: !812, line: 197, type: !202)
!878 = !DILocalVariable(name: "s", arg: 2, scope: !873, file: !812, line: 197, type: !152)
!879 = !DILocalVariable(name: "translation", scope: !873, file: !812, line: 199, type: !202)
!880 = !DILocalVariable(name: "w", scope: !873, file: !812, line: 229, type: !792)
!881 = !DILocalVariable(name: "mbs", scope: !873, file: !812, line: 230, type: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !798, line: 6, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !800, line: 21, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 13, size: 64, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !884, file: !800, line: 15, baseType: !133, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !884, file: !800, line: 20, baseType: !888, size: 32, offset: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !884, file: !800, line: 16, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !888, file: !800, line: 18, baseType: !114, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !888, file: !800, line: 19, baseType: !415, size: 32)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 64, elements: !893)
!893 = !{!298, !417}
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "slotvec", scope: !833, file: !812, line: 834, type: !896, isLocal: true, isDefinition: true)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !812, line: 823, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !897, file: !812, line: 825, baseType: !200, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !897, file: !812, line: 826, baseType: !197, size: 64, offset: 64)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "nslots", scope: !833, file: !812, line: 832, type: !133, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "slotvec0", scope: !833, file: !812, line: 833, type: !897, isLocal: true, isDefinition: true)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 704, elements: !907)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!907 = !{!908}
!908 = !DISubrange(count: 11)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !911, line: 67, type: !501, isLocal: true, isDefinition: true)
!911 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !911, line: 69, type: !437, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !911, line: 83, type: !437, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !911, line: 83, type: !415, isLocal: true, isDefinition: true)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !911, line: 85, type: !296, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !911, line: 88, type: !922, isLocal: true, isDefinition: true)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 171)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !911, line: 88, type: !927, isLocal: true, isDefinition: true)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 34)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !911, line: 105, type: !478, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !911, line: 109, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 23)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !911, line: 113, type: !550, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !911, line: 120, type: !941, isLocal: true, isDefinition: true)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 32)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !911, line: 127, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 36)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !911, line: 134, type: !21, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !911, line: 142, type: !95, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !911, line: 150, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 48)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !911, line: 159, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 52)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !911, line: 170, type: !257, isLocal: true, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !911, line: 248, type: !397, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !911, line: 248, type: !483, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !911, line: 254, type: !397, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !911, line: 254, type: !231, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !911, line: 254, type: !21, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !911, line: 259, type: !3, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !911, line: 259, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 29)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !984, file: !985, line: 26, type: !987, isLocal: false, isDefinition: true)
!984 = distinct !DICompileUnit(language: DW_LANG_C11, file: !985, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !986, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!986 = !{!982}
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !203, size: 376, elements: !556)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "exit_failure", scope: !990, file: !991, line: 24, type: !993, isLocal: false, isDefinition: true)
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !992, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!992 = !{!988}
!993 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !996, line: 34, type: !428, isLocal: true, isDefinition: true)
!996 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !996, line: 34, type: !437, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !996, line: 34, type: !456, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !1003, line: 80, type: !437, isLocal: true, isDefinition: true)
!1003 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1006, file: !1007, line: 506, type: !133, isLocal: true, isDefinition: true)
!1006 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1007, file: !1007, line: 485, type: !1008, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1010, retainedNodes: !1012)
!1007 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!133, !133, !133}
!1010 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1007, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1011, splitDebugInlining: false, nameTableKind: None)
!1011 = !{!1004}
!1012 = !{!1013, !1014, !1015, !1016, !1019}
!1013 = !DILocalVariable(name: "fd", arg: 1, scope: !1006, file: !1007, line: 485, type: !133)
!1014 = !DILocalVariable(name: "target", arg: 2, scope: !1006, file: !1007, line: 485, type: !133)
!1015 = !DILocalVariable(name: "result", scope: !1006, file: !1007, line: 487, type: !133)
!1016 = !DILocalVariable(name: "flags", scope: !1017, file: !1007, line: 530, type: !133)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !1007, line: 529, column: 5)
!1018 = distinct !DILexicalBlock(scope: !1006, file: !1007, line: 528, column: 7)
!1019 = !DILocalVariable(name: "saved_errno", scope: !1020, file: !1007, line: 533, type: !133)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !1007, line: 532, column: 9)
!1021 = distinct !DILexicalBlock(scope: !1017, file: !1007, line: 531, column: 11)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 108, type: !209, isLocal: true, isDefinition: true)
!1024 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "internal_state", scope: !1027, file: !1024, line: 97, type: !1030, isLocal: true, isDefinition: true)
!1027 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1024, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1028, globals: !1029, splitDebugInlining: false, nameTableKind: None)
!1028 = !{!198, !200, !204}
!1029 = !{!1022, !1025}
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !798, line: 6, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !800, line: 21, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 13, size: 64, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1032, file: !800, line: 15, baseType: !133, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1032, file: !800, line: 20, baseType: !1036, size: 32, offset: 32)
!1036 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !800, line: 16, size: 32, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1036, file: !800, line: 18, baseType: !114, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1036, file: !800, line: 19, baseType: !415, size: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1042, line: 35, type: !296, isLocal: true, isDefinition: true)
!1042 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1042, line: 35, type: !26, isLocal: true, isDefinition: true)
!1045 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1047, globals: !1049, splitDebugInlining: false, nameTableKind: None)
!1046 = !DIFile(filename: "src/blake2/b2sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0871d6b54d956be5985a128a1aa50d97")
!1047 = !{!1048, !178}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!1049 = !{!1050}
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "buffer_length", scope: !1052, file: !1046, line: 83, type: !1116, isLocal: true, isDefinition: true)
!1052 = distinct !DISubprogram(name: "blake2b_stream", scope: !1046, file: !1046, line: 78, type: !1053, scopeLine: 79, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1045, retainedNodes: !1089)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!133, !1055, !198, !200}
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !352, line: 7, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !354, line: 49, size: 1728, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1057, file: !354, line: 51, baseType: !133, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1057, file: !354, line: 54, baseType: !197, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1057, file: !354, line: 55, baseType: !197, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1057, file: !354, line: 56, baseType: !197, size: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1057, file: !354, line: 57, baseType: !197, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1057, file: !354, line: 58, baseType: !197, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1057, file: !354, line: 59, baseType: !197, size: 64, offset: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1057, file: !354, line: 60, baseType: !197, size: 64, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1057, file: !354, line: 61, baseType: !197, size: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1057, file: !354, line: 64, baseType: !197, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1057, file: !354, line: 65, baseType: !197, size: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1057, file: !354, line: 66, baseType: !197, size: 64, offset: 704)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1057, file: !354, line: 68, baseType: !369, size: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1057, file: !354, line: 70, baseType: !1073, size: 64, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1057, file: !354, line: 72, baseType: !133, size: 32, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1057, file: !354, line: 73, baseType: !133, size: 32, offset: 928)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1057, file: !354, line: 74, baseType: !376, size: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1057, file: !354, line: 77, baseType: !199, size: 16, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1057, file: !354, line: 78, baseType: !379, size: 8, offset: 1040)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1057, file: !354, line: 79, baseType: !209, size: 8, offset: 1048)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1057, file: !354, line: 81, baseType: !382, size: 64, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1057, file: !354, line: 89, baseType: !385, size: 64, offset: 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1057, file: !354, line: 91, baseType: !387, size: 64, offset: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1057, file: !354, line: 92, baseType: !390, size: 64, offset: 1280)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1057, file: !354, line: 93, baseType: !1073, size: 64, offset: 1344)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1057, file: !354, line: 94, baseType: !198, size: 64, offset: 1408)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1057, file: !354, line: 95, baseType: !200, size: 64, offset: 1472)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1057, file: !354, line: 96, baseType: !133, size: 32, offset: 1536)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1057, file: !354, line: 98, baseType: !397, size: 160, offset: 1568)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1113, !1114, !1115}
!1090 = !DILocalVariable(name: "stream", arg: 1, scope: !1052, file: !1046, line: 78, type: !1055)
!1091 = !DILocalVariable(name: "resstream", arg: 2, scope: !1052, file: !1046, line: 78, type: !198)
!1092 = !DILocalVariable(name: "outbytes", arg: 3, scope: !1052, file: !1046, line: 78, type: !200)
!1093 = !DILocalVariable(name: "ret", scope: !1052, file: !1046, line: 80, type: !133)
!1094 = !DILocalVariable(name: "sum", scope: !1052, file: !1046, line: 81, type: !200)
!1095 = !DILocalVariable(name: "n", scope: !1052, file: !1046, line: 81, type: !200)
!1096 = !DILocalVariable(name: "S", scope: !1052, file: !1046, line: 82, type: !1097)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 1984, elements: !210)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "blake2b_state", file: !654, line: 71, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blake2b_state__", file: !654, line: 62, size: 1984, elements: !1100)
!1100 = !{!1101, !1103, !1105, !1106, !1110, !1111, !1112}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1099, file: !654, line: 64, baseType: !1102, size: 512)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 512, elements: !17)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !1099, file: !654, line: 65, baseType: !1104, size: 128, offset: 512)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 128, elements: !297)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1099, file: !654, line: 66, baseType: !1104, size: 128, offset: 640)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !654, line: 67, baseType: !1107, size: 1024, offset: 768)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 1024, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1099, file: !654, line: 68, baseType: !200, size: 64, offset: 1792)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "outlen", scope: !1099, file: !654, line: 69, baseType: !200, size: 64, offset: 1856)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "last_node", scope: !1099, file: !654, line: 70, baseType: !664, size: 8, offset: 1920)
!1113 = !DILocalVariable(name: "buffer", scope: !1052, file: !1046, line: 84, type: !1048)
!1114 = !DILabel(scope: !1052, name: "final_process", file: !1046, line: 117)
!1115 = !DILabel(scope: !1052, name: "cleanup_buffer", file: !1046, line: 123)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!1117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1118, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1119, splitDebugInlining: false, nameTableKind: None)
!1118 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1119 = !{!187}
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1121, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1121 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1122 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1123, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1124, splitDebugInlining: false, nameTableKind: None)
!1123 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1124 = !{!198}
!1125 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1126, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1126 = !DIFile(filename: "lib/fopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc91097c7b0e7b372b0b37f4c608799b")
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1128, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1128 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1129 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1130, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1124, splitDebugInlining: false, nameTableKind: None)
!1130 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1131 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1132, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1132 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1133 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1134, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1134 = !DIFile(filename: "lib/dup-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa6a1c772a9b9ef0682764f116d6de11")
!1135 = distinct !DICompileUnit(language: DW_LANG_C11, file: !911, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1136, retainedTypes: !1124, globals: !1140, splitDebugInlining: false, nameTableKind: None)
!1136 = !{!1137}
!1137 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !911, line: 40, baseType: !114, size: 32, elements: !1138)
!1138 = !{!1139}
!1139 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1140 = !{!909, !912, !914, !916, !918, !920, !925, !930, !932, !937, !939, !944, !949, !951, !953, !958, !963, !965, !967, !969, !971, !973, !975, !977}
!1141 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1142, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1143, retainedTypes: !1171, splitDebugInlining: false, nameTableKind: None)
!1142 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1143 = !{!1144, !1156}
!1144 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1145, file: !1142, line: 188, baseType: !114, size: 32, elements: !1154)
!1145 = distinct !DISubprogram(name: "x2nrealloc", scope: !1142, file: !1142, line: 176, type: !1146, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1141, retainedNodes: !1149)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!198, !198, !1148, !200}
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!1149 = !{!1150, !1151, !1152, !1153}
!1150 = !DILocalVariable(name: "p", arg: 1, scope: !1145, file: !1142, line: 176, type: !198)
!1151 = !DILocalVariable(name: "pn", arg: 2, scope: !1145, file: !1142, line: 176, type: !1148)
!1152 = !DILocalVariable(name: "s", arg: 3, scope: !1145, file: !1142, line: 176, type: !200)
!1153 = !DILocalVariable(name: "n", scope: !1145, file: !1142, line: 178, type: !200)
!1154 = !{!1155}
!1155 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1156 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1157, file: !1142, line: 228, baseType: !114, size: 32, elements: !1154)
!1157 = distinct !DISubprogram(name: "xpalloc", scope: !1142, file: !1142, line: 223, type: !1158, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1141, retainedNodes: !1161)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!198, !198, !1160, !311, !313, !311}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170}
!1162 = !DILocalVariable(name: "pa", arg: 1, scope: !1157, file: !1142, line: 223, type: !198)
!1163 = !DILocalVariable(name: "pn", arg: 2, scope: !1157, file: !1142, line: 223, type: !1160)
!1164 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1157, file: !1142, line: 223, type: !311)
!1165 = !DILocalVariable(name: "n_max", arg: 4, scope: !1157, file: !1142, line: 223, type: !313)
!1166 = !DILocalVariable(name: "s", arg: 5, scope: !1157, file: !1142, line: 223, type: !311)
!1167 = !DILocalVariable(name: "n0", scope: !1157, file: !1142, line: 230, type: !311)
!1168 = !DILocalVariable(name: "n", scope: !1157, file: !1142, line: 237, type: !311)
!1169 = !DILocalVariable(name: "nbytes", scope: !1157, file: !1142, line: 248, type: !311)
!1170 = !DILocalVariable(name: "adjusted_nbytes", scope: !1157, file: !1142, line: 252, type: !311)
!1171 = !{!197, !198, !308, !314, !178}
!1172 = distinct !DICompileUnit(language: DW_LANG_C11, file: !996, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1173, splitDebugInlining: false, nameTableKind: None)
!1173 = !{!994, !997, !999}
!1174 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1175, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1176, globals: !1177, splitDebugInlining: false, nameTableKind: None)
!1175 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!1176 = !{!166, !112}
!1177 = !{!1001}
!1178 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1179, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1180, retainedTypes: !1181, splitDebugInlining: false, nameTableKind: None)
!1179 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1180 = !{!166}
!1181 = !{!308, !314, !178, !1182}
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !180, line: 101, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !182, line: 72, baseType: !314)
!1184 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1185, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1124, splitDebugInlining: false, nameTableKind: None)
!1185 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1186 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1187, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1187 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1188 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1189, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1190, splitDebugInlining: false, nameTableKind: None)
!1189 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1190 = !{!308, !178, !198}
!1191 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1042, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1192, splitDebugInlining: false, nameTableKind: None)
!1192 = !{!1040, !1043}
!1193 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1194, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1194 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1195 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1196, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1124, splitDebugInlining: false, nameTableKind: None)
!1196 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1197 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1198 = !{i32 7, !"Dwarf Version", i32 5}
!1199 = !{i32 2, !"Debug Info Version", i32 3}
!1200 = !{i32 1, !"wchar_size", i32 4}
!1201 = !{i32 8, !"PIC Level", i32 2}
!1202 = !{i32 7, !"PIE Level", i32 2}
!1203 = !{i32 7, !"uwtable", i32 2}
!1204 = !{i32 7, !"frame-pointer", i32 1}
!1205 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 489, type: !1206, scopeLine: 490, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1208)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !133}
!1208 = !{!1209}
!1209 = !DILocalVariable(name: "status", arg: 1, scope: !1205, file: !2, line: 489, type: !133)
!1210 = !DILocation(line: 0, scope: !1205)
!1211 = !DILocation(line: 491, column: 14, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 491, column: 7)
!1213 = !DILocation(line: 491, column: 7, scope: !1205)
!1214 = !DILocation(line: 492, column: 5, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1212, file: !2, line: 492, column: 5)
!1216 = !{!1217, !1217, i64 0}
!1217 = !{!"any pointer", !1218, i64 0}
!1218 = !{!"omnipotent char", !1219, i64 0}
!1219 = !{!"Simple C/C++ TBAA"}
!1220 = !DILocation(line: 495, column: 7, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1212, file: !2, line: 494, column: 5)
!1222 = !DILocation(line: 514, column: 7, scope: !1221)
!1223 = !DILocation(line: 519, column: 7, scope: !1221)
!1224 = !DILocation(line: 729, column: 3, scope: !1225, inlinedAt: !1227)
!1225 = distinct !DISubprogram(name: "emit_stdin_note", scope: !132, file: !132, line: 727, type: !767, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1226)
!1226 = !{}
!1227 = distinct !DILocation(line: 524, column: 7, scope: !1221)
!1228 = !DILocation(line: 736, column: 3, scope: !1229, inlinedAt: !1230)
!1229 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !132, file: !132, line: 734, type: !767, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1226)
!1230 = distinct !DILocation(line: 536, column: 9, scope: !1221)
!1231 = !DILocation(line: 561, column: 9, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 555, column: 11)
!1233 = !DILocation(line: 568, column: 9, scope: !1221)
!1234 = !DILocation(line: 576, column: 9, scope: !1221)
!1235 = !DILocation(line: 605, column: 7, scope: !1221)
!1236 = !DILocation(line: 620, column: 9, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1221, file: !2, line: 614, column: 11)
!1238 = !DILocation(line: 627, column: 7, scope: !1221)
!1239 = !DILocation(line: 632, column: 7, scope: !1221)
!1240 = !DILocation(line: 636, column: 7, scope: !1221)
!1241 = !DILocation(line: 640, column: 7, scope: !1221)
!1242 = !DILocation(line: 644, column: 7, scope: !1221)
!1243 = !DILocation(line: 648, column: 7, scope: !1221)
!1244 = !DILocation(line: 652, column: 7, scope: !1221)
!1245 = !DILocation(line: 664, column: 7, scope: !1221)
!1246 = !DILocation(line: 665, column: 7, scope: !1221)
!1247 = !DILocation(line: 684, column: 7, scope: !1221)
!1248 = !DILocation(line: 687, column: 7, scope: !1221)
!1249 = !DILocalVariable(name: "program", arg: 1, scope: !1250, file: !132, line: 836, type: !202)
!1250 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !132, file: !132, line: 836, type: !1251, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1253)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !202}
!1253 = !{!1249, !1254, !1261, !1262, !1264, !1265}
!1254 = !DILocalVariable(name: "infomap", scope: !1250, file: !132, line: 838, type: !1255)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1256, size: 896, elements: !438)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1250, file: !132, line: 838, size: 128, elements: !1258)
!1258 = !{!1259, !1260}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1257, file: !132, line: 838, baseType: !202, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1257, file: !132, line: 838, baseType: !202, size: 64, offset: 64)
!1261 = !DILocalVariable(name: "node", scope: !1250, file: !132, line: 848, type: !202)
!1262 = !DILocalVariable(name: "map_prog", scope: !1250, file: !132, line: 849, type: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1264 = !DILocalVariable(name: "lc_messages", scope: !1250, file: !132, line: 861, type: !202)
!1265 = !DILocalVariable(name: "url_program", scope: !1250, file: !132, line: 874, type: !202)
!1266 = !DILocation(line: 0, scope: !1250, inlinedAt: !1267)
!1267 = distinct !DILocation(line: 702, column: 7, scope: !1221)
!1268 = !DILocation(line: 857, column: 3, scope: !1250, inlinedAt: !1267)
!1269 = !DILocation(line: 861, column: 29, scope: !1250, inlinedAt: !1267)
!1270 = !DILocation(line: 862, column: 7, scope: !1271, inlinedAt: !1267)
!1271 = distinct !DILexicalBlock(scope: !1250, file: !132, line: 862, column: 7)
!1272 = !DILocation(line: 862, column: 19, scope: !1271, inlinedAt: !1267)
!1273 = !DILocation(line: 862, column: 22, scope: !1271, inlinedAt: !1267)
!1274 = !DILocation(line: 862, column: 7, scope: !1250, inlinedAt: !1267)
!1275 = !DILocation(line: 868, column: 7, scope: !1276, inlinedAt: !1267)
!1276 = distinct !DILexicalBlock(scope: !1271, file: !132, line: 863, column: 5)
!1277 = !DILocation(line: 870, column: 5, scope: !1276, inlinedAt: !1267)
!1278 = !DILocation(line: 875, column: 3, scope: !1250, inlinedAt: !1267)
!1279 = !DILocation(line: 877, column: 3, scope: !1250, inlinedAt: !1267)
!1280 = !DILocation(line: 705, column: 3, scope: !1205)
!1281 = !DISubprogram(name: "dcgettext", scope: !1282, file: !1282, line: 51, type: !1283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1226)
!1282 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!197, !202, !202, !133}
!1285 = !DISubprogram(name: "__fprintf_chk", scope: !1286, file: !1286, line: 93, type: !1287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1226)
!1286 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!133, !1289, !133, !1290, null}
!1289 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !350)
!1290 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !202)
!1291 = !DISubprogram(name: "__printf_chk", scope: !1286, file: !1286, line: 95, type: !1292, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1226)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!133, !133, !1290, null}
!1294 = !DISubprogram(name: "fputs_unlocked", scope: !726, file: !726, line: 691, type: !1295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1226)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!133, !1290, !1289}
!1297 = !DILocation(line: 0, scope: !328)
!1298 = !DILocation(line: 581, column: 7, scope: !336)
!1299 = !{!1300, !1300, i64 0}
!1300 = !{!"int", !1218, i64 0}
!1301 = !DILocation(line: 581, column: 19, scope: !336)
!1302 = !DILocation(line: 581, column: 7, scope: !328)
!1303 = !DILocation(line: 585, column: 26, scope: !335)
!1304 = !DILocation(line: 0, scope: !335)
!1305 = !DILocation(line: 586, column: 23, scope: !335)
!1306 = !DILocation(line: 586, column: 28, scope: !335)
!1307 = !DILocation(line: 586, column: 32, scope: !335)
!1308 = !{!1218, !1218, i64 0}
!1309 = !DILocation(line: 586, column: 38, scope: !335)
!1310 = !DILocalVariable(name: "__s1", arg: 1, scope: !1311, file: !1312, line: 1359, type: !202)
!1311 = distinct !DISubprogram(name: "streq", scope: !1312, file: !1312, line: 1359, type: !1313, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !110, retainedNodes: !1315)
!1312 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!308, !202, !202}
!1315 = !{!1310, !1316}
!1316 = !DILocalVariable(name: "__s2", arg: 2, scope: !1311, file: !1312, line: 1359, type: !202)
!1317 = !DILocation(line: 0, scope: !1311, inlinedAt: !1318)
