; ModuleID = 'src/basenc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.base_decode_context = type { %union.anon.0, ptr, i64 }
%union.anon.0 = type { %struct.base58_context }
%struct.base58_context = type { ptr, i64, i64 }
%struct.base32_decode_context = type { i32, [8 x i8] }
%struct.base2_decode_context = type { i8, i32 }
%struct.z85_decode_context = type { i32, [5 x i8] }
%struct.__mpz_struct = type { i32, i32, ptr }
%struct.base_encode_context = type { %union.anon.0 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.mpn_base_info = type { i32, i64 }
%struct.gmp_div_inverse = type { i32, i64, i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [30 x i8] c"Usage: %s [OPTION]... [FILE]\0A\00", align 1, !dbg !7

!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1667, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 18)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1693, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 14)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1693, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 16)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1693, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 13)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1800, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 22)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1807, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 17)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1814, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 2)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1823, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1825, type: !226, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "base_length", scope: !107, file: !2, line: 272, type: !233, isLocal: true, isDefinition: true)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!236, !236}
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !237, line: 130, baseType: !238)
!237 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !178, line: 35, baseType: !185)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "required_padding", scope: !107, file: !2, line: 273, type: !241, isLocal: true, isDefinition: true)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!131, !131}
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "isubase", scope: !107, file: !2, line: 274, type: !246, isLocal: true, isDefinition: true)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!249, !182}
!249 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "base_encode", scope: !107, file: !2, line: 275, type: !252, isLocal: true, isDefinition: true)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !255, !236, !256, !236}
!255 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !180)
!256 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !174)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "base_decode_ctx_init", scope: !107, file: !2, line: 316, type: !259, isLocal: true, isDefinition: true)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_decode_context", file: !2, line: 303, size: 320, elements: !264)
!264 = !{!265, !309, !310}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !263, file: !2, line: 312, baseType: !266, size: 192)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !263, file: !2, line: 305, size: 192, elements: !267)
!267 = !{!268, !277, !286, !291, !296, !302}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "base64", scope: !266, file: !2, line: 306, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base64_decode_context", file: !270, line: 47, size: 64, elements: !271)
!270 = !DIFile(filename: "./lib/base64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b7f4aff5f88956a8b1e90ed552346cd0")
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !269, file: !270, line: 49, baseType: !131, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !269, file: !270, line: 50, baseType: !274, size: 32, offset: 32)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "base32", scope: !266, file: !2, line: 307, baseType: !278, size: 96)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base32_decode_context", file: !279, line: 47, size: 96, elements: !280)
!279 = !DIFile(filename: "./lib/base32.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e713a01df52addfef9645906d93b4fcb")
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !278, file: !279, line: 49, baseType: !131, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !278, file: !279, line: 50, baseType: !283, size: 64, offset: 32)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base16", scope: !266, file: !2, line: 308, baseType: !287, size: 8)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base16_decode_context", file: !2, line: 278, size: 8, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nibble", scope: !287, file: !2, line: 281, baseType: !290, size: 8)
!290 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base2", scope: !266, file: !2, line: 309, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base2_decode_context", file: !2, line: 297, size: 64, elements: !293)
!293 = !{!294, !295}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "octet", scope: !292, file: !2, line: 299, baseType: !182, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "bit_pos", scope: !292, file: !2, line: 300, baseType: !131, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "z85", scope: !266, file: !2, line: 310, baseType: !297, size: 96)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z85_decode_context", file: !2, line: 284, size: 96, elements: !298)
!298 = !{!299, !300}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !297, file: !2, line: 286, baseType: !131, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "octets", scope: !297, file: !2, line: 287, baseType: !301, size: 40, offset: 32)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 40, elements: !103)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "base58", scope: !266, file: !2, line: 311, baseType: !303, size: 192)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base58_context", file: !2, line: 290, size: 192, elements: !304)
!304 = !{!305, !307, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !303, file: !2, line: 292, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !303, file: !2, line: 293, baseType: !236, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !303, file: !2, line: 294, baseType: !236, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "inbuf", scope: !263, file: !2, line: 313, baseType: !174, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !263, file: !2, line: 314, baseType: !236, size: 64, offset: 256)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "base_decode_ctx", scope: !107, file: !2, line: 317, type: !313, isLocal: true, isDefinition: true)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!249, !262, !255, !236, !256, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "base_decode_ctx_finalize", scope: !107, file: !2, line: 320, type: !319, isLocal: true, isDefinition: true)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!249, !262, !322, !316}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "base_encode_ctx_init", scope: !107, file: !2, line: 330, type: !325, isLocal: true, isDefinition: true)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "base_encode_context", file: !2, line: 323, size: 192, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !329, file: !2, line: 327, baseType: !332, size: 192)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !2, line: 325, size: 192, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "base58", scope: !332, file: !2, line: 326, baseType: !303, size: 192)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "base_encode_ctx", scope: !107, file: !2, line: 331, type: !337, isLocal: true, isDefinition: true)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DISubroutineType(types: !339)
!339 = !{!249, !328, !255, !236, !256, !316}
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "base_encode_ctx_finalize", scope: !107, file: !2, line: 334, type: !342, isLocal: true, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!249, !328, !322, !316}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "has_padding", scope: !107, file: !2, line: 351, type: !347, isLocal: true, isDefinition: true)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!249, !262}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "get_pending_length", scope: !107, file: !2, line: 352, type: !352, isLocal: true, isDefinition: true)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{!131, !262}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !130, line: 729, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 56)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !130, line: 736, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 75)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !367, file: !130, line: 575, type: !131, isLocal: true, isDefinition: true)
!367 = distinct !DISubprogram(name: "oputs_", scope: !130, file: !130, line: 573, type: !368, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !107, retainedNodes: !370)
!368 = !DISubroutineType(cc: DW_CC_nocall, types: !369)
!369 = !{null, !180, !180}
!370 = !{!371, !372, !373, !376, !377, !378, !379, !383, !384, !385, !386, !388, !439, !440, !441, !443, !444}
!371 = !DILocalVariable(name: "program", arg: 1, scope: !367, file: !130, line: 573, type: !180)
!372 = !DILocalVariable(name: "option", arg: 2, scope: !367, file: !130, line: 573, type: !180)
!373 = !DILocalVariable(name: "term", scope: !374, file: !130, line: 585, type: !180)
!374 = distinct !DILexicalBlock(scope: !375, file: !130, line: 582, column: 5)
!375 = distinct !DILexicalBlock(scope: !367, file: !130, line: 581, column: 7)
!376 = !DILocalVariable(name: "double_space", scope: !367, file: !130, line: 594, type: !249)
!377 = !DILocalVariable(name: "first_word", scope: !367, file: !130, line: 595, type: !180)
!378 = !DILocalVariable(name: "option_text", scope: !367, file: !130, line: 596, type: !180)
!379 = !DILocalVariable(name: "s", scope: !380, file: !130, line: 608, type: !180)
!380 = distinct !DILexicalBlock(scope: !381, file: !130, line: 605, column: 5)
!381 = distinct !DILexicalBlock(scope: !382, file: !130, line: 604, column: 12)
!382 = distinct !DILexicalBlock(scope: !367, file: !130, line: 597, column: 7)
!383 = !DILocalVariable(name: "spaces", scope: !380, file: !130, line: 609, type: !177)
!384 = !DILocalVariable(name: "anchor_len", scope: !367, file: !130, line: 620, type: !177)
!385 = !DILocalVariable(name: "desc_text", scope: !367, file: !130, line: 625, type: !180)
!386 = !DILocalVariable(name: "__ptr", scope: !387, file: !130, line: 644, type: !180)
!387 = distinct !DILexicalBlock(scope: !367, file: !130, line: 644, column: 3)
!388 = !DILocalVariable(name: "__stream", scope: !387, file: !130, line: 644, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !391, line: 7, baseType: !392)
!391 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !393, line: 49, size: 1728, elements: !394)
!393 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !410, !412, !413, !414, !417, !418, !419, !420, !423, !425, !428, !431, !432, !433, !434, !435}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !392, file: !393, line: 51, baseType: !131, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !392, file: !393, line: 54, baseType: !174, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !392, file: !393, line: 55, baseType: !174, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !392, file: !393, line: 56, baseType: !174, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !392, file: !393, line: 57, baseType: !174, size: 64, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !392, file: !393, line: 58, baseType: !174, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !392, file: !393, line: 59, baseType: !174, size: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !392, file: !393, line: 60, baseType: !174, size: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !392, file: !393, line: 61, baseType: !174, size: 64, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !392, file: !393, line: 64, baseType: !174, size: 64, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !392, file: !393, line: 65, baseType: !174, size: 64, offset: 640)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !392, file: !393, line: 66, baseType: !174, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !392, file: !393, line: 68, baseType: !408, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !393, line: 36, flags: DIFlagFwdDecl)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !392, file: !393, line: 70, baseType: !411, size: 64, offset: 832)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !392, file: !393, line: 72, baseType: !131, size: 32, offset: 896)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !392, file: !393, line: 73, baseType: !131, size: 32, offset: 928)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !392, file: !393, line: 74, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !416, line: 152, baseType: !185)
!416 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !392, file: !393, line: 77, baseType: !176, size: 16, offset: 1024)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !392, file: !393, line: 78, baseType: !290, size: 8, offset: 1040)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !392, file: !393, line: 79, baseType: !87, size: 8, offset: 1048)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !392, file: !393, line: 81, baseType: !421, size: 64, offset: 1088)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !393, line: 43, baseType: null)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !392, file: !393, line: 89, baseType: !424, size: 64, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !416, line: 153, baseType: !185)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !392, file: !393, line: 91, baseType: !426, size: 64, offset: 1216)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !393, line: 37, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !392, file: !393, line: 92, baseType: !429, size: 64, offset: 1280)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !393, line: 38, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !392, file: !393, line: 93, baseType: !411, size: 64, offset: 1344)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !392, file: !393, line: 94, baseType: !175, size: 64, offset: 1408)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !392, file: !393, line: 95, baseType: !177, size: 64, offset: 1472)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !392, file: !393, line: 96, baseType: !131, size: 32, offset: 1536)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !392, file: !393, line: 98, baseType: !436, size: 160, offset: 1568)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 20)
!439 = !DILocalVariable(name: "__cnt", scope: !387, file: !130, line: 644, type: !177)
!440 = !DILocalVariable(name: "url_program", scope: !367, file: !130, line: 648, type: !180)
!441 = !DILocalVariable(name: "__ptr", scope: !442, file: !130, line: 686, type: !180)
!442 = distinct !DILexicalBlock(scope: !367, file: !130, line: 686, column: 3)
!443 = !DILocalVariable(name: "__stream", scope: !442, file: !130, line: 686, type: !389)
!444 = !DILocalVariable(name: "__cnt", scope: !442, file: !130, line: 686, type: !177)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !130, line: 585, type: !102, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !130, line: 586, type: !102, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !130, line: 595, type: !274, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !130, line: 620, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 6)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !130, line: 648, type: !221, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !130, line: 648, type: !102, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !130, line: 649, type: !274, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !130, line: 649, type: !226, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !130, line: 650, type: !102, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !130, line: 651, type: !453, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !130, line: 651, type: !453, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !130, line: 652, type: !19, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !130, line: 653, type: !283, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !130, line: 654, type: !92, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !130, line: 655, type: !92, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !130, line: 656, type: !92, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !130, line: 657, type: !92, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !130, line: 663, type: !19, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !130, line: 664, type: !92, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !130, line: 669, type: !216, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !130, line: 669, type: !490, isLocal: true, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 40)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !130, line: 676, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 15)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !130, line: 676, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 61)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !130, line: 679, type: !226, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !130, line: 683, type: !102, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !130, line: 688, type: !102, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !130, line: 691, type: !283, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !130, line: 839, type: !201, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !130, line: 840, type: !211, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !130, line: 841, type: !495, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !130, line: 862, type: !274, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !130, line: 868, type: !521, isLocal: true, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 71)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !130, line: 875, type: !526, isLocal: true, isDefinition: true)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 27)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !130, line: 877, type: !531, isLocal: true, isDefinition: true)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 51)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !130, line: 877, type: !536, isLocal: true, isDefinition: true)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !537)
!537 = !{!538}
!538 = !DISubrange(count: 12)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !19, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !102, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !495, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !19, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !92, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !19, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !19, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !92, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !19, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !92, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !92, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !274, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !102, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !283, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 432, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 32)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 432, type: !206, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 432, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 664, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 83)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 25)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 592, elements: !27)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "base32_norm_to_hex", scope: !107, file: !2, line: 568, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 328, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 41)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "base32_hex_to_norm", scope: !107, file: !2, line: 590, type: !589, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "base16_to_int", scope: !107, file: !2, line: 686, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 2048, elements: !598)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!598 = !{!599}
!599 = !DISubrange(count: 256)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "base16", scope: !602, file: !2, line: 770, type: !610, isLocal: true, isDefinition: true)
!602 = distinct !DISubprogram(name: "base16_encode", scope: !2, file: !2, line: 767, type: !253, scopeLine: 769, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !107, retainedNodes: !603)
!603 = !{!604, !605, !606, !607, !608}
!604 = !DILocalVariable(name: "in", arg: 1, scope: !602, file: !2, line: 767, type: !255)
!605 = !DILocalVariable(name: "inlen", arg: 2, scope: !602, file: !2, line: 767, type: !236)
!606 = !DILocalVariable(name: "out", arg: 3, scope: !602, file: !2, line: 768, type: !256)
!607 = !DILocalVariable(name: "outlen", arg: 4, scope: !602, file: !2, line: 768, type: !236)
!608 = !DILocalVariable(name: "c", scope: !609, file: !2, line: 774, type: !182)
!609 = distinct !DILexicalBlock(scope: !602, file: !2, line: 773, column: 5)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 128, elements: !202)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !206, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 192, elements: !98)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !2, line: 852, type: !97, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 878, type: !357, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "z85_encoding", scope: !107, file: !2, line: 855, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 680, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 85)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "z85_decoding", scope: !107, file: !2, line: 941, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 744, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 93)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1235, type: !495, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1235, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 216, elements: !527)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "base58_to_gmp", scope: !107, file: !2, line: 1200, type: !596, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1278, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 34)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1278, type: !644, isLocal: true, isDefinition: true)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 464, elements: !44)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1293, type: !490, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "gmp_to_base58", scope: !107, file: !2, line: 1181, type: !596, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1379, type: !436, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1379, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 536, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 67)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1402, type: !9, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1601, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 11)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1617, type: !196, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !130, line: 952, type: !536, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1479, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 23)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 3840, elements: !496)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !675, line: 50, size: 256, elements: !676)
!675 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!676 = !{!677, !678, !679, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !675, line: 52, baseType: !180, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !674, file: !675, line: 55, baseType: !131, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !675, line: 56, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !674, file: !675, line: 57, baseType: !131, size: 32, offset: 192)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !684, line: 3, type: !495, isLocal: true, isDefinition: true)
!684 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "Version", scope: !687, file: !684, line: 3, type: !180, isLocal: false, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !688, splitDebugInlining: false, nameTableKind: None)
!688 = !{!682, !685}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "base32_to_int", scope: !691, file: !692, line: 206, type: !596, isLocal: false, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !693, globals: !694, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "lib/base32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "95987f1bba4d0dce67e048a4dafbe22a")
!693 = !{!249, !185, !179, !175, !174}
!694 = !{!695, !689}
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "b32str", scope: !697, file: !692, line: 68, type: !703, isLocal: true, isDefinition: true)
!697 = distinct !DISubprogram(name: "base32_encode", scope: !692, file: !692, line: 65, type: !253, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !691, retainedNodes: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DILocalVariable(name: "in", arg: 1, scope: !697, file: !692, line: 65, type: !255)
!700 = !DILocalVariable(name: "inlen", arg: 2, scope: !697, file: !692, line: 65, type: !236)
!701 = !DILocalVariable(name: "out", arg: 3, scope: !697, file: !692, line: 66, type: !256)
!702 = !DILocalVariable(name: "outlen", arg: 4, scope: !697, file: !692, line: 66, type: !236)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 256, elements: !570)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !706, file: !707, line: 243, type: !596, isLocal: false, isDefinition: true)
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !707, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !693, globals: !708, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!708 = !{!704, !709}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "b64c", scope: !706, file: !707, line: 62, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 512, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 64)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "file_name", scope: !716, file: !717, line: 45, type: !180, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!718 = !{!719, !721, !723, !725, !714, !727}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !717, line: 121, type: !19, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !717, line: 121, type: !536, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !717, line: 123, type: !19, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !717, line: 126, type: !226, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !716, file: !717, line: 55, type: !249, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !731, file: !732, line: 66, type: !783, isLocal: false, isDefinition: true)
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !732, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !733, globals: !734, splitDebugInlining: false, nameTableKind: None)
!732 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!733 = !{!175, !182}
!734 = !{!735, !737, !762, !764, !766, !768, !729, !770, !772, !774, !776, !781}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !732, line: 272, type: !102, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "old_file_name", scope: !739, file: !732, line: 304, type: !180, isLocal: true, isDefinition: true)
!739 = distinct !DISubprogram(name: "verror_at_line", scope: !732, file: !732, line: 298, type: !740, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !755)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !131, !131, !180, !111, !180, !742}
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !743, line: 52, baseType: !744)
!743 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !745, line: 14, baseType: !746)
!745 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !747, baseType: !748)
!747 = !DIFile(filename: "lib/error.c", directory: "/src")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !749)
!749 = !{!750, !751, !752, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !748, file: !747, baseType: !175, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !748, file: !747, baseType: !175, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !748, file: !747, baseType: !175, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !748, file: !747, baseType: !131, size: 32, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !748, file: !747, baseType: !131, size: 32, offset: 224)
!755 = !{!756, !757, !758, !759, !760, !761}
!756 = !DILocalVariable(name: "status", arg: 1, scope: !739, file: !732, line: 298, type: !131)
!757 = !DILocalVariable(name: "errnum", arg: 2, scope: !739, file: !732, line: 298, type: !131)
!758 = !DILocalVariable(name: "file_name", arg: 3, scope: !739, file: !732, line: 298, type: !180)
!759 = !DILocalVariable(name: "line_number", arg: 4, scope: !739, file: !732, line: 298, type: !111)
!760 = !DILocalVariable(name: "message", arg: 5, scope: !739, file: !732, line: 298, type: !180)
!761 = !DILocalVariable(name: "args", arg: 6, scope: !739, file: !732, line: 298, type: !742)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "old_line_number", scope: !739, file: !732, line: 305, type: !111, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !732, line: 338, type: !274, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !732, line: 346, type: !283, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !732, line: 346, type: !221, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "error_message_count", scope: !731, file: !732, line: 69, type: !111, isLocal: false, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !731, file: !732, line: 295, type: !131, isLocal: false, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !732, line: 208, type: !19, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !732, line: 208, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 21)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !732, line: 214, type: !102, isLocal: true, isDefinition: true)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null}
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "mp_bits_per_limb", scope: !788, file: !792, line: 288, type: !1202, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !789, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !790, retainedTypes: !797, globals: !807, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "lib/mini-gmp-gnulib.c", directory: "/src", checksumkind: CSK_MD5, checksum: "18c9693e80e8dc09ed363761a1d33237")
!790 = !{!791, !158}
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mpz_div_round_mode", file: !792, line: 2197, baseType: !111, size: 32, elements: !793)
!792 = !DIFile(filename: "./lib/mini-gmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5bab32053bcda54c422f28ad9a48f3db")
!793 = !{!794, !795, !796}
!794 = !DIEnumerator(name: "GMP_DIV_FLOOR", value: 0)
!795 = !DIEnumerator(name: "GMP_DIV_CEIL", value: 1)
!796 = !DIEnumerator(name: "GMP_DIV_TRUNC", value: 2)
!797 = !{!798, !800, !179, !185, !802, !131, !803, !804, !174, !306, !182, !176, !111, !238, !805}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_limb_t", file: !799, line: 60, baseType: !179)
!799 = !DIFile(filename: "./lib/mini-gmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "68d9292d80d921bf50de4da10cd36738")
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_ptr", file: !799, line: 64, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!802 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_size_t", file: !799, line: 61, baseType: !185)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "mp_bitcnt_t", file: !799, line: 62, baseType: !179)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!807 = !{!786, !808, !810, !812, !815, !820, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841, !843, !845, !850, !852, !854, !856, !858, !863, !865, !880, !883, !885, !888, !890, !893, !895, !897, !899, !904, !906, !908, !910, !915, !920, !922, !927, !932, !937, !942, !947, !949, !951, !953, !955, !958, !960, !962, !967, !969, !971, !973, !978, !980, !985, !987, !992, !994, !996, !998, !1000, !1002, !1007, !1009, !1014, !1019, !1021, !1023, !1025, !1030, !1032, !1034, !1036, !1041, !1046, !1051, !1053, !1055, !1060, !1063, !1065, !1067, !1069, !1074, !1079, !1081, !1083, !1085, !1090, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1112, !1114, !1116, !1118, !1121, !1123, !1125, !1130, !1132, !1134, !1136, !1138, !1140, !1145, !1147, !1152, !1154, !1156, !1161, !1163, !1165, !1167, !1170, !1172, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1195}
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !792, line: 455, type: !453, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !792, line: 455, type: !216, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !792, line: 455, type: !814, isLocal: true, isDefinition: true)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 488, elements: !501)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !792, line: 493, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 9)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !792, line: 493, type: !822, isLocal: true, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 560, elements: !15)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !792, line: 506, type: !814, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !792, line: 545, type: !822, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !792, line: 558, type: !19, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !792, line: 558, type: !814, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !792, line: 581, type: !711, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !792, line: 607, type: !711, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !792, line: 631, type: !817, isLocal: true, isDefinition: true)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !792, line: 631, type: !822, isLocal: true, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !792, line: 632, type: !283, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(scope: null, file: !792, line: 633, type: !490, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !792, line: 634, type: !490, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !792, line: 672, type: !847, isLocal: true, isDefinition: true)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 520, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 65)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !792, line: 673, type: !817, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !792, line: 674, type: !436, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !792, line: 702, type: !847, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1329, type: !19, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1329, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 480, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 60)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1330, type: !206, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "dummy_limb", scope: !867, file: !792, line: 1437, type: !879, isLocal: true, isDefinition: true)
!867 = distinct !DISubprogram(name: "mpz_init", scope: !792, file: !792, line: 1435, type: !868, scopeLine: 1436, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !877)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mpz_struct", file: !799, line: 75, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !799, line: 67, size: 128, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_alloc", scope: !872, file: !799, line: 69, baseType: !131, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_size", scope: !872, file: !799, line: 71, baseType: !131, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_mp_d", scope: !872, file: !799, line: 74, baseType: !801, size: 64, offset: 64)
!877 = !{!878}
!878 = !DILocalVariable(name: "r", arg: 1, scope: !867, file: !792, line: 1435, type: !870)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1676, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 408, elements: !532)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1750, type: !283, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1750, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 312, elements: !5)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2535, type: !92, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2535, type: !892, isLocal: true, isDefinition: true)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 624, elements: !51)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2661, type: !586, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2718, type: !711, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2719, type: !19, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2720, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 36)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2721, type: !206, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2722, type: !436, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2740, type: !92, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2994, type: !912, isLocal: true, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 35)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2994, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 864, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 108)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3150, type: !669, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3169, type: !924, isLocal: true, isDefinition: true)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 768, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 96)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3178, type: !929, isLocal: true, isDefinition: true)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !930)
!930 = !{!931}
!931 = !DISubrange(count: 53)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3261, type: !934, isLocal: true, isDefinition: true)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 48)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3263, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 26)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3355, type: !944, isLocal: true, isDefinition: true)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 376, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 47)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3356, type: !206, isLocal: true, isDefinition: true)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3366, type: !860, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3373, type: !669, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3643, type: !216, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3643, type: !957, isLocal: true, isDefinition: true)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 400, elements: !76)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3682, type: !283, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3907, type: !283, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3907, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 584, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 73)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3980, type: !964, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4049, type: !964, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4132, type: !19, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4132, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 544, elements: !976)
!976 = !{!977}
!977 = !DISubrange(count: 68)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4244, type: !92, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4244, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 392, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 49)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4245, type: !660, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4296, type: !989, isLocal: true, isDefinition: true)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 63)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4300, type: !55, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4373, type: !3, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4373, type: !882, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4458, type: !19, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4461, type: !536, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4519, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 33)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4521, type: !939, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4521, type: !1011, isLocal: true, isDefinition: true)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 640, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 80)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4522, type: !1016, isLocal: true, isDefinition: true)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 28)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4565, type: !211, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4582, type: !1004, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4584, type: !576, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4586, type: !1027, isLocal: true, isDefinition: true)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 29)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4606, type: !92, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4669, type: !283, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !792, line: 4670, type: !660, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "gmp_allocate_func", scope: !788, file: !792, line: 332, type: !1038, isLocal: true, isDefinition: true)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!175, !177}
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "gmp_reallocate_func", scope: !788, file: !792, line: 333, type: !1043, isLocal: true, isDefinition: true)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!175, !175, !177, !177}
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "gmp_free_func", scope: !788, file: !792, line: 334, type: !1048, isLocal: true, isDefinition: true)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !175, !177}
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !792, line: 304, type: !817, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !792, line: 304, type: !703, isLocal: true, isDefinition: true)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !792, line: 308, type: !1057, isLocal: true, isDefinition: true)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 45)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !792, line: 321, type: !1062, isLocal: true, isDefinition: true)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !945)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !792, line: 728, type: !9, isLocal: true, isDefinition: true)
!1065 = !DIGlobalVariableExpression(var: !1066, expr: !DIExpression())
!1066 = distinct !DIGlobalVariable(scope: null, file: !792, line: 728, type: !576, isLocal: true, isDefinition: true)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !792, line: 729, type: !191, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1272, type: !1071, isLocal: true, isDefinition: true)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 59)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1272, type: !1076, isLocal: true, isDefinition: true)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 672, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 84)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1383, type: !19, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1383, type: !917, isLocal: true, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1407, type: !283, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !792, line: 381, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 440, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 55)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2020, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 656, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 82)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2209, type: !1016, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2441, type: !924, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1161, type: !19, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1161, type: !847, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1162, type: !817, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2677, type: !536, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2677, type: !1109, isLocal: true, isDefinition: true)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 344, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 43)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2797, type: !201, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !792, line: 2797, type: !589, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(scope: null, file: !792, line: 295, type: !274, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !792, line: 945, type: !1120, isLocal: true, isDefinition: true)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 568, elements: !522)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !792, line: 958, type: !19, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(scope: null, file: !792, line: 928, type: !964, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1126, type: !1127, isLocal: true, isDefinition: true)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 832, elements: !1128)
!1128 = !{!1129}
!1129 = !DISubrange(count: 104)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1138, type: !436, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1139, type: !436, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1140, type: !639, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1022, type: !283, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1022, type: !1076, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1049, type: !1142, isLocal: true, isDefinition: true)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !1143)
!1143 = !{!1144}
!1144 = !DISubrange(count: 54)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1070, type: !19, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1070, type: !1149, isLocal: true, isDefinition: true)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 728, elements: !1150)
!1150 = !{!1151}
!1151 = !DISubrange(count: 91)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1076, type: !1027, isLocal: true, isDefinition: true)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3603, type: !453, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3603, type: !1158, isLocal: true, isDefinition: true)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 920, elements: !1159)
!1159 = !{!1160}
!1160 = !DISubrange(count: 115)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3557, type: !196, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3557, type: !644, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3436, type: !453, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3436, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 360, elements: !1058)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3437, type: !19, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3495, type: !19, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3495, type: !1149, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3496, type: !211, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3497, type: !211, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3498, type: !211, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3806, type: !201, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !792, line: 3806, type: !957, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1223, type: !453, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !792, line: 1223, type: !944, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !792, line: 915, type: !453, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !792, line: 915, type: !1194, isLocal: true, isDefinition: true)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 496, elements: !32)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "i", scope: !1197, file: !792, line: 4495, type: !1202, isLocal: true, isDefinition: true)
!1197 = distinct !DISubprogram(name: "gmp_detect_endian", scope: !792, file: !792, line: 4493, type: !1198, scopeLine: 4494, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !1200)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!131}
!1200 = !{!1201}
!1201 = !DILocalVariable(name: "p", scope: !1197, file: !792, line: 4496, type: !805)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(name: "program_name", scope: !1205, file: !1206, line: 31, type: !180, isLocal: false, isDefinition: true)
!1205 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1206, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1207, globals: !1208, splitDebugInlining: false, nameTableKind: None)
!1206 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1207 = !{!174}
!1208 = !{!1203, !1209, !1211}
!1209 = !DIGlobalVariableExpression(var: !1210, expr: !DIExpression())
!1210 = distinct !DIGlobalVariable(scope: null, file: !1206, line: 46, type: !283, isLocal: true, isDefinition: true)
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1206, line: 49, type: !274, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1215, file: !1216, line: 46, type: !1243, isLocal: true, isDefinition: true)
!1215 = distinct !DISubprogram(name: "proper_name_lite", scope: !1216, file: !1216, line: 38, type: !1217, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1219, retainedNodes: !1221)
!1216 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!180, !180, !180}
!1219 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1216, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1220, splitDebugInlining: false, nameTableKind: None)
!1220 = !{!1213}
!1221 = !{!1222, !1223, !1224, !1225, !1230}
!1222 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1215, file: !1216, line: 38, type: !180)
!1223 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1215, file: !1216, line: 38, type: !180)
!1224 = !DILocalVariable(name: "translation", scope: !1215, file: !1216, line: 40, type: !180)
!1225 = !DILocalVariable(name: "w", scope: !1215, file: !1216, line: 47, type: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1227, line: 37, baseType: !1228)
!1227 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !416, line: 57, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !416, line: 42, baseType: !111)
!1230 = !DILocalVariable(name: "mbs", scope: !1215, file: !1216, line: 48, type: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1232, line: 6, baseType: !1233)
!1232 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1234, line: 21, baseType: !1235)
!1234 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1234, line: 13, size: 64, elements: !1236)
!1236 = !{!1237, !1238}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1235, file: !1234, line: 15, baseType: !131, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1235, file: !1234, line: 20, baseType: !1239, size: 32, offset: 32)
!1239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1235, file: !1234, line: 16, size: 32, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1239, file: !1234, line: 18, baseType: !111, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1239, file: !1234, line: 19, baseType: !274, size: 32)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 16, elements: !222)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 78, type: !283, isLocal: true, isDefinition: true)
!1246 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 79, type: !453, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 80, type: !206, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 81, type: !206, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 82, type: !436, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 83, type: !221, isLocal: true, isDefinition: true)
!1257 = !DIGlobalVariableExpression(var: !1258, expr: !DIExpression())
!1258 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 84, type: !283, isLocal: true, isDefinition: true)
!1259 = !DIGlobalVariableExpression(var: !1260, expr: !DIExpression())
!1260 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 85, type: !19, isLocal: true, isDefinition: true)
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 86, type: !19, isLocal: true, isDefinition: true)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 87, type: !283, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1267, file: !1246, line: 76, type: !1337, isLocal: false, isDefinition: true)
!1267 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1246, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1268, retainedTypes: !1274, globals: !1275, splitDebugInlining: false, nameTableKind: None)
!1268 = !{!135, !1269, !158}
!1269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !136, line: 254, baseType: !111, size: 32, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1272 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1273 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1274 = !{!131, !176, !177}
!1275 = !{!1244, !1247, !1249, !1251, !1253, !1255, !1257, !1259, !1261, !1263, !1265, !1276, !1280, !1290, !1292, !1295, !1297, !1299, !1301, !1303, !1326, !1333, !1335}
!1276 = !DIGlobalVariableExpression(var: !1277, expr: !DIExpression())
!1277 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1267, file: !1246, line: 92, type: !1278, isLocal: false, isDefinition: true)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1279, size: 320, elements: !93)
!1279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!1280 = !DIGlobalVariableExpression(var: !1281, expr: !DIExpression())
!1281 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1267, file: !1246, line: 1040, type: !1282, isLocal: false, isDefinition: true)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1246, line: 56, size: 448, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1288, !1289}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1282, file: !1246, line: 59, baseType: !135, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1282, file: !1246, line: 62, baseType: !131, size: 32, offset: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1282, file: !1246, line: 66, baseType: !1287, size: 256, offset: 64)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !284)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1282, file: !1246, line: 69, baseType: !180, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1282, file: !1246, line: 72, baseType: !180, size: 64, offset: 384)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1267, file: !1246, line: 107, type: !1282, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(name: "slot0", scope: !1267, file: !1246, line: 831, type: !1294, isLocal: true, isDefinition: true)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !598)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 321, type: !221, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 357, type: !221, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 358, type: !221, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1246, line: 199, type: !19, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
