; ModuleID = 'src/cat.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Concatenate FILE(s) to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"cat\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [47 x i8] c"  -A, --show-all           equivalent to -vET\0A\00", align 1, !dbg !22

!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 19)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 647, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 20)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 657, type: !157, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 699, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 3)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 736, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 30)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 821, type: !235, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !2, line: 826, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 23)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "infile", scope: !89, file: !2, line: 50, type: !151, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "input_desc", scope: !89, file: !2, line: 53, type: !86, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 56)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !266, file: !92, line: 575, type: !86, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !267, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !269)
!267 = !DISubroutineType(cc: DW_CC_nocall, types: !268)
!268 = !{null, !151, !151}
!269 = !{!270, !271, !272, !275, !276, !277, !278, !282, !283, !284, !285, !287, !336, !337, !338, !340, !341}
!270 = !DILocalVariable(name: "program", arg: 1, scope: !266, file: !92, line: 573, type: !151)
!271 = !DILocalVariable(name: "option", arg: 2, scope: !266, file: !92, line: 573, type: !151)
!272 = !DILocalVariable(name: "term", scope: !273, file: !92, line: 585, type: !151)
!273 = distinct !DILexicalBlock(scope: !274, file: !92, line: 582, column: 5)
!274 = distinct !DILexicalBlock(scope: !266, file: !92, line: 581, column: 7)
!275 = !DILocalVariable(name: "double_space", scope: !266, file: !92, line: 594, type: !145)
!276 = !DILocalVariable(name: "first_word", scope: !266, file: !92, line: 595, type: !151)
!277 = !DILocalVariable(name: "option_text", scope: !266, file: !92, line: 596, type: !151)
!278 = !DILocalVariable(name: "s", scope: !279, file: !92, line: 608, type: !151)
!279 = distinct !DILexicalBlock(scope: !280, file: !92, line: 605, column: 5)
!280 = distinct !DILexicalBlock(scope: !281, file: !92, line: 604, column: 12)
!281 = distinct !DILexicalBlock(scope: !266, file: !92, line: 597, column: 7)
!282 = !DILocalVariable(name: "spaces", scope: !279, file: !92, line: 609, type: !149)
!283 = !DILocalVariable(name: "anchor_len", scope: !266, file: !92, line: 620, type: !149)
!284 = !DILocalVariable(name: "desc_text", scope: !266, file: !92, line: 625, type: !151)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !92, line: 644, type: !151)
!286 = distinct !DILexicalBlock(scope: !266, file: !92, line: 644, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !92, line: 644, type: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !290, line: 7, baseType: !291)
!290 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !292, line: 49, size: 1728, elements: !293)
!292 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !309, !311, !312, !313, !316, !317, !319, !320, !323, !325, !328, !331, !332, !333, !334, !335}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !291, file: !292, line: 51, baseType: !86, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !291, file: !292, line: 54, baseType: !88, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !291, file: !292, line: 55, baseType: !88, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !291, file: !292, line: 56, baseType: !88, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !291, file: !292, line: 57, baseType: !88, size: 64, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !291, file: !292, line: 58, baseType: !88, size: 64, offset: 320)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !291, file: !292, line: 59, baseType: !88, size: 64, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !291, file: !292, line: 60, baseType: !88, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !291, file: !292, line: 61, baseType: !88, size: 64, offset: 512)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !291, file: !292, line: 64, baseType: !88, size: 64, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !291, file: !292, line: 65, baseType: !88, size: 64, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !291, file: !292, line: 66, baseType: !88, size: 64, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !291, file: !292, line: 68, baseType: !307, size: 64, offset: 768)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !292, line: 36, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !291, file: !292, line: 70, baseType: !310, size: 64, offset: 832)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !291, file: !292, line: 72, baseType: !86, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !291, file: !292, line: 73, baseType: !86, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !291, file: !292, line: 74, baseType: !314, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !315, line: 152, baseType: !146)
!315 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !291, file: !292, line: 77, baseType: !148, size: 16, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !291, file: !292, line: 78, baseType: !318, size: 8, offset: 1040)
!318 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !291, file: !292, line: 79, baseType: !199, size: 8, offset: 1048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !291, file: !292, line: 81, baseType: !321, size: 64, offset: 1088)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !292, line: 43, baseType: null)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !291, file: !292, line: 89, baseType: !324, size: 64, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !315, line: 153, baseType: !146)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !291, file: !292, line: 91, baseType: !326, size: 64, offset: 1216)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !292, line: 37, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !291, file: !292, line: 92, baseType: !329, size: 64, offset: 1280)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !292, line: 38, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !291, file: !292, line: 93, baseType: !310, size: 64, offset: 1344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !291, file: !292, line: 94, baseType: !144, size: 64, offset: 1408)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !291, file: !292, line: 95, baseType: !149, size: 64, offset: 1472)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !291, file: !292, line: 96, baseType: !86, size: 32, offset: 1536)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !291, file: !292, line: 98, baseType: !228, size: 160, offset: 1568)
!336 = !DILocalVariable(name: "__cnt", scope: !286, file: !92, line: 644, type: !149)
!337 = !DILocalVariable(name: "url_program", scope: !266, file: !92, line: 648, type: !151)
!338 = !DILocalVariable(name: "__ptr", scope: !339, file: !92, line: 686, type: !151)
!339 = distinct !DILexicalBlock(scope: !266, file: !92, line: 686, column: 3)
!340 = !DILocalVariable(name: "__stream", scope: !339, file: !92, line: 686, type: !288)
!341 = !DILocalVariable(name: "__cnt", scope: !339, file: !92, line: 686, type: !149)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !189, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !189, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 6)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !235, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !189, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !240, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !189, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !350, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !162, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !194, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !177, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !177, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !177, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !177, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !162, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !177, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !172, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 40)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 15)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 61)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !240, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !189, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !189, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !194, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !157, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 22)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !392, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !29, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 27)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !428, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 51)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 12)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !412, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "newlines2", scope: !89, file: !2, line: 77, type: !86, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "line_num_end", scope: !89, file: !2, line: 74, type: !88, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "line_num_start", scope: !89, file: !2, line: 71, type: !88, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "line_buf", scope: !89, file: !2, line: 59, type: !228, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "line_num_print", scope: !89, file: !2, line: 68, type: !88, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "pending_cr", scope: !89, file: !2, line: 80, type: !145, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !433, isLocal: true, isDefinition: true)
!452 = !{!453, !454, !455, !456, !492, !493, !494, !495, !496, !497, !498, !499, !500, !504, !505, !506, !507, !508, !509, !511, !512, !513, !518, !521, !522, !525, !527, !528}
!453 = !DILocalVariable(name: "argc", arg: 1, scope: !83, file: !2, line: 550, type: !86)
!454 = !DILocalVariable(name: "argv", arg: 2, scope: !83, file: !2, line: 550, type: !87)
!455 = !DILocalVariable(name: "have_read_stdin", scope: !83, file: !2, line: 553, type: !145)
!456 = !DILocalVariable(name: "ostat_buf", scope: !83, file: !2, line: 555, type: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !458, line: 44, size: 1024, elements: !459)
!458 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!459 = !{!460, !462, !464, !466, !468, !470, !472, !473, !474, !475, !477, !478, !480, !488, !489, !490}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !457, file: !458, line: 46, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !315, line: 145, baseType: !147)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !457, file: !458, line: 47, baseType: !463, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !315, line: 148, baseType: !147)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !457, file: !458, line: 48, baseType: !465, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !315, line: 150, baseType: !98)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !457, file: !458, line: 49, baseType: !467, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !315, line: 151, baseType: !98)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !457, file: !458, line: 50, baseType: !469, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !315, line: 146, baseType: !98)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !457, file: !458, line: 51, baseType: !471, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !315, line: 147, baseType: !98)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !457, file: !458, line: 52, baseType: !461, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !457, file: !458, line: 53, baseType: !461, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !457, file: !458, line: 54, baseType: !314, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !457, file: !458, line: 55, baseType: !476, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !315, line: 175, baseType: !86)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !457, file: !458, line: 56, baseType: !86, size: 32, offset: 480)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !457, file: !458, line: 57, baseType: !479, size: 64, offset: 512)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !315, line: 180, baseType: !146)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !457, file: !458, line: 65, baseType: !481, size: 128, offset: 576)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !482, line: 11, size: 128, elements: !483)
!482 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!483 = !{!484, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !481, file: !482, line: 16, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !315, line: 160, baseType: !146)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !481, file: !482, line: 21, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !315, line: 197, baseType: !146)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !457, file: !458, line: 66, baseType: !481, size: 128, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !457, file: !458, line: 67, baseType: !481, size: 128, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !457, file: !458, line: 79, baseType: !491, size: 64, offset: 960)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 64, elements: !236)
!492 = !DILocalVariable(name: "number", scope: !83, file: !2, line: 558, type: !145)
!493 = !DILocalVariable(name: "number_nonblank", scope: !83, file: !2, line: 559, type: !145)
!494 = !DILocalVariable(name: "squeeze_blank", scope: !83, file: !2, line: 560, type: !145)
!495 = !DILocalVariable(name: "show_ends", scope: !83, file: !2, line: 561, type: !145)
!496 = !DILocalVariable(name: "show_nonprinting", scope: !83, file: !2, line: 562, type: !145)
!497 = !DILocalVariable(name: "show_tabs", scope: !83, file: !2, line: 563, type: !145)
!498 = !DILocalVariable(name: "file_open_mode", scope: !83, file: !2, line: 564, type: !86)
!499 = !DILocalVariable(name: "c", scope: !83, file: !2, line: 594, type: !86)
!500 = !DILocalVariable(name: "outsize", scope: !83, file: !2, line: 660, type: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !502, line: 130, baseType: !503)
!502 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !150, line: 35, baseType: !146)
!504 = !DILocalVariable(name: "out_flags", scope: !83, file: !2, line: 663, type: !86)
!505 = !DILocalVariable(name: "out_isreg", scope: !83, file: !2, line: 666, type: !145)
!506 = !DILocalVariable(name: "argind", scope: !83, file: !2, line: 677, type: !86)
!507 = !DILocalVariable(name: "ok", scope: !83, file: !2, line: 678, type: !145)
!508 = !DILocalVariable(name: "page_size", scope: !83, file: !2, line: 679, type: !501)
!509 = !DILocalVariable(name: "reading_stdin", scope: !510, file: !2, line: 686, type: !145)
!510 = distinct !DILexicalBlock(scope: !83, file: !2, line: 682, column: 5)
!511 = !DILocalVariable(name: "istat_buf", scope: !510, file: !2, line: 705, type: !457)
!512 = !DILocalVariable(name: "insize", scope: !510, file: !2, line: 714, type: !501)
!513 = !DILocalVariable(name: "in_pos", scope: !514, file: !2, line: 727, type: !516)
!514 = distinct !DILexicalBlock(scope: !515, file: !2, line: 726, column: 9)
!515 = distinct !DILexicalBlock(scope: !510, file: !2, line: 722, column: 11)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !517, line: 63, baseType: !314)
!517 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!518 = !DILocalVariable(name: "whence", scope: !519, file: !2, line: 732, type: !86)
!519 = distinct !DILexicalBlock(scope: !520, file: !2, line: 729, column: 13)
!520 = distinct !DILexicalBlock(scope: !514, file: !2, line: 728, column: 15)
!521 = !DILocalVariable(name: "inbuf", scope: !510, file: !2, line: 745, type: !88)
!522 = !DILocalVariable(name: "copy_cat_status", scope: !523, file: !2, line: 754, type: !86)
!523 = distinct !DILexicalBlock(scope: !524, file: !2, line: 753, column: 9)
!524 = distinct !DILexicalBlock(scope: !510, file: !2, line: 751, column: 11)
!525 = !DILocalVariable(name: "bufsize", scope: !526, file: !2, line: 794, type: !501)
!526 = distinct !DILexicalBlock(scope: !524, file: !2, line: 769, column: 9)
!527 = !DILocalVariable(name: "outbuf", scope: !526, file: !2, line: 799, type: !88)
!528 = !DILabel(scope: !510, name: "contin", file: !2, line: 810)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 2560, elements: !178)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !532, line: 50, size: 256, elements: !533)
!532 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!533 = !{!534, !535, !536, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !532, line: 52, baseType: !151, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !531, file: !532, line: 55, baseType: !86, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !531, file: !532, line: 56, baseType: !537, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !531, file: !532, line: 57, baseType: !86, size: 32, offset: 192)
!539 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !542, line: 3, type: !392, isLocal: true, isDefinition: true)
!542 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "Version", scope: !545, file: !542, line: 3, type: !151, isLocal: false, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C11, file: !542, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !546, splitDebugInlining: false, nameTableKind: None)
!546 = !{!540, !543}
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "file_name", scope: !549, file: !550, line: 45, type: !151, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C11, file: !550, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!551 = !{!552, !554, !556, !558, !547, !560}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !550, line: 121, type: !162, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !550, line: 121, type: !433, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !550, line: 123, type: !162, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !550, line: 126, type: !240, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !549, file: !550, line: 55, type: !145, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !564, file: !565, line: 66, type: !615, isLocal: false, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !566, globals: !567, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!566 = !{!144, !153}
!567 = !{!568, !570, !594, !596, !598, !600, !562, !602, !604, !606, !608, !613}
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !565, line: 272, type: !189, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "old_file_name", scope: !572, file: !565, line: 304, type: !151, isLocal: true, isDefinition: true)
!572 = distinct !DISubprogram(name: "verror_at_line", scope: !565, file: !565, line: 298, type: !573, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !587)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !86, !86, !151, !98, !151, !575}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !517, line: 52, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !577, line: 14, baseType: !578)
!577 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !579, baseType: !580)
!579 = !DIFile(filename: "lib/error.c", directory: "/src")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !581)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !580, file: !579, baseType: !144, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !580, file: !579, baseType: !144, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !580, file: !579, baseType: !144, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !580, file: !579, baseType: !86, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !580, file: !579, baseType: !86, size: 32, offset: 224)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DILocalVariable(name: "status", arg: 1, scope: !572, file: !565, line: 298, type: !86)
!589 = !DILocalVariable(name: "errnum", arg: 2, scope: !572, file: !565, line: 298, type: !86)
!590 = !DILocalVariable(name: "file_name", arg: 3, scope: !572, file: !565, line: 298, type: !151)
!591 = !DILocalVariable(name: "line_number", arg: 4, scope: !572, file: !565, line: 298, type: !98)
!592 = !DILocalVariable(name: "message", arg: 5, scope: !572, file: !565, line: 298, type: !151)
!593 = !DILocalVariable(name: "args", arg: 6, scope: !572, file: !565, line: 298, type: !575)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "old_line_number", scope: !572, file: !565, line: 305, type: !98, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !565, line: 338, type: !19, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !565, line: 346, type: !194, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !565, line: 346, type: !235, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "error_message_count", scope: !564, file: !565, line: 69, type: !98, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !564, file: !565, line: 295, type: !86, isLocal: false, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !565, line: 208, type: !162, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !565, line: 208, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 21)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !565, line: 214, type: !189, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !620, file: !621, line: 506, type: !86, isLocal: true, isDefinition: true)
!620 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !621, file: !621, line: 485, type: !622, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !624, retainedNodes: !626)
!621 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!622 = !DISubroutineType(types: !623)
!623 = !{!86, !86, !86}
!624 = distinct !DICompileUnit(language: DW_LANG_C11, file: !621, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !625, splitDebugInlining: false, nameTableKind: None)
!625 = !{!618}
!626 = !{!627, !628, !629, !630, !633}
!627 = !DILocalVariable(name: "fd", arg: 1, scope: !620, file: !621, line: 485, type: !86)
!628 = !DILocalVariable(name: "target", arg: 2, scope: !620, file: !621, line: 485, type: !86)
!629 = !DILocalVariable(name: "result", scope: !620, file: !621, line: 487, type: !86)
!630 = !DILocalVariable(name: "flags", scope: !631, file: !621, line: 530, type: !86)
!631 = distinct !DILexicalBlock(scope: !632, file: !621, line: 529, column: 5)
!632 = distinct !DILexicalBlock(scope: !620, file: !621, line: 528, column: 7)
!633 = !DILocalVariable(name: "saved_errno", scope: !634, file: !621, line: 533, type: !86)
!634 = distinct !DILexicalBlock(scope: !635, file: !621, line: 532, column: 9)
!635 = distinct !DILexicalBlock(scope: !631, file: !621, line: 531, column: 11)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "program_name", scope: !638, file: !639, line: 31, type: !151, isLocal: false, isDefinition: true)
!638 = distinct !DICompileUnit(language: DW_LANG_C11, file: !639, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !640, globals: !641, splitDebugInlining: false, nameTableKind: None)
!639 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!640 = !{!88}
!641 = !{!636, !642, !644}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !639, line: 46, type: !194, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !639, line: 49, type: !19, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "utf07FF", scope: !648, file: !649, line: 46, type: !676, isLocal: true, isDefinition: true)
!648 = distinct !DISubprogram(name: "proper_name_lite", scope: !649, file: !649, line: 38, type: !650, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !652, retainedNodes: !654)
!649 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!650 = !DISubroutineType(types: !651)
!651 = !{!151, !151, !151}
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !653, splitDebugInlining: false, nameTableKind: None)
!653 = !{!646}
!654 = !{!655, !656, !657, !658, !663}
!655 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !648, file: !649, line: 38, type: !151)
!656 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !648, file: !649, line: 38, type: !151)
!657 = !DILocalVariable(name: "translation", scope: !648, file: !649, line: 40, type: !151)
!658 = !DILocalVariable(name: "w", scope: !648, file: !649, line: 47, type: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !660, line: 37, baseType: !661)
!660 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !315, line: 57, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !315, line: 42, baseType: !98)
!663 = !DILocalVariable(name: "mbs", scope: !648, file: !649, line: 48, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !666)
!665 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !668)
!667 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !668, file: !667, line: 15, baseType: !86, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !668, file: !667, line: 20, baseType: !672, size: 32, offset: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !667, line: 16, size: 32, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !672, file: !667, line: 18, baseType: !98, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !672, file: !667, line: 19, baseType: !19, size: 32)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !236)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !679, line: 78, type: !194, isLocal: true, isDefinition: true)
!679 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !679, line: 79, type: !350, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !679, line: 80, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 13)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !679, line: 81, type: !684, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !679, line: 82, type: !228, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !679, line: 83, type: !235, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !679, line: 84, type: !194, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !679, line: 85, type: !162, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !679, line: 86, type: !162, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !679, line: 87, type: !194, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !703, file: !679, line: 76, type: !775, isLocal: false, isDefinition: true)
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !710, globals: !711, splitDebugInlining: false, nameTableKind: None)
!704 = !{!96, !705, !120}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !97, line: 254, baseType: !98, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!708 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!709 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!710 = !{!86, !148, !149}
!711 = !{!677, !680, !682, !687, !689, !691, !693, !695, !697, !699, !701, !712, !716, !726, !728, !733, !735, !737, !739, !741, !764, !771, !773}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !703, file: !679, line: 92, type: !714, isLocal: false, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 320, elements: !178)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !703, file: !679, line: 1040, type: !718, isLocal: false, isDefinition: true)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !679, line: 56, size: 448, elements: !719)
!719 = !{!720, !721, !722, !724, !725}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !718, file: !679, line: 59, baseType: !96, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !679, line: 62, baseType: !86, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !718, file: !679, line: 66, baseType: !723, size: 256, offset: 64)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !195)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !718, file: !679, line: 69, baseType: !151, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !718, file: !679, line: 72, baseType: !151, size: 64, offset: 384)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !703, file: !679, line: 107, type: !718, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "slot0", scope: !703, file: !679, line: 831, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 256)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !679, line: 321, type: !235, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !679, line: 357, type: !235, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !679, line: 358, type: !235, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !679, line: 199, type: !162, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "quote", scope: !743, file: !679, line: 228, type: !762, isLocal: true, isDefinition: true)
!743 = distinct !DISubprogram(name: "gettext_quote", scope: !679, file: !679, line: 197, type: !744, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !703, retainedNodes: !746)
!744 = !DISubroutineType(types: !745)
!745 = !{!151, !151, !96}
!746 = !{!747, !748, !749, !750, !751}
!747 = !DILocalVariable(name: "msgid", arg: 1, scope: !743, file: !679, line: 197, type: !151)
!748 = !DILocalVariable(name: "s", arg: 2, scope: !743, file: !679, line: 197, type: !96)
!749 = !DILocalVariable(name: "translation", scope: !743, file: !679, line: 199, type: !151)
!750 = !DILocalVariable(name: "w", scope: !743, file: !679, line: 229, type: !659)
!751 = !DILocalVariable(name: "mbs", scope: !743, file: !679, line: 230, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !754, file: !667, line: 15, baseType: !86, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !754, file: !667, line: 20, baseType: !758, size: 32, offset: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !754, file: !667, line: 16, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !758, file: !667, line: 18, baseType: !98, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !758, file: !667, line: 19, baseType: !19, size: 32)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !763)
!763 = !{!237, !21}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "slotvec", scope: !703, file: !679, line: 834, type: !766, isLocal: true, isDefinition: true)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !679, line: 823, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !767, file: !679, line: 825, baseType: !149, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !767, file: !679, line: 826, baseType: !88, size: 64, offset: 64)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "nslots", scope: !703, file: !679, line: 832, type: !86, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "slotvec0", scope: !703, file: !679, line: 833, type: !767, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 704, elements: !212)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !779, line: 67, type: !433, isLocal: true, isDefinition: true)
!779 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !779, line: 69, type: !162, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !779, line: 83, type: !162, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !779, line: 83, type: !19, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !779, line: 85, type: !235, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !779, line: 88, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 171)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !779, line: 88, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 34)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !779, line: 105, type: !157, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !779, line: 109, type: !252, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !779, line: 113, type: !804, isLocal: true, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 28)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !779, line: 120, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 32)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !779, line: 127, type: !814, isLocal: true, isDefinition: true)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 36)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !779, line: 134, type: !387, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !779, line: 142, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 44)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !779, line: 150, type: !826, isLocal: true, isDefinition: true)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 48)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !779, line: 159, type: !44, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !779, line: 170, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 60)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !779, line: 248, type: !228, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !779, line: 248, type: !412, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !779, line: 254, type: !228, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !779, line: 254, type: !167, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !779, line: 254, type: !387, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !779, line: 259, type: !3, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !779, line: 259, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 29)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !855, file: !856, line: 26, type: !858, isLocal: false, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !856, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!857 = !{!853}
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !25)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "exit_failure", scope: !861, file: !862, line: 24, type: !864, isLocal: false, isDefinition: true)
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !863, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!863 = !{!859}
!864 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !86)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !867, line: 34, type: !240, isLocal: true, isDefinition: true)
!867 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !867, line: 34, type: !162, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !867, line: 34, type: !172, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !874, line: 108, type: !199, isLocal: true, isDefinition: true)
!874 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "internal_state", scope: !877, file: !874, line: 97, type: !880, isLocal: true, isDefinition: true)
!877 = distinct !DICompileUnit(language: DW_LANG_C11, file: !874, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !878, globals: !879, splitDebugInlining: false, nameTableKind: None)
!878 = !{!144, !149, !153}
!879 = !{!872, !875}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !665, line: 6, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !667, line: 21, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 13, size: 64, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !882, file: !667, line: 15, baseType: !86, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !882, file: !667, line: 20, baseType: !886, size: 32, offset: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !882, file: !667, line: 16, size: 32, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !886, file: !667, line: 18, baseType: !98, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !886, file: !667, line: 19, baseType: !19, size: 32)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !892, line: 35, type: !235, isLocal: true, isDefinition: true)
!892 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !892, line: 35, type: !350, isLocal: true, isDefinition: true)
!895 = distinct !DICompileUnit(language: DW_LANG_C11, file: !896, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !897, splitDebugInlining: false, nameTableKind: None)
!896 = !DIFile(filename: "lib/copy-file-range.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6733a97916f50c6b003a01ea6f4c9f0a")
!897 = !{!139}
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !899, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !900, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!900 = !{!111}
!901 = distinct !DICompileUnit(language: DW_LANG_C11, file: !902, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!902 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!903 = distinct !DICompileUnit(language: DW_LANG_C11, file: !904, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !905, splitDebugInlining: false, nameTableKind: None)
!904 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!905 = !{!151}
!906 = distinct !DICompileUnit(language: DW_LANG_C11, file: !907, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!908 = distinct !DICompileUnit(language: DW_LANG_C11, file: !909, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !897, retainedTypes: !910, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!910 = !{!149}
!911 = distinct !DICompileUnit(language: DW_LANG_C11, file: !779, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, retainedTypes: !916, globals: !917, splitDebugInlining: false, nameTableKind: None)
!912 = !{!913}
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !779, line: 40, baseType: !98, size: 32, elements: !914)
!914 = !{!915}
!915 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!916 = !{!144}
!917 = !{!777, !780, !782, !784, !786, !788, !793, !798, !800, !802, !807, !812, !817, !819, !824, !829, !831, !836, !838, !840, !842, !844, !846, !848}
!918 = distinct !DICompileUnit(language: DW_LANG_C11, file: !919, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !910, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/xalignalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3b950fafb945919ba44141bc7f11141c")
!920 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !922, retainedTypes: !950, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!922 = !{!923, !935}
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !924, file: !921, line: 188, baseType: !98, size: 32, elements: !933)
!924 = distinct !DISubprogram(name: "x2nrealloc", scope: !921, file: !921, line: 176, type: !925, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !920, retainedNodes: !928)
!925 = !DISubroutineType(types: !926)
!926 = !{!144, !144, !927, !149}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!928 = !{!929, !930, !931, !932}
!929 = !DILocalVariable(name: "p", arg: 1, scope: !924, file: !921, line: 176, type: !144)
!930 = !DILocalVariable(name: "pn", arg: 2, scope: !924, file: !921, line: 176, type: !927)
!931 = !DILocalVariable(name: "s", arg: 3, scope: !924, file: !921, line: 176, type: !149)
!932 = !DILocalVariable(name: "n", scope: !924, file: !921, line: 178, type: !149)
!933 = !{!934}
!934 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !936, file: !921, line: 228, baseType: !98, size: 32, elements: !933)
!936 = distinct !DISubprogram(name: "xpalloc", scope: !921, file: !921, line: 223, type: !937, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !920, retainedNodes: !940)
!937 = !DISubroutineType(types: !938)
!938 = !{!144, !144, !939, !501, !503, !501}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949}
!941 = !DILocalVariable(name: "pa", arg: 1, scope: !936, file: !921, line: 223, type: !144)
!942 = !DILocalVariable(name: "pn", arg: 2, scope: !936, file: !921, line: 223, type: !939)
!943 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !936, file: !921, line: 223, type: !501)
!944 = !DILocalVariable(name: "n_max", arg: 4, scope: !936, file: !921, line: 223, type: !503)
!945 = !DILocalVariable(name: "s", arg: 5, scope: !936, file: !921, line: 223, type: !501)
!946 = !DILocalVariable(name: "n0", scope: !936, file: !921, line: 230, type: !501)
!947 = !DILocalVariable(name: "n", scope: !936, file: !921, line: 237, type: !501)
!948 = !DILocalVariable(name: "nbytes", scope: !936, file: !921, line: 248, type: !501)
!949 = !DILocalVariable(name: "adjusted_nbytes", scope: !936, file: !921, line: 252, type: !501)
!950 = !{!88, !144, !145, !146, !147}
!951 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !952, splitDebugInlining: false, nameTableKind: None)
!952 = !{!865, !868, !870}
!953 = distinct !DICompileUnit(language: DW_LANG_C11, file: !954, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!954 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!955 = distinct !DICompileUnit(language: DW_LANG_C11, file: !956, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!957 = distinct !DICompileUnit(language: DW_LANG_C11, file: !958, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!958 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!959 = distinct !DICompileUnit(language: DW_LANG_C11, file: !960, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!960 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!961 = distinct !DICompileUnit(language: DW_LANG_C11, file: !962, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !963, splitDebugInlining: false, nameTableKind: None)
!962 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!963 = !{!145, !147, !144}
!964 = distinct !DICompileUnit(language: DW_LANG_C11, file: !892, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !965, splitDebugInlining: false, nameTableKind: None)
!965 = !{!890, !893}
!966 = distinct !DICompileUnit(language: DW_LANG_C11, file: !967, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!968 = distinct !DICompileUnit(language: DW_LANG_C11, file: !969, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !916, splitDebugInlining: false, nameTableKind: None)
!969 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!970 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!971 = !{i32 7, !"Dwarf Version", i32 5}
!972 = !{i32 2, !"Debug Info Version", i32 3}
!973 = !{i32 1, !"wchar_size", i32 4}
!974 = !{i32 8, !"PIC Level", i32 2}
!975 = !{i32 7, !"PIE Level", i32 2}
!976 = !{i32 7, !"uwtable", i32 2}
!977 = !{i32 7, !"frame-pointer", i32 1}
!978 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 83, type: !979, scopeLine: 84, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !981)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !86}
!981 = !{!982}
!982 = !DILocalVariable(name: "status", arg: 1, scope: !978, file: !2, line: 83, type: !86)
!983 = !DILocation(line: 0, scope: !978)
!984 = !DILocation(line: 85, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !978, file: !2, line: 85, column: 7)
!986 = !DILocation(line: 85, column: 7, scope: !978)
!987 = !DILocation(line: 86, column: 5, scope: !988)
!988 = distinct !DILexicalBlock(scope: !985, file: !2, line: 86, column: 5)
!989 = !{!990, !990, i64 0}
!990 = !{!"any pointer", !991, i64 0}
!991 = !{!"omnipotent char", !992, i64 0}
!992 = !{!"Simple C/C++ TBAA"}
!993 = !DILocation(line: 89, column: 7, scope: !994)
!994 = distinct !DILexicalBlock(scope: !985, file: !2, line: 88, column: 5)
!995 = !DILocation(line: 93, column: 7, scope: !994)
!996 = !DILocation(line: 729, column: 3, scope: !997, inlinedAt: !999)
!997 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !616, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !998)
!998 = !{}
!999 = distinct !DILocation(line: 97, column: 7, scope: !994)
!1000 = !DILocation(line: 99, column: 7, scope: !994)
!1001 = !DILocation(line: 102, column: 7, scope: !994)
!1002 = !DILocation(line: 105, column: 7, scope: !994)
!1003 = !DILocation(line: 108, column: 7, scope: !994)
!1004 = !DILocation(line: 111, column: 7, scope: !994)
!1005 = !DILocation(line: 114, column: 7, scope: !994)
!1006 = !DILocation(line: 117, column: 7, scope: !994)
!1007 = !DILocation(line: 120, column: 7, scope: !994)
!1008 = !DILocation(line: 123, column: 7, scope: !994)
!1009 = !DILocation(line: 126, column: 7, scope: !994)
!1010 = !DILocation(line: 129, column: 7, scope: !994)
!1011 = !DILocation(line: 130, column: 7, scope: !994)
!1012 = !DILocation(line: 131, column: 7, scope: !994)
!1013 = !DILocalVariable(name: "program", arg: 1, scope: !1014, file: !92, line: 836, type: !151)
!1014 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !1015, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !151}
!1017 = !{!1013, !1018, !1025, !1026, !1028, !1029}
!1018 = !DILocalVariable(name: "infomap", scope: !1014, file: !92, line: 838, type: !1019)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 896, elements: !163)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1014, file: !92, line: 838, size: 128, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1021, file: !92, line: 838, baseType: !151, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1021, file: !92, line: 838, baseType: !151, size: 64, offset: 64)
!1025 = !DILocalVariable(name: "node", scope: !1014, file: !92, line: 848, type: !151)
!1026 = !DILocalVariable(name: "map_prog", scope: !1014, file: !92, line: 849, type: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1028 = !DILocalVariable(name: "lc_messages", scope: !1014, file: !92, line: 861, type: !151)
!1029 = !DILocalVariable(name: "url_program", scope: !1014, file: !92, line: 874, type: !151)
!1030 = !DILocation(line: 0, scope: !1014, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 138, column: 7, scope: !994)
!1032 = !DILocation(line: 857, column: 3, scope: !1014, inlinedAt: !1031)
!1033 = !DILocation(line: 861, column: 29, scope: !1014, inlinedAt: !1031)
!1034 = !DILocation(line: 862, column: 7, scope: !1035, inlinedAt: !1031)
!1035 = distinct !DILexicalBlock(scope: !1014, file: !92, line: 862, column: 7)
!1036 = !DILocation(line: 862, column: 19, scope: !1035, inlinedAt: !1031)
!1037 = !DILocation(line: 862, column: 22, scope: !1035, inlinedAt: !1031)
!1038 = !DILocation(line: 862, column: 7, scope: !1014, inlinedAt: !1031)
!1039 = !DILocation(line: 868, column: 7, scope: !1040, inlinedAt: !1031)
!1040 = distinct !DILexicalBlock(scope: !1035, file: !92, line: 863, column: 5)
!1041 = !DILocation(line: 870, column: 5, scope: !1040, inlinedAt: !1031)
!1042 = !DILocation(line: 875, column: 3, scope: !1014, inlinedAt: !1031)
!1043 = !DILocation(line: 877, column: 3, scope: !1014, inlinedAt: !1031)
!1044 = !DILocation(line: 140, column: 3, scope: !978)
!1045 = !DISubprogram(name: "dcgettext", scope: !1046, file: !1046, line: 51, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1046 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!88, !151, !151, !86}
!1049 = !DISubprogram(name: "__fprintf_chk", scope: !1050, file: !1050, line: 93, type: !1051, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1050 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!86, !1053, !86, !1054, null}
!1053 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !288)
!1054 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!1055 = !DISubprogram(name: "__printf_chk", scope: !1050, file: !1050, line: 95, type: !1056, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!86, !86, !1054, null}
!1058 = !DISubprogram(name: "fputs_unlocked", scope: !517, file: !517, line: 691, type: !1059, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!86, !1054, !1053}
!1061 = !DILocation(line: 0, scope: !266)
!1062 = !DILocation(line: 581, column: 7, scope: !274)
!1063 = !{!1064, !1064, i64 0}
!1064 = !{!"int", !991, i64 0}
!1065 = !DILocation(line: 581, column: 19, scope: !274)
!1066 = !DILocation(line: 581, column: 7, scope: !266)
!1067 = !DILocation(line: 585, column: 26, scope: !273)
!1068 = !DILocation(line: 0, scope: !273)
!1069 = !DILocation(line: 586, column: 23, scope: !273)
!1070 = !DILocation(line: 586, column: 28, scope: !273)
!1071 = !DILocation(line: 586, column: 32, scope: !273)
!1072 = !{!991, !991, i64 0}
!1073 = !DILocation(line: 586, column: 38, scope: !273)
!1074 = !DILocalVariable(name: "__s1", arg: 1, scope: !1075, file: !1076, line: 1359, type: !151)
!1075 = distinct !DISubprogram(name: "streq", scope: !1076, file: !1076, line: 1359, type: !1077, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1079)
!1076 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!145, !151, !151}
!1079 = !{!1074, !1080}
!1080 = !DILocalVariable(name: "__s2", arg: 2, scope: !1075, file: !1076, line: 1359, type: !151)
!1081 = !DILocation(line: 0, scope: !1075, inlinedAt: !1082)
!1082 = distinct !DILocation(line: 586, column: 41, scope: !273)
!1083 = !DILocation(line: 1361, column: 11, scope: !1075, inlinedAt: !1082)
!1084 = !DILocation(line: 1361, column: 10, scope: !1075, inlinedAt: !1082)
!1085 = !DILocation(line: 586, column: 19, scope: !273)
!1086 = !DILocation(line: 587, column: 5, scope: !273)
!1087 = !DILocation(line: 588, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !266, file: !92, line: 588, column: 7)
!1089 = !DILocation(line: 588, column: 7, scope: !266)
!1090 = !DILocation(line: 590, column: 7, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !92, line: 589, column: 5)
!1092 = !DILocation(line: 591, column: 7, scope: !1091)
!1093 = !DILocation(line: 595, column: 37, scope: !266)
!1094 = !DILocation(line: 595, column: 35, scope: !266)
!1095 = !DILocation(line: 596, column: 29, scope: !266)
!1096 = !DILocation(line: 597, column: 8, scope: !281)
!1097 = !DILocation(line: 597, column: 7, scope: !266)
!1098 = !DILocation(line: 604, column: 24, scope: !280)
!1099 = !DILocation(line: 604, column: 12, scope: !281)
!1100 = !DILocation(line: 0, scope: !279)
!1101 = !DILocation(line: 610, column: 16, scope: !279)
!1102 = !DILocation(line: 610, column: 7, scope: !279)
!1103 = !DILocation(line: 611, column: 21, scope: !279)
!1104 = !{!1105, !1105, i64 0}
!1105 = !{!"short", !991, i64 0}
!1106 = !DILocation(line: 611, column: 19, scope: !279)
!1107 = !DILocation(line: 611, column: 16, scope: !279)
!1108 = !DILocation(line: 610, column: 30, scope: !279)
!1109 = distinct !{!1109, !1102, !1103, !1110}
!1110 = !{!"llvm.loop.mustprogress"}
!1111 = !DILocation(line: 612, column: 18, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !279, file: !92, line: 612, column: 11)
!1113 = !DILocation(line: 612, column: 11, scope: !279)
!1114 = !DILocation(line: 620, column: 23, scope: !266)
!1115 = !DILocation(line: 625, column: 39, scope: !266)
!1116 = !DILocation(line: 626, column: 3, scope: !266)
!1117 = !DILocation(line: 626, column: 10, scope: !266)
!1118 = !DILocation(line: 626, column: 21, scope: !266)
!1119 = !DILocation(line: 628, column: 44, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1121, file: !92, line: 628, column: 11)
!1121 = distinct !DILexicalBlock(scope: !266, file: !92, line: 627, column: 5)
!1122 = !DILocation(line: 628, column: 32, scope: !1120)
!1123 = !DILocation(line: 628, column: 49, scope: !1120)
!1124 = !DILocation(line: 628, column: 11, scope: !1121)
!1125 = !DILocation(line: 630, column: 11, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !92, line: 630, column: 11)
!1127 = !DILocation(line: 630, column: 11, scope: !1121)
!1128 = !DILocation(line: 632, column: 26, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1130, file: !92, line: 632, column: 15)
!1130 = distinct !DILexicalBlock(scope: !1126, file: !92, line: 631, column: 9)
!1131 = !DILocation(line: 632, column: 34, scope: !1129)
!1132 = !DILocation(line: 632, column: 37, scope: !1129)
!1133 = !DILocation(line: 632, column: 15, scope: !1130)
!1134 = !DILocation(line: 640, column: 16, scope: !1121)
!1135 = distinct !{!1135, !1116, !1136, !1110}
!1136 = !DILocation(line: 641, column: 5, scope: !266)
!1137 = !DILocation(line: 644, column: 3, scope: !266)
!1138 = !DILocation(line: 0, scope: !1075, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 648, column: 31, scope: !266)
!1140 = !DILocation(line: 0, scope: !1075, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 649, column: 31, scope: !266)
!1142 = !DILocation(line: 0, scope: !1075, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 650, column: 31, scope: !266)
!1144 = !DILocation(line: 0, scope: !1075, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 651, column: 31, scope: !266)
!1146 = !DILocation(line: 0, scope: !1075, inlinedAt: !1147)
!1147 = distinct !DILocation(line: 652, column: 31, scope: !266)
!1148 = !DILocation(line: 0, scope: !1075, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 653, column: 31, scope: !266)
!1150 = !DILocation(line: 0, scope: !1075, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 654, column: 31, scope: !266)
!1152 = !DILocation(line: 0, scope: !1075, inlinedAt: !1153)
!1153 = distinct !DILocation(line: 655, column: 31, scope: !266)
!1154 = !DILocation(line: 0, scope: !1075, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 656, column: 31, scope: !266)
!1156 = !DILocation(line: 0, scope: !1075, inlinedAt: !1157)
!1157 = distinct !DILocation(line: 657, column: 31, scope: !266)
!1158 = !DILocation(line: 663, column: 7, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !266, file: !92, line: 663, column: 7)
!1160 = !DILocation(line: 664, column: 7, scope: !1159)
!1161 = !DILocation(line: 664, column: 10, scope: !1159)
!1162 = !DILocation(line: 663, column: 7, scope: !266)
!1163 = !DILocation(line: 669, column: 7, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1159, file: !92, line: 665, column: 5)
!1165 = !DILocation(line: 671, column: 5, scope: !1164)
!1166 = !DILocation(line: 676, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1159, file: !92, line: 673, column: 5)
!1168 = !DILocation(line: 679, column: 3, scope: !266)
!1169 = !DILocation(line: 683, column: 3, scope: !266)
!1170 = !DILocation(line: 686, column: 3, scope: !266)
!1171 = !DILocation(line: 688, column: 3, scope: !266)
!1172 = !DILocation(line: 691, column: 3, scope: !266)
!1173 = !DILocation(line: 695, column: 3, scope: !266)
!1174 = !DILocation(line: 696, column: 1, scope: !266)
!1175 = !DISubprogram(name: "setlocale", scope: !1176, file: !1176, line: 122, type: !1177, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1176 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!88, !86, !151}
!1179 = !DISubprogram(name: "strncmp", scope: !1180, file: !1180, line: 159, type: !1181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1180 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!86, !151, !151, !149}
!1183 = !DISubprogram(name: "exit", scope: !1184, file: !1184, line: 624, type: !979, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1184 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1185 = !DISubprogram(name: "getenv", scope: !1184, file: !1184, line: 641, type: !1186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!88, !151}
!1188 = !DISubprogram(name: "strcmp", scope: !1180, file: !1180, line: 156, type: !1189, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!86, !151, !151}
!1191 = !DISubprogram(name: "strspn", scope: !1180, file: !1180, line: 297, type: !1192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!147, !151, !151}
!1194 = !DISubprogram(name: "strchr", scope: !1180, file: !1180, line: 246, type: !1195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!88, !151, !86}
!1197 = !DISubprogram(name: "__ctype_b_loc", scope: !121, file: !121, line: 79, type: !1198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!1203 = !DISubprogram(name: "strcspn", scope: !1180, file: !1180, line: 293, type: !1192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1204 = !DISubprogram(name: "fwrite_unlocked", scope: !517, file: !517, line: 704, type: !1205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !998)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!149, !1207, !149, !149, !1053}
!1207 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1210 = !DILocation(line: 0, scope: !83)
!1211 = !DILocation(line: 555, column: 3, scope: !83)
!1212 = !DILocation(line: 555, column: 15, scope: !83)
!1213 = !DILocation(line: 581, column: 21, scope: !83)
!1214 = !DILocation(line: 581, column: 3, scope: !83)
!1215 = !DILocation(line: 582, column: 3, scope: !83)
!1216 = !DILocation(line: 583, column: 3, scope: !83)
!1217 = !DILocation(line: 584, column: 3, scope: !83)
!1218 = !DILocation(line: 590, column: 3, scope: !83)
!1219 = !DILocation(line: 595, column: 3, scope: !83)
!1220 = !DILocation(line: 595, column: 15, scope: !83)
!1221 = distinct !{!1221, !1219, !1222, !1110}
!1222 = !DILocation(line: 652, column: 5, scope: !83)
!1223 = !DILocation(line: 603, column: 11, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !2, line: 599, column: 9)
!1225 = distinct !DILexicalBlock(scope: !83, file: !2, line: 597, column: 5)
!1226 = !DILocation(line: 608, column: 11, scope: !1224)
!1227 = !DILocation(line: 612, column: 11, scope: !1224)
!1228 = !DILocation(line: 616, column: 11, scope: !1224)
!1229 = !DILocation(line: 621, column: 11, scope: !1224)
!1230 = !DILocation(line: 629, column: 11, scope: !1224)
!1231 = !DILocation(line: 635, column: 11, scope: !1224)
!1232 = !DILocation(line: 639, column: 11, scope: !1224)
!1233 = !DILocation(line: 643, column: 11, scope: !1224)
!1234 = !DILocation(line: 645, column: 9, scope: !1224)
!1235 = !DILocation(line: 647, column: 9, scope: !1224)
!1236 = !DILocation(line: 650, column: 11, scope: !1224)
!1237 = !DILocation(line: 656, column: 7, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !83, file: !2, line: 656, column: 7)
!1239 = !DILocation(line: 656, column: 41, scope: !1238)
!1240 = !DILocation(line: 656, column: 7, scope: !83)
!1241 = !DILocation(line: 657, column: 5, scope: !1238)
!1242 = !DILocalVariable(name: "st", arg: 1, scope: !1243, file: !136, line: 81, type: !1246)
!1243 = distinct !DISubprogram(name: "io_blksize", scope: !136, file: !136, line: 81, type: !1244, scopeLine: 82, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1248)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!501, !1246}
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!1248 = !{!1242, !1249, !1250, !1253}
!1249 = !DILocalVariable(name: "blocksize", scope: !1243, file: !136, line: 84, type: !501)
!1250 = !DILocalVariable(name: "leading_zeros", scope: !1251, file: !136, line: 98, type: !86)
!1251 = distinct !DILexicalBlock(scope: !1252, file: !136, line: 97, column: 5)
!1252 = distinct !DILexicalBlock(scope: !1243, file: !136, line: 96, column: 7)
!1253 = !DILocalVariable(name: "power", scope: !1254, file: !136, line: 101, type: !1256)
!1254 = distinct !DILexicalBlock(scope: !1255, file: !136, line: 100, column: 9)
!1255 = distinct !DILexicalBlock(scope: !1251, file: !136, line: 99, column: 11)
!1256 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1257 = !DILocation(line: 0, scope: !1243, inlinedAt: !1258)
!1258 = distinct !DILocation(line: 660, column: 19, scope: !83)
!1259 = !DILocation(line: 84, column: 21, scope: !1243, inlinedAt: !1258)
!1260 = !{!1261, !1064, i64 56}
!1261 = !{!"stat", !1262, i64 0, !1262, i64 8, !1064, i64 16, !1064, i64 20, !1064, i64 24, !1064, i64 28, !1262, i64 32, !1262, i64 40, !1262, i64 48, !1064, i64 56, !1064, i64 60, !1262, i64 64, !1263, i64 72, !1263, i64 88, !1263, i64 104, !991, i64 120}
!1262 = !{!"long", !991, i64 0}
!1263 = !{!"timespec", !1262, i64 0, !1262, i64 8}
!1264 = !DILocation(line: 84, column: 58, scope: !1243, inlinedAt: !1258)
!1265 = !DILocation(line: 88, column: 52, scope: !1243, inlinedAt: !1258)
!1266 = !DILocation(line: 88, column: 33, scope: !1243, inlinedAt: !1258)
!1267 = !DILocation(line: 88, column: 13, scope: !1243, inlinedAt: !1258)
!1268 = !DILocation(line: 96, column: 7, scope: !1252, inlinedAt: !1258)
!1269 = !{!1261, !1064, i64 16}
!1270 = !{i64 0, i64 34}
!1271 = !DILocation(line: 96, column: 29, scope: !1252, inlinedAt: !1258)
!1272 = !DILocalVariable(name: "n", arg: 1, scope: !1273, file: !1274, line: 436, type: !1256)
!1273 = distinct !DISubprogram(name: "stdc_leading_zeros_ull", scope: !1274, file: !1274, line: 436, type: !1275, scopeLine: 437, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1277)
!1274 = !DIFile(filename: "./lib/stdbit.h", directory: "/src", checksumkind: CSK_MD5, checksum: "22a94c18744c4eadd69210db6ede4b9c")
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!98, !1256}
!1277 = !{!1272}
!1278 = !DILocation(line: 0, scope: !1273, inlinedAt: !1279)
!1279 = distinct !DILocation(line: 98, column: 27, scope: !1251, inlinedAt: !1258)
!1280 = !DILocalVariable(name: "n", arg: 1, scope: !1281, file: !1274, line: 149, type: !1256)
!1281 = distinct !DISubprogram(name: "_gl_stdbit_clzll", scope: !1274, file: !1274, line: 149, type: !1282, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1284)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!86, !1256}
!1284 = !{!1280}
!1285 = !DILocation(line: 0, scope: !1281, inlinedAt: !1286)
!1286 = distinct !DILocation(line: 438, column: 10, scope: !1273, inlinedAt: !1279)
!1287 = !DILocation(line: 151, column: 10, scope: !1281, inlinedAt: !1286)
!1288 = !{i64 0, i64 65}
!1289 = !DILocation(line: 0, scope: !1251, inlinedAt: !1258)
!1290 = !DILocation(line: 0, scope: !1254, inlinedAt: !1258)
!1291 = !DILocation(line: 102, column: 21, scope: !1292, inlinedAt: !1258)
!1292 = distinct !DILexicalBlock(scope: !1254, file: !136, line: 102, column: 15)
!1293 = !DILocation(line: 102, column: 15, scope: !1254, inlinedAt: !1258)
!1294 = !DILocation(line: 105, column: 5, scope: !1251, inlinedAt: !1258)
!1295 = !DILocation(line: 110, column: 10, scope: !1243, inlinedAt: !1258)
!1296 = !DILocation(line: 666, column: 20, scope: !83)
!1297 = !DILocation(line: 668, column: 17, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !83, file: !2, line: 668, column: 7)
!1299 = !DILocation(line: 676, column: 10, scope: !83)
!1300 = !DILocation(line: 677, column: 16, scope: !83)
!1301 = !DILocation(line: 679, column: 21, scope: !83)
!1302 = !DILocation(line: 681, column: 3, scope: !83)
!1303 = !DILocation(line: 663, column: 7, scope: !83)
!1304 = !DILocation(line: 683, column: 18, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !510, file: !2, line: 683, column: 11)
!1306 = !DILocation(line: 683, column: 11, scope: !510)
!1307 = !DILocation(line: 686, column: 35, scope: !510)
!1308 = !DILocation(line: 684, column: 18, scope: !1305)
!1309 = !DILocation(line: 684, column: 16, scope: !1305)
!1310 = !DILocation(line: 684, column: 9, scope: !1305)
!1311 = !DILocation(line: 0, scope: !1075, inlinedAt: !1312)
!1312 = distinct !DILocation(line: 686, column: 28, scope: !510)
!1313 = !DILocation(line: 1361, column: 11, scope: !1075, inlinedAt: !1312)
!1314 = !DILocation(line: 1361, column: 10, scope: !1075, inlinedAt: !1312)
!1315 = !DILocation(line: 0, scope: !510)
!1316 = !DILocation(line: 687, column: 11, scope: !510)
!1317 = !DILocation(line: 690, column: 22, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 688, column: 9)
!1319 = distinct !DILexicalBlock(scope: !510, file: !2, line: 687, column: 11)
!1320 = !DILocation(line: 696, column: 24, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 695, column: 9)
!1322 = !DILocation(line: 696, column: 22, scope: !1321)
!1323 = !DILocation(line: 697, column: 26, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1321, file: !2, line: 697, column: 15)
!1325 = !DILocation(line: 697, column: 15, scope: !1321)
!1326 = !DILocation(line: 699, column: 15, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1324, file: !2, line: 698, column: 13)
!1328 = !DILocation(line: 701, column: 15, scope: !1327)
!1329 = !DILocation(line: 706, column: 18, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !510, file: !2, line: 706, column: 11)
