; ModuleID = 'src/chmod.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.12 }
%union.anon.12 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.timespec, i64, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.statfs = type { i64, i64, i64, i64, i64, i64, i64, %struct.__fsid_t, i64, i64, i64, [4 x i64] }

!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 496, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 62)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 465, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 75)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 1)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 10)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 492, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 24)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 498, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 72)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "long_options", scope: !109, file: !2, line: 106, type: !588, isLocal: true, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !110, retainedTypes: !174, globals: !184, splitDebugInlining: false, nameTableKind: None)
!110 = !{!111, !118, !123, !129, !143, !158}
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 98, baseType: !112, size: 32, elements: !113)
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !{!114, !115, !116, !117}
!114 = !DIEnumerator(name: "DEREFERENCE_OPTION", value: 256)
!115 = !DIEnumerator(name: "NO_PRESERVE_ROOT", value: 257)
!116 = !DIEnumerator(name: "PRESERVE_ROOT", value: 258)
!117 = !DIEnumerator(name: "REFERENCE_FILE_OPTION", value: 259)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Verbosity", file: !2, line: 56, baseType: !112, size: 32, elements: !119)
!119 = !{!120, !121, !122}
!120 = !DIEnumerator(name: "V_high", value: 0)
!121 = !DIEnumerator(name: "V_changes_only", value: 1)
!122 = !DIEnumerator(name: "V_off", value: 2)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !124, line: 337, baseType: !125, size: 32, elements: !126)
!124 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!128 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !130, line: 42, baseType: !112, size: 32, elements: !131)
!130 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142}
!132 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!133 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!134 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!135 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!136 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!137 = !DIEnumerator(name: "c_quoting_style", value: 5)
!138 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!139 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!140 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!141 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!142 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 46, baseType: !112, size: 32, elements: !145)
!144 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!146 = !DIEnumerator(name: "_ISupper", value: 256)
!147 = !DIEnumerator(name: "_ISlower", value: 512)
!148 = !DIEnumerator(name: "_ISalpha", value: 1024)
!149 = !DIEnumerator(name: "_ISdigit", value: 2048)
!150 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!151 = !DIEnumerator(name: "_ISspace", value: 8192)
!152 = !DIEnumerator(name: "_ISprint", value: 16384)
!153 = !DIEnumerator(name: "_ISgraph", value: 32768)
!154 = !DIEnumerator(name: "_ISblank", value: 1)
!155 = !DIEnumerator(name: "_IScntrl", value: 2)
!156 = !DIEnumerator(name: "_ISpunct", value: 4)
!157 = !DIEnumerator(name: "_ISalnum", value: 8)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !159, file: !2, line: 43, baseType: !112, size: 32, elements: !168)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "change_status", file: !2, line: 41, size: 96, elements: !160)
!160 = !{!161, !162, !167}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !159, file: !2, line: 51, baseType: !158, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "old_mode", scope: !159, file: !2, line: 52, baseType: !163, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !164, line: 69, baseType: !165)
!164 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !166, line: 150, baseType: !112)
!166 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!167 = !DIDerivedType(tag: DW_TAG_member, name: "new_mode", scope: !159, file: !2, line: 53, baseType: !163, size: 32, offset: 64)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIEnumerator(name: "CH_NO_STAT", value: 0)
!170 = !DIEnumerator(name: "CH_FAILED", value: 1)
!171 = !DIEnumerator(name: "CH_NOT_APPLIED", value: 2)
!172 = !DIEnumerator(name: "CH_NO_CHANGE_REQUESTED", value: 3)
!173 = !DIEnumerator(name: "CH_SUCCEEDED", value: 4)
!174 = !{!175, !176, !125, !177, !178, !181, !183}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !179, line: 46, baseType: !180)
!179 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!180 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !185, !190, !195, !200, !205, !210, !212, !217, !222, !227, !265, !270, !275, !277, !279, !281, !283, !286, !366, !371, !373, !378, !380, !382, !384, !386, !388, !390, !392, !394, !399, !404, !406, !408, !410, !412, !414, !416, !418, !423, !428, !433, !435, !437, !439, !441, !446, !451, !453, !458, !460, !465, !467, !469, !471, !476, !478, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !107, !507, !509, !511, !513, !515, !517, !519, !521, !526, !528, !533, !538, !543, !548, !550, !555, !560, !565, !570, !572, !577, !579, !581, !583}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 14)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 16)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 589, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 13)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !2, line: 600, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 42)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 613, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 44)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 626, type: !192, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !2, line: 628, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 25)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 636, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 31)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 644, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 17)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !229, file: !2, line: 652, type: !256, isLocal: true, isDefinition: true)
!229 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 478, type: !230, scopeLine: 479, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !233)
!230 = !DISubroutineType(types: !231)
!231 = !{!125, !125, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!233 = !{!234, !235, !236, !237, !242, !243, !245, !246, !247, !248, !249, !253, !254, !255}
!234 = !DILocalVariable(name: "argc", arg: 1, scope: !229, file: !2, line: 478, type: !125)
!235 = !DILocalVariable(name: "argv", arg: 2, scope: !229, file: !2, line: 478, type: !232)
!236 = !DILocalVariable(name: "mode", scope: !229, file: !2, line: 480, type: !175)
!237 = !DILocalVariable(name: "mode_len", scope: !229, file: !2, line: 481, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !239, line: 130, baseType: !240)
!239 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !179, line: 35, baseType: !241)
!241 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!242 = !DILocalVariable(name: "mode_alloc", scope: !229, file: !2, line: 482, type: !238)
!243 = !DILocalVariable(name: "ok", scope: !229, file: !2, line: 483, type: !244)
!244 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!245 = !DILocalVariable(name: "preserve_root", scope: !229, file: !2, line: 484, type: !244)
!246 = !DILocalVariable(name: "reference_file", scope: !229, file: !2, line: 485, type: !181)
!247 = !DILocalVariable(name: "c", scope: !229, file: !2, line: 486, type: !125)
!248 = !DILocalVariable(name: "bit_flags", scope: !229, file: !2, line: 487, type: !125)
!249 = !DILocalVariable(name: "arg", scope: !250, file: !2, line: 552, type: !181)
!250 = distinct !DILexicalBlock(scope: !251, file: !2, line: 546, column: 11)
!251 = distinct !DILexicalBlock(scope: !252, file: !2, line: 504, column: 9)
!252 = distinct !DILexicalBlock(scope: !229, file: !2, line: 502, column: 5)
!253 = !DILocalVariable(name: "arg_len", scope: !250, file: !2, line: 553, type: !238)
!254 = !DILocalVariable(name: "mode_comma_len", scope: !250, file: !2, line: 554, type: !238)
!255 = !DILocalVariable(name: "new_mode_len", scope: !250, file: !2, line: 555, type: !238)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !257, line: 30, size: 128, elements: !258)
!257 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!258 = !{!259, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !256, file: !257, line: 32, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !164, line: 47, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !166, line: 148, baseType: !180)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !256, file: !257, line: 33, baseType: !263, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !164, line: 59, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !166, line: 145, baseType: !180)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 2)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "change", scope: !109, file: !2, line: 69, type: !272, isLocal: true, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !274, line: 35, flags: DIFlagFwdDecl)
!274 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "umask_value", scope: !109, file: !2, line: 72, type: !163, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "recurse", scope: !109, file: !2, line: 75, type: !244, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "force_silent", scope: !109, file: !2, line: 82, type: !244, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "diagnose_surprises", scope: !109, file: !2, line: 87, type: !244, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "root_dev_ino", scope: !109, file: !2, line: 94, type: !285, isLocal: true, isDefinition: true)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !288, file: !124, line: 575, type: !125, isLocal: true, isDefinition: true)
!288 = distinct !DISubprogram(name: "oputs_", scope: !124, file: !124, line: 573, type: !289, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !109, retainedNodes: !291)
!289 = !DISubroutineType(cc: DW_CC_nocall, types: !290)
!290 = !{null, !181, !181}
!291 = !{!292, !293, !294, !297, !298, !299, !300, !304, !305, !306, !307, !309, !360, !361, !362, !364, !365}
!292 = !DILocalVariable(name: "program", arg: 1, scope: !288, file: !124, line: 573, type: !181)
!293 = !DILocalVariable(name: "option", arg: 2, scope: !288, file: !124, line: 573, type: !181)
!294 = !DILocalVariable(name: "term", scope: !295, file: !124, line: 585, type: !181)
!295 = distinct !DILexicalBlock(scope: !296, file: !124, line: 582, column: 5)
!296 = distinct !DILexicalBlock(scope: !288, file: !124, line: 581, column: 7)
!297 = !DILocalVariable(name: "double_space", scope: !288, file: !124, line: 594, type: !244)
!298 = !DILocalVariable(name: "first_word", scope: !288, file: !124, line: 595, type: !181)
!299 = !DILocalVariable(name: "option_text", scope: !288, file: !124, line: 596, type: !181)
!300 = !DILocalVariable(name: "s", scope: !301, file: !124, line: 608, type: !181)
!301 = distinct !DILexicalBlock(scope: !302, file: !124, line: 605, column: 5)
!302 = distinct !DILexicalBlock(scope: !303, file: !124, line: 604, column: 12)
!303 = distinct !DILexicalBlock(scope: !288, file: !124, line: 597, column: 7)
!304 = !DILocalVariable(name: "spaces", scope: !301, file: !124, line: 609, type: !178)
!305 = !DILocalVariable(name: "anchor_len", scope: !288, file: !124, line: 620, type: !178)
!306 = !DILocalVariable(name: "desc_text", scope: !288, file: !124, line: 625, type: !181)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !124, line: 644, type: !181)
!308 = distinct !DILexicalBlock(scope: !288, file: !124, line: 644, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !124, line: 644, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !312, line: 7, baseType: !313)
!312 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !314, line: 49, size: 1728, elements: !315)
!314 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !331, !333, !334, !335, !337, !338, !340, !341, !344, !346, !349, !352, !353, !354, !355, !356}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !313, file: !314, line: 51, baseType: !125, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !313, file: !314, line: 54, baseType: !175, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !313, file: !314, line: 55, baseType: !175, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !313, file: !314, line: 56, baseType: !175, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !313, file: !314, line: 57, baseType: !175, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !313, file: !314, line: 58, baseType: !175, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !313, file: !314, line: 59, baseType: !175, size: 64, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !313, file: !314, line: 60, baseType: !175, size: 64, offset: 448)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !313, file: !314, line: 61, baseType: !175, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !313, file: !314, line: 64, baseType: !175, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !313, file: !314, line: 65, baseType: !175, size: 64, offset: 640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !313, file: !314, line: 66, baseType: !175, size: 64, offset: 704)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !313, file: !314, line: 68, baseType: !329, size: 64, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !314, line: 36, flags: DIFlagFwdDecl)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !313, file: !314, line: 70, baseType: !332, size: 64, offset: 832)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !313, file: !314, line: 72, baseType: !125, size: 32, offset: 896)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !313, file: !314, line: 73, baseType: !125, size: 32, offset: 928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !313, file: !314, line: 74, baseType: !336, size: 64, offset: 960)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !166, line: 152, baseType: !241)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !313, file: !314, line: 77, baseType: !177, size: 16, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !313, file: !314, line: 78, baseType: !339, size: 8, offset: 1040)
!339 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !313, file: !314, line: 79, baseType: !89, size: 8, offset: 1048)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !313, file: !314, line: 81, baseType: !342, size: 64, offset: 1088)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !314, line: 43, baseType: null)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !313, file: !314, line: 89, baseType: !345, size: 64, offset: 1152)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !166, line: 153, baseType: !241)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !313, file: !314, line: 91, baseType: !347, size: 64, offset: 1216)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !314, line: 37, flags: DIFlagFwdDecl)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !313, file: !314, line: 92, baseType: !350, size: 64, offset: 1280)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !314, line: 38, flags: DIFlagFwdDecl)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !313, file: !314, line: 93, baseType: !332, size: 64, offset: 1344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !313, file: !314, line: 94, baseType: !176, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !313, file: !314, line: 95, baseType: !178, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !313, file: !314, line: 96, baseType: !125, size: 32, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !313, file: !314, line: 98, baseType: !357, size: 160, offset: 1568)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 20)
!360 = !DILocalVariable(name: "__cnt", scope: !308, file: !124, line: 644, type: !178)
!361 = !DILocalVariable(name: "url_program", scope: !288, file: !124, line: 648, type: !181)
!362 = !DILocalVariable(name: "__ptr", scope: !363, file: !124, line: 686, type: !181)
!363 = distinct !DILexicalBlock(scope: !288, file: !124, line: 686, column: 3)
!364 = !DILocalVariable(name: "__stream", scope: !363, file: !124, line: 686, type: !310)
!365 = !DILocalVariable(name: "__cnt", scope: !363, file: !124, line: 686, type: !178)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !124, line: 585, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 5)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !124, line: 586, type: !368, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !124, line: 595, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 4)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !124, line: 620, type: !19, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !267, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !124, line: 648, type: !368, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !375, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !124, line: 649, type: !69, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !124, line: 650, type: !368, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !124, line: 651, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !124, line: 652, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 7)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !124, line: 653, type: !401, isLocal: true, isDefinition: true)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 8)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !124, line: 654, type: !94, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !124, line: 655, type: !94, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !124, line: 656, type: !94, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !124, line: 657, type: !94, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !124, line: 663, type: !396, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !124, line: 664, type: !94, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !224, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !124, line: 669, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 40)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !425, isLocal: true, isDefinition: true)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 15)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !124, line: 676, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 61)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !124, line: 679, type: !69, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !124, line: 683, type: !368, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !124, line: 688, type: !368, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !124, line: 691, type: !401, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !124, line: 801, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1464, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 183)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !124, line: 808, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 664, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 83)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !124, line: 812, type: !34, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !124, line: 816, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 51)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !124, line: 839, type: !192, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !124, line: 840, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 22)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !124, line: 841, type: !425, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !124, line: 862, type: !375, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !124, line: 868, type: !34, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !124, line: 875, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 27)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !455, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !124, line: 877, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 12)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 108, type: !401, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !480, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 110, type: !94, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !425, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !224, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !187, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !19, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !2, line: 115, type: !94, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !2, line: 116, type: !396, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !401, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !368, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !401, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "dereference", scope: !109, file: !2, line: 79, type: !125, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "verbosity", scope: !109, file: !2, line: 90, type: !118, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !2, line: 388, type: !192, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !2, line: 399, type: !224, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 239, type: !224, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 245, type: !69, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 250, type: !214, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !523, isLocal: true, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 38)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !462, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 186)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 45)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 58)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 49)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !473, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 35)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 29)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 56)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 170, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 26)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !74, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 59)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !552, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !267, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !480, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 200, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 520, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 65)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 3328, elements: !198)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !591, line: 50, size: 256, elements: !592)
!591 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!592 = !{!593, !594, !595, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !591, line: 52, baseType: !181, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !590, file: !591, line: 55, baseType: !125, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !591, line: 56, baseType: !596, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !591, line: 57, baseType: !125, size: 32, offset: 192)
!598 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!599 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!600 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !603, line: 3, type: !425, isLocal: true, isDefinition: true)
!603 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "Version", scope: !606, file: !603, line: 3, type: !181, isLocal: false, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C11, file: !603, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !607, splitDebugInlining: false, nameTableKind: None)
!607 = !{!601, !604}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "file_name", scope: !610, file: !611, line: 45, type: !181, isLocal: true, isDefinition: true)
!610 = distinct !DICompileUnit(language: DW_LANG_C11, file: !611, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !612, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!612 = !{!613, !615, !617, !619, !608, !621}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !611, line: 121, type: !396, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !611, line: 121, type: !480, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !611, line: 123, type: !396, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !611, line: 126, type: !69, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !610, file: !611, line: 55, type: !244, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !625, file: !626, line: 66, type: !677, isLocal: false, isDefinition: true)
!625 = distinct !DICompileUnit(language: DW_LANG_C11, file: !626, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !627, globals: !628, splitDebugInlining: false, nameTableKind: None)
!626 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!627 = !{!176, !183}
!628 = !{!629, !631, !656, !658, !660, !662, !623, !664, !666, !668, !670, !675}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !626, line: 272, type: !368, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "old_file_name", scope: !633, file: !626, line: 304, type: !181, isLocal: true, isDefinition: true)
!633 = distinct !DISubprogram(name: "verror_at_line", scope: !626, file: !626, line: 298, type: !634, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !625, retainedNodes: !649)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !125, !125, !181, !112, !181, !636}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !637, line: 52, baseType: !638)
!637 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !639, line: 14, baseType: !640)
!639 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !641, baseType: !642)
!641 = !DIFile(filename: "lib/error.c", directory: "/src")
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !643)
!643 = !{!644, !645, !646, !647, !648}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !642, file: !641, baseType: !176, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !642, file: !641, baseType: !176, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !642, file: !641, baseType: !176, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !642, file: !641, baseType: !125, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !642, file: !641, baseType: !125, size: 32, offset: 224)
!649 = !{!650, !651, !652, !653, !654, !655}
!650 = !DILocalVariable(name: "status", arg: 1, scope: !633, file: !626, line: 298, type: !125)
!651 = !DILocalVariable(name: "errnum", arg: 2, scope: !633, file: !626, line: 298, type: !125)
!652 = !DILocalVariable(name: "file_name", arg: 3, scope: !633, file: !626, line: 298, type: !181)
!653 = !DILocalVariable(name: "line_number", arg: 4, scope: !633, file: !626, line: 298, type: !112)
!654 = !DILocalVariable(name: "message", arg: 5, scope: !633, file: !626, line: 298, type: !181)
!655 = !DILocalVariable(name: "args", arg: 6, scope: !633, file: !626, line: 298, type: !636)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "old_line_number", scope: !633, file: !626, line: 305, type: !112, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !626, line: 338, type: !375, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !626, line: 346, type: !401, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !626, line: 346, type: !267, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "error_message_count", scope: !625, file: !626, line: 69, type: !112, isLocal: false, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !625, file: !626, line: 295, type: !125, isLocal: false, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !626, line: 208, type: !396, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !626, line: 208, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 21)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !626, line: 214, type: !368, isLocal: true, isDefinition: true)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{null}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !682, line: 399, type: !267, isLocal: true, isDefinition: true)
!682 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !682, line: 441, type: !89, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !682, line: 1080, type: !69, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !689, line: 226, type: !99, isLocal: true, isDefinition: true)
!689 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !689, line: 227, type: !99, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !689, line: 228, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 33)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !689, line: 231, type: !99, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "default_tuning", scope: !701, file: !689, line: 134, type: !705, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !702, globals: !704, splitDebugInlining: false, nameTableKind: None)
!702 = !{!180, !176, !703, !178}
!703 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!704 = !{!687, !690, !692, !697, !699}
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !707, line: 52, baseType: !708)
!707 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !707, line: 40, size: 160, elements: !709)
!709 = !{!710, !711, !712, !713, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !708, file: !707, line: 45, baseType: !703, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !708, file: !707, line: 46, baseType: !703, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !708, file: !707, line: 47, baseType: !703, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !708, file: !707, line: 48, baseType: !703, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !708, file: !707, line: 49, baseType: !244, size: 8, offset: 128)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "program_name", scope: !717, file: !718, line: 31, type: !181, isLocal: false, isDefinition: true)
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !719, globals: !720, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!719 = !{!175}
!720 = !{!715, !721, !723}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !718, line: 46, type: !401, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !718, line: 49, type: !375, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "utf07FF", scope: !727, file: !728, line: 46, type: !755, isLocal: true, isDefinition: true)
!727 = distinct !DISubprogram(name: "proper_name_lite", scope: !728, file: !728, line: 38, type: !729, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !731, retainedNodes: !733)
!728 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!729 = !DISubroutineType(types: !730)
!730 = !{!181, !181, !181}
!731 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !732, splitDebugInlining: false, nameTableKind: None)
!732 = !{!725}
!733 = !{!734, !735, !736, !737, !742}
!734 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !727, file: !728, line: 38, type: !181)
!735 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !727, file: !728, line: 38, type: !181)
!736 = !DILocalVariable(name: "translation", scope: !727, file: !728, line: 40, type: !181)
!737 = !DILocalVariable(name: "w", scope: !727, file: !728, line: 47, type: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !739, line: 37, baseType: !740)
!739 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !166, line: 57, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !166, line: 42, baseType: !112)
!742 = !DILocalVariable(name: "mbs", scope: !727, file: !728, line: 48, type: !743)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !744, line: 6, baseType: !745)
!744 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !746, line: 21, baseType: !747)
!746 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !746, line: 13, size: 64, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !747, file: !746, line: 15, baseType: !125, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !747, file: !746, line: 20, baseType: !751, size: 32, offset: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !747, file: !746, line: 16, size: 32, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !751, file: !746, line: 18, baseType: !112, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !751, file: !746, line: 19, baseType: !375, size: 32)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 16, elements: !268)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !758, line: 78, type: !401, isLocal: true, isDefinition: true)
!758 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !758, line: 79, type: !19, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !758, line: 80, type: !197, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !758, line: 81, type: !197, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !758, line: 82, type: !357, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !758, line: 83, type: !267, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !758, line: 84, type: !401, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !758, line: 85, type: !396, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !758, line: 86, type: !396, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !758, line: 87, type: !401, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !779, file: !758, line: 76, type: !851, isLocal: false, isDefinition: true)
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !786, globals: !787, splitDebugInlining: false, nameTableKind: None)
!780 = !{!129, !781, !143}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !130, line: 254, baseType: !112, size: 32, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!784 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!785 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!786 = !{!125, !177, !178}
!787 = !{!756, !759, !761, !763, !765, !767, !769, !771, !773, !775, !777, !788, !792, !802, !804, !809, !811, !813, !815, !817, !840, !847, !849}
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !779, file: !758, line: 92, type: !790, isLocal: false, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 320, elements: !95)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !779, file: !758, line: 1040, type: !794, isLocal: false, isDefinition: true)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !758, line: 56, size: 448, elements: !795)
!795 = !{!796, !797, !798, !800, !801}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !794, file: !758, line: 59, baseType: !129, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !794, file: !758, line: 62, baseType: !125, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !794, file: !758, line: 66, baseType: !799, size: 256, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 256, elements: !402)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !794, file: !758, line: 69, baseType: !181, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !794, file: !758, line: 72, baseType: !181, size: 64, offset: 384)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !779, file: !758, line: 107, type: !794, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "slot0", scope: !779, file: !758, line: 831, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 256)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !758, line: 321, type: !267, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !758, line: 357, type: !267, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !758, line: 358, type: !267, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !758, line: 199, type: !396, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "quote", scope: !819, file: !758, line: 228, type: !838, isLocal: true, isDefinition: true)
!819 = distinct !DISubprogram(name: "gettext_quote", scope: !758, file: !758, line: 197, type: !820, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !779, retainedNodes: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{!181, !181, !129}
!822 = !{!823, !824, !825, !826, !827}
!823 = !DILocalVariable(name: "msgid", arg: 1, scope: !819, file: !758, line: 197, type: !181)
!824 = !DILocalVariable(name: "s", arg: 2, scope: !819, file: !758, line: 197, type: !129)
!825 = !DILocalVariable(name: "translation", scope: !819, file: !758, line: 199, type: !181)
!826 = !DILocalVariable(name: "w", scope: !819, file: !758, line: 229, type: !738)
!827 = !DILocalVariable(name: "mbs", scope: !819, file: !758, line: 230, type: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !744, line: 6, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !746, line: 21, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !746, line: 13, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !830, file: !746, line: 15, baseType: !125, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !830, file: !746, line: 20, baseType: !834, size: 32, offset: 32)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !830, file: !746, line: 16, size: 32, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !834, file: !746, line: 18, baseType: !112, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !834, file: !746, line: 19, baseType: !375, size: 32)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 64, elements: !839)
!839 = !{!269, !377}
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "slotvec", scope: !779, file: !758, line: 834, type: !842, isLocal: true, isDefinition: true)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !758, line: 823, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !843, file: !758, line: 825, baseType: !178, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !843, file: !758, line: 826, baseType: !175, size: 64, offset: 64)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "nslots", scope: !779, file: !758, line: 832, type: !125, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "slotvec0", scope: !779, file: !758, line: 833, type: !843, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 704, elements: !853)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!853 = !{!854}
!854 = !DISubrange(count: 11)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !857, line: 32, type: !267, isLocal: true, isDefinition: true)
!857 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !860, line: 67, type: !480, isLocal: true, isDefinition: true)
!860 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !860, line: 69, type: !396, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !860, line: 83, type: !396, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !860, line: 83, type: !375, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !860, line: 85, type: !267, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !860, line: 88, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 171)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !860, line: 88, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 34)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !860, line: 105, type: !192, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !860, line: 109, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 23)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !860, line: 113, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 28)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !860, line: 120, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 32)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !860, line: 127, type: !898, isLocal: true, isDefinition: true)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 36)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !860, line: 134, type: !420, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !860, line: 142, type: !207, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !860, line: 150, type: !907, isLocal: true, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 48)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !860, line: 159, type: !912, isLocal: true, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 52)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !860, line: 170, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 60)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !860, line: 248, type: !357, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !860, line: 248, type: !462, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !860, line: 254, type: !357, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !860, line: 254, type: !187, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !860, line: 254, type: !420, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !860, line: 259, type: !3, isLocal: true, isDefinition: true)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(scope: null, file: !860, line: 259, type: !557, isLocal: true, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !936, file: !937, line: 26, type: !939, isLocal: false, isDefinition: true)
!936 = distinct !DICompileUnit(language: DW_LANG_C11, file: !937, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !938, splitDebugInlining: false, nameTableKind: None)
!937 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!938 = !{!934}
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 376, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 47)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "exit_failure", scope: !944, file: !945, line: 24, type: !947, isLocal: false, isDefinition: true)
!944 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !946, splitDebugInlining: false, nameTableKind: None)
!945 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!946 = !{!942}
!947 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !125)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !69, isLocal: true, isDefinition: true)
!950 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !396, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !224, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !957, line: 40, type: !557, isLocal: true, isDefinition: true)
!957 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !957, line: 40, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !853)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !957, line: 40, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 624, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 78)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !968, line: 59, type: !99, isLocal: true, isDefinition: true)
!968 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !968, line: 59, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 18)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !968, line: 59, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 536, elements: !55)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !979, file: !980, line: 506, type: !125, isLocal: true, isDefinition: true)
!979 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !980, file: !980, line: 485, type: !981, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !983, retainedNodes: !985)
!980 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!981 = !DISubroutineType(types: !982)
!982 = !{!125, !125, !125}
!983 = distinct !DICompileUnit(language: DW_LANG_C11, file: !980, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !984, splitDebugInlining: false, nameTableKind: None)
!984 = !{!977}
!985 = !{!986, !987, !988, !989, !992}
!986 = !DILocalVariable(name: "fd", arg: 1, scope: !979, file: !980, line: 485, type: !125)
!987 = !DILocalVariable(name: "target", arg: 2, scope: !979, file: !980, line: 485, type: !125)
!988 = !DILocalVariable(name: "result", scope: !979, file: !980, line: 487, type: !125)
!989 = !DILocalVariable(name: "flags", scope: !990, file: !980, line: 530, type: !125)
!990 = distinct !DILexicalBlock(scope: !991, file: !980, line: 529, column: 5)
!991 = distinct !DILexicalBlock(scope: !979, file: !980, line: 528, column: 7)
!992 = !DILocalVariable(name: "saved_errno", scope: !993, file: !980, line: 533, type: !125)
!993 = distinct !DILexicalBlock(scope: !994, file: !980, line: 532, column: 9)
!994 = distinct !DILexicalBlock(scope: !990, file: !980, line: 531, column: 11)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !997, line: 108, type: !89, isLocal: true, isDefinition: true)
!997 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "internal_state", scope: !1000, file: !997, line: 97, type: !1003, isLocal: true, isDefinition: true)
!1000 = distinct !DICompileUnit(language: DW_LANG_C11, file: !997, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1001, globals: !1002, splitDebugInlining: false, nameTableKind: None)
!1001 = !{!176, !178, !183}
!1002 = !{!995, !998}
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !744, line: 6, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !746, line: 21, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !746, line: 13, size: 64, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1005, file: !746, line: 15, baseType: !125, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1005, file: !746, line: 20, baseType: !1009, size: 32, offset: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1005, file: !746, line: 16, size: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1009, file: !746, line: 18, baseType: !112, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1009, file: !746, line: 19, baseType: !375, size: 32)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !1015, line: 35, type: !267, isLocal: true, isDefinition: true)
!1015 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !1015, line: 35, type: !19, isLocal: true, isDefinition: true)
!1018 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1019, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1019 = !DIFile(filename: "lib/filemode.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4709245c6350fbec3a6a0f5fa66bc341")
!1020 = distinct !DICompileUnit(language: DW_LANG_C11, file: !682, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1021, retainedTypes: !1177, globals: !1188, splitDebugInlining: false, nameTableKind: None)
!1021 = !{!1022, !1026, !1153, !1156, !1160, !1171, !1174}
!1022 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !682, line: 159, baseType: !112, size: 32, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1025 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1026 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1028, file: !1027, line: 54, baseType: !112, size: 32, elements: !1151)
!1027 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1028 = distinct !DISubprogram(name: "setup_dir", scope: !1027, file: !1027, line: 50, type: !1029, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1020, retainedNodes: !1149)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!244, !1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1033, line: 233, baseType: !1034)
!1033 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1033, line: 115, size: 1024, elements: !1035)
!1035 = !{!1036, !1099, !1100, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1115, !1116, !1119, !1138}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1034, file: !1033, line: 116, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1033, line: 235, size: 1920, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1095}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1038, file: !1033, line: 236, baseType: !1037, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1038, file: !1033, line: 237, baseType: !1037, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1038, file: !1033, line: 238, baseType: !1037, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1038, file: !1033, line: 239, baseType: !1044, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1046, line: 127, baseType: !1047)
!1046 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1046, line: 127, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1038, file: !1033, line: 242, baseType: !241, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1038, file: !1033, line: 243, baseType: !176, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1038, file: !1033, line: 244, baseType: !175, size: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1038, file: !1033, line: 245, baseType: !175, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1038, file: !1033, line: 246, baseType: !125, size: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1038, file: !1033, line: 247, baseType: !125, size: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1038, file: !1033, line: 248, baseType: !178, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1038, file: !1033, line: 250, baseType: !1031, size: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1038, file: !1033, line: 254, baseType: !240, size: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1038, file: !1033, line: 256, baseType: !178, size: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1038, file: !1033, line: 272, baseType: !177, size: 16, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1038, file: !1033, line: 276, baseType: !177, size: 16, offset: 848)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1038, file: !1033, line: 282, baseType: !177, size: 16, offset: 864)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1038, file: !1033, line: 284, baseType: !1062, size: 1024, offset: 896)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1063, size: 1024, elements: !90)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1064, line: 44, size: 1024, elements: !1065)
!1064 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1065 = !{!1066, !1067, !1068, !1069, !1071, !1073, !1075, !1076, !1077, !1078, !1080, !1081, !1083, !1091, !1092, !1093}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1063, file: !1064, line: 46, baseType: !264, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1063, file: !1064, line: 47, baseType: !261, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1063, file: !1064, line: 48, baseType: !165, size: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1063, file: !1064, line: 49, baseType: !1070, size: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !166, line: 151, baseType: !112)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1063, file: !1064, line: 50, baseType: !1072, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !166, line: 146, baseType: !112)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1063, file: !1064, line: 51, baseType: !1074, size: 32, offset: 224)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !166, line: 147, baseType: !112)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1063, file: !1064, line: 52, baseType: !264, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1063, file: !1064, line: 53, baseType: !264, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1063, file: !1064, line: 54, baseType: !336, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1063, file: !1064, line: 55, baseType: !1079, size: 32, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !166, line: 175, baseType: !125)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1063, file: !1064, line: 56, baseType: !125, size: 32, offset: 480)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1063, file: !1064, line: 57, baseType: !1082, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !166, line: 180, baseType: !241)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1063, file: !1064, line: 65, baseType: !1084, size: 128, offset: 576)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1085, line: 11, size: 128, elements: !1086)
!1085 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1086 = !{!1087, !1089}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1084, file: !1085, line: 16, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !166, line: 160, baseType: !241)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1084, file: !1085, line: 21, baseType: !1090, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !166, line: 197, baseType: !241)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1063, file: !1064, line: 66, baseType: !1084, size: 128, offset: 704)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1063, file: !1064, line: 67, baseType: !1084, size: 128, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1063, file: !1064, line: 79, baseType: !1094, size: 64, offset: 960)
!1094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 64, elements: !268)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !1038, file: !1033, line: 285, baseType: !1096, offset: 1920)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: -1)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !1034, file: !1033, line: 117, baseType: !1037, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !1034, file: !1033, line: 118, baseType: !1101, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !1034, file: !1033, line: 119, baseType: !263, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1034, file: !1033, line: 120, baseType: !175, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !1034, file: !1033, line: 121, baseType: !125, size: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !1034, file: !1033, line: 122, baseType: !125, size: 32, offset: 352)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1034, file: !1033, line: 124, baseType: !178, size: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !1034, file: !1033, line: 125, baseType: !178, size: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !1034, file: !1033, line: 126, baseType: !1109, size: 64, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!125, !1112, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !1034, file: !1033, line: 196, baseType: !125, size: 32, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !1034, file: !1033, line: 205, baseType: !1117, size: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1033, line: 205, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1034, file: !1033, line: 227, baseType: !1120, size: 64, offset: 704)
!1120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1034, file: !1033, line: 207, size: 64, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !1120, file: !1033, line: 220, baseType: !1117, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1120, file: !1033, line: 226, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !1126, line: 32, size: 256, elements: !1127)
!1126 = !DIFile(filename: "./lib/cycle-check.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5b1b442060400da72f41cd561f8be0ce")
!1127 = !{!1128, !1133, !1137}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "dev_ino", scope: !1125, file: !1126, line: 34, baseType: !1129, size: 128)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !257, line: 30, size: 128, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1129, file: !257, line: 32, baseType: !260, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1129, file: !257, line: 33, baseType: !263, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "chdir_counter", scope: !1125, file: !1126, line: 35, baseType: !1134, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1135, line: 102, baseType: !1136)
!1135 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !166, line: 73, baseType: !180)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !1125, file: !1126, line: 36, baseType: !125, size: 32, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !1034, file: !1033, line: 232, baseType: !1139, size: 256, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !1140, line: 47, baseType: !1141)
!1140 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !1140, line: 39, size: 256, elements: !1142)
!1142 = !{!1143, !1145, !1146, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !1141, file: !1140, line: 41, baseType: !1144, size: 128)
