; ModuleID = 'src/chroot.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct.group = type { ptr, ptr, i32, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [50 x i8] c"Usage: %s [OPTION]... NEWROOT [COMMAND [ARG]...]\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [50 x i8] c"Run COMMAND with root directory set to NEWROOT.\0A\0A\00", align 1, !dbg !12

!73 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!74 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!75 = !{!76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!76 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!77 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!78 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!79 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!80 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!81 = !DIEnumerator(name: "c_quoting_style", value: 5)
!82 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!83 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!84 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!85 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!86 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 90, baseType: !74, size: 32, elements: !89)
!88 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "EXIT_TIMEDOUT", value: 124)
!91 = !DIEnumerator(name: "EXIT_CANCELED", value: 125)
!92 = !DIEnumerator(name: "EXIT_CANNOT_INVOKE", value: 126)
!93 = !DIEnumerator(name: "EXIT_ENOENT", value: 127)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 48, baseType: !74, size: 32, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIEnumerator(name: "GROUPS", value: 256)
!97 = !DIEnumerator(name: "USERSPEC", value: 257)
!98 = !DIEnumerator(name: "SKIP_CHDIR", value: 258)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !88, line: 337, baseType: !100, size: 32, elements: !101)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !{!102, !103}
!102 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!103 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !105, line: 46, baseType: !74, size: 32, elements: !106)
!105 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!107 = !DIEnumerator(name: "_ISupper", value: 256)
!108 = !DIEnumerator(name: "_ISlower", value: 512)
!109 = !DIEnumerator(name: "_ISalpha", value: 1024)
!110 = !DIEnumerator(name: "_ISdigit", value: 2048)
!111 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!112 = !DIEnumerator(name: "_ISspace", value: 8192)
!113 = !DIEnumerator(name: "_ISprint", value: 16384)
!114 = !DIEnumerator(name: "_ISgraph", value: 32768)
!115 = !DIEnumerator(name: "_ISblank", value: 1)
!116 = !DIEnumerator(name: "_IScntrl", value: 2)
!117 = !DIEnumerator(name: "_ISpunct", value: 4)
!118 = !DIEnumerator(name: "_ISalnum", value: 8)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !120, line: 30, baseType: !74, size: 32, elements: !121)
!120 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!121 = !{!122, !123, !124, !125, !126}
!122 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!123 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!124 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!125 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!126 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!127 = !{!128, !129, !130, !100, !135, !136, !138, !140, !141, !144, !146, !155}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !131, line: 102, baseType: !132)
!131 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !133, line: 73, baseType: !134)
!133 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !137, line: 46, baseType: !134)
!137 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !142, line: 79, baseType: !143)
!142 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !133, line: 146, baseType: !74)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !142, line: 64, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !133, line: 147, baseType: !74)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !148, line: 42, size: 256, elements: !149)
!148 = !DIFile(filename: "/usr/include/grp.h", directory: "", checksumkind: CSK_MD5, checksum: "17838c4acd24e08e5bed6821e9e2c084")
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !147, file: !148, line: 44, baseType: !128, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !147, file: !148, line: 45, baseType: !128, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !147, file: !148, line: 46, baseType: !145, size: 32, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !147, file: !148, line: 47, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !131, line: 87, baseType: !156)
!156 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!157 = !{!0, !7, !12, !14, !19, !24, !29, !34, !39, !41, !46, !51, !56, !61, !66, !158, !163, !168, !173, !178, !183, !188, !193, !198, !203, !205, !210, !215, !217, !222, !227, !232, !313, !318, !320, !325, !327, !329, !331, !333, !335, !337, !339, !341, !343, !345, !347, !349, !351, !353, !355, !357, !362, !364, !366, !371, !373, !375, !377, !379, !384, !386, !388, !390, !392, !397, !402, !407, !412, !414, !419, !424, !426, !68, !428, !430, !432}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 14)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !165, isLocal: true, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 15)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(scope: null, file: !2, line: 279, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 16)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !2, line: 288, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 56)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 331, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 35)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 31)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 6)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 8)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 344, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 3)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !200, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 40)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 34)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !2, line: 416, type: !212, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 23)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !2, line: 425, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 22)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !2, line: 431, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 25)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !234, file: !88, line: 575, type: !100, isLocal: true, isDefinition: true)
!234 = distinct !DISubprogram(name: "oputs_", scope: !88, file: !88, line: 573, type: !235, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !237)
!235 = !DISubroutineType(cc: DW_CC_nocall, types: !236)
!236 = !{null, !138, !138}
!237 = !{!238, !239, !240, !243, !245, !246, !247, !251, !252, !253, !254, !256, !307, !308, !309, !311, !312}
!238 = !DILocalVariable(name: "program", arg: 1, scope: !234, file: !88, line: 573, type: !138)
!239 = !DILocalVariable(name: "option", arg: 2, scope: !234, file: !88, line: 573, type: !138)
!240 = !DILocalVariable(name: "term", scope: !241, file: !88, line: 585, type: !138)
!241 = distinct !DILexicalBlock(scope: !242, file: !88, line: 582, column: 5)
!242 = distinct !DILexicalBlock(scope: !234, file: !88, line: 581, column: 7)
!243 = !DILocalVariable(name: "double_space", scope: !234, file: !88, line: 594, type: !244)
!244 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!245 = !DILocalVariable(name: "first_word", scope: !234, file: !88, line: 595, type: !138)
!246 = !DILocalVariable(name: "option_text", scope: !234, file: !88, line: 596, type: !138)
!247 = !DILocalVariable(name: "s", scope: !248, file: !88, line: 608, type: !138)
!248 = distinct !DILexicalBlock(scope: !249, file: !88, line: 605, column: 5)
!249 = distinct !DILexicalBlock(scope: !250, file: !88, line: 604, column: 12)
!250 = distinct !DILexicalBlock(scope: !234, file: !88, line: 597, column: 7)
!251 = !DILocalVariable(name: "spaces", scope: !248, file: !88, line: 609, type: !136)
!252 = !DILocalVariable(name: "anchor_len", scope: !234, file: !88, line: 620, type: !136)
!253 = !DILocalVariable(name: "desc_text", scope: !234, file: !88, line: 625, type: !138)
!254 = !DILocalVariable(name: "__ptr", scope: !255, file: !88, line: 644, type: !138)
!255 = distinct !DILexicalBlock(scope: !234, file: !88, line: 644, column: 3)
!256 = !DILocalVariable(name: "__stream", scope: !255, file: !88, line: 644, type: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !259, line: 7, baseType: !260)
!259 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !261, line: 49, size: 1728, elements: !262)
!261 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !278, !280, !281, !282, !284, !285, !287, !288, !291, !293, !296, !299, !300, !301, !302, !303}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !260, file: !261, line: 51, baseType: !100, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !260, file: !261, line: 54, baseType: !128, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !260, file: !261, line: 55, baseType: !128, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !260, file: !261, line: 56, baseType: !128, size: 64, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !260, file: !261, line: 57, baseType: !128, size: 64, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !260, file: !261, line: 58, baseType: !128, size: 64, offset: 320)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !260, file: !261, line: 59, baseType: !128, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !260, file: !261, line: 60, baseType: !128, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !260, file: !261, line: 61, baseType: !128, size: 64, offset: 512)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !260, file: !261, line: 64, baseType: !128, size: 64, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !260, file: !261, line: 65, baseType: !128, size: 64, offset: 640)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !260, file: !261, line: 66, baseType: !128, size: 64, offset: 704)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !260, file: !261, line: 68, baseType: !276, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !261, line: 36, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !260, file: !261, line: 70, baseType: !279, size: 64, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !260, file: !261, line: 72, baseType: !100, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !260, file: !261, line: 73, baseType: !100, size: 32, offset: 928)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !260, file: !261, line: 74, baseType: !283, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !133, line: 152, baseType: !156)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !260, file: !261, line: 77, baseType: !135, size: 16, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !260, file: !261, line: 78, baseType: !286, size: 8, offset: 1040)
!286 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !260, file: !261, line: 79, baseType: !53, size: 8, offset: 1048)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !260, file: !261, line: 81, baseType: !289, size: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !261, line: 43, baseType: null)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !260, file: !261, line: 89, baseType: !292, size: 64, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !133, line: 153, baseType: !156)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !260, file: !261, line: 91, baseType: !294, size: 64, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !261, line: 37, flags: DIFlagFwdDecl)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !260, file: !261, line: 92, baseType: !297, size: 64, offset: 1280)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !261, line: 38, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !260, file: !261, line: 93, baseType: !279, size: 64, offset: 1344)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !260, file: !261, line: 94, baseType: !129, size: 64, offset: 1408)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !260, file: !261, line: 95, baseType: !136, size: 64, offset: 1472)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !260, file: !261, line: 96, baseType: !100, size: 32, offset: 1536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !260, file: !261, line: 98, baseType: !304, size: 160, offset: 1568)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 20)
!307 = !DILocalVariable(name: "__cnt", scope: !255, file: !88, line: 644, type: !136)
!308 = !DILocalVariable(name: "url_program", scope: !234, file: !88, line: 648, type: !138)
!309 = !DILocalVariable(name: "__ptr", scope: !310, file: !88, line: 686, type: !138)
!310 = distinct !DILexicalBlock(scope: !234, file: !88, line: 686, column: 3)
!311 = !DILocalVariable(name: "__stream", scope: !310, file: !88, line: 686, type: !257)
!312 = !DILocalVariable(name: "__cnt", scope: !310, file: !88, line: 686, type: !136)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !88, line: 585, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 5)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !88, line: 586, type: !315, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !88, line: 595, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 4)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !88, line: 620, type: !190, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !88, line: 648, type: !36, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !88, line: 648, type: !315, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !88, line: 649, type: !322, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !88, line: 649, type: !200, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !88, line: 650, type: !315, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !88, line: 651, type: !190, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !88, line: 651, type: !190, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !88, line: 652, type: !16, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !88, line: 653, type: !195, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !88, line: 654, type: !58, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !88, line: 655, type: !58, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !88, line: 656, type: !58, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !88, line: 657, type: !58, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !88, line: 663, type: !16, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !88, line: 664, type: !58, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !88, line: 669, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 17)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !88, line: 669, type: !207, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !88, line: 676, type: !165, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !88, line: 676, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 61)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !88, line: 679, type: !200, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !88, line: 683, type: !315, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !88, line: 688, type: !315, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !88, line: 691, type: !195, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !88, line: 826, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 180)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !88, line: 839, type: !170, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !88, line: 840, type: !224, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !88, line: 841, type: !165, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !88, line: 862, type: !322, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !88, line: 868, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 71)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !88, line: 875, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 27)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !88, line: 877, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 51)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !88, line: 877, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 12)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !16, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 9)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 11)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !315, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !195, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !36, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !359, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !224, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 1536, elements: !191)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !437, line: 50, size: 256, elements: !438)
!437 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!438 = !{!439, !440, !441, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !437, line: 52, baseType: !138, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !436, file: !437, line: 55, baseType: !100, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !437, line: 56, baseType: !442, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !436, file: !437, line: 57, baseType: !100, size: 32, offset: 192)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !446, line: 3, type: !165, isLocal: true, isDefinition: true)
!446 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "Version", scope: !449, file: !446, line: 3, type: !138, isLocal: false, isDefinition: true)
!449 = distinct !DICompileUnit(language: DW_LANG_C11, file: !446, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !450, splitDebugInlining: false, nameTableKind: None)
!450 = !{!444, !447}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "file_name", scope: !453, file: !454, line: 45, type: !138, isLocal: true, isDefinition: true)
!453 = distinct !DICompileUnit(language: DW_LANG_C11, file: !454, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !455, splitDebugInlining: false, nameTableKind: None)
!454 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!455 = !{!456, !458, !460, !462, !451, !464}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !454, line: 121, type: !16, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !454, line: 121, type: !409, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !454, line: 123, type: !16, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !454, line: 126, type: !200, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !453, file: !454, line: 55, type: !244, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !468, file: !469, line: 66, type: !520, isLocal: false, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C11, file: !469, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !470, globals: !471, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!470 = !{!129, !140}
!471 = !{!472, !474, !499, !501, !503, !505, !466, !507, !509, !511, !513, !518}
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !469, line: 272, type: !315, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "old_file_name", scope: !476, file: !469, line: 304, type: !138, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "verror_at_line", scope: !469, file: !469, line: 298, type: !477, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !492)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !100, !100, !138, !74, !138, !479}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !480, line: 52, baseType: !481)
!480 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !482, line: 14, baseType: !483)
!482 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !484, baseType: !485)
!484 = !DIFile(filename: "lib/error.c", directory: "/src")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !486)
!486 = !{!487, !488, !489, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !485, file: !484, baseType: !129, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !485, file: !484, baseType: !129, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !485, file: !484, baseType: !129, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !485, file: !484, baseType: !100, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !485, file: !484, baseType: !100, size: 32, offset: 224)
!492 = !{!493, !494, !495, !496, !497, !498}
!493 = !DILocalVariable(name: "status", arg: 1, scope: !476, file: !469, line: 298, type: !100)
!494 = !DILocalVariable(name: "errnum", arg: 2, scope: !476, file: !469, line: 298, type: !100)
!495 = !DILocalVariable(name: "file_name", arg: 3, scope: !476, file: !469, line: 298, type: !138)
!496 = !DILocalVariable(name: "line_number", arg: 4, scope: !476, file: !469, line: 298, type: !74)
!497 = !DILocalVariable(name: "message", arg: 5, scope: !476, file: !469, line: 298, type: !138)
!498 = !DILocalVariable(name: "args", arg: 6, scope: !476, file: !469, line: 298, type: !479)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "old_line_number", scope: !476, file: !469, line: 305, type: !74, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !469, line: 338, type: !322, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !469, line: 346, type: !195, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !469, line: 346, type: !36, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "error_message_count", scope: !468, file: !469, line: 69, type: !74, isLocal: false, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !468, file: !469, line: 295, type: !100, isLocal: false, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !469, line: 208, type: !16, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !469, line: 208, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 21)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !469, line: 214, type: !315, isLocal: true, isDefinition: true)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "program_name", scope: !525, file: !526, line: 31, type: !138, isLocal: false, isDefinition: true)
!525 = distinct !DICompileUnit(language: DW_LANG_C11, file: !526, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !527, globals: !528, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!527 = !{!128}
!528 = !{!523, !529, !531}
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !526, line: 46, type: !195, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !526, line: 49, type: !322, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "utf07FF", scope: !535, file: !536, line: 46, type: !563, isLocal: true, isDefinition: true)
!535 = distinct !DISubprogram(name: "proper_name_lite", scope: !536, file: !536, line: 38, type: !537, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !539, retainedNodes: !541)
!536 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!537 = !DISubroutineType(types: !538)
!538 = !{!138, !138, !138}
!539 = distinct !DICompileUnit(language: DW_LANG_C11, file: !536, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !540, splitDebugInlining: false, nameTableKind: None)
!540 = !{!533}
!541 = !{!542, !543, !544, !545, !550}
!542 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !535, file: !536, line: 38, type: !138)
!543 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !535, file: !536, line: 38, type: !138)
!544 = !DILocalVariable(name: "translation", scope: !535, file: !536, line: 40, type: !138)
!545 = !DILocalVariable(name: "w", scope: !535, file: !536, line: 47, type: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !547, line: 37, baseType: !548)
!547 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !133, line: 57, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !133, line: 42, baseType: !74)
!550 = !DILocalVariable(name: "mbs", scope: !535, file: !536, line: 48, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !552, line: 6, baseType: !553)
!552 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !554, line: 21, baseType: !555)
!554 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 13, size: 64, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !555, file: !554, line: 15, baseType: !100, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !555, file: !554, line: 20, baseType: !559, size: 32, offset: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !555, file: !554, line: 16, size: 32, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !559, file: !554, line: 18, baseType: !74, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !559, file: !554, line: 19, baseType: !322, size: 32)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 16, elements: !37)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !566, line: 78, type: !195, isLocal: true, isDefinition: true)
!566 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !566, line: 79, type: !190, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !566, line: 80, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 13)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !566, line: 81, type: !571, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !566, line: 82, type: !304, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !566, line: 83, type: !36, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !566, line: 84, type: !195, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !566, line: 85, type: !16, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !566, line: 86, type: !16, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !566, line: 87, type: !195, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !590, file: !566, line: 76, type: !662, isLocal: false, isDefinition: true)
!590 = distinct !DICompileUnit(language: DW_LANG_C11, file: !566, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !591, retainedTypes: !597, globals: !598, splitDebugInlining: false, nameTableKind: None)
!591 = !{!72, !592, !104}
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !73, line: 254, baseType: !74, size: 32, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!595 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!596 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!597 = !{!100, !135, !136}
!598 = !{!564, !567, !569, !574, !576, !578, !580, !582, !584, !586, !588, !599, !603, !613, !615, !620, !622, !624, !626, !628, !651, !658, !660}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !590, file: !566, line: 92, type: !601, isLocal: false, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 320, elements: !59)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !590, file: !566, line: 1040, type: !605, isLocal: false, isDefinition: true)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !566, line: 56, size: 448, elements: !606)
!606 = !{!607, !608, !609, !611, !612}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !605, file: !566, line: 59, baseType: !72, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !566, line: 62, baseType: !100, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !605, file: !566, line: 66, baseType: !610, size: 256, offset: 64)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !196)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !605, file: !566, line: 69, baseType: !138, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !605, file: !566, line: 72, baseType: !138, size: 64, offset: 384)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !590, file: !566, line: 107, type: !605, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "slot0", scope: !590, file: !566, line: 831, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 256)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !566, line: 321, type: !36, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !566, line: 357, type: !36, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !566, line: 358, type: !36, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !566, line: 199, type: !16, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "quote", scope: !630, file: !566, line: 228, type: !649, isLocal: true, isDefinition: true)
!630 = distinct !DISubprogram(name: "gettext_quote", scope: !566, file: !566, line: 197, type: !631, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{!138, !138, !72}
!633 = !{!634, !635, !636, !637, !638}
!634 = !DILocalVariable(name: "msgid", arg: 1, scope: !630, file: !566, line: 197, type: !138)
!635 = !DILocalVariable(name: "s", arg: 2, scope: !630, file: !566, line: 197, type: !72)
!636 = !DILocalVariable(name: "translation", scope: !630, file: !566, line: 199, type: !138)
!637 = !DILocalVariable(name: "w", scope: !630, file: !566, line: 229, type: !546)
!638 = !DILocalVariable(name: "mbs", scope: !630, file: !566, line: 230, type: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !552, line: 6, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !554, line: 21, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 13, size: 64, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !641, file: !554, line: 15, baseType: !100, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !641, file: !554, line: 20, baseType: !645, size: 32, offset: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !554, line: 16, size: 32, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !645, file: !554, line: 18, baseType: !74, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !645, file: !554, line: 19, baseType: !322, size: 32)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !650)
!650 = !{!38, !324}
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "slotvec", scope: !590, file: !566, line: 834, type: !653, isLocal: true, isDefinition: true)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !566, line: 823, size: 128, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !654, file: !566, line: 825, baseType: !136, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !654, file: !566, line: 826, baseType: !128, size: 64, offset: 64)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "nslots", scope: !590, file: !566, line: 832, type: !100, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "slotvec0", scope: !590, file: !566, line: 833, type: !654, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 704, elements: !422)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !666, line: 274, type: !399, isLocal: true, isDefinition: true)
!666 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !666, line: 160, type: !571, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !666, line: 165, type: !53, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !666, line: 169, type: !571, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !666, line: 202, type: !160, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !666, line: 229, type: !16, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !679, line: 67, type: !409, isLocal: true, isDefinition: true)
!679 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !679, line: 69, type: !16, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !679, line: 83, type: !16, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !679, line: 83, type: !322, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !679, line: 85, type: !36, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !679, line: 88, type: !690, isLocal: true, isDefinition: true)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 171)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !679, line: 88, type: !212, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !679, line: 105, type: !170, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !679, line: 109, type: !219, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !679, line: 113, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 28)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !679, line: 120, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !679, line: 127, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 36)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !679, line: 134, type: !207, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !679, line: 142, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 44)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !679, line: 150, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 48)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !679, line: 159, type: !728, isLocal: true, isDefinition: true)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 52)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !679, line: 170, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 60)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !679, line: 248, type: !304, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !679, line: 248, type: !224, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !679, line: 254, type: !304, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !679, line: 254, type: !160, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !679, line: 254, type: !207, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !679, line: 259, type: !3, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !679, line: 259, type: !750, isLocal: true, isDefinition: true)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 29)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !755, file: !756, line: 26, type: !758, isLocal: false, isDefinition: true)
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !757, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!757 = !{!753}
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 376, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 47)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "exit_failure", scope: !763, file: !764, line: 24, type: !766, isLocal: false, isDefinition: true)
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !765, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!765 = !{!761}
!766 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !100)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !769, line: 34, type: !200, isLocal: true, isDefinition: true)
!769 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !769, line: 34, type: !16, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !769, line: 34, type: !359, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !776, line: 108, type: !53, isLocal: true, isDefinition: true)
!776 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "internal_state", scope: !779, file: !776, line: 97, type: !782, isLocal: true, isDefinition: true)
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !776, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !780, globals: !781, splitDebugInlining: false, nameTableKind: None)
!780 = !{!129, !136, !140}
!781 = !{!774, !777}
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !552, line: 6, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !554, line: 21, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !554, line: 13, size: 64, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !784, file: !554, line: 15, baseType: !100, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !784, file: !554, line: 20, baseType: !788, size: 32, offset: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !784, file: !554, line: 16, size: 32, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !788, file: !554, line: 18, baseType: !74, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !788, file: !554, line: 19, baseType: !322, size: 32)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !794, line: 35, type: !36, isLocal: true, isDefinition: true)
!794 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !794, line: 35, type: !190, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !799, line: 202, type: !16, isLocal: true, isDefinition: true)
!799 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !802, file: !799, line: 211, type: !986, isLocal: true, isDefinition: true)
!802 = distinct !DISubprogram(name: "printf_fetchargs", scope: !799, file: !799, line: 42, type: !803, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !977, retainedNodes: !981)
!803 = !DISubroutineType(types: !804)
!804 = !{!100, !805, !815}
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !482, line: 22, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !807, baseType: !808)
!807 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !808, file: !807, baseType: !129, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !808, file: !807, baseType: !129, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !808, file: !807, baseType: !129, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !808, file: !807, baseType: !100, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !808, file: !807, baseType: !100, size: 32, offset: 224)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !817, line: 185, baseType: !818)
!817 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 179, size: 1920, elements: !819)
!819 = !{!820, !821, !975}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !818, file: !817, line: 181, baseType: !136, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !818, file: !817, line: 182, baseType: !822, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !817, line: 174, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 111, size: 256, elements: !825)
!825 = !{!826, !877}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !824, file: !817, line: 113, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !817, line: 108, baseType: !828)
!828 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 47, baseType: !74, size: 32, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876}
!830 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!831 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!832 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!833 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!834 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!835 = !DIEnumerator(name: "TYPE_INT", value: 5)
!836 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!837 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!838 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!839 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!840 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!841 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!842 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!843 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!844 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!845 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!846 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!847 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!848 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!849 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!850 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!851 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!852 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!853 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!854 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!855 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!856 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!857 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!858 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!859 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!860 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!861 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!862 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!863 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!864 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!865 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!866 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!867 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!868 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!869 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!870 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!871 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!872 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!873 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!874 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!875 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!876 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !824, file: !817, line: 172, baseType: !878, size: 128, offset: 128)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !824, file: !817, line: 114, size: 128, elements: !879)
!879 = !{!880, !881, !882, !884, !885, !886, !887, !888, !889, !891, !893, !897, !901, !904, !907, !910, !912, !915, !918, !920, !922, !924, !926, !928, !930, !932, !934, !936, !938, !940, !941, !944, !945, !949, !950, !952, !954, !955, !957, !959, !961, !963, !965, !967, !969, !971, !973}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !878, file: !817, line: 116, baseType: !286, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !878, file: !817, line: 117, baseType: !140, size: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !878, file: !817, line: 118, baseType: !883, size: 16)
!883 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !878, file: !817, line: 119, baseType: !135, size: 16)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !878, file: !817, line: 120, baseType: !100, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !878, file: !817, line: 121, baseType: !74, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !878, file: !817, line: 122, baseType: !156, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !878, file: !817, line: 123, baseType: !134, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !878, file: !817, line: 124, baseType: !890, size: 64)
!890 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !878, file: !817, line: 125, baseType: !892, size: 64)
!892 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !878, file: !817, line: 126, baseType: !894, size: 8)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 24, baseType: !896)
!895 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !133, line: 37, baseType: !286)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !878, file: !817, line: 127, baseType: !898, size: 8)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !899, line: 24, baseType: !900)
!899 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !133, line: 38, baseType: !140)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !878, file: !817, line: 128, baseType: !902, size: 16)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !895, line: 25, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !133, line: 39, baseType: !883)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !878, file: !817, line: 129, baseType: !905, size: 16)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !899, line: 25, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !133, line: 40, baseType: !135)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !878, file: !817, line: 130, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !895, line: 26, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !133, line: 41, baseType: !100)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !878, file: !817, line: 131, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !899, line: 26, baseType: !549)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !878, file: !817, line: 132, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 27, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !133, line: 44, baseType: !156)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !878, file: !817, line: 133, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !899, line: 27, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !133, line: 45, baseType: !134)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !878, file: !817, line: 134, baseType: !919, size: 8)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !131, line: 58, baseType: !286)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !878, file: !817, line: 135, baseType: !921, size: 8)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !131, line: 71, baseType: !140)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !878, file: !817, line: 136, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !131, line: 60, baseType: !156)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !878, file: !817, line: 137, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !131, line: 73, baseType: !134)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !878, file: !817, line: 138, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !131, line: 61, baseType: !156)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !878, file: !817, line: 139, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !131, line: 74, baseType: !134)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !878, file: !817, line: 140, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !131, line: 62, baseType: !156)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !878, file: !817, line: 141, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !131, line: 75, baseType: !134)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !878, file: !817, line: 142, baseType: !935, size: 32)
!935 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !878, file: !817, line: 143, baseType: !937, size: 64)
!937 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !878, file: !817, line: 144, baseType: !939, size: 128)
!939 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !878, file: !817, line: 145, baseType: !100, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !878, file: !817, line: 147, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !943, line: 20, baseType: !74)
!943 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!944 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !878, file: !817, line: 149, baseType: !138, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !878, file: !817, line: 150, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !137, line: 74, baseType: !74)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !878, file: !817, line: 151, baseType: !129, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !878, file: !817, line: 152, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !878, file: !817, line: 153, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !878, file: !817, line: 154, baseType: !442, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !878, file: !817, line: 155, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !878, file: !817, line: 156, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !878, file: !817, line: 157, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !878, file: !817, line: 158, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !878, file: !817, line: 159, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !878, file: !817, line: 160, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !878, file: !817, line: 161, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !878, file: !817, line: 162, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !878, file: !817, line: 163, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !878, file: !817, line: 164, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !818, file: !817, line: 183, baseType: !976, size: 1792, offset: 128)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 1792, elements: !17)
!977 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !978, retainedTypes: !979, globals: !980, splitDebugInlining: false, nameTableKind: None)
!978 = !{!828}
!979 = !{!129}
!980 = !{!797, !800}
!981 = !{!982, !983, !984, !985}
!982 = !DILocalVariable(name: "args", arg: 1, scope: !802, file: !799, line: 42, type: !805)
!983 = !DILocalVariable(name: "a", arg: 2, scope: !802, file: !799, line: 42, type: !815)
!984 = !DILocalVariable(name: "i", scope: !802, file: !799, line: 44, type: !136)
!985 = !DILocalVariable(name: "ap", scope: !802, file: !799, line: 45, type: !822)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 224, elements: !17)
!987 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!988 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!989 = distinct !DICompileUnit(language: DW_LANG_C11, file: !666, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !990, retainedTypes: !991, globals: !992, splitDebugInlining: false, nameTableKind: None)
!990 = !{!119}
!991 = !{!129, !141, !144}
!992 = !{!664, !667, !669, !671, !673, !675}
!993 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !994, retainedTypes: !979, globals: !998, splitDebugInlining: false, nameTableKind: None)
!994 = !{!995}
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !679, line: 40, baseType: !74, size: 32, elements: !996)
!996 = !{!997}
!997 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!998 = !{!677, !680, !682, !684, !686, !688, !693, !695, !697, !699, !704, !709, !714, !716, !721, !726, !731, !736, !738, !740, !742, !744, !746, !748}
!999 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1000, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1001, retainedTypes: !1032, splitDebugInlining: false, nameTableKind: None)
!1000 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1001 = !{!1002, !1014}
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1003, file: !1000, line: 188, baseType: !74, size: 32, elements: !1012)
!1003 = distinct !DISubprogram(name: "x2nrealloc", scope: !1000, file: !1000, line: 176, type: !1004, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !999, retainedNodes: !1007)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!129, !129, !1006, !136}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!1007 = !{!1008, !1009, !1010, !1011}
!1008 = !DILocalVariable(name: "p", arg: 1, scope: !1003, file: !1000, line: 176, type: !129)
!1009 = !DILocalVariable(name: "pn", arg: 2, scope: !1003, file: !1000, line: 176, type: !1006)
!1010 = !DILocalVariable(name: "s", arg: 3, scope: !1003, file: !1000, line: 176, type: !136)
!1011 = !DILocalVariable(name: "n", scope: !1003, file: !1000, line: 178, type: !136)
!1012 = !{!1013}
!1013 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1015, file: !1000, line: 228, baseType: !74, size: 32, elements: !1012)
!1015 = distinct !DISubprogram(name: "xpalloc", scope: !1000, file: !1000, line: 223, type: !1016, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !999, retainedNodes: !1022)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!129, !129, !1018, !1019, !1021, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1020, line: 130, baseType: !1021)
!1020 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !137, line: 35, baseType: !156)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1023 = !DILocalVariable(name: "pa", arg: 1, scope: !1015, file: !1000, line: 223, type: !129)
!1024 = !DILocalVariable(name: "pn", arg: 2, scope: !1015, file: !1000, line: 223, type: !1018)
!1025 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1015, file: !1000, line: 223, type: !1019)
!1026 = !DILocalVariable(name: "n_max", arg: 4, scope: !1015, file: !1000, line: 223, type: !1021)
!1027 = !DILocalVariable(name: "s", arg: 5, scope: !1015, file: !1000, line: 223, type: !1019)
!1028 = !DILocalVariable(name: "n0", scope: !1015, file: !1000, line: 230, type: !1019)
!1029 = !DILocalVariable(name: "n", scope: !1015, file: !1000, line: 237, type: !1019)
!1030 = !DILocalVariable(name: "nbytes", scope: !1015, file: !1000, line: 248, type: !1019)
!1031 = !DILocalVariable(name: "adjusted_nbytes", scope: !1015, file: !1000, line: 252, type: !1019)
!1032 = !{!128, !129, !244, !156, !134}
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1034, splitDebugInlining: false, nameTableKind: None)
!1034 = !{!767, !770, !772}
!1035 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1036 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!1037 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1038, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1039, retainedTypes: !1040, splitDebugInlining: false, nameTableKind: None)
!1038 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!1039 = !{!119, !104}
!1040 = !{!100, !135, !128, !244, !134}
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1042, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1039, retainedTypes: !1043, splitDebugInlining: false, nameTableKind: None)
!1042 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1043 = !{!100, !135, !128, !244, !134, !130}
!1044 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1045, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !979, splitDebugInlining: false, nameTableKind: None)
!1045 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!1046 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1047, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1048 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1049, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1049 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1050 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1051, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !979, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1052 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1053, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !979, splitDebugInlining: false, nameTableKind: None)
!1053 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1054 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1055, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1056, splitDebugInlining: false, nameTableKind: None)
!1055 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!1056 = !{!130}
!1057 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1058, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1059, retainedTypes: !1094, splitDebugInlining: false, nameTableKind: None)
!1058 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!1059 = !{!1060}
!1060 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1061, file: !1058, line: 79, baseType: !74, size: 32, elements: !1092)
!1061 = distinct !DISubprogram(name: "mgetgroups", scope: !1058, file: !1058, line: 66, type: !1062, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1057, retainedNodes: !1066)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!100, !138, !144, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!1066 = !{!1067, !1068, !1069, !1070, !1073, !1074, !1076, !1077, !1078, !1079, !1084, !1085, !1086, !1089, !1090}
!1067 = !DILocalVariable(name: "username", arg: 1, scope: !1061, file: !1058, line: 66, type: !138)
!1068 = !DILocalVariable(name: "gid", arg: 2, scope: !1061, file: !1058, line: 66, type: !144)
!1069 = !DILocalVariable(name: "groups", arg: 3, scope: !1061, file: !1058, line: 66, type: !1064)
!1070 = !DILocalVariable(name: "max_n_groups", scope: !1071, file: !1058, line: 80, type: !100)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !1058, line: 78, column: 5)
!1072 = distinct !DILexicalBlock(scope: !1061, file: !1058, line: 77, column: 7)
!1073 = !DILocalVariable(name: "g", scope: !1071, file: !1058, line: 82, type: !1065)
!1074 = !DILocalVariable(name: "last_n_groups", scope: !1075, file: !1058, line: 88, type: !100)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !1058, line: 87, column: 9)
!1076 = !DILocalVariable(name: "ng", scope: !1075, file: !1058, line: 91, type: !100)
!1077 = !DILocalVariable(name: "h", scope: !1075, file: !1058, line: 98, type: !1065)
!1078 = !DILocalVariable(name: "max_n_groups", scope: !1061, file: !1058, line: 118, type: !100)
!1079 = !DILocalVariable(name: "g", scope: !1080, file: !1058, line: 129, type: !1065)
!1080 = distinct !DILexicalBlock(scope: !1081, file: !1058, line: 128, column: 9)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !1058, line: 127, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !1058, line: 126, column: 5)
!1083 = distinct !DILexicalBlock(scope: !1061, file: !1058, line: 125, column: 7)
!1084 = !DILocalVariable(name: "g", scope: !1061, file: !1058, line: 142, type: !1065)
!1085 = !DILocalVariable(name: "ng", scope: !1061, file: !1058, line: 146, type: !100)
!1086 = !DILocalVariable(name: "first", scope: !1087, file: !1058, line: 183, type: !144)
!1087 = distinct !DILexicalBlock(scope: !1088, file: !1058, line: 182, column: 5)
!1088 = distinct !DILexicalBlock(scope: !1061, file: !1058, line: 181, column: 7)
!1089 = !DILocalVariable(name: "groups_end", scope: !1087, file: !1058, line: 184, type: !1065)
!1090 = !DILocalVariable(name: "next", scope: !1091, file: !1058, line: 186, type: !1065)
!1091 = distinct !DILexicalBlock(scope: !1087, file: !1058, line: 186, column: 7)
!1092 = !{!1093}
!1093 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!1094 = !{!129, !144}
!1095 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1096, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1097, splitDebugInlining: false, nameTableKind: None)
!1096 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1097 = !{!244, !134, !129}
!1098 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1099, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !978, retainedTypes: !1100, splitDebugInlining: false, nameTableKind: None)
!1099 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1100 = !{!128, !136, !129, !138, !74}
!1101 = distinct !DICompileUnit(language: DW_LANG_C11, file: !794, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1102, splitDebugInlining: false, nameTableKind: None)
!1102 = !{!792, !795}
!1103 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1104, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1104 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1105 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1106, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !979, splitDebugInlining: false, nameTableKind: None)
!1106 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1108, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !978, retainedTypes: !1109, splitDebugInlining: false, nameTableKind: None)
!1108 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!1109 = !{!136, !1110, !129, !1165}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !817, line: 174, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !817, line: 111, size: 256, elements: !1113)
!1113 = !{!1114, !1115}
