; ModuleID = 'src/cksum.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.infomap = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.blake2b_state__ = type { [8 x i64], [2 x i64], [2 x i64], [128 x i8], i64, i64, i8 }
%struct.base64_decode_context = type { i32, [4 x i8] }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }
%struct.sha256_ctx = type { [8 x i32], [2 x i32], i64, [32 x i32] }
%struct.sha3_ctx = type { [25 x i64], [144 x i8], i64, i64, i64 }
%struct.sha512_ctx = type { [8 x i64], [2 x i64], i64, [32 x i64] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.lconv = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }

@cksum_algorithm = dso_local local_unnamed_addr global i32 2, align 4, !dbg !0
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !147

!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !179, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !428, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !3, line: 362, type: !433, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !3, line: 363, type: !179, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !433, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !433, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !184, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !3, line: 364, type: !428, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "algorithm_tags", scope: !2, file: !3, line: 360, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 960, elements: !317)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !42, line: 729, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 56)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !42, line: 736, type: !259, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !473, file: !42, line: 575, type: !43, isLocal: true, isDefinition: true)
!473 = distinct !DISubprogram(name: "oputs_", scope: !42, file: !42, line: 573, type: !474, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !476)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !142, !142}
!476 = !{!477, !478, !479, !482, !483, !484, !485, !489, !490, !491, !492, !494, !545, !546, !547, !549, !550}
!477 = !DILocalVariable(name: "program", arg: 1, scope: !473, file: !42, line: 573, type: !142)
!478 = !DILocalVariable(name: "option", arg: 2, scope: !473, file: !42, line: 573, type: !142)
!479 = !DILocalVariable(name: "term", scope: !480, file: !42, line: 585, type: !142)
!480 = distinct !DILexicalBlock(scope: !481, file: !42, line: 582, column: 5)
!481 = distinct !DILexicalBlock(scope: !473, file: !42, line: 581, column: 7)
!482 = !DILocalVariable(name: "double_space", scope: !473, file: !42, line: 594, type: !411)
!483 = !DILocalVariable(name: "first_word", scope: !473, file: !42, line: 595, type: !142)
!484 = !DILocalVariable(name: "option_text", scope: !473, file: !42, line: 596, type: !142)
!485 = !DILocalVariable(name: "s", scope: !486, file: !42, line: 608, type: !142)
!486 = distinct !DILexicalBlock(scope: !487, file: !42, line: 605, column: 5)
!487 = distinct !DILexicalBlock(scope: !488, file: !42, line: 604, column: 12)
!488 = distinct !DILexicalBlock(scope: !473, file: !42, line: 597, column: 7)
!489 = !DILocalVariable(name: "spaces", scope: !486, file: !42, line: 609, type: !140)
!490 = !DILocalVariable(name: "anchor_len", scope: !473, file: !42, line: 620, type: !140)
!491 = !DILocalVariable(name: "desc_text", scope: !473, file: !42, line: 625, type: !142)
!492 = !DILocalVariable(name: "__ptr", scope: !493, file: !42, line: 644, type: !142)
!493 = distinct !DILexicalBlock(scope: !473, file: !42, line: 644, column: 3)
!494 = !DILocalVariable(name: "__stream", scope: !493, file: !42, line: 644, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !497, line: 7, baseType: !498)
!497 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !499, line: 49, size: 1728, elements: !500)
!499 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !516, !518, !519, !520, !522, !523, !525, !526, !529, !531, !534, !537, !538, !539, !540, !541}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !498, file: !499, line: 51, baseType: !43, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !498, file: !499, line: 54, baseType: !136, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !498, file: !499, line: 55, baseType: !136, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !498, file: !499, line: 56, baseType: !136, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !498, file: !499, line: 57, baseType: !136, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !498, file: !499, line: 58, baseType: !136, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !498, file: !499, line: 59, baseType: !136, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !498, file: !499, line: 60, baseType: !136, size: 64, offset: 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !498, file: !499, line: 61, baseType: !136, size: 64, offset: 512)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !498, file: !499, line: 64, baseType: !136, size: 64, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !498, file: !499, line: 65, baseType: !136, size: 64, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !498, file: !499, line: 66, baseType: !136, size: 64, offset: 704)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !498, file: !499, line: 68, baseType: !514, size: 64, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !499, line: 36, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !498, file: !499, line: 70, baseType: !517, size: 64, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !498, file: !499, line: 72, baseType: !43, size: 32, offset: 896)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !498, file: !499, line: 73, baseType: !43, size: 32, offset: 928)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !498, file: !499, line: 74, baseType: !521, size: 64, offset: 960)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !417)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !498, file: !499, line: 77, baseType: !139, size: 16, offset: 1024)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !498, file: !499, line: 78, baseType: !524, size: 8, offset: 1040)
!524 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !498, file: !499, line: 79, baseType: !295, size: 8, offset: 1048)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !498, file: !499, line: 81, baseType: !527, size: 64, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !499, line: 43, baseType: null)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !498, file: !499, line: 89, baseType: !530, size: 64, offset: 1152)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !417)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !498, file: !499, line: 91, baseType: !532, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !499, line: 37, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !498, file: !499, line: 92, baseType: !535, size: 64, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !499, line: 38, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !498, file: !499, line: 93, baseType: !517, size: 64, offset: 1344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !498, file: !499, line: 94, baseType: !138, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !498, file: !499, line: 95, baseType: !140, size: 64, offset: 1472)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !498, file: !499, line: 96, baseType: !43, size: 32, offset: 1536)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !498, file: !499, line: 98, baseType: !542, size: 160, offset: 1568)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 20)
!545 = !DILocalVariable(name: "__cnt", scope: !493, file: !42, line: 644, type: !140)
!546 = !DILocalVariable(name: "url_program", scope: !473, file: !42, line: 648, type: !142)
!547 = !DILocalVariable(name: "__ptr", scope: !548, file: !42, line: 686, type: !142)
!548 = distinct !DILexicalBlock(scope: !473, file: !42, line: 686, column: 3)
!549 = !DILocalVariable(name: "__stream", scope: !548, file: !42, line: 686, type: !495)
!550 = !DILocalVariable(name: "__cnt", scope: !548, file: !42, line: 686, type: !140)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !42, line: 585, type: !433, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !42, line: 586, type: !433, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !42, line: 595, type: !428, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !42, line: 620, type: !174, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !399, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !42, line: 648, type: !433, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !428, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !42, line: 649, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 24, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 3)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !42, line: 650, type: !433, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !42, line: 651, type: !174, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !42, line: 663, type: !179, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !42, line: 664, type: !189, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 136, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 17)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !42, line: 669, type: !164, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !316, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !42, line: 676, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 488, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 61)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !42, line: 679, type: !567, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !42, line: 683, type: !433, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !42, line: 688, type: !433, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !42, line: 691, type: !184, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !42, line: 839, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 16)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !42, line: 840, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 176, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 22)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !42, line: 841, type: !316, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !42, line: 862, type: !428, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !42, line: 868, type: !249, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !42, line: 875, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 216, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 27)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !239, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !42, line: 877, type: !311, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !3, line: 456, type: !179, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !3, line: 460, type: !174, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !3, line: 461, type: !316, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !3, line: 462, type: !174, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !3, line: 463, type: !179, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !3, line: 464, type: !433, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !3, line: 465, type: !179, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !3, line: 466, type: !428, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !3, line: 467, type: !433, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !3, line: 470, type: !189, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !3, line: 471, type: !179, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !3, line: 472, type: !174, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !3, line: 473, type: !428, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !3, line: 474, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 72, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 9)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !3, line: 476, type: !179, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !3, line: 477, type: !433, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !3, line: 483, type: !433, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !3, line: 484, type: !184, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 453, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 4864, elements: !346)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !669, line: 50, size: 256, elements: !670)
!669 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!670 = !{!671, !672, !673, !675}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !668, file: !669, line: 52, baseType: !142, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !668, file: !669, line: 55, baseType: !43, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !668, file: !669, line: 56, baseType: !674, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !668, file: !669, line: 57, baseType: !43, size: 32, offset: 192)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "algorithm_specified", scope: !2, file: !3, line: 375, type: !411, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "legacy_long_options", scope: !2, file: !3, line: 433, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 3328, elements: !331)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "algorithm_types", scope: !2, file: !3, line: 352, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 448, elements: !322)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !433, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !179, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !428, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !3, line: 348, type: !433, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !179, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !433, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !433, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !184, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !3, line: 350, type: !428, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "algorithm_args", scope: !2, file: !3, line: 346, type: !462, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "status_only", scope: !2, file: !3, line: 204, type: !411, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "warn", scope: !2, file: !3, line: 208, type: !411, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "quiet", scope: !2, file: !3, line: 214, type: !411, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "ignore_missing", scope: !2, file: !3, line: 211, type: !411, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "strict", scope: !2, file: !3, line: 218, type: !411, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "base64_digest", scope: !2, file: !3, line: 228, type: !411, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "raw_digest", scope: !2, file: !3, line: 232, type: !411, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "digest_delim", scope: !2, file: !3, line: 224, type: !144, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "algorithm_bits", scope: !2, file: !3, line: 366, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 480, elements: !317)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1390, type: !399, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1393, type: !567, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1410, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 224, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 28)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1440, type: !746, isLocal: true, isDefinition: true)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 376, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 47)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !184, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1461, type: !542, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !174, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1490, type: !179, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1492, type: !567, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1512, type: !316, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1520, type: !746, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !358, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1528, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 352, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 44)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !772, isLocal: true, isDefinition: true)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 344, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 43)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1536, type: !767, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !210, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1544, type: !394, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1552, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 200, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 25)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "max_tag_len", scope: !788, file: !3, line: 872, type: !414, isLocal: true, isDefinition: true)
!788 = distinct !DISubprogram(name: "algorithm_from_tag", scope: !3, file: !3, line: 869, type: !789, scopeLine: 870, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !791)
!789 = !DISubroutineType(types: !790)
!790 = !{!416, !136}
!791 = !{!792, !793, !797, !799, !800, !801}
!792 = !DILocalVariable(name: "s", arg: 1, scope: !788, file: !3, line: 869, type: !136)
!793 = !DILocalVariable(name: "tag", scope: !794, file: !3, line: 875, type: !796)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 874, column: 5)
!795 = distinct !DILexicalBlock(scope: !788, file: !3, line: 873, column: 7)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!797 = !DILocalVariable(name: "tag_len", scope: !798, file: !3, line: 878, type: !414)
!798 = distinct !DILexicalBlock(scope: !794, file: !3, line: 877, column: 9)
!799 = !DILocalVariable(name: "i", scope: !788, file: !3, line: 883, type: !414)
!800 = !DILocalVariable(name: "sep", scope: !788, file: !3, line: 894, type: !137)
!801 = !DILocalVariable(name: "algo", scope: !788, file: !3, line: 896, type: !416)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "bsd_reversed", scope: !2, file: !3, line: 221, type: !43, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "bin2hex", scope: !806, file: !3, line: 1345, type: !816, isLocal: true, isDefinition: true)
!806 = distinct !DISubprogram(name: "hex_equal", scope: !3, file: !3, line: 1343, type: !807, scopeLine: 1344, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !811)
!807 = !DISubroutineType(types: !808)
!808 = !{!411, !809, !809}
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!811 = !{!812, !813, !814, !815}
!812 = !DILocalVariable(name: "hex_digest", arg: 1, scope: !806, file: !3, line: 1343, type: !809)
!813 = !DILocalVariable(name: "bin_buffer", arg: 2, scope: !806, file: !3, line: 1343, type: !809)
!814 = !DILocalVariable(name: "digest_bin_bytes", scope: !806, file: !3, line: 1349, type: !414)
!815 = !DILocalVariable(name: "cnt", scope: !806, file: !3, line: 1353, type: !414)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !603)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !42, line: 952, type: !311, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "cksumfns", scope: !2, file: !3, line: 379, type: !821, isLocal: true, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 896, elements: !322)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "sumfn", file: !823, line: 7, baseType: !824)
!823 = !DIFile(filename: "src/sum.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2ed342d241758aca45506716532534b4")
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!43, !495, !138, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !104, line: 101, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !106, line: 72, baseType: !417)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !399, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !311, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !3, line: 315, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 384, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 48)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !3, line: 332, type: !836, isLocal: true, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "cksum_output_fns", scope: !2, file: !3, line: 396, type: !843, isLocal: true, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 896, elements: !322)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "digest_output_fn", file: !3, line: 244, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !142, !43, !134, !411, !411, !144, !411, !828}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1276, type: !174, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1285, type: !428, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1292, type: !567, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1294, type: !433, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1309, type: !433, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !3, line: 717, type: !428, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1152, type: !567, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1156, type: !567, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !3, line: 1160, type: !567, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!867 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!868 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!869 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!870 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!871 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!872 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!873 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!874 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!875 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!876 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!877 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 7, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "blake2b_IV", scope: !880, file: !881, line: 27, type: !918, isLocal: true, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C11, file: !881, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !882, retainedTypes: !891, globals: !899, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "src/blake2/blake2b-ref.c", directory: "/src", checksumkind: CSK_MD5, checksum: "28d09caefc730ba5ec0593f4ff5ef776")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "blake2b_constant", file: !884, line: 42, baseType: !7, size: 32, elements: !885)
!884 = !DIFile(filename: "src/blake2/blake2.h", directory: "/src", checksumkind: CSK_MD5, checksum: "98dc573ce8fd1dd56441f8e485f7bd5e")
!885 = !{!886, !887, !888, !889, !890}
!886 = !DIEnumerator(name: "BLAKE2B_BLOCKBYTES", value: 128)
!887 = !DIEnumerator(name: "BLAKE2B_OUTBYTES", value: 64)
!888 = !DIEnumerator(name: "BLAKE2B_KEYBYTES", value: 64)
!889 = !DIEnumerator(name: "BLAKE2B_SALTBYTES", value: 16)
!890 = !DIEnumerator(name: "BLAKE2B_PERSONALBYTES", value: 16)
!891 = !{!892, !894, !809, !138, !897}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 24, baseType: !896)
!895 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !106, line: 38, baseType: !144)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 27, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !106, line: 45, baseType: !102)
!899 = !{!878, !900, !914}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "memset_v", scope: !902, file: !903, line: 161, type: !909, isLocal: true, isDefinition: true)
!902 = distinct !DISubprogram(name: "secure_zero_memory", scope: !903, file: !903, line: 159, type: !904, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !880, retainedNodes: !906)
!903 = !DIFile(filename: "src/blake2/blake2-impl.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8e1e523af54e01275d11e95a252b1371")
!904 = !DISubroutineType(types: !905)
!905 = !{null, !138, !140}
!906 = !{!907, !908}
!907 = !DILocalVariable(name: "v", arg: 1, scope: !902, file: !903, line: 159, type: !138)
!908 = !DILocalVariable(name: "n", arg: 2, scope: !902, file: !903, line: 159, type: !140)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!138, !138, !43, !140}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "blake2b_sigma", scope: !880, file: !881, line: 35, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 1536, elements: !917)
!917 = !{!313, !604}
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 512, elements: !185)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !922, line: 199, type: !653, isLocal: true, isDefinition: true)
!922 = !DIFile(filename: "src/sum.c", directory: "/src", checksumkind: CSK_MD5, checksum: "984061a05cf8100a66387ffa345dea00")
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !922, line: 202, type: !428, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !922, line: 224, type: !174, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "cksum_fp", scope: !929, file: !930, line: 287, type: !1031, isLocal: true, isDefinition: true)
!929 = distinct !DISubprogram(name: "crc_sum_stream", scope: !930, file: !930, line: 282, type: !931, scopeLine: 283, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !967, retainedNodes: !1023)
!930 = !DIFile(filename: "src/cksum_crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6cd2e7250e6ce2490cff53f0738655c9")
!931 = !DISubroutineType(types: !932)
!932 = !{!43, !933, !138, !827}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !497, line: 7, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !499, line: 49, size: 1728, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !935, file: !499, line: 51, baseType: !43, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !935, file: !499, line: 54, baseType: !136, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !935, file: !499, line: 55, baseType: !136, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !935, file: !499, line: 56, baseType: !136, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !935, file: !499, line: 57, baseType: !136, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !935, file: !499, line: 58, baseType: !136, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !935, file: !499, line: 59, baseType: !136, size: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !935, file: !499, line: 60, baseType: !136, size: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !935, file: !499, line: 61, baseType: !136, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !935, file: !499, line: 64, baseType: !136, size: 64, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !935, file: !499, line: 65, baseType: !136, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !935, file: !499, line: 66, baseType: !136, size: 64, offset: 704)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !935, file: !499, line: 68, baseType: !514, size: 64, offset: 768)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !935, file: !499, line: 70, baseType: !951, size: 64, offset: 832)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !935, file: !499, line: 72, baseType: !43, size: 32, offset: 896)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !935, file: !499, line: 73, baseType: !43, size: 32, offset: 928)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !935, file: !499, line: 74, baseType: !521, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !935, file: !499, line: 77, baseType: !139, size: 16, offset: 1024)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !935, file: !499, line: 78, baseType: !524, size: 8, offset: 1040)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !935, file: !499, line: 79, baseType: !295, size: 8, offset: 1048)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !935, file: !499, line: 81, baseType: !527, size: 64, offset: 1088)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !935, file: !499, line: 89, baseType: !530, size: 64, offset: 1152)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !935, file: !499, line: 91, baseType: !532, size: 64, offset: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !935, file: !499, line: 92, baseType: !535, size: 64, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !935, file: !499, line: 93, baseType: !951, size: 64, offset: 1344)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !935, file: !499, line: 94, baseType: !138, size: 64, offset: 1408)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !935, file: !499, line: 95, baseType: !140, size: 64, offset: 1472)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !935, file: !499, line: 96, baseType: !43, size: 32, offset: 1536)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !935, file: !499, line: 98, baseType: !542, size: 160, offset: 1568)
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !930, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !968, globals: !973, splitDebugInlining: false, nameTableKind: None)
!968 = !{!411, !142, !969, !140, !972, !145, !144}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 26, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !106, line: 42, baseType: !7)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!973 = !{!927, !974, !976, !978, !980, !982, !987, !989, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1008, !1013, !1015, !1017, !1019, !1021}
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(scope: null, file: !930, line: 371, type: !179, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !930, line: 373, type: !428, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(scope: null, file: !930, line: 211, type: !174, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !930, line: 214, type: !567, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !930, line: 214, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 232, elements: !985)
!985 = !{!986}
!986 = !DISubrange(count: 29)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !930, line: 214, type: !618, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !991, line: 68, type: !428, isLocal: true, isDefinition: true)
!991 = !DIFile(filename: "./lib/cpu-supports.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9be339edc1bd703a3f96b2a763524c18")
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !991, line: 68, type: !433, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !991, line: 69, type: !433, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !991, line: 69, type: !174, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !991, line: 70, type: !653, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !991, line: 70, type: !189, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !991, line: 71, type: !184, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !991, line: 71, type: !653, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !991, line: 72, type: !179, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !991, line: 72, type: !1010, isLocal: true, isDefinition: true)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 88, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 11)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !991, line: 73, type: !1010, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !991, line: 73, type: !311, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !991, line: 75, type: !174, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !991, line: 75, type: !179, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !991, line: 76, type: !179, isLocal: true, isDefinition: true)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1030}
!1024 = !DILocalVariable(name: "stream", arg: 1, scope: !929, file: !930, line: 282, type: !933)
!1025 = !DILocalVariable(name: "resstream", arg: 2, scope: !929, file: !930, line: 282, type: !138)
!1026 = !DILocalVariable(name: "length", arg: 3, scope: !929, file: !930, line: 282, type: !827)
!1027 = !DILocalVariable(name: "total_bytes", scope: !929, file: !930, line: 284, type: !828)
!1028 = !DILocalVariable(name: "crc", scope: !929, file: !930, line: 285, type: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !104, line: 74, baseType: !102)
!1030 = !DILocalVariable(name: "crc_out", scope: !929, file: !930, line: 308, type: !7)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "cksum_fp_t", file: !930, line: 140, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!411, !933, !1035, !827}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1038, line: 3, type: !316, isLocal: true, isDefinition: true)
!1038 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "Version", scope: !1041, file: !1038, line: 3, type: !142, isLocal: false, isDefinition: true)
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1038, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1042, splitDebugInlining: false, nameTableKind: None)
!1042 = !{!1036, !1039}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1045, file: !1046, line: 65, type: !1065, isLocal: false, isDefinition: true)
!1045 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, retainedTypes: !1048, globals: !1049, splitDebugInlining: false, nameTableKind: None)
!1046 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1047 = !{!76}
!1048 = !{!138, !142, !144}
!1049 = !{!1043, !1050, !1052, !1054, !1056, !1061, !1063}
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 141, type: !179, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 141, type: !618, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 142, type: !984, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 160, type: !1058, isLocal: true, isDefinition: true)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 168, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 21)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 165, type: !184, isLocal: true, isDefinition: true)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1046, line: 170, type: !433, isLocal: true, isDefinition: true)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1066, line: 69, baseType: !1067)
!1066 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null}
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "base64_to_int", scope: !1072, file: !1073, line: 243, type: !1079, isLocal: false, isDefinition: true)
!1072 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1073, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1074, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!1073 = !DIFile(filename: "lib/base64.c", directory: "/src", checksumkind: CSK_MD5, checksum: "de7b87ba8809e6c9b8f3253a3b932105")
!1074 = !{!411, !417, !102, !138, !136}
!1075 = !{!1070, !1076}
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "b64c", scope: !1072, file: !1073, line: 62, type: !1078, isLocal: true, isDefinition: true)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !223)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 2048, elements: !1081)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!1081 = !{!1082}
!1082 = !DISubrange(count: 256)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "file_name", scope: !1085, file: !1086, line: 45, type: !142, isLocal: true, isDefinition: true)
!1085 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1086, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1087, splitDebugInlining: false, nameTableKind: None)
!1086 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1087 = !{!1088, !1090, !1092, !1094, !1083, !1096}
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 121, type: !179, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 121, type: !311, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 123, type: !179, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !1086, line: 126, type: !567, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1085, file: !1086, line: 55, type: !411, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "hwcap_allowed_nocache", scope: !1100, file: !1101, line: 25, type: !411, isLocal: false, isDefinition: true)
!1100 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1101, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1102, splitDebugInlining: false, nameTableKind: None)
!1101 = !DIFile(filename: "lib/cpu-supports.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1cfb7defd45e479d991a5a87d626d869")
!1102 = !{!1098, !1103, !1118, !1120, !1125}
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "hwcaps", scope: !1105, file: !1101, line: 45, type: !142, isLocal: true, isDefinition: true)
!1105 = distinct !DISubprogram(name: "hwcap_allowed", scope: !1101, file: !1101, line: 28, type: !1106, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1100, retainedNodes: !1108)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!411, !142}
!1108 = !{!1109, !1110, !1115, !1116, !1117}
!1109 = !DILocalVariable(name: "glibc_hwcap", arg: 1, scope: !1105, file: !1101, line: 28, type: !142)
!1110 = !DILocalVariable(name: "tunables_start", scope: !1111, file: !1101, line: 50, type: !142)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !1101, line: 49, column: 9)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !1101, line: 48, column: 11)
!1113 = distinct !DILexicalBlock(scope: !1114, file: !1101, line: 47, column: 5)
!1114 = distinct !DILexicalBlock(scope: !1105, file: !1101, line: 46, column: 7)
!1115 = !DILocalVariable(name: "last_hwcaps", scope: !1111, file: !1101, line: 51, type: !142)
!1116 = !DILocalVariable(name: "sentinel", scope: !1105, file: !1101, line: 67, type: !142)
!1117 = !DILocalVariable(name: "cap", scope: !1105, file: !1101, line: 70, type: !142)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1101, line: 48, type: !316, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1101, line: 52, type: !1122, isLocal: true, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 144, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 18)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(scope: null, file: !1101, line: 55, type: !295, isLocal: true, isDefinition: true)
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "crc32_sliceby8_table", scope: !1129, file: !1132, line: 19, type: !1133, isLocal: true, isDefinition: true)
!1129 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1130, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1131, splitDebugInlining: false, nameTableKind: None)
!1130 = !DIFile(filename: "lib/crc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b660508727a09332fc61bae8755ce0d9")
!1131 = !{!1127}
!1132 = !DIFile(filename: "./lib/crc-sliceby8.h", directory: "/src", checksumkind: CSK_MD5, checksum: "75ea92a6339c8e06d620d2f884dd622b")
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 65536, elements: !1135)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1135 = !{!186, !1082}
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1138, file: !1139, line: 60, type: !1143, isLocal: true, isDefinition: true)
!1138 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1139, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1140, globals: !1142, splitDebugInlining: false, nameTableKind: None)
!1139 = !DIFile(filename: "lib/md5.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9a1fce7e7c2db2e106b191e5deaa23a2")
!1140 = !{!136, !142, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !104, line: 90, baseType: !102)
!1142 = !{!1136}
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 512, elements: !223)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1146, file: !1147, line: 46, type: !1143, isLocal: true, isDefinition: true)
!1146 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1147, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1148, globals: !1149, splitDebugInlining: false, nameTableKind: None)
!1147 = !DIFile(filename: "lib/sha1.c", directory: "/src", checksumkind: CSK_MD5, checksum: "15f6407463c5c629a55eef1090757600")
!1148 = !{!136, !142, !1141, !970}
!1149 = !{!1144}
!1150 = !DIGlobalVariableExpression(var: !1151, expr: !DIExpression())
!1151 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1152, file: !1153, line: 45, type: !1143, isLocal: true, isDefinition: true)
!1152 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1153, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1140, globals: !1154, splitDebugInlining: false, nameTableKind: None)
!1153 = !DIFile(filename: "lib/sha256.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4bf00364acac5809a530ebfdf8076fa4")
!1154 = !{!1150, !1155}
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "sha256_round_constants", scope: !1152, file: !1153, line: 268, type: !1157, isLocal: true, isDefinition: true)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 2048, elements: !223)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "rc", scope: !1160, file: !1161, line: 37, type: !1177, isLocal: true, isDefinition: true)
!1160 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1161, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1162, retainedTypes: !1175, globals: !1176, splitDebugInlining: false, nameTableKind: None)
!1161 = !DIFile(filename: "lib/sha3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1fc4d6dcd92fa883821ca1644332995f")
!1162 = !{!120, !1163, !124, !1166, !127, !1169, !130, !1172}
!1163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 45, baseType: !7, size: 32, elements: !1164)
!1164 = !{!1165}
!1165 = !DIEnumerator(name: "SHA3_224_BLOCK_SIZE", value: 144)
!1166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 46, baseType: !7, size: 32, elements: !1167)
!1167 = !{!1168}
!1168 = !DIEnumerator(name: "SHA3_256_BLOCK_SIZE", value: 136)
!1169 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 47, baseType: !7, size: 32, elements: !1170)
!1170 = !{!1171}
!1171 = !DIEnumerator(name: "SHA3_384_BLOCK_SIZE", value: 104)
!1172 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !121, line: 48, baseType: !7, size: 32, elements: !1173)
!1173 = !{!1174}
!1174 = !DIEnumerator(name: "SHA3_512_BLOCK_SIZE", value: 72)
!1175 = !{!970}
!1176 = !{!1158}
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 1536, elements: !303)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !1180, line: 48, baseType: !897)
!1180 = !DIFile(filename: "./lib/u64.h", directory: "/src", checksumkind: CSK_MD5, checksum: "748affdcb7c6d173090c334d88398f00")
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1183, file: !1184, line: 45, type: !1192, isLocal: true, isDefinition: true)
!1183 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1184, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1185, globals: !1186, splitDebugInlining: false, nameTableKind: None)
!1184 = !DIFile(filename: "lib/sha512.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b40e2f4ee4a922821a4d571a1e99a94")
!1185 = !{!1179, !136, !142, !1141}
!1186 = !{!1181, !1187}
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(name: "sha512_round_constants", scope: !1183, file: !1184, line: 269, type: !1189, isLocal: true, isDefinition: true)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 5120, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 80)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 1024, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 128)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(name: "fillbuf", scope: !1197, file: !1198, line: 58, type: !1143, isLocal: true, isDefinition: true)
!1197 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1198, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1140, globals: !1199, splitDebugInlining: false, nameTableKind: None)
!1198 = !DIFile(filename: "lib/sm3.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1f78229a09b95249964fab4e8aefe8f9")
!1199 = !{!1195, !1200}
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "sm3_round_constants", scope: !1197, file: !1198, line: 232, type: !1157, isLocal: true, isDefinition: true)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1204, file: !1205, line: 66, type: !1067, isLocal: false, isDefinition: true)
!1204 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1205, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1206, globals: !1207, splitDebugInlining: false, nameTableKind: None)
!1205 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1206 = !{!138, !144}
!1207 = !{!1208, !1210, !1235, !1237, !1239, !1241, !1202, !1243, !1245, !1247, !1249, !1251}
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 272, type: !433, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1212, file: !1205, line: 304, type: !142, isLocal: true, isDefinition: true)
!1212 = distinct !DISubprogram(name: "verror_at_line", scope: !1205, file: !1205, line: 298, type: !1213, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1204, retainedNodes: !1228)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{null, !43, !43, !142, !7, !142, !1215}
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1216, line: 52, baseType: !1217)
!1216 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1218, line: 14, baseType: !1219)
!1218 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1220, baseType: !1221)
!1220 = !DIFile(filename: "lib/error.c", directory: "/src")
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1221, file: !1220, baseType: !138, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1221, file: !1220, baseType: !138, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1221, file: !1220, baseType: !138, size: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1221, file: !1220, baseType: !43, size: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1221, file: !1220, baseType: !43, size: 32, offset: 224)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234}
!1229 = !DILocalVariable(name: "status", arg: 1, scope: !1212, file: !1205, line: 298, type: !43)
!1230 = !DILocalVariable(name: "errnum", arg: 2, scope: !1212, file: !1205, line: 298, type: !43)
!1231 = !DILocalVariable(name: "file_name", arg: 3, scope: !1212, file: !1205, line: 298, type: !142)
!1232 = !DILocalVariable(name: "line_number", arg: 4, scope: !1212, file: !1205, line: 298, type: !7)
!1233 = !DILocalVariable(name: "message", arg: 5, scope: !1212, file: !1205, line: 298, type: !142)
!1234 = !DILocalVariable(name: "args", arg: 6, scope: !1212, file: !1205, line: 298, type: !1215)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1212, file: !1205, line: 305, type: !7, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 338, type: !428, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 346, type: !184, isLocal: true, isDefinition: true)
!1241 = !DIGlobalVariableExpression(var: !1242, expr: !DIExpression())
!1242 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 346, type: !399, isLocal: true, isDefinition: true)
!1243 = !DIGlobalVariableExpression(var: !1244, expr: !DIExpression())
!1244 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1204, file: !1205, line: 69, type: !7, isLocal: false, isDefinition: true)
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1204, file: !1205, line: 295, type: !43, isLocal: false, isDefinition: true)
!1247 = !DIGlobalVariableExpression(var: !1248, expr: !DIExpression())
!1248 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 208, type: !179, isLocal: true, isDefinition: true)
!1249 = !DIGlobalVariableExpression(var: !1250, expr: !DIExpression())
!1250 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 208, type: !1058, isLocal: true, isDefinition: true)
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1205, line: 214, type: !433, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 161, type: !399, isLocal: true, isDefinition: true)
!1255 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 163, type: !295, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 233, type: !174, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 251, type: !174, isLocal: true, isDefinition: true)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(name: "power_letter", scope: !1264, file: !1255, line: 36, type: !1299, isLocal: true, isDefinition: true)
!1264 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1255, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1265, retainedTypes: !1279, globals: !1280, splitDebugInlining: false, nameTableKind: None)
!1265 = !{!1266, !90}
!1266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1267, line: 47, baseType: !7, size: 32, elements: !1268)
!1267 = !DIFile(filename: "./lib/human.h", directory: "/src", checksumkind: CSK_MD5, checksum: "54b947176626bd627e1f54ed62821590")
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1269 = !DIEnumerator(name: "human_ceiling", value: 0)
!1270 = !DIEnumerator(name: "human_round_to_nearest", value: 1)
!1271 = !DIEnumerator(name: "human_floor", value: 2)
!1272 = !DIEnumerator(name: "human_group_digits", value: 4)
!1273 = !DIEnumerator(name: "human_suppress_point_zero", value: 8)
!1274 = !DIEnumerator(name: "human_autoscale", value: 16)
!1275 = !DIEnumerator(name: "human_base_1024", value: 32)
!1276 = !DIEnumerator(name: "human_space_before_unit", value: 64)
!1277 = !DIEnumerator(name: "human_SI", value: 128)
!1278 = !DIEnumerator(name: "human_B", value: 256)
!1279 = !{!134}
!1280 = !{!1253, !1256, !1258, !1260, !1262, !1281, !1283, !1285, !1287, !1289, !1291, !1294, !1297}
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 417, type: !1010, isLocal: true, isDefinition: true)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 418, type: !189, isLocal: true, isDefinition: true)
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 438, type: !1122, isLocal: true, isDefinition: true)
!1287 = !DIGlobalVariableExpression(var: !1288, expr: !DIExpression())
!1288 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 398, type: !316, isLocal: true, isDefinition: true)
!1289 = !DIGlobalVariableExpression(var: !1290, expr: !DIExpression())
!1290 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 398, type: !567, isLocal: true, isDefinition: true)
!1291 = !DIGlobalVariableExpression(var: !1292, expr: !DIExpression())
!1292 = distinct !DIGlobalVariable(name: "block_size_args", scope: !1264, file: !1255, line: 398, type: !1293, isLocal: true, isDefinition: true)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 192, elements: !568)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !1264, file: !1255, line: 399, type: !1296, isLocal: true, isDefinition: true)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 64, elements: !400)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 408, type: !602, isLocal: true, isDefinition: true)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 88, elements: !1011)
!1300 = !DIGlobalVariableExpression(var: !1301, expr: !DIExpression())
!1301 = distinct !DIGlobalVariable(name: "program_name", scope: !1302, file: !1303, line: 31, type: !142, isLocal: false, isDefinition: true)
!1302 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1303, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1304, globals: !1305, splitDebugInlining: false, nameTableKind: None)
!1303 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1304 = !{!136}
!1305 = !{!1300, !1306, !1308}
!1306 = !DIGlobalVariableExpression(var: !1307, expr: !DIExpression())
!1307 = distinct !DIGlobalVariable(scope: null, file: !1303, line: 46, type: !184, isLocal: true, isDefinition: true)
!1308 = !DIGlobalVariableExpression(var: !1309, expr: !DIExpression())
!1309 = distinct !DIGlobalVariable(scope: null, file: !1303, line: 49, type: !428, isLocal: true, isDefinition: true)
!1310 = !DIGlobalVariableExpression(var: !1311, expr: !DIExpression())
!1311 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1312, file: !1313, line: 46, type: !1339, isLocal: true, isDefinition: true)
!1312 = distinct !DISubprogram(name: "proper_name_lite", scope: !1313, file: !1313, line: 38, type: !1314, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1316, retainedNodes: !1318)
!1313 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!142, !142, !142}
!1316 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1317, splitDebugInlining: false, nameTableKind: None)
!1317 = !{!1310}
!1318 = !{!1319, !1320, !1321, !1322, !1326}
!1319 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1312, file: !1313, line: 38, type: !142)
!1320 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1312, file: !1313, line: 38, type: !142)
!1321 = !DILocalVariable(name: "translation", scope: !1312, file: !1313, line: 40, type: !142)
!1322 = !DILocalVariable(name: "w", scope: !1312, file: !1313, line: 47, type: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1324, line: 37, baseType: !1325)
!1324 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !106, line: 57, baseType: !971)
!1326 = !DILocalVariable(name: "mbs", scope: !1312, file: !1313, line: 48, type: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1328, line: 6, baseType: !1329)
!1328 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1330, line: 21, baseType: !1331)
!1330 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1330, line: 13, size: 64, elements: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1331, file: !1330, line: 15, baseType: !43, size: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1331, file: !1330, line: 20, baseType: !1335, size: 32, offset: 32)
!1335 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1331, file: !1330, line: 16, size: 32, elements: !1336)
!1336 = !{!1337, !1338}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1335, file: !1330, line: 18, baseType: !7, size: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1335, file: !1330, line: 19, baseType: !428, size: 32)
!1339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16, elements: !400)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 78, type: !184, isLocal: true, isDefinition: true)
!1342 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1343 = !DIGlobalVariableExpression(var: !1344, expr: !DIExpression())
!1344 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 79, type: !174, isLocal: true, isDefinition: true)
!1345 = !DIGlobalVariableExpression(var: !1346, expr: !DIExpression())
!1346 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 80, type: !330, isLocal: true, isDefinition: true)
!1347 = !DIGlobalVariableExpression(var: !1348, expr: !DIExpression())
!1348 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 81, type: !330, isLocal: true, isDefinition: true)
!1349 = !DIGlobalVariableExpression(var: !1350, expr: !DIExpression())
!1350 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 82, type: !542, isLocal: true, isDefinition: true)
!1351 = !DIGlobalVariableExpression(var: !1352, expr: !DIExpression())
!1352 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 83, type: !399, isLocal: true, isDefinition: true)
!1353 = !DIGlobalVariableExpression(var: !1354, expr: !DIExpression())
!1354 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 84, type: !184, isLocal: true, isDefinition: true)
!1355 = !DIGlobalVariableExpression(var: !1356, expr: !DIExpression())
!1356 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 85, type: !179, isLocal: true, isDefinition: true)
!1357 = !DIGlobalVariableExpression(var: !1358, expr: !DIExpression())
!1358 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 86, type: !179, isLocal: true, isDefinition: true)
!1359 = !DIGlobalVariableExpression(var: !1360, expr: !DIExpression())
!1360 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 87, type: !184, isLocal: true, isDefinition: true)
!1361 = !DIGlobalVariableExpression(var: !1362, expr: !DIExpression())
!1362 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1363, file: !1342, line: 76, type: !1433, isLocal: false, isDefinition: true)
!1363 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1342, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1364, retainedTypes: !1370, globals: !1371, splitDebugInlining: false, nameTableKind: None)
!1364 = !{!76, !1365, !61}
!1365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !77, line: 254, baseType: !7, size: 32, elements: !1366)
!1366 = !{!1367, !1368, !1369}
!1367 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1368 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1369 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1370 = !{!43, !139, !140}
!1371 = !{!1340, !1343, !1345, !1347, !1349, !1351, !1353, !1355, !1357, !1359, !1361, !1372, !1376, !1386, !1388, !1391, !1393, !1395, !1397, !1399, !1422, !1429, !1431}
!1372 = !DIGlobalVariableExpression(var: !1373, expr: !DIExpression())
!1373 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1363, file: !1342, line: 92, type: !1374, isLocal: false, isDefinition: true)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 320, elements: !190)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!1376 = !DIGlobalVariableExpression(var: !1377, expr: !DIExpression())
!1377 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1363, file: !1342, line: 1040, type: !1378, isLocal: false, isDefinition: true)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1342, line: 56, size: 448, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1384, !1385}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1378, file: !1342, line: 59, baseType: !76, size: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !1342, line: 62, baseType: !43, size: 32, offset: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1378, file: !1342, line: 66, baseType: !1383, size: 256, offset: 64)
!1383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !185)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1378, file: !1342, line: 69, baseType: !142, size: 64, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1378, file: !1342, line: 72, baseType: !142, size: 64, offset: 384)
!1386 = !DIGlobalVariableExpression(var: !1387, expr: !DIExpression())
!1387 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1363, file: !1342, line: 107, type: !1378, isLocal: true, isDefinition: true)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(name: "slot0", scope: !1363, file: !1342, line: 831, type: !1390, isLocal: true, isDefinition: true)
!1390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 2048, elements: !1081)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 321, type: !399, isLocal: true, isDefinition: true)
!1393 = !DIGlobalVariableExpression(var: !1394, expr: !DIExpression())
!1394 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 357, type: !399, isLocal: true, isDefinition: true)
!1395 = !DIGlobalVariableExpression(var: !1396, expr: !DIExpression())
!1396 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 358, type: !399, isLocal: true, isDefinition: true)
!1397 = !DIGlobalVariableExpression(var: !1398, expr: !DIExpression())
!1398 = distinct !DIGlobalVariable(scope: null, file: !1342, line: 199, type: !179, isLocal: true, isDefinition: true)
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(name: "quote", scope: !1401, file: !1342, line: 228, type: !1420, isLocal: true, isDefinition: true)
!1401 = distinct !DISubprogram(name: "gettext_quote", scope: !1342, file: !1342, line: 197, type: !1402, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1363, retainedNodes: !1404)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!142, !142, !76}
!1404 = !{!1405, !1406, !1407, !1408, !1409}
!1405 = !DILocalVariable(name: "msgid", arg: 1, scope: !1401, file: !1342, line: 197, type: !142)
!1406 = !DILocalVariable(name: "s", arg: 2, scope: !1401, file: !1342, line: 197, type: !76)
!1407 = !DILocalVariable(name: "translation", scope: !1401, file: !1342, line: 199, type: !142)
!1408 = !DILocalVariable(name: "w", scope: !1401, file: !1342, line: 229, type: !1323)
!1409 = !DILocalVariable(name: "mbs", scope: !1401, file: !1342, line: 230, type: !1410)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1328, line: 6, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1330, line: 21, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1330, line: 13, size: 64, elements: !1413)
!1413 = !{!1414, !1415}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1412, file: !1330, line: 15, baseType: !43, size: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1412, file: !1330, line: 20, baseType: !1416, size: 32, offset: 32)
!1416 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1412, file: !1330, line: 16, size: 32, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1416, file: !1330, line: 18, baseType: !7, size: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1416, file: !1330, line: 19, baseType: !428, size: 32)
!1420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !1421)
!1421 = !{!401, !430}
!1422 = !DIGlobalVariableExpression(var: !1423, expr: !DIExpression())
!1423 = distinct !DIGlobalVariable(name: "slotvec", scope: !1363, file: !1342, line: 834, type: !1424, isLocal: true, isDefinition: true)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1342, line: 823, size: 128, elements: !1426)
!1426 = !{!1427, !1428}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1425, file: !1342, line: 825, baseType: !140, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1425, file: !1342, line: 826, baseType: !136, size: 64, offset: 64)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(name: "nslots", scope: !1363, file: !1342, line: 832, type: !43, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1363, file: !1342, line: 833, type: !1425, isLocal: true, isDefinition: true)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 704, elements: !1011)
!1434 = !DIGlobalVariableExpression(var: !1435, expr: !DIExpression())
!1435 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 67, type: !311, isLocal: true, isDefinition: true)
!1436 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1437 = !DIGlobalVariableExpression(var: !1438, expr: !DIExpression())
!1438 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 69, type: !179, isLocal: true, isDefinition: true)
!1439 = !DIGlobalVariableExpression(var: !1440, expr: !DIExpression())
!1440 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 83, type: !179, isLocal: true, isDefinition: true)
!1441 = !DIGlobalVariableExpression(var: !1442, expr: !DIExpression())
!1442 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 83, type: !428, isLocal: true, isDefinition: true)
!1443 = !DIGlobalVariableExpression(var: !1444, expr: !DIExpression())
!1444 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 85, type: !399, isLocal: true, isDefinition: true)
!1445 = !DIGlobalVariableExpression(var: !1446, expr: !DIExpression())
!1446 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 88, type: !1447, isLocal: true, isDefinition: true)
!1447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1368, elements: !1448)
!1448 = !{!1449}
!1449 = !DISubrange(count: 171)
!1450 = !DIGlobalVariableExpression(var: !1451, expr: !DIExpression())
!1451 = distinct !DIGlobalVariable(scope: null, file: !1436, line: 88, type: !1452, isLocal: true, isDefinition: true)
!1452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 272, elements: !1453)
!1453 = !{!1454}
!1454 = !DISubrange(count: 34)
!1455 = !DIGlobalVariableExpression(var: !1456, expr: !DIExpression())
