; ModuleID = 'src/cp.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, ptr, ptr }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.dir_attr = type { %struct.stat, i8, i64, ptr }
%struct.dir_list = type { ptr, i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.Src_to_dest = type { i64, i64, ptr }
%struct.link_arg = type { i32, ptr, i32, i32 }
%struct.symlink_arg = type { ptr, i32 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }

!211 = !DIFile(filename: "./lib/backupfile.h", directory: "/src", checksumkind: CSK_MD5, checksum: "5fb672ff14309605c773cb90d9256701")
!212 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!213 = !{!214, !215, !216, !217}
!214 = !DIEnumerator(name: "no_backups", value: 0)
!215 = !DIEnumerator(name: "simple_backups", value: 1)
!216 = !DIEnumerator(name: "numbered_existing_backups", value: 2)
!217 = !DIEnumerator(name: "numbered_backups", value: 3)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Dereference_symlink", file: !219, line: 86, baseType: !212, size: 32, elements: !220)
!219 = !DIFile(filename: "src/copy.h", directory: "/src", checksumkind: CSK_MD5, checksum: "4854856c8f3aacad20824070737d83b1")
!220 = !{!221, !222, !223, !224}
!221 = !DIEnumerator(name: "DEREF_UNDEFINED", value: 1)
!222 = !DIEnumerator(name: "DEREF_NEVER", value: 2)
!223 = !DIEnumerator(name: "DEREF_COMMAND_LINE_ARGUMENTS", value: 3)
!224 = !DIEnumerator(name: "DEREF_ALWAYS", value: 4)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Interactive", file: !219, line: 77, baseType: !212, size: 32, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIEnumerator(name: "I_UNSPECIFIED", value: 0)
!228 = !DIEnumerator(name: "I_ALWAYS_YES", value: 1)
!229 = !DIEnumerator(name: "I_ALWAYS_SKIP", value: 2)
!230 = !DIEnumerator(name: "I_ASK_USER", value: 3)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sparse_type", file: !219, line: 27, baseType: !212, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236}
!233 = !DIEnumerator(name: "SPARSE_UNUSED", value: 0)
!234 = !DIEnumerator(name: "SPARSE_NEVER", value: 1)
!235 = !DIEnumerator(name: "SPARSE_AUTO", value: 2)
!236 = !DIEnumerator(name: "SPARSE_ALWAYS", value: 3)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Update_type", file: !219, line: 61, baseType: !212, size: 32, elements: !238)
!238 = !{!239, !240, !241, !242}
!239 = !DIEnumerator(name: "UPDATE_ALL", value: 0)
!240 = !DIEnumerator(name: "UPDATE_OLDER", value: 1)
!241 = !DIEnumerator(name: "UPDATE_NONE", value: 2)
!242 = !DIEnumerator(name: "UPDATE_NONE_FAIL", value: 3)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Reflink_type", file: !219, line: 48, baseType: !212, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "REFLINK_NEVER", value: 0)
!246 = !DIEnumerator(name: "REFLINK_AUTO", value: 1)
!247 = !DIEnumerator(name: "REFLINK_ALWAYS", value: 2)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 60, baseType: !212, size: 32, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260}
!250 = !DIEnumerator(name: "ATTRIBUTES_ONLY_OPTION", value: 256)
!251 = !DIEnumerator(name: "COPY_CONTENTS_OPTION", value: 257)
!252 = !DIEnumerator(name: "DEBUG_OPTION", value: 258)
!253 = !DIEnumerator(name: "NO_PRESERVE_ATTRIBUTES_OPTION", value: 259)
!254 = !DIEnumerator(name: "PARENTS_OPTION", value: 260)
!255 = !DIEnumerator(name: "PRESERVE_ATTRIBUTES_OPTION", value: 261)
!256 = !DIEnumerator(name: "REFLINK_OPTION", value: 262)
!257 = !DIEnumerator(name: "SPARSE_OPTION", value: 263)
!258 = !DIEnumerator(name: "STRIP_TRAILING_SLASHES_OPTION", value: 264)
!259 = !DIEnumerator(name: "UNLINK_DEST_BEFORE_OPENING", value: 265)
!260 = !DIEnumerator(name: "KEEP_DIRECTORY_SYMLINK_OPTION", value: 266)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 337, baseType: !263, size: 32, elements: !264)
!262 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!263 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!264 = !{!265, !266}
!265 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!266 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 46, baseType: !212, size: 32, elements: !269)
!268 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!270 = !DIEnumerator(name: "_ISupper", value: 256)
!271 = !DIEnumerator(name: "_ISlower", value: 512)
!272 = !DIEnumerator(name: "_ISalpha", value: 1024)
!273 = !DIEnumerator(name: "_ISdigit", value: 2048)
!274 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!275 = !DIEnumerator(name: "_ISspace", value: 8192)
!276 = !DIEnumerator(name: "_ISprint", value: 16384)
!277 = !DIEnumerator(name: "_ISgraph", value: 32768)
!278 = !DIEnumerator(name: "_ISblank", value: 1)
!279 = !DIEnumerator(name: "_IScntrl", value: 2)
!280 = !DIEnumerator(name: "_ISpunct", value: 4)
!281 = !DIEnumerator(name: "_ISalnum", value: 8)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "File_attribute", scope: !283, file: !2, line: 939, baseType: !212, size: 32, elements: !356)
!283 = distinct !DISubprogram(name: "decode_preserve_arg", scope: !2, file: !2, line: 937, type: !284, scopeLine: 938, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !208, retainedNodes: !346)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !286, !288, !301}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cp_options", file: !219, line: 115, size: 768, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !300, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !345}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "backup_type", scope: !289, file: !219, line: 117, baseType: !210, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dereference", scope: !289, file: !219, line: 120, baseType: !218, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !289, file: !219, line: 125, baseType: !225, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_mode", scope: !289, file: !219, line: 128, baseType: !231, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !289, file: !219, line: 132, baseType: !296, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !297, line: 69, baseType: !298)
!297 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !299, line: 150, baseType: !212)
!299 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "copy_as_regular", scope: !289, file: !219, line: 136, baseType: !301, size: 8, offset: 160)
!301 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_before_opening", scope: !289, file: !219, line: 140, baseType: !301, size: 8, offset: 168)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "unlink_dest_after_failed_open", scope: !289, file: !219, line: 147, baseType: !301, size: 8, offset: 176)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hard_link", scope: !289, file: !219, line: 151, baseType: !301, size: 8, offset: 184)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "move_mode", scope: !289, file: !219, line: 155, baseType: !301, size: 8, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "no_copy", scope: !289, file: !219, line: 155, baseType: !301, size: 8, offset: 200)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "exchange", scope: !289, file: !219, line: 159, baseType: !301, size: 8, offset: 208)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "install_mode", scope: !289, file: !219, line: 162, baseType: !301, size: 8, offset: 216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chown_privileges", scope: !289, file: !219, line: 166, baseType: !301, size: 8, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "owner_privileges", scope: !289, file: !219, line: 173, baseType: !301, size: 8, offset: 232)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !289, file: !219, line: 177, baseType: !301, size: 8, offset: 240)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_ownership", scope: !289, file: !219, line: 181, baseType: !301, size: 8, offset: 248)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_mode", scope: !289, file: !219, line: 182, baseType: !301, size: 8, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_timestamps", scope: !289, file: !219, line: 183, baseType: !301, size: 8, offset: 264)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_no_preserve_mode", scope: !289, file: !219, line: 184, baseType: !301, size: 8, offset: 272)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set_security_context", scope: !289, file: !219, line: 187, baseType: !317, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !319, line: 53, flags: DIFlagFwdDecl)
!319 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!320 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_links", scope: !289, file: !219, line: 199, baseType: !301, size: 8, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data_copy_required", scope: !289, file: !219, line: 203, baseType: !301, size: 8, offset: 392)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve", scope: !289, file: !219, line: 209, baseType: !301, size: 8, offset: 400)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_security_context", scope: !289, file: !219, line: 213, baseType: !301, size: 8, offset: 408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_context", scope: !289, file: !219, line: 222, baseType: !301, size: 8, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_xattr", scope: !289, file: !219, line: 226, baseType: !301, size: 8, offset: 424)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "require_preserve_xattr", scope: !289, file: !219, line: 235, baseType: !301, size: 8, offset: 432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reduce_diagnostics", scope: !289, file: !219, line: 244, baseType: !301, size: 8, offset: 440)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !289, file: !219, line: 248, baseType: !301, size: 8, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "set_mode", scope: !289, file: !219, line: 252, baseType: !301, size: 8, offset: 456)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "symbolic_link", scope: !289, file: !219, line: 256, baseType: !301, size: 8, offset: 464)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !289, file: !219, line: 259, baseType: !237, size: 32, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !289, file: !219, line: 262, baseType: !301, size: 8, offset: 512)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "keep_directory_symlink", scope: !289, file: !219, line: 265, baseType: !301, size: 8, offset: 520)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !289, file: !219, line: 268, baseType: !301, size: 8, offset: 528)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !289, file: !219, line: 271, baseType: !301, size: 8, offset: 536)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "open_dangling_dest_symlink", scope: !289, file: !219, line: 276, baseType: !301, size: 8, offset: 544)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "last_file", scope: !289, file: !219, line: 280, baseType: !301, size: 8, offset: 552)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rename_errno", scope: !289, file: !219, line: 285, baseType: !263, size: 32, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reflink_mode", scope: !289, file: !219, line: 288, baseType: !243, size: 32, offset: 608)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dest_info", scope: !289, file: !219, line: 299, baseType: !341, size: 64, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !343, line: 56, baseType: !344)
!343 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !343, line: 54, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "src_info", scope: !289, file: !219, line: 302, baseType: !341, size: 64, offset: 704)
!346 = !{!347, !348, !349, !350, !352, !353, !355}
!347 = !DILocalVariable(name: "arg", arg: 1, scope: !283, file: !2, line: 937, type: !286)
!348 = !DILocalVariable(name: "x", arg: 2, scope: !283, file: !2, line: 937, type: !288)
!349 = !DILocalVariable(name: "on_off", arg: 3, scope: !283, file: !2, line: 937, type: !301)
!350 = !DILocalVariable(name: "arg_writable", scope: !283, file: !2, line: 963, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!352 = !DILocalVariable(name: "s", scope: !283, file: !2, line: 964, type: !351)
!353 = !DILocalVariable(name: "comma", scope: !354, file: !2, line: 968, type: !351)
!354 = distinct !DILexicalBlock(scope: !283, file: !2, line: 966, column: 5)
!355 = !DILocalVariable(name: "val", scope: !354, file: !2, line: 969, type: !282)
!356 = !{!357, !358, !359, !360, !361, !362, !363}
!357 = !DIEnumerator(name: "PRESERVE_MODE", value: 0)
!358 = !DIEnumerator(name: "PRESERVE_TIMESTAMPS", value: 1)
!359 = !DIEnumerator(name: "PRESERVE_OWNERSHIP", value: 2)
!360 = !DIEnumerator(name: "PRESERVE_LINK", value: 3)
!361 = !DIEnumerator(name: "PRESERVE_CONTEXT", value: 4)
!362 = !DIEnumerator(name: "PRESERVE_XATTR", value: 5)
!363 = !DIEnumerator(name: "PRESERVE_ALL", value: 6)
!364 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !365, line: 42, baseType: !212, size: 32, elements: !366)
!365 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!367 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!368 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!369 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!370 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!371 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!372 = !DIEnumerator(name: "c_quoting_style", value: 5)
!373 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!374 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!375 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!376 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!377 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!378 = !{!379, !381, !351, !263, !382, !383, !286, !386, !317}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!382 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !384, line: 46, baseType: !385)
!384 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!385 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!386 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!387 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !89, !94, !96, !101, !103, !108, !110, !112, !117, !122, !127, !129, !134, !139, !141, !146, !148, !150, !155, !157, !159, !164, !169, !174, !179, !184, !189, !194, !199, !204, !388, !393, !395, !400, !402, !407, !412, !417, !422, !427, !432, !437, !442, !444, !449, !454, !459, !461, !463, !465, !467, !469, !474, !555, !560, !562, !567, !572, !577, !579, !581, !583, !585, !587, !589, !594, !599, !601, !603, !605, !607, !609, !611, !616, !621, !626, !628, !630, !632, !634, !636, !641, !646, !651, !653, !658, !660, !662, !664, !669, !674, !676, !678, !680, !682, !684, !686, !688, !690, !692, !694, !696, !701, !703, !705, !707, !709, !711, !713, !715, !717, !719, !721, !723, !728, !730, !732, !734, !736, !738, !740, !742, !744, !206, !746, !750, !752, !754, !756, !760, !764, !766, !770, !772, !774, !776, !778, !780, !782, !785, !787, !789, !791, !793, !796, !798, !802, !804, !806, !808, !811, !816, !818, !823, !825, !827, !829, !831, !833, !838, !941, !946, !951, !953, !958, !963, !968}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1059, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 9)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1067, type: !196, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1184, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 38)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1196, type: !390, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1223, type: !404, isLocal: true, isDefinition: true)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !405)
!405 = !{!406}
!406 = !DISubrange(count: 28)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1228, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 67)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 14)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 18)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 19)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 16)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1241, type: !434, isLocal: true, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 13)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1257, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 41)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1268, type: !39, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1275, type: !446, isLocal: true, isDefinition: true)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 46)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1280, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 12)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1303, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 42)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1307, type: !409, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1318, type: !161, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1324, type: !79, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "selinux_enabled", scope: !208, file: !2, line: 76, type: !301, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "remove_trailing_slashes", scope: !208, file: !2, line: 83, type: !301, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !262, line: 736, type: !471, isLocal: true, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 75)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !476, file: !262, line: 575, type: !263, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "oputs_", scope: !262, file: !262, line: 573, type: !477, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !208, retainedNodes: !479)
!477 = !DISubroutineType(cc: DW_CC_nocall, types: !478)
!478 = !{null, !286, !286}
!479 = !{!480, !481, !482, !485, !486, !487, !488, !492, !493, !494, !495, !497, !549, !550, !551, !553, !554}
!480 = !DILocalVariable(name: "program", arg: 1, scope: !476, file: !262, line: 573, type: !286)
!481 = !DILocalVariable(name: "option", arg: 2, scope: !476, file: !262, line: 573, type: !286)
!482 = !DILocalVariable(name: "term", scope: !483, file: !262, line: 585, type: !286)
!483 = distinct !DILexicalBlock(scope: !484, file: !262, line: 582, column: 5)
!484 = distinct !DILexicalBlock(scope: !476, file: !262, line: 581, column: 7)
!485 = !DILocalVariable(name: "double_space", scope: !476, file: !262, line: 594, type: !301)
!486 = !DILocalVariable(name: "first_word", scope: !476, file: !262, line: 595, type: !286)
!487 = !DILocalVariable(name: "option_text", scope: !476, file: !262, line: 596, type: !286)
!488 = !DILocalVariable(name: "s", scope: !489, file: !262, line: 608, type: !286)
!489 = distinct !DILexicalBlock(scope: !490, file: !262, line: 605, column: 5)
!490 = distinct !DILexicalBlock(scope: !491, file: !262, line: 604, column: 12)
!491 = distinct !DILexicalBlock(scope: !476, file: !262, line: 597, column: 7)
!492 = !DILocalVariable(name: "spaces", scope: !489, file: !262, line: 609, type: !383)
!493 = !DILocalVariable(name: "anchor_len", scope: !476, file: !262, line: 620, type: !383)
!494 = !DILocalVariable(name: "desc_text", scope: !476, file: !262, line: 625, type: !286)
!495 = !DILocalVariable(name: "__ptr", scope: !496, file: !262, line: 644, type: !286)
!496 = distinct !DILexicalBlock(scope: !476, file: !262, line: 644, column: 3)
!497 = !DILocalVariable(name: "__stream", scope: !496, file: !262, line: 644, type: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !500, line: 7, baseType: !501)
!500 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !502, line: 49, size: 1728, elements: !503)
!502 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !519, !521, !522, !523, !526, !527, !529, !530, !533, !535, !538, !541, !542, !543, !544, !545}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !501, file: !502, line: 51, baseType: !263, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !501, file: !502, line: 54, baseType: !351, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !501, file: !502, line: 55, baseType: !351, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !501, file: !502, line: 56, baseType: !351, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !501, file: !502, line: 57, baseType: !351, size: 64, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !501, file: !502, line: 58, baseType: !351, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !501, file: !502, line: 59, baseType: !351, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !501, file: !502, line: 60, baseType: !351, size: 64, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !501, file: !502, line: 61, baseType: !351, size: 64, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !501, file: !502, line: 64, baseType: !351, size: 64, offset: 576)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !501, file: !502, line: 65, baseType: !351, size: 64, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !501, file: !502, line: 66, baseType: !351, size: 64, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !501, file: !502, line: 68, baseType: !517, size: 64, offset: 768)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !502, line: 36, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !501, file: !502, line: 70, baseType: !520, size: 64, offset: 832)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !501, file: !502, line: 72, baseType: !263, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !501, file: !502, line: 73, baseType: !263, size: 32, offset: 928)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !501, file: !502, line: 74, baseType: !524, size: 64, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !299, line: 152, baseType: !525)
!525 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !501, file: !502, line: 77, baseType: !382, size: 16, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !501, file: !502, line: 78, baseType: !528, size: 8, offset: 1040)
!528 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !501, file: !502, line: 79, baseType: !191, size: 8, offset: 1048)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !501, file: !502, line: 81, baseType: !531, size: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !502, line: 43, baseType: null)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !501, file: !502, line: 89, baseType: !534, size: 64, offset: 1152)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !299, line: 153, baseType: !525)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !501, file: !502, line: 91, baseType: !536, size: 64, offset: 1216)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !502, line: 37, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !501, file: !502, line: 92, baseType: !539, size: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !502, line: 38, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !501, file: !502, line: 93, baseType: !520, size: 64, offset: 1344)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !501, file: !502, line: 94, baseType: !381, size: 64, offset: 1408)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !501, file: !502, line: 95, baseType: !383, size: 64, offset: 1472)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !501, file: !502, line: 96, baseType: !263, size: 32, offset: 1536)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !501, file: !502, line: 98, baseType: !546, size: 160, offset: 1568)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 20)
!549 = !DILocalVariable(name: "__cnt", scope: !496, file: !262, line: 644, type: !383)
!550 = !DILocalVariable(name: "url_program", scope: !476, file: !262, line: 648, type: !286)
!551 = !DILocalVariable(name: "__ptr", scope: !552, file: !262, line: 686, type: !286)
!552 = distinct !DILexicalBlock(scope: !476, file: !262, line: 686, column: 3)
!553 = !DILocalVariable(name: "__stream", scope: !552, file: !262, line: 686, type: !498)
!554 = !DILocalVariable(name: "__cnt", scope: !552, file: !262, line: 686, type: !383)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !262, line: 585, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 5)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !262, line: 586, type: !557, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !262, line: 595, type: !564, isLocal: true, isDefinition: true)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 4)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !262, line: 620, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 6)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !262, line: 648, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 2)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !262, line: 648, type: !557, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !262, line: 649, type: !564, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !262, line: 649, type: !19, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !262, line: 650, type: !557, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !262, line: 651, type: !569, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !262, line: 651, type: !569, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !262, line: 652, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 7)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !262, line: 653, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 8)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !262, line: 654, type: !196, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !262, line: 655, type: !196, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !262, line: 656, type: !196, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !262, line: 657, type: !196, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !262, line: 663, type: !591, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !262, line: 664, type: !196, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !262, line: 669, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 17)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !262, line: 669, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 40)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !262, line: 676, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 15)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !262, line: 676, type: !39, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !262, line: 679, type: !19, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !262, line: 683, type: !557, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !262, line: 688, type: !557, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !262, line: 691, type: !596, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !262, line: 764, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4976, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 622)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !262, line: 781, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1768, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 221)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !262, line: 788, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1776, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 222)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !262, line: 839, type: !429, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !262, line: 840, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 22)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !262, line: 841, type: !623, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !262, line: 862, type: !564, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !262, line: 868, type: !79, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !262, line: 875, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 27)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !262, line: 877, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 51)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !262, line: 877, type: !451, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 928, type: !429, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !596, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !429, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !591, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 120, type: !414, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !569, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !451, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !569, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 124, type: !451, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !557, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !2, line: 126, type: !698, isLocal: true, isDefinition: true)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 11)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 127, type: !623, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !451, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 129, type: !546, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 130, type: !429, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 131, type: !596, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !557, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !390, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !196, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 135, type: !424, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !591, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 137, type: !596, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 138, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 23)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !591, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 141, type: !414, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !613, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 143, type: !591, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !596, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !2, line: 145, type: !725, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 147, type: !596, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !557, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !596, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "sparse_type", scope: !208, file: !2, line: 89, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 96, elements: !20)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !569, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !557, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !591, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "sparse_type_string", scope: !208, file: !2, line: 85, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 256, elements: !565)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "reflink_type", scope: !208, file: !2, line: 99, type: !762, isLocal: true, isDefinition: true)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 96, elements: !20)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "reflink_type_string", scope: !208, file: !2, line: 95, type: !758, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "preserve_vals", scope: !283, file: !2, line: 949, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 224, elements: !592)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !2, line: 958, type: !557, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !2, line: 958, type: !698, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !196, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !569, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !569, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !2, line: 959, type: !564, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "preserve_args", scope: !283, file: !2, line: 956, type: !784, isLocal: true, isDefinition: true)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 512, elements: !597)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 976, type: !698, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 976, type: !414, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1019, type: !574, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1019, type: !390, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1019, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 536, elements: !410)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "parents_option", scope: !208, file: !2, line: 80, type: !301, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "update_type", scope: !208, file: !2, line: 109, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 128, elements: !565)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !557, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !196, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 107, type: !569, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "update_type_string", scope: !208, file: !2, line: 105, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 320, elements: !558)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 676, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 21)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !2, line: 678, type: !456, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !2, line: 691, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !821)
!821 = !{!822}
!822 = !DISubrange(count: 70)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !2, line: 696, type: !613, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !2, line: 704, type: !546, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(scope: null, file: !2, line: 736, type: !196, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 790, type: !196, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !19, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !2, line: 843, type: !835, isLocal: true, isDefinition: true)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 52)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "x_tmp", scope: !840, file: !2, line: 862, type: !289, isLocal: true, isDefinition: true)
!840 = distinct !DISubprogram(name: "do_copy", scope: !2, file: !2, line: 670, type: !841, scopeLine: 672, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !208, retainedNodes: !844)
!841 = !DISubroutineType(types: !842)
!842 = !{!301, !263, !843, !286, !301, !288}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!844 = !{!845, !846, !847, !848, !849, !850, !885, !886, !887, !888, !892, !893, !896, !900, !903, !904, !912, !913, !914, !917, !920, !921, !922, !924, !927, !928, !929, !932, !933, !937, !939, !940}
!845 = !DILocalVariable(name: "n_files", arg: 1, scope: !840, file: !2, line: 670, type: !263)
!846 = !DILocalVariable(name: "file", arg: 2, scope: !840, file: !2, line: 670, type: !843)
!847 = !DILocalVariable(name: "target_directory", arg: 3, scope: !840, file: !2, line: 670, type: !286)
!848 = !DILocalVariable(name: "no_target_directory", arg: 4, scope: !840, file: !2, line: 671, type: !301)
!849 = !DILocalVariable(name: "x", arg: 5, scope: !840, file: !2, line: 671, type: !288)
!850 = !DILocalVariable(name: "sb", scope: !840, file: !2, line: 683, type: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !852, line: 44, size: 1024, elements: !853)
!852 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!853 = !{!854, !856, !858, !859, !861, !863, !865, !866, !867, !868, !870, !871, !873, !881, !882, !883}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !851, file: !852, line: 46, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !299, line: 145, baseType: !385)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !851, file: !852, line: 47, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !299, line: 148, baseType: !385)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !851, file: !852, line: 48, baseType: !298, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !851, file: !852, line: 49, baseType: !860, size: 32, offset: 160)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !299, line: 151, baseType: !212)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !851, file: !852, line: 50, baseType: !862, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !299, line: 146, baseType: !212)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !851, file: !852, line: 51, baseType: !864, size: 32, offset: 224)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !299, line: 147, baseType: !212)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !851, file: !852, line: 52, baseType: !855, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !851, file: !852, line: 53, baseType: !855, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !851, file: !852, line: 54, baseType: !524, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !851, file: !852, line: 55, baseType: !869, size: 32, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !299, line: 175, baseType: !263)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !851, file: !852, line: 56, baseType: !263, size: 32, offset: 480)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !851, file: !852, line: 57, baseType: !872, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !299, line: 180, baseType: !525)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !851, file: !852, line: 65, baseType: !874, size: 128, offset: 576)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !875, line: 11, size: 128, elements: !876)
!875 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!876 = !{!877, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !874, file: !875, line: 16, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !299, line: 160, baseType: !525)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !874, file: !875, line: 21, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !299, line: 197, baseType: !525)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !851, file: !852, line: 66, baseType: !874, size: 128, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !851, file: !852, line: 67, baseType: !874, size: 128, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !851, file: !852, line: 79, baseType: !884, size: 64, offset: 960)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !575)
!885 = !DILocalVariable(name: "target_dirfd", scope: !840, file: !2, line: 685, type: !263)
!886 = !DILocalVariable(name: "new_dst", scope: !840, file: !2, line: 686, type: !301)
!887 = !DILocalVariable(name: "ok", scope: !840, file: !2, line: 687, type: !301)
!888 = !DILocalVariable(name: "lastfile", scope: !889, file: !2, line: 709, type: !286)
!889 = distinct !DILexicalBlock(scope: !890, file: !2, line: 708, column: 5)
!890 = distinct !DILexicalBlock(scope: !891, file: !2, line: 700, column: 12)
!891 = distinct !DILexicalBlock(scope: !840, file: !2, line: 688, column: 7)
!892 = !DILocalVariable(name: "fd", scope: !889, file: !2, line: 710, type: !263)
!893 = !DILocalVariable(name: "err", scope: !894, file: !2, line: 719, type: !263)
!894 = distinct !DILexicalBlock(scope: !895, file: !2, line: 718, column: 9)
!895 = distinct !DILexicalBlock(scope: !889, file: !2, line: 711, column: 11)
!896 = !DILocalVariable(name: "i", scope: !897, file: !2, line: 755, type: !263)
!897 = distinct !DILexicalBlock(scope: !898, file: !2, line: 755, column: 7)
!898 = distinct !DILexicalBlock(scope: !899, file: !2, line: 741, column: 5)
!899 = distinct !DILexicalBlock(scope: !840, file: !2, line: 740, column: 7)
!900 = !DILocalVariable(name: "dst_name", scope: !901, file: !2, line: 757, type: !351)
!901 = distinct !DILexicalBlock(scope: !902, file: !2, line: 756, column: 9)
!902 = distinct !DILexicalBlock(scope: !897, file: !2, line: 755, column: 7)
!903 = !DILocalVariable(name: "parent_exists", scope: !901, file: !2, line: 758, type: !301)
!904 = !DILocalVariable(name: "attr_list", scope: !901, file: !2, line: 759, type: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_attr", file: !2, line: 50, size: 1216, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !906, file: !2, line: 52, baseType: !851, size: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !906, file: !2, line: 53, baseType: !301, size: 8, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "slash_offset", scope: !906, file: !2, line: 54, baseType: !383, size: 64, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !2, line: 55, baseType: !905, size: 64, offset: 1152)
!912 = !DILocalVariable(name: "arg_in_concat", scope: !901, file: !2, line: 760, type: !351)
!913 = !DILocalVariable(name: "arg", scope: !901, file: !2, line: 761, type: !351)
!914 = !DILocalVariable(name: "arg_no_trailing_slash", scope: !915, file: !2, line: 770, type: !351)
!915 = distinct !DILexicalBlock(scope: !916, file: !2, line: 769, column: 13)
!916 = distinct !DILexicalBlock(scope: !901, file: !2, line: 768, column: 15)
!917 = !DILocalVariable(name: "__old", scope: !918, file: !2, line: 776, type: !286)
!918 = distinct !DILexicalBlock(scope: !919, file: !2, line: 776, column: 15)
!919 = distinct !DILexicalBlock(scope: !915, file: !2, line: 776, column: 15)
!920 = !DILocalVariable(name: "__len", scope: !918, file: !2, line: 776, type: !383)
!921 = !DILocalVariable(name: "__new", scope: !918, file: !2, line: 776, type: !351)
!922 = !DILocalVariable(name: "arg_base", scope: !923, file: !2, line: 795, type: !351)
!923 = distinct !DILexicalBlock(scope: !916, file: !2, line: 794, column: 13)
!924 = !DILocalVariable(name: "__old", scope: !925, file: !2, line: 797, type: !286)
!925 = distinct !DILexicalBlock(scope: !926, file: !2, line: 797, column: 15)
!926 = distinct !DILexicalBlock(scope: !923, file: !2, line: 797, column: 15)
!927 = !DILocalVariable(name: "__len", scope: !925, file: !2, line: 797, type: !383)
!928 = !DILocalVariable(name: "__new", scope: !925, file: !2, line: 797, type: !351)
!929 = !DILocalVariable(name: "dst_relname", scope: !930, file: !2, line: 813, type: !286)
!930 = distinct !DILexicalBlock(scope: !931, file: !2, line: 812, column: 13)
!931 = distinct !DILexicalBlock(scope: !901, file: !2, line: 805, column: 15)
!932 = !DILocalVariable(name: "copy_into_self", scope: !930, file: !2, line: 817, type: !301)
!933 = !DILocalVariable(name: "p", scope: !934, file: !2, line: 830, type: !905)
!934 = distinct !DILexicalBlock(scope: !935, file: !2, line: 829, column: 17)
!935 = distinct !DILexicalBlock(scope: !936, file: !2, line: 827, column: 13)
!936 = distinct !DILexicalBlock(scope: !901, file: !2, line: 826, column: 15)
!937 = !DILocalVariable(name: "source", scope: !938, file: !2, line: 854, type: !286)
!938 = distinct !DILexicalBlock(scope: !899, file: !2, line: 840, column: 5)
!939 = !DILocalVariable(name: "dest", scope: !938, file: !2, line: 855, type: !286)
!940 = !DILocalVariable(name: "unused", scope: !938, file: !2, line: 875, type: !301)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !2, line: 528, type: !943, isLocal: true, isDefinition: true)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 31)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !2, line: 576, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 25)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !2, line: 618, type: !666, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !2, line: 626, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 33)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !2, line: 401, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 32)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !2, line: 414, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 36)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !2, line: 433, type: !397, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 8192, elements: !961)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !973, line: 50, size: 256, elements: !974)
!973 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!974 = !{!975, !976, !977, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !972, file: !973, line: 52, baseType: !286, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !972, file: !973, line: 55, baseType: !263, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !972, file: !973, line: 56, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !972, file: !973, line: 57, baseType: !263, size: 32, offset: 192)
!980 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!981 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !984, line: 606, type: !985, isLocal: true, isDefinition: true)
!984 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 37)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !984, line: 648, type: !439, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !992, file: !984, line: 128, type: !286, isLocal: true, isDefinition: true)
!992 = distinct !DICompileUnit(language: DW_LANG_C11, file: !984, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !993, retainedTypes: !1014, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!993 = !{!210, !218, !225, !231, !237, !243, !364, !994, !998, !1005}
!994 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !995, line: 32, baseType: !212, size: 32, elements: !996)
!995 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!996 = !{!997}
!997 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !999, line: 37, baseType: !212, size: 32, elements: !1000)
!999 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!1000 = !{!1001, !1002, !1003, !1004}
!1001 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!1002 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!1003 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!1004 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!1005 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !219, line: 305, baseType: !212, size: 32, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013}
!1007 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!1008 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!1009 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!1010 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!1011 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!1012 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!1013 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!1014 = !{!212, !381, !385, !386}
!1015 = !{!1016, !982, !1018, !988, !1020, !1026, !990, !1028, !1030, !1035, !1037, !1040, !1045, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1067, !1069, !1071, !1073, !1075, !1077, !1082, !1084, !1086, !1088, !1090, !1092, !1094, !1096, !1101, !1106, !1108, !1110, !1112, !1117, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1143, !1145, !1147, !1152, !1157, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1199, !1201, !1203, !1205, !1212, !1214, !1216, !1218, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1234}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(scope: null, file: !984, line: 591, type: !161, isLocal: true, isDefinition: true)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(scope: null, file: !984, line: 621, type: !671, isLocal: true, isDefinition: true)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "mask", scope: !1022, file: !984, line: 2890, type: !296, isLocal: true, isDefinition: true)
!1022 = distinct !DISubprogram(name: "cached_umask", scope: !984, file: !984, line: 2888, type: !1023, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !992, retainedNodes: !1025)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!296}
!1025 = !{}
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "cached", scope: !1022, file: !984, line: 2891, type: !301, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !992, file: !984, line: 129, type: !286, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2779, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 55)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2779, type: !698, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2779, type: !1039, isLocal: true, isDefinition: true)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 368, elements: !447)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2780, type: !1042, isLocal: true, isDefinition: true)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 880, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 110)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2781, type: !1047, isLocal: true, isDefinition: true)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 928, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 116)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2782, type: !397, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2783, type: !98, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1643, type: !574, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1673, type: !623, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1681, type: !618, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1681, type: !655, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1706, type: !1064, isLocal: true, isDefinition: true)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 49)
!1067 = !DIGlobalVariableExpression(var: !1068, expr: !DIExpression())
!1068 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1780, type: !404, isLocal: true, isDefinition: true)
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1870, type: !613, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1872, type: !451, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1885, type: !835, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1885, type: !835, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1906, type: !1079, isLocal: true, isDefinition: true)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 43)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1934, type: !161, isLocal: true, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1935, type: !671, isLocal: true, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1961, type: !613, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1978, type: !613, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1983, type: !451, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2008, type: !1064, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2020, type: !390, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2091, type: !1098, isLocal: true, isDefinition: true)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 45)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2100, type: !1103, isLocal: true, isDefinition: true)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 54)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2128, type: !1098, isLocal: true, isDefinition: true)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2157, type: !546, isLocal: true, isDefinition: true)
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2158, type: !613, isLocal: true, isDefinition: true)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2195, type: !1114, isLocal: true, isDefinition: true)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 47)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2239, type: !1119, isLocal: true, isDefinition: true)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 26)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2252, type: !546, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2257, type: !813, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2276, type: !69, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2284, type: !429, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2319, type: !965, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2340, type: !666, isLocal: true, isDefinition: true)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2363, type: !666, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2382, type: !655, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2445, type: !1140, isLocal: true, isDefinition: true)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 63)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2456, type: !985, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2514, type: !655, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2523, type: !1149, isLocal: true, isDefinition: true)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !1150)
!1150 = !{!1151}
!1151 = !DISubrange(count: 30)
!1152 = !DIGlobalVariableExpression(var: !1153, expr: !DIExpression())
!1153 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2534, type: !1154, isLocal: true, isDefinition: true)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1155)
!1155 = !{!1156}
!1156 = !DISubrange(count: 29)
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2561, type: !943, isLocal: true, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2579, type: !965, isLocal: true, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2595, type: !948, isLocal: true, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2651, type: !201, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2737, type: !1149, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2765, type: !546, isLocal: true, isDefinition: true)
!1169 = !DIGlobalVariableExpression(var: !1170, expr: !DIExpression())
!1170 = distinct !DIGlobalVariable(scope: null, file: !984, line: 2769, type: !813, isLocal: true, isDefinition: true)
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1562, type: !955, isLocal: true, isDefinition: true)
!1173 = !DIGlobalVariableExpression(var: !1174, expr: !DIExpression())
!1174 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1492, type: !434, isLocal: true, isDefinition: true)
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1492, type: !1177, isLocal: true, isDefinition: true)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 800, elements: !1178)
!1178 = !{!1179}
!1179 = !DISubrange(count: 100)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1422, type: !1098, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1422, type: !1064, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1433, type: !424, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1512, type: !414, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !984, line: 397, type: !613, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !984, line: 754, type: !666, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !984, line: 760, type: !429, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !984, line: 769, type: !1196, isLocal: true, isDefinition: true)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !1197)
!1197 = !{!1198}
!1198 = !DISubrange(count: 56)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(scope: null, file: !984, line: 978, type: !618, isLocal: true, isDefinition: true)
!1201 = !DIGlobalVariableExpression(var: !1202, expr: !DIExpression())
!1202 = distinct !DIGlobalVariable(scope: null, file: !984, line: 999, type: !1149, isLocal: true, isDefinition: true)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1135, type: !424, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(name: "copy_debug", scope: !992, file: !984, line: 132, type: !1207, isLocal: true, isDefinition: true)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !219, line: 317, size: 96, elements: !1208)
!1208 = !{!1209, !1210, !1211}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !1207, file: !219, line: 319, baseType: !1005, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !1207, file: !219, line: 320, baseType: !1005, size: 32, offset: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !1207, file: !219, line: 321, baseType: !1005, size: 32, offset: 64)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !984, line: 692, type: !666, isLocal: true, isDefinition: true)
!1214 = !DIGlobalVariableExpression(var: !1215, expr: !DIExpression())
!1215 = distinct !DIGlobalVariable(scope: null, file: !984, line: 173, type: !24, isLocal: true, isDefinition: true)
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !984, line: 139, type: !19, isLocal: true, isDefinition: true)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !984, line: 140, type: !564, isLocal: true, isDefinition: true)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !984, line: 141, type: !596, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !984, line: 142, type: !451, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !984, line: 143, type: !596, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !984, line: 157, type: !569, isLocal: true, isDefinition: true)
!1228 = !DIGlobalVariableExpression(var: !1229, expr: !DIExpression())
!1229 = distinct !DIGlobalVariable(scope: null, file: !984, line: 158, type: !196, isLocal: true, isDefinition: true)
!1230 = !DIGlobalVariableExpression(var: !1231, expr: !DIExpression())
!1231 = distinct !DIGlobalVariable(scope: null, file: !984, line: 159, type: !419, isLocal: true, isDefinition: true)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(scope: null, file: !984, line: 1521, type: !835, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !984, line: 510, type: !404, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 554, type: !429, isLocal: true, isDefinition: true)
!1239 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 633, type: !546, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 639, type: !655, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 409, type: !613, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 177, type: !725, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 203, type: !613, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 247, type: !613, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 258, type: !546, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !1256, file: !1257, line: 45, type: !341, isLocal: true, isDefinition: true)
!1256 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1257, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1258, globals: !1262, splitDebugInlining: false, nameTableKind: None)
!1257 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!1258 = !{!381, !351, !1259}
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1260, line: 102, baseType: !1261)
!1260 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !299, line: 73, baseType: !385)
!1262 = !{!1254}
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !1265, file: !1266, line: 38, type: !1275, isLocal: true, isDefinition: true)
!1265 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1266, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1267, globals: !1274, splitDebugInlining: false, nameTableKind: None)
!1266 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!1267 = !{!1268, !1271}
!1268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1266, line: 39, baseType: !212, size: 32, elements: !1269)
!1269 = !{!1270}
!1270 = !DIEnumerator(name: "x_suffix_len", value: 6)
!1271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1266, line: 44, baseType: !212, size: 32, elements: !1272)
!1272 = !{!1273}
!1273 = !DIEnumerator(name: "smallsize", value: 256)
!1274 = !{!1263}
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 72, elements: !391)
!1276 = !DIGlobalVariableExpression(var: !1277, expr: !DIExpression())
!1277 = distinct !DIGlobalVariable(scope: null, file: !1278, line: 3, type: !623, isLocal: true, isDefinition: true)
!1278 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1279 = !DIGlobalVariableExpression(var: !1280, expr: !DIExpression())
!1280 = distinct !DIGlobalVariable(name: "Version", scope: !1281, file: !1278, line: 3, type: !286, isLocal: false, isDefinition: true)
!1281 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1278, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1282, splitDebugInlining: false, nameTableKind: None)
!1282 = !{!1276, !1279}
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 51, type: !19, isLocal: true, isDefinition: true)
!1285 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 55, type: !591, isLocal: true, isDefinition: true)
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(scope: null, file: !1285, line: 55, type: !1149, isLocal: true, isDefinition: true)
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(scope: null, file: !1292, line: 46, type: !591, isLocal: true, isDefinition: true)
!1292 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!1293 = !DIGlobalVariableExpression(var: !1294, expr: !DIExpression())
!1294 = distinct !DIGlobalVariable(scope: null, file: !1292, line: 46, type: !666, isLocal: true, isDefinition: true)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1297, line: 141, type: !591, isLocal: true, isDefinition: true)
!1297 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1298 = !DIGlobalVariableExpression(var: !1299, expr: !DIExpression())
!1299 = distinct !DIGlobalVariable(scope: null, file: !1297, line: 141, type: !666, isLocal: true, isDefinition: true)
!1300 = !DIGlobalVariableExpression(var: !1301, expr: !DIExpression())
!1301 = distinct !DIGlobalVariable(scope: null, file: !1297, line: 142, type: !1154, isLocal: true, isDefinition: true)
!1302 = !DIGlobalVariableExpression(var: !1303, expr: !DIExpression())
