; ModuleID = 'src/date.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.calendar_month_name = type { ptr, ptr }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { ptr, i32, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.calendar_date = type { i32, i32, i32, ptr }
%struct.parser_control = type { ptr, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }
%struct.textint = type { i8, i64, i64 }

!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!613 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !615, line: 46, baseType: !616)
!615 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!616 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !82, !87, !92, !97, !102, !107, !112, !117, !122, !124, !129, !131, !136, !141, !146, !151, !156, !161, !621, !714, !719, !723, !725, !730, !735, !740, !745, !750, !752, !754, !759, !764, !769, !774, !776, !780, !782, !784, !786, !788, !793, !872, !874, !876, !881, !883, !886, !888, !890, !892, !894, !896, !898, !903, !905, !907, !909, !911, !913, !915, !917, !919, !924, !929, !934, !936, !938, !940, !942, !944, !949, !951, !953, !958, !963, !968, !166, !973, !975, !977, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1006, !1018, !1022, !1024, !1026, !1028, !1030, !1034, !1039, !1041, !1043, !1045, !1047, !1049, !1054, !1056, !1058, !1060, !1062, !1064}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !623, file: !2, line: 517, type: !710, isLocal: true, isDefinition: true)
!623 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 474, type: !624, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !627)
!624 = !DISubroutineType(types: !625)
!625 = !{!185, !185, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!627 = !{!628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !646, !648, !649, !650, !651, !652, !657, !658, !661, !671, !707}
!628 = !DILocalVariable(name: "argc", arg: 1, scope: !623, file: !2, line: 474, type: !185)
!629 = !DILocalVariable(name: "argv", arg: 2, scope: !623, file: !2, line: 474, type: !626)
!630 = !DILocalVariable(name: "datestr", scope: !623, file: !2, line: 476, type: !617)
!631 = !DILocalVariable(name: "set_datestr", scope: !623, file: !2, line: 477, type: !617)
!632 = !DILocalVariable(name: "set_date", scope: !623, file: !2, line: 478, type: !633)
!633 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!634 = !DILocalVariable(name: "format", scope: !623, file: !2, line: 479, type: !617)
!635 = !DILocalVariable(name: "format_in_c_locale", scope: !623, file: !2, line: 480, type: !633)
!636 = !DILocalVariable(name: "get_resolution", scope: !623, file: !2, line: 481, type: !633)
!637 = !DILocalVariable(name: "batch_file", scope: !623, file: !2, line: 482, type: !611)
!638 = !DILocalVariable(name: "reference", scope: !623, file: !2, line: 483, type: !611)
!639 = !DILocalVariable(name: "discarded_datestr", scope: !623, file: !2, line: 484, type: !633)
!640 = !DILocalVariable(name: "discarded_set_datestr", scope: !623, file: !2, line: 485, type: !633)
!641 = !DILocalVariable(name: "optc", scope: !623, file: !2, line: 495, type: !185)
!642 = !DILocalVariable(name: "i", scope: !643, file: !2, line: 523, type: !176)
!643 = distinct !DILexicalBlock(scope: !644, file: !2, line: 516, column: 11)
!644 = distinct !DILexicalBlock(scope: !645, file: !2, line: 500, column: 9)
!645 = distinct !DILexicalBlock(scope: !623, file: !2, line: 498, column: 5)
!646 = !DILocalVariable(name: "i", scope: !647, file: !2, line: 540, type: !176)
!647 = distinct !DILexicalBlock(scope: !644, file: !2, line: 531, column: 11)
!648 = !DILocalVariable(name: "option_specified_date", scope: !623, file: !2, line: 576, type: !185)
!649 = !DILocalVariable(name: "format_copy", scope: !623, file: !2, line: 644, type: !611)
!650 = !DILocalVariable(name: "format_res", scope: !623, file: !2, line: 645, type: !617)
!651 = !DILocalVariable(name: "tzstring", scope: !623, file: !2, line: 646, type: !617)
!652 = !DILocalVariable(name: "tz", scope: !623, file: !2, line: 647, type: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !655)
!654 = !DIFile(filename: "./lib/time.h", directory: "/src")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !654, line: 1039, flags: DIFlagFwdDecl)
!657 = !DILocalVariable(name: "ok", scope: !623, file: !2, line: 649, type: !633)
!658 = !DILocalVariable(name: "valid_date", scope: !659, file: !2, line: 655, type: !633)
!659 = distinct !DILexicalBlock(scope: !660, file: !2, line: 654, column: 5)
!660 = distinct !DILexicalBlock(scope: !623, file: !2, line: 650, column: 7)
!661 = !DILocalVariable(name: "when", scope: !659, file: !2, line: 656, type: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !664)
!663 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!664 = !{!665, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !662, file: !663, line: 16, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !667, line: 160, baseType: !668)
!667 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!668 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !662, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !667, line: 197, baseType: !668)
!671 = !DILocalVariable(name: "refstats", scope: !672, file: !2, line: 683, type: !676)
!672 = distinct !DILexicalBlock(scope: !673, file: !2, line: 682, column: 13)
!673 = distinct !DILexicalBlock(scope: !674, file: !2, line: 681, column: 15)
!674 = distinct !DILexicalBlock(scope: !675, file: !2, line: 679, column: 9)
!675 = distinct !DILexicalBlock(scope: !659, file: !2, line: 658, column: 11)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !677, line: 44, size: 1024, elements: !678)
!677 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!678 = !{!679, !681, !683, !685, !687, !689, !691, !692, !693, !695, !697, !698, !700, !701, !702, !703}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !676, file: !677, line: 46, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !667, line: 145, baseType: !616)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !676, file: !677, line: 47, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !667, line: 148, baseType: !616)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !676, file: !677, line: 48, baseType: !684, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !667, line: 150, baseType: !171)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !676, file: !677, line: 49, baseType: !686, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !667, line: 151, baseType: !171)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !676, file: !677, line: 50, baseType: !688, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !667, line: 146, baseType: !171)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !676, file: !677, line: 51, baseType: !690, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !667, line: 147, baseType: !171)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !676, file: !677, line: 52, baseType: !680, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !676, file: !677, line: 53, baseType: !680, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !676, file: !677, line: 54, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !667, line: 152, baseType: !668)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !676, file: !677, line: 55, baseType: !696, size: 32, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !667, line: 175, baseType: !185)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !676, file: !677, line: 56, baseType: !185, size: 32, offset: 480)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !676, file: !677, line: 57, baseType: !699, size: 64, offset: 512)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !667, line: 180, baseType: !668)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !676, file: !677, line: 65, baseType: !662, size: 128, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !676, file: !677, line: 66, baseType: !662, size: 128, offset: 704)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !676, file: !677, line: 67, baseType: !662, size: 128, offset: 832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !676, file: !677, line: 79, baseType: !704, size: 64, offset: 960)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 64, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 2)
!707 = !DILocalVariable(name: "res", scope: !708, file: !2, line: 690, type: !668)
!708 = distinct !DILexicalBlock(scope: !709, file: !2, line: 689, column: 13)
!709 = distinct !DILexicalBlock(scope: !673, file: !2, line: 688, column: 20)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 768, elements: !711)
!711 = !{!712, !713}
!712 = !DISubrange(count: 3)
!713 = !DISubrange(count: 32)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !2, line: 524, type: !716, isLocal: true, isDefinition: true)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 11)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !623, file: !2, line: 532, type: !721, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 1280, elements: !722)
!722 = !{!21, !713}
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 542, type: !716, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 565, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 8)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !732, isLocal: true, isDefinition: true)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 14)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 16)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 65)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 588, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 63)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !3, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !2, line: 597, type: !3, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 603, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 17)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 610, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 34)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !2, line: 615, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1160, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 145)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 6)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 640, type: !163, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 646, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !779)
!779 = !{!712}
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !778, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !2, line: 705, type: !737, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !2, line: 713, type: !737, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !168, file: !2, line: 108, type: !171, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !184, line: 736, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 75)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !795, file: !184, line: 575, type: !185, isLocal: true, isDefinition: true)
!795 = distinct !DISubprogram(name: "oputs_", scope: !184, file: !184, line: 573, type: !796, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !168, retainedNodes: !798)
!796 = !DISubroutineType(cc: DW_CC_nocall, types: !797)
!797 = !{null, !617, !617}
!798 = !{!799, !800, !801, !804, !805, !806, !807, !811, !812, !813, !814, !816, !866, !867, !868, !870, !871}
!799 = !DILocalVariable(name: "program", arg: 1, scope: !795, file: !184, line: 573, type: !617)
!800 = !DILocalVariable(name: "option", arg: 2, scope: !795, file: !184, line: 573, type: !617)
!801 = !DILocalVariable(name: "term", scope: !802, file: !184, line: 585, type: !617)
!802 = distinct !DILexicalBlock(scope: !803, file: !184, line: 582, column: 5)
!803 = distinct !DILexicalBlock(scope: !795, file: !184, line: 581, column: 7)
!804 = !DILocalVariable(name: "double_space", scope: !795, file: !184, line: 594, type: !633)
!805 = !DILocalVariable(name: "first_word", scope: !795, file: !184, line: 595, type: !617)
!806 = !DILocalVariable(name: "option_text", scope: !795, file: !184, line: 596, type: !617)
!807 = !DILocalVariable(name: "s", scope: !808, file: !184, line: 608, type: !617)
!808 = distinct !DILexicalBlock(scope: !809, file: !184, line: 605, column: 5)
!809 = distinct !DILexicalBlock(scope: !810, file: !184, line: 604, column: 12)
!810 = distinct !DILexicalBlock(scope: !795, file: !184, line: 597, column: 7)
!811 = !DILocalVariable(name: "spaces", scope: !808, file: !184, line: 609, type: !614)
!812 = !DILocalVariable(name: "anchor_len", scope: !795, file: !184, line: 620, type: !614)
!813 = !DILocalVariable(name: "desc_text", scope: !795, file: !184, line: 625, type: !617)
!814 = !DILocalVariable(name: "__ptr", scope: !815, file: !184, line: 644, type: !617)
!815 = distinct !DILexicalBlock(scope: !795, file: !184, line: 644, column: 3)
!816 = !DILocalVariable(name: "__stream", scope: !815, file: !184, line: 644, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !819, line: 7, baseType: !820)
!819 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !821, line: 49, size: 1728, elements: !822)
!821 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !838, !840, !841, !842, !843, !844, !846, !847, !850, !852, !855, !858, !859, !860, !861, !862}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !820, file: !821, line: 51, baseType: !185, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !820, file: !821, line: 54, baseType: !611, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !820, file: !821, line: 55, baseType: !611, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !820, file: !821, line: 56, baseType: !611, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !820, file: !821, line: 57, baseType: !611, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !820, file: !821, line: 58, baseType: !611, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !820, file: !821, line: 59, baseType: !611, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !820, file: !821, line: 60, baseType: !611, size: 64, offset: 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !820, file: !821, line: 61, baseType: !611, size: 64, offset: 512)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !820, file: !821, line: 64, baseType: !611, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !820, file: !821, line: 65, baseType: !611, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !820, file: !821, line: 66, baseType: !611, size: 64, offset: 704)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !820, file: !821, line: 68, baseType: !836, size: 64, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !821, line: 36, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !820, file: !821, line: 70, baseType: !839, size: 64, offset: 832)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !820, file: !821, line: 72, baseType: !185, size: 32, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !820, file: !821, line: 73, baseType: !185, size: 32, offset: 928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !820, file: !821, line: 74, baseType: !694, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !820, file: !821, line: 77, baseType: !613, size: 16, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !820, file: !821, line: 78, baseType: !845, size: 8, offset: 1040)
!845 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !820, file: !821, line: 79, baseType: !153, size: 8, offset: 1048)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !820, file: !821, line: 81, baseType: !848, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !821, line: 43, baseType: null)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !820, file: !821, line: 89, baseType: !851, size: 64, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !667, line: 153, baseType: !668)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !820, file: !821, line: 91, baseType: !853, size: 64, offset: 1216)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !821, line: 37, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !820, file: !821, line: 92, baseType: !856, size: 64, offset: 1280)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !821, line: 38, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !820, file: !821, line: 93, baseType: !839, size: 64, offset: 1344)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !820, file: !821, line: 94, baseType: !612, size: 64, offset: 1408)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !820, file: !821, line: 95, baseType: !614, size: 64, offset: 1472)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !820, file: !821, line: 96, baseType: !185, size: 32, offset: 1536)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !820, file: !821, line: 98, baseType: !863, size: 160, offset: 1568)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 20)
!866 = !DILocalVariable(name: "__cnt", scope: !815, file: !184, line: 644, type: !614)
!867 = !DILocalVariable(name: "url_program", scope: !795, file: !184, line: 648, type: !617)
!868 = !DILocalVariable(name: "__ptr", scope: !869, file: !184, line: 686, type: !617)
!869 = distinct !DILexicalBlock(scope: !795, file: !184, line: 686, column: 3)
!870 = !DILocalVariable(name: "__stream", scope: !869, file: !184, line: 686, type: !817)
!871 = !DILocalVariable(name: "__cnt", scope: !869, file: !184, line: 686, type: !614)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !184, line: 585, type: !19, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !184, line: 586, type: !19, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !184, line: 595, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 4)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !184, line: 620, type: !771, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !885, isLocal: true, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !705)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !184, line: 648, type: !19, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !878, isLocal: true, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !184, line: 649, type: !778, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !184, line: 650, type: !19, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !771, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !184, line: 651, type: !771, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !184, line: 652, type: !900, isLocal: true, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 7)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !184, line: 653, type: !727, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !184, line: 654, type: !158, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !184, line: 655, type: !158, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !184, line: 656, type: !158, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !184, line: 657, type: !158, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !184, line: 663, type: !900, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !184, line: 664, type: !158, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !756, isLocal: true, isDefinition: true)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !184, line: 669, type: !921, isLocal: true, isDefinition: true)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 40)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !926, isLocal: true, isDefinition: true)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 15)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !184, line: 676, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 61)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !184, line: 679, type: !778, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !184, line: 683, type: !19, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !184, line: 688, type: !19, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(scope: null, file: !184, line: 691, type: !727, isLocal: true, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !184, line: 839, type: !737, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !184, line: 840, type: !946, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 22)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !184, line: 841, type: !926, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !184, line: 862, type: !878, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !184, line: 868, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 71)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !184, line: 875, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 27)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 51)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !184, line: 877, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 12)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !771, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !19, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !2, line: 91, type: !979, isLocal: true, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 9)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !158, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !716, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !158, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !727, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !979, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !979, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !2, line: 98, type: !878, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !2, line: 99, type: !878, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 100, type: !878, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !158, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !2, line: 102, type: !19, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !2, line: 103, type: !727, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "long_options", scope: !168, file: !2, line: 86, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 4352, elements: !757)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !1011, line: 50, size: 256, elements: !1012)
!1011 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!1012 = !{!1013, !1014, !1015, !1017}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !1011, line: 52, baseType: !617, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1010, file: !1011, line: 55, baseType: !185, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1010, file: !1011, line: 56, baseType: !1016, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1010, file: !1011, line: 57, baseType: !185, size: 32, offset: 192)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "time_spec", scope: !168, file: !2, line: 65, type: !1020, isLocal: true, isDefinition: true)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 160, elements: !20)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !771, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !727, isLocal: true, isDefinition: true)
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !727, isLocal: true, isDefinition: true)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !778, isLocal: true, isDefinition: true)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !168, file: !2, line: 58, type: !1032, isLocal: true, isDefinition: true)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 384, elements: !772)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !168, file: !2, line: 73, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 200, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 25)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !2, line: 421, type: !885, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !2, line: 423, type: !926, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !2, line: 428, type: !885, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !926, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !184, line: 952, type: !970, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !2, line: 391, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 18)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !2, line: 396, type: !885, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !2, line: 357, type: !900, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !2, line: 363, type: !979, isLocal: true, isDefinition: true)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !727, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(scope: null, file: !2, line: 365, type: !970, isLocal: true, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !716, isLocal: true, isDefinition: true)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 112, elements: !733)
!1067 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 27, type: !163, isLocal: true, isDefinition: true)
!1070 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1070, line: 35, type: !1051, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1075, line: 3, type: !926, isLocal: true, isDefinition: true)
!1075 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "Version", scope: !1078, file: !1075, line: 3, type: !617, isLocal: false, isDefinition: true)
!1078 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1079 = !{!1073, !1076}
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1082, file: !1083, line: 65, type: !1105, isLocal: false, isDefinition: true)
!1082 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1083, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1084, retainedTypes: !1085, globals: !1086, splitDebugInlining: false, nameTableKind: None)
!1083 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1084 = !{!575}
!1085 = !{!612, !617, !619}
!1086 = !{!1080, !1087, !1089, !1091, !1096, !1101, !1103}
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 141, type: !900, isLocal: true, isDefinition: true)
!1089 = !DIGlobalVariableExpression(var: !1090, expr: !DIExpression())
!1090 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 141, type: !960, isLocal: true, isDefinition: true)
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 142, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 29)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 160, type: !1098, isLocal: true, isDefinition: true)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 21)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 165, type: !727, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1083, line: 170, type: !19, isLocal: true, isDefinition: true)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1106, line: 69, baseType: !1107)
!1106 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null}
!1110 = !DIGlobalVariableExpression(var: !1111, expr: !DIExpression())
!1111 = distinct !DIGlobalVariable(name: "file_name", scope: !1112, file: !1113, line: 45, type: !617, isLocal: true, isDefinition: true)
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1113, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1114, splitDebugInlining: false, nameTableKind: None)
!1113 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1114 = !{!1115, !1117, !1119, !1121, !1110, !1123}
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(scope: null, file: !1113, line: 121, type: !900, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(scope: null, file: !1113, line: 121, type: !970, isLocal: true, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(scope: null, file: !1113, line: 123, type: !900, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(scope: null, file: !1113, line: 126, type: !778, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1112, file: !1113, line: 55, type: !633, isLocal: true, isDefinition: true)
!1125 = !DIGlobalVariableExpression(var: !1126, expr: !DIExpression())
!1126 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1127, file: !1128, line: 66, type: !1107, isLocal: false, isDefinition: true)
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1128, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1129, globals: !1130, splitDebugInlining: false, nameTableKind: None)
!1128 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1129 = !{!612, !619}
!1130 = !{!1131, !1133, !1158, !1160, !1162, !1164, !1125, !1166, !1168, !1170, !1172, !1174}
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 272, type: !19, isLocal: true, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1135, file: !1128, line: 304, type: !617, isLocal: true, isDefinition: true)
!1135 = distinct !DISubprogram(name: "verror_at_line", scope: !1128, file: !1128, line: 298, type: !1136, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1127, retainedNodes: !1151)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !185, !185, !617, !171, !617, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1139, line: 52, baseType: !1140)
!1139 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1141, line: 14, baseType: !1142)
!1141 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1143, baseType: !1144)
!1143 = !DIFile(filename: "lib/error.c", directory: "/src")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1144, file: !1143, baseType: !612, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1144, file: !1143, baseType: !612, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1144, file: !1143, baseType: !612, size: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1144, file: !1143, baseType: !185, size: 32, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1144, file: !1143, baseType: !185, size: 32, offset: 224)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1157}
!1152 = !DILocalVariable(name: "status", arg: 1, scope: !1135, file: !1128, line: 298, type: !185)
!1153 = !DILocalVariable(name: "errnum", arg: 2, scope: !1135, file: !1128, line: 298, type: !185)
!1154 = !DILocalVariable(name: "file_name", arg: 3, scope: !1135, file: !1128, line: 298, type: !617)
!1155 = !DILocalVariable(name: "line_number", arg: 4, scope: !1135, file: !1128, line: 298, type: !171)
!1156 = !DILocalVariable(name: "message", arg: 5, scope: !1135, file: !1128, line: 298, type: !617)
!1157 = !DILocalVariable(name: "args", arg: 6, scope: !1135, file: !1128, line: 298, type: !1138)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1135, file: !1128, line: 305, type: !171, isLocal: true, isDefinition: true)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 338, type: !878, isLocal: true, isDefinition: true)
!1162 = !DIGlobalVariableExpression(var: !1163, expr: !DIExpression())
!1163 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 346, type: !727, isLocal: true, isDefinition: true)
!1164 = !DIGlobalVariableExpression(var: !1165, expr: !DIExpression())
!1165 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 346, type: !885, isLocal: true, isDefinition: true)
!1166 = !DIGlobalVariableExpression(var: !1167, expr: !DIExpression())
!1167 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1127, file: !1128, line: 69, type: !171, isLocal: false, isDefinition: true)
!1168 = !DIGlobalVariableExpression(var: !1169, expr: !DIExpression())
!1169 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1127, file: !1128, line: 295, type: !185, isLocal: false, isDefinition: true)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 208, type: !900, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 208, type: !1098, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1128, line: 214, type: !19, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1143, type: !771, isLocal: true, isDefinition: true)
!1178 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1146, type: !727, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1149, type: !771, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1185, file: !1214, line: 75, type: !1287, isLocal: true, isDefinition: true)
!1185 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1186, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1187, retainedTypes: !1195, globals: !1207, splitDebugInlining: false, nameTableKind: None)
!1186 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1187 = !{!1188}
!1188 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1178, line: 163, baseType: !171, size: 32, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194}
!1190 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1191 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1192 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1193 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1194 = !DIEnumerator(name: "NO_PAD", value: 4)
!1195 = !{!612, !633, !171, !668, !616, !185, !619, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !654, line: 1039, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1199, line: 24, size: 128, elements: !1200)
!1199 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1198, file: !1199, line: 28, baseType: !1197, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1198, file: !1199, line: 33, baseType: !4, size: 8, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1198, file: !1199, line: 45, baseType: !1204, offset: 72)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !1205)
!1205 = !{!1206}
!1206 = !DISubrange(count: -1)
!1207 = !{!1176, !1179, !1181, !1208, !1210, !1212, !1183, !1215, !1220, !1222, !1227, !1229, !1231, !1233, !1235, !1237, !1239, !1241, !1244, !1246, !1248, !1250, !1252, !1254, !1256, !1258, !1260, !1262, !1267, !1269, !1271, !1273, !1282, !1285, !1304, !1306, !1308, !1310, !1312, !1314, !1319, !1321, !1323, !1325, !1327, !1329, !1331, !1334, !1337, !1339, !1341, !1343, !1345, !1347, !1349, !1351, !1353, !1355, !1357, !1359, !1361, !1363, !1365, !1367, !1369, !1371, !1373, !1375, !1377, !1379, !1381, !1383, !1385, !1388, !1390, !1392, !1394}
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1151, type: !771, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1153, type: !771, isLocal: true, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 78, type: !979, isLocal: true, isDefinition: true)
!1214 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 26, type: !1217, isLocal: true, isDefinition: true)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !1218)
!1218 = !{!1219}
!1219 = !DISubrange(count: 19)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 26, type: !979, isLocal: true, isDefinition: true)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 27, type: !1224, isLocal: true, isDefinition: true)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1225)
!1225 = !{!1226}
!1226 = !DISubrange(count: 31)
!1227 = !DIGlobalVariableExpression(var: !1228, expr: !DIExpression())
!1228 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 27, type: !979, isLocal: true, isDefinition: true)
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 28, type: !1217, isLocal: true, isDefinition: true)
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 28, type: !970, isLocal: true, isDefinition: true)
!1233 = !DIGlobalVariableExpression(var: !1234, expr: !DIExpression())
!1234 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 29, type: !1217, isLocal: true, isDefinition: true)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 29, type: !970, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 30, type: !946, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 30, type: !979, isLocal: true, isDefinition: true)
!1241 = !DIGlobalVariableExpression(var: !1242, expr: !DIExpression())
!1242 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 31, type: !1243, isLocal: true, isDefinition: true)
!1243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !1037)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 31, type: !970, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 32, type: !946, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 32, type: !979, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 33, type: !946, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 33, type: !979, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 34, type: !946, isLocal: true, isDefinition: true)
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 34, type: !979, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 35, type: !1217, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 35, type: !979, isLocal: true, isDefinition: true)
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 36, type: !1264, isLocal: true, isDefinition: true)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1265)
!1265 = !{!1266}
!1266 = !DISubrange(count: 28)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 36, type: !979, isLocal: true, isDefinition: true)
!1269 = !DIGlobalVariableExpression(var: !1270, expr: !DIExpression())
!1270 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 37, type: !946, isLocal: true, isDefinition: true)
!1271 = !DIGlobalVariableExpression(var: !1272, expr: !DIExpression())
!1272 = distinct !DIGlobalVariable(scope: null, file: !1214, line: 37, type: !979, isLocal: true, isDefinition: true)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1185, file: !1214, line: 21, type: !1275, isLocal: true, isDefinition: true)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 1920, elements: !927)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1278, line: 19, size: 128, elements: !1279)
!1278 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1277, file: !1278, line: 21, baseType: !617, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1277, file: !1278, line: 22, baseType: !617, size: 64, offset: 64)
!1282 = !DIGlobalVariableExpression(var: !1283, expr: !DIExpression())
!1283 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 134, type: !970, isLocal: true, isDefinition: true)
!1284 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1185, file: !1284, line: 131, type: !1287, isLocal: true, isDefinition: true)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1278, line: 33, size: 192, elements: !1289)
!1289 = !{!1290, !1302, !1303}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1288, file: !1278, line: 39, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!185, !1294, !185, !185, !185}
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1278, line: 25, size: 192, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1295, file: !1278, line: 27, baseType: !185, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1295, file: !1278, line: 28, baseType: !185, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1295, file: !1278, line: 29, baseType: !185, size: 32, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1295, file: !1278, line: 30, baseType: !1301, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1288, file: !1278, line: 42, baseType: !617, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1288, file: !1278, line: 44, baseType: !171, size: 32, offset: 128)
!1304 = !DIGlobalVariableExpression(var: !1305, expr: !DIExpression())
!1305 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 39, type: !926, isLocal: true, isDefinition: true)
!1306 = !DIGlobalVariableExpression(var: !1307, expr: !DIExpression())
!1307 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 40, type: !756, isLocal: true, isDefinition: true)
!1308 = !DIGlobalVariableExpression(var: !1309, expr: !DIExpression())
!1309 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 41, type: !716, isLocal: true, isDefinition: true)
!1310 = !DIGlobalVariableExpression(var: !1311, expr: !DIExpression())
!1311 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 42, type: !900, isLocal: true, isDefinition: true)
!1312 = !DIGlobalVariableExpression(var: !1313, expr: !DIExpression())
!1313 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 43, type: !716, isLocal: true, isDefinition: true)
!1314 = !DIGlobalVariableExpression(var: !1315, expr: !DIExpression())
!1315 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 44, type: !1316, isLocal: true, isDefinition: true)
!1316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !1317)
!1317 = !{!1318}
!1318 = !DISubrange(count: 13)
!1319 = !DIGlobalVariableExpression(var: !1320, expr: !DIExpression())
!1320 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 45, type: !900, isLocal: true, isDefinition: true)
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 46, type: !979, isLocal: true, isDefinition: true)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 47, type: !900, isLocal: true, isDefinition: true)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 48, type: !19, isLocal: true, isDefinition: true)
!1327 = !DIGlobalVariableExpression(var: !1328, expr: !DIExpression())
!1328 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 49, type: !979, isLocal: true, isDefinition: true)
!1329 = !DIGlobalVariableExpression(var: !1330, expr: !DIExpression())
!1330 = distinct !DIGlobalVariable(scope: null, file: !1284, line: 50, type: !716, isLocal: true, isDefinition: true)
!1331 = !DIGlobalVariableExpression(var: !1332, expr: !DIExpression())
!1332 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1185, file: !1284, line: 37, type: !1333, isLocal: true, isDefinition: true)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 1536, elements: !971)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1185, file: !1336, line: 76, type: !1287, isLocal: true, isDefinition: true)
!1336 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1337 = !DIGlobalVariableExpression(var: !1338, expr: !DIExpression())
!1338 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 23, type: !737, isLocal: true, isDefinition: true)
!1339 = !DIGlobalVariableExpression(var: !1340, expr: !DIExpression())
!1340 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 23, type: !900, isLocal: true, isDefinition: true)
!1341 = !DIGlobalVariableExpression(var: !1342, expr: !DIExpression())
!1342 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 24, type: !1316, isLocal: true, isDefinition: true)
!1343 = !DIGlobalVariableExpression(var: !1344, expr: !DIExpression())
!1344 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 24, type: !900, isLocal: true, isDefinition: true)
!1345 = !DIGlobalVariableExpression(var: !1346, expr: !DIExpression())
!1346 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 25, type: !158, isLocal: true, isDefinition: true)
!1347 = !DIGlobalVariableExpression(var: !1348, expr: !DIExpression())
!1348 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 25, type: !900, isLocal: true, isDefinition: true)
!1349 = !DIGlobalVariableExpression(var: !1350, expr: !DIExpression())
!1350 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 26, type: !1316, isLocal: true, isDefinition: true)
!1351 = !DIGlobalVariableExpression(var: !1352, expr: !DIExpression())
!1352 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 26, type: !900, isLocal: true, isDefinition: true)
!1353 = !DIGlobalVariableExpression(var: !1354, expr: !DIExpression())
!1354 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 27, type: !900, isLocal: true, isDefinition: true)
!1355 = !DIGlobalVariableExpression(var: !1356, expr: !DIExpression())
!1356 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 28, type: !1316, isLocal: true, isDefinition: true)
!1357 = !DIGlobalVariableExpression(var: !1358, expr: !DIExpression())
!1358 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 28, type: !900, isLocal: true, isDefinition: true)
!1359 = !DIGlobalVariableExpression(var: !1360, expr: !DIExpression())
!1360 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 29, type: !1316, isLocal: true, isDefinition: true)
!1361 = !DIGlobalVariableExpression(var: !1362, expr: !DIExpression())
!1362 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 29, type: !900, isLocal: true, isDefinition: true)
!1363 = !DIGlobalVariableExpression(var: !1364, expr: !DIExpression())
!1364 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 30, type: !1316, isLocal: true, isDefinition: true)
!1365 = !DIGlobalVariableExpression(var: !1366, expr: !DIExpression())
!1366 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 30, type: !900, isLocal: true, isDefinition: true)
!1367 = !DIGlobalVariableExpression(var: !1368, expr: !DIExpression())
!1368 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 31, type: !1316, isLocal: true, isDefinition: true)
!1369 = !DIGlobalVariableExpression(var: !1370, expr: !DIExpression())
!1370 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 31, type: !900, isLocal: true, isDefinition: true)
!1371 = !DIGlobalVariableExpression(var: !1372, expr: !DIExpression())
!1372 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 32, type: !900, isLocal: true, isDefinition: true)
!1373 = !DIGlobalVariableExpression(var: !1374, expr: !DIExpression())
!1374 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 33, type: !158, isLocal: true, isDefinition: true)
!1375 = !DIGlobalVariableExpression(var: !1376, expr: !DIExpression())
!1376 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 33, type: !900, isLocal: true, isDefinition: true)
!1377 = !DIGlobalVariableExpression(var: !1378, expr: !DIExpression())
!1378 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 34, type: !158, isLocal: true, isDefinition: true)
!1379 = !DIGlobalVariableExpression(var: !1380, expr: !DIExpression())
!1380 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 34, type: !900, isLocal: true, isDefinition: true)
!1381 = !DIGlobalVariableExpression(var: !1382, expr: !DIExpression())
!1382 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 35, type: !1316, isLocal: true, isDefinition: true)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1336, line: 35, type: !900, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(name: "ethiopian_month_names", scope: !1185, file: !1336, line: 21, type: !1387, isLocal: true, isDefinition: true)
!1387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1276, size: 1664, elements: !1317)
!1388 = !DIGlobalVariableExpression(var: !1389, expr: !DIExpression())
!1389 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1802, type: !979, isLocal: true, isDefinition: true)
!1390 = !DIGlobalVariableExpression(var: !1391, expr: !DIExpression())
!1391 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 1961, type: !979, isLocal: true, isDefinition: true)
!1392 = !DIGlobalVariableExpression(var: !1393, expr: !DIExpression())
!1393 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 2058, type: !771, isLocal: true, isDefinition: true)
!1394 = !DIGlobalVariableExpression(var: !1395, expr: !DIExpression())
!1395 = distinct !DIGlobalVariable(scope: null, file: !1178, line: 2134, type: !979, isLocal: true, isDefinition: true)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 873, type: !153, isLocal: true, isDefinition: true)
!1398 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 1032, type: !771, isLocal: true, isDefinition: true)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(scope: null, file: !1403, line: 2855, type: !885, isLocal: true, isDefinition: true)
!1403 = !DIFile(filename: "lib/localename-unsafe.c", directory: "/src", checksumkind: CSK_MD5, checksum: "45a37c67528fdbd78dc60a7c85e31bd5")
!1404 = !DIGlobalVariableExpression(var: !1405, expr: !DIExpression())
!1405 = distinct !DIGlobalVariable(name: "yyval_default", scope: !1406, file: !1407, line: 1600, type: !1731, isLocal: true, isDefinition: true)
!1406 = distinct !DISubprogram(name: "yyparse", scope: !1407, file: !1407, line: 1591, type: !1408, scopeLine: 1592, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1481, retainedNodes: !2393)
!1407 = !DIFile(filename: "parse-datetime.c", directory: "/src")
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!185, !1410}
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !1412, line: 252, baseType: !1413)
!1412 = !DIFile(filename: "parse-datetime.y", directory: "/src")
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1412, line: 184, size: 2304, elements: !1414)
!1414 = !{!1415, !1416, !1420, !1421, !1422, !1423, !1424, !1434, !1435, !1436, !1437, !1438, !1443, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1413, file: !1412, line: 187, baseType: !617, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !1413, file: !1412, line: 190, baseType: !1417, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !1418, line: 101, baseType: !1419)
!1418 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !667, line: 72, baseType: !668)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !1413, file: !1412, line: 193, baseType: !185, size: 32, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !1413, file: !1412, line: 196, baseType: !185, size: 32, offset: 160)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !1413, file: !1412, line: 199, baseType: !185, size: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !1413, file: !1412, line: 202, baseType: !185, size: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1413, file: !1412, line: 205, baseType: !1425, size: 192, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !1412, line: 143, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1412, line: 138, size: 192, elements: !1427)
!1427 = !{!1428, !1429, !1430}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !1426, file: !1412, line: 140, baseType: !633, size: 8)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1426, file: !1412, line: 141, baseType: !1417, size: 64, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !1426, file: !1412, line: 142, baseType: !1431, size: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1432, line: 130, baseType: !1433)
!1432 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !615, line: 35, baseType: !668)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1413, file: !1412, line: 206, baseType: !1417, size: 64, offset: 448)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1413, file: !1412, line: 207, baseType: !1417, size: 64, offset: 512)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1413, file: !1412, line: 208, baseType: !1417, size: 64, offset: 576)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1413, file: !1412, line: 209, baseType: !1417, size: 64, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1413, file: !1412, line: 210, baseType: !1439, size: 128, offset: 704)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !663, line: 11, size: 128, elements: !1440)
!1440 = !{!1441, !1442}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1439, file: !663, line: 16, baseType: !666, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1439, file: !663, line: 21, baseType: !670, size: 64, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !1413, file: !1412, line: 213, baseType: !1444, size: 448, offset: 832)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !1412, line: 175, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1412, line: 165, size: 448, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1453}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1445, file: !1412, line: 168, baseType: !1417, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1445, file: !1412, line: 169, baseType: !1417, size: 64, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1445, file: !1412, line: 170, baseType: !1417, size: 64, offset: 128)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !1445, file: !1412, line: 171, baseType: !1417, size: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1445, file: !1412, line: 172, baseType: !1417, size: 64, offset: 256)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1445, file: !1412, line: 173, baseType: !1417, size: 64, offset: 320)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1445, file: !1412, line: 174, baseType: !185, size: 32, offset: 384)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !1413, file: !1412, line: 216, baseType: !633, size: 8, offset: 1280)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !1413, file: !1412, line: 217, baseType: !633, size: 8, offset: 1288)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !1413, file: !1412, line: 218, baseType: !1431, size: 64, offset: 1344)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !1413, file: !1412, line: 219, baseType: !1431, size: 64, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "J_zones_seen", scope: !1413, file: !1412, line: 220, baseType: !1431, size: 64, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !1413, file: !1412, line: 221, baseType: !1431, size: 64, offset: 1536)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !1413, file: !1412, line: 222, baseType: !1431, size: 64, offset: 1600)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !1413, file: !1412, line: 223, baseType: !1431, size: 64, offset: 1664)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !1413, file: !1412, line: 224, baseType: !1431, size: 64, offset: 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !1413, file: !1412, line: 225, baseType: !633, size: 8, offset: 1792)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "not_decimal", scope: !1413, file: !1412, line: 227, baseType: !633, size: 8, offset: 1800)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !1413, file: !1412, line: 231, baseType: !633, size: 8, offset: 1808)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !1413, file: !1412, line: 235, baseType: !633, size: 8, offset: 1816)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !1413, file: !1412, line: 236, baseType: !633, size: 8, offset: 1824)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !1413, file: !1412, line: 237, baseType: !633, size: 8, offset: 1832)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !1413, file: !1412, line: 238, baseType: !633, size: 8, offset: 1840)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !1413, file: !1412, line: 239, baseType: !633, size: 8, offset: 1848)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !1413, file: !1412, line: 240, baseType: !633, size: 8, offset: 1856)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !1413, file: !1412, line: 243, baseType: !633, size: 8, offset: 1864)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !1413, file: !1412, line: 246, baseType: !1474, size: 384, offset: 1920)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1475, size: 384, elements: !779)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !1412, line: 151, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1412, line: 146, size: 128, elements: !1477)
!1477 = !{!1478, !1479, !1480}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1476, file: !1412, line: 148, baseType: !617, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1476, file: !1412, line: 149, baseType: !185, size: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1476, file: !1412, line: 150, baseType: !185, size: 32, offset: 96)
!1481 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1482, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1483, retainedTypes: !1723, globals: !1739, splitDebugInlining: false, nameTableKind: None)
!1482 = !DIFile(filename: "lib/parse-datetime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4ad0112e68fb719bedea01398b4b2919")
!1483 = !{!1484, !1544, !1571, !1576, !1580, !1720}
!1484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yysymbol_kind_t", file: !1407, line: 734, baseType: !185, size: 32, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543}
!1486 = !DIEnumerator(name: "YYSYMBOL_YYEMPTY", value: -2)
!1487 = !DIEnumerator(name: "YYSYMBOL_YYEOF", value: 0)
!1488 = !DIEnumerator(name: "YYSYMBOL_YYerror", value: 1)
!1489 = !DIEnumerator(name: "YYSYMBOL_YYUNDEF", value: 2)
!1490 = !DIEnumerator(name: "YYSYMBOL_tAGO", value: 3)
!1491 = !DIEnumerator(name: "YYSYMBOL_tDST", value: 4)
!1492 = !DIEnumerator(name: "YYSYMBOL_tYEAR_UNIT", value: 5)
!1493 = !DIEnumerator(name: "YYSYMBOL_tMONTH_UNIT", value: 6)
!1494 = !DIEnumerator(name: "YYSYMBOL_tHOUR_UNIT", value: 7)
!1495 = !DIEnumerator(name: "YYSYMBOL_tMINUTE_UNIT", value: 8)
!1496 = !DIEnumerator(name: "YYSYMBOL_tSEC_UNIT", value: 9)
!1497 = !DIEnumerator(name: "YYSYMBOL_tDAY_UNIT", value: 10)
!1498 = !DIEnumerator(name: "YYSYMBOL_tDAY_SHIFT", value: 11)
!1499 = !DIEnumerator(name: "YYSYMBOL_tDAY", value: 12)
!1500 = !DIEnumerator(name: "YYSYMBOL_tDAYZONE", value: 13)
!1501 = !DIEnumerator(name: "YYSYMBOL_tLOCAL_ZONE", value: 14)
!1502 = !DIEnumerator(name: "YYSYMBOL_tMERIDIAN", value: 15)
!1503 = !DIEnumerator(name: "YYSYMBOL_tMONTH", value: 16)
!1504 = !DIEnumerator(name: "YYSYMBOL_tORDINAL", value: 17)
!1505 = !DIEnumerator(name: "YYSYMBOL_tZONE", value: 18)
!1506 = !DIEnumerator(name: "YYSYMBOL_tSNUMBER", value: 19)
!1507 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER", value: 20)
!1508 = !DIEnumerator(name: "YYSYMBOL_tUNUMBER_DOTTED", value: 21)
!1509 = !DIEnumerator(name: "YYSYMBOL_tSDECIMAL_NUMBER", value: 22)
!1510 = !DIEnumerator(name: "YYSYMBOL_tUDECIMAL_NUMBER", value: 23)
!1511 = !DIEnumerator(name: "YYSYMBOL_24_", value: 24)
!1512 = !DIEnumerator(name: "YYSYMBOL_25_J_", value: 25)
!1513 = !DIEnumerator(name: "YYSYMBOL_26_T_", value: 26)
!1514 = !DIEnumerator(name: "YYSYMBOL_27_", value: 27)
!1515 = !DIEnumerator(name: "YYSYMBOL_28_", value: 28)
!1516 = !DIEnumerator(name: "YYSYMBOL_29_", value: 29)
!1517 = !DIEnumerator(name: "YYSYMBOL_30_", value: 30)
!1518 = !DIEnumerator(name: "YYSYMBOL_YYACCEPT", value: 31)
!1519 = !DIEnumerator(name: "YYSYMBOL_spec", value: 32)
!1520 = !DIEnumerator(name: "YYSYMBOL_timespec", value: 33)
!1521 = !DIEnumerator(name: "YYSYMBOL_items", value: 34)
!1522 = !DIEnumerator(name: "YYSYMBOL_item", value: 35)
!1523 = !DIEnumerator(name: "YYSYMBOL_datetime", value: 36)
!1524 = !DIEnumerator(name: "YYSYMBOL_iso_8601_datetime", value: 37)
!1525 = !DIEnumerator(name: "YYSYMBOL_time", value: 38)
!1526 = !DIEnumerator(name: "YYSYMBOL_iso_8601_time", value: 39)
!1527 = !DIEnumerator(name: "YYSYMBOL_o_zone_offset", value: 40)
!1528 = !DIEnumerator(name: "YYSYMBOL_zone_offset", value: 41)
!1529 = !DIEnumerator(name: "YYSYMBOL_local_zone", value: 42)
!1530 = !DIEnumerator(name: "YYSYMBOL_zone", value: 43)
!1531 = !DIEnumerator(name: "YYSYMBOL_day", value: 44)
!1532 = !DIEnumerator(name: "YYSYMBOL_date", value: 45)
!1533 = !DIEnumerator(name: "YYSYMBOL_iso_8601_date", value: 46)
!1534 = !DIEnumerator(name: "YYSYMBOL_rel", value: 47)
!1535 = !DIEnumerator(name: "YYSYMBOL_relunit", value: 48)
!1536 = !DIEnumerator(name: "YYSYMBOL_relunit_snumber", value: 49)
!1537 = !DIEnumerator(name: "YYSYMBOL_dayshift", value: 50)
!1538 = !DIEnumerator(name: "YYSYMBOL_seconds", value: 51)
!1539 = !DIEnumerator(name: "YYSYMBOL_signed_seconds", value: 52)
!1540 = !DIEnumerator(name: "YYSYMBOL_unsigned_seconds", value: 53)
!1541 = !DIEnumerator(name: "YYSYMBOL_number", value: 54)
!1542 = !DIEnumerator(name: "YYSYMBOL_hybrid", value: 55)
!1543 = !DIEnumerator(name: "YYSYMBOL_o_colon_minutes", value: 56)
!1544 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "yytokentype", file: !1407, line: 676, baseType: !185, size: 32, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570}
!1546 = !DIEnumerator(name: "YYEMPTY", value: -2)
!1547 = !DIEnumerator(name: "YYEOF", value: 0)
!1548 = !DIEnumerator(name: "YYerror", value: 256)
!1549 = !DIEnumerator(name: "YYUNDEF", value: 257)
!1550 = !DIEnumerator(name: "tAGO", value: 258)
!1551 = !DIEnumerator(name: "tDST", value: 259)
!1552 = !DIEnumerator(name: "tYEAR_UNIT", value: 260)
!1553 = !DIEnumerator(name: "tMONTH_UNIT", value: 261)
!1554 = !DIEnumerator(name: "tHOUR_UNIT", value: 262)
!1555 = !DIEnumerator(name: "tMINUTE_UNIT", value: 263)
!1556 = !DIEnumerator(name: "tSEC_UNIT", value: 264)
!1557 = !DIEnumerator(name: "tDAY_UNIT", value: 265)
!1558 = !DIEnumerator(name: "tDAY_SHIFT", value: 266)
!1559 = !DIEnumerator(name: "tDAY", value: 267)
!1560 = !DIEnumerator(name: "tDAYZONE", value: 268)
!1561 = !DIEnumerator(name: "tLOCAL_ZONE", value: 269)
!1562 = !DIEnumerator(name: "tMERIDIAN", value: 270)
!1563 = !DIEnumerator(name: "tMONTH", value: 271)
!1564 = !DIEnumerator(name: "tORDINAL", value: 272)
!1565 = !DIEnumerator(name: "tZONE", value: 273)
!1566 = !DIEnumerator(name: "tSNUMBER", value: 274)
!1567 = !DIEnumerator(name: "tUNUMBER", value: 275)
!1568 = !DIEnumerator(name: "tUNUMBER_DOTTED", value: 276)
!1569 = !DIEnumerator(name: "tSDECIMAL_NUMBER", value: 277)
!1570 = !DIEnumerator(name: "tUDECIMAL_NUMBER", value: 278)
!1571 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1412, line: 154, baseType: !171, size: 32, elements: !1572)
!1572 = !{!1573, !1574, !1575}
!1573 = !DIEnumerator(name: "MERam", value: 0)
!1574 = !DIEnumerator(name: "MERpm", value: 1)
!1575 = !DIEnumerator(name: "MER24", value: 2)
!1576 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1412, line: 162, baseType: !171, size: 32, elements: !1577)
!1577 = !{!1578, !1579}
!1578 = !DIEnumerator(name: "BILLION", value: 1000000000)
!1579 = !DIEnumerator(name: "LOG10_BILLION", value: 9)
!1580 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1581, file: !1412, line: 1781, baseType: !171, size: 32, elements: !1718)
!1581 = distinct !DISubprogram(name: "parse_datetime_body", scope: !1412, file: !1412, line: 1767, type: !1582, scopeLine: 1770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1481, retainedNodes: !1587)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!633, !1584, !617, !1585, !171, !653, !617}
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1587 = !{!1588, !1589, !1590, !1591, !1592, !1593, !1594, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1623, !1624, !1625, !1626, !1628, !1631, !1632, !1633, !1639, !1640, !1641, !1642, !1643, !1645, !1648, !1649, !1656, !1659, !1660, !1666, !1667, !1668, !1671, !1672, !1675, !1676, !1677, !1682, !1685, !1686, !1687, !1688, !1691, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1705, !1706, !1709, !1710, !1711, !1712, !1713, !1716, !1717}
!1588 = !DILocalVariable(name: "result", arg: 1, scope: !1581, file: !1412, line: 1767, type: !1584)
!1589 = !DILocalVariable(name: "p", arg: 2, scope: !1581, file: !1412, line: 1767, type: !617)
!1590 = !DILocalVariable(name: "now", arg: 3, scope: !1581, file: !1412, line: 1768, type: !1585)
!1591 = !DILocalVariable(name: "flags", arg: 4, scope: !1581, file: !1412, line: 1768, type: !171)
!1592 = !DILocalVariable(name: "tzdefault", arg: 5, scope: !1581, file: !1412, line: 1769, type: !653)
!1593 = !DILocalVariable(name: "tzstring", arg: 6, scope: !1581, file: !1412, line: 1769, type: !617)
!1594 = !DILocalVariable(name: "tm", scope: !1581, file: !1412, line: 1771, type: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1596, line: 7, size: 448, elements: !1597)
!1596 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!1597 = !{!1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1595, file: !1596, line: 9, baseType: !185, size: 32)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1595, file: !1596, line: 10, baseType: !185, size: 32, offset: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1595, file: !1596, line: 11, baseType: !185, size: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1595, file: !1596, line: 12, baseType: !185, size: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1595, file: !1596, line: 13, baseType: !185, size: 32, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1595, file: !1596, line: 14, baseType: !185, size: 32, offset: 160)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1595, file: !1596, line: 15, baseType: !185, size: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1595, file: !1596, line: 16, baseType: !185, size: 32, offset: 224)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1595, file: !1596, line: 17, baseType: !185, size: 32, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1595, file: !1596, line: 20, baseType: !668, size: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1595, file: !1596, line: 21, baseType: !617, size: 64, offset: 384)
!1609 = !DILocalVariable(name: "tm0", scope: !1581, file: !1412, line: 1772, type: !1595)
!1610 = !DILocalVariable(name: "time_zone_buf", scope: !1581, file: !1412, line: 1773, type: !960)
!1611 = !DILocalVariable(name: "dbg_tm", scope: !1581, file: !1412, line: 1774, type: !1612)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !1613)
!1613 = !{!1614}
!1614 = !DISubrange(count: 100)
!1615 = !DILocalVariable(name: "ok", scope: !1581, file: !1412, line: 1775, type: !633)
!1616 = !DILocalVariable(name: "input_sentinel", scope: !1581, file: !1412, line: 1776, type: !617)
!1617 = !DILocalVariable(name: "tz1alloc", scope: !1581, file: !1412, line: 1777, type: !611)
!1618 = !DILocalVariable(name: "tz1buf", scope: !1581, file: !1412, line: 1782, type: !1612)
!1619 = !DILocalVariable(name: "gettime_buffer", scope: !1581, file: !1412, line: 1784, type: !1439)
!1620 = !DILocalVariable(name: "Start", scope: !1581, file: !1412, line: 1791, type: !1621)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1622, line: 10, baseType: !666)
!1622 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!1623 = !DILocalVariable(name: "Start_ns", scope: !1581, file: !1412, line: 1792, type: !185)
!1624 = !DILocalVariable(name: "c", scope: !1581, file: !1412, line: 1794, type: !619)
!1625 = !DILocalVariable(name: "tz", scope: !1581, file: !1412, line: 1798, type: !653)
!1626 = !DILocalVariable(name: "rel_time_0", scope: !1581, file: !1412, line: 1803, type: !1627)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1444)
!1628 = !DILocalVariable(name: "tzbase", scope: !1629, file: !1412, line: 1807, type: !617)
!1629 = distinct !DILexicalBlock(scope: !1630, file: !1412, line: 1806, column: 5)
!1630 = distinct !DILexicalBlock(scope: !1581, file: !1412, line: 1805, column: 7)
!1631 = !DILocalVariable(name: "tzsize", scope: !1629, file: !1412, line: 1808, type: !1431)
!1632 = !DILocalVariable(name: "s", scope: !1629, file: !1412, line: 1809, type: !617)
!1633 = !DILocalVariable(name: "tz1", scope: !1634, file: !1412, line: 1820, type: !653)
!1634 = distinct !DILexicalBlock(scope: !1635, file: !1412, line: 1819, column: 11)
!1635 = distinct !DILexicalBlock(scope: !1636, file: !1412, line: 1818, column: 18)
!1636 = distinct !DILexicalBlock(scope: !1637, file: !1412, line: 1812, column: 13)
!1637 = distinct !DILexicalBlock(scope: !1638, file: !1412, line: 1811, column: 7)
!1638 = distinct !DILexicalBlock(scope: !1629, file: !1412, line: 1811, column: 7)
!1639 = !DILocalVariable(name: "tz1string", scope: !1634, file: !1412, line: 1821, type: !611)
!1640 = !DILocalVariable(name: "z", scope: !1634, file: !1412, line: 1822, type: !611)
!1641 = !DILocalVariable(name: "tmp", scope: !1581, file: !1412, line: 1848, type: !1595)
!1642 = !DILocalVariable(name: "pc", scope: !1581, file: !1412, line: 1858, type: !1411)
!1643 = !DILocalVariable(name: "quarter", scope: !1644, file: !1412, line: 1903, type: !185)
!1644 = distinct !DILexicalBlock(scope: !1581, file: !1412, line: 1903, column: 3)
!1645 = !DILocalVariable(name: "probe", scope: !1646, file: !1412, line: 1905, type: !1621)
!1646 = distinct !DILexicalBlock(scope: !1647, file: !1412, line: 1904, column: 5)
!1647 = distinct !DILexicalBlock(scope: !1644, file: !1412, line: 1903, column: 3)
!1648 = !DILocalVariable(name: "probe_tm", scope: !1646, file: !1412, line: 1908, type: !1595)
!1649 = !DILocalVariable(name: "mrd", scope: !1650, file: !1412, line: 2015, type: !617)
!1650 = distinct !DILexicalBlock(scope: !1651, file: !1412, line: 2014, column: 13)
!1651 = distinct !DILexicalBlock(scope: !1652, file: !1412, line: 2013, column: 15)
!1652 = distinct !DILexicalBlock(scope: !1653, file: !1412, line: 2011, column: 9)
!1653 = distinct !DILexicalBlock(scope: !1654, file: !1412, line: 2010, column: 11)
!1654 = distinct !DILexicalBlock(scope: !1655, file: !1412, line: 1982, column: 5)
!1655 = distinct !DILexicalBlock(scope: !1581, file: !1412, line: 1979, column: 7)
