; ModuleID = 'src/df.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.field_data_t = type { i32, ptr, i32, ptr, i32, i8, i8 }
%struct.fs_usage = type { i64, i64, i64, i64, i8, i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.devlist = type { i64, ptr, ptr, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.fs_type_list = type { ptr, ptr }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.field_values_t = type { i64, i64, i64, i64, i8, i64, i64, i8 }
%struct.saved_cwd = type { i32, ptr }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { ptr, i64, %union.anon.4 }
%union.anon.4 = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, fp128 }

!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 14)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 18)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !138, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 16)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1714, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 12)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1726, type: !289, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1729, type: !277, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1751, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 47)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1774, type: !19, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1803, type: !123, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1804, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 5)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1804, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 42)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 6)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 2)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1840, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 26)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "show_all_fs", scope: !143, file: !2, line: 62, type: !337, isLocal: true, isDefinition: true)
!337 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "show_local_fs", scope: !143, file: !2, line: 65, type: !337, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "show_listed_fs", scope: !143, file: !2, line: 69, type: !337, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "output_block_size", scope: !143, file: !2, line: 75, type: !259, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "file_systems_processed", scope: !143, file: !2, line: 78, type: !337, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "require_sync", scope: !143, file: !2, line: 84, type: !337, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "exit_status", scope: !143, file: !2, line: 87, type: !182, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "fs_select_list", scope: !143, file: !2, line: 108, type: !352, isLocal: true, isDefinition: true)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_type_list", file: !2, line: 91, size: 128, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "fs_name", scope: !353, file: !2, line: 93, baseType: !246, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fs_next", scope: !353, file: !2, line: 94, baseType: !352, size: 64, offset: 64)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "fs_exclude_list", scope: !143, file: !2, line: 113, type: !352, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "mount_list", scope: !143, file: !2, line: 116, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mount_entry", file: !363, line: 35, size: 448, elements: !364)
!363 = !DIFile(filename: "./lib/mountlist.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0b721ac4f5b5eea4f8f1c70f7145ac5d")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "me_devname", scope: !362, file: !363, line: 37, baseType: !246, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "me_mountdir", scope: !362, file: !363, line: 38, baseType: !246, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "me_mntroot", scope: !362, file: !363, line: 39, baseType: !246, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "me_type", scope: !362, file: !363, line: 41, baseType: !246, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "me_dev", scope: !362, file: !363, line: 42, baseType: !255, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "me_dummy", scope: !362, file: !363, line: 43, baseType: !147, size: 1, offset: 320, flags: DIFlagBitField, extraData: i64 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "me_remote", scope: !362, file: !363, line: 44, baseType: !147, size: 1, offset: 321, flags: DIFlagBitField, extraData: i64 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "me_type_malloced", scope: !362, file: !363, line: 45, baseType: !147, size: 1, offset: 322, flags: DIFlagBitField, extraData: i64 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "me_next", scope: !362, file: !363, line: 46, baseType: !361, size: 64, offset: 384)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "print_type", scope: !143, file: !2, line: 119, type: !337, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !143, file: !2, line: 122, type: !337, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !24, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !382, file: !181, line: 575, type: !182, isLocal: true, isDefinition: true)
!382 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !383, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !385)
!383 = !DISubroutineType(cc: DW_CC_nocall, types: !384)
!384 = !{null, !252, !252}
!385 = !{!386, !387, !388, !391, !392, !393, !394, !398, !399, !400, !401, !403, !455, !456, !457, !459, !460}
!386 = !DILocalVariable(name: "program", arg: 1, scope: !382, file: !181, line: 573, type: !252)
!387 = !DILocalVariable(name: "option", arg: 2, scope: !382, file: !181, line: 573, type: !252)
!388 = !DILocalVariable(name: "term", scope: !389, file: !181, line: 585, type: !252)
!389 = distinct !DILexicalBlock(scope: !390, file: !181, line: 582, column: 5)
!390 = distinct !DILexicalBlock(scope: !382, file: !181, line: 581, column: 7)
!391 = !DILocalVariable(name: "double_space", scope: !382, file: !181, line: 594, type: !337)
!392 = !DILocalVariable(name: "first_word", scope: !382, file: !181, line: 595, type: !252)
!393 = !DILocalVariable(name: "option_text", scope: !382, file: !181, line: 596, type: !252)
!394 = !DILocalVariable(name: "s", scope: !395, file: !181, line: 608, type: !252)
!395 = distinct !DILexicalBlock(scope: !396, file: !181, line: 605, column: 5)
!396 = distinct !DILexicalBlock(scope: !397, file: !181, line: 604, column: 12)
!397 = distinct !DILexicalBlock(scope: !382, file: !181, line: 597, column: 7)
!398 = !DILocalVariable(name: "spaces", scope: !395, file: !181, line: 609, type: !249)
!399 = !DILocalVariable(name: "anchor_len", scope: !382, file: !181, line: 620, type: !249)
!400 = !DILocalVariable(name: "desc_text", scope: !382, file: !181, line: 625, type: !252)
!401 = !DILocalVariable(name: "__ptr", scope: !402, file: !181, line: 644, type: !252)
!402 = distinct !DILexicalBlock(scope: !382, file: !181, line: 644, column: 3)
!403 = !DILocalVariable(name: "__stream", scope: !402, file: !181, line: 644, type: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !406, line: 7, baseType: !407)
!406 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !408, line: 49, size: 1728, elements: !409)
!408 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !425, !427, !428, !429, !432, !433, !435, !436, !439, !441, !444, !447, !448, !449, !450, !451}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !407, file: !408, line: 51, baseType: !182, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !407, file: !408, line: 54, baseType: !246, size: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !407, file: !408, line: 55, baseType: !246, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !407, file: !408, line: 56, baseType: !246, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !407, file: !408, line: 57, baseType: !246, size: 64, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !407, file: !408, line: 58, baseType: !246, size: 64, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !407, file: !408, line: 59, baseType: !246, size: 64, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !407, file: !408, line: 60, baseType: !246, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !407, file: !408, line: 61, baseType: !246, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !407, file: !408, line: 64, baseType: !246, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !407, file: !408, line: 65, baseType: !246, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !407, file: !408, line: 66, baseType: !246, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !407, file: !408, line: 68, baseType: !423, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !408, line: 36, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !407, file: !408, line: 70, baseType: !426, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !407, file: !408, line: 72, baseType: !182, size: 32, offset: 896)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !407, file: !408, line: 73, baseType: !182, size: 32, offset: 928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !407, file: !408, line: 74, baseType: !430, size: 64, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !431)
!431 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !407, file: !408, line: 77, baseType: !248, size: 16, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !407, file: !408, line: 78, baseType: !434, size: 8, offset: 1040)
!434 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !407, file: !408, line: 79, baseType: !118, size: 8, offset: 1048)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !407, file: !408, line: 81, baseType: !437, size: 64, offset: 1088)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !408, line: 43, baseType: null)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !407, file: !408, line: 89, baseType: !440, size: 64, offset: 1152)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !431)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !407, file: !408, line: 91, baseType: !442, size: 64, offset: 1216)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !408, line: 37, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !407, file: !408, line: 92, baseType: !445, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !408, line: 38, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !407, file: !408, line: 93, baseType: !426, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !407, file: !408, line: 94, baseType: !247, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !407, file: !408, line: 95, baseType: !249, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !407, file: !408, line: 96, baseType: !182, size: 32, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !407, file: !408, line: 98, baseType: !452, size: 160, offset: 1568)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 20)
!455 = !DILocalVariable(name: "__cnt", scope: !402, file: !181, line: 644, type: !249)
!456 = !DILocalVariable(name: "url_program", scope: !382, file: !181, line: 648, type: !252)
!457 = !DILocalVariable(name: "__ptr", scope: !458, file: !181, line: 686, type: !252)
!458 = distinct !DILexicalBlock(scope: !382, file: !181, line: 686, column: 3)
!459 = !DILocalVariable(name: "__stream", scope: !458, file: !181, line: 686, type: !404)
!460 = !DILocalVariable(name: "__cnt", scope: !458, file: !181, line: 686, type: !249)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !312, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !312, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 4)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !322, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !327, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !312, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !467, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !19, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !312, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !322, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !322, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !488, isLocal: true, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 7)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !493, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 8)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !123, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !123, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !123, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !123, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !488, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !123, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 17)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !515, isLocal: true, isDefinition: true)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 40)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !520, isLocal: true, isDefinition: true)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 15)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !74, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !19, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !312, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !312, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !493, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !181, line: 754, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1784, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 223)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !181, line: 744, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 216)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !289, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 22)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !520, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !467, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !44, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 27)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 51)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !294, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !467, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !2, line: 257, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 11)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !488, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !520, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !2, line: 260, type: !19, isLocal: true, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !322, isLocal: true, isDefinition: true)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !2, line: 262, type: !488, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !2, line: 263, type: !294, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !572, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !2, line: 265, type: !312, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !493, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 268, type: !312, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 13)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !312, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !493, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !143, file: !2, line: 72, type: !182, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "header_mode", scope: !143, file: !2, line: 135, type: !154, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 34)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 46)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !2, line: 482, type: !312, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 486, type: !322, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !510, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !268, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !2, line: 491, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 296, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 37)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !452, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !2, line: 419, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 288, elements: !50)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "ncolumns", scope: !143, file: !2, line: 222, type: !638, isLocal: true, isDefinition: true)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !639, line: 130, baseType: !640)
!639 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !250, line: 35, baseType: !431)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "ncolumns_alloc", scope: !143, file: !2, line: 222, type: !638, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "columns", scope: !143, file: !2, line: 219, type: !645, isLocal: true, isDefinition: true)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "field_data_t", file: !2, line: 164, size: 320, elements: !648)
!648 = !{!649, !651, !652, !654, !655, !656, !657}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !647, file: !2, line: 166, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "display_field_t", file: !2, line: 153, baseType: !200)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !647, file: !2, line: 167, baseType: !252, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "field_type", scope: !647, file: !2, line: 168, baseType: !653, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "field_type_t", file: !2, line: 161, baseType: !230)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "caption", scope: !647, file: !2, line: 169, baseType: !252, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !647, file: !2, line: 170, baseType: !182, size: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "align_right", scope: !647, file: !2, line: 171, baseType: !337, size: 8, offset: 288)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !647, file: !2, line: 172, baseType: !337, size: 8, offset: 296)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !488, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !2, line: 178, type: !572, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !488, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !312, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !312, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !2, line: 184, type: !488, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !312, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !2, line: 187, type: !312, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !322, isLocal: true, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !2, line: 190, type: !123, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !322, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !312, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !488, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !2, line: 196, type: !488, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !322, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !2, line: 199, type: !322, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !2, line: 202, type: !488, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !2, line: 202, type: !322, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !488, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !2, line: 205, type: !322, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !488, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !572, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !312, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !312, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "field_data", scope: !143, file: !2, line: 176, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 3840, elements: !295)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 547, type: !268, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !24, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "all_args_string", scope: !143, file: !2, line: 214, type: !252, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !2, line: 616, type: !322, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 621, type: !488, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "nrows_alloc", scope: !143, file: !2, line: 242, type: !638, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "tty_out", scope: !723, file: !2, line: 355, type: !182, isLocal: true, isDefinition: true)
!723 = distinct !DISubprogram(name: "replace_problematic_chars", scope: !2, file: !2, line: 353, type: !724, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !143, retainedNodes: !726)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !246}
!726 = !{!727}
!727 = !DILocalVariable(name: "cell", arg: 1, scope: !723, file: !2, line: 353, type: !246)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "table", scope: !143, file: !2, line: 238, type: !730, isLocal: true, isDefinition: true)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "nrows", scope: !143, file: !2, line: 242, type: !638, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1329, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 49)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1358, type: !312, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "devlist_table", scope: !143, file: !2, line: 58, type: !743, isLocal: true, isDefinition: true)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !745, line: 56, baseType: !746)
!745 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !745, line: 54, flags: DIFlagFwdDecl)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !282, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 1032, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 129)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1197, type: !488, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1220, type: !138, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1223, type: !312, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !2, line: 920, type: !128, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "grand_fsu", scope: !143, file: !2, line: 125, type: !764, isLocal: true, isDefinition: true)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fs_usage", file: !765, line: 31, size: 448, elements: !766)
!765 = !DIFile(filename: "./lib/fsusage.h", directory: "/src", checksumkind: CSK_MD5, checksum: "85913791ba5e4e0263095d6c86df621e")
!766 = !{!767, !768, !769, !770, !771, !772, !773}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocksize", scope: !764, file: !765, line: 33, baseType: !259, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_blocks", scope: !764, file: !765, line: 34, baseType: !259, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bfree", scope: !764, file: !765, line: 35, baseType: !259, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail", scope: !764, file: !765, line: 36, baseType: !259, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_bavail_top_bit_set", scope: !764, file: !765, line: 37, baseType: !337, size: 8, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_files", scope: !764, file: !765, line: 38, baseType: !259, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fsu_ffree", scope: !764, file: !765, line: 39, baseType: !259, size: 64, offset: 384)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 4352, elements: !511)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !777, line: 50, size: 256, elements: !778)
!777 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!778 = !{!779, !780, !781, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !777, line: 52, baseType: !252, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !776, file: !777, line: 55, baseType: !182, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !777, line: 56, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !776, file: !777, line: 57, baseType: !182, size: 32, offset: 192)
!784 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!785 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!786 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!787 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!790 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!791 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !794, line: 38, type: !795, isLocal: true, isDefinition: true)
!794 = !DIFile(filename: "src/find-mount-point.c", directory: "/src", checksumkind: CSK_MD5, checksum: "02c11bacc56618f441de1ed8fb506d8b")
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 29)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !794, line: 48, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 30)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !794, line: 64, type: !327, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !794, line: 66, type: !3, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !794, line: 81, type: !19, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !794, line: 83, type: !520, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !794, line: 105, type: !615, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !815, line: 3, type: !520, isLocal: true, isDefinition: true)
!815 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "Version", scope: !818, file: !815, line: 3, type: !252, isLocal: false, isDefinition: true)
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !819, splitDebugInlining: false, nameTableKind: None)
!819 = !{!813, !816}
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !822, line: 360, type: !327, isLocal: true, isDefinition: true)
!822 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !822, line: 436, type: !327, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "file_name", scope: !827, file: !828, line: 45, type: !252, isLocal: true, isDefinition: true)
!827 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !829, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!829 = !{!830, !832, !834, !836, !825, !838}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !828, line: 121, type: !488, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !828, line: 121, type: !294, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !828, line: 123, type: !488, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !828, line: 126, type: !19, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !827, file: !828, line: 55, type: !337, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !842, file: !843, line: 66, type: !894, isLocal: false, isDefinition: true)
!842 = distinct !DICompileUnit(language: DW_LANG_C11, file: !843, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !844, globals: !845, splitDebugInlining: false, nameTableKind: None)
!843 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!844 = !{!247, !254}
!845 = !{!846, !848, !873, !875, !877, !879, !840, !881, !883, !885, !887, !892}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !843, line: 272, type: !312, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "old_file_name", scope: !850, file: !843, line: 304, type: !252, isLocal: true, isDefinition: true)
!850 = distinct !DISubprogram(name: "verror_at_line", scope: !843, file: !843, line: 298, type: !851, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !842, retainedNodes: !866)
!851 = !DISubroutineType(types: !852)
!852 = !{null, !182, !182, !252, !147, !252, !853}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !854, line: 52, baseType: !855)
!854 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !856, line: 14, baseType: !857)
!856 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !858, baseType: !859)
!858 = !DIFile(filename: "lib/error.c", directory: "/src")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !860)
!860 = !{!861, !862, !863, !864, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !859, file: !858, baseType: !247, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !859, file: !858, baseType: !247, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !859, file: !858, baseType: !247, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !859, file: !858, baseType: !182, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !859, file: !858, baseType: !182, size: 32, offset: 224)
!866 = !{!867, !868, !869, !870, !871, !872}
!867 = !DILocalVariable(name: "status", arg: 1, scope: !850, file: !843, line: 298, type: !182)
!868 = !DILocalVariable(name: "errnum", arg: 2, scope: !850, file: !843, line: 298, type: !182)
!869 = !DILocalVariable(name: "file_name", arg: 3, scope: !850, file: !843, line: 298, type: !252)
!870 = !DILocalVariable(name: "line_number", arg: 4, scope: !850, file: !843, line: 298, type: !147)
!871 = !DILocalVariable(name: "message", arg: 5, scope: !850, file: !843, line: 298, type: !252)
!872 = !DILocalVariable(name: "args", arg: 6, scope: !850, file: !843, line: 298, type: !853)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "old_line_number", scope: !850, file: !843, line: 305, type: !147, isLocal: true, isDefinition: true)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(scope: null, file: !843, line: 338, type: !467, isLocal: true, isDefinition: true)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(scope: null, file: !843, line: 346, type: !493, isLocal: true, isDefinition: true)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !843, line: 346, type: !327, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "error_message_count", scope: !842, file: !843, line: 69, type: !147, isLocal: false, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !842, file: !843, line: 295, type: !182, isLocal: false, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !843, line: 208, type: !488, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !843, line: 208, type: !889, isLocal: true, isDefinition: true)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 21)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !843, line: 214, type: !312, isLocal: true, isDefinition: true)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "statvfs_works_cache", scope: !899, file: !900, line: 93, type: !182, isLocal: true, isDefinition: true)
!899 = distinct !DISubprogram(name: "statvfs_works", scope: !900, file: !900, line: 91, type: !901, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !903, retainedNodes: !908)
!900 = !DIFile(filename: "lib/fsusage.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fab138654d25fc15b75ea3e349807dd1")
!901 = !DISubroutineType(types: !902)
!902 = !{!182}
!903 = distinct !DICompileUnit(language: DW_LANG_C11, file: !900, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !904, globals: !905, splitDebugInlining: false, nameTableKind: None)
!904 = !{!259}
!905 = !{!897, !906}
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !900, line: 98, type: !488, isLocal: true, isDefinition: true)
!908 = !{!909}
!909 = !DILocalVariable(name: "name", scope: !910, file: !900, line: 96, type: !912)
!910 = distinct !DILexicalBlock(scope: !911, file: !900, line: 95, column: 5)
!911 = distinct !DILexicalBlock(scope: !899, file: !900, line: 94, column: 7)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !913, line: 48, size: 3120, elements: !914)
!913 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/utsname.h", directory: "", checksumkind: CSK_MD5, checksum: "025e6c1b1c47580289242d1d03561cee")
!914 = !{!915, !919, !920, !921, !922, !923}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !912, file: !913, line: 51, baseType: !916, size: 520)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 65)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !912, file: !913, line: 54, baseType: !916, size: 520, offset: 520)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !912, file: !913, line: 57, baseType: !916, size: 520, offset: 1040)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !912, file: !913, line: 59, baseType: !916, size: 520, offset: 1560)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !912, file: !913, line: 62, baseType: !916, size: 520, offset: 2080)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !912, file: !913, line: 67, baseType: !916, size: 520, offset: 2600)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !926, line: 226, type: !128, isLocal: true, isDefinition: true)
!926 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !926, line: 227, type: !128, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !926, line: 228, type: !9, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !926, line: 231, type: !128, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "default_tuning", scope: !935, file: !926, line: 134, type: !939, isLocal: true, isDefinition: true)
!935 = distinct !DICompileUnit(language: DW_LANG_C11, file: !926, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !936, globals: !938, splitDebugInlining: false, nameTableKind: None)
!936 = !{!251, !247, !937, !249}
!937 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!938 = !{!924, !927, !929, !931, !933}
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !745, line: 52, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !745, line: 40, size: 160, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !941, file: !745, line: 45, baseType: !937, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !941, file: !745, line: 46, baseType: !937, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !941, file: !745, line: 47, baseType: !937, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !941, file: !745, line: 48, baseType: !937, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !941, file: !745, line: 49, baseType: !337, size: 8, offset: 128)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !950, line: 161, type: !327, isLocal: true, isDefinition: true)
!950 = !DIFile(filename: "lib/human.c", directory: "/src", checksumkind: CSK_MD5, checksum: "816bc776601381858f2dbab147d13860")
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !950, line: 163, type: !118, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !950, line: 233, type: !322, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !950, line: 251, type: !322, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "power_letter", scope: !959, file: !950, line: 36, type: !985, isLocal: true, isDefinition: true)
!959 = distinct !DICompileUnit(language: DW_LANG_C11, file: !950, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !960, retainedTypes: !961, globals: !964, splitDebugInlining: false, nameTableKind: None)
!960 = !{!161, !145}
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!964 = !{!948, !951, !953, !955, !957, !965, !967, !969, !971, !973, !975, !979, !983}
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !950, line: 417, type: !572, isLocal: true, isDefinition: true)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !950, line: 418, type: !123, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !950, line: 438, type: !282, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !950, line: 398, type: !520, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !950, line: 398, type: !19, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "block_size_args", scope: !959, file: !950, line: 398, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 192, elements: !20)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "block_size_opts", scope: !959, file: !950, line: 399, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 64, elements: !328)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !950, line: 408, type: !289, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 88, elements: !573)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(scope: null, file: !988, line: 108, type: !118, isLocal: true, isDefinition: true)
!988 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "internal_state", scope: !991, file: !988, line: 97, type: !994, isLocal: true, isDefinition: true)
!991 = distinct !DICompileUnit(language: DW_LANG_C11, file: !988, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !992, globals: !993, splitDebugInlining: false, nameTableKind: None)
!992 = !{!247, !249, !254}
!993 = !{!986, !989}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !995, line: 6, baseType: !996)
!995 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !997, line: 21, baseType: !998)
!997 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !997, line: 13, size: 64, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !998, file: !997, line: 15, baseType: !182, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !998, file: !997, line: 20, baseType: !1002, size: 32, offset: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !998, file: !997, line: 16, size: 32, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1002, file: !997, line: 18, baseType: !147, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1002, file: !997, line: 19, baseType: !467, size: 32)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 461, type: !889, isLocal: true, isDefinition: true)
!1008 = !DIFile(filename: "lib/mountlist.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9c45539f6f3902bf91fbce80e7cbadbc")
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 462, type: !19, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 473, type: !510, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 493, type: !467, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !488, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !312, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !322, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !493, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !488, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !493, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !294, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !488, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !572, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !322, isLocal: true, isDefinition: true)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !322, isLocal: true, isDefinition: true)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !488, isLocal: true, isDefinition: true)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 523, type: !312, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 524, type: !488, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 553, type: !123, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 555, type: !327, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1008, line: 562, type: !312, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "program_name", scope: !1051, file: !1052, line: 31, type: !252, isLocal: false, isDefinition: true)
!1051 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1052, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1053, globals: !1054, splitDebugInlining: false, nameTableKind: None)
!1052 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1053 = !{!246}
!1054 = !{!1049, !1055, !1057}
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1052, line: 46, type: !493, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1052, line: 49, type: !467, isLocal: true, isDefinition: true)
!1059 = !DIGlobalVariableExpression(var: !1060, expr: !DIExpression())
!1060 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1061, file: !1062, line: 46, type: !1087, isLocal: true, isDefinition: true)
!1061 = distinct !DISubprogram(name: "proper_name_lite", scope: !1062, file: !1062, line: 38, type: !1063, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1065, retainedNodes: !1067)
!1062 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!252, !252, !252}
!1065 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1062, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!1066 = !{!1059}
!1067 = !{!1068, !1069, !1070, !1071, !1076}
!1068 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1061, file: !1062, line: 38, type: !252)
!1069 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1061, file: !1062, line: 38, type: !252)
!1070 = !DILocalVariable(name: "translation", scope: !1061, file: !1062, line: 40, type: !252)
!1071 = !DILocalVariable(name: "w", scope: !1061, file: !1062, line: 47, type: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1073, line: 37, baseType: !1074)
!1073 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !147)
!1076 = !DILocalVariable(name: "mbs", scope: !1061, file: !1062, line: 48, type: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !995, line: 6, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !997, line: 21, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !997, line: 13, size: 64, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1079, file: !997, line: 15, baseType: !182, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1079, file: !997, line: 20, baseType: !1083, size: 32, offset: 32)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1079, file: !997, line: 16, size: 32, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1083, file: !997, line: 18, baseType: !147, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1083, file: !997, line: 19, baseType: !467, size: 32)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 16, elements: !328)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 78, type: !493, isLocal: true, isDefinition: true)
!1090 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 79, type: !322, isLocal: true, isDefinition: true)
!1093 = !DIGlobalVariableExpression(var: !1094, expr: !DIExpression())
!1094 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 80, type: !597, isLocal: true, isDefinition: true)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 81, type: !597, isLocal: true, isDefinition: true)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 82, type: !452, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 83, type: !327, isLocal: true, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 84, type: !493, isLocal: true, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 85, type: !488, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 86, type: !488, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 87, type: !493, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1111, file: !1090, line: 76, type: !1183, isLocal: false, isDefinition: true)
!1111 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1090, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1112, retainedTypes: !1118, globals: !1119, splitDebugInlining: false, nameTableKind: None)
!1112 = !{!186, !1113, !215}
!1113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !187, line: 254, baseType: !147, size: 32, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1116 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1117 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1118 = !{!182, !248, !249}
!1119 = !{!1088, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1120, !1124, !1134, !1136, !1141, !1143, !1145, !1147, !1149, !1172, !1179, !1181}
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1111, file: !1090, line: 92, type: !1122, isLocal: false, isDefinition: true)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 320, elements: !124)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1111, file: !1090, line: 1040, type: !1126, isLocal: false, isDefinition: true)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1090, line: 56, size: 448, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1132, !1133}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1126, file: !1090, line: 59, baseType: !186, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1126, file: !1090, line: 62, baseType: !182, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1126, file: !1090, line: 66, baseType: !1131, size: 256, offset: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 256, elements: !494)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1126, file: !1090, line: 69, baseType: !252, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1126, file: !1090, line: 72, baseType: !252, size: 64, offset: 384)
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1111, file: !1090, line: 107, type: !1126, isLocal: true, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "slot0", scope: !1111, file: !1090, line: 831, type: !1138, isLocal: true, isDefinition: true)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 256)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 321, type: !327, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 357, type: !327, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 358, type: !327, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1090, line: 199, type: !488, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "quote", scope: !1151, file: !1090, line: 228, type: !1170, isLocal: true, isDefinition: true)
!1151 = distinct !DISubprogram(name: "gettext_quote", scope: !1090, file: !1090, line: 197, type: !1152, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1111, retainedNodes: !1154)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!252, !252, !186}
!1154 = !{!1155, !1156, !1157, !1158, !1159}
!1155 = !DILocalVariable(name: "msgid", arg: 1, scope: !1151, file: !1090, line: 197, type: !252)
!1156 = !DILocalVariable(name: "s", arg: 2, scope: !1151, file: !1090, line: 197, type: !186)
!1157 = !DILocalVariable(name: "translation", scope: !1151, file: !1090, line: 199, type: !252)
!1158 = !DILocalVariable(name: "w", scope: !1151, file: !1090, line: 229, type: !1072)
!1159 = !DILocalVariable(name: "mbs", scope: !1151, file: !1090, line: 230, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !995, line: 6, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !997, line: 21, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !997, line: 13, size: 64, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1162, file: !997, line: 15, baseType: !182, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1162, file: !997, line: 20, baseType: !1166, size: 32, offset: 32)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1162, file: !997, line: 16, size: 32, elements: !1167)
!1167 = !{!1168, !1169}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1166, file: !997, line: 18, baseType: !147, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1166, file: !997, line: 19, baseType: !467, size: 32)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 64, elements: !1171)
!1171 = !{!329, !469}
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(name: "slotvec", scope: !1111, file: !1090, line: 834, type: !1174, isLocal: true, isDefinition: true)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1090, line: 823, size: 128, elements: !1176)
!1176 = !{!1177, !1178}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !1090, line: 825, baseType: !249, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1175, file: !1090, line: 826, baseType: !246, size: 64, offset: 64)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(name: "nslots", scope: !1111, file: !1090, line: 832, type: !182, isLocal: true, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1111, file: !1090, line: 833, type: !1175, isLocal: true, isDefinition: true)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 704, elements: !573)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !1186, line: 62, type: !327, isLocal: true, isDefinition: true)
!1186 = !DIFile(filename: "lib/save-cwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50106651149ed8104fc2255edd6d8bae")
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 67, type: !294, isLocal: true, isDefinition: true)
!1189 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 69, type: !488, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 83, type: !488, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 83, type: !467, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 85, type: !327, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 88, type: !1200, isLocal: true, isDefinition: true)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 171)
!1203 = !DIGlobalVariableExpression(var: !1204, expr: !DIExpression())
!1204 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 88, type: !610, isLocal: true, isDefinition: true)
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 105, type: !289, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 109, type: !1209, isLocal: true, isDefinition: true)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !1210)
!1210 = !{!1211}
!1211 = !DISubrange(count: 23)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 113, type: !1214, isLocal: true, isDefinition: true)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1215)
!1215 = !{!1216}
!1216 = !DISubrange(count: 28)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 120, type: !1219, isLocal: true, isDefinition: true)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 32)
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 127, type: !49, isLocal: true, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 134, type: !515, isLocal: true, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 142, type: !1228, isLocal: true, isDefinition: true)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !1229)
!1229 = !{!1230}
!1230 = !DISubrange(count: 44)
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 150, type: !1233, isLocal: true, isDefinition: true)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1234)
!1234 = !{!1235}
!1235 = !DISubrange(count: 48)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 159, type: !86, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 170, type: !54, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 248, type: !452, isLocal: true, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 248, type: !547, isLocal: true, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !452, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !277, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 254, type: !515, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 259, type: !3, isLocal: true, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(scope: null, file: !1189, line: 259, type: !795, isLocal: true, isDefinition: true)
!1254 = !DIGlobalVariableExpression(var: !1255, expr: !DIExpression())
!1255 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1256, file: !1257, line: 26, type: !1259, isLocal: false, isDefinition: true)
!1256 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1257, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1258, splitDebugInlining: false, nameTableKind: None)
!1257 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1258 = !{!1254}
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 376, elements: !304)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 34, type: !19, isLocal: true, isDefinition: true)
!1262 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 34, type: !488, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 34, type: !510, isLocal: true, isDefinition: true)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1269, file: !1270, line: 24, type: !1272, isLocal: false, isDefinition: true)
!1269 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1270, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1271, splitDebugInlining: false, nameTableKind: None)
!1270 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1271 = !{!1267}
!1272 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !182)
!1273 = !DIGlobalVariableExpression(var: !1274, expr: !DIExpression())
!1274 = distinct !DIGlobalVariable(scope: null, file: !1275, line: 60, type: !558, isLocal: true, isDefinition: true)
!1275 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!1276 = !DIGlobalVariableExpression(var: !1277, expr: !DIExpression())
!1277 = distinct !DIGlobalVariable(scope: null, file: !1275, line: 65, type: !1278, isLocal: true, isDefinition: true)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !629)
!1279 = !DIGlobalVariableExpression(var: !1280, expr: !DIExpression())
!1280 = distinct !DIGlobalVariable(scope: null, file: !1275, line: 69, type: !795, isLocal: true, isDefinition: true)
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(scope: null, file: !1275, line: 73, type: !19, isLocal: true, isDefinition: true)
!1283 = !DIGlobalVariableExpression(var: !1284, expr: !DIExpression())
!1284 = distinct !DIGlobalVariable(scope: null, file: !1275, line: 86, type: !488, isLocal: true, isDefinition: true)
!1285 = !DIGlobalVariableExpression(var: !1286, expr: !DIExpression())
!1286 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1287, file: !1288, line: 65, type: !1304, isLocal: false, isDefinition: true)
!1287 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1288, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1289, retainedTypes: !1290, globals: !1291, splitDebugInlining: false, nameTableKind: None)
!1288 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1289 = !{!186}
!1290 = !{!247, !252, !254}
!1291 = !{!1285, !1292, !1294, !1296, !1298, !1300, !1302}
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 141, type: !488, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 141, type: !558, isLocal: true, isDefinition: true)
!1296 = !DIGlobalVariableExpression(var: !1297, expr: !DIExpression())
!1297 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 142, type: !795, isLocal: true, isDefinition: true)
!1298 = !DIGlobalVariableExpression(var: !1299, expr: !DIExpression())
!1299 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 160, type: !889, isLocal: true, isDefinition: true)
!1300 = !DIGlobalVariableExpression(var: !1301, expr: !DIExpression())
!1301 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 165, type: !493, isLocal: true, isDefinition: true)
!1302 = !DIGlobalVariableExpression(var: !1303, expr: !DIExpression())
!1303 = distinct !DIGlobalVariable(scope: null, file: !1288, line: 170, type: !312, isLocal: true, isDefinition: true)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1305, line: 69, baseType: !894)
!1305 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1306 = !DIGlobalVariableExpression(var: !1307, expr: !DIExpression())
!1307 = distinct !DIGlobalVariable(scope: null, file: !1308, line: 124, type: !493, isLocal: true, isDefinition: true)
!1308 = !DIFile(filename: "lib/chdir-long.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a14f8c4b948b101710631b0c38063252")
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1308, line: 124, type: !510, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(scope: null, file: !1308, line: 124, type: !1313, isLocal: true, isDefinition: true)
!1313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 184, elements: !1210)
!1314 = !DIGlobalVariableExpression(var: !1315, expr: !DIExpression())
!1315 = distinct !DIGlobalVariable(scope: null, file: !1308, line: 125, type: !294, isLocal: true, isDefinition: true)
