; ModuleID = 'src/du.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.duinfo = type { i64, i64, %struct.timespec }
%struct.timespec = type { i64, i64 }
%struct.calendar = type { ptr, ptr, i32 }
%struct.pattern_buffer = type { ptr, ptr }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.di_ent = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.mount_entry = type { ptr, ptr, ptr, ptr, i64, i8, ptr }
%struct.dulevel = type { %struct.duinfo, %struct.duinfo }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, ptr }

!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !441, isLocal: true, isDefinition: true)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 4)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1073, type: !344, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1078, type: !152, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1079, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 27)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "temp_argv", scope: !366, file: !2, line: 1113, type: !374, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !429, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 40)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !361, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 184, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 23)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1141, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 576, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 72)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1158, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 30)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1165, type: !354, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1187, type: !436, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1190, type: !487, isLocal: true, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 6)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "di_files", scope: !172, file: !2, line: 58, type: !492, isLocal: true, isDefinition: true)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "di_set", file: !494, line: 35, flags: DIFlagFwdDecl)
!494 = !DIFile(filename: "./lib/di-set.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6799d6331104f29afec5973dd8498fc3")
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "di_mnt", scope: !172, file: !2, line: 61, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "hash_all", scope: !172, file: !2, line: 132, type: !376, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "human_output_opts", scope: !172, file: !2, line: 153, type: !225, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "localtz", scope: !172, file: !2, line: 179, type: !503, isLocal: true, isDefinition: true)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !504, line: 1039, baseType: !505)
!504 = !DIFile(filename: "./lib/time.h", directory: "/src")
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !504, line: 1039, flags: DIFlagFwdDecl)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "output_block_size", scope: !172, file: !2, line: 182, type: !268, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "tot_dui", scope: !172, file: !2, line: 188, type: !511, isLocal: true, isDefinition: true)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "duinfo", file: !2, line: 68, size: 256, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !2, line: 71, baseType: !268, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !511, file: !2, line: 74, baseType: !268, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tmax", scope: !511, file: !2, line: 78, baseType: !516, size: 128, offset: 128)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !517, line: 11, size: 128, elements: !518)
!517 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !516, file: !517, line: 16, baseType: !274, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !516, file: !517, line: 21, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !271, line: 197, baseType: !275)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !224, line: 736, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 75)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !529, file: !224, line: 575, type: !225, isLocal: true, isDefinition: true)
!529 = distinct !DISubprogram(name: "oputs_", scope: !224, file: !224, line: 573, type: !530, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !532)
!530 = !DISubroutineType(cc: DW_CC_nocall, types: !531)
!531 = !{null, !261, !261}
!532 = !{!533, !534, !535, !538, !539, !540, !541, !545, !546, !547, !548, !550, !601, !602, !603, !605, !606}
!533 = !DILocalVariable(name: "program", arg: 1, scope: !529, file: !224, line: 573, type: !261)
!534 = !DILocalVariable(name: "option", arg: 2, scope: !529, file: !224, line: 573, type: !261)
!535 = !DILocalVariable(name: "term", scope: !536, file: !224, line: 585, type: !261)
!536 = distinct !DILexicalBlock(scope: !537, file: !224, line: 582, column: 5)
!537 = distinct !DILexicalBlock(scope: !529, file: !224, line: 581, column: 7)
!538 = !DILocalVariable(name: "double_space", scope: !529, file: !224, line: 594, type: !376)
!539 = !DILocalVariable(name: "first_word", scope: !529, file: !224, line: 595, type: !261)
!540 = !DILocalVariable(name: "option_text", scope: !529, file: !224, line: 596, type: !261)
!541 = !DILocalVariable(name: "s", scope: !542, file: !224, line: 608, type: !261)
!542 = distinct !DILexicalBlock(scope: !543, file: !224, line: 605, column: 5)
!543 = distinct !DILexicalBlock(scope: !544, file: !224, line: 604, column: 12)
!544 = distinct !DILexicalBlock(scope: !529, file: !224, line: 597, column: 7)
!545 = !DILocalVariable(name: "spaces", scope: !542, file: !224, line: 609, type: !264)
!546 = !DILocalVariable(name: "anchor_len", scope: !529, file: !224, line: 620, type: !264)
!547 = !DILocalVariable(name: "desc_text", scope: !529, file: !224, line: 625, type: !261)
!548 = !DILocalVariable(name: "__ptr", scope: !549, file: !224, line: 644, type: !261)
!549 = distinct !DILexicalBlock(scope: !529, file: !224, line: 644, column: 3)
!550 = !DILocalVariable(name: "__stream", scope: !549, file: !224, line: 644, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !553, line: 7, baseType: !554)
!553 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !555, line: 49, size: 1728, elements: !556)
!555 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !572, !574, !575, !576, !578, !579, !581, !582, !585, !587, !590, !593, !594, !595, !596, !597}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !554, file: !555, line: 51, baseType: !225, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !554, file: !555, line: 54, baseType: !259, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !554, file: !555, line: 55, baseType: !259, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !554, file: !555, line: 56, baseType: !259, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !554, file: !555, line: 57, baseType: !259, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !554, file: !555, line: 58, baseType: !259, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !554, file: !555, line: 59, baseType: !259, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !554, file: !555, line: 60, baseType: !259, size: 64, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !554, file: !555, line: 61, baseType: !259, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !554, file: !555, line: 64, baseType: !259, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !554, file: !555, line: 65, baseType: !259, size: 64, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !554, file: !555, line: 66, baseType: !259, size: 64, offset: 704)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !554, file: !555, line: 68, baseType: !570, size: 64, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !555, line: 36, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !554, file: !555, line: 70, baseType: !573, size: 64, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !554, file: !555, line: 72, baseType: !225, size: 32, offset: 896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !554, file: !555, line: 73, baseType: !225, size: 32, offset: 928)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !554, file: !555, line: 74, baseType: !577, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !271, line: 152, baseType: !275)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !554, file: !555, line: 77, baseType: !263, size: 16, offset: 1024)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !554, file: !555, line: 78, baseType: !580, size: 8, offset: 1040)
!580 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !554, file: !555, line: 79, baseType: !157, size: 8, offset: 1048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !554, file: !555, line: 81, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !555, line: 43, baseType: null)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !554, file: !555, line: 89, baseType: !586, size: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !271, line: 153, baseType: !275)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !554, file: !555, line: 91, baseType: !588, size: 64, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !555, line: 37, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !554, file: !555, line: 92, baseType: !591, size: 64, offset: 1280)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !555, line: 38, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !554, file: !555, line: 93, baseType: !573, size: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !554, file: !555, line: 94, baseType: !260, size: 64, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !554, file: !555, line: 95, baseType: !264, size: 64, offset: 1472)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !554, file: !555, line: 96, baseType: !225, size: 32, offset: 1536)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !554, file: !555, line: 98, baseType: !598, size: 160, offset: 1568)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 20)
!601 = !DILocalVariable(name: "__cnt", scope: !549, file: !224, line: 644, type: !264)
!602 = !DILocalVariable(name: "url_program", scope: !529, file: !224, line: 648, type: !261)
!603 = !DILocalVariable(name: "__ptr", scope: !604, file: !224, line: 686, type: !261)
!604 = distinct !DILexicalBlock(scope: !529, file: !224, line: 686, column: 3)
!605 = !DILocalVariable(name: "__stream", scope: !604, file: !224, line: 686, type: !551)
!606 = !DILocalVariable(name: "__cnt", scope: !604, file: !224, line: 686, type: !264)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !224, line: 585, type: !609, isLocal: true, isDefinition: true)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 5)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !224, line: 586, type: !609, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !224, line: 595, type: !441, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !224, line: 620, type: !487, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !152, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !224, line: 648, type: !609, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !441, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !224, line: 649, type: !19, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !224, line: 650, type: !609, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !487, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !224, line: 651, type: !487, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !224, line: 652, type: !300, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !224, line: 653, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 8)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !224, line: 654, type: !162, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !224, line: 655, type: !162, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !224, line: 656, type: !162, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !224, line: 657, type: !162, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !224, line: 663, type: !300, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !224, line: 664, type: !162, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !436, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !224, line: 669, type: !461, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !429, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !224, line: 676, type: !80, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !224, line: 679, type: !19, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !224, line: 683, type: !609, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !224, line: 688, type: !609, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !224, line: 691, type: !636, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !224, line: 754, type: !669, isLocal: true, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1784, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 223)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !224, line: 744, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1728, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 216)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !224, line: 839, type: !319, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !224, line: 840, type: !681, isLocal: true, isDefinition: true)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 22)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !224, line: 841, type: !429, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !224, line: 862, type: !441, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(scope: null, file: !224, line: 868, type: !9, isLocal: true, isDefinition: true)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !224, line: 875, type: !452, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 51)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !224, line: 877, type: !324, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !441, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 212, type: !279, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 213, type: !354, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 214, type: !487, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !324, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 219, type: !324, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !2, line: 220, type: !436, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !2, line: 221, type: !636, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !2, line: 222, type: !329, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !324, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !429, isLocal: true, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !2, line: 225, type: !300, isLocal: true, isDefinition: true)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !19, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !2, line: 227, type: !162, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !2, line: 228, type: !609, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !429, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !2, line: 230, type: !319, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !279, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !162, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !162, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !2, line: 235, type: !609, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !354, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !609, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 238, type: !636, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "long_options", scope: !172, file: !2, line: 209, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 6656, elements: !759)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !752, line: 50, size: 256, elements: !753)
!752 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!753 = !{!754, !755, !756, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !751, file: !752, line: 52, baseType: !261, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !751, file: !752, line: 55, baseType: !225, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !751, file: !752, line: 56, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !751, file: !752, line: 57, baseType: !225, size: 32, offset: 192)
!759 = !{!760}
!760 = !DISubrange(count: 26)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "opt_nul_terminate_output", scope: !172, file: !2, line: 135, type: !376, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "opt_all", scope: !172, file: !2, line: 122, type: !376, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "apparent_size", scope: !172, file: !2, line: 126, type: !376, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "print_grand_total", scope: !172, file: !2, line: 138, type: !376, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "max_depth", scope: !172, file: !2, line: 146, type: !417, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "opt_count_all", scope: !172, file: !2, line: 129, type: !376, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "opt_threshold", scope: !172, file: !2, line: 150, type: !388, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "opt_separate_dirs", scope: !172, file: !2, line: 141, type: !376, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "opt_inodes", scope: !172, file: !2, line: 156, type: !376, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "opt_time", scope: !172, file: !2, line: 159, type: !376, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "time_types", scope: !172, file: !2, line: 246, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 160, elements: !610)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !487, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !441, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !487, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !2, line: 244, type: !300, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "time_args", scope: !172, file: !2, line: 242, type: !797, isLocal: true, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 384, elements: !488)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "time_type", scope: !172, file: !2, line: 170, type: !218, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "time_style", scope: !172, file: !2, line: 173, type: !261, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "time_format", scope: !172, file: !2, line: 176, type: !261, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1015, type: !354, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1022, type: !681, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1024, type: !361, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1026, type: !162, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !224, line: 1027, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 432, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 54)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !361, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !441, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "time_style_args", scope: !172, file: !2, line: 262, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 256, elements: !442)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "time_style_types", scope: !172, file: !2, line: 266, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 96, elements: !20)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !2, line: 742, type: !598, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !2, line: 764, type: !436, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "prev_level", scope: !172, file: !2, line: 65, type: !417, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "n_alloc", scope: !837, file: !2, line: 543, type: !417, isLocal: true, isDefinition: true)
!837 = distinct !DISubprogram(name: "process_file", scope: !2, file: !2, line: 538, type: !838, scopeLine: 539, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !172, retainedNodes: !946)
!838 = !DISubroutineType(types: !839)
!839 = !{!376, !840, !944}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !842, line: 233, baseType: !843)
!842 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !842, line: 115, size: 1024, elements: !844)
!844 = !{!845, !904, !905, !907, !910, !911, !912, !913, !914, !915, !922, !923, !926, !933}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !843, file: !842, line: 116, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !842, line: 235, size: 1920, elements: !848)
!848 = !{!849, !850, !851, !852, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !900}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !847, file: !842, line: 236, baseType: !846, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !847, file: !842, line: 237, baseType: !846, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !847, file: !842, line: 238, baseType: !846, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !847, file: !842, line: 239, baseType: !853, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !855, line: 127, baseType: !856)
!855 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !855, line: 127, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !847, file: !842, line: 242, baseType: !275, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !847, file: !842, line: 243, baseType: !260, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !847, file: !842, line: 244, baseType: !259, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !847, file: !842, line: 245, baseType: !259, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !847, file: !842, line: 246, baseType: !225, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !847, file: !842, line: 247, baseType: !225, size: 32, offset: 544)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !847, file: !842, line: 248, baseType: !264, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !847, file: !842, line: 250, baseType: !840, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !847, file: !842, line: 254, baseType: !419, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !847, file: !842, line: 256, baseType: !264, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !847, file: !842, line: 272, baseType: !263, size: 16, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !847, file: !842, line: 276, baseType: !263, size: 16, offset: 848)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !847, file: !842, line: 282, baseType: !263, size: 16, offset: 864)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !847, file: !842, line: 284, baseType: !871, size: 1024, offset: 896)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 1024, elements: !158)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !873, line: 44, size: 1024, elements: !874)
!873 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!874 = !{!875, !877, !879, !881, !883, !885, !887, !888, !889, !890, !892, !893, !895, !896, !897, !898}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !872, file: !873, line: 46, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !271, line: 145, baseType: !266)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !872, file: !873, line: 47, baseType: !878, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !271, line: 148, baseType: !266)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !872, file: !873, line: 48, baseType: !880, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !271, line: 150, baseType: !176)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !872, file: !873, line: 49, baseType: !882, size: 32, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !271, line: 151, baseType: !176)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !872, file: !873, line: 50, baseType: !884, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !271, line: 146, baseType: !176)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !872, file: !873, line: 51, baseType: !886, size: 32, offset: 224)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !271, line: 147, baseType: !176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !872, file: !873, line: 52, baseType: !876, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !872, file: !873, line: 53, baseType: !876, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !872, file: !873, line: 54, baseType: !577, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !872, file: !873, line: 55, baseType: !891, size: 32, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !271, line: 175, baseType: !225)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !872, file: !873, line: 56, baseType: !225, size: 32, offset: 480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !872, file: !873, line: 57, baseType: !894, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !271, line: 180, baseType: !275)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !872, file: !873, line: 65, baseType: !516, size: 128, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !872, file: !873, line: 66, baseType: !516, size: 128, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !872, file: !873, line: 67, baseType: !516, size: 128, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !872, file: !873, line: 79, baseType: !899, size: 64, offset: 960)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !153)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fts_name", scope: !847, file: !842, line: 285, baseType: !901, offset: 1920)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: -1)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fts_child", scope: !843, file: !842, line: 117, baseType: !846, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fts_array", scope: !843, file: !842, line: 118, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dev", scope: !843, file: !842, line: 119, baseType: !908, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !909, line: 59, baseType: !876)
!909 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!910 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !843, file: !842, line: 120, baseType: !259, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fts_rfd", scope: !843, file: !842, line: 121, baseType: !225, size: 32, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cwd_fd", scope: !843, file: !842, line: 122, baseType: !225, size: 32, offset: 352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !843, file: !842, line: 124, baseType: !264, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fts_nitems", scope: !843, file: !842, line: 125, baseType: !264, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fts_compar", scope: !843, file: !842, line: 126, baseType: !916, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!225, !919, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fts_options", scope: !843, file: !842, line: 196, baseType: !225, size: 32, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fts_leaf_optimization_works_ht", scope: !843, file: !842, line: 205, baseType: !924, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !842, line: 205, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !843, file: !842, line: 227, baseType: !927, size: 64, offset: 704)
!927 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !843, file: !842, line: 207, size: 64, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !927, file: !842, line: 220, baseType: !924, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !927, file: !842, line: 226, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "cycle_check_state", file: !842, line: 226, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fd_ring", scope: !843, file: !842, line: 232, baseType: !934, size: 256, offset: 768)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "I_ring", file: !935, line: 47, baseType: !936)
!935 = !DIFile(filename: "./lib/i-ring.h", directory: "/src", checksumkind: CSK_MD5, checksum: "e5a837f066348a79b8b8c179c8da2a6d")
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "I_ring", file: !935, line: 39, size: 256, elements: !937)
!937 = !{!938, !940, !941, !942, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ir_data", scope: !936, file: !935, line: 41, baseType: !939, size: 128)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 128, elements: !442)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ir_default_val", scope: !936, file: !935, line: 42, baseType: !225, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ir_front", scope: !936, file: !935, line: 43, baseType: !176, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ir_back", scope: !936, file: !935, line: 44, baseType: !176, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ir_empty", scope: !936, file: !935, line: 45, baseType: !376, size: 8, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTSENT", file: !842, line: 286, baseType: !847)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !956, !957, !961, !968, !973, !974, !981}
!947 = !DILocalVariable(name: "fts", arg: 1, scope: !837, file: !2, line: 538, type: !840)
!948 = !DILocalVariable(name: "ent", arg: 2, scope: !837, file: !2, line: 538, type: !944)
!949 = !DILocalVariable(name: "ok", scope: !837, file: !2, line: 540, type: !376)
!950 = !DILocalVariable(name: "dui", scope: !837, file: !2, line: 541, type: !511)
!951 = !DILocalVariable(name: "dui_to_print", scope: !837, file: !2, line: 542, type: !511)
!952 = !DILocalVariable(name: "file", scope: !837, file: !2, line: 554, type: !261)
!953 = !DILocalVariable(name: "sb", scope: !837, file: !2, line: 555, type: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!956 = !DILocalVariable(name: "info", scope: !837, file: !2, line: 556, type: !225)
!957 = !DILocalVariable(name: "excluded", scope: !958, file: !2, line: 566, type: !376)
!958 = distinct !DILexicalBlock(scope: !959, file: !2, line: 565, column: 5)
!959 = distinct !DILexicalBlock(scope: !960, file: !2, line: 564, column: 12)
!960 = distinct !DILexicalBlock(scope: !837, file: !2, line: 558, column: 7)
!961 = !DILocalVariable(name: "e", scope: !962, file: !2, line: 574, type: !966)
!962 = distinct !DILexicalBlock(scope: !963, file: !2, line: 572, column: 13)
!963 = distinct !DILexicalBlock(scope: !964, file: !2, line: 571, column: 15)
!964 = distinct !DILexicalBlock(scope: !965, file: !2, line: 568, column: 9)
!965 = distinct !DILexicalBlock(scope: !958, file: !2, line: 567, column: 11)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!968 = !DILocalVariable(name: "e", scope: !969, file: !2, line: 607, type: !966)
!969 = distinct !DILexicalBlock(scope: !970, file: !2, line: 605, column: 13)
!970 = distinct !DILexicalBlock(scope: !971, file: !2, line: 604, column: 15)
!971 = distinct !DILexicalBlock(scope: !972, file: !2, line: 600, column: 9)
!972 = distinct !DILexicalBlock(scope: !958, file: !2, line: 596, column: 11)
!973 = !DILocalVariable(name: "level", scope: !837, file: !2, line: 645, type: !417)
!974 = !DILocalVariable(name: "i", scope: !975, file: !2, line: 670, type: !417)
!975 = distinct !DILexicalBlock(scope: !976, file: !2, line: 670, column: 11)
!976 = distinct !DILexicalBlock(scope: !977, file: !2, line: 660, column: 9)
!977 = distinct !DILexicalBlock(scope: !978, file: !2, line: 659, column: 16)
!978 = distinct !DILexicalBlock(scope: !979, file: !2, line: 655, column: 11)
!979 = distinct !DILexicalBlock(scope: !980, file: !2, line: 654, column: 5)
!980 = distinct !DILexicalBlock(scope: !837, file: !2, line: 648, column: 7)
!981 = !DILocalVariable(name: "v", scope: !982, file: !2, line: 709, type: !268)
!982 = distinct !DILexicalBlock(scope: !983, file: !2, line: 707, column: 5)
!983 = distinct !DILexicalBlock(scope: !837, file: !2, line: 704, column: 7)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "dulvl", scope: !837, file: !2, line: 552, type: !986, isLocal: true, isDefinition: true)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dulevel", file: !2, line: 112, size: 512, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ent", scope: !987, file: !2, line: 115, baseType: !511, size: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "subdir", scope: !987, file: !2, line: 118, baseType: !511, size: 256, offset: 256)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !2, line: 561, type: !284, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !361, isLocal: true, isDefinition: true)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !2, line: 575, type: !997, isLocal: true, isDefinition: true)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 288, elements: !76)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !2, line: 581, type: !436, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !2, line: 630, type: !1002, isLocal: true, isDefinition: true)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 186)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !2, line: 684, type: !167, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !2, line: 440, type: !361, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !224, line: 952, type: !324, isLocal: true, isDefinition: true)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1013, line: 57, flags: DIFlagFwdDecl)
!1013 = !DIFile(filename: "./lib/exclude.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9923a67d64662c8e3bb6144e4abd8844")
!1014 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1015 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1016 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1017 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1018 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1019 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1020 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1021 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 27, type: !167, isLocal: true, isDefinition: true)
!1024 = !DIFile(filename: "src/show-date.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9f25c8ee82d70d5c73e02993c297aee")
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1024, line: 35, type: !309, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 3, type: !429, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "Version", scope: !1032, file: !1029, line: 3, type: !261, isLocal: false, isDefinition: true)
!1032 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1033, splitDebugInlining: false, nameTableKind: None)
!1033 = !{!1027, !1030}
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1036, file: !1037, line: 65, type: !1059, isLocal: false, isDefinition: true)
!1036 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1037, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1038, retainedTypes: !1039, globals: !1040, splitDebugInlining: false, nameTableKind: None)
!1037 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1038 = !{!204}
!1039 = !{!260, !261, !267}
!1040 = !{!1034, !1041, !1043, !1045, !1050, !1055, !1057}
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 141, type: !300, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 141, type: !452, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 142, type: !1047, isLocal: true, isDefinition: true)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 29)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 160, type: !1052, isLocal: true, isDefinition: true)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 21)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 165, type: !636, isLocal: true, isDefinition: true)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(scope: null, file: !1037, line: 170, type: !609, isLocal: true, isDefinition: true)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1060, line: 69, baseType: !1061)
!1060 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null}
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "file_name", scope: !1066, file: !1067, line: 45, type: !261, isLocal: true, isDefinition: true)
!1066 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1067, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1068, splitDebugInlining: false, nameTableKind: None)
!1067 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1068 = !{!1069, !1071, !1073, !1075, !1064, !1077}
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(scope: null, file: !1067, line: 121, type: !300, isLocal: true, isDefinition: true)
!1071 = !DIGlobalVariableExpression(var: !1072, expr: !DIExpression())
!1072 = distinct !DIGlobalVariable(scope: null, file: !1067, line: 121, type: !324, isLocal: true, isDefinition: true)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(scope: null, file: !1067, line: 123, type: !300, isLocal: true, isDefinition: true)
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(scope: null, file: !1067, line: 126, type: !19, isLocal: true, isDefinition: true)
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1066, file: !1067, line: 55, type: !376, isLocal: true, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1081, file: !1082, line: 66, type: !1061, isLocal: false, isDefinition: true)
!1081 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1082, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1083, globals: !1084, splitDebugInlining: false, nameTableKind: None)
!1082 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1083 = !{!260, !267}
!1084 = !{!1085, !1087, !1112, !1114, !1116, !1118, !1079, !1120, !1122, !1124, !1126, !1128}
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 272, type: !609, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1089, file: !1082, line: 304, type: !261, isLocal: true, isDefinition: true)
!1089 = distinct !DISubprogram(name: "verror_at_line", scope: !1082, file: !1082, line: 298, type: !1090, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1081, retainedNodes: !1105)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !225, !225, !261, !176, !261, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1093, line: 52, baseType: !1094)
!1093 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1095, line: 14, baseType: !1096)
!1095 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1097, baseType: !1098)
!1097 = !DIFile(filename: "lib/error.c", directory: "/src")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1098, file: !1097, baseType: !260, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1098, file: !1097, baseType: !260, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1098, file: !1097, baseType: !260, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1098, file: !1097, baseType: !225, size: 32, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1098, file: !1097, baseType: !225, size: 32, offset: 224)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111}
!1106 = !DILocalVariable(name: "status", arg: 1, scope: !1089, file: !1082, line: 298, type: !225)
!1107 = !DILocalVariable(name: "errnum", arg: 2, scope: !1089, file: !1082, line: 298, type: !225)
!1108 = !DILocalVariable(name: "file_name", arg: 3, scope: !1089, file: !1082, line: 298, type: !261)
!1109 = !DILocalVariable(name: "line_number", arg: 4, scope: !1089, file: !1082, line: 298, type: !176)
!1110 = !DILocalVariable(name: "message", arg: 5, scope: !1089, file: !1082, line: 298, type: !261)
!1111 = !DILocalVariable(name: "args", arg: 6, scope: !1089, file: !1082, line: 298, type: !1092)
!1112 = !DIGlobalVariableExpression(var: !1113, expr: !DIExpression())
!1113 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1089, file: !1082, line: 305, type: !176, isLocal: true, isDefinition: true)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 338, type: !441, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 346, type: !636, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 346, type: !152, isLocal: true, isDefinition: true)
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1081, file: !1082, line: 69, type: !176, isLocal: false, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1081, file: !1082, line: 295, type: !225, isLocal: false, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 208, type: !300, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 208, type: !1052, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(scope: null, file: !1082, line: 214, type: !609, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "patsuffix", scope: !1132, file: !1133, line: 543, type: !421, isLocal: true, isDefinition: true)
!1132 = distinct !DISubprogram(name: "add_exclude", scope: !1133, file: !1133, line: 508, type: !1134, scopeLine: 509, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1202, retainedNodes: !1220)
!1133 = !DIFile(filename: "lib/exclude.c", directory: "/src", checksumkind: CSK_MD5, checksum: "aa512123465487c1fb7947405d851ab7")
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !1136, !261, !225}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude", file: !1133, line: 123, size: 128, elements: !1138)
!1138 = !{!1139, !1196}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1137, file: !1133, line: 125, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_segment", file: !1133, line: 103, size: 320, elements: !1142)
!1142 = !{!1143, !1144, !1149, !1150}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !1133, line: 105, baseType: !1140, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1141, file: !1133, line: 106, baseType: !1145, size: 32, offset: 64)
!1145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exclude_type", file: !1133, line: 97, baseType: !176, size: 32, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIEnumerator(name: "exclude_hash", value: 0)
!1148 = !DIEnumerator(name: "exclude_pattern", value: 1)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1141, file: !1133, line: 107, baseType: !225, size: 32, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1141, file: !1133, line: 112, baseType: !1151, size: 192, offset: 128)
!1151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1141, file: !1133, line: 108, size: 192, elements: !1152)
!1152 = !{!1153, !1158}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1151, file: !1133, line: 110, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1156, line: 56, baseType: !1157)
!1156 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1156, line: 54, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pat", scope: !1151, file: !1133, line: 111, baseType: !1159, size: 192)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exclude_pattern", file: !1133, line: 90, size: 192, elements: !1160)
!1160 = !{!1161, !1194, !1195}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "exclude", scope: !1159, file: !1133, line: 92, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "patopts", file: !1133, line: 78, size: 576, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1163, file: !1133, line: 80, baseType: !225, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1163, file: !1133, line: 85, baseType: !1167, size: 512, offset: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1163, file: !1133, line: 81, size: 512, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !1167, file: !1133, line: 83, baseType: !261, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1167, file: !1133, line: 84, baseType: !1171, size: 512)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "regex_t", file: !1172, line: 478, baseType: !1173)
!1172 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !1172, line: 413, size: 512, elements: !1174)
!1174 = !{!1175, !1178, !1180, !1181, !1183, !1184, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1173, file: !1172, line: 417, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !1172, line: 417, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !1173, file: !1172, line: 420, baseType: !1179, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !1172, line: 56, baseType: !266)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1173, file: !1172, line: 423, baseType: !1179, size: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !1173, file: !1172, line: 426, baseType: !1182, size: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !1172, line: 71, baseType: !266)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !1173, file: !1172, line: 431, baseType: !259, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !1173, file: !1172, line: 437, baseType: !1185, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !1173, file: !1172, line: 440, baseType: !264, size: 64, offset: 384)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !1173, file: !1172, line: 446, baseType: !176, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !1173, file: !1172, line: 457, baseType: !176, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !1173, file: !1172, line: 461, baseType: !176, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !1173, file: !1172, line: 465, baseType: !176, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !1173, file: !1172, line: 469, baseType: !176, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !1173, file: !1172, line: 472, baseType: !176, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !1173, file: !1172, line: 475, baseType: !176, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_alloc", scope: !1159, file: !1133, line: 93, baseType: !417, size: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "exclude_count", scope: !1159, file: !1133, line: 94, baseType: !417, size: 64, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "patbuf", scope: !1137, file: !1133, line: 126, baseType: !1197, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pattern_buffer", file: !1133, line: 115, size: 128, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1198, file: !1133, line: 117, baseType: !1197, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1198, file: !1133, line: 118, baseType: !259, size: 64, offset: 64)
!1202 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1133, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1203, retainedTypes: !1214, globals: !1215, splitDebugInlining: false, nameTableKind: None)
!1203 = !{!1145, !241, !1204, !1208, !1211}
!1204 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1205, line: 127, baseType: !176, size: 32, elements: !1206)
!1205 = !DIFile(filename: "./lib/mcel.h", directory: "/src", checksumkind: CSK_MD5, checksum: "1a3948cda8366fd81b1605726e5920d0")
!1206 = !{!1207}
!1207 = !DIEnumerator(name: "MCEL_LEN_MAX", value: 4)
!1208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1205, line: 131, baseType: !176, size: 32, elements: !1209)
!1209 = !{!1210}
!1210 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!1211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1205, line: 130, baseType: !176, size: 32, elements: !1212)
!1212 = !{!1213}
!1213 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!1214 = !{!225, !267, !263, !264, !1185}
!1215 = !{!1130, !1216, !1218}
!1216 = !DIGlobalVariableExpression(var: !1217, expr: !DIExpression())
!1217 = distinct !DIGlobalVariable(scope: null, file: !1133, line: 662, type: !152, isLocal: true, isDefinition: true)
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !1133, line: 665, type: !19, isLocal: true, isDefinition: true)
!1220 = !{!1221, !1222, !1223, !1224, !1228, !1229, !1232, !1233, !1236, !1241, !1245, !1247}
!1221 = !DILocalVariable(name: "ex", arg: 1, scope: !1132, file: !1133, line: 508, type: !1136)
!1222 = !DILocalVariable(name: "pattern", arg: 2, scope: !1132, file: !1133, line: 508, type: !261)
!1223 = !DILocalVariable(name: "options", arg: 3, scope: !1132, file: !1133, line: 508, type: !225)
!1224 = !DILocalVariable(name: "pat", scope: !1225, file: !1133, line: 518, type: !1227)
!1225 = distinct !DILexicalBlock(scope: !1226, file: !1133, line: 512, column: 5)
!1226 = distinct !DILexicalBlock(scope: !1132, file: !1133, line: 510, column: 7)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1228 = !DILocalVariable(name: "patopts", scope: !1225, file: !1133, line: 522, type: !1162)
!1229 = !DILocalVariable(name: "cflags", scope: !1230, file: !1133, line: 527, type: !225)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !1133, line: 526, column: 9)
!1231 = distinct !DILexicalBlock(scope: !1225, file: !1133, line: 525, column: 11)
!1232 = !DILocalVariable(name: "rc", scope: !1230, file: !1133, line: 530, type: !225)
!1233 = !DILocalVariable(name: "len", scope: !1234, file: !1133, line: 534, type: !417)
!1234 = distinct !DILexicalBlock(scope: !1235, file: !1133, line: 534, column: 13)
!1235 = distinct !DILexicalBlock(scope: !1230, file: !1133, line: 531, column: 15)
!1236 = !DILocalVariable(name: "tmp", scope: !1237, file: !1133, line: 544, type: !259)
!1237 = distinct !DILexicalBlock(scope: !1238, file: !1133, line: 542, column: 19)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !1133, line: 541, column: 21)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !1133, line: 535, column: 15)
!1240 = distinct !DILexicalBlock(scope: !1234, file: !1133, line: 534, column: 13)
!1241 = !DILocalVariable(name: "dup", scope: !1242, file: !1133, line: 563, type: !259)
!1242 = distinct !DILexicalBlock(scope: !1243, file: !1133, line: 562, column: 13)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !1133, line: 561, column: 15)
!1244 = distinct !DILexicalBlock(scope: !1231, file: !1133, line: 560, column: 9)
!1245 = !DILocalVariable(name: "exclude_hash_flags", scope: !1246, file: !1133, line: 572, type: !225)
!1246 = distinct !DILexicalBlock(scope: !1226, file: !1133, line: 571, column: 5)
!1247 = !DILocalVariable(name: "str", scope: !1246, file: !1133, line: 579, type: !259)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1250, line: 1143, type: !487, isLocal: true, isDefinition: true)
!1250 = !DIFile(filename: "./lib/strftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc72f60bb3e5c6d34cc80a710a73ceb6")
!1251 = !DIGlobalVariableExpression(var: !1252, expr: !DIExpression())
!1252 = distinct !DIGlobalVariable(scope: null, file: !1250, line: 1146, type: !636, isLocal: true, isDefinition: true)
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1250, line: 1149, type: !487, isLocal: true, isDefinition: true)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(name: "thai_calendar", scope: !1257, file: !1283, line: 75, type: !1352, isLocal: true, isDefinition: true)
!1257 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1258, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1259, retainedTypes: !1267, globals: !1276, splitDebugInlining: false, nameTableKind: None)
!1258 = !DIFile(filename: "lib/fprintftime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d718f3c0421cba537acc0628f5a8cc1a")
!1259 = !{!1260}
!1260 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pad_style", file: !1250, line: 163, baseType: !176, size: 32, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266}
!1262 = !DIEnumerator(name: "ZERO_PAD", value: 0)
!1263 = !DIEnumerator(name: "ALWAYS_ZERO_PAD", value: 1)
!1264 = !DIEnumerator(name: "SIGN_PAD", value: 2)
!1265 = !DIEnumerator(name: "SPACE_PAD", value: 3)
!1266 = !DIEnumerator(name: "NO_PAD", value: 4)
!1267 = !{!260, !376, !176, !275, !266, !225, !267, !1268}
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !504, line: 1039, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !1271, line: 24, size: 128, elements: !1272)
!1271 = !DIFile(filename: "./lib/time-internal.h", directory: "/src", checksumkind: CSK_MD5, checksum: "420a968a0e4525078b6c35874d8a6d28")
!1272 = !{!1273, !1274, !1275}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1270, file: !1271, line: 28, baseType: !1269, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !1270, file: !1271, line: 33, baseType: !4, size: 8, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !1270, file: !1271, line: 45, baseType: !901, offset: 72)
!1276 = !{!1248, !1251, !1253, !1277, !1279, !1281, !1255, !1284, !1286, !1288, !1293, !1295, !1297, !1299, !1301, !1303, !1305, !1307, !1309, !1311, !1313, !1315, !1317, !1319, !1321, !1323, !1325, !1327, !1332, !1334, !1336, !1338, !1347, !1350, !1369, !1371, !1373, !1375, !1377, !1379, !1381, !1383, !1385, !1387, !1389, !1391, !1393, !1396, !1399, !1401, !1403, !1405, !1407, !1409, !1411, !1413, !1415, !1417, !1419, !1421, !1423, !1425, !1427, !1429, !1431, !1433, !1435, !1437, !1439, !1441, !1443, !1445, !1447, !1450, !1452, !1454, !1456}
!1277 = !DIGlobalVariableExpression(var: !1278, expr: !DIExpression())
!1278 = distinct !DIGlobalVariable(scope: null, file: !1250, line: 1151, type: !487, isLocal: true, isDefinition: true)
!1279 = !DIGlobalVariableExpression(var: !1280, expr: !DIExpression())
!1280 = distinct !DIGlobalVariable(scope: null, file: !1250, line: 1153, type: !487, isLocal: true, isDefinition: true)
!1281 = !DIGlobalVariableExpression(var: !1282, expr: !DIExpression())
!1282 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 78, type: !361, isLocal: true, isDefinition: true)
!1283 = !DIFile(filename: "./lib/calendar-thai.h", directory: "/src", checksumkind: CSK_MD5, checksum: "284eb21a2bfd94d02012c920955e3722")
!1284 = !DIGlobalVariableExpression(var: !1285, expr: !DIExpression())
!1285 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 26, type: !314, isLocal: true, isDefinition: true)
!1286 = !DIGlobalVariableExpression(var: !1287, expr: !DIExpression())
!1287 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 26, type: !361, isLocal: true, isDefinition: true)
!1288 = !DIGlobalVariableExpression(var: !1289, expr: !DIExpression())
!1289 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 27, type: !1290, isLocal: true, isDefinition: true)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !1291)
!1291 = !{!1292}
!1292 = !DISubrange(count: 31)
!1293 = !DIGlobalVariableExpression(var: !1294, expr: !DIExpression())
!1294 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 27, type: !361, isLocal: true, isDefinition: true)
!1295 = !DIGlobalVariableExpression(var: !1296, expr: !DIExpression())
!1296 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 28, type: !314, isLocal: true, isDefinition: true)
!1297 = !DIGlobalVariableExpression(var: !1298, expr: !DIExpression())
!1298 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 28, type: !324, isLocal: true, isDefinition: true)
!1299 = !DIGlobalVariableExpression(var: !1300, expr: !DIExpression())
!1300 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 29, type: !314, isLocal: true, isDefinition: true)
!1301 = !DIGlobalVariableExpression(var: !1302, expr: !DIExpression())
!1302 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 29, type: !324, isLocal: true, isDefinition: true)
!1303 = !DIGlobalVariableExpression(var: !1304, expr: !DIExpression())
!1304 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 30, type: !681, isLocal: true, isDefinition: true)
!1305 = !DIGlobalVariableExpression(var: !1306, expr: !DIExpression())
!1306 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 30, type: !361, isLocal: true, isDefinition: true)
!1307 = !DIGlobalVariableExpression(var: !1308, expr: !DIExpression())
!1308 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 31, type: !284, isLocal: true, isDefinition: true)
!1309 = !DIGlobalVariableExpression(var: !1310, expr: !DIExpression())
!1310 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 31, type: !324, isLocal: true, isDefinition: true)
!1311 = !DIGlobalVariableExpression(var: !1312, expr: !DIExpression())
!1312 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 32, type: !681, isLocal: true, isDefinition: true)
!1313 = !DIGlobalVariableExpression(var: !1314, expr: !DIExpression())
!1314 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 32, type: !361, isLocal: true, isDefinition: true)
!1315 = !DIGlobalVariableExpression(var: !1316, expr: !DIExpression())
!1316 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 33, type: !681, isLocal: true, isDefinition: true)
!1317 = !DIGlobalVariableExpression(var: !1318, expr: !DIExpression())
!1318 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 33, type: !361, isLocal: true, isDefinition: true)
!1319 = !DIGlobalVariableExpression(var: !1320, expr: !DIExpression())
!1320 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 34, type: !681, isLocal: true, isDefinition: true)
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 34, type: !361, isLocal: true, isDefinition: true)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 35, type: !314, isLocal: true, isDefinition: true)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 35, type: !361, isLocal: true, isDefinition: true)
!1327 = !DIGlobalVariableExpression(var: !1328, expr: !DIExpression())
!1328 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 36, type: !1329, isLocal: true, isDefinition: true)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1330)
!1330 = !{!1331}
!1331 = !DISubrange(count: 28)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 36, type: !361, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 37, type: !681, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(scope: null, file: !1283, line: 37, type: !361, isLocal: true, isDefinition: true)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(name: "thai_month_names", scope: !1257, file: !1283, line: 21, type: !1340, isLocal: true, isDefinition: true)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1341, size: 1920, elements: !430)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_month_name", file: !1343, line: 19, size: 128, elements: !1344)
!1343 = !DIFile(filename: "./lib/calendars.h", directory: "/src", checksumkind: CSK_MD5, checksum: "caf1ecd71e40fc20718f481ee06d0d6e")
!1344 = !{!1345, !1346}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1342, file: !1343, line: 21, baseType: !261, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "abbrev", scope: !1342, file: !1343, line: 22, baseType: !261, size: 64, offset: 64)
!1347 = !DIGlobalVariableExpression(var: !1348, expr: !DIExpression())
!1348 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 134, type: !324, isLocal: true, isDefinition: true)
!1349 = !DIFile(filename: "./lib/calendar-persian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "81a4b2b64544ebad917d70f6121b8898")
!1350 = !DIGlobalVariableExpression(var: !1351, expr: !DIExpression())
!1351 = distinct !DIGlobalVariable(name: "persian_calendar", scope: !1257, file: !1349, line: 131, type: !1352, isLocal: true, isDefinition: true)
!1352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar", file: !1343, line: 33, size: 192, elements: !1354)
!1354 = !{!1355, !1367, !1368}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "from_gregorian", scope: !1353, file: !1343, line: 39, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!225, !1359, !225, !225, !225}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "calendar_date", file: !1343, line: 25, size: 192, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !1360, file: !1343, line: 27, baseType: !225, size: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !1360, file: !1343, line: 28, baseType: !225, size: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !1360, file: !1343, line: 29, baseType: !225, size: 32, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "month_names", scope: !1360, file: !1343, line: 30, baseType: !1366, size: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !1353, file: !1343, line: 42, baseType: !261, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits_base", scope: !1353, file: !1343, line: 44, baseType: !176, size: 32, offset: 128)
!1369 = !DIGlobalVariableExpression(var: !1370, expr: !DIExpression())
!1370 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 39, type: !429, isLocal: true, isDefinition: true)
!1371 = !DIGlobalVariableExpression(var: !1372, expr: !DIExpression())
!1372 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 40, type: !436, isLocal: true, isDefinition: true)
!1373 = !DIGlobalVariableExpression(var: !1374, expr: !DIExpression())
!1374 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 41, type: !354, isLocal: true, isDefinition: true)
!1375 = !DIGlobalVariableExpression(var: !1376, expr: !DIExpression())
!1376 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 42, type: !300, isLocal: true, isDefinition: true)
!1377 = !DIGlobalVariableExpression(var: !1378, expr: !DIExpression())
!1378 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 43, type: !354, isLocal: true, isDefinition: true)
!1379 = !DIGlobalVariableExpression(var: !1380, expr: !DIExpression())
!1380 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 44, type: !329, isLocal: true, isDefinition: true)
!1381 = !DIGlobalVariableExpression(var: !1382, expr: !DIExpression())
!1382 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 45, type: !300, isLocal: true, isDefinition: true)
!1383 = !DIGlobalVariableExpression(var: !1384, expr: !DIExpression())
!1384 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 46, type: !361, isLocal: true, isDefinition: true)
!1385 = !DIGlobalVariableExpression(var: !1386, expr: !DIExpression())
!1386 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 47, type: !300, isLocal: true, isDefinition: true)
!1387 = !DIGlobalVariableExpression(var: !1388, expr: !DIExpression())
!1388 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 48, type: !609, isLocal: true, isDefinition: true)
!1389 = !DIGlobalVariableExpression(var: !1390, expr: !DIExpression())
!1390 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 49, type: !361, isLocal: true, isDefinition: true)
!1391 = !DIGlobalVariableExpression(var: !1392, expr: !DIExpression())
!1392 = distinct !DIGlobalVariable(scope: null, file: !1349, line: 50, type: !354, isLocal: true, isDefinition: true)
!1393 = !DIGlobalVariableExpression(var: !1394, expr: !DIExpression())
!1394 = distinct !DIGlobalVariable(name: "persian_month_names", scope: !1257, file: !1349, line: 37, type: !1395, isLocal: true, isDefinition: true)
!1395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1341, size: 1536, elements: !325)
!1396 = !DIGlobalVariableExpression(var: !1397, expr: !DIExpression())
!1397 = distinct !DIGlobalVariable(name: "ethiopian_calendar", scope: !1257, file: !1398, line: 76, type: !1352, isLocal: true, isDefinition: true)
!1398 = !DIFile(filename: "./lib/calendar-ethiopian.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2b1dcce317a2d5298ee5226f6c829b36")
!1399 = !DIGlobalVariableExpression(var: !1400, expr: !DIExpression())
!1400 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 23, type: !319, isLocal: true, isDefinition: true)
!1401 = !DIGlobalVariableExpression(var: !1402, expr: !DIExpression())
!1402 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 23, type: !300, isLocal: true, isDefinition: true)
!1403 = !DIGlobalVariableExpression(var: !1404, expr: !DIExpression())
!1404 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 24, type: !329, isLocal: true, isDefinition: true)
!1405 = !DIGlobalVariableExpression(var: !1406, expr: !DIExpression())
!1406 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 24, type: !300, isLocal: true, isDefinition: true)
!1407 = !DIGlobalVariableExpression(var: !1408, expr: !DIExpression())
!1408 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 25, type: !162, isLocal: true, isDefinition: true)
!1409 = !DIGlobalVariableExpression(var: !1410, expr: !DIExpression())
!1410 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 25, type: !300, isLocal: true, isDefinition: true)
!1411 = !DIGlobalVariableExpression(var: !1412, expr: !DIExpression())
!1412 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 26, type: !329, isLocal: true, isDefinition: true)
!1413 = !DIGlobalVariableExpression(var: !1414, expr: !DIExpression())
!1414 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 26, type: !300, isLocal: true, isDefinition: true)
!1415 = !DIGlobalVariableExpression(var: !1416, expr: !DIExpression())
!1416 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 27, type: !300, isLocal: true, isDefinition: true)
!1417 = !DIGlobalVariableExpression(var: !1418, expr: !DIExpression())
!1418 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 28, type: !329, isLocal: true, isDefinition: true)
!1419 = !DIGlobalVariableExpression(var: !1420, expr: !DIExpression())
!1420 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 28, type: !300, isLocal: true, isDefinition: true)
!1421 = !DIGlobalVariableExpression(var: !1422, expr: !DIExpression())
!1422 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 29, type: !329, isLocal: true, isDefinition: true)
!1423 = !DIGlobalVariableExpression(var: !1424, expr: !DIExpression())
!1424 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 29, type: !300, isLocal: true, isDefinition: true)
!1425 = !DIGlobalVariableExpression(var: !1426, expr: !DIExpression())
!1426 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 30, type: !329, isLocal: true, isDefinition: true)
!1427 = !DIGlobalVariableExpression(var: !1428, expr: !DIExpression())
!1428 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 30, type: !300, isLocal: true, isDefinition: true)
!1429 = !DIGlobalVariableExpression(var: !1430, expr: !DIExpression())
!1430 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 31, type: !329, isLocal: true, isDefinition: true)
!1431 = !DIGlobalVariableExpression(var: !1432, expr: !DIExpression())
!1432 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 31, type: !300, isLocal: true, isDefinition: true)
!1433 = !DIGlobalVariableExpression(var: !1434, expr: !DIExpression())
!1434 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 32, type: !300, isLocal: true, isDefinition: true)
!1435 = !DIGlobalVariableExpression(var: !1436, expr: !DIExpression())
!1436 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 33, type: !162, isLocal: true, isDefinition: true)
!1437 = !DIGlobalVariableExpression(var: !1438, expr: !DIExpression())
!1438 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 33, type: !300, isLocal: true, isDefinition: true)
!1439 = !DIGlobalVariableExpression(var: !1440, expr: !DIExpression())
!1440 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 34, type: !162, isLocal: true, isDefinition: true)
!1441 = !DIGlobalVariableExpression(var: !1442, expr: !DIExpression())
!1442 = distinct !DIGlobalVariable(scope: null, file: !1398, line: 34, type: !300, isLocal: true, isDefinition: true)
!1443 = !DIGlobalVariableExpression(var: !1444, expr: !DIExpression())
