; ModuleID = 'src/echo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [12 x i8] c"status == 0\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [11 x i8] c"src/echo.c\00", align 1, !dbg !7
@__PRETTY_FUNCTION__.usage = private unnamed_addr constant [16 x i8] c"void usage(int)\00", align 1, !dbg !12
@.str.2 = private unnamed_addr constant [63 x i8] c"Usage: %s [SHORT-OPTION]... [STRING]...\0A  or:  %s LONG-OPTION\0A\00", align 1, !dbg !18
@.str.3 = private unnamed_addr constant [41 x i8] c"Echo the STRING(s) to standard output.\0A\0A\00", align 1, !dbg !23
@.str.4 = private unnamed_addr constant [5 x i8] c"echo\00", align 1, !dbg !28
@.str.5 = private unnamed_addr constant [45 x i8] c"  -n     do not output the trailing newline\0A\00", align 1, !dbg !33
@.str.6 = private unnamed_addr constant [53 x i8] c"  -e     enable interpretation of backslash escapes\0A\00", align 1, !dbg !38

!214 = distinct !DIGlobalVariable(scope: null, file: !122, line: 676, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 15)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !122, line: 676, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 61)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(scope: null, file: !122, line: 679, type: !85, isLocal: true, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !122, line: 683, type: !30, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !122, line: 688, type: !30, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !122, line: 691, type: !192, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !122, line: 839, type: !82, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !122, line: 840, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 22)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !122, line: 841, type: !215, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !122, line: 862, type: !163, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !122, line: 868, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 71)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !122, line: 875, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 27)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !122, line: 877, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 51)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !122, line: 877, type: !3, isLocal: true, isDefinition: true)
!259 = !{!260, !261, !262, !265, !267, !268, !269, !273, !274, !275, !276, !278, !331, !332, !333, !335, !336}
!260 = !DILocalVariable(name: "program", arg: 1, scope: !121, file: !122, line: 573, type: !125)
!261 = !DILocalVariable(name: "option", arg: 2, scope: !121, file: !122, line: 573, type: !125)
!262 = !DILocalVariable(name: "term", scope: !263, file: !122, line: 585, type: !125)
!263 = distinct !DILexicalBlock(scope: !264, file: !122, line: 582, column: 5)
!264 = distinct !DILexicalBlock(scope: !121, file: !122, line: 581, column: 7)
!265 = !DILocalVariable(name: "double_space", scope: !121, file: !122, line: 594, type: !266)
!266 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!267 = !DILocalVariable(name: "first_word", scope: !121, file: !122, line: 595, type: !125)
!268 = !DILocalVariable(name: "option_text", scope: !121, file: !122, line: 596, type: !125)
!269 = !DILocalVariable(name: "s", scope: !270, file: !122, line: 608, type: !125)
!270 = distinct !DILexicalBlock(scope: !271, file: !122, line: 605, column: 5)
!271 = distinct !DILexicalBlock(scope: !272, file: !122, line: 604, column: 12)
!272 = distinct !DILexicalBlock(scope: !121, file: !122, line: 597, column: 7)
!273 = !DILocalVariable(name: "spaces", scope: !270, file: !122, line: 609, type: !152)
!274 = !DILocalVariable(name: "anchor_len", scope: !121, file: !122, line: 620, type: !152)
!275 = !DILocalVariable(name: "desc_text", scope: !121, file: !122, line: 625, type: !125)
!276 = !DILocalVariable(name: "__ptr", scope: !277, file: !122, line: 644, type: !125)
!277 = distinct !DILexicalBlock(scope: !121, file: !122, line: 644, column: 3)
!278 = !DILocalVariable(name: "__stream", scope: !277, file: !122, line: 644, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 7, baseType: !282)
!281 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !283, line: 49, size: 1728, elements: !284)
!283 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !300, !302, !303, !304, !308, !309, !311, !312, !315, !317, !320, !323, !324, !325, !326, !327}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !282, file: !283, line: 51, baseType: !150, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !282, file: !283, line: 54, baseType: !148, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !282, file: !283, line: 55, baseType: !148, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !282, file: !283, line: 56, baseType: !148, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !282, file: !283, line: 57, baseType: !148, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !282, file: !283, line: 58, baseType: !148, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !282, file: !283, line: 59, baseType: !148, size: 64, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !282, file: !283, line: 60, baseType: !148, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !282, file: !283, line: 61, baseType: !148, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !282, file: !283, line: 64, baseType: !148, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !282, file: !283, line: 65, baseType: !148, size: 64, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !282, file: !283, line: 66, baseType: !148, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !282, file: !283, line: 68, baseType: !298, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !283, line: 36, flags: DIFlagFwdDecl)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !282, file: !283, line: 70, baseType: !301, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !282, file: !283, line: 72, baseType: !150, size: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !282, file: !283, line: 73, baseType: !150, size: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !282, file: !283, line: 74, baseType: !305, size: 64, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !306, line: 152, baseType: !307)
!306 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!307 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !282, file: !283, line: 77, baseType: !151, size: 16, offset: 1024)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !282, file: !283, line: 78, baseType: !310, size: 8, offset: 1040)
!310 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !282, file: !283, line: 79, baseType: !90, size: 8, offset: 1048)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !282, file: !283, line: 81, baseType: !313, size: 64, offset: 1088)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !283, line: 43, baseType: null)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !282, file: !283, line: 89, baseType: !316, size: 64, offset: 1152)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !306, line: 153, baseType: !307)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !282, file: !283, line: 91, baseType: !318, size: 64, offset: 1216)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !283, line: 37, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !282, file: !283, line: 92, baseType: !321, size: 64, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !283, line: 38, flags: DIFlagFwdDecl)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !282, file: !283, line: 93, baseType: !301, size: 64, offset: 1344)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !282, file: !283, line: 94, baseType: !149, size: 64, offset: 1408)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !282, file: !283, line: 95, baseType: !152, size: 64, offset: 1472)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !282, file: !283, line: 96, baseType: !150, size: 32, offset: 1536)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !282, file: !283, line: 98, baseType: !328, size: 160, offset: 1568)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 20)
!331 = !DILocalVariable(name: "__cnt", scope: !277, file: !122, line: 644, type: !152)
!332 = !DILocalVariable(name: "url_program", scope: !121, file: !122, line: 648, type: !125)
!333 = !DILocalVariable(name: "__ptr", scope: !334, file: !122, line: 686, type: !125)
!334 = distinct !DILexicalBlock(scope: !121, file: !122, line: 686, column: 3)
!335 = !DILocalVariable(name: "__stream", scope: !334, file: !122, line: 686, type: !279)
!336 = !DILocalVariable(name: "__cnt", scope: !334, file: !122, line: 686, type: !152)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !339, line: 3, type: !215, isLocal: true, isDefinition: true)
!339 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "Version", scope: !342, file: !339, line: 3, type: !125, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C11, file: !339, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !343, splitDebugInlining: false, nameTableKind: None)
!343 = !{!337, !340}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "file_name", scope: !346, file: !347, line: 45, type: !125, isLocal: true, isDefinition: true)
!346 = distinct !DICompileUnit(language: DW_LANG_C11, file: !347, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !348, splitDebugInlining: false, nameTableKind: None)
!347 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!348 = !{!349, !351, !353, !355, !344, !357}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !347, line: 121, type: !105, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !347, line: 121, type: !3, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !347, line: 123, type: !105, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !347, line: 126, type: !85, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !346, file: !347, line: 55, type: !266, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !361, file: !362, line: 66, type: !413, isLocal: false, isDefinition: true)
!361 = distinct !DICompileUnit(language: DW_LANG_C11, file: !362, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !363, globals: !364, splitDebugInlining: false, nameTableKind: None)
!362 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!363 = !{!149, !155}
!364 = !{!365, !367, !392, !394, !396, !398, !359, !400, !402, !404, !406, !411}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !362, line: 272, type: !30, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "old_file_name", scope: !369, file: !362, line: 304, type: !125, isLocal: true, isDefinition: true)
!369 = distinct !DISubprogram(name: "verror_at_line", scope: !362, file: !362, line: 298, type: !370, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !385)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !150, !150, !125, !129, !125, !372}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !373, line: 52, baseType: !374)
!373 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !375, line: 14, baseType: !376)
!375 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !377, baseType: !378)
!377 = !DIFile(filename: "lib/error.c", directory: "/src")
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !379)
!379 = !{!380, !381, !382, !383, !384}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !378, file: !377, baseType: !149, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !378, file: !377, baseType: !149, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !378, file: !377, baseType: !149, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !378, file: !377, baseType: !150, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !378, file: !377, baseType: !150, size: 32, offset: 224)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DILocalVariable(name: "status", arg: 1, scope: !369, file: !362, line: 298, type: !150)
!387 = !DILocalVariable(name: "errnum", arg: 2, scope: !369, file: !362, line: 298, type: !150)
!388 = !DILocalVariable(name: "file_name", arg: 3, scope: !369, file: !362, line: 298, type: !125)
!389 = !DILocalVariable(name: "line_number", arg: 4, scope: !369, file: !362, line: 298, type: !129)
!390 = !DILocalVariable(name: "message", arg: 5, scope: !369, file: !362, line: 298, type: !125)
!391 = !DILocalVariable(name: "args", arg: 6, scope: !369, file: !362, line: 298, type: !372)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "old_line_number", scope: !369, file: !362, line: 305, type: !129, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !362, line: 338, type: !163, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !362, line: 346, type: !192, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !362, line: 346, type: !173, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "error_message_count", scope: !361, file: !362, line: 69, type: !129, isLocal: false, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !361, file: !362, line: 295, type: !150, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !362, line: 208, type: !105, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !362, line: 208, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 21)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !362, line: 214, type: !30, isLocal: true, isDefinition: true)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{null}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "program_name", scope: !418, file: !419, line: 31, type: !125, isLocal: false, isDefinition: true)
!418 = distinct !DICompileUnit(language: DW_LANG_C11, file: !419, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !420, globals: !421, splitDebugInlining: false, nameTableKind: None)
!419 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!420 = !{!148}
!421 = !{!416, !422, !424}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !419, line: 46, type: !192, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !419, line: 49, type: !163, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "utf07FF", scope: !428, file: !429, line: 46, type: !456, isLocal: true, isDefinition: true)
!428 = distinct !DISubprogram(name: "proper_name_lite", scope: !429, file: !429, line: 38, type: !430, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !432, retainedNodes: !434)
!429 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!430 = !DISubroutineType(types: !431)
!431 = !{!125, !125, !125}
!432 = distinct !DICompileUnit(language: DW_LANG_C11, file: !429, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !433, splitDebugInlining: false, nameTableKind: None)
!433 = !{!426}
!434 = !{!435, !436, !437, !438, !443}
!435 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !428, file: !429, line: 38, type: !125)
!436 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !428, file: !429, line: 38, type: !125)
!437 = !DILocalVariable(name: "translation", scope: !428, file: !429, line: 40, type: !125)
!438 = !DILocalVariable(name: "w", scope: !428, file: !429, line: 47, type: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !440, line: 37, baseType: !441)
!440 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !306, line: 57, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !306, line: 42, baseType: !129)
!443 = !DILocalVariable(name: "mbs", scope: !428, file: !429, line: 48, type: !444)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !445, line: 6, baseType: !446)
!445 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !447, line: 21, baseType: !448)
!447 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 13, size: 64, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !448, file: !447, line: 15, baseType: !150, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !448, file: !447, line: 20, baseType: !452, size: 32, offset: 32)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !448, file: !447, line: 16, size: 32, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !452, file: !447, line: 18, baseType: !129, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !452, file: !447, line: 19, baseType: !163, size: 32)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 16, elements: !174)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !459, line: 78, type: !192, isLocal: true, isDefinition: true)
!459 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !459, line: 79, type: !168, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !459, line: 80, type: !464, isLocal: true, isDefinition: true)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 13)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !459, line: 81, type: !464, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !459, line: 82, type: !328, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !459, line: 83, type: !173, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !459, line: 84, type: !192, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !459, line: 85, type: !105, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !459, line: 86, type: !105, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !459, line: 87, type: !192, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !483, file: !459, line: 76, type: !569, isLocal: false, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C11, file: !459, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !484, retainedTypes: !504, globals: !505, splitDebugInlining: false, nameTableKind: None)
!484 = !{!485, !499, !132}
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !486, line: 42, baseType: !129, size: 32, elements: !487)
!486 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!488 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!489 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!490 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!491 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!492 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!493 = !DIEnumerator(name: "c_quoting_style", value: 5)
!494 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!495 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!496 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!497 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!498 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !486, line: 254, baseType: !129, size: 32, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!502 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!503 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!504 = !{!150, !151, !152}
!505 = !{!457, !460, !462, !467, !469, !471, !473, !475, !477, !479, !481, !506, !510, !520, !522, !527, !529, !531, !533, !535, !558, !565, !567}
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !483, file: !459, line: 92, type: !508, isLocal: false, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 320, elements: !96)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !483, file: !459, line: 1040, type: !512, isLocal: false, isDefinition: true)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !459, line: 56, size: 448, elements: !513)
!513 = !{!514, !515, !516, !518, !519}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !512, file: !459, line: 59, baseType: !485, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !459, line: 62, baseType: !150, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !512, file: !459, line: 66, baseType: !517, size: 256, offset: 64)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 256, elements: !193)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !512, file: !459, line: 69, baseType: !125, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !512, file: !459, line: 72, baseType: !125, size: 64, offset: 384)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !483, file: !459, line: 107, type: !512, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "slot0", scope: !483, file: !459, line: 831, type: !524, isLocal: true, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 256)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !459, line: 321, type: !173, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !459, line: 357, type: !173, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !459, line: 358, type: !173, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !459, line: 199, type: !105, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "quote", scope: !537, file: !459, line: 228, type: !556, isLocal: true, isDefinition: true)
!537 = distinct !DISubprogram(name: "gettext_quote", scope: !459, file: !459, line: 197, type: !538, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !483, retainedNodes: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!125, !125, !485}
!540 = !{!541, !542, !543, !544, !545}
!541 = !DILocalVariable(name: "msgid", arg: 1, scope: !537, file: !459, line: 197, type: !125)
!542 = !DILocalVariable(name: "s", arg: 2, scope: !537, file: !459, line: 197, type: !485)
!543 = !DILocalVariable(name: "translation", scope: !537, file: !459, line: 199, type: !125)
!544 = !DILocalVariable(name: "w", scope: !537, file: !459, line: 229, type: !439)
!545 = !DILocalVariable(name: "mbs", scope: !537, file: !459, line: 230, type: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !445, line: 6, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !447, line: 21, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 13, size: 64, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !548, file: !447, line: 15, baseType: !150, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !548, file: !447, line: 20, baseType: !552, size: 32, offset: 32)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !447, line: 16, size: 32, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !552, file: !447, line: 18, baseType: !129, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !552, file: !447, line: 19, baseType: !163, size: 32)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !557)
!557 = !{!175, !165}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "slotvec", scope: !483, file: !459, line: 834, type: !560, isLocal: true, isDefinition: true)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !459, line: 823, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !561, file: !459, line: 825, baseType: !152, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !561, file: !459, line: 826, baseType: !148, size: 64, offset: 64)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "nslots", scope: !483, file: !459, line: 832, type: !150, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "slotvec0", scope: !483, file: !459, line: 833, type: !561, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 704, elements: !10)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !573, line: 67, type: !3, isLocal: true, isDefinition: true)
!573 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !573, line: 69, type: !105, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !573, line: 83, type: !105, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !573, line: 83, type: !163, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !573, line: 85, type: !173, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !573, line: 88, type: !584, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 171)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !573, line: 88, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 34)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !573, line: 105, type: !82, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !573, line: 109, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 23)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !573, line: 113, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 28)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !573, line: 120, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !573, line: 127, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 36)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !573, line: 134, type: !210, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !573, line: 142, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 44)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !573, line: 150, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 48)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !573, line: 159, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 52)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !573, line: 170, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 60)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !573, line: 248, type: !328, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !573, line: 248, type: !235, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !573, line: 254, type: !328, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !573, line: 254, type: !112, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !573, line: 254, type: !210, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !573, line: 259, type: !648, isLocal: true, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 39)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !573, line: 259, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 29)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !658, file: !659, line: 26, type: !661, isLocal: false, isDefinition: true)
!658 = distinct !DICompileUnit(language: DW_LANG_C11, file: !659, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !660, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!660 = !{!656}
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 376, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 47)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "exit_failure", scope: !666, file: !667, line: 24, type: !669, isLocal: false, isDefinition: true)
!666 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !668, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!668 = !{!664}
!669 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !150)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !672, line: 34, type: !85, isLocal: true, isDefinition: true)
!672 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !672, line: 34, type: !105, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !672, line: 34, type: !205, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !679, line: 108, type: !90, isLocal: true, isDefinition: true)
!679 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "internal_state", scope: !682, file: !679, line: 97, type: !685, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C11, file: !679, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !683, globals: !684, splitDebugInlining: false, nameTableKind: None)
!683 = !{!149, !152, !155}
!684 = !{!677, !680}
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !445, line: 6, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !447, line: 21, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 13, size: 64, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !687, file: !447, line: 15, baseType: !150, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !687, file: !447, line: 20, baseType: !691, size: 32, offset: 32)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !687, file: !447, line: 16, size: 32, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !691, file: !447, line: 18, baseType: !129, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !691, file: !447, line: 19, baseType: !163, size: 32)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !697, line: 35, type: !173, isLocal: true, isDefinition: true)
!697 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !697, line: 35, type: !168, isLocal: true, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !573, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !703, retainedTypes: !707, globals: !708, splitDebugInlining: false, nameTableKind: None)
!703 = !{!704}
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !573, line: 40, baseType: !129, size: 32, elements: !705)
!705 = !{!706}
!706 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!707 = !{!149}
!708 = !{!571, !574, !576, !578, !580, !582, !587, !592, !594, !599, !604, !609, !614, !616, !621, !626, !631, !636, !638, !640, !642, !644, !646, !651}
!709 = distinct !DICompileUnit(language: DW_LANG_C11, file: !710, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !711, retainedTypes: !742, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!711 = !{!712, !724}
!712 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !713, file: !710, line: 188, baseType: !129, size: 32, elements: !722)
!713 = distinct !DISubprogram(name: "x2nrealloc", scope: !710, file: !710, line: 176, type: !714, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !709, retainedNodes: !717)
!714 = !DISubroutineType(types: !715)
!715 = !{!149, !149, !716, !152}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!717 = !{!718, !719, !720, !721}
!718 = !DILocalVariable(name: "p", arg: 1, scope: !713, file: !710, line: 176, type: !149)
!719 = !DILocalVariable(name: "pn", arg: 2, scope: !713, file: !710, line: 176, type: !716)
!720 = !DILocalVariable(name: "s", arg: 3, scope: !713, file: !710, line: 176, type: !152)
!721 = !DILocalVariable(name: "n", scope: !713, file: !710, line: 178, type: !152)
!722 = !{!723}
!723 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !725, file: !710, line: 228, baseType: !129, size: 32, elements: !722)
!725 = distinct !DISubprogram(name: "xpalloc", scope: !710, file: !710, line: 223, type: !726, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !709, retainedNodes: !732)
!726 = !DISubroutineType(types: !727)
!727 = !{!149, !149, !728, !729, !731, !729}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !730, line: 130, baseType: !731)
!730 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !153, line: 35, baseType: !307)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741}
!733 = !DILocalVariable(name: "pa", arg: 1, scope: !725, file: !710, line: 223, type: !149)
!734 = !DILocalVariable(name: "pn", arg: 2, scope: !725, file: !710, line: 223, type: !728)
!735 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !725, file: !710, line: 223, type: !729)
!736 = !DILocalVariable(name: "n_max", arg: 4, scope: !725, file: !710, line: 223, type: !731)
!737 = !DILocalVariable(name: "s", arg: 5, scope: !725, file: !710, line: 223, type: !729)
!738 = !DILocalVariable(name: "n0", scope: !725, file: !710, line: 230, type: !729)
!739 = !DILocalVariable(name: "n", scope: !725, file: !710, line: 237, type: !729)
!740 = !DILocalVariable(name: "nbytes", scope: !725, file: !710, line: 248, type: !729)
!741 = !DILocalVariable(name: "adjusted_nbytes", scope: !725, file: !710, line: 252, type: !729)
!742 = !{!148, !149, !266, !307, !154}
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !672, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !744, splitDebugInlining: false, nameTableKind: None)
!744 = !{!670, !673, !675}
!745 = distinct !DICompileUnit(language: DW_LANG_C11, file: !746, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !748, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!749 = distinct !DICompileUnit(language: DW_LANG_C11, file: !750, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!750 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!751 = distinct !DICompileUnit(language: DW_LANG_C11, file: !752, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !754, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !755, splitDebugInlining: false, nameTableKind: None)
!754 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!755 = !{!266, !154, !149}
!756 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !757, splitDebugInlining: false, nameTableKind: None)
!757 = !{!695, !698}
!758 = distinct !DICompileUnit(language: DW_LANG_C11, file: !759, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!760 = distinct !DICompileUnit(language: DW_LANG_C11, file: !761, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!762 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!763 = !{i32 7, !"Dwarf Version", i32 5}
!764 = !{i32 2, !"Debug Info Version", i32 3}
!765 = !{i32 1, !"wchar_size", i32 4}
!766 = !{i32 8, !"PIC Level", i32 2}
!767 = !{i32 7, !"PIE Level", i32 2}
!768 = !{i32 7, !"uwtable", i32 2}
!769 = !{i32 7, !"frame-pointer", i32 1}
!770 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !771, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !150}
!773 = !{!774}
!774 = !DILocalVariable(name: "status", arg: 1, scope: !770, file: !2, line: 37, type: !150)
!775 = !DILocation(line: 0, scope: !770)
!776 = !DILocation(line: 41, column: 3, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !2, line: 41, column: 3)
!778 = distinct !DILexicalBlock(scope: !770, file: !2, line: 41, column: 3)
!779 = !DILocation(line: 41, column: 3, scope: !778)
!780 = !DILocation(line: 43, column: 3, scope: !770)
!781 = !{!782, !782, i64 0}
!782 = !{!"any pointer", !783, i64 0}
!783 = !{!"omnipotent char", !784, i64 0}
!784 = !{!"Simple C/C++ TBAA"}
!785 = !DILocation(line: 47, column: 3, scope: !770)
!786 = !DILocation(line: 51, column: 3, scope: !770)
!787 = !DILocation(line: 54, column: 3, scope: !770)
!788 = !DILocation(line: 61, column: 3, scope: !770)
!789 = !DILocation(line: 68, column: 3, scope: !770)
!790 = !DILocation(line: 69, column: 3, scope: !770)
!791 = !DILocation(line: 70, column: 3, scope: !770)
!792 = !DILocation(line: 75, column: 3, scope: !770)
!793 = !DILocation(line: 87, column: 3, scope: !770)
!794 = !DILocation(line: 91, column: 3, scope: !770)
!795 = !DILocation(line: 92, column: 3, scope: !770)
!796 = !DILocation(line: 96, column: 3, scope: !770)
!797 = !DILocation(line: 97, column: 3, scope: !770)
!798 = !DISubprogram(name: "__assert_fail", scope: !799, file: !799, line: 69, type: !800, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !802)
!799 = !DIFile(filename: "/usr/include/assert.h", directory: "", checksumkind: CSK_MD5, checksum: "ab7dc6991d501750085448b20099a5a0")
!800 = !DISubroutineType(types: !801)
!801 = !{null, !125, !125, !129, !125}
!802 = !{}
!803 = !DISubprogram(name: "dcgettext", scope: !804, file: !804, line: 51, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!804 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!805 = !DISubroutineType(types: !806)
!806 = !{!148, !125, !125, !150}
!807 = !DISubprogram(name: "__printf_chk", scope: !808, file: !808, line: 95, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!808 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!809 = !DISubroutineType(types: !810)
!810 = !{!150, !150, !811, null}
!811 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !125)
!812 = !DISubprogram(name: "fputs_unlocked", scope: !373, file: !373, line: 691, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!813 = !DISubroutineType(types: !814)
!814 = !{!150, !811, !815}
!815 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !279)
!816 = !DILocation(line: 0, scope: !121)
!817 = !DILocation(line: 581, column: 7, scope: !264)
!818 = !{!819, !819, i64 0}
!819 = !{!"int", !783, i64 0}
!820 = !DILocation(line: 581, column: 19, scope: !264)
!821 = !DILocation(line: 581, column: 7, scope: !121)
!822 = !DILocation(line: 585, column: 26, scope: !263)
!823 = !DILocation(line: 0, scope: !263)
!824 = !DILocation(line: 586, column: 23, scope: !263)
!825 = !DILocation(line: 586, column: 28, scope: !263)
!826 = !DILocation(line: 586, column: 32, scope: !263)
!827 = !{!783, !783, i64 0}
!828 = !DILocation(line: 586, column: 38, scope: !263)
!829 = !DILocalVariable(name: "__s1", arg: 1, scope: !830, file: !831, line: 1359, type: !125)
!830 = distinct !DISubprogram(name: "streq", scope: !831, file: !831, line: 1359, type: !832, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !834)
!831 = !DIFile(filename: "./lib/string.h", directory: "/src")
!832 = !DISubroutineType(types: !833)
!833 = !{!266, !125, !125}
!834 = !{!829, !835}
!835 = !DILocalVariable(name: "__s2", arg: 2, scope: !830, file: !831, line: 1359, type: !125)
!836 = !DILocation(line: 0, scope: !830, inlinedAt: !837)
!837 = distinct !DILocation(line: 586, column: 41, scope: !263)
!838 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !837)
!839 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !837)
!840 = !DILocation(line: 586, column: 19, scope: !263)
!841 = !DILocation(line: 587, column: 5, scope: !263)
!842 = !DILocation(line: 588, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !121, file: !122, line: 588, column: 7)
!844 = !DILocation(line: 588, column: 7, scope: !121)
!845 = !DILocation(line: 590, column: 7, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !122, line: 589, column: 5)
!847 = !DILocation(line: 591, column: 7, scope: !846)
!848 = !DILocation(line: 595, column: 37, scope: !121)
!849 = !DILocation(line: 595, column: 35, scope: !121)
!850 = !DILocation(line: 596, column: 29, scope: !121)
!851 = !DILocation(line: 597, column: 8, scope: !272)
!852 = !DILocation(line: 597, column: 7, scope: !121)
!853 = !DILocation(line: 604, column: 24, scope: !271)
!854 = !DILocation(line: 604, column: 12, scope: !272)
!855 = !DILocation(line: 0, scope: !270)
!856 = !DILocation(line: 610, column: 16, scope: !270)
!857 = !DILocation(line: 610, column: 7, scope: !270)
!858 = !DILocation(line: 611, column: 21, scope: !270)
!859 = !{!860, !860, i64 0}
!860 = !{!"short", !783, i64 0}
!861 = !DILocation(line: 611, column: 19, scope: !270)
!862 = !DILocation(line: 611, column: 16, scope: !270)
!863 = !DILocation(line: 610, column: 30, scope: !270)
!864 = distinct !{!864, !857, !858, !865}
!865 = !{!"llvm.loop.mustprogress"}
!866 = !DILocation(line: 612, column: 18, scope: !867)
!867 = distinct !DILexicalBlock(scope: !270, file: !122, line: 612, column: 11)
!868 = !DILocation(line: 612, column: 11, scope: !270)
!869 = !DILocation(line: 620, column: 23, scope: !121)
!870 = !DILocation(line: 625, column: 39, scope: !121)
!871 = !DILocation(line: 626, column: 3, scope: !121)
!872 = !DILocation(line: 626, column: 10, scope: !121)
!873 = !DILocation(line: 626, column: 21, scope: !121)
!874 = !DILocation(line: 628, column: 44, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !122, line: 628, column: 11)
!876 = distinct !DILexicalBlock(scope: !121, file: !122, line: 627, column: 5)
!877 = !DILocation(line: 628, column: 32, scope: !875)
!878 = !DILocation(line: 628, column: 49, scope: !875)
!879 = !DILocation(line: 628, column: 11, scope: !876)
!880 = !DILocation(line: 630, column: 11, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !122, line: 630, column: 11)
!882 = !DILocation(line: 630, column: 11, scope: !876)
!883 = !DILocation(line: 632, column: 26, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !122, line: 632, column: 15)
!885 = distinct !DILexicalBlock(scope: !881, file: !122, line: 631, column: 9)
!886 = !DILocation(line: 632, column: 34, scope: !884)
!887 = !DILocation(line: 632, column: 37, scope: !884)
!888 = !DILocation(line: 632, column: 15, scope: !885)
!889 = !DILocation(line: 640, column: 16, scope: !876)
!890 = distinct !{!890, !871, !891, !865}
!891 = !DILocation(line: 641, column: 5, scope: !121)
!892 = !DILocation(line: 644, column: 3, scope: !121)
!893 = !DILocation(line: 0, scope: !830, inlinedAt: !894)
!894 = distinct !DILocation(line: 648, column: 31, scope: !121)
!895 = !DILocation(line: 0, scope: !830, inlinedAt: !896)
!896 = distinct !DILocation(line: 649, column: 31, scope: !121)
!897 = !DILocation(line: 0, scope: !830, inlinedAt: !898)
!898 = distinct !DILocation(line: 650, column: 31, scope: !121)
!899 = !DILocation(line: 0, scope: !830, inlinedAt: !900)
!900 = distinct !DILocation(line: 651, column: 31, scope: !121)
!901 = !DILocation(line: 0, scope: !830, inlinedAt: !902)
!902 = distinct !DILocation(line: 652, column: 31, scope: !121)
!903 = !DILocation(line: 0, scope: !830, inlinedAt: !904)
!904 = distinct !DILocation(line: 653, column: 31, scope: !121)
!905 = !DILocation(line: 0, scope: !830, inlinedAt: !906)
!906 = distinct !DILocation(line: 654, column: 31, scope: !121)
!907 = !DILocation(line: 0, scope: !830, inlinedAt: !908)
!908 = distinct !DILocation(line: 655, column: 31, scope: !121)
!909 = !DILocation(line: 0, scope: !830, inlinedAt: !910)
!910 = distinct !DILocation(line: 656, column: 31, scope: !121)
!911 = !DILocation(line: 0, scope: !830, inlinedAt: !912)
!912 = distinct !DILocation(line: 657, column: 31, scope: !121)
!913 = !DILocation(line: 663, column: 7, scope: !914)
!914 = distinct !DILexicalBlock(scope: !121, file: !122, line: 663, column: 7)
!915 = !DILocation(line: 664, column: 7, scope: !914)
!916 = !DILocation(line: 664, column: 10, scope: !914)
!917 = !DILocation(line: 663, column: 7, scope: !121)
!918 = !DILocation(line: 669, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !914, file: !122, line: 665, column: 5)
!920 = !DILocation(line: 671, column: 5, scope: !919)
!921 = !DILocation(line: 676, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !914, file: !122, line: 673, column: 5)
!923 = !DILocation(line: 679, column: 3, scope: !121)
!924 = !DILocation(line: 683, column: 3, scope: !121)
!925 = !DILocation(line: 686, column: 3, scope: !121)
!926 = !DILocation(line: 688, column: 3, scope: !121)
!927 = !DILocation(line: 691, column: 3, scope: !121)
!928 = !DILocation(line: 695, column: 3, scope: !121)
!929 = !DILocation(line: 696, column: 1, scope: !121)
!930 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !122, file: !122, line: 836, type: !931, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !933)
!931 = !DISubroutineType(cc: DW_CC_nocall, types: !932)
!932 = !{null, !125}
!933 = !{!934, !935, !942, !943, !945, !946}
!934 = !DILocalVariable(name: "program", arg: 1, scope: !930, file: !122, line: 836, type: !125)
!935 = !DILocalVariable(name: "infomap", scope: !930, file: !122, line: 838, type: !936)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 896, elements: !106)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !930, file: !122, line: 838, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !938, file: !122, line: 838, baseType: !125, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !938, file: !122, line: 838, baseType: !125, size: 64, offset: 64)
!942 = !DILocalVariable(name: "node", scope: !930, file: !122, line: 848, type: !125)
!943 = !DILocalVariable(name: "map_prog", scope: !930, file: !122, line: 849, type: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!945 = !DILocalVariable(name: "lc_messages", scope: !930, file: !122, line: 861, type: !125)
!946 = !DILocalVariable(name: "url_program", scope: !930, file: !122, line: 874, type: !125)
!947 = !DILocation(line: 0, scope: !930)
!948 = !DILocation(line: 857, column: 3, scope: !930)
!949 = !DILocation(line: 861, column: 29, scope: !930)
!950 = !DILocation(line: 862, column: 7, scope: !951)
!951 = distinct !DILexicalBlock(scope: !930, file: !122, line: 862, column: 7)
!952 = !DILocation(line: 862, column: 19, scope: !951)
!953 = !DILocation(line: 862, column: 22, scope: !951)
!954 = !DILocation(line: 862, column: 7, scope: !930)
!955 = !DILocation(line: 868, column: 7, scope: !956)
!956 = distinct !DILexicalBlock(scope: !951, file: !122, line: 863, column: 5)
!957 = !DILocation(line: 870, column: 5, scope: !956)
!958 = !DILocation(line: 875, column: 3, scope: !930)
!959 = !DILocation(line: 877, column: 3, scope: !930)
!960 = !DILocation(line: 879, column: 1, scope: !930)
!961 = !DISubprogram(name: "exit", scope: !962, file: !962, line: 624, type: !771, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !802)
!962 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!963 = !DISubprogram(name: "setlocale", scope: !964, file: !964, line: 122, type: !965, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!964 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!965 = !DISubroutineType(types: !966)
!966 = !{!148, !150, !125}
!967 = !DISubprogram(name: "strncmp", scope: !968, file: !968, line: 159, type: !969, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!968 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!969 = !DISubroutineType(types: !970)
!970 = !{!150, !125, !125, !152}
!971 = !DISubprogram(name: "getenv", scope: !962, file: !962, line: 641, type: !972, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!972 = !DISubroutineType(types: !973)
!973 = !{!148, !125}
!974 = !DISubprogram(name: "strcmp", scope: !968, file: !968, line: 156, type: !975, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!975 = !DISubroutineType(types: !976)
!976 = !{!150, !125, !125}
!977 = !DISubprogram(name: "strspn", scope: !968, file: !968, line: 297, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!978 = !DISubroutineType(types: !979)
!979 = !{!154, !125, !125}
!980 = !DISubprogram(name: "strchr", scope: !968, file: !968, line: 246, type: !981, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!981 = !DISubroutineType(types: !982)
!982 = !{!148, !125, !150}
!983 = !DISubprogram(name: "__ctype_b_loc", scope: !133, file: !133, line: 79, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!984 = !DISubroutineType(types: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!989 = !DISubprogram(name: "strcspn", scope: !968, file: !968, line: 293, type: !978, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!990 = !DISubprogram(name: "fwrite_unlocked", scope: !373, file: !373, line: 704, type: !991, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!991 = !DISubroutineType(types: !992)
!992 = !{!152, !993, !152, !152, !815}
!993 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!996 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 121, type: !997, scopeLine: 122, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1000)
!997 = !DISubroutineType(types: !998)
!998 = !{!150, !150, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007, !1010, !1011, !1015, !1016, !1022, !1023}
!1001 = !DILocalVariable(name: "argc", arg: 1, scope: !996, file: !2, line: 121, type: !150)
!1002 = !DILocalVariable(name: "argv", arg: 2, scope: !996, file: !2, line: 121, type: !999)
!1003 = !DILocalVariable(name: "display_return", scope: !996, file: !2, line: 123, type: !266)
!1004 = !DILocalVariable(name: "posixly_correct", scope: !996, file: !2, line: 124, type: !266)
!1005 = !DILocalVariable(name: "allow_options", scope: !996, file: !2, line: 125, type: !266)
!1006 = !DILocalVariable(name: "do_v9", scope: !996, file: !2, line: 132, type: !266)
!1007 = !DILocalVariable(name: "temp", scope: !1008, file: !2, line: 163, type: !125)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !2, line: 162, column: 7)
!1009 = distinct !DILexicalBlock(scope: !996, file: !2, line: 160, column: 7)
!1010 = !DILocalVariable(name: "i", scope: !1008, file: !2, line: 164, type: !152)
!1011 = !DILocalVariable(name: "s", scope: !1012, file: !2, line: 210, type: !125)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 209, column: 9)
!1013 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 207, column: 5)
!1014 = distinct !DILexicalBlock(scope: !996, file: !2, line: 206, column: 7)
!1015 = !DILocalVariable(name: "c", scope: !1012, file: !2, line: 211, type: !155)
!1016 = !DILocalVariable(name: "ch", scope: !1017, file: !2, line: 230, type: !155)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 229, column: 23)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !2, line: 218, column: 21)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !2, line: 216, column: 17)
!1020 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 215, column: 19)
!1021 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 214, column: 13)
!1022 = !DILabel(scope: !996, name: "just_echo", file: !2, line: 204)
!1023 = !DILabel(scope: !1018, name: "not_an_escape", file: !2, line: 259)
!1024 = !DILocation(line: 0, scope: !996)
!1025 = !DILocation(line: 124, column: 28, scope: !996)
!1026 = !DILocation(line: 124, column: 27, scope: !996)
!1027 = !DILocation(line: 127, column: 6, scope: !996)
!1028 = !DILocation(line: 127, column: 37, scope: !996)
!1029 = !DILocation(line: 127, column: 44, scope: !996)
!1030 = !DILocation(line: 127, column: 54, scope: !996)
!1031 = !DILocation(line: 0, scope: !830, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 127, column: 47, scope: !996)
!1033 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !1032)
!1034 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !1032)
!1035 = !DILocation(line: 135, column: 21, scope: !996)
!1036 = !DILocation(line: 135, column: 3, scope: !996)
!1037 = !DILocation(line: 136, column: 3, scope: !996)
!1038 = !DILocation(line: 137, column: 3, scope: !996)
!1039 = !DILocation(line: 138, column: 3, scope: !996)
!1040 = !DILocation(line: 140, column: 3, scope: !996)
!1041 = !DILocation(line: 144, column: 21, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !996, file: !2, line: 144, column: 7)
!1043 = !DILocation(line: 146, column: 18, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 146, column: 11)
!1045 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 145, column: 5)
!1046 = !DILocation(line: 0, scope: !830, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 146, column: 11, scope: !1044)
!1048 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !1047)
!1049 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !1047)
!1050 = !DILocation(line: 146, column: 11, scope: !1045)
!1051 = !DILocation(line: 147, column: 9, scope: !1044)
!1052 = !DILocation(line: 0, scope: !830, inlinedAt: !1053)
!1053 = distinct !DILocation(line: 149, column: 11, scope: !1054)
!1054 = distinct !DILexicalBlock(scope: !1045, file: !2, line: 149, column: 11)
!1055 = !DILocation(line: 1361, column: 11, scope: !830, inlinedAt: !1053)
!1056 = !DILocation(line: 1361, column: 10, scope: !830, inlinedAt: !1053)
!1057 = !DILocation(line: 149, column: 11, scope: !1045)
!1058 = !DILocation(line: 151, column: 24, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1054, file: !2, line: 150, column: 9)
!1060 = !DILocation(line: 151, column: 60, scope: !1059)
!1061 = !DILocation(line: 151, column: 69, scope: !1059)
!1062 = !DILocation(line: 151, column: 11, scope: !1059)
!1063 = !DILocation(line: 153, column: 11, scope: !1059)
!1064 = !DILocation(line: 157, column: 3, scope: !996)
!1065 = !DILocation(line: 158, column: 3, scope: !996)
!1066 = !DILocation(line: 160, column: 7, scope: !996)
!1067 = !DILocation(line: 123, column: 8, scope: !996)
!1068 = !DILocation(line: 200, column: 13, scope: !1008)
!1069 = !DILocation(line: 201, column: 13, scope: !1008)
!1070 = !DILocation(line: 161, column: 17, scope: !1009)
!1071 = !DILocation(line: 161, column: 21, scope: !1009)
!1072 = !DILocation(line: 161, column: 25, scope: !1009)
!1073 = !DILocation(line: 161, column: 24, scope: !1009)
!1074 = !DILocation(line: 161, column: 33, scope: !1009)
!1075 = !DILocation(line: 161, column: 5, scope: !1009)
!1076 = !DILocation(line: 163, column: 36, scope: !1008)
!1077 = !DILocation(line: 0, scope: !1008)
!1078 = !DILocation(line: 170, column: 14, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 170, column: 9)
!1080 = !DILocation(line: 170, scope: !1079)
!1081 = !DILocation(line: 170, column: 21, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 170, column: 9)
!1083 = !DILocation(line: 170, column: 9, scope: !1079)
!1084 = !DILocation(line: 170, column: 31, scope: !1082)
!1085 = !DILocation(line: 170, column: 9, scope: !1082)
!1086 = distinct !{!1086, !1083, !1087, !865}
!1087 = !DILocation(line: 177, column: 13, scope: !1079)
!1088 = !DILocation(line: 179, column: 15, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 179, column: 13)
!1090 = !DILocation(line: 179, column: 13, scope: !1008)
!1091 = !DILocation(line: 184, column: 16, scope: !1008)
!1092 = !DILocation(line: 184, column: 9, scope: !1008)
!1093 = !DILocation(line: 185, column: 24, scope: !1008)
!1094 = !DILocation(line: 185, column: 11, scope: !1008)
!1095 = !DILocation(line: 189, column: 15, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1008, file: !2, line: 186, column: 13)
!1097 = !DILocation(line: 193, column: 15, scope: !1096)
!1098 = !DILocation(line: 197, column: 15, scope: !1096)
!1099 = distinct !{!1099, !1092, !1100, !865}
!1100 = !DILocation(line: 198, column: 13, scope: !1008)
!1101 = !DILocation(line: 206, column: 13, scope: !1014)
!1102 = !DILocation(line: 204, column: 1, scope: !996)
!1103 = !DILocation(line: 0, scope: !1014)
!1104 = !DILocation(line: 283, column: 7, scope: !996)
!1105 = !DILocation(line: 273, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1014, file: !2, line: 272, column: 5)
!1107 = !DILocation(line: 275, column: 11, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1106, file: !2, line: 274, column: 9)
!1109 = !DILocation(line: 278, column: 20, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1108, file: !2, line: 278, column: 15)
!1111 = !DILocation(line: 278, column: 15, scope: !1108)
!1112 = !DILocation(line: 208, column: 7, scope: !1013)
!1113 = !DILocation(line: 210, column: 27, scope: !1012)
!1114 = !DILocation(line: 0, scope: !1012)
!1115 = !DILocation(line: 213, column: 11, scope: !1012)
!1116 = !DILocation(line: 213, column: 25, scope: !1012)
!1117 = !DILocation(line: 213, column: 23, scope: !1012)
!1118 = !DILocation(line: 215, column: 32, scope: !1020)
!1119 = !DILocation(line: 215, column: 19, scope: !1021)
!1120 = !DILocation(line: 217, column: 33, scope: !1019)
!1121 = !DILocation(line: 217, column: 19, scope: !1019)
!1122 = !DILocation(line: 219, column: 41, scope: !1018)
!1123 = !DILocation(line: 220, column: 41, scope: !1018)
!1124 = !DILocation(line: 222, column: 43, scope: !1018)
!1125 = !DILocation(line: 223, column: 41, scope: !1018)
!1126 = !DILocation(line: 224, column: 41, scope: !1018)
!1127 = !DILocation(line: 225, column: 41, scope: !1018)
!1128 = !DILocation(line: 226, column: 41, scope: !1018)
!1129 = !DILocation(line: 227, column: 41, scope: !1018)
!1130 = !DILocation(line: 230, column: 44, scope: !1017)
!1131 = !DILocation(line: 0, scope: !1017)
!1132 = !DILocation(line: 231, column: 43, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 231, column: 29)
!1134 = !DILocalVariable(name: "c", arg: 1, scope: !1135, file: !1136, line: 324, type: !150)
!1135 = distinct !DISubprogram(name: "c_isxdigit", scope: !1136, file: !1136, line: 324, type: !1137, scopeLine: 325, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1139)
!1136 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!266, !150}
!1139 = !{!1134}
!1140 = !DILocation(line: 0, scope: !1135, inlinedAt: !1141)
!1141 = distinct !DILocation(line: 231, column: 31, scope: !1133)
!1142 = !DILocation(line: 326, column: 3, scope: !1135, inlinedAt: !1141)
!1143 = !DILocation(line: 233, column: 26, scope: !1017)
!1144 = !DILocalVariable(name: "c", arg: 1, scope: !1145, file: !2, line: 102, type: !155)
!1145 = distinct !DISubprogram(name: "hextobin", scope: !2, file: !2, line: 102, type: !1146, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1148)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!150, !155}
!1148 = !{!1144}
!1149 = !DILocation(line: 0, scope: !1145, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 234, column: 29, scope: !1017)
!1151 = !DILocation(line: 104, column: 3, scope: !1145, inlinedAt: !1150)
!1152 = !DILocation(line: 106, column: 23, scope: !1153, inlinedAt: !1150)
!1153 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 105, column: 5)
!1154 = !DILocation(line: 106, column: 14, scope: !1153, inlinedAt: !1150)
!1155 = !DILocation(line: 108, column: 25, scope: !1153, inlinedAt: !1150)
!1156 = !DILocation(line: 109, column: 25, scope: !1153, inlinedAt: !1150)
!1157 = !DILocation(line: 110, column: 25, scope: !1153, inlinedAt: !1150)
!1158 = !DILocation(line: 111, column: 25, scope: !1153, inlinedAt: !1150)
!1159 = !DILocation(line: 112, column: 25, scope: !1153, inlinedAt: !1150)
!1160 = !DILocation(line: 0, scope: !1153, inlinedAt: !1150)
!1161 = !DILocation(line: 235, column: 30, scope: !1017)
!1162 = !DILocation(line: 236, column: 41, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1017, file: !2, line: 236, column: 29)
!1164 = !DILocation(line: 0, scope: !1135, inlinedAt: !1165)
!1165 = distinct !DILocation(line: 236, column: 29, scope: !1163)
!1166 = !DILocation(line: 326, column: 3, scope: !1135, inlinedAt: !1165)
!1167 = !DILocation(line: 238, column: 30, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !2, line: 237, column: 27)
!1169 = !DILocation(line: 239, column: 35, scope: !1168)
!1170 = !DILocation(line: 0, scope: !1145, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 239, column: 42, scope: !1168)
!1172 = !DILocation(line: 104, column: 3, scope: !1145, inlinedAt: !1171)
!1173 = !DILocation(line: 106, column: 23, scope: !1153, inlinedAt: !1171)
!1174 = !DILocation(line: 106, column: 14, scope: !1153, inlinedAt: !1171)
!1175 = !DILocation(line: 108, column: 25, scope: !1153, inlinedAt: !1171)
!1176 = !DILocation(line: 109, column: 25, scope: !1153, inlinedAt: !1171)
!1177 = !DILocation(line: 110, column: 25, scope: !1153, inlinedAt: !1171)
!1178 = !DILocation(line: 111, column: 25, scope: !1153, inlinedAt: !1171)
!1179 = !DILocation(line: 112, column: 25, scope: !1153, inlinedAt: !1171)
!1180 = !DILocation(line: 0, scope: !1153, inlinedAt: !1171)
!1181 = !DILocation(line: 239, column: 40, scope: !1168)
!1182 = !DILocation(line: 240, column: 27, scope: !1168)
!1183 = !DILocation(line: 245, column: 37, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 245, column: 27)
!1185 = !DILocation(line: 245, column: 40, scope: !1184)
!1186 = !DILocation(line: 247, column: 29, scope: !1018)
!1187 = !DILocation(line: 247, column: 23, scope: !1018)
!1188 = !DILocation(line: 0, scope: !1019)
!1189 = !DILocation(line: 251, column: 25, scope: !1018)
!1190 = !DILocation(line: 252, column: 34, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 252, column: 27)
!1192 = !DILocation(line: 252, column: 37, scope: !1191)
!1193 = !DILocation(line: 254, column: 34, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1018, file: !2, line: 254, column: 27)
!1195 = !DILocation(line: 254, column: 37, scope: !1194)
!1196 = !DILocation(line: 255, column: 31, scope: !1194)
!1197 = !DILocation(line: 255, column: 40, scope: !1194)
!1198 = !DILocation(line: 255, column: 43, scope: !1194)
!1199 = !DILocation(line: 255, column: 35, scope: !1194)
!1200 = !DILocation(line: 255, column: 25, scope: !1194)
!1201 = !DILocalVariable(name: "__c", arg: 1, scope: !1202, file: !1203, line: 108, type: !150)
!1202 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1203, file: !1203, line: 108, type: !1204, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !126, retainedNodes: !1206)
!1203 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!150, !150}
!1206 = !{!1201}
!1207 = !DILocation(line: 0, scope: !1202, inlinedAt: !1208)
!1208 = distinct !DILocation(line: 260, column: 31, scope: !1018)
!1209 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1208)
!1210 = !{!1211, !782, i64 40}
!1211 = !{!"_IO_FILE", !819, i64 0, !782, i64 8, !782, i64 16, !782, i64 24, !782, i64 32, !782, i64 40, !782, i64 48, !782, i64 56, !782, i64 64, !782, i64 72, !782, i64 80, !782, i64 88, !782, i64 96, !782, i64 104, !819, i64 112, !819, i64 116, !1212, i64 120, !860, i64 128, !783, i64 130, !783, i64 131, !782, i64 136, !1212, i64 144, !782, i64 152, !782, i64 160, !782, i64 168, !782, i64 176, !1212, i64 184, !819, i64 192, !783, i64 196}
!1212 = !{!"long", !783, i64 0}
!1213 = !{!1211, !782, i64 48}
!1214 = !{!"branch_weights", i32 2000, i32 1}
!1215 = !DILocation(line: 0, scope: !1202, inlinedAt: !1216)
!1216 = distinct !DILocation(line: 263, column: 15, scope: !1021)
!1217 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1216)
!1218 = !DILocation(line: 263, column: 15, scope: !1021)
!1219 = distinct !{!1219, !1115, !1220, !865}
!1220 = !DILocation(line: 264, column: 13, scope: !1012)
!1221 = !DILocation(line: 265, column: 15, scope: !1012)
!1222 = !DILocation(line: 266, column: 15, scope: !1012)
!1223 = !DILocation(line: 267, column: 20, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1012, file: !2, line: 267, column: 15)
!1225 = !DILocation(line: 267, column: 15, scope: !1012)
!1226 = !DILocation(line: 0, scope: !1202, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 268, column: 13, scope: !1224)
!1228 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1227)
!1229 = distinct !{!1229, !1112, !1230, !865}
!1230 = !DILocation(line: 269, column: 9, scope: !1013)
!1231 = !DILocation(line: 276, column: 15, scope: !1108)
!1232 = !DILocation(line: 277, column: 15, scope: !1108)
!1233 = !DILocation(line: 0, scope: !1202, inlinedAt: !1234)
!1234 = distinct !DILocation(line: 279, column: 13, scope: !1110)
!1235 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1234)
!1236 = distinct !{!1236, !1105, !1237, !865}
!1237 = !DILocation(line: 280, column: 9, scope: !1106)
!1238 = !DILocation(line: 0, scope: !1202, inlinedAt: !1239)
!1239 = distinct !DILocation(line: 284, column: 5, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !996, file: !2, line: 283, column: 7)
!1241 = !DILocation(line: 110, column: 10, scope: !1202, inlinedAt: !1239)
!1242 = !DILocation(line: 286, column: 1, scope: !996)
!1243 = !DISubprogram(name: "bindtextdomain", scope: !804, file: !804, line: 86, type: !1244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!148, !125, !125}
!1246 = !DISubprogram(name: "textdomain", scope: !804, file: !804, line: 82, type: !972, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1247 = !DISubprogram(name: "atexit", scope: !962, file: !962, line: 602, type: !1248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!150, !413}
!1250 = !DISubprogram(name: "__overflow", scope: !373, file: !373, line: 886, type: !1251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!150, !279, !150}
!1253 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !347, file: !347, line: 50, type: !1254, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1255)
!1254 = !DISubroutineType(types: !932)
!1255 = !{!1256}
!1256 = !DILocalVariable(name: "file", arg: 1, scope: !1253, file: !347, line: 50, type: !125)
!1257 = !DILocation(line: 0, scope: !1253)
!1258 = !DILocation(line: 52, column: 13, scope: !1253)
!1259 = !DILocation(line: 53, column: 1, scope: !1253)
!1260 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !347, file: !347, line: 87, type: !1261, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1263)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !266}
!1263 = !{!1264}
!1264 = !DILocalVariable(name: "ignore", arg: 1, scope: !1260, file: !347, line: 87, type: !266)
!1265 = !DILocation(line: 0, scope: !1260)
!1266 = !DILocation(line: 89, column: 16, scope: !1260)
!1267 = !{!1268, !1268, i64 0}
!1268 = !{!"_Bool", !783, i64 0}
!1269 = !DILocation(line: 90, column: 1, scope: !1260)
!1270 = distinct !DISubprogram(name: "close_stdout", scope: !347, file: !347, line: 116, type: !414, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !346, retainedNodes: !1271)
!1271 = !{!1272}
!1272 = !DILocalVariable(name: "write_error", scope: !1273, file: !347, line: 121, type: !125)
!1273 = distinct !DILexicalBlock(scope: !1274, file: !347, line: 120, column: 5)
!1274 = distinct !DILexicalBlock(scope: !1270, file: !347, line: 118, column: 7)
!1275 = !DILocation(line: 118, column: 21, scope: !1274)
!1276 = !DILocation(line: 118, column: 7, scope: !1274)
!1277 = !DILocation(line: 118, column: 29, scope: !1274)
!1278 = !DILocation(line: 119, column: 7, scope: !1274)
!1279 = !DILocation(line: 119, column: 12, scope: !1274)
!1280 = !{i8 0, i8 2}
!1281 = !DILocation(line: 119, column: 25, scope: !1274)
!1282 = !DILocation(line: 119, column: 28, scope: !1274)
!1283 = !DILocation(line: 119, column: 34, scope: !1274)
!1284 = !DILocation(line: 118, column: 7, scope: !1270)
!1285 = !DILocation(line: 121, column: 33, scope: !1273)
!1286 = !DILocation(line: 0, scope: !1273)
!1287 = !DILocation(line: 122, column: 11, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1273, file: !347, line: 122, column: 11)
!1289 = !DILocation(line: 0, scope: !1288)
!1290 = !DILocation(line: 122, column: 11, scope: !1273)
!1291 = !DILocation(line: 123, column: 9, scope: !1288)
!1292 = !DILocation(line: 126, column: 9, scope: !1288)
!1293 = !DILocation(line: 128, column: 14, scope: !1273)
!1294 = !DILocation(line: 128, column: 7, scope: !1273)
!1295 = !DILocation(line: 133, column: 42, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1270, file: !347, line: 133, column: 7)
!1297 = !DILocation(line: 133, column: 28, scope: !1296)
!1298 = !DILocation(line: 133, column: 50, scope: !1296)
!1299 = !DILocation(line: 133, column: 7, scope: !1270)
!1300 = !DILocation(line: 134, column: 12, scope: !1296)
!1301 = !DILocation(line: 134, column: 5, scope: !1296)
!1302 = !DILocation(line: 135, column: 1, scope: !1270)
!1303 = !DISubprogram(name: "__errno_location", scope: !1304, file: !1304, line: 37, type: !1305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1304 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!1308 = !DISubprogram(name: "_exit", scope: !1309, file: !1309, line: 624, type: !771, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1309 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1310 = distinct !DISubprogram(name: "verror", scope: !362, file: !362, line: 251, type: !1311, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1313)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{null, !150, !150, !125, !372}
!1313 = !{!1314, !1315, !1316, !1317}
!1314 = !DILocalVariable(name: "status", arg: 1, scope: !1310, file: !362, line: 251, type: !150)
!1315 = !DILocalVariable(name: "errnum", arg: 2, scope: !1310, file: !362, line: 251, type: !150)
!1316 = !DILocalVariable(name: "message", arg: 3, scope: !1310, file: !362, line: 251, type: !125)
!1317 = !DILocalVariable(name: "args", arg: 4, scope: !1310, file: !362, line: 251, type: !372)
!1318 = !DILocation(line: 0, scope: !1310)
!1319 = !DILocation(line: 251, column: 1, scope: !1310)
!1320 = !DILocation(line: 261, column: 3, scope: !1310)
!1321 = !DILocation(line: 265, column: 7, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1310, file: !362, line: 265, column: 7)
!1323 = !DILocation(line: 265, column: 7, scope: !1310)
!1324 = !DILocation(line: 266, column: 5, scope: !1322)
!1325 = !DILocation(line: 272, column: 7, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1322, file: !362, line: 268, column: 5)
!1327 = !DILocation(line: 276, column: 3, scope: !1310)
!1328 = !{i64 0, i64 8, !781, i64 8, i64 8, !781, i64 16, i64 8, !781, i64 24, i64 4, !818, i64 28, i64 4, !818}
!1329 = !DILocation(line: 282, column: 1, scope: !1310)
!1330 = distinct !DISubprogram(name: "flush_stdout", scope: !362, file: !362, line: 163, type: !414, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1331)
!1331 = !{!1332}
!1332 = !DILocalVariable(name: "stdout_fd", scope: !1330, file: !362, line: 166, type: !150)
!1333 = !DILocation(line: 0, scope: !1330)
!1334 = !DILocalVariable(name: "fd", arg: 1, scope: !1335, file: !362, line: 145, type: !150)
!1335 = distinct !DISubprogram(name: "is_open", scope: !362, file: !362, line: 145, type: !1204, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1336)
!1336 = !{!1334}
!1337 = !DILocation(line: 0, scope: !1335, inlinedAt: !1338)
!1338 = distinct !DILocation(line: 182, column: 25, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1330, file: !362, line: 182, column: 7)
!1340 = !DILocation(line: 157, column: 15, scope: !1335, inlinedAt: !1338)
!1341 = !DILocation(line: 157, column: 12, scope: !1335, inlinedAt: !1338)
!1342 = !DILocation(line: 182, column: 7, scope: !1330)
!1343 = !DILocation(line: 184, column: 5, scope: !1339)
!1344 = !DILocation(line: 185, column: 1, scope: !1330)
!1345 = !DISubprogram(name: "__fprintf_chk", scope: !808, file: !808, line: 93, type: !1346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !802)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!150, !1348, !150, !811, null}
!1348 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !281, line: 7, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !283, line: 49, size: 1728, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1351, file: !283, line: 51, baseType: !150, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1351, file: !283, line: 54, baseType: !148, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1351, file: !283, line: 55, baseType: !148, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1351, file: !283, line: 56, baseType: !148, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1351, file: !283, line: 57, baseType: !148, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1351, file: !283, line: 58, baseType: !148, size: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1351, file: !283, line: 59, baseType: !148, size: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1351, file: !283, line: 60, baseType: !148, size: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1351, file: !283, line: 61, baseType: !148, size: 64, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1351, file: !283, line: 64, baseType: !148, size: 64, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1351, file: !283, line: 65, baseType: !148, size: 64, offset: 640)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1351, file: !283, line: 66, baseType: !148, size: 64, offset: 704)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1351, file: !283, line: 68, baseType: !298, size: 64, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1351, file: !283, line: 70, baseType: !1367, size: 64, offset: 832)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1351, file: !283, line: 72, baseType: !150, size: 32, offset: 896)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1351, file: !283, line: 73, baseType: !150, size: 32, offset: 928)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1351, file: !283, line: 74, baseType: !305, size: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1351, file: !283, line: 77, baseType: !151, size: 16, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1351, file: !283, line: 78, baseType: !310, size: 8, offset: 1040)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1351, file: !283, line: 79, baseType: !90, size: 8, offset: 1048)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1351, file: !283, line: 81, baseType: !313, size: 64, offset: 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1351, file: !283, line: 89, baseType: !316, size: 64, offset: 1152)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1351, file: !283, line: 91, baseType: !318, size: 64, offset: 1216)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1351, file: !283, line: 92, baseType: !321, size: 64, offset: 1280)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1351, file: !283, line: 93, baseType: !1367, size: 64, offset: 1344)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1351, file: !283, line: 94, baseType: !149, size: 64, offset: 1408)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1351, file: !283, line: 95, baseType: !152, size: 64, offset: 1472)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1351, file: !283, line: 96, baseType: !150, size: 32, offset: 1536)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1351, file: !283, line: 98, baseType: !328, size: 160, offset: 1568)
!1383 = distinct !DISubprogram(name: "error_tail", scope: !362, file: !362, line: 219, type: !1311, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !361, retainedNodes: !1384)
!1384 = !{!1385, !1386, !1387, !1388}
