; ModuleID = 'src/expand.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [66 x i8] c"Convert tabs in each FILE to spaces, writing to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"expand\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [63 x i8] c"  -i, --initial\0A         do not convert tabs after non blanks\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [61 x i8] c"  -t, --tabs=N\0A         have tabs N characters apart, not 8\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !32

!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 131, baseType: !69, size: 32, elements: !88)
!88 = !{!89}
!89 = !DIEnumerator(name: "MCEL_ERR_MIN", value: 128)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 130, baseType: !69, size: 32, elements: !91)
!91 = !{!92}
!92 = !DIEnumerator(name: "MCEL_CHAR_MAX", value: 1114111)
!93 = !{!94, !95, !63, !96, !97, !100, !102, !103}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !98, line: 46, baseType: !99)
!98 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!99 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!104 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !105, !110, !115, !120, !125, !207, !212, !214, !219, !224, !229, !231, !233, !238, !240, !242, !244, !246, !251, !253, !255, !257, !259, !261, !263, !268, !273, !278, !280, !282, !284, !286, !288, !290, !295, !297, !299, !304, !309, !314, !57, !319, !321, !323, !325, !327, !339, !396, !401}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 14)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !2, line: 229, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 16)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !62, line: 729, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 56)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !62, line: 736, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 75)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !127, file: !62, line: 575, type: !63, isLocal: true, isDefinition: true)
!127 = distinct !DISubprogram(name: "oputs_", scope: !62, file: !62, line: 573, type: !128, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !130)
!128 = !DISubroutineType(cc: DW_CC_nocall, types: !129)
!129 = !{null, !100, !100}
!130 = !{!131, !132, !133, !136, !137, !138, !139, !143, !144, !145, !146, !148, !201, !202, !203, !205, !206}
!131 = !DILocalVariable(name: "program", arg: 1, scope: !127, file: !62, line: 573, type: !100)
!132 = !DILocalVariable(name: "option", arg: 2, scope: !127, file: !62, line: 573, type: !100)
!133 = !DILocalVariable(name: "term", scope: !134, file: !62, line: 585, type: !100)
!134 = distinct !DILexicalBlock(scope: !135, file: !62, line: 582, column: 5)
!135 = distinct !DILexicalBlock(scope: !127, file: !62, line: 581, column: 7)
!136 = !DILocalVariable(name: "double_space", scope: !127, file: !62, line: 594, type: !103)
!137 = !DILocalVariable(name: "first_word", scope: !127, file: !62, line: 595, type: !100)
!138 = !DILocalVariable(name: "option_text", scope: !127, file: !62, line: 596, type: !100)
!139 = !DILocalVariable(name: "s", scope: !140, file: !62, line: 608, type: !100)
!140 = distinct !DILexicalBlock(scope: !141, file: !62, line: 605, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !62, line: 604, column: 12)
!142 = distinct !DILexicalBlock(scope: !127, file: !62, line: 597, column: 7)
!143 = !DILocalVariable(name: "spaces", scope: !140, file: !62, line: 609, type: !97)
!144 = !DILocalVariable(name: "anchor_len", scope: !127, file: !62, line: 620, type: !97)
!145 = !DILocalVariable(name: "desc_text", scope: !127, file: !62, line: 625, type: !100)
!146 = !DILocalVariable(name: "__ptr", scope: !147, file: !62, line: 644, type: !100)
!147 = distinct !DILexicalBlock(scope: !127, file: !62, line: 644, column: 3)
!148 = !DILocalVariable(name: "__stream", scope: !147, file: !62, line: 644, type: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !152)
!151 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !154)
!153 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !170, !172, !173, !174, !178, !179, !181, !182, !185, !187, !190, !193, !194, !195, !196, !197}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !152, file: !153, line: 51, baseType: !63, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !152, file: !153, line: 54, baseType: !94, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !152, file: !153, line: 55, baseType: !94, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !152, file: !153, line: 56, baseType: !94, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !152, file: !153, line: 57, baseType: !94, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !152, file: !153, line: 58, baseType: !94, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !152, file: !153, line: 59, baseType: !94, size: 64, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !152, file: !153, line: 60, baseType: !94, size: 64, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !152, file: !153, line: 61, baseType: !94, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !152, file: !153, line: 64, baseType: !94, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !152, file: !153, line: 65, baseType: !94, size: 64, offset: 640)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !152, file: !153, line: 66, baseType: !94, size: 64, offset: 704)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !152, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !153, line: 36, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !152, file: !153, line: 70, baseType: !171, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !152, file: !153, line: 72, baseType: !63, size: 32, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !152, file: !153, line: 73, baseType: !63, size: 32, offset: 928)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !152, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !176, line: 152, baseType: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!177 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !152, file: !153, line: 77, baseType: !96, size: 16, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !152, file: !153, line: 78, baseType: !180, size: 8, offset: 1040)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !152, file: !153, line: 79, baseType: !44, size: 8, offset: 1048)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !152, file: !153, line: 81, baseType: !183, size: 64, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !153, line: 43, baseType: null)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !152, file: !153, line: 89, baseType: !186, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !176, line: 153, baseType: !177)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !152, file: !153, line: 91, baseType: !188, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !153, line: 37, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !152, file: !153, line: 92, baseType: !191, size: 64, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !153, line: 38, flags: DIFlagFwdDecl)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !152, file: !153, line: 93, baseType: !171, size: 64, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !152, file: !153, line: 94, baseType: !95, size: 64, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !152, file: !153, line: 95, baseType: !97, size: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !152, file: !153, line: 96, baseType: !63, size: 32, offset: 1536)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !152, file: !153, line: 98, baseType: !198, size: 160, offset: 1568)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 20)
!201 = !DILocalVariable(name: "__cnt", scope: !147, file: !62, line: 644, type: !97)
!202 = !DILocalVariable(name: "url_program", scope: !127, file: !62, line: 648, type: !100)
!203 = !DILocalVariable(name: "__ptr", scope: !204, file: !62, line: 686, type: !100)
!204 = distinct !DILexicalBlock(scope: !127, file: !62, line: 686, column: 3)
!205 = !DILocalVariable(name: "__stream", scope: !204, file: !62, line: 686, type: !149)
!206 = !DILocalVariable(name: "__cnt", scope: !204, file: !62, line: 686, type: !97)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !62, line: 585, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 5)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !62, line: 586, type: !209, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !62, line: 595, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 4)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !62, line: 620, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 6)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 2)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !209, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !216, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !62, line: 650, type: !209, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !62, line: 652, type: !19, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !62, line: 653, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 8)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !62, line: 654, type: !49, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !62, line: 655, type: !49, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !62, line: 656, type: !49, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !62, line: 657, type: !49, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !62, line: 663, type: !19, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !62, line: 664, type: !49, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 17)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 40)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 15)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !29, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !62, line: 679, type: !235, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !62, line: 683, type: !209, isLocal: true, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !62, line: 688, type: !209, isLocal: true, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !62, line: 691, type: !248, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !62, line: 839, type: !112, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !62, line: 840, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 22)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !62, line: 841, type: !275, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !62, line: 862, type: !216, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !62, line: 868, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 71)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !62, line: 875, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 27)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !62, line: 877, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 51)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !62, line: 877, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 12)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !209, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !248, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !209, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !248, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "longopts", scope: !59, file: !2, line: 54, type: !329, isLocal: true, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 1280, elements: !210)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !332, line: 50, size: 256, elements: !333)
!332 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!333 = !{!334, !335, !336, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !332, line: 52, baseType: !100, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !331, file: !332, line: 55, baseType: !63, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !332, line: 56, baseType: !337, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !331, file: !332, line: 57, baseType: !63, size: 32, offset: 192)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "line_in", scope: !341, file: !2, line: 110, type: !393, isLocal: true, isDefinition: true)
!341 = distinct !DISubprogram(name: "expand", scope: !2, file: !2, line: 102, type: !342, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !344)
!342 = !DISubroutineType(types: !343)
!343 = !{null}
!344 = !{!345, !346, !359, !371, !372, !378, !379, !385, !386, !389, !391, !392}
!345 = !DILocalVariable(name: "fp", scope: !341, file: !2, line: 105, type: !149)
!346 = !DILocalVariable(name: "mbbuf", scope: !341, file: !2, line: 111, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !348, line: 50, baseType: !349)
!348 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 43, size: 320, elements: !350)
!350 = !{!351, !352, !353, !357, !358}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !349, file: !348, line: 45, baseType: !94, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !349, file: !348, line: 46, baseType: !149, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !348, line: 47, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !355, line: 130, baseType: !356)
!355 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !98, line: 35, baseType: !177)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !348, line: 48, baseType: !354, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !349, file: !348, line: 49, baseType: !354, size: 64, offset: 256)
!359 = !DILocalVariable(name: "g", scope: !360, file: !2, line: 117, type: !361)
!360 = distinct !DILexicalBlock(scope: !341, file: !2, line: 115, column: 5)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !84, line: 143, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 138, size: 64, elements: !363)
!363 = !{!364, !369, !370}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !362, file: !84, line: 140, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !366, line: 37, baseType: !367)
!366 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !176, line: 57, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !176, line: 42, baseType: !69)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !362, file: !84, line: 141, baseType: !102, size: 8, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !362, file: !84, line: 142, baseType: !102, size: 8, offset: 40)
!371 = !DILocalVariable(name: "convert", scope: !360, file: !2, line: 120, type: !103)
!372 = !DILocalVariable(name: "column", scope: !360, file: !2, line: 127, type: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "colno", file: !374, line: 20, baseType: !375)
!374 = !DIFile(filename: "src/expand-common.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a812a23c6054c0178c7555c3090cc098")
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !376, line: 101, baseType: !377)
!376 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !176, line: 72, baseType: !177)
!378 = !DILocalVariable(name: "tab_index", scope: !360, file: !2, line: 130, type: !354)
!379 = !DILocalVariable(name: "last_tab", scope: !380, file: !2, line: 148, type: !103)
!380 = distinct !DILexicalBlock(scope: !381, file: !2, line: 146, column: 17)
!381 = distinct !DILexicalBlock(scope: !382, file: !2, line: 145, column: 19)
!382 = distinct !DILexicalBlock(scope: !383, file: !2, line: 142, column: 13)
!383 = distinct !DILexicalBlock(scope: !384, file: !2, line: 141, column: 15)
!384 = distinct !DILexicalBlock(scope: !360, file: !2, line: 136, column: 9)
!385 = !DILocalVariable(name: "next_tab_column", scope: !380, file: !2, line: 149, type: !373)
!386 = !DILocalVariable(name: "width", scope: !387, file: !2, line: 170, type: !63)
!387 = distinct !DILexicalBlock(scope: !388, file: !2, line: 169, column: 17)
!388 = distinct !DILexicalBlock(scope: !381, file: !2, line: 161, column: 24)
!389 = !DILocalVariable(name: "__ptr", scope: !390, file: !2, line: 180, type: !100)
!390 = distinct !DILexicalBlock(scope: !384, file: !2, line: 180, column: 11)
!391 = !DILocalVariable(name: "__stream", scope: !390, file: !2, line: 180, type: !149)
!392 = !DILocalVariable(name: "__cnt", scope: !390, file: !2, line: 180, type: !97)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 262144)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !2, line: 172, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 23)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !62, line: 952, type: !316, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 272, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 34)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "convert_entire_line", scope: !408, file: !409, line: 30, type: !103, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !434, globals: !435, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "src/expand-common.c", directory: "/src", checksumkind: CSK_MD5, checksum: "942c25878b2cf9f4cd3ad8d127f8f292")
!410 = !{!67, !411, !425}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !412, line: 42, baseType: !69, size: 32, elements: !413)
!412 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!414 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!415 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!416 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!417 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!418 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!419 = !DIEnumerator(name: "c_quoting_style", value: 5)
!420 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!421 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!422 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!423 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!424 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !426, line: 44, baseType: !69, size: 32, elements: !427)
!426 = !DIFile(filename: "./lib/fadvise.h", directory: "/src", checksumkind: CSK_MD5, checksum: "8bbfadd819a4efc4455fc2741023266a")
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0)
!429 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2)
!430 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5)
!431 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4)
!432 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3)
!433 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1)
!434 = !{!63, !96, !103, !177, !99, !95, !97, !100, !102}
!435 = !{!406, !436, !438, !443, !445, !450, !455, !460, !462, !507, !509, !511, !513, !515, !520, !522, !524, !527, !529, !531, !536, !538, !543, !548, !553, !555, !557, !559, !561, !564, !567, !596, !598, !600, !602, !604, !606, !608, !610, !612, !614, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648}
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "exit_status", scope: !408, file: !409, line: 69, type: !63, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !409, line: 177, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 41)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !409, line: 188, type: !440, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !409, line: 207, type: !447, isLocal: true, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 11)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !409, line: 209, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 25)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !409, line: 217, type: !457, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 43)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !409, line: 326, type: !398, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "prev_file", scope: !464, file: !409, line: 351, type: !94, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "next_file", scope: !409, file: !409, line: 349, type: !465, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !501)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !151, line: 7, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !153, line: 49, size: 1728, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !469, file: !153, line: 51, baseType: !63, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !469, file: !153, line: 54, baseType: !94, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !469, file: !153, line: 55, baseType: !94, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !469, file: !153, line: 56, baseType: !94, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !469, file: !153, line: 57, baseType: !94, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !469, file: !153, line: 58, baseType: !94, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !469, file: !153, line: 59, baseType: !94, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !469, file: !153, line: 60, baseType: !94, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !469, file: !153, line: 61, baseType: !94, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !469, file: !153, line: 64, baseType: !94, size: 64, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !469, file: !153, line: 65, baseType: !94, size: 64, offset: 640)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !469, file: !153, line: 66, baseType: !94, size: 64, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !469, file: !153, line: 68, baseType: !168, size: 64, offset: 768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !469, file: !153, line: 70, baseType: !485, size: 64, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !469, file: !153, line: 72, baseType: !63, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !469, file: !153, line: 73, baseType: !63, size: 32, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !469, file: !153, line: 74, baseType: !175, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !469, file: !153, line: 77, baseType: !96, size: 16, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !469, file: !153, line: 78, baseType: !180, size: 8, offset: 1040)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !469, file: !153, line: 79, baseType: !44, size: 8, offset: 1048)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !469, file: !153, line: 81, baseType: !183, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !469, file: !153, line: 89, baseType: !186, size: 64, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !469, file: !153, line: 91, baseType: !188, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !469, file: !153, line: 92, baseType: !191, size: 64, offset: 1280)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !469, file: !153, line: 93, baseType: !485, size: 64, offset: 1344)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !469, file: !153, line: 94, baseType: !95, size: 64, offset: 1408)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !469, file: !153, line: 95, baseType: !97, size: 64, offset: 1472)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !469, file: !153, line: 96, baseType: !63, size: 32, offset: 1536)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !469, file: !153, line: 98, baseType: !198, size: 160, offset: 1568)
!501 = !{!502, !503, !504}
!502 = !DILocalVariable(name: "fp", arg: 1, scope: !464, file: !409, line: 349, type: !467)
!503 = !DILocalVariable(name: "file", scope: !464, file: !409, line: 352, type: !94)
!504 = !DILocalVariable(name: "err", scope: !505, file: !409, line: 356, type: !63)
!505 = distinct !DILexicalBlock(scope: !506, file: !409, line: 355, column: 5)
!506 = distinct !DILexicalBlock(scope: !464, file: !409, line: 354, column: 7)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !409, line: 359, type: !226, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !409, line: 365, type: !235, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !409, line: 378, type: !226, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !409, line: 405, type: !301, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !409, line: 409, type: !517, isLocal: true, isDefinition: true)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2440, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 305)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "max_column_width", scope: !408, file: !409, line: 42, type: !354, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "first_free_tab", scope: !408, file: !409, line: 54, type: !354, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "tab_list", scope: !408, file: !409, line: 47, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "n_tabs_allocated", scope: !408, file: !409, line: 50, type: !354, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !409, line: 78, type: !398, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !409, line: 103, type: !533, isLocal: true, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 47)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !409, line: 122, type: !533, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !409, line: 249, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 21)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !409, line: 251, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 28)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !409, line: 256, type: !550, isLocal: true, isDefinition: true)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 45)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "extend_size", scope: !408, file: !409, line: 36, type: !373, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "increment_size", scope: !408, file: !409, line: 39, type: !373, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "tab_size", scope: !408, file: !409, line: 33, type: !373, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !408, file: !409, line: 66, type: !103, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "stdin_argv", scope: !408, file: !409, line: 60, type: !563, isLocal: true, isDefinition: true)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !227)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "file_list", scope: !408, file: !409, line: 57, type: !566, isLocal: true, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !569, file: !62, line: 575, type: !63, isLocal: true, isDefinition: true)
!569 = distinct !DISubprogram(name: "oputs_", scope: !62, file: !62, line: 573, type: !570, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !571)
!570 = !DISubroutineType(types: !129)
!571 = !{!572, !573, !574, !577, !578, !579, !580, !584, !585, !586, !587, !589, !590, !591, !592, !594, !595}
!572 = !DILocalVariable(name: "program", arg: 1, scope: !569, file: !62, line: 573, type: !100)
!573 = !DILocalVariable(name: "option", arg: 2, scope: !569, file: !62, line: 573, type: !100)
!574 = !DILocalVariable(name: "term", scope: !575, file: !62, line: 585, type: !100)
!575 = distinct !DILexicalBlock(scope: !576, file: !62, line: 582, column: 5)
!576 = distinct !DILexicalBlock(scope: !569, file: !62, line: 581, column: 7)
!577 = !DILocalVariable(name: "double_space", scope: !569, file: !62, line: 594, type: !103)
!578 = !DILocalVariable(name: "first_word", scope: !569, file: !62, line: 595, type: !100)
!579 = !DILocalVariable(name: "option_text", scope: !569, file: !62, line: 596, type: !100)
!580 = !DILocalVariable(name: "s", scope: !581, file: !62, line: 608, type: !100)
!581 = distinct !DILexicalBlock(scope: !582, file: !62, line: 605, column: 5)
!582 = distinct !DILexicalBlock(scope: !583, file: !62, line: 604, column: 12)
!583 = distinct !DILexicalBlock(scope: !569, file: !62, line: 597, column: 7)
!584 = !DILocalVariable(name: "spaces", scope: !581, file: !62, line: 609, type: !97)
!585 = !DILocalVariable(name: "anchor_len", scope: !569, file: !62, line: 620, type: !97)
!586 = !DILocalVariable(name: "desc_text", scope: !569, file: !62, line: 625, type: !100)
!587 = !DILocalVariable(name: "__ptr", scope: !588, file: !62, line: 644, type: !100)
!588 = distinct !DILexicalBlock(scope: !569, file: !62, line: 644, column: 3)
!589 = !DILocalVariable(name: "__stream", scope: !588, file: !62, line: 644, type: !467)
!590 = !DILocalVariable(name: "__cnt", scope: !588, file: !62, line: 644, type: !97)
!591 = !DILocalVariable(name: "url_program", scope: !569, file: !62, line: 648, type: !100)
!592 = !DILocalVariable(name: "__ptr", scope: !593, file: !62, line: 686, type: !100)
!593 = distinct !DILexicalBlock(scope: !569, file: !62, line: 686, column: 3)
!594 = !DILocalVariable(name: "__stream", scope: !593, file: !62, line: 686, type: !467)
!595 = !DILocalVariable(name: "__cnt", scope: !593, file: !62, line: 686, type: !97)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !62, line: 585, type: !209, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !62, line: 586, type: !209, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !62, line: 595, type: !216, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !62, line: 620, type: !221, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !226, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !62, line: 648, type: !209, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !216, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !62, line: 649, type: !235, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !62, line: 650, type: !209, isLocal: true, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !62, line: 651, type: !221, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !62, line: 652, type: !19, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !62, line: 653, type: !248, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !62, line: 654, type: !49, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !62, line: 655, type: !49, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !62, line: 656, type: !49, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !62, line: 657, type: !49, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !62, line: 663, type: !19, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !62, line: 664, type: !49, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !265, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !62, line: 669, type: !270, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !275, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !62, line: 676, type: !29, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !62, line: 679, type: !235, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !62, line: 683, type: !209, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !62, line: 688, type: !209, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !62, line: 691, type: !248, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !653, line: 3, type: !275, isLocal: true, isDefinition: true)
!653 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "Version", scope: !656, file: !653, line: 3, type: !100, isLocal: false, isDefinition: true)
!656 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !657, splitDebugInlining: false, nameTableKind: None)
!657 = !{!651, !654}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "file_name", scope: !660, file: !661, line: 45, type: !100, isLocal: true, isDefinition: true)
!660 = distinct !DICompileUnit(language: DW_LANG_C11, file: !661, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!662 = !{!663, !665, !667, !669, !658, !671}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !661, line: 121, type: !19, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !661, line: 121, type: !316, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(scope: null, file: !661, line: 123, type: !19, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !661, line: 126, type: !235, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !660, file: !661, line: 55, type: !103, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !675, file: !676, line: 66, type: !724, isLocal: false, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C11, file: !676, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, globals: !678, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!677 = !{!95, !102}
!678 = !{!679, !681, !706, !708, !710, !712, !673, !714, !716, !718, !720, !722}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !676, line: 272, type: !209, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "old_file_name", scope: !683, file: !676, line: 304, type: !100, isLocal: true, isDefinition: true)
!683 = distinct !DISubprogram(name: "verror_at_line", scope: !676, file: !676, line: 298, type: !684, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !675, retainedNodes: !699)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !63, !63, !100, !69, !100, !686}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !687, line: 52, baseType: !688)
!687 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !689, line: 14, baseType: !690)
!689 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !691, baseType: !692)
!691 = !DIFile(filename: "lib/error.c", directory: "/src")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !693)
!693 = !{!694, !695, !696, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !692, file: !691, baseType: !95, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !692, file: !691, baseType: !95, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !692, file: !691, baseType: !95, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !692, file: !691, baseType: !63, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !692, file: !691, baseType: !63, size: 32, offset: 224)
!699 = !{!700, !701, !702, !703, !704, !705}
!700 = !DILocalVariable(name: "status", arg: 1, scope: !683, file: !676, line: 298, type: !63)
!701 = !DILocalVariable(name: "errnum", arg: 2, scope: !683, file: !676, line: 298, type: !63)
!702 = !DILocalVariable(name: "file_name", arg: 3, scope: !683, file: !676, line: 298, type: !100)
!703 = !DILocalVariable(name: "line_number", arg: 4, scope: !683, file: !676, line: 298, type: !69)
!704 = !DILocalVariable(name: "message", arg: 5, scope: !683, file: !676, line: 298, type: !100)
!705 = !DILocalVariable(name: "args", arg: 6, scope: !683, file: !676, line: 298, type: !686)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "old_line_number", scope: !683, file: !676, line: 305, type: !69, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !676, line: 338, type: !216, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !676, line: 346, type: !248, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !676, line: 346, type: !226, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "error_message_count", scope: !675, file: !676, line: 69, type: !69, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !675, file: !676, line: 295, type: !63, isLocal: false, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !676, line: 208, type: !19, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !676, line: 208, type: !540, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !676, line: 214, type: !209, isLocal: true, isDefinition: true)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "program_name", scope: !727, file: !728, line: 31, type: !100, isLocal: false, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !729, globals: !730, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!729 = !{!94}
!730 = !{!725, !731, !733}
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !728, line: 46, type: !248, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !728, line: 49, type: !216, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "utf07FF", scope: !737, file: !738, line: 46, type: !761, isLocal: true, isDefinition: true)
!737 = distinct !DISubprogram(name: "proper_name_lite", scope: !738, file: !738, line: 38, type: !739, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !741, retainedNodes: !743)
!738 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!739 = !DISubroutineType(types: !740)
!740 = !{!100, !100, !100}
!741 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !742, splitDebugInlining: false, nameTableKind: None)
!742 = !{!735}
!743 = !{!744, !745, !746, !747, !748}
!744 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !737, file: !738, line: 38, type: !100)
!745 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !737, file: !738, line: 38, type: !100)
!746 = !DILocalVariable(name: "translation", scope: !737, file: !738, line: 40, type: !100)
!747 = !DILocalVariable(name: "w", scope: !737, file: !738, line: 47, type: !365)
!748 = !DILocalVariable(name: "mbs", scope: !737, file: !738, line: 48, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !751)
!750 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !753)
!752 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !753, file: !752, line: 15, baseType: !63, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !753, file: !752, line: 20, baseType: !757, size: 32, offset: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !753, file: !752, line: 16, size: 32, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !757, file: !752, line: 18, baseType: !69, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !757, file: !752, line: 19, baseType: !216, size: 32)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 16, elements: !227)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !764, line: 78, type: !248, isLocal: true, isDefinition: true)
!764 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !764, line: 79, type: !221, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !764, line: 80, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 13)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !764, line: 81, type: !769, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !764, line: 82, type: !198, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !764, line: 83, type: !226, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !764, line: 84, type: !248, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !764, line: 85, type: !19, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !764, line: 86, type: !19, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !764, line: 87, type: !248, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !788, file: !764, line: 76, type: !860, isLocal: false, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !789, retainedTypes: !795, globals: !796, splitDebugInlining: false, nameTableKind: None)
!789 = !{!411, !790, !67}
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !412, line: 254, baseType: !69, size: 32, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!793 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!794 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!795 = !{!63, !96, !97}
!796 = !{!762, !765, !767, !772, !774, !776, !778, !780, !782, !784, !786, !797, !801, !811, !813, !818, !820, !822, !824, !826, !849, !856, !858}
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !788, file: !764, line: 92, type: !799, isLocal: false, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 320, elements: !50)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !788, file: !764, line: 1040, type: !803, isLocal: false, isDefinition: true)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !764, line: 56, size: 448, elements: !804)
!804 = !{!805, !806, !807, !809, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !803, file: !764, line: 59, baseType: !411, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !764, line: 62, baseType: !63, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !803, file: !764, line: 66, baseType: !808, size: 256, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !249)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !803, file: !764, line: 69, baseType: !100, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !803, file: !764, line: 72, baseType: !100, size: 64, offset: 384)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !788, file: !764, line: 107, type: !803, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "slot0", scope: !788, file: !764, line: 831, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 256)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !764, line: 321, type: !226, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !764, line: 357, type: !226, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !764, line: 358, type: !226, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !764, line: 199, type: !19, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "quote", scope: !828, file: !764, line: 228, type: !847, isLocal: true, isDefinition: true)
!828 = distinct !DISubprogram(name: "gettext_quote", scope: !764, file: !764, line: 197, type: !829, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !788, retainedNodes: !831)
!829 = !DISubroutineType(types: !830)
!830 = !{!100, !100, !411}
!831 = !{!832, !833, !834, !835, !836}
!832 = !DILocalVariable(name: "msgid", arg: 1, scope: !828, file: !764, line: 197, type: !100)
!833 = !DILocalVariable(name: "s", arg: 2, scope: !828, file: !764, line: 197, type: !411)
!834 = !DILocalVariable(name: "translation", scope: !828, file: !764, line: 199, type: !100)
!835 = !DILocalVariable(name: "w", scope: !828, file: !764, line: 229, type: !365)
!836 = !DILocalVariable(name: "mbs", scope: !828, file: !764, line: 230, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !839, file: !752, line: 15, baseType: !63, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !839, file: !752, line: 20, baseType: !843, size: 32, offset: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !839, file: !752, line: 16, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !843, file: !752, line: 18, baseType: !69, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !843, file: !752, line: 19, baseType: !216, size: 32)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !848)
!848 = !{!228, !218}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "slotvec", scope: !788, file: !764, line: 834, type: !851, isLocal: true, isDefinition: true)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !764, line: 823, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !852, file: !764, line: 825, baseType: !97, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !852, file: !764, line: 826, baseType: !94, size: 64, offset: 64)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "nslots", scope: !788, file: !764, line: 832, type: !63, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "slotvec0", scope: !788, file: !764, line: 833, type: !852, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 704, elements: !448)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !864, line: 67, type: !316, isLocal: true, isDefinition: true)
!864 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !864, line: 69, type: !19, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !864, line: 83, type: !19, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !864, line: 83, type: !216, isLocal: true, isDefinition: true)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !864, line: 85, type: !226, isLocal: true, isDefinition: true)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(scope: null, file: !864, line: 88, type: !875, isLocal: true, isDefinition: true)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 171)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !864, line: 88, type: !880, isLocal: true, isDefinition: true)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !404)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !864, line: 105, type: !112, isLocal: true, isDefinition: true)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(scope: null, file: !864, line: 109, type: !398, isLocal: true, isDefinition: true)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !864, line: 113, type: !545, isLocal: true, isDefinition: true)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(scope: null, file: !864, line: 120, type: !889, isLocal: true, isDefinition: true)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 32)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !864, line: 127, type: !894, isLocal: true, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 36)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !864, line: 134, type: !270, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !864, line: 142, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 44)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !864, line: 150, type: !906, isLocal: true, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 48)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !864, line: 159, type: !911, isLocal: true, isDefinition: true)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 52)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !864, line: 170, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 60)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !864, line: 248, type: !198, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !864, line: 248, type: !292, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !864, line: 254, type: !198, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !864, line: 254, type: !107, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !864, line: 254, type: !270, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !864, line: 259, type: !3, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !864, line: 259, type: !933, isLocal: true, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 29)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !938, file: !939, line: 26, type: !941, isLocal: false, isDefinition: true)
!938 = distinct !DICompileUnit(language: DW_LANG_C11, file: !939, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !940, splitDebugInlining: false, nameTableKind: None)
!939 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!940 = !{!936}
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 376, elements: !534)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "exit_failure", scope: !944, file: !945, line: 24, type: !947, isLocal: false, isDefinition: true)
!944 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !946, splitDebugInlining: false, nameTableKind: None)
!945 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!946 = !{!942}
!947 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !235, isLocal: true, isDefinition: true)
!950 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !19, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !950, line: 34, type: !265, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !957, line: 108, type: !44, isLocal: true, isDefinition: true)
!957 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "internal_state", scope: !960, file: !957, line: 97, type: !963, isLocal: true, isDefinition: true)
!960 = distinct !DICompileUnit(language: DW_LANG_C11, file: !957, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !961, globals: !962, splitDebugInlining: false, nameTableKind: None)
!961 = !{!95, !97, !102}
!962 = !{!955, !958}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !750, line: 6, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !752, line: 21, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 13, size: 64, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !965, file: !752, line: 15, baseType: !63, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !965, file: !752, line: 20, baseType: !969, size: 32, offset: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !965, file: !752, line: 16, size: 32, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !969, file: !752, line: 18, baseType: !69, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !969, file: !752, line: 19, baseType: !216, size: 32)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !975, line: 35, type: !226, isLocal: true, isDefinition: true)
!975 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !975, line: 35, type: !221, isLocal: true, isDefinition: true)
!978 = distinct !DICompileUnit(language: DW_LANG_C11, file: !979, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !980, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!980 = !{!425}
!981 = distinct !DICompileUnit(language: DW_LANG_C11, file: !982, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!983 = distinct !DICompileUnit(language: DW_LANG_C11, file: !984, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!985 = !{!95}
!986 = distinct !DICompileUnit(language: DW_LANG_C11, file: !987, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!987 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!988 = distinct !DICompileUnit(language: DW_LANG_C11, file: !989, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!989 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!990 = distinct !DICompileUnit(language: DW_LANG_C11, file: !991, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!991 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!992 = distinct !DICompileUnit(language: DW_LANG_C11, file: !864, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !993, retainedTypes: !985, globals: !997, splitDebugInlining: false, nameTableKind: None)
!993 = !{!994}
!994 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !864, line: 40, baseType: !69, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!997 = !{!862, !865, !867, !869, !871, !873, !878, !881, !883, !885, !887, !892, !897, !899, !904, !909, !914, !919, !921, !923, !925, !927, !929, !931}
!998 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1000, retainedTypes: !1028, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1000 = !{!1001, !1013}
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1002, file: !999, line: 188, baseType: !69, size: 32, elements: !1011)
!1002 = distinct !DISubprogram(name: "x2nrealloc", scope: !999, file: !999, line: 176, type: !1003, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !998, retainedNodes: !1006)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!95, !95, !1005, !97}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DILocalVariable(name: "p", arg: 1, scope: !1002, file: !999, line: 176, type: !95)
!1008 = !DILocalVariable(name: "pn", arg: 2, scope: !1002, file: !999, line: 176, type: !1005)
!1009 = !DILocalVariable(name: "s", arg: 3, scope: !1002, file: !999, line: 176, type: !97)
!1010 = !DILocalVariable(name: "n", scope: !1002, file: !999, line: 178, type: !97)
!1011 = !{!1012}
!1012 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1014, file: !999, line: 228, baseType: !69, size: 32, elements: !1011)
!1014 = distinct !DISubprogram(name: "xpalloc", scope: !999, file: !999, line: 223, type: !1015, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !998, retainedNodes: !1018)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!95, !95, !1017, !354, !356, !354}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1019 = !DILocalVariable(name: "pa", arg: 1, scope: !1014, file: !999, line: 223, type: !95)
!1020 = !DILocalVariable(name: "pn", arg: 2, scope: !1014, file: !999, line: 223, type: !1017)
!1021 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1014, file: !999, line: 223, type: !354)
!1022 = !DILocalVariable(name: "n_max", arg: 4, scope: !1014, file: !999, line: 223, type: !356)
!1023 = !DILocalVariable(name: "s", arg: 5, scope: !1014, file: !999, line: 223, type: !354)
!1024 = !DILocalVariable(name: "n0", scope: !1014, file: !999, line: 230, type: !354)
!1025 = !DILocalVariable(name: "n", scope: !1014, file: !999, line: 237, type: !354)
!1026 = !DILocalVariable(name: "nbytes", scope: !1014, file: !999, line: 248, type: !354)
!1027 = !DILocalVariable(name: "adjusted_nbytes", scope: !1014, file: !999, line: 252, type: !354)
!1028 = !{!94, !95, !103, !177, !99}
!1029 = distinct !DICompileUnit(language: DW_LANG_C11, file: !950, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!1030 = !{!948, !951, !953}
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1032, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1035 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1037, splitDebugInlining: false, nameTableKind: None)
!1036 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1037 = !{!103, !99, !95}
!1038 = distinct !DICompileUnit(language: DW_LANG_C11, file: !975, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1039, splitDebugInlining: false, nameTableKind: None)
!1039 = !{!973, !976}
!1040 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1042 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1043, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !985, splitDebugInlining: false, nameTableKind: None)
!1043 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1044 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1045 = !{i32 7, !"Dwarf Version", i32 5}
!1046 = !{i32 2, !"Debug Info Version", i32 3}
!1047 = !{i32 1, !"wchar_size", i32 4}
!1048 = !{i32 8, !"PIC Level", i32 2}
!1049 = !{i32 7, !"PIE Level", i32 2}
!1050 = !{i32 7, !"uwtable", i32 2}
!1051 = !{i32 7, !"frame-pointer", i32 1}
!1052 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 64, type: !1053, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !63}
!1055 = !{!1056}
!1056 = !DILocalVariable(name: "status", arg: 1, scope: !1052, file: !2, line: 64, type: !63)
!1057 = !DILocation(line: 0, scope: !1052)
!1058 = !DILocation(line: 66, column: 14, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 66, column: 7)
!1060 = !DILocation(line: 66, column: 7, scope: !1052)
!1061 = !DILocation(line: 67, column: 5, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 67, column: 5)
!1063 = !{!1064, !1064, i64 0}
!1064 = !{!"any pointer", !1065, i64 0}
!1065 = !{!"omnipotent char", !1066, i64 0}
!1066 = !{!"Simple C/C++ TBAA"}
!1067 = !DILocation(line: 70, column: 7, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 69, column: 5)
!1069 = !DILocation(line: 74, column: 7, scope: !1068)
!1070 = !DILocation(line: 729, column: 3, scope: !1071, inlinedAt: !1073)
!1071 = distinct !DISubprogram(name: "emit_stdin_note", scope: !62, file: !62, line: 727, type: !342, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1072)
!1072 = !{}
!1073 = distinct !DILocation(line: 78, column: 7, scope: !1068)
!1074 = !DILocation(line: 736, column: 3, scope: !1075, inlinedAt: !1076)
!1075 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !62, file: !62, line: 734, type: !342, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1072)
!1076 = distinct !DILocation(line: 79, column: 7, scope: !1068)
!1077 = !DILocation(line: 81, column: 7, scope: !1068)
!1078 = !DILocation(line: 85, column: 7, scope: !1068)
!1079 = !DILocation(line: 89, column: 7, scope: !1068)
!1080 = !DILocation(line: 90, column: 7, scope: !1068)
!1081 = !DILocation(line: 91, column: 7, scope: !1068)
!1082 = !DILocalVariable(name: "program", arg: 1, scope: !1083, file: !62, line: 836, type: !100)
!1083 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !62, file: !62, line: 836, type: !1084, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1086)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !100}
!1086 = !{!1082, !1087, !1094, !1095, !1097, !1098}
!1087 = !DILocalVariable(name: "infomap", scope: !1083, file: !62, line: 838, type: !1088)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 896, elements: !20)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1083, file: !62, line: 838, size: 128, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1090, file: !62, line: 838, baseType: !100, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1090, file: !62, line: 838, baseType: !100, size: 64, offset: 64)
!1094 = !DILocalVariable(name: "node", scope: !1083, file: !62, line: 848, type: !100)
!1095 = !DILocalVariable(name: "map_prog", scope: !1083, file: !62, line: 849, type: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1097 = !DILocalVariable(name: "lc_messages", scope: !1083, file: !62, line: 861, type: !100)
!1098 = !DILocalVariable(name: "url_program", scope: !1083, file: !62, line: 874, type: !100)
!1099 = !DILocation(line: 0, scope: !1083, inlinedAt: !1100)
!1100 = distinct !DILocation(line: 92, column: 7, scope: !1068)
!1101 = !DILocation(line: 857, column: 3, scope: !1083, inlinedAt: !1100)
!1102 = !DILocation(line: 861, column: 29, scope: !1083, inlinedAt: !1100)
!1103 = !DILocation(line: 862, column: 7, scope: !1104, inlinedAt: !1100)
!1104 = distinct !DILexicalBlock(scope: !1083, file: !62, line: 862, column: 7)
!1105 = !DILocation(line: 862, column: 19, scope: !1104, inlinedAt: !1100)
!1106 = !DILocation(line: 862, column: 22, scope: !1104, inlinedAt: !1100)
!1107 = !DILocation(line: 862, column: 7, scope: !1083, inlinedAt: !1100)
!1108 = !DILocation(line: 868, column: 7, scope: !1109, inlinedAt: !1100)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !62, line: 863, column: 5)
!1110 = !DILocation(line: 870, column: 5, scope: !1109, inlinedAt: !1100)
!1111 = !DILocation(line: 875, column: 3, scope: !1083, inlinedAt: !1100)
!1112 = !DILocation(line: 877, column: 3, scope: !1083, inlinedAt: !1100)
!1113 = !DILocation(line: 94, column: 3, scope: !1052)
!1114 = !DISubprogram(name: "dcgettext", scope: !1115, file: !1115, line: 51, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1072)
!1115 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!94, !100, !100, !63}
!1118 = !DISubprogram(name: "__fprintf_chk", scope: !1119, file: !1119, line: 93, type: !1120, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1072)
!1119 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!63, !1122, !63, !1123, null}
!1122 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !149)
!1123 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!1124 = !DISubprogram(name: "__printf_chk", scope: !1119, file: !1119, line: 95, type: !1125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1072)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!63, !63, !1123, null}
!1127 = !DISubprogram(name: "fputs_unlocked", scope: !687, file: !687, line: 691, type: !1128, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1072)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!63, !1123, !1122}
!1130 = !DILocation(line: 0, scope: !127)
!1131 = !DILocation(line: 581, column: 7, scope: !135)
!1132 = !{!1133, !1133, i64 0}
!1133 = !{!"int", !1065, i64 0}
!1134 = !DILocation(line: 581, column: 19, scope: !135)
!1135 = !DILocation(line: 581, column: 7, scope: !127)
!1136 = !DILocation(line: 585, column: 26, scope: !134)
!1137 = !DILocation(line: 0, scope: !134)
!1138 = !DILocation(line: 586, column: 23, scope: !134)
