; ModuleID = 'src/false.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [61 x i8] c"Usage: %s [ignored command line arguments]\0A  or:  %s OPTION\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"%s\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [44 x i8] c"Exit with a status code indicating failure.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!163 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !72, line: 676, type: !3, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !72, line: 679, type: !128, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !72, line: 683, type: !9, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !72, line: 688, type: !9, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !72, line: 691, type: !141, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !72, line: 839, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 16)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(scope: null, file: !72, line: 840, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 22)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !72, line: 841, type: !164, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !72, line: 862, type: !112, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !72, line: 868, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 71)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !72, line: 875, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 27)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 51)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !72, line: 877, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 12)
!211 = !{!212, !213, !214, !217, !219, !220, !221, !225, !226, !227, !228, !230, !283, !284, !285, !287, !288}
!212 = !DILocalVariable(name: "program", arg: 1, scope: !71, file: !72, line: 573, type: !75)
!213 = !DILocalVariable(name: "option", arg: 2, scope: !71, file: !72, line: 573, type: !75)
!214 = !DILocalVariable(name: "term", scope: !215, file: !72, line: 585, type: !75)
!215 = distinct !DILexicalBlock(scope: !216, file: !72, line: 582, column: 5)
!216 = distinct !DILexicalBlock(scope: !71, file: !72, line: 581, column: 7)
!217 = !DILocalVariable(name: "double_space", scope: !71, file: !72, line: 594, type: !218)
!218 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!219 = !DILocalVariable(name: "first_word", scope: !71, file: !72, line: 595, type: !75)
!220 = !DILocalVariable(name: "option_text", scope: !71, file: !72, line: 596, type: !75)
!221 = !DILocalVariable(name: "s", scope: !222, file: !72, line: 608, type: !75)
!222 = distinct !DILexicalBlock(scope: !223, file: !72, line: 605, column: 5)
!223 = distinct !DILexicalBlock(scope: !224, file: !72, line: 604, column: 12)
!224 = distinct !DILexicalBlock(scope: !71, file: !72, line: 597, column: 7)
!225 = !DILocalVariable(name: "spaces", scope: !222, file: !72, line: 609, type: !101)
!226 = !DILocalVariable(name: "anchor_len", scope: !71, file: !72, line: 620, type: !101)
!227 = !DILocalVariable(name: "desc_text", scope: !71, file: !72, line: 625, type: !75)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !72, line: 644, type: !75)
!229 = distinct !DILexicalBlock(scope: !71, file: !72, line: 644, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !72, line: 644, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !236)
!235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !252, !254, !255, !256, !260, !261, !263, !264, !267, !269, !272, !275, !276, !277, !278, !279}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !234, file: !235, line: 51, baseType: !99, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !234, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !234, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !234, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !234, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !234, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !234, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !234, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !234, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !234, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !234, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !234, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !234, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !235, line: 36, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !234, file: !235, line: 70, baseType: !253, size: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !234, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !234, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !234, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !258, line: 152, baseType: !259)
!258 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!259 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !234, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !234, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !234, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !234, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !235, line: 43, baseType: null)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !234, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !258, line: 153, baseType: !259)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !234, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !235, line: 37, flags: DIFlagFwdDecl)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !234, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !235, line: 38, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !234, file: !235, line: 93, baseType: !253, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !234, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !234, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !234, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !234, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DILocalVariable(name: "__cnt", scope: !229, file: !72, line: 644, type: !101)
!284 = !DILocalVariable(name: "url_program", scope: !71, file: !72, line: 648, type: !75)
!285 = !DILocalVariable(name: "__ptr", scope: !286, file: !72, line: 686, type: !75)
!286 = distinct !DILexicalBlock(scope: !71, file: !72, line: 686, column: 3)
!287 = !DILocalVariable(name: "__stream", scope: !286, file: !72, line: 686, type: !231)
!288 = !DILocalVariable(name: "__cnt", scope: !286, file: !72, line: 686, type: !101)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !291, line: 3, type: !164, isLocal: true, isDefinition: true)
!291 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "Version", scope: !294, file: !291, line: 3, type: !75, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C11, file: !291, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !295, splitDebugInlining: false, nameTableKind: None)
!295 = !{!289, !292}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "file_name", scope: !298, file: !299, line: 45, type: !75, isLocal: true, isDefinition: true)
!298 = distinct !DICompileUnit(language: DW_LANG_C11, file: !299, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !300, splitDebugInlining: false, nameTableKind: None)
!299 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!300 = !{!301, !303, !305, !307, !296, !309}
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !54, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !299, line: 121, type: !208, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !299, line: 123, type: !54, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !299, line: 126, type: !128, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !298, file: !299, line: 55, type: !218, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !313, file: !314, line: 66, type: !365, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C11, file: !314, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !315, globals: !316, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!315 = !{!98, !104}
!316 = !{!317, !319, !344, !346, !348, !350, !311, !352, !354, !356, !358, !363}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !314, line: 272, type: !9, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "old_file_name", scope: !321, file: !314, line: 304, type: !75, isLocal: true, isDefinition: true)
!321 = distinct !DISubprogram(name: "verror_at_line", scope: !314, file: !314, line: 298, type: !322, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !337)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !99, !99, !75, !82, !75, !324}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !325, line: 52, baseType: !326)
!325 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !327, line: 14, baseType: !328)
!327 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !329, baseType: !330)
!329 = !DIFile(filename: "lib/error.c", directory: "/src")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !331)
!331 = !{!332, !333, !334, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !330, file: !329, baseType: !98, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !330, file: !329, baseType: !98, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !330, file: !329, baseType: !98, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !330, file: !329, baseType: !99, size: 32, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !330, file: !329, baseType: !99, size: 32, offset: 224)
!337 = !{!338, !339, !340, !341, !342, !343}
!338 = !DILocalVariable(name: "status", arg: 1, scope: !321, file: !314, line: 298, type: !99)
!339 = !DILocalVariable(name: "errnum", arg: 2, scope: !321, file: !314, line: 298, type: !99)
!340 = !DILocalVariable(name: "file_name", arg: 3, scope: !321, file: !314, line: 298, type: !75)
!341 = !DILocalVariable(name: "line_number", arg: 4, scope: !321, file: !314, line: 298, type: !82)
!342 = !DILocalVariable(name: "message", arg: 5, scope: !321, file: !314, line: 298, type: !75)
!343 = !DILocalVariable(name: "args", arg: 6, scope: !321, file: !314, line: 298, type: !324)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "old_line_number", scope: !321, file: !314, line: 305, type: !82, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !314, line: 338, type: !112, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !141, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !314, line: 346, type: !119, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "error_message_count", scope: !313, file: !314, line: 69, type: !82, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !313, file: !314, line: 295, type: !99, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !54, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !314, line: 208, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 21)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !314, line: 214, type: !9, isLocal: true, isDefinition: true)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{null}
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "program_name", scope: !370, file: !371, line: 31, type: !75, isLocal: false, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C11, file: !371, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !372, globals: !373, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!372 = !{!97}
!373 = !{!368, !374, !376}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !371, line: 46, type: !141, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !371, line: 49, type: !112, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "utf07FF", scope: !380, file: !381, line: 46, type: !408, isLocal: true, isDefinition: true)
!380 = distinct !DISubprogram(name: "proper_name_lite", scope: !381, file: !381, line: 38, type: !382, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !386)
!381 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!382 = !DISubroutineType(types: !383)
!383 = !{!75, !75, !75}
!384 = distinct !DICompileUnit(language: DW_LANG_C11, file: !381, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !385, splitDebugInlining: false, nameTableKind: None)
!385 = !{!378}
!386 = !{!387, !388, !389, !390, !395}
!387 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !380, file: !381, line: 38, type: !75)
!388 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !380, file: !381, line: 38, type: !75)
!389 = !DILocalVariable(name: "translation", scope: !380, file: !381, line: 40, type: !75)
!390 = !DILocalVariable(name: "w", scope: !380, file: !381, line: 47, type: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !392, line: 37, baseType: !393)
!392 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !258, line: 57, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !258, line: 42, baseType: !82)
!395 = !DILocalVariable(name: "mbs", scope: !380, file: !381, line: 48, type: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !397, line: 6, baseType: !398)
!397 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !399, line: 21, baseType: !400)
!399 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 13, size: 64, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !400, file: !399, line: 15, baseType: !99, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !400, file: !399, line: 20, baseType: !404, size: 32, offset: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !399, line: 16, size: 32, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !404, file: !399, line: 18, baseType: !82, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !404, file: !399, line: 19, baseType: !112, size: 32)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 16, elements: !120)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !411, line: 78, type: !141, isLocal: true, isDefinition: true)
!411 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !411, line: 79, type: !19, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !411, line: 80, type: !66, isLocal: true, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !411, line: 81, type: !66, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !411, line: 82, type: !280, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !411, line: 83, type: !119, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !411, line: 84, type: !141, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !411, line: 85, type: !54, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !411, line: 86, type: !54, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !411, line: 87, type: !141, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !432, file: !411, line: 76, type: !518, isLocal: false, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !433, retainedTypes: !453, globals: !454, splitDebugInlining: false, nameTableKind: None)
!433 = !{!434, !448, !80}
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !435, line: 42, baseType: !82, size: 32, elements: !436)
!435 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!437 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!438 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!439 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!440 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!441 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!442 = !DIEnumerator(name: "c_quoting_style", value: 5)
!443 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!444 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!445 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!446 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!447 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !435, line: 254, baseType: !82, size: 32, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!451 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!452 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!453 = !{!99, !100, !101}
!454 = !{!409, !412, !414, !416, !418, !420, !422, !424, !426, !428, !430, !455, !459, !469, !471, !476, !478, !480, !482, !484, !507, !514, !516}
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !432, file: !411, line: 92, type: !457, isLocal: false, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 320, elements: !45)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !432, file: !411, line: 1040, type: !461, isLocal: false, isDefinition: true)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !411, line: 56, size: 448, elements: !462)
!462 = !{!463, !464, !465, !467, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !461, file: !411, line: 59, baseType: !434, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !411, line: 62, baseType: !99, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !461, file: !411, line: 66, baseType: !466, size: 256, offset: 64)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !142)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !461, file: !411, line: 69, baseType: !75, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !461, file: !411, line: 72, baseType: !75, size: 64, offset: 384)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !432, file: !411, line: 107, type: !461, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "slot0", scope: !432, file: !411, line: 831, type: !473, isLocal: true, isDefinition: true)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 256)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !411, line: 321, type: !119, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !411, line: 357, type: !119, isLocal: true, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !411, line: 358, type: !119, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !411, line: 199, type: !54, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "quote", scope: !486, file: !411, line: 228, type: !505, isLocal: true, isDefinition: true)
!486 = distinct !DISubprogram(name: "gettext_quote", scope: !411, file: !411, line: 197, type: !487, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !432, retainedNodes: !489)
!487 = !DISubroutineType(types: !488)
!488 = !{!75, !75, !434}
!489 = !{!490, !491, !492, !493, !494}
!490 = !DILocalVariable(name: "msgid", arg: 1, scope: !486, file: !411, line: 197, type: !75)
!491 = !DILocalVariable(name: "s", arg: 2, scope: !486, file: !411, line: 197, type: !434)
!492 = !DILocalVariable(name: "translation", scope: !486, file: !411, line: 199, type: !75)
!493 = !DILocalVariable(name: "w", scope: !486, file: !411, line: 229, type: !391)
!494 = !DILocalVariable(name: "mbs", scope: !486, file: !411, line: 230, type: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !397, line: 6, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !399, line: 21, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 13, size: 64, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !497, file: !399, line: 15, baseType: !99, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !497, file: !399, line: 20, baseType: !501, size: 32, offset: 32)
!501 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !497, file: !399, line: 16, size: 32, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !501, file: !399, line: 18, baseType: !82, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !501, file: !399, line: 19, baseType: !112, size: 32)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !506)
!506 = !{!121, !114}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "slotvec", scope: !432, file: !411, line: 834, type: !509, isLocal: true, isDefinition: true)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !411, line: 823, size: 128, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !510, file: !411, line: 825, baseType: !101, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !510, file: !411, line: 826, baseType: !97, size: 64, offset: 64)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "nslots", scope: !432, file: !411, line: 832, type: !99, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "slotvec0", scope: !432, file: !411, line: 833, type: !510, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 704, elements: !520)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!520 = !{!521}
!521 = !DISubrange(count: 11)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !524, line: 67, type: !208, isLocal: true, isDefinition: true)
!524 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !524, line: 69, type: !54, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !524, line: 83, type: !54, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !524, line: 83, type: !112, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !524, line: 85, type: !119, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !524, line: 88, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 171)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !524, line: 88, type: !540, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 34)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !524, line: 105, type: !179, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !524, line: 109, type: !547, isLocal: true, isDefinition: true)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 23)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !524, line: 113, type: !552, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 28)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !524, line: 120, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 32)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !524, line: 127, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 36)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !524, line: 134, type: !159, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !524, line: 142, type: !14, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !524, line: 150, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 48)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !524, line: 159, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 52)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !524, line: 170, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 60)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !524, line: 248, type: !280, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !524, line: 248, type: !184, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !524, line: 254, type: !280, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !524, line: 254, type: !61, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !524, line: 254, type: !159, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !524, line: 259, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 39)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !524, line: 259, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 29)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !606, file: !607, line: 26, type: !609, isLocal: false, isDefinition: true)
!606 = distinct !DICompileUnit(language: DW_LANG_C11, file: !607, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !608, splitDebugInlining: false, nameTableKind: None)
!607 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!608 = !{!604}
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 376, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 47)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "exit_failure", scope: !614, file: !615, line: 24, type: !617, isLocal: false, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C11, file: !615, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !616, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!616 = !{!612}
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !99)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !620, line: 34, type: !128, isLocal: true, isDefinition: true)
!620 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !620, line: 34, type: !54, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !620, line: 34, type: !154, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !627, line: 108, type: !39, isLocal: true, isDefinition: true)
!627 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "internal_state", scope: !630, file: !627, line: 97, type: !633, isLocal: true, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C11, file: !627, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !631, globals: !632, splitDebugInlining: false, nameTableKind: None)
!631 = !{!98, !101, !104}
!632 = !{!625, !628}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !397, line: 6, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !399, line: 21, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 13, size: 64, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !635, file: !399, line: 15, baseType: !99, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !635, file: !399, line: 20, baseType: !639, size: 32, offset: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !635, file: !399, line: 16, size: 32, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !639, file: !399, line: 18, baseType: !82, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !639, file: !399, line: 19, baseType: !112, size: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !645, line: 35, type: !119, isLocal: true, isDefinition: true)
!645 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !645, line: 35, type: !19, isLocal: true, isDefinition: true)
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!649 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !524, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !655, globals: !656, splitDebugInlining: false, nameTableKind: None)
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !524, line: 40, baseType: !82, size: 32, elements: !653)
!653 = !{!654}
!654 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!655 = !{!98}
!656 = !{!522, !525, !527, !529, !531, !533, !538, !543, !545, !550, !555, !560, !565, !567, !569, !574, !579, !584, !586, !588, !590, !592, !594, !599}
!657 = distinct !DICompileUnit(language: DW_LANG_C11, file: !658, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, retainedTypes: !690, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!659 = !{!660, !672}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !661, file: !658, line: 188, baseType: !82, size: 32, elements: !670)
!661 = distinct !DISubprogram(name: "x2nrealloc", scope: !658, file: !658, line: 176, type: !662, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !657, retainedNodes: !665)
!662 = !DISubroutineType(types: !663)
!663 = !{!98, !98, !664, !101}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!665 = !{!666, !667, !668, !669}
!666 = !DILocalVariable(name: "p", arg: 1, scope: !661, file: !658, line: 176, type: !98)
!667 = !DILocalVariable(name: "pn", arg: 2, scope: !661, file: !658, line: 176, type: !664)
!668 = !DILocalVariable(name: "s", arg: 3, scope: !661, file: !658, line: 176, type: !101)
!669 = !DILocalVariable(name: "n", scope: !661, file: !658, line: 178, type: !101)
!670 = !{!671}
!671 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !673, file: !658, line: 228, baseType: !82, size: 32, elements: !670)
!673 = distinct !DISubprogram(name: "xpalloc", scope: !658, file: !658, line: 223, type: !674, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !657, retainedNodes: !680)
!674 = !DISubroutineType(types: !675)
!675 = !{!98, !98, !676, !677, !679, !677}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !678, line: 130, baseType: !679)
!678 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !102, line: 35, baseType: !259)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689}
!681 = !DILocalVariable(name: "pa", arg: 1, scope: !673, file: !658, line: 223, type: !98)
!682 = !DILocalVariable(name: "pn", arg: 2, scope: !673, file: !658, line: 223, type: !676)
!683 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !673, file: !658, line: 223, type: !677)
!684 = !DILocalVariable(name: "n_max", arg: 4, scope: !673, file: !658, line: 223, type: !679)
!685 = !DILocalVariable(name: "s", arg: 5, scope: !673, file: !658, line: 223, type: !677)
!686 = !DILocalVariable(name: "n0", scope: !673, file: !658, line: 230, type: !677)
!687 = !DILocalVariable(name: "n", scope: !673, file: !658, line: 237, type: !677)
!688 = !DILocalVariable(name: "nbytes", scope: !673, file: !658, line: 248, type: !677)
!689 = !DILocalVariable(name: "adjusted_nbytes", scope: !673, file: !658, line: 252, type: !677)
!690 = !{!97, !98, !218, !259, !103}
!691 = distinct !DICompileUnit(language: DW_LANG_C11, file: !620, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !692, splitDebugInlining: false, nameTableKind: None)
!692 = !{!618, !621, !623}
!693 = distinct !DICompileUnit(language: DW_LANG_C11, file: !694, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!694 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!695 = distinct !DICompileUnit(language: DW_LANG_C11, file: !696, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!697 = distinct !DICompileUnit(language: DW_LANG_C11, file: !698, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !655, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!699 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !655, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!701 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !703, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!703 = !{!218, !103, !98}
!704 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !705, splitDebugInlining: false, nameTableKind: None)
!705 = !{!643, !646}
!706 = distinct !DICompileUnit(language: DW_LANG_C11, file: !707, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!707 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !655, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!710 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!711 = !{i32 7, !"Dwarf Version", i32 5}
!712 = !{i32 2, !"Debug Info Version", i32 3}
!713 = !{i32 1, !"wchar_size", i32 4}
!714 = !{i32 8, !"PIC Level", i32 2}
!715 = !{i32 7, !"PIE Level", i32 2}
!716 = !{i32 7, !"uwtable", i32 2}
!717 = !{i32 7, !"frame-pointer", i32 1}
!718 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 36, type: !719, scopeLine: 37, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !721)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !99}
!721 = !{!722}
!722 = !DILocalVariable(name: "status", arg: 1, scope: !718, file: !2, line: 36, type: !99)
!723 = !DILocation(line: 0, scope: !718)
!724 = !DILocation(line: 38, column: 3, scope: !718)
!725 = !{!726, !726, i64 0}
!726 = !{!"any pointer", !727, i64 0}
!727 = !{!"omnipotent char", !728, i64 0}
!728 = !{!"Simple C/C++ TBAA"}
!729 = !DILocation(line: 43, column: 3, scope: !718)
!730 = !DILocation(line: 47, column: 3, scope: !718)
!731 = !DILocation(line: 48, column: 3, scope: !718)
!732 = !DILocation(line: 49, column: 3, scope: !718)
!733 = !DILocation(line: 50, column: 3, scope: !718)
!734 = !DILocation(line: 51, column: 3, scope: !718)
!735 = !DISubprogram(name: "dcgettext", scope: !736, file: !736, line: 51, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!736 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!737 = !DISubroutineType(types: !738)
!738 = !{!97, !75, !75, !99}
!739 = !{}
!740 = !DISubprogram(name: "__printf_chk", scope: !741, file: !741, line: 95, type: !742, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!741 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!742 = !DISubroutineType(types: !743)
!743 = !{!99, !99, !744, null}
!744 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !75)
!745 = !DILocation(line: 0, scope: !71)
!746 = !DILocation(line: 581, column: 7, scope: !216)
!747 = !{!748, !748, i64 0}
!748 = !{!"int", !727, i64 0}
!749 = !DILocation(line: 581, column: 19, scope: !216)
!750 = !DILocation(line: 581, column: 7, scope: !71)
!751 = !DILocation(line: 585, column: 26, scope: !215)
!752 = !DILocation(line: 0, scope: !215)
!753 = !DILocation(line: 586, column: 23, scope: !215)
!754 = !DILocation(line: 586, column: 28, scope: !215)
!755 = !DILocation(line: 586, column: 32, scope: !215)
!756 = !{!727, !727, i64 0}
!757 = !DILocation(line: 586, column: 38, scope: !215)
!758 = !DILocalVariable(name: "__s1", arg: 1, scope: !759, file: !760, line: 1359, type: !75)
!759 = distinct !DISubprogram(name: "streq", scope: !760, file: !760, line: 1359, type: !761, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !763)
!760 = !DIFile(filename: "./lib/string.h", directory: "/src")
!761 = !DISubroutineType(types: !762)
!762 = !{!218, !75, !75}
!763 = !{!758, !764}
!764 = !DILocalVariable(name: "__s2", arg: 2, scope: !759, file: !760, line: 1359, type: !75)
!765 = !DILocation(line: 0, scope: !759, inlinedAt: !766)
!766 = distinct !DILocation(line: 586, column: 41, scope: !215)
!767 = !DILocation(line: 1361, column: 11, scope: !759, inlinedAt: !766)
!768 = !DILocation(line: 1361, column: 10, scope: !759, inlinedAt: !766)
!769 = !DILocation(line: 586, column: 19, scope: !215)
!770 = !DILocation(line: 587, column: 5, scope: !215)
!771 = !DILocation(line: 588, column: 7, scope: !772)
!772 = distinct !DILexicalBlock(scope: !71, file: !72, line: 588, column: 7)
!773 = !DILocation(line: 588, column: 7, scope: !71)
!774 = !DILocation(line: 590, column: 7, scope: !775)
!775 = distinct !DILexicalBlock(scope: !772, file: !72, line: 589, column: 5)
!776 = !DILocation(line: 591, column: 7, scope: !775)
!777 = !DILocation(line: 595, column: 37, scope: !71)
!778 = !DILocation(line: 595, column: 35, scope: !71)
!779 = !DILocation(line: 596, column: 29, scope: !71)
!780 = !DILocation(line: 597, column: 8, scope: !224)
!781 = !DILocation(line: 597, column: 7, scope: !71)
!782 = !DILocation(line: 604, column: 24, scope: !223)
!783 = !DILocation(line: 604, column: 12, scope: !224)
!784 = !DILocation(line: 0, scope: !222)
!785 = !DILocation(line: 610, column: 16, scope: !222)
!786 = !DILocation(line: 610, column: 7, scope: !222)
!787 = !DILocation(line: 611, column: 21, scope: !222)
!788 = !{!789, !789, i64 0}
!789 = !{!"short", !727, i64 0}
!790 = !DILocation(line: 611, column: 19, scope: !222)
!791 = !DILocation(line: 611, column: 16, scope: !222)
!792 = !DILocation(line: 610, column: 30, scope: !222)
!793 = distinct !{!793, !786, !787, !794}
!794 = !{!"llvm.loop.mustprogress"}
!795 = !DILocation(line: 612, column: 18, scope: !796)
!796 = distinct !DILexicalBlock(scope: !222, file: !72, line: 612, column: 11)
!797 = !DILocation(line: 612, column: 11, scope: !222)
!798 = !DILocation(line: 620, column: 23, scope: !71)
!799 = !DILocation(line: 625, column: 39, scope: !71)
!800 = !DILocation(line: 626, column: 3, scope: !71)
!801 = !DILocation(line: 626, column: 10, scope: !71)
!802 = !DILocation(line: 626, column: 21, scope: !71)
!803 = !DILocation(line: 628, column: 44, scope: !804)
!804 = distinct !DILexicalBlock(scope: !805, file: !72, line: 628, column: 11)
!805 = distinct !DILexicalBlock(scope: !71, file: !72, line: 627, column: 5)
!806 = !DILocation(line: 628, column: 32, scope: !804)
!807 = !DILocation(line: 628, column: 49, scope: !804)
!808 = !DILocation(line: 628, column: 11, scope: !805)
!809 = !DILocation(line: 630, column: 11, scope: !810)
!810 = distinct !DILexicalBlock(scope: !805, file: !72, line: 630, column: 11)
!811 = !DILocation(line: 630, column: 11, scope: !805)
!812 = !DILocation(line: 632, column: 26, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !72, line: 632, column: 15)
!814 = distinct !DILexicalBlock(scope: !810, file: !72, line: 631, column: 9)
!815 = !DILocation(line: 632, column: 34, scope: !813)
!816 = !DILocation(line: 632, column: 37, scope: !813)
!817 = !DILocation(line: 632, column: 15, scope: !814)
!818 = !DILocation(line: 640, column: 16, scope: !805)
!819 = distinct !{!819, !800, !820, !794}
!820 = !DILocation(line: 641, column: 5, scope: !71)
!821 = !DILocation(line: 644, column: 3, scope: !71)
!822 = !DILocation(line: 0, scope: !759, inlinedAt: !823)
!823 = distinct !DILocation(line: 648, column: 31, scope: !71)
!824 = !DILocation(line: 0, scope: !759, inlinedAt: !825)
!825 = distinct !DILocation(line: 649, column: 31, scope: !71)
!826 = !DILocation(line: 0, scope: !759, inlinedAt: !827)
!827 = distinct !DILocation(line: 650, column: 31, scope: !71)
!828 = !DILocation(line: 0, scope: !759, inlinedAt: !829)
!829 = distinct !DILocation(line: 651, column: 31, scope: !71)
!830 = !DILocation(line: 0, scope: !759, inlinedAt: !831)
!831 = distinct !DILocation(line: 652, column: 31, scope: !71)
!832 = !DILocation(line: 0, scope: !759, inlinedAt: !833)
!833 = distinct !DILocation(line: 653, column: 31, scope: !71)
!834 = !DILocation(line: 0, scope: !759, inlinedAt: !835)
!835 = distinct !DILocation(line: 654, column: 31, scope: !71)
!836 = !DILocation(line: 0, scope: !759, inlinedAt: !837)
!837 = distinct !DILocation(line: 655, column: 31, scope: !71)
!838 = !DILocation(line: 0, scope: !759, inlinedAt: !839)
!839 = distinct !DILocation(line: 656, column: 31, scope: !71)
!840 = !DILocation(line: 0, scope: !759, inlinedAt: !841)
!841 = distinct !DILocation(line: 657, column: 31, scope: !71)
!842 = !DILocation(line: 663, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !71, file: !72, line: 663, column: 7)
!844 = !DILocation(line: 664, column: 7, scope: !843)
!845 = !DILocation(line: 664, column: 10, scope: !843)
!846 = !DILocation(line: 663, column: 7, scope: !71)
!847 = !DILocation(line: 669, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !843, file: !72, line: 665, column: 5)
!849 = !DILocation(line: 671, column: 5, scope: !848)
!850 = !DILocation(line: 676, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !843, file: !72, line: 673, column: 5)
!852 = !DILocation(line: 679, column: 3, scope: !71)
!853 = !DILocation(line: 683, column: 3, scope: !71)
!854 = !DILocation(line: 686, column: 3, scope: !71)
!855 = !DILocation(line: 688, column: 3, scope: !71)
!856 = !DILocation(line: 691, column: 3, scope: !71)
!857 = !DILocation(line: 695, column: 3, scope: !71)
!858 = !DILocation(line: 696, column: 1, scope: !71)
!859 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !72, file: !72, line: 836, type: !860, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !862)
!860 = !DISubroutineType(cc: DW_CC_nocall, types: !861)
!861 = !{null, !75}
!862 = !{!863, !864, !871, !872, !874, !875}
!863 = !DILocalVariable(name: "program", arg: 1, scope: !859, file: !72, line: 836, type: !75)
!864 = !DILocalVariable(name: "infomap", scope: !859, file: !72, line: 838, type: !865)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 896, elements: !55)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !859, file: !72, line: 838, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !867, file: !72, line: 838, baseType: !75, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !867, file: !72, line: 838, baseType: !75, size: 64, offset: 64)
!871 = !DILocalVariable(name: "node", scope: !859, file: !72, line: 848, type: !75)
!872 = !DILocalVariable(name: "map_prog", scope: !859, file: !72, line: 849, type: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!874 = !DILocalVariable(name: "lc_messages", scope: !859, file: !72, line: 861, type: !75)
!875 = !DILocalVariable(name: "url_program", scope: !859, file: !72, line: 874, type: !75)
!876 = !DILocation(line: 0, scope: !859)
!877 = !DILocation(line: 857, column: 3, scope: !859)
!878 = !DILocation(line: 861, column: 29, scope: !859)
!879 = !DILocation(line: 862, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !859, file: !72, line: 862, column: 7)
!881 = !DILocation(line: 862, column: 19, scope: !880)
!882 = !DILocation(line: 862, column: 22, scope: !880)
!883 = !DILocation(line: 862, column: 7, scope: !859)
!884 = !DILocation(line: 868, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !72, line: 863, column: 5)
!886 = !DILocation(line: 870, column: 5, scope: !885)
!887 = !DILocation(line: 875, column: 3, scope: !859)
!888 = !DILocation(line: 877, column: 3, scope: !859)
!889 = !DILocation(line: 879, column: 1, scope: !859)
!890 = !DISubprogram(name: "exit", scope: !891, file: !891, line: 624, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !739)
!891 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!892 = !DISubprogram(name: "setlocale", scope: !893, file: !893, line: 122, type: !894, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!893 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!894 = !DISubroutineType(types: !895)
!895 = !{!97, !99, !75}
!896 = !DISubprogram(name: "strncmp", scope: !897, file: !897, line: 159, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!897 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!898 = !DISubroutineType(types: !899)
!899 = !{!99, !75, !75, !101}
!900 = !DISubprogram(name: "fputs_unlocked", scope: !325, file: !325, line: 691, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!901 = !DISubroutineType(types: !902)
!902 = !{!99, !744, !903}
!903 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!904 = !DISubprogram(name: "getenv", scope: !891, file: !891, line: 641, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!905 = !DISubroutineType(types: !906)
!906 = !{!97, !75}
!907 = !DISubprogram(name: "strcmp", scope: !897, file: !897, line: 156, type: !908, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!908 = !DISubroutineType(types: !909)
!909 = !{!99, !75, !75}
!910 = !DISubprogram(name: "strspn", scope: !897, file: !897, line: 297, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!911 = !DISubroutineType(types: !912)
!912 = !{!103, !75, !75}
!913 = !DISubprogram(name: "strchr", scope: !897, file: !897, line: 246, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!914 = !DISubroutineType(types: !915)
!915 = !{!97, !75, !99}
!916 = !DISubprogram(name: "__ctype_b_loc", scope: !81, file: !81, line: 79, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!917 = !DISubroutineType(types: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!922 = !DISubprogram(name: "strcspn", scope: !897, file: !897, line: 293, type: !911, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!923 = !DISubprogram(name: "fwrite_unlocked", scope: !325, file: !325, line: 704, type: !924, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!924 = !DISubroutineType(types: !925)
!925 = !{!101, !926, !101, !101, !903}
!926 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!929 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 55, type: !930, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !77, retainedNodes: !933)
!930 = !DISubroutineType(types: !931)
!931 = !{!99, !99, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!933 = !{!934, !935}
!934 = !DILocalVariable(name: "argc", arg: 1, scope: !929, file: !2, line: 55, type: !99)
!935 = !DILocalVariable(name: "argv", arg: 2, scope: !929, file: !2, line: 55, type: !932)
!936 = !DILocation(line: 0, scope: !929)
!937 = !DILocation(line: 59, column: 12, scope: !938)
!938 = distinct !DILexicalBlock(scope: !929, file: !2, line: 59, column: 7)
!939 = !DILocation(line: 59, column: 7, scope: !929)
!940 = !DILocation(line: 62, column: 25, scope: !941)
!941 = distinct !DILexicalBlock(scope: !938, file: !2, line: 60, column: 5)
!942 = !DILocation(line: 62, column: 7, scope: !941)
!943 = !DILocation(line: 63, column: 7, scope: !941)
!944 = !DILocation(line: 64, column: 7, scope: !941)
!945 = !DILocation(line: 65, column: 7, scope: !941)
!946 = !DILocation(line: 69, column: 7, scope: !941)
!947 = !DILocation(line: 71, column: 18, scope: !948)
!948 = distinct !DILexicalBlock(scope: !941, file: !2, line: 71, column: 11)
!949 = !DILocation(line: 0, scope: !759, inlinedAt: !950)
!950 = distinct !DILocation(line: 71, column: 11, scope: !948)
!951 = !DILocation(line: 1361, column: 11, scope: !759, inlinedAt: !950)
!952 = !DILocation(line: 1361, column: 10, scope: !759, inlinedAt: !950)
!953 = !DILocation(line: 71, column: 11, scope: !941)
!954 = !DILocation(line: 72, column: 9, scope: !948)
!955 = !DILocation(line: 0, scope: !759, inlinedAt: !956)
!956 = distinct !DILocation(line: 74, column: 11, scope: !957)
!957 = distinct !DILexicalBlock(scope: !941, file: !2, line: 74, column: 11)
!958 = !DILocation(line: 1361, column: 11, scope: !759, inlinedAt: !956)
!959 = !DILocation(line: 1361, column: 10, scope: !759, inlinedAt: !956)
!960 = !DILocation(line: 74, column: 11, scope: !941)
!961 = !DILocation(line: 75, column: 22, scope: !957)
!962 = !DILocation(line: 75, column: 58, scope: !957)
!963 = !DILocation(line: 75, column: 67, scope: !957)
!964 = !DILocation(line: 75, column: 9, scope: !957)
!965 = !DILocation(line: 79, column: 3, scope: !929)
!966 = !DISubprogram(name: "bindtextdomain", scope: !736, file: !736, line: 86, type: !967, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!967 = !DISubroutineType(types: !968)
!968 = !{!97, !75, !75}
!969 = !DISubprogram(name: "textdomain", scope: !736, file: !736, line: 82, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!970 = !DISubprogram(name: "atexit", scope: !891, file: !891, line: 602, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!971 = !DISubroutineType(types: !972)
!972 = !{!99, !365}
!973 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !299, file: !299, line: 50, type: !974, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !975)
!974 = !DISubroutineType(types: !861)
!975 = !{!976}
!976 = !DILocalVariable(name: "file", arg: 1, scope: !973, file: !299, line: 50, type: !75)
!977 = !DILocation(line: 0, scope: !973)
!978 = !DILocation(line: 52, column: 13, scope: !973)
!979 = !DILocation(line: 53, column: 1, scope: !973)
!980 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !299, file: !299, line: 87, type: !981, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !983)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !218}
!983 = !{!984}
!984 = !DILocalVariable(name: "ignore", arg: 1, scope: !980, file: !299, line: 87, type: !218)
!985 = !DILocation(line: 0, scope: !980)
!986 = !DILocation(line: 89, column: 16, scope: !980)
!987 = !{!988, !988, i64 0}
!988 = !{!"_Bool", !727, i64 0}
!989 = !DILocation(line: 90, column: 1, scope: !980)
!990 = distinct !DISubprogram(name: "close_stdout", scope: !299, file: !299, line: 116, type: !366, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !298, retainedNodes: !991)
!991 = !{!992}
!992 = !DILocalVariable(name: "write_error", scope: !993, file: !299, line: 121, type: !75)
!993 = distinct !DILexicalBlock(scope: !994, file: !299, line: 120, column: 5)
!994 = distinct !DILexicalBlock(scope: !990, file: !299, line: 118, column: 7)
!995 = !DILocation(line: 118, column: 21, scope: !994)
!996 = !DILocation(line: 118, column: 7, scope: !994)
!997 = !DILocation(line: 118, column: 29, scope: !994)
!998 = !DILocation(line: 119, column: 7, scope: !994)
!999 = !DILocation(line: 119, column: 12, scope: !994)
!1000 = !{i8 0, i8 2}
!1001 = !DILocation(line: 119, column: 25, scope: !994)
!1002 = !DILocation(line: 119, column: 28, scope: !994)
!1003 = !DILocation(line: 119, column: 34, scope: !994)
!1004 = !DILocation(line: 118, column: 7, scope: !990)
!1005 = !DILocation(line: 121, column: 33, scope: !993)
!1006 = !DILocation(line: 0, scope: !993)
!1007 = !DILocation(line: 122, column: 11, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !993, file: !299, line: 122, column: 11)
!1009 = !DILocation(line: 0, scope: !1008)
!1010 = !DILocation(line: 122, column: 11, scope: !993)
!1011 = !DILocation(line: 123, column: 9, scope: !1008)
!1012 = !DILocation(line: 126, column: 9, scope: !1008)
!1013 = !DILocation(line: 128, column: 14, scope: !993)
!1014 = !DILocation(line: 128, column: 7, scope: !993)
!1015 = !DILocation(line: 133, column: 42, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !990, file: !299, line: 133, column: 7)
!1017 = !DILocation(line: 133, column: 28, scope: !1016)
!1018 = !DILocation(line: 133, column: 50, scope: !1016)
!1019 = !DILocation(line: 133, column: 7, scope: !990)
!1020 = !DILocation(line: 134, column: 12, scope: !1016)
!1021 = !DILocation(line: 134, column: 5, scope: !1016)
!1022 = !DILocation(line: 135, column: 1, scope: !990)
!1023 = !DISubprogram(name: "__errno_location", scope: !1024, file: !1024, line: 37, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1024 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!1028 = !DISubprogram(name: "_exit", scope: !1029, file: !1029, line: 624, type: !719, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1029 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1030 = distinct !DISubprogram(name: "verror", scope: !314, file: !314, line: 251, type: !1031, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !99, !99, !75, !324}
!1033 = !{!1034, !1035, !1036, !1037}
!1034 = !DILocalVariable(name: "status", arg: 1, scope: !1030, file: !314, line: 251, type: !99)
!1035 = !DILocalVariable(name: "errnum", arg: 2, scope: !1030, file: !314, line: 251, type: !99)
!1036 = !DILocalVariable(name: "message", arg: 3, scope: !1030, file: !314, line: 251, type: !75)
!1037 = !DILocalVariable(name: "args", arg: 4, scope: !1030, file: !314, line: 251, type: !324)
!1038 = !DILocation(line: 0, scope: !1030)
!1039 = !DILocation(line: 251, column: 1, scope: !1030)
!1040 = !DILocation(line: 261, column: 3, scope: !1030)
!1041 = !DILocation(line: 265, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1030, file: !314, line: 265, column: 7)
!1043 = !DILocation(line: 265, column: 7, scope: !1030)
!1044 = !DILocation(line: 266, column: 5, scope: !1042)
!1045 = !DILocation(line: 272, column: 7, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1042, file: !314, line: 268, column: 5)
!1047 = !DILocation(line: 276, column: 3, scope: !1030)
!1048 = !{i64 0, i64 8, !725, i64 8, i64 8, !725, i64 16, i64 8, !725, i64 24, i64 4, !747, i64 28, i64 4, !747}
!1049 = !DILocation(line: 282, column: 1, scope: !1030)
!1050 = distinct !DISubprogram(name: "flush_stdout", scope: !314, file: !314, line: 163, type: !366, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1051)
!1051 = !{!1052}
!1052 = !DILocalVariable(name: "stdout_fd", scope: !1050, file: !314, line: 166, type: !99)
!1053 = !DILocation(line: 0, scope: !1050)
!1054 = !DILocalVariable(name: "fd", arg: 1, scope: !1055, file: !314, line: 145, type: !99)
!1055 = distinct !DISubprogram(name: "is_open", scope: !314, file: !314, line: 145, type: !1056, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1058)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!99, !99}
!1058 = !{!1054}
!1059 = !DILocation(line: 0, scope: !1055, inlinedAt: !1060)
!1060 = distinct !DILocation(line: 182, column: 25, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1050, file: !314, line: 182, column: 7)
!1062 = !DILocation(line: 157, column: 15, scope: !1055, inlinedAt: !1060)
!1063 = !DILocation(line: 157, column: 12, scope: !1055, inlinedAt: !1060)
!1064 = !DILocation(line: 182, column: 7, scope: !1050)
!1065 = !DILocation(line: 184, column: 5, scope: !1061)
!1066 = !DILocation(line: 185, column: 1, scope: !1050)
!1067 = !DISubprogram(name: "__fprintf_chk", scope: !741, file: !741, line: 93, type: !1068, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!99, !1070, !99, !744, null}
!1070 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !233, line: 7, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !235, line: 49, size: 1728, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1073, file: !235, line: 51, baseType: !99, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1073, file: !235, line: 54, baseType: !97, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1073, file: !235, line: 55, baseType: !97, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1073, file: !235, line: 56, baseType: !97, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1073, file: !235, line: 57, baseType: !97, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1073, file: !235, line: 58, baseType: !97, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1073, file: !235, line: 59, baseType: !97, size: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1073, file: !235, line: 60, baseType: !97, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1073, file: !235, line: 61, baseType: !97, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1073, file: !235, line: 64, baseType: !97, size: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1073, file: !235, line: 65, baseType: !97, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1073, file: !235, line: 66, baseType: !97, size: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1073, file: !235, line: 68, baseType: !250, size: 64, offset: 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1073, file: !235, line: 70, baseType: !1089, size: 64, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1073, file: !235, line: 72, baseType: !99, size: 32, offset: 896)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1073, file: !235, line: 73, baseType: !99, size: 32, offset: 928)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1073, file: !235, line: 74, baseType: !257, size: 64, offset: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1073, file: !235, line: 77, baseType: !100, size: 16, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1073, file: !235, line: 78, baseType: !262, size: 8, offset: 1040)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1073, file: !235, line: 79, baseType: !39, size: 8, offset: 1048)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1073, file: !235, line: 81, baseType: !265, size: 64, offset: 1088)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1073, file: !235, line: 89, baseType: !268, size: 64, offset: 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1073, file: !235, line: 91, baseType: !270, size: 64, offset: 1216)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1073, file: !235, line: 92, baseType: !273, size: 64, offset: 1280)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1073, file: !235, line: 93, baseType: !1089, size: 64, offset: 1344)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1073, file: !235, line: 94, baseType: !98, size: 64, offset: 1408)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1073, file: !235, line: 95, baseType: !101, size: 64, offset: 1472)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1073, file: !235, line: 96, baseType: !99, size: 32, offset: 1536)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1073, file: !235, line: 98, baseType: !280, size: 160, offset: 1568)
!1105 = distinct !DISubprogram(name: "error_tail", scope: !314, file: !314, line: 219, type: !1031, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1106)
!1106 = !{!1107, !1108, !1109, !1110}
!1107 = !DILocalVariable(name: "status", arg: 1, scope: !1105, file: !314, line: 219, type: !99)
!1108 = !DILocalVariable(name: "errnum", arg: 2, scope: !1105, file: !314, line: 219, type: !99)
!1109 = !DILocalVariable(name: "message", arg: 3, scope: !1105, file: !314, line: 219, type: !75)
!1110 = !DILocalVariable(name: "args", arg: 4, scope: !1105, file: !314, line: 219, type: !324)
!1111 = !DILocation(line: 0, scope: !1105)
!1112 = !DILocation(line: 219, column: 1, scope: !1105)
!1113 = !DILocation(line: 229, column: 13, scope: !1105)
!1114 = !DILocation(line: 135, column: 10, scope: !1115, inlinedAt: !1122)
!1115 = distinct !DISubprogram(name: "vfprintf", scope: !741, file: !741, line: 132, type: !1116, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1118)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!99, !1070, !744, !326}
!1118 = !{!1119, !1120, !1121}
!1119 = !DILocalVariable(name: "__stream", arg: 1, scope: !1115, file: !741, line: 132, type: !1070)
!1120 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1115, file: !741, line: 133, type: !744)
!1121 = !DILocalVariable(name: "__ap", arg: 3, scope: !1115, file: !741, line: 133, type: !326)
!1122 = distinct !DILocation(line: 229, column: 3, scope: !1105)
!1123 = !{!1124, !1126}
!1124 = distinct !{!1124, !1125, !"vfprintf.inline: argument 0"}
!1125 = distinct !{!1125, !"vfprintf.inline"}
!1126 = distinct !{!1126, !1125, !"vfprintf.inline: argument 1"}
!1127 = !DILocation(line: 229, column: 3, scope: !1105)
!1128 = !DILocation(line: 0, scope: !1115, inlinedAt: !1122)
!1129 = !DILocation(line: 133, column: 49, scope: !1115, inlinedAt: !1122)
!1130 = !DILocation(line: 232, column: 3, scope: !1105)
!1131 = !DILocation(line: 233, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1105, file: !314, line: 233, column: 7)
!1133 = !DILocation(line: 233, column: 7, scope: !1105)
!1134 = !DILocalVariable(name: "errnum", arg: 1, scope: !1135, file: !314, line: 188, type: !99)
!1135 = distinct !DISubprogram(name: "print_errno_message", scope: !314, file: !314, line: 188, type: !719, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1136)
!1136 = !{!1134, !1137, !1138}
!1137 = !DILocalVariable(name: "s", scope: !1135, file: !314, line: 190, type: !75)
!1138 = !DILocalVariable(name: "errbuf", scope: !1135, file: !314, line: 193, type: !1139)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1140)
!1140 = !{!1141}
!1141 = !DISubrange(count: 1024)
!1142 = !DILocation(line: 0, scope: !1135, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 234, column: 5, scope: !1132)
!1144 = !DILocation(line: 193, column: 3, scope: !1135, inlinedAt: !1143)
!1145 = !DILocation(line: 193, column: 8, scope: !1135, inlinedAt: !1143)
!1146 = !DILocation(line: 195, column: 7, scope: !1135, inlinedAt: !1143)
!1147 = !DILocation(line: 207, column: 9, scope: !1148, inlinedAt: !1143)
!1148 = distinct !DILexicalBlock(scope: !1135, file: !314, line: 207, column: 7)
!1149 = !DILocation(line: 207, column: 7, scope: !1135, inlinedAt: !1143)
!1150 = !DILocation(line: 208, column: 9, scope: !1148, inlinedAt: !1143)
!1151 = !DILocation(line: 208, column: 5, scope: !1148, inlinedAt: !1143)
!1152 = !DILocation(line: 214, column: 3, scope: !1135, inlinedAt: !1143)
!1153 = !DILocation(line: 216, column: 1, scope: !1135, inlinedAt: !1143)
!1154 = !DILocation(line: 234, column: 5, scope: !1132)
!1155 = !DILocation(line: 238, column: 3, scope: !1105)
!1156 = !DILocalVariable(name: "__c", arg: 1, scope: !1157, file: !1158, line: 101, type: !99)
!1157 = distinct !DISubprogram(name: "putc_unlocked", scope: !1158, file: !1158, line: 101, type: !1159, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1161)
!1158 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!99, !99, !1071}
!1161 = !{!1156, !1162}
!1162 = !DILocalVariable(name: "__stream", arg: 2, scope: !1157, file: !1158, line: 101, type: !1071)
!1163 = !DILocation(line: 0, scope: !1157, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 238, column: 3, scope: !1105)
!1165 = !DILocation(line: 103, column: 10, scope: !1157, inlinedAt: !1164)
!1166 = !{!1167, !726, i64 40}
!1167 = !{!"_IO_FILE", !748, i64 0, !726, i64 8, !726, i64 16, !726, i64 24, !726, i64 32, !726, i64 40, !726, i64 48, !726, i64 56, !726, i64 64, !726, i64 72, !726, i64 80, !726, i64 88, !726, i64 96, !726, i64 104, !748, i64 112, !748, i64 116, !1168, i64 120, !789, i64 128, !727, i64 130, !727, i64 131, !726, i64 136, !1168, i64 144, !726, i64 152, !726, i64 160, !726, i64 168, !726, i64 176, !1168, i64 184, !748, i64 192, !727, i64 196}
!1168 = !{!"long", !727, i64 0}
!1169 = !{!1167, !726, i64 48}
!1170 = !{!"branch_weights", i32 2000, i32 1}
!1171 = !DILocation(line: 240, column: 3, scope: !1105)
!1172 = !DILocation(line: 241, column: 7, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1105, file: !314, line: 241, column: 7)
!1174 = !DILocation(line: 241, column: 7, scope: !1105)
!1175 = !DILocation(line: 242, column: 5, scope: !1173)
!1176 = !DILocation(line: 243, column: 1, scope: !1105)
!1177 = !DISubprogram(name: "__vfprintf_chk", scope: !741, file: !741, line: 96, type: !1178, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!99, !1070, !99, !744, !326}
!1180 = !DISubprogram(name: "strerror_r", scope: !897, file: !897, line: 444, type: !1181, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!97, !99, !97, !101}
!1183 = !DISubprogram(name: "__overflow", scope: !325, file: !325, line: 886, type: !1184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!99, !1071, !99}
!1186 = !DISubprogram(name: "fflush_unlocked", scope: !325, file: !325, line: 239, type: !1187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!99, !1071}
!1189 = !DISubprogram(name: "fcntl", scope: !1190, file: !1190, line: 149, type: !1191, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1190 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!99, !99, !99, null}
!1193 = distinct !DISubprogram(name: "error", scope: !314, file: !314, line: 285, type: !1194, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1196)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !99, !99, !75, null}
!1196 = !{!1197, !1198, !1199, !1200}
!1197 = !DILocalVariable(name: "status", arg: 1, scope: !1193, file: !314, line: 285, type: !99)
!1198 = !DILocalVariable(name: "errnum", arg: 2, scope: !1193, file: !314, line: 285, type: !99)
!1199 = !DILocalVariable(name: "message", arg: 3, scope: !1193, file: !314, line: 285, type: !75)
!1200 = !DILocalVariable(name: "ap", scope: !1193, file: !314, line: 287, type: !324)
!1201 = !DILocation(line: 0, scope: !1193)
!1202 = !DILocation(line: 287, column: 3, scope: !1193)
!1203 = !DILocation(line: 287, column: 11, scope: !1193)
!1204 = !DILocation(line: 288, column: 3, scope: !1193)
!1205 = !DILocation(line: 289, column: 3, scope: !1193)
!1206 = !DILocation(line: 290, column: 3, scope: !1193)
!1207 = !DILocation(line: 291, column: 1, scope: !1193)
!1208 = !DILocation(line: 0, scope: !321)
!1209 = !DILocation(line: 298, column: 1, scope: !321)
!1210 = !DILocation(line: 302, column: 7, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !321, file: !314, line: 302, column: 7)
!1212 = !DILocation(line: 302, column: 7, scope: !321)
!1213 = !DILocation(line: 307, column: 11, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1215, file: !314, line: 307, column: 11)
!1215 = distinct !DILexicalBlock(scope: !1211, file: !314, line: 303, column: 5)
!1216 = !DILocation(line: 307, column: 27, scope: !1214)
!1217 = !DILocation(line: 308, column: 11, scope: !1214)
!1218 = !DILocation(line: 308, column: 28, scope: !1214)
!1219 = !DILocation(line: 308, column: 25, scope: !1214)
!1220 = !DILocation(line: 309, column: 15, scope: !1214)
!1221 = !DILocation(line: 309, column: 33, scope: !1214)
!1222 = !DILocation(line: 310, column: 19, scope: !1214)
!1223 = !DILocation(line: 311, column: 22, scope: !1214)
!1224 = !DILocation(line: 311, column: 56, scope: !1214)
!1225 = !DILocation(line: 307, column: 11, scope: !1215)
!1226 = !DILocation(line: 316, column: 21, scope: !1215)
!1227 = !DILocation(line: 317, column: 23, scope: !1215)
!1228 = !DILocation(line: 318, column: 5, scope: !1215)
!1229 = !DILocation(line: 327, column: 3, scope: !321)
!1230 = !DILocation(line: 331, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !321, file: !314, line: 331, column: 7)
!1232 = !DILocation(line: 331, column: 7, scope: !321)
!1233 = !DILocation(line: 332, column: 5, scope: !1231)
!1234 = !DILocation(line: 338, column: 7, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1231, file: !314, line: 334, column: 5)
!1236 = !DILocation(line: 346, column: 3, scope: !321)
!1237 = !DILocation(line: 350, column: 3, scope: !321)
!1238 = !DILocation(line: 356, column: 1, scope: !321)
!1239 = distinct !DISubprogram(name: "error_at_line", scope: !314, file: !314, line: 359, type: !1240, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !313, retainedNodes: !1242)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{null, !99, !99, !75, !82, !75, null}
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248}
!1243 = !DILocalVariable(name: "status", arg: 1, scope: !1239, file: !314, line: 359, type: !99)
!1244 = !DILocalVariable(name: "errnum", arg: 2, scope: !1239, file: !314, line: 359, type: !99)
!1245 = !DILocalVariable(name: "file_name", arg: 3, scope: !1239, file: !314, line: 359, type: !75)
!1246 = !DILocalVariable(name: "line_number", arg: 4, scope: !1239, file: !314, line: 360, type: !82)
!1247 = !DILocalVariable(name: "message", arg: 5, scope: !1239, file: !314, line: 360, type: !75)
!1248 = !DILocalVariable(name: "ap", scope: !1239, file: !314, line: 362, type: !324)
!1249 = !DILocation(line: 0, scope: !1239)
!1250 = !DILocation(line: 362, column: 3, scope: !1239)
!1251 = !DILocation(line: 362, column: 11, scope: !1239)
!1252 = !DILocation(line: 363, column: 3, scope: !1239)
!1253 = !DILocation(line: 364, column: 3, scope: !1239)
!1254 = !DILocation(line: 366, column: 3, scope: !1239)
!1255 = !DILocation(line: 367, column: 1, scope: !1239)
!1256 = distinct !DISubprogram(name: "getprogname", scope: !649, file: !649, line: 54, type: !1257, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !648, retainedNodes: !739)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!75}
!1259 = !DILocation(line: 58, column: 10, scope: !1256)
!1260 = !DILocation(line: 58, column: 3, scope: !1256)
!1261 = distinct !DISubprogram(name: "set_program_name", scope: !371, file: !371, line: 37, type: !974, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !370, retainedNodes: !1262)
!1262 = !{!1263, !1264, !1265}
!1263 = !DILocalVariable(name: "argv0", arg: 1, scope: !1261, file: !371, line: 37, type: !75)
!1264 = !DILocalVariable(name: "slash", scope: !1261, file: !371, line: 44, type: !75)
!1265 = !DILocalVariable(name: "base", scope: !1261, file: !371, line: 45, type: !75)
!1266 = !DILocation(line: 0, scope: !1261)
!1267 = !DILocation(line: 44, column: 23, scope: !1261)
!1268 = !DILocation(line: 45, column: 22, scope: !1261)
!1269 = !DILocation(line: 46, column: 17, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1261, file: !371, line: 46, column: 7)
!1271 = !DILocation(line: 46, column: 9, scope: !1270)
!1272 = !DILocation(line: 46, column: 25, scope: !1270)
!1273 = !DILocation(line: 46, column: 40, scope: !1270)
!1274 = !DILocalVariable(name: "__s1", arg: 1, scope: !1275, file: !760, line: 974, type: !927)
!1275 = distinct !DISubprogram(name: "memeq", scope: !760, file: !760, line: 974, type: !1276, scopeLine: 975, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !370, retainedNodes: !1278)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!218, !927, !927, !101}
!1278 = !{!1274, !1279, !1280}
!1279 = !DILocalVariable(name: "__s2", arg: 2, scope: !1275, file: !760, line: 974, type: !927)
!1280 = !DILocalVariable(name: "__n", arg: 3, scope: !1275, file: !760, line: 974, type: !101)
!1281 = !DILocation(line: 0, scope: !1275, inlinedAt: !1282)
!1282 = distinct !DILocation(line: 46, column: 28, scope: !1270)
!1283 = !DILocation(line: 976, column: 11, scope: !1275, inlinedAt: !1282)
!1284 = !DILocation(line: 976, column: 10, scope: !1275, inlinedAt: !1282)
!1285 = !DILocation(line: 46, column: 7, scope: !1261)
!1286 = !DILocation(line: 49, column: 11, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1288, file: !371, line: 49, column: 11)
!1288 = distinct !DILexicalBlock(scope: !1270, file: !371, line: 47, column: 5)
!1289 = !DILocation(line: 49, column: 36, scope: !1287)
!1290 = !DILocation(line: 49, column: 11, scope: !1288)
!1291 = !DILocation(line: 65, column: 16, scope: !1261)
!1292 = !DILocation(line: 71, column: 27, scope: !1261)
!1293 = !DILocation(line: 74, column: 33, scope: !1261)
!1294 = !DILocation(line: 76, column: 1, scope: !1261)
!1295 = !DISubprogram(name: "strrchr", scope: !897, file: !897, line: 273, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !739)
!1296 = !DILocation(line: 0, scope: !380)
!1297 = !DILocation(line: 40, column: 29, scope: !380)
!1298 = !DILocation(line: 41, column: 19, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !380, file: !381, line: 41, column: 7)
!1300 = !DILocation(line: 41, column: 7, scope: !380)
!1301 = !DILocation(line: 47, column: 3, scope: !380)
!1302 = !DILocation(line: 48, column: 3, scope: !380)
!1303 = !DILocation(line: 48, column: 13, scope: !380)
!1304 = !DILocalVariable(name: "ps", arg: 1, scope: !1305, file: !1306, line: 1135, type: !1309)
!1305 = distinct !DISubprogram(name: "mbszero", scope: !1306, file: !1306, line: 1135, type: !1307, scopeLine: 1136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1310)
!1306 = !DIFile(filename: "./lib/wchar.h", directory: "/src")
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !1309}
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!1310 = !{!1304}
!1311 = !DILocation(line: 0, scope: !1305, inlinedAt: !1312)
!1312 = distinct !DILocation(line: 48, column: 18, scope: !380)
!1313 = !DILocalVariable(name: "__dest", arg: 1, scope: !1314, file: !1315, line: 57, type: !98)
!1314 = distinct !DISubprogram(name: "memset", scope: !1315, file: !1315, line: 57, type: !1316, scopeLine: 58, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !1318)
!1315 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/string_fortified.h", directory: "", checksumkind: CSK_MD5, checksum: "07ec6246fff124a462ca821044b97d7c")
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!98, !98, !99, !101}
!1318 = !{!1313, !1319, !1320}
!1319 = !DILocalVariable(name: "__ch", arg: 2, scope: !1314, file: !1315, line: 57, type: !99)
