; ModuleID = 'src/fmt.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.Word = type { ptr, i32, i32, i8, i32, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [42 x i8] c"Usage: %s [-WIDTH] [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [129 x i8] c"Reformat each paragraph in the FILE(s), writing to standard output.\0AThe option -WIDTH is an abbreviated form of --width=DIGITS.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"fmt\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [71 x i8] c"  -c, --crown-margin\0A         preserve indentation of first two lines\0A\00", align 1, !dbg !22

!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !173, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(scope: null, file: !2, line: 450, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 27)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 23)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "crown", scope: !89, file: !2, line: 173, type: !195, isLocal: true, isDefinition: true)
!195 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "tagged", scope: !89, file: !2, line: 176, type: !195, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "split", scope: !89, file: !2, line: 179, type: !195, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "uniform", scope: !89, file: !2, line: 182, type: !195, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "goal_width", scope: !89, file: !2, line: 203, type: !93, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !92, line: 729, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 56)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !92, line: 736, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 75)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !216, file: !92, line: 575, type: !93, isLocal: true, isDefinition: true)
!216 = distinct !DISubprogram(name: "oputs_", scope: !92, file: !92, line: 573, type: !217, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !219)
!217 = !DISubroutineType(cc: DW_CC_nocall, types: !218)
!218 = !{null, !150, !150}
!219 = !{!220, !221, !222, !225, !226, !227, !228, !232, !233, !234, !235, !237, !289, !290, !291, !293, !294}
!220 = !DILocalVariable(name: "program", arg: 1, scope: !216, file: !92, line: 573, type: !150)
!221 = !DILocalVariable(name: "option", arg: 2, scope: !216, file: !92, line: 573, type: !150)
!222 = !DILocalVariable(name: "term", scope: !223, file: !92, line: 585, type: !150)
!223 = distinct !DILexicalBlock(scope: !224, file: !92, line: 582, column: 5)
!224 = distinct !DILexicalBlock(scope: !216, file: !92, line: 581, column: 7)
!225 = !DILocalVariable(name: "double_space", scope: !216, file: !92, line: 594, type: !195)
!226 = !DILocalVariable(name: "first_word", scope: !216, file: !92, line: 595, type: !150)
!227 = !DILocalVariable(name: "option_text", scope: !216, file: !92, line: 596, type: !150)
!228 = !DILocalVariable(name: "s", scope: !229, file: !92, line: 608, type: !150)
!229 = distinct !DILexicalBlock(scope: !230, file: !92, line: 605, column: 5)
!230 = distinct !DILexicalBlock(scope: !231, file: !92, line: 604, column: 12)
!231 = distinct !DILexicalBlock(scope: !216, file: !92, line: 597, column: 7)
!232 = !DILocalVariable(name: "spaces", scope: !229, file: !92, line: 609, type: !147)
!233 = !DILocalVariable(name: "anchor_len", scope: !216, file: !92, line: 620, type: !147)
!234 = !DILocalVariable(name: "desc_text", scope: !216, file: !92, line: 625, type: !150)
!235 = !DILocalVariable(name: "__ptr", scope: !236, file: !92, line: 644, type: !150)
!236 = distinct !DILexicalBlock(scope: !216, file: !92, line: 644, column: 3)
!237 = !DILocalVariable(name: "__stream", scope: !236, file: !92, line: 644, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !240, line: 7, baseType: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !242, line: 49, size: 1728, elements: !243)
!242 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!243 = !{!244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !259, !261, !262, !263, !266, !267, !269, !270, !273, !275, !278, !281, !282, !283, !284, !285}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !241, file: !242, line: 51, baseType: !93, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !241, file: !242, line: 54, baseType: !144, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !241, file: !242, line: 55, baseType: !144, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !241, file: !242, line: 56, baseType: !144, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !241, file: !242, line: 57, baseType: !144, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !241, file: !242, line: 58, baseType: !144, size: 64, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !241, file: !242, line: 59, baseType: !144, size: 64, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !241, file: !242, line: 60, baseType: !144, size: 64, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !241, file: !242, line: 61, baseType: !144, size: 64, offset: 512)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !241, file: !242, line: 64, baseType: !144, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !241, file: !242, line: 65, baseType: !144, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !241, file: !242, line: 66, baseType: !144, size: 64, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !241, file: !242, line: 68, baseType: !257, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !242, line: 36, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !241, file: !242, line: 70, baseType: !260, size: 64, offset: 832)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !241, file: !242, line: 72, baseType: !93, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !241, file: !242, line: 73, baseType: !93, size: 32, offset: 928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !241, file: !242, line: 74, baseType: !264, size: 64, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !265, line: 152, baseType: !155)
!265 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !241, file: !242, line: 77, baseType: !146, size: 16, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !241, file: !242, line: 78, baseType: !268, size: 8, offset: 1040)
!268 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !241, file: !242, line: 79, baseType: !69, size: 8, offset: 1048)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !241, file: !242, line: 81, baseType: !271, size: 64, offset: 1088)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !242, line: 43, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !241, file: !242, line: 89, baseType: !274, size: 64, offset: 1152)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !265, line: 153, baseType: !155)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !241, file: !242, line: 91, baseType: !276, size: 64, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !242, line: 37, flags: DIFlagFwdDecl)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !241, file: !242, line: 92, baseType: !279, size: 64, offset: 1280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !242, line: 38, flags: DIFlagFwdDecl)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !241, file: !242, line: 93, baseType: !260, size: 64, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !241, file: !242, line: 94, baseType: !145, size: 64, offset: 1408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !241, file: !242, line: 95, baseType: !147, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !241, file: !242, line: 96, baseType: !93, size: 32, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !241, file: !242, line: 98, baseType: !286, size: 160, offset: 1568)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 20)
!289 = !DILocalVariable(name: "__cnt", scope: !236, file: !92, line: 644, type: !147)
!290 = !DILocalVariable(name: "url_program", scope: !216, file: !92, line: 648, type: !150)
!291 = !DILocalVariable(name: "__ptr", scope: !292, file: !92, line: 686, type: !150)
!292 = distinct !DILexicalBlock(scope: !216, file: !92, line: 686, column: 3)
!293 = !DILocalVariable(name: "__stream", scope: !292, file: !92, line: 686, type: !238)
!294 = !DILocalVariable(name: "__cnt", scope: !292, file: !92, line: 686, type: !147)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !92, line: 585, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !92, line: 586, type: !297, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !92, line: 595, type: !19, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !92, line: 620, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 6)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !173, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !92, line: 648, type: !297, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !19, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !92, line: 649, type: !185, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !92, line: 650, type: !297, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !92, line: 651, type: !306, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !92, line: 652, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 7)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !92, line: 653, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 8)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !92, line: 654, type: !74, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !92, line: 655, type: !74, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !92, line: 656, type: !74, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !92, line: 657, type: !74, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !92, line: 663, type: !325, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !92, line: 664, type: !74, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 17)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !92, line: 669, type: !352, isLocal: true, isDefinition: true)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 40)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 15)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !92, line: 676, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 61)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !92, line: 679, type: !185, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !92, line: 683, type: !297, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !92, line: 688, type: !297, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !92, line: 691, type: !330, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !92, line: 839, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 16)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !92, line: 840, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 22)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !92, line: 841, type: !357, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !92, line: 862, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !92, line: 868, type: !24, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !92, line: 875, type: !180, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 51)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !92, line: 877, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 12)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 319, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 13)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !325, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 11)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !347, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 323, type: !375, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !306, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !297, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !297, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !330, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "max_width", scope: !89, file: !2, line: 189, type: !93, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "prefix_lead_space", scope: !89, file: !2, line: 197, type: !93, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "prefix", scope: !89, file: !2, line: 185, type: !150, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "prefix_full_length", scope: !89, file: !2, line: 194, type: !93, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "prefix_length", scope: !89, file: !2, line: 200, type: !93, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 514, type: !410, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 516, type: !347, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "tabs", scope: !89, file: !2, line: 231, type: !195, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "other_indent", scope: !89, file: !2, line: 240, type: !93, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "in_column", scope: !89, file: !2, line: 208, type: !93, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "next_prefix_indent", scope: !89, file: !2, line: 254, type: !93, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "next_char", scope: !89, file: !2, line: 250, type: !93, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "last_line_length", scope: !89, file: !2, line: 259, type: !93, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "out_column", scope: !89, file: !2, line: 211, type: !93, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "prefix_indent", scope: !89, file: !2, line: 234, type: !93, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "first_indent", scope: !89, file: !2, line: 237, type: !93, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "parabuf", scope: !89, file: !2, line: 215, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40000, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 5000)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "wptr", scope: !89, file: !2, line: 218, type: !144, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "unused_word_type", scope: !89, file: !2, line: 222, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 320000, elements: !481)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 128, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Word", file: !2, line: 130, size: 320, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !468, file: !2, line: 135, baseType: !150, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !2, line: 136, baseType: !93, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !468, file: !2, line: 137, baseType: !93, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "paren", scope: !468, file: !2, line: 138, baseType: !99, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !468, file: !2, line: 139, baseType: !99, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "punct", scope: !468, file: !2, line: 140, baseType: !99, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !468, file: !2, line: 141, baseType: !99, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !468, file: !2, line: 145, baseType: !93, size: 32, offset: 160)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "best_cost", scope: !468, file: !2, line: 146, baseType: !154, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_break", scope: !468, file: !2, line: 147, baseType: !480, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!481 = !{!482}
!482 = !DISubrange(count: 1000)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !92, line: 952, type: !398, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !2, line: 798, type: !306, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 800, type: !297, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 802, type: !19, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "word_limit", scope: !89, file: !2, line: 227, type: !480, isLocal: true, isDefinition: true)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 2560, elements: !75)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !496, line: 50, size: 256, elements: !497)
!496 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!497 = !{!498, !499, !500, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !496, line: 52, baseType: !150, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !495, file: !496, line: 55, baseType: !93, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !496, line: 56, baseType: !501, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !495, file: !496, line: 57, baseType: !93, size: 32, offset: 192)
!503 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !510, line: 3, type: !357, isLocal: true, isDefinition: true)
!510 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "Version", scope: !513, file: !510, line: 3, type: !150, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C11, file: !510, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !514, splitDebugInlining: false, nameTableKind: None)
!514 = !{!508, !511}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "file_name", scope: !517, file: !518, line: 45, type: !150, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C11, file: !518, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !519, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!519 = !{!520, !522, !524, !526, !515, !528}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !325, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !518, line: 121, type: !398, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !518, line: 123, type: !325, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !518, line: 126, type: !185, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !517, file: !518, line: 55, type: !195, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !532, file: !533, line: 66, type: !581, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C11, file: !533, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!534 = !{!145, !152}
!535 = !{!536, !538, !563, !565, !567, !569, !530, !571, !573, !575, !577, !579}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !533, line: 272, type: !297, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "old_file_name", scope: !540, file: !533, line: 304, type: !150, isLocal: true, isDefinition: true)
!540 = distinct !DISubprogram(name: "verror_at_line", scope: !533, file: !533, line: 298, type: !541, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !532, retainedNodes: !556)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !93, !93, !150, !99, !150, !543}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !544, line: 52, baseType: !545)
!544 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !546, line: 14, baseType: !547)
!546 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !548, baseType: !549)
!548 = !DIFile(filename: "lib/error.c", directory: "/src")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !549, file: !548, baseType: !145, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !549, file: !548, baseType: !145, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !549, file: !548, baseType: !145, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !549, file: !548, baseType: !93, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !549, file: !548, baseType: !93, size: 32, offset: 224)
!556 = !{!557, !558, !559, !560, !561, !562}
!557 = !DILocalVariable(name: "status", arg: 1, scope: !540, file: !533, line: 298, type: !93)
!558 = !DILocalVariable(name: "errnum", arg: 2, scope: !540, file: !533, line: 298, type: !93)
!559 = !DILocalVariable(name: "file_name", arg: 3, scope: !540, file: !533, line: 298, type: !150)
!560 = !DILocalVariable(name: "line_number", arg: 4, scope: !540, file: !533, line: 298, type: !99)
!561 = !DILocalVariable(name: "message", arg: 5, scope: !540, file: !533, line: 298, type: !150)
!562 = !DILocalVariable(name: "args", arg: 6, scope: !540, file: !533, line: 298, type: !543)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "old_line_number", scope: !540, file: !533, line: 305, type: !99, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !533, line: 338, type: !19, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !330, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !533, line: 346, type: !173, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "error_message_count", scope: !532, file: !533, line: 69, type: !99, isLocal: false, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !532, file: !533, line: 295, type: !93, isLocal: false, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !325, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !533, line: 208, type: !84, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !533, line: 214, type: !297, isLocal: true, isDefinition: true)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null}
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "program_name", scope: !586, file: !587, line: 31, type: !150, isLocal: false, isDefinition: true)
!586 = distinct !DICompileUnit(language: DW_LANG_C11, file: !587, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !588, globals: !589, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!588 = !{!144}
!589 = !{!584, !590, !592}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !587, line: 46, type: !330, isLocal: true, isDefinition: true)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !587, line: 49, type: !19, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "utf07FF", scope: !596, file: !597, line: 46, type: !624, isLocal: true, isDefinition: true)
!596 = distinct !DISubprogram(name: "proper_name_lite", scope: !597, file: !597, line: 38, type: !598, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !600, retainedNodes: !602)
!597 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!598 = !DISubroutineType(types: !599)
!599 = !{!150, !150, !150}
!600 = distinct !DICompileUnit(language: DW_LANG_C11, file: !597, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !601, splitDebugInlining: false, nameTableKind: None)
!601 = !{!594}
!602 = !{!603, !604, !605, !606, !611}
!603 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !596, file: !597, line: 38, type: !150)
!604 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !596, file: !597, line: 38, type: !150)
!605 = !DILocalVariable(name: "translation", scope: !596, file: !597, line: 40, type: !150)
!606 = !DILocalVariable(name: "w", scope: !596, file: !597, line: 47, type: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !608, line: 37, baseType: !609)
!608 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !265, line: 57, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !265, line: 42, baseType: !99)
!611 = !DILocalVariable(name: "mbs", scope: !596, file: !597, line: 48, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !613, line: 6, baseType: !614)
!613 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !615, line: 21, baseType: !616)
!615 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 13, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !616, file: !615, line: 15, baseType: !93, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !616, file: !615, line: 20, baseType: !620, size: 32, offset: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !616, file: !615, line: 16, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !620, file: !615, line: 18, baseType: !99, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !620, file: !615, line: 19, baseType: !19, size: 32)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 16, elements: !174)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !627, line: 78, type: !330, isLocal: true, isDefinition: true)
!627 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !627, line: 79, type: !306, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !627, line: 80, type: !403, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !627, line: 81, type: !403, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !627, line: 82, type: !286, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !627, line: 83, type: !173, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !627, line: 84, type: !330, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !627, line: 85, type: !325, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !627, line: 86, type: !325, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !627, line: 87, type: !330, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !648, file: !627, line: 76, type: !720, isLocal: false, isDefinition: true)
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !627, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !655, globals: !656, splitDebugInlining: false, nameTableKind: None)
!649 = !{!105, !650, !119}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !106, line: 254, baseType: !99, size: 32, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!653 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!654 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!655 = !{!93, !146, !147}
!656 = !{!625, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !657, !661, !671, !673, !678, !680, !682, !684, !686, !709, !716, !718}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !648, file: !627, line: 92, type: !659, isLocal: false, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 320, elements: !75)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !648, file: !627, line: 1040, type: !663, isLocal: false, isDefinition: true)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !627, line: 56, size: 448, elements: !664)
!664 = !{!665, !666, !667, !669, !670}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !663, file: !627, line: 59, baseType: !105, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !663, file: !627, line: 62, baseType: !93, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !663, file: !627, line: 66, baseType: !668, size: 256, offset: 64)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !331)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !663, file: !627, line: 69, baseType: !150, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !663, file: !627, line: 72, baseType: !150, size: 64, offset: 384)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !648, file: !627, line: 107, type: !663, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "slot0", scope: !648, file: !627, line: 831, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 256)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !627, line: 321, type: !173, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !627, line: 357, type: !173, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !627, line: 358, type: !173, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !627, line: 199, type: !325, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "quote", scope: !688, file: !627, line: 228, type: !707, isLocal: true, isDefinition: true)
!688 = distinct !DISubprogram(name: "gettext_quote", scope: !627, file: !627, line: 197, type: !689, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !648, retainedNodes: !691)
!689 = !DISubroutineType(types: !690)
!690 = !{!150, !150, !105}
!691 = !{!692, !693, !694, !695, !696}
!692 = !DILocalVariable(name: "msgid", arg: 1, scope: !688, file: !627, line: 197, type: !150)
!693 = !DILocalVariable(name: "s", arg: 2, scope: !688, file: !627, line: 197, type: !105)
!694 = !DILocalVariable(name: "translation", scope: !688, file: !627, line: 199, type: !150)
!695 = !DILocalVariable(name: "w", scope: !688, file: !627, line: 229, type: !607)
!696 = !DILocalVariable(name: "mbs", scope: !688, file: !627, line: 230, type: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !613, line: 6, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !615, line: 21, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 13, size: 64, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !699, file: !615, line: 15, baseType: !93, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !699, file: !615, line: 20, baseType: !703, size: 32, offset: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !699, file: !615, line: 16, size: 32, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !703, file: !615, line: 18, baseType: !99, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !703, file: !615, line: 19, baseType: !19, size: 32)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !708)
!708 = !{!175, !21}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "slotvec", scope: !648, file: !627, line: 834, type: !711, isLocal: true, isDefinition: true)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !627, line: 823, size: 128, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !712, file: !627, line: 825, baseType: !147, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !712, file: !627, line: 826, baseType: !144, size: 64, offset: 64)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "nslots", scope: !648, file: !627, line: 832, type: !93, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "slotvec0", scope: !648, file: !627, line: 833, type: !712, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 704, elements: !411)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !724, line: 67, type: !398, isLocal: true, isDefinition: true)
!724 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(scope: null, file: !724, line: 69, type: !325, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !724, line: 83, type: !325, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !724, line: 83, type: !19, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !724, line: 85, type: !173, isLocal: true, isDefinition: true)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !724, line: 88, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 171)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !724, line: 88, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 34)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !724, line: 105, type: !375, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !724, line: 109, type: !190, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !724, line: 113, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 28)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !724, line: 120, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 32)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !724, line: 127, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 36)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !724, line: 134, type: !352, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !724, line: 142, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 44)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !724, line: 150, type: !771, isLocal: true, isDefinition: true)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 48)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !724, line: 159, type: !776, isLocal: true, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !777)
!777 = !{!778}
!778 = !DISubrange(count: 52)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !724, line: 170, type: !781, isLocal: true, isDefinition: true)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 60)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !724, line: 248, type: !286, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !724, line: 248, type: !380, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !724, line: 254, type: !286, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !724, line: 254, type: !164, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !724, line: 254, type: !352, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !724, line: 259, type: !3, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !724, line: 259, type: !798, isLocal: true, isDefinition: true)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 29)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !803, file: !804, line: 26, type: !806, isLocal: false, isDefinition: true)
!803 = distinct !DICompileUnit(language: DW_LANG_C11, file: !804, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !805, splitDebugInlining: false, nameTableKind: None)
!804 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!805 = !{!801}
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 376, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 47)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "exit_failure", scope: !811, file: !812, line: 24, type: !814, isLocal: false, isDefinition: true)
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !813, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!813 = !{!809}
!814 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !93)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !817, line: 34, type: !185, isLocal: true, isDefinition: true)
!817 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !817, line: 34, type: !325, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !817, line: 34, type: !347, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !824, line: 80, type: !325, isLocal: true, isDefinition: true)
!824 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !827, line: 108, type: !69, isLocal: true, isDefinition: true)
!827 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "internal_state", scope: !830, file: !827, line: 97, type: !833, isLocal: true, isDefinition: true)
!830 = distinct !DICompileUnit(language: DW_LANG_C11, file: !827, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !831, globals: !832, splitDebugInlining: false, nameTableKind: None)
!831 = !{!145, !147, !152}
!832 = !{!825, !828}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !613, line: 6, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !615, line: 21, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 13, size: 64, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !835, file: !615, line: 15, baseType: !93, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !835, file: !615, line: 20, baseType: !839, size: 32, offset: 32)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !835, file: !615, line: 16, size: 32, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !839, file: !615, line: 18, baseType: !99, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !839, file: !615, line: 19, baseType: !19, size: 32)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(scope: null, file: !845, line: 35, type: !173, isLocal: true, isDefinition: true)
!845 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !845, line: 35, type: !306, isLocal: true, isDefinition: true)
!848 = distinct !DICompileUnit(language: DW_LANG_C11, file: !849, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !850, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!850 = !{!134}
!851 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!853 = distinct !DICompileUnit(language: DW_LANG_C11, file: !854, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!855 = !{!145}
!856 = distinct !DICompileUnit(language: DW_LANG_C11, file: !857, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!857 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!858 = distinct !DICompileUnit(language: DW_LANG_C11, file: !859, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, splitDebugInlining: false, nameTableKind: None)
!859 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!860 = distinct !DICompileUnit(language: DW_LANG_C11, file: !861, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!862 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !863, retainedTypes: !855, globals: !867, splitDebugInlining: false, nameTableKind: None)
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !724, line: 40, baseType: !99, size: 32, elements: !865)
!865 = !{!866}
!866 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!867 = !{!722, !725, !727, !729, !731, !733, !738, !743, !745, !747, !752, !757, !762, !764, !769, !774, !779, !784, !786, !788, !790, !792, !794, !796}
!868 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !870, retainedTypes: !901, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!870 = !{!871, !883}
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !872, file: !869, line: 188, baseType: !99, size: 32, elements: !881)
!872 = distinct !DISubprogram(name: "x2nrealloc", scope: !869, file: !869, line: 176, type: !873, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !868, retainedNodes: !876)
!873 = !DISubroutineType(types: !874)
!874 = !{!145, !145, !875, !147}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!876 = !{!877, !878, !879, !880}
!877 = !DILocalVariable(name: "p", arg: 1, scope: !872, file: !869, line: 176, type: !145)
!878 = !DILocalVariable(name: "pn", arg: 2, scope: !872, file: !869, line: 176, type: !875)
!879 = !DILocalVariable(name: "s", arg: 3, scope: !872, file: !869, line: 176, type: !147)
!880 = !DILocalVariable(name: "n", scope: !872, file: !869, line: 178, type: !147)
!881 = !{!882}
!882 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !884, file: !869, line: 228, baseType: !99, size: 32, elements: !881)
!884 = distinct !DISubprogram(name: "xpalloc", scope: !869, file: !869, line: 223, type: !885, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !868, retainedNodes: !891)
!885 = !DISubroutineType(types: !886)
!886 = !{!145, !145, !887, !888, !890, !888}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !889, line: 130, baseType: !890)
!889 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !148, line: 35, baseType: !155)
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900}
!892 = !DILocalVariable(name: "pa", arg: 1, scope: !884, file: !869, line: 223, type: !145)
!893 = !DILocalVariable(name: "pn", arg: 2, scope: !884, file: !869, line: 223, type: !887)
!894 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !884, file: !869, line: 223, type: !888)
!895 = !DILocalVariable(name: "n_max", arg: 4, scope: !884, file: !869, line: 223, type: !890)
!896 = !DILocalVariable(name: "s", arg: 5, scope: !884, file: !869, line: 223, type: !888)
!897 = !DILocalVariable(name: "n0", scope: !884, file: !869, line: 230, type: !888)
!898 = !DILocalVariable(name: "n", scope: !884, file: !869, line: 237, type: !888)
!899 = !DILocalVariable(name: "nbytes", scope: !884, file: !869, line: 248, type: !888)
!900 = !DILocalVariable(name: "adjusted_nbytes", scope: !884, file: !869, line: 252, type: !888)
!901 = !{!144, !145, !195, !155, !149}
!902 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !903, splitDebugInlining: false, nameTableKind: None)
!903 = !{!815, !818, !820}
!904 = distinct !DICompileUnit(language: DW_LANG_C11, file: !905, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !906, globals: !915, splitDebugInlining: false, nameTableKind: None)
!905 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!906 = !{!907, !97}
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !908, line: 30, baseType: !99, size: 32, elements: !909)
!908 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!911 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!912 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!913 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!914 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!915 = !{!822}
!916 = distinct !DICompileUnit(language: DW_LANG_C11, file: !917, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !918, retainedTypes: !919, splitDebugInlining: false, nameTableKind: None)
!917 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!918 = !{!907, !119}
!919 = !{!93, !146, !144, !195, !149, !920}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !921, line: 102, baseType: !922)
!921 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !265, line: 73, baseType: !149)
!923 = distinct !DICompileUnit(language: DW_LANG_C11, file: !924, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!925 = distinct !DICompileUnit(language: DW_LANG_C11, file: !926, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!927 = distinct !DICompileUnit(language: DW_LANG_C11, file: !928, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !929, splitDebugInlining: false, nameTableKind: None)
!928 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!929 = !{!195, !149, !145}
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !845, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !931, splitDebugInlining: false, nameTableKind: None)
!931 = !{!843, !846}
!932 = distinct !DICompileUnit(language: DW_LANG_C11, file: !933, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!934 = distinct !DICompileUnit(language: DW_LANG_C11, file: !935, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, splitDebugInlining: false, nameTableKind: None)
!935 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!936 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!937 = !{i32 7, !"Dwarf Version", i32 5}
!938 = !{i32 2, !"Debug Info Version", i32 3}
!939 = !{i32 1, !"wchar_size", i32 4}
!940 = !{i32 8, !"PIC Level", i32 2}
!941 = !{i32 7, !"PIE Level", i32 2}
!942 = !{i32 7, !"uwtable", i32 2}
!943 = !{i32 7, !"frame-pointer", i32 1}
!944 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 262, type: !945, scopeLine: 263, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !93}
!947 = !{!948}
!948 = !DILocalVariable(name: "status", arg: 1, scope: !944, file: !2, line: 262, type: !93)
!949 = !DILocation(line: 0, scope: !944)
!950 = !DILocation(line: 264, column: 14, scope: !951)
!951 = distinct !DILexicalBlock(scope: !944, file: !2, line: 264, column: 7)
!952 = !DILocation(line: 264, column: 7, scope: !944)
!953 = !DILocation(line: 265, column: 5, scope: !954)
!954 = distinct !DILexicalBlock(scope: !951, file: !2, line: 265, column: 5)
!955 = !{!956, !956, i64 0}
!956 = !{!"any pointer", !957, i64 0}
!957 = !{!"omnipotent char", !958, i64 0}
!958 = !{!"Simple C/C++ TBAA"}
!959 = !DILocation(line: 268, column: 7, scope: !960)
!960 = distinct !DILexicalBlock(scope: !951, file: !2, line: 267, column: 5)
!961 = !DILocation(line: 269, column: 7, scope: !960)
!962 = !DILocation(line: 729, column: 3, scope: !963, inlinedAt: !965)
!963 = distinct !DISubprogram(name: "emit_stdin_note", scope: !92, file: !92, line: 727, type: !582, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !964)
!964 = !{}
!965 = distinct !DILocation(line: 274, column: 7, scope: !960)
!966 = !DILocation(line: 736, column: 3, scope: !967, inlinedAt: !968)
!967 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !92, file: !92, line: 734, type: !582, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !964)
!968 = distinct !DILocation(line: 275, column: 7, scope: !960)
!969 = !DILocation(line: 277, column: 7, scope: !960)
!970 = !DILocation(line: 281, column: 7, scope: !960)
!971 = !DILocation(line: 286, column: 7, scope: !960)
!972 = !DILocation(line: 290, column: 7, scope: !960)
!973 = !DILocation(line: 294, column: 7, scope: !960)
!974 = !DILocation(line: 298, column: 7, scope: !960)
!975 = !DILocation(line: 304, column: 7, scope: !960)
!976 = !DILocation(line: 308, column: 7, scope: !960)
!977 = !DILocation(line: 309, column: 7, scope: !960)
!978 = !DILocalVariable(name: "program", arg: 1, scope: !979, file: !92, line: 836, type: !150)
!979 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !92, file: !92, line: 836, type: !980, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !150}
!982 = !{!978, !983, !990, !991, !993, !994}
!983 = !DILocalVariable(name: "infomap", scope: !979, file: !92, line: 838, type: !984)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 896, elements: !326)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !979, file: !92, line: 838, size: 128, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !986, file: !92, line: 838, baseType: !150, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !986, file: !92, line: 838, baseType: !150, size: 64, offset: 64)
!990 = !DILocalVariable(name: "node", scope: !979, file: !92, line: 848, type: !150)
!991 = !DILocalVariable(name: "map_prog", scope: !979, file: !92, line: 849, type: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!993 = !DILocalVariable(name: "lc_messages", scope: !979, file: !92, line: 861, type: !150)
!994 = !DILocalVariable(name: "url_program", scope: !979, file: !92, line: 874, type: !150)
!995 = !DILocation(line: 0, scope: !979, inlinedAt: !996)
!996 = distinct !DILocation(line: 310, column: 7, scope: !960)
!997 = !DILocation(line: 857, column: 3, scope: !979, inlinedAt: !996)
!998 = !DILocation(line: 861, column: 29, scope: !979, inlinedAt: !996)
!999 = !DILocation(line: 862, column: 7, scope: !1000, inlinedAt: !996)
!1000 = distinct !DILexicalBlock(scope: !979, file: !92, line: 862, column: 7)
!1001 = !DILocation(line: 862, column: 19, scope: !1000, inlinedAt: !996)
!1002 = !DILocation(line: 862, column: 22, scope: !1000, inlinedAt: !996)
!1003 = !DILocation(line: 862, column: 7, scope: !979, inlinedAt: !996)
!1004 = !DILocation(line: 868, column: 7, scope: !1005, inlinedAt: !996)
!1005 = distinct !DILexicalBlock(scope: !1000, file: !92, line: 863, column: 5)
!1006 = !DILocation(line: 870, column: 5, scope: !1005, inlinedAt: !996)
!1007 = !DILocation(line: 875, column: 3, scope: !979, inlinedAt: !996)
!1008 = !DILocation(line: 877, column: 3, scope: !979, inlinedAt: !996)
!1009 = !DILocation(line: 312, column: 3, scope: !944)
!1010 = !DISubprogram(name: "dcgettext", scope: !1011, file: !1011, line: 51, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1011 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!144, !150, !150, !93}
!1014 = !DISubprogram(name: "__fprintf_chk", scope: !1015, file: !1015, line: 93, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1015 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!93, !1018, !93, !1019, null}
!1018 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!1019 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!1020 = !DISubprogram(name: "__printf_chk", scope: !1015, file: !1015, line: 95, type: !1021, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!93, !93, !1019, null}
!1023 = !DISubprogram(name: "fputs_unlocked", scope: !544, file: !544, line: 691, type: !1024, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!93, !1019, !1018}
!1026 = !DILocation(line: 0, scope: !216)
!1027 = !DILocation(line: 581, column: 7, scope: !224)
!1028 = !{!1029, !1029, i64 0}
!1029 = !{!"int", !957, i64 0}
!1030 = !DILocation(line: 581, column: 19, scope: !224)
!1031 = !DILocation(line: 581, column: 7, scope: !216)
!1032 = !DILocation(line: 585, column: 26, scope: !223)
!1033 = !DILocation(line: 0, scope: !223)
!1034 = !DILocation(line: 586, column: 23, scope: !223)
!1035 = !DILocation(line: 586, column: 28, scope: !223)
!1036 = !DILocation(line: 586, column: 32, scope: !223)
!1037 = !{!957, !957, i64 0}
!1038 = !DILocation(line: 586, column: 38, scope: !223)
!1039 = !DILocalVariable(name: "__s1", arg: 1, scope: !1040, file: !1041, line: 1359, type: !150)
!1040 = distinct !DISubprogram(name: "streq", scope: !1041, file: !1041, line: 1359, type: !1042, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1044)
!1041 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!195, !150, !150}
!1044 = !{!1039, !1045}
!1045 = !DILocalVariable(name: "__s2", arg: 2, scope: !1040, file: !1041, line: 1359, type: !150)
!1046 = !DILocation(line: 0, scope: !1040, inlinedAt: !1047)
!1047 = distinct !DILocation(line: 586, column: 41, scope: !223)
!1048 = !DILocation(line: 1361, column: 11, scope: !1040, inlinedAt: !1047)
!1049 = !DILocation(line: 1361, column: 10, scope: !1040, inlinedAt: !1047)
!1050 = !DILocation(line: 586, column: 19, scope: !223)
!1051 = !DILocation(line: 587, column: 5, scope: !223)
!1052 = !DILocation(line: 588, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !216, file: !92, line: 588, column: 7)
!1054 = !DILocation(line: 588, column: 7, scope: !216)
!1055 = !DILocation(line: 590, column: 7, scope: !1056)
!1056 = distinct !DILexicalBlock(scope: !1053, file: !92, line: 589, column: 5)
!1057 = !DILocation(line: 591, column: 7, scope: !1056)
!1058 = !DILocation(line: 595, column: 37, scope: !216)
!1059 = !DILocation(line: 595, column: 35, scope: !216)
!1060 = !DILocation(line: 596, column: 29, scope: !216)
!1061 = !DILocation(line: 597, column: 8, scope: !231)
!1062 = !DILocation(line: 597, column: 7, scope: !216)
!1063 = !DILocation(line: 604, column: 24, scope: !230)
!1064 = !DILocation(line: 604, column: 12, scope: !231)
!1065 = !DILocation(line: 0, scope: !229)
!1066 = !DILocation(line: 610, column: 16, scope: !229)
!1067 = !DILocation(line: 610, column: 7, scope: !229)
!1068 = !DILocation(line: 611, column: 21, scope: !229)
!1069 = !{!1070, !1070, i64 0}
!1070 = !{!"short", !957, i64 0}
!1071 = !DILocation(line: 611, column: 19, scope: !229)
!1072 = !DILocation(line: 611, column: 16, scope: !229)
!1073 = !DILocation(line: 610, column: 30, scope: !229)
!1074 = distinct !{!1074, !1067, !1068, !1075}
!1075 = !{!"llvm.loop.mustprogress"}
!1076 = !DILocation(line: 612, column: 18, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !229, file: !92, line: 612, column: 11)
!1078 = !DILocation(line: 612, column: 11, scope: !229)
!1079 = !DILocation(line: 620, column: 23, scope: !216)
!1080 = !DILocation(line: 625, column: 39, scope: !216)
!1081 = !DILocation(line: 626, column: 3, scope: !216)
!1082 = !DILocation(line: 626, column: 10, scope: !216)
!1083 = !DILocation(line: 626, column: 21, scope: !216)
!1084 = !DILocation(line: 628, column: 44, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !92, line: 628, column: 11)
!1086 = distinct !DILexicalBlock(scope: !216, file: !92, line: 627, column: 5)
!1087 = !DILocation(line: 628, column: 32, scope: !1085)
!1088 = !DILocation(line: 628, column: 49, scope: !1085)
!1089 = !DILocation(line: 628, column: 11, scope: !1086)
!1090 = !DILocation(line: 630, column: 11, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1086, file: !92, line: 630, column: 11)
!1092 = !DILocation(line: 630, column: 11, scope: !1086)
!1093 = !DILocation(line: 632, column: 26, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !92, line: 632, column: 15)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !92, line: 631, column: 9)
!1096 = !DILocation(line: 632, column: 34, scope: !1094)
!1097 = !DILocation(line: 632, column: 37, scope: !1094)
!1098 = !DILocation(line: 632, column: 15, scope: !1095)
!1099 = !DILocation(line: 640, column: 16, scope: !1086)
!1100 = distinct !{!1100, !1081, !1101, !1075}
!1101 = !DILocation(line: 641, column: 5, scope: !216)
!1102 = !DILocation(line: 644, column: 3, scope: !216)
!1103 = !DILocation(line: 0, scope: !1040, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 648, column: 31, scope: !216)
!1105 = !DILocation(line: 0, scope: !1040, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 649, column: 31, scope: !216)
!1107 = !DILocation(line: 0, scope: !1040, inlinedAt: !1108)
!1108 = distinct !DILocation(line: 650, column: 31, scope: !216)
!1109 = !DILocation(line: 0, scope: !1040, inlinedAt: !1110)
!1110 = distinct !DILocation(line: 651, column: 31, scope: !216)
!1111 = !DILocation(line: 0, scope: !1040, inlinedAt: !1112)
!1112 = distinct !DILocation(line: 652, column: 31, scope: !216)
!1113 = !DILocation(line: 0, scope: !1040, inlinedAt: !1114)
!1114 = distinct !DILocation(line: 653, column: 31, scope: !216)
!1115 = !DILocation(line: 0, scope: !1040, inlinedAt: !1116)
!1116 = distinct !DILocation(line: 654, column: 31, scope: !216)
!1117 = !DILocation(line: 0, scope: !1040, inlinedAt: !1118)
!1118 = distinct !DILocation(line: 655, column: 31, scope: !216)
!1119 = !DILocation(line: 0, scope: !1040, inlinedAt: !1120)
!1120 = distinct !DILocation(line: 656, column: 31, scope: !216)
!1121 = !DILocation(line: 0, scope: !1040, inlinedAt: !1122)
!1122 = distinct !DILocation(line: 657, column: 31, scope: !216)
!1123 = !DILocation(line: 663, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !216, file: !92, line: 663, column: 7)
!1125 = !DILocation(line: 664, column: 7, scope: !1124)
!1126 = !DILocation(line: 664, column: 10, scope: !1124)
!1127 = !DILocation(line: 663, column: 7, scope: !216)
!1128 = !DILocation(line: 669, column: 7, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1124, file: !92, line: 665, column: 5)
!1130 = !DILocation(line: 671, column: 5, scope: !1129)
!1131 = !DILocation(line: 676, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1124, file: !92, line: 673, column: 5)
!1133 = !DILocation(line: 679, column: 3, scope: !216)
!1134 = !DILocation(line: 683, column: 3, scope: !216)
!1135 = !DILocation(line: 686, column: 3, scope: !216)
!1136 = !DILocation(line: 688, column: 3, scope: !216)
!1137 = !DILocation(line: 691, column: 3, scope: !216)
!1138 = !DILocation(line: 695, column: 3, scope: !216)
!1139 = !DILocation(line: 696, column: 1, scope: !216)
!1140 = !DISubprogram(name: "setlocale", scope: !1141, file: !1141, line: 122, type: !1142, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1141 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!144, !93, !150}
!1144 = !DISubprogram(name: "strncmp", scope: !1145, file: !1145, line: 159, type: !1146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1145 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!93, !150, !150, !147}
!1148 = !DISubprogram(name: "exit", scope: !1149, file: !1149, line: 624, type: !945, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1149 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1150 = !DISubprogram(name: "getenv", scope: !1149, file: !1149, line: 641, type: !1151, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!144, !150}
!1153 = !DISubprogram(name: "strcmp", scope: !1145, file: !1145, line: 156, type: !1154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!93, !150, !150}
!1156 = !DISubprogram(name: "strspn", scope: !1145, file: !1145, line: 297, type: !1157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!149, !150, !150}
!1159 = !DISubprogram(name: "strchr", scope: !1145, file: !1145, line: 246, type: !1160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!144, !150, !93}
!1162 = !DISubprogram(name: "__ctype_b_loc", scope: !120, file: !120, line: 79, type: !1163, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!1168 = !DISubprogram(name: "strcspn", scope: !1145, file: !1145, line: 293, type: !1157, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1169 = !DISubprogram(name: "fwrite_unlocked", scope: !544, file: !544, line: 704, type: !1170, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !964)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!147, !1172, !147, !147, !1018}
!1172 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1173)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1175 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 332, type: !1176, scopeLine: 333, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1179)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!93, !93, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!1179 = !{!1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1193}
!1180 = !DILocalVariable(name: "argc", arg: 1, scope: !1175, file: !2, line: 332, type: !93)
!1181 = !DILocalVariable(name: "argv", arg: 2, scope: !1175, file: !2, line: 332, type: !1178)
!1182 = !DILocalVariable(name: "optchar", scope: !1175, file: !2, line: 334, type: !93)
!1183 = !DILocalVariable(name: "ok", scope: !1175, file: !2, line: 335, type: !195)
!1184 = !DILocalVariable(name: "max_width_option", scope: !1175, file: !2, line: 336, type: !150)
!1185 = !DILocalVariable(name: "goal_width_option", scope: !1175, file: !2, line: 337, type: !150)
!1186 = !DILocalVariable(name: "have_read_stdin", scope: !1175, file: !2, line: 425, type: !195)
!1187 = !DILocalVariable(name: "file", scope: !1188, file: !2, line: 436, type: !144)
!1188 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 435, column: 9)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 434, column: 7)
!1190 = distinct !DILexicalBlock(scope: !1191, file: !2, line: 434, column: 7)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 433, column: 5)
!1192 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 427, column: 7)
!1193 = !DILocalVariable(name: "in_stream", scope: !1194, file: !2, line: 444, type: !238)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 443, column: 13)
!1195 = distinct !DILexicalBlock(scope: !1188, file: !2, line: 437, column: 15)
!1196 = !DILocation(line: 0, scope: !1175)
!1197 = !DILocation(line: 340, column: 21, scope: !1175)
!1198 = !DILocation(line: 340, column: 3, scope: !1175)
!1199 = !DILocation(line: 341, column: 3, scope: !1175)
!1200 = !DILocation(line: 342, column: 3, scope: !1175)
!1201 = !DILocation(line: 343, column: 3, scope: !1175)
!1202 = !DILocation(line: 345, column: 3, scope: !1175)
!1203 = !DILocation(line: 347, column: 12, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 347, column: 7)
!1205 = !DILocation(line: 347, column: 16, scope: !1204)
!1206 = !DILocation(line: 347, column: 19, scope: !1204)
!1207 = !DILocation(line: 347, column: 30, scope: !1204)
!1208 = !DILocation(line: 347, column: 37, scope: !1204)
!1209 = !DILocation(line: 347, column: 51, scope: !1204)
!1210 = !DILocalVariable(name: "c", arg: 1, scope: !1211, file: !1212, line: 233, type: !93)
!1211 = distinct !DISubprogram(name: "c_isdigit", scope: !1212, file: !1212, line: 233, type: !1213, scopeLine: 234, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1215)
!1212 = !DIFile(filename: "./lib/c-ctype.h", directory: "/src", checksumkind: CSK_MD5, checksum: "ae3bc10b98afd74391aea9e3c38adcb1")
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!195, !93}
!1215 = !{!1210}
!1216 = !DILocation(line: 0, scope: !1211, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 347, column: 40, scope: !1204)
!1218 = !DILocation(line: 235, column: 3, scope: !1211, inlinedAt: !1217)
!1219 = !DILocation(line: 347, column: 7, scope: !1175)
!1220 = !DILocation(line: 353, column: 17, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1204, file: !2, line: 348, column: 5)
!1222 = !DILocation(line: 353, column: 15, scope: !1221)
!1223 = !DILocation(line: 355, column: 11, scope: !1221)
!1224 = !DILocation(line: 356, column: 5, scope: !1221)
!1225 = !DILocation(line: 358, column: 3, scope: !1175)
!1226 = !DILocation(line: 358, column: 21, scope: !1175)
!1227 = !DILocation(line: 0, scope: !1211, inlinedAt: !1228)
!1228 = distinct !DILocation(line: 364, column: 13, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1230, file: !2, line: 364, column: 13)
!1230 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 362, column: 7)
!1231 = !DILocation(line: 235, column: 3, scope: !1211, inlinedAt: !1228)
!1232 = !DILocation(line: 364, column: 13, scope: !1230)
!1233 = !DILocation(line: 365, column: 11, scope: !1229)
!1234 = !DILocation(line: 368, column: 9, scope: !1230)
!1235 = !DILocation(line: 371, column: 15, scope: !1230)
!1236 = !DILocation(line: 372, column: 9, scope: !1230)
!1237 = !DILocation(line: 375, column: 15, scope: !1230)
!1238 = !DILocation(line: 376, column: 9, scope: !1230)
!1239 = !DILocation(line: 379, column: 16, scope: !1230)
!1240 = !DILocation(line: 380, column: 9, scope: !1230)
!1241 = !DILocation(line: 383, column: 17, scope: !1230)
!1242 = !DILocation(line: 384, column: 9, scope: !1230)
!1243 = !DILocation(line: 387, column: 28, scope: !1230)
!1244 = !DILocation(line: 388, column: 9, scope: !1230)
!1245 = distinct !{!1245, !1225, !1246, !1075}
!1246 = !DILocation(line: 402, column: 7, scope: !1175)
!1247 = !DILocation(line: 391, column: 29, scope: !1230)
!1248 = !DILocation(line: 392, column: 9, scope: !1230)
!1249 = !DILocation(line: 395, column: 21, scope: !1230)
!1250 = !DILocalVariable(name: "p", arg: 1, scope: !1251, file: !2, line: 468, type: !144)
!1251 = distinct !DISubprogram(name: "set_prefix", scope: !2, file: !2, line: 468, type: !1252, scopeLine: 469, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !89, retainedNodes: !1254)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !144}
!1254 = !{!1250, !1255}
!1255 = !DILocalVariable(name: "s", scope: !1251, file: !2, line: 470, type: !144)
!1256 = !DILocation(line: 0, scope: !1251, inlinedAt: !1257)
!1257 = distinct !DILocation(line: 395, column: 9, scope: !1230)
!1258 = !DILocation(line: 472, column: 21, scope: !1251, inlinedAt: !1257)
!1259 = !DILocation(line: 473, column: 10, scope: !1251, inlinedAt: !1257)
!1260 = !DILocation(line: 473, column: 13, scope: !1251, inlinedAt: !1257)
!1261 = !DILocation(line: 473, column: 3, scope: !1251, inlinedAt: !1257)
!1262 = !DILocation(line: 475, column: 24, scope: !1263, inlinedAt: !1257)
!1263 = distinct !DILexicalBlock(scope: !1251, file: !2, line: 474, column: 5)
!1264 = !DILocation(line: 476, column: 8, scope: !1263, inlinedAt: !1257)
!1265 = distinct !{!1265, !1261, !1266, !1075}
!1266 = !DILocation(line: 477, column: 5, scope: !1251, inlinedAt: !1257)
!1267 = !DILocation(line: 478, column: 10, scope: !1251, inlinedAt: !1257)
!1268 = !DILocation(line: 479, column: 24, scope: !1251, inlinedAt: !1257)
!1269 = !DILocation(line: 479, column: 22, scope: !1251, inlinedAt: !1257)
!1270 = !DILocation(line: 480, column: 9, scope: !1251, inlinedAt: !1257)
!1271 = !DILocation(line: 481, column: 3, scope: !1251, inlinedAt: !1257)
!1272 = !DILocation(line: 481, column: 12, scope: !1251, inlinedAt: !1257)
!1273 = !DILocation(line: 481, column: 16, scope: !1251, inlinedAt: !1257)
!1274 = !DILocation(line: 481, column: 19, scope: !1251, inlinedAt: !1257)
!1275 = !DILocation(line: 481, column: 25, scope: !1251, inlinedAt: !1257)
!1276 = distinct !{!1276, !1271, !1277, !1075}
!1277 = !DILocation(line: 482, column: 6, scope: !1251, inlinedAt: !1257)
!1278 = !DILocation(line: 483, column: 6, scope: !1251, inlinedAt: !1257)
!1279 = !DILocation(line: 484, column: 21, scope: !1251, inlinedAt: !1257)
!1280 = !DILocation(line: 484, column: 19, scope: !1251, inlinedAt: !1257)
!1281 = !DILocation(line: 484, column: 17, scope: !1251, inlinedAt: !1257)
!1282 = !DILocation(line: 396, column: 9, scope: !1230)
!1283 = !DILocation(line: 398, column: 7, scope: !1230)
!1284 = !DILocation(line: 400, column: 7, scope: !1230)
!1285 = !DILocation(line: 404, column: 7, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1175, file: !2, line: 404, column: 7)
!1287 = !DILocation(line: 404, column: 7, scope: !1175)
!1288 = !DILocation(line: 409, column: 31, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1286, file: !2, line: 405, column: 5)
!1290 = !DILocation(line: 408, column: 19, scope: !1289)
