; ModuleID = 'src/fold.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [60 x i8] c"Wrap input lines in each FILE, writing to standard output.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"fold\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [56 x i8] c"  -b, --bytes\0A         count bytes rather than columns\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [66 x i8] c"  -c, --characters\0A         count characters rather than columns\0A\00", align 1, !dbg !27

!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !49, !54, !59, !146, !151, !156, !161, !166, !169, !171, !173, !178, !260, !262, !264, !269, !274, !276, !278, !280, !285, !287, !289, !291, !296, !301, !303, !305, !307, !309, !311, !313, !318, !323, !328, !333, !335, !337, !339, !341, !343, !348, !350, !352, !357, !362, !367, !64, !372, !374, !379, !381, !383, !385, !387, !399, !401, !458, !460, !462, !464, !466}
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !2, line: 334, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 26)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 14)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 16)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 2)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "break_spaces", scope: !66, file: !2, line: 40, type: !168, isLocal: true, isDefinition: true)
!168 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !66, file: !2, line: 51, type: !168, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !82, line: 729, type: !24, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !82, line: 736, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 75)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !180, file: !82, line: 575, type: !83, isLocal: true, isDefinition: true)
!180 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !181, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !183)
!181 = !DISubroutineType(cc: DW_CC_nocall, types: !182)
!182 = !{null, !142, !142}
!183 = !{!184, !185, !186, !189, !190, !191, !192, !196, !197, !198, !199, !201, !254, !255, !256, !258, !259}
!184 = !DILocalVariable(name: "program", arg: 1, scope: !180, file: !82, line: 573, type: !142)
!185 = !DILocalVariable(name: "option", arg: 2, scope: !180, file: !82, line: 573, type: !142)
!186 = !DILocalVariable(name: "term", scope: !187, file: !82, line: 585, type: !142)
!187 = distinct !DILexicalBlock(scope: !188, file: !82, line: 582, column: 5)
!188 = distinct !DILexicalBlock(scope: !180, file: !82, line: 581, column: 7)
!189 = !DILocalVariable(name: "double_space", scope: !180, file: !82, line: 594, type: !168)
!190 = !DILocalVariable(name: "first_word", scope: !180, file: !82, line: 595, type: !142)
!191 = !DILocalVariable(name: "option_text", scope: !180, file: !82, line: 596, type: !142)
!192 = !DILocalVariable(name: "s", scope: !193, file: !82, line: 608, type: !142)
!193 = distinct !DILexicalBlock(scope: !194, file: !82, line: 605, column: 5)
!194 = distinct !DILexicalBlock(scope: !195, file: !82, line: 604, column: 12)
!195 = distinct !DILexicalBlock(scope: !180, file: !82, line: 597, column: 7)
!196 = !DILocalVariable(name: "spaces", scope: !193, file: !82, line: 609, type: !139)
!197 = !DILocalVariable(name: "anchor_len", scope: !180, file: !82, line: 620, type: !139)
!198 = !DILocalVariable(name: "desc_text", scope: !180, file: !82, line: 625, type: !142)
!199 = !DILocalVariable(name: "__ptr", scope: !200, file: !82, line: 644, type: !142)
!200 = distinct !DILexicalBlock(scope: !180, file: !82, line: 644, column: 3)
!201 = !DILocalVariable(name: "__stream", scope: !200, file: !82, line: 644, type: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !204, line: 7, baseType: !205)
!204 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !206, line: 49, size: 1728, elements: !207)
!206 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !223, !225, !226, !227, !231, !232, !234, !235, !238, !240, !243, !246, !247, !248, !249, !250}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !205, file: !206, line: 51, baseType: !83, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !205, file: !206, line: 54, baseType: !136, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !205, file: !206, line: 55, baseType: !136, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !205, file: !206, line: 56, baseType: !136, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !205, file: !206, line: 57, baseType: !136, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !205, file: !206, line: 58, baseType: !136, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !205, file: !206, line: 59, baseType: !136, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !205, file: !206, line: 60, baseType: !136, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !205, file: !206, line: 61, baseType: !136, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !205, file: !206, line: 64, baseType: !136, size: 64, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !205, file: !206, line: 65, baseType: !136, size: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !205, file: !206, line: 66, baseType: !136, size: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !205, file: !206, line: 68, baseType: !221, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !206, line: 36, flags: DIFlagFwdDecl)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !205, file: !206, line: 70, baseType: !224, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !205, file: !206, line: 72, baseType: !83, size: 32, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !205, file: !206, line: 73, baseType: !83, size: 32, offset: 928)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !205, file: !206, line: 74, baseType: !228, size: 64, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !229, line: 152, baseType: !230)
!229 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!230 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !205, file: !206, line: 77, baseType: !138, size: 16, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !205, file: !206, line: 78, baseType: !233, size: 8, offset: 1040)
!233 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !205, file: !206, line: 79, baseType: !51, size: 8, offset: 1048)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !205, file: !206, line: 81, baseType: !236, size: 64, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !206, line: 43, baseType: null)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !205, file: !206, line: 89, baseType: !239, size: 64, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !229, line: 153, baseType: !230)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !205, file: !206, line: 91, baseType: !241, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !206, line: 37, flags: DIFlagFwdDecl)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !205, file: !206, line: 92, baseType: !244, size: 64, offset: 1280)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !206, line: 38, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !205, file: !206, line: 93, baseType: !224, size: 64, offset: 1344)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !205, file: !206, line: 94, baseType: !137, size: 64, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !205, file: !206, line: 95, baseType: !139, size: 64, offset: 1472)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !205, file: !206, line: 96, baseType: !83, size: 32, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !205, file: !206, line: 98, baseType: !251, size: 160, offset: 1568)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 20)
!254 = !DILocalVariable(name: "__cnt", scope: !200, file: !82, line: 644, type: !139)
!255 = !DILocalVariable(name: "url_program", scope: !180, file: !82, line: 648, type: !142)
!256 = !DILocalVariable(name: "__ptr", scope: !257, file: !82, line: 686, type: !142)
!257 = distinct !DILexicalBlock(scope: !180, file: !82, line: 686, column: 3)
!258 = !DILocalVariable(name: "__stream", scope: !257, file: !82, line: 686, type: !202)
!259 = !DILocalVariable(name: "__cnt", scope: !257, file: !82, line: 686, type: !139)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !82, line: 585, type: !19, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !82, line: 586, type: !19, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !82, line: 595, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(scope: null, file: !82, line: 620, type: !271, isLocal: true, isDefinition: true)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 6)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !163, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !19, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !266, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 3)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !82, line: 650, type: !19, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !271, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !271, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !82, line: 652, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 7)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !82, line: 653, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 8)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !82, line: 654, type: !56, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !82, line: 655, type: !56, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !82, line: 656, type: !56, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !82, line: 657, type: !56, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !82, line: 663, type: !293, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !82, line: 664, type: !56, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 17)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 40)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 15)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 61)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !82, line: 679, type: !282, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !82, line: 683, type: !19, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !82, line: 688, type: !19, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !82, line: 691, type: !298, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !82, line: 839, type: !158, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !82, line: 840, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 22)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !82, line: 841, type: !325, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !82, line: 862, type: !266, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !82, line: 868, type: !354, isLocal: true, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 71)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !82, line: 875, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 27)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !364, isLocal: true, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 51)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 12)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !271, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 61, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 11)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !293, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !271, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !19, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !298, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "longopts", scope: !66, file: !2, line: 58, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1792, elements: !294)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !392, line: 50, size: 256, elements: !393)
!392 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!393 = !{!394, !395, !396, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 52, baseType: !142, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !391, file: !392, line: 55, baseType: !83, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !392, line: 56, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !391, file: !392, line: 57, baseType: !83, size: 32, offset: 192)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "counting_mode", scope: !66, file: !2, line: 48, type: !68, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "line_out", scope: !403, file: !2, line: 164, type: !455, isLocal: true, isDefinition: true)
!403 = distinct !DISubprogram(name: "fold_file", scope: !2, file: !2, line: 159, type: !404, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!168, !142, !139}
!406 = !{!407, !408, !409, !410, !411, !415, !425, !426, !437, !443, !444, !445, !446, !448, !451, !452, !454}
!407 = !DILocalVariable(name: "filename", arg: 1, scope: !403, file: !2, line: 159, type: !142)
!408 = !DILocalVariable(name: "width", arg: 2, scope: !403, file: !2, line: 159, type: !139)
!409 = !DILocalVariable(name: "istream", scope: !403, file: !2, line: 161, type: !202)
!410 = !DILocalVariable(name: "column", scope: !403, file: !2, line: 162, type: !139)
!411 = !DILocalVariable(name: "offset_out", scope: !403, file: !2, line: 163, type: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !413, line: 130, baseType: !414)
!413 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !140, line: 35, baseType: !230)
!415 = !DILocalVariable(name: "mbbuf", scope: !403, file: !2, line: 166, type: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbbuf_t", file: !417, line: 50, baseType: !418)
!417 = !DIFile(filename: "./lib/mbbuf.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0ec2f2727b8356ce94eb797f3e7bb5fd")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 43, size: 320, elements: !419)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !418, file: !417, line: 45, baseType: !136, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !418, file: !417, line: 46, baseType: !202, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !418, file: !417, line: 47, baseType: !412, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !418, file: !417, line: 48, baseType: !412, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !418, file: !417, line: 49, baseType: !412, size: 64, offset: 256)
!425 = !DILocalVariable(name: "saved_errno", scope: !403, file: !2, line: 167, type: !83)
!426 = !DILocalVariable(name: "g", scope: !403, file: !2, line: 186, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "mcel_t", file: !126, line: 143, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 138, size: 64, elements: !429)
!429 = !{!430, !435, !436}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ch", scope: !428, file: !126, line: 140, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !432, line: 37, baseType: !433)
!432 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !229, line: 57, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !229, line: 42, baseType: !69)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !428, file: !126, line: 141, baseType: !144, size: 8, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !428, file: !126, line: 142, baseType: !144, size: 8, offset: 40)
!437 = !DILocalVariable(name: "space_length", scope: !438, file: !2, line: 205, type: !83)
!438 = distinct !DILexicalBlock(scope: !439, file: !2, line: 204, column: 13)
!439 = distinct !DILexicalBlock(scope: !440, file: !2, line: 203, column: 15)
!440 = distinct !DILexicalBlock(scope: !441, file: !2, line: 199, column: 9)
!441 = distinct !DILexicalBlock(scope: !442, file: !2, line: 198, column: 11)
!442 = distinct !DILexicalBlock(scope: !403, file: !2, line: 188, column: 5)
!443 = !DILocalVariable(name: "logical_end", scope: !438, file: !2, line: 206, type: !412)
!444 = !DILocalVariable(name: "logical_p", scope: !438, file: !2, line: 207, type: !136)
!445 = !DILocalVariable(name: "logical_lim", scope: !438, file: !2, line: 208, type: !136)
!446 = !DILocalVariable(name: "g2", scope: !447, file: !2, line: 210, type: !427)
!447 = distinct !DILexicalBlock(scope: !438, file: !2, line: 210, column: 15)
!448 = !DILocalVariable(name: "printed_p", scope: !449, file: !2, line: 231, type: !136)
!449 = distinct !DILexicalBlock(scope: !450, file: !2, line: 221, column: 17)
!450 = distinct !DILexicalBlock(scope: !438, file: !2, line: 220, column: 19)
!451 = !DILocalVariable(name: "printed_lim", scope: !449, file: !2, line: 232, type: !136)
!452 = !DILocalVariable(name: "g2", scope: !453, file: !2, line: 233, type: !427)
!453 = distinct !DILexicalBlock(scope: !449, file: !2, line: 233, column: 19)
!454 = !DILabel(scope: !442, name: "rescan", file: !2, line: 195)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2097152, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 262144)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "line_in", scope: !403, file: !2, line: 165, type: !455, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !2, line: 175, type: !163, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !2, line: 179, type: !282, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !82, line: 952, type: !369, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "last_character_width", scope: !66, file: !2, line: 54, type: !83, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 288, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 36)
!471 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!472 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !475, line: 3, type: !325, isLocal: true, isDefinition: true)
!475 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "Version", scope: !478, file: !475, line: 3, type: !142, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C11, file: !475, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !479, splitDebugInlining: false, nameTableKind: None)
!479 = !{!473, !476}
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "file_name", scope: !482, file: !483, line: 45, type: !142, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C11, file: !483, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !484, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!484 = !{!485, !487, !489, !491, !480, !493}
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !483, line: 121, type: !293, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !483, line: 121, type: !369, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !483, line: 123, type: !293, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !483, line: 126, type: !282, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !482, file: !483, line: 55, type: !168, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !497, file: !498, line: 66, type: !549, isLocal: false, isDefinition: true)
!497 = distinct !DICompileUnit(language: DW_LANG_C11, file: !498, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !499, globals: !500, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!499 = !{!137, !144}
!500 = !{!501, !503, !528, !530, !532, !534, !495, !536, !538, !540, !542, !547}
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !498, line: 272, type: !19, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "old_file_name", scope: !505, file: !498, line: 304, type: !142, isLocal: true, isDefinition: true)
!505 = distinct !DISubprogram(name: "verror_at_line", scope: !498, file: !498, line: 298, type: !506, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !497, retainedNodes: !521)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !83, !83, !142, !69, !142, !508}
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !509, line: 52, baseType: !510)
!509 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !511, line: 14, baseType: !512)
!511 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !513, baseType: !514)
!513 = !DIFile(filename: "lib/error.c", directory: "/src")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !514, file: !513, baseType: !137, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !514, file: !513, baseType: !137, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !514, file: !513, baseType: !137, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !514, file: !513, baseType: !83, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !514, file: !513, baseType: !83, size: 32, offset: 224)
!521 = !{!522, !523, !524, !525, !526, !527}
!522 = !DILocalVariable(name: "status", arg: 1, scope: !505, file: !498, line: 298, type: !83)
!523 = !DILocalVariable(name: "errnum", arg: 2, scope: !505, file: !498, line: 298, type: !83)
!524 = !DILocalVariable(name: "file_name", arg: 3, scope: !505, file: !498, line: 298, type: !142)
!525 = !DILocalVariable(name: "line_number", arg: 4, scope: !505, file: !498, line: 298, type: !69)
!526 = !DILocalVariable(name: "message", arg: 5, scope: !505, file: !498, line: 298, type: !142)
!527 = !DILocalVariable(name: "args", arg: 6, scope: !505, file: !498, line: 298, type: !508)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "old_line_number", scope: !505, file: !498, line: 305, type: !69, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !498, line: 338, type: !266, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !498, line: 346, type: !298, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !498, line: 346, type: !163, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "error_message_count", scope: !497, file: !498, line: 69, type: !69, isLocal: false, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !497, file: !498, line: 295, type: !83, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !498, line: 208, type: !293, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !498, line: 208, type: !544, isLocal: true, isDefinition: true)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 21)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !498, line: 214, type: !19, isLocal: true, isDefinition: true)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{null}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "program_name", scope: !554, file: !555, line: 31, type: !142, isLocal: false, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C11, file: !555, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !556, globals: !557, splitDebugInlining: false, nameTableKind: None)
!555 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!556 = !{!136}
!557 = !{!552, !558, !560}
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !555, line: 46, type: !298, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !555, line: 49, type: !266, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "utf07FF", scope: !564, file: !565, line: 46, type: !588, isLocal: true, isDefinition: true)
!564 = distinct !DISubprogram(name: "proper_name_lite", scope: !565, file: !565, line: 38, type: !566, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !568, retainedNodes: !570)
!565 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!566 = !DISubroutineType(types: !567)
!567 = !{!142, !142, !142}
!568 = distinct !DICompileUnit(language: DW_LANG_C11, file: !565, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !569, splitDebugInlining: false, nameTableKind: None)
!569 = !{!562}
!570 = !{!571, !572, !573, !574, !575}
!571 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !564, file: !565, line: 38, type: !142)
!572 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !564, file: !565, line: 38, type: !142)
!573 = !DILocalVariable(name: "translation", scope: !564, file: !565, line: 40, type: !142)
!574 = !DILocalVariable(name: "w", scope: !564, file: !565, line: 47, type: !431)
!575 = !DILocalVariable(name: "mbs", scope: !564, file: !565, line: 48, type: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !577, line: 6, baseType: !578)
!577 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !579, line: 21, baseType: !580)
!579 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 13, size: 64, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !580, file: !579, line: 15, baseType: !83, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !580, file: !579, line: 20, baseType: !584, size: 32, offset: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !579, line: 16, size: 32, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !584, file: !579, line: 18, baseType: !69, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !584, file: !579, line: 19, baseType: !266, size: 32)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 16, elements: !164)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !591, line: 78, type: !298, isLocal: true, isDefinition: true)
!591 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !591, line: 79, type: !271, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !591, line: 80, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 13)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !591, line: 81, type: !596, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !591, line: 82, type: !251, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !591, line: 83, type: !163, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !591, line: 84, type: !298, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !591, line: 85, type: !293, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !591, line: 86, type: !293, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !591, line: 87, type: !298, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !615, file: !591, line: 76, type: !687, isLocal: false, isDefinition: true)
!615 = distinct !DICompileUnit(language: DW_LANG_C11, file: !591, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !622, globals: !623, splitDebugInlining: false, nameTableKind: None)
!616 = !{!102, !617, !87}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !103, line: 254, baseType: !69, size: 32, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!620 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!621 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!622 = !{!83, !138, !139}
!623 = !{!589, !592, !594, !599, !601, !603, !605, !607, !609, !611, !613, !624, !628, !638, !640, !645, !647, !649, !651, !653, !676, !683, !685}
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !615, file: !591, line: 92, type: !626, isLocal: false, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 320, elements: !57)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !615, file: !591, line: 1040, type: !630, isLocal: false, isDefinition: true)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !591, line: 56, size: 448, elements: !631)
!631 = !{!632, !633, !634, !636, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !630, file: !591, line: 59, baseType: !102, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !591, line: 62, baseType: !83, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !630, file: !591, line: 66, baseType: !635, size: 256, offset: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !299)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !630, file: !591, line: 69, baseType: !142, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !630, file: !591, line: 72, baseType: !142, size: 64, offset: 384)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !615, file: !591, line: 107, type: !630, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "slot0", scope: !615, file: !591, line: 831, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 256)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !591, line: 321, type: !163, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !591, line: 357, type: !163, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !591, line: 358, type: !163, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !591, line: 199, type: !293, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "quote", scope: !655, file: !591, line: 228, type: !674, isLocal: true, isDefinition: true)
!655 = distinct !DISubprogram(name: "gettext_quote", scope: !591, file: !591, line: 197, type: !656, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !615, retainedNodes: !658)
!656 = !DISubroutineType(types: !657)
!657 = !{!142, !142, !102}
!658 = !{!659, !660, !661, !662, !663}
!659 = !DILocalVariable(name: "msgid", arg: 1, scope: !655, file: !591, line: 197, type: !142)
!660 = !DILocalVariable(name: "s", arg: 2, scope: !655, file: !591, line: 197, type: !102)
!661 = !DILocalVariable(name: "translation", scope: !655, file: !591, line: 199, type: !142)
!662 = !DILocalVariable(name: "w", scope: !655, file: !591, line: 229, type: !431)
!663 = !DILocalVariable(name: "mbs", scope: !655, file: !591, line: 230, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !577, line: 6, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !579, line: 21, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 13, size: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !666, file: !579, line: 15, baseType: !83, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !666, file: !579, line: 20, baseType: !670, size: 32, offset: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !666, file: !579, line: 16, size: 32, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !670, file: !579, line: 18, baseType: !69, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !670, file: !579, line: 19, baseType: !266, size: 32)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !675)
!675 = !{!165, !268}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "slotvec", scope: !615, file: !591, line: 834, type: !678, isLocal: true, isDefinition: true)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !591, line: 823, size: 128, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !679, file: !591, line: 825, baseType: !139, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !679, file: !591, line: 826, baseType: !136, size: 64, offset: 64)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "nslots", scope: !615, file: !591, line: 832, type: !83, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "slotvec0", scope: !615, file: !591, line: 833, type: !679, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 704, elements: !377)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !691, line: 67, type: !369, isLocal: true, isDefinition: true)
!691 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !691, line: 69, type: !293, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !691, line: 83, type: !293, isLocal: true, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !691, line: 83, type: !266, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !691, line: 85, type: !163, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !691, line: 88, type: !702, isLocal: true, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 171)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !691, line: 88, type: !707, isLocal: true, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 34)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !691, line: 105, type: !158, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !691, line: 109, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 23)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !691, line: 113, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 28)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !691, line: 120, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 32)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(scope: null, file: !691, line: 127, type: !729, isLocal: true, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !469)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !691, line: 134, type: !320, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !691, line: 142, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 44)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !691, line: 150, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 48)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !691, line: 159, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 52)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !691, line: 170, type: !14, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !691, line: 248, type: !251, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !691, line: 248, type: !345, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !251, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !153, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !691, line: 254, type: !320, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !691, line: 259, type: !3, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !691, line: 259, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 29)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !768, file: !769, line: 26, type: !771, isLocal: false, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !770, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!770 = !{!766}
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 376, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 47)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "exit_failure", scope: !776, file: !777, line: 24, type: !779, isLocal: false, isDefinition: true)
!776 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !778, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!778 = !{!774}
!779 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !782, line: 34, type: !282, isLocal: true, isDefinition: true)
!782 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !782, line: 34, type: !293, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !782, line: 34, type: !315, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !789, line: 80, type: !293, isLocal: true, isDefinition: true)
!789 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !792, line: 108, type: !51, isLocal: true, isDefinition: true)
!792 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "internal_state", scope: !795, file: !792, line: 97, type: !798, isLocal: true, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C11, file: !792, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !796, globals: !797, splitDebugInlining: false, nameTableKind: None)
!796 = !{!137, !139, !144}
!797 = !{!790, !793}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !577, line: 6, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !579, line: 21, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !579, line: 13, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !800, file: !579, line: 15, baseType: !83, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !800, file: !579, line: 20, baseType: !804, size: 32, offset: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !800, file: !579, line: 16, size: 32, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !804, file: !579, line: 18, baseType: !69, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !804, file: !579, line: 19, baseType: !266, size: 32)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !810, line: 35, type: !163, isLocal: true, isDefinition: true)
!810 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !810, line: 35, type: !271, isLocal: true, isDefinition: true)
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !815, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!815 = !{!116}
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !819, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!820 = !{!137}
!821 = distinct !DICompileUnit(language: DW_LANG_C11, file: !822, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!822 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !824, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!827 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !828, retainedTypes: !820, globals: !832, splitDebugInlining: false, nameTableKind: None)
!828 = !{!829}
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !691, line: 40, baseType: !69, size: 32, elements: !830)
!830 = !{!831}
!831 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!832 = !{!689, !692, !694, !696, !698, !700, !705, !710, !712, !717, !722, !727, !730, !732, !737, !742, !747, !749, !751, !753, !755, !757, !759, !761}
!833 = distinct !DICompileUnit(language: DW_LANG_C11, file: !834, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !835, retainedTypes: !863, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!835 = !{!836, !848}
!836 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !837, file: !834, line: 188, baseType: !69, size: 32, elements: !846)
!837 = distinct !DISubprogram(name: "x2nrealloc", scope: !834, file: !834, line: 176, type: !838, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !833, retainedNodes: !841)
!838 = !DISubroutineType(types: !839)
!839 = !{!137, !137, !840, !139}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!841 = !{!842, !843, !844, !845}
!842 = !DILocalVariable(name: "p", arg: 1, scope: !837, file: !834, line: 176, type: !137)
!843 = !DILocalVariable(name: "pn", arg: 2, scope: !837, file: !834, line: 176, type: !840)
!844 = !DILocalVariable(name: "s", arg: 3, scope: !837, file: !834, line: 176, type: !139)
!845 = !DILocalVariable(name: "n", scope: !837, file: !834, line: 178, type: !139)
!846 = !{!847}
!847 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !849, file: !834, line: 228, baseType: !69, size: 32, elements: !846)
!849 = distinct !DISubprogram(name: "xpalloc", scope: !834, file: !834, line: 223, type: !850, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !833, retainedNodes: !853)
!850 = !DISubroutineType(types: !851)
!851 = !{!137, !137, !852, !412, !414, !412}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862}
!854 = !DILocalVariable(name: "pa", arg: 1, scope: !849, file: !834, line: 223, type: !137)
!855 = !DILocalVariable(name: "pn", arg: 2, scope: !849, file: !834, line: 223, type: !852)
!856 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !849, file: !834, line: 223, type: !412)
!857 = !DILocalVariable(name: "n_max", arg: 4, scope: !849, file: !834, line: 223, type: !414)
!858 = !DILocalVariable(name: "s", arg: 5, scope: !849, file: !834, line: 223, type: !412)
!859 = !DILocalVariable(name: "n0", scope: !849, file: !834, line: 230, type: !412)
!860 = !DILocalVariable(name: "n", scope: !849, file: !834, line: 237, type: !412)
!861 = !DILocalVariable(name: "nbytes", scope: !849, file: !834, line: 248, type: !412)
!862 = !DILocalVariable(name: "adjusted_nbytes", scope: !849, file: !834, line: 252, type: !412)
!863 = !{!136, !137, !168, !230, !141}
!864 = distinct !DICompileUnit(language: DW_LANG_C11, file: !782, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !865, splitDebugInlining: false, nameTableKind: None)
!865 = !{!780, !783, !785}
!866 = distinct !DICompileUnit(language: DW_LANG_C11, file: !867, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !868, globals: !877, splitDebugInlining: false, nameTableKind: None)
!867 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!868 = !{!869, !74}
!869 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !870, line: 30, baseType: !69, size: 32, elements: !871)
!870 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!871 = !{!872, !873, !874, !875, !876}
!872 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!873 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!874 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!875 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!876 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!877 = !{!787}
!878 = distinct !DICompileUnit(language: DW_LANG_C11, file: !879, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !881, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!880 = !{!869, !87}
!881 = !{!83, !138, !136, !168, !141, !882}
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !883, line: 102, baseType: !884)
!883 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !229, line: 73, baseType: !141)
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !886, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!887 = distinct !DICompileUnit(language: DW_LANG_C11, file: !888, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!889 = distinct !DICompileUnit(language: DW_LANG_C11, file: !890, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !891, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!891 = !{!168, !141, !137}
!892 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !893, splitDebugInlining: false, nameTableKind: None)
!893 = !{!808, !811}
!894 = distinct !DICompileUnit(language: DW_LANG_C11, file: !895, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!896 = distinct !DICompileUnit(language: DW_LANG_C11, file: !897, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!898 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!899 = !{i32 7, !"Dwarf Version", i32 5}
!900 = !{i32 2, !"Debug Info Version", i32 3}
!901 = !{i32 1, !"wchar_size", i32 4}
!902 = !{i32 8, !"PIC Level", i32 2}
!903 = !{i32 7, !"PIE Level", i32 2}
!904 = !{i32 7, !"uwtable", i32 2}
!905 = !{i32 7, !"frame-pointer", i32 1}
!906 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 70, type: !907, scopeLine: 71, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !83}
!909 = !{!910}
!910 = !DILocalVariable(name: "status", arg: 1, scope: !906, file: !2, line: 70, type: !83)
!911 = !DILocation(line: 0, scope: !906)
!912 = !DILocation(line: 72, column: 14, scope: !913)
!913 = distinct !DILexicalBlock(scope: !906, file: !2, line: 72, column: 7)
!914 = !DILocation(line: 72, column: 7, scope: !906)
!915 = !DILocation(line: 73, column: 5, scope: !916)
!916 = distinct !DILexicalBlock(scope: !913, file: !2, line: 73, column: 5)
!917 = !{!918, !918, i64 0}
!918 = !{!"any pointer", !919, i64 0}
!919 = !{!"omnipotent char", !920, i64 0}
!920 = !{!"Simple C/C++ TBAA"}
!921 = !DILocation(line: 76, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !913, file: !2, line: 75, column: 5)
!923 = !DILocation(line: 80, column: 7, scope: !922)
!924 = !DILocation(line: 729, column: 3, scope: !925, inlinedAt: !927)
!925 = distinct !DISubprogram(name: "emit_stdin_note", scope: !82, file: !82, line: 727, type: !550, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !926)
!926 = !{}
!927 = distinct !DILocation(line: 84, column: 7, scope: !922)
!928 = !DILocation(line: 736, column: 3, scope: !929, inlinedAt: !930)
!929 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !82, file: !82, line: 734, type: !550, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !926)
!930 = distinct !DILocation(line: 85, column: 7, scope: !922)
!931 = !DILocation(line: 87, column: 7, scope: !922)
!932 = !DILocation(line: 91, column: 7, scope: !922)
!933 = !DILocation(line: 95, column: 7, scope: !922)
!934 = !DILocation(line: 99, column: 7, scope: !922)
!935 = !DILocation(line: 103, column: 7, scope: !922)
!936 = !DILocation(line: 104, column: 7, scope: !922)
!937 = !DILocalVariable(name: "program", arg: 1, scope: !938, file: !82, line: 836, type: !142)
!938 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !82, file: !82, line: 836, type: !939, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !941)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !142}
!941 = !{!937, !942, !949, !950, !952, !953}
!942 = !DILocalVariable(name: "infomap", scope: !938, file: !82, line: 838, type: !943)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 896, elements: !294)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !938, file: !82, line: 838, size: 128, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !945, file: !82, line: 838, baseType: !142, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !945, file: !82, line: 838, baseType: !142, size: 64, offset: 64)
!949 = !DILocalVariable(name: "node", scope: !938, file: !82, line: 848, type: !142)
!950 = !DILocalVariable(name: "map_prog", scope: !938, file: !82, line: 849, type: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!952 = !DILocalVariable(name: "lc_messages", scope: !938, file: !82, line: 861, type: !142)
!953 = !DILocalVariable(name: "url_program", scope: !938, file: !82, line: 874, type: !142)
!954 = !DILocation(line: 0, scope: !938, inlinedAt: !955)
!955 = distinct !DILocation(line: 105, column: 7, scope: !922)
!956 = !DILocation(line: 857, column: 3, scope: !938, inlinedAt: !955)
!957 = !DILocation(line: 861, column: 29, scope: !938, inlinedAt: !955)
!958 = !DILocation(line: 862, column: 7, scope: !959, inlinedAt: !955)
!959 = distinct !DILexicalBlock(scope: !938, file: !82, line: 862, column: 7)
!960 = !DILocation(line: 862, column: 19, scope: !959, inlinedAt: !955)
!961 = !DILocation(line: 862, column: 22, scope: !959, inlinedAt: !955)
!962 = !DILocation(line: 862, column: 7, scope: !938, inlinedAt: !955)
!963 = !DILocation(line: 868, column: 7, scope: !964, inlinedAt: !955)
!964 = distinct !DILexicalBlock(scope: !959, file: !82, line: 863, column: 5)
!965 = !DILocation(line: 870, column: 5, scope: !964, inlinedAt: !955)
!966 = !DILocation(line: 875, column: 3, scope: !938, inlinedAt: !955)
!967 = !DILocation(line: 877, column: 3, scope: !938, inlinedAt: !955)
!968 = !DILocation(line: 107, column: 3, scope: !906)
!969 = !DISubprogram(name: "dcgettext", scope: !970, file: !970, line: 51, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!970 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!971 = !DISubroutineType(types: !972)
!972 = !{!136, !142, !142, !83}
!973 = !DISubprogram(name: "__fprintf_chk", scope: !974, file: !974, line: 93, type: !975, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!974 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!975 = !DISubroutineType(types: !976)
!976 = !{!83, !977, !83, !978, null}
!977 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !202)
!978 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!979 = !DISubprogram(name: "__printf_chk", scope: !974, file: !974, line: 95, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!980 = !DISubroutineType(types: !981)
!981 = !{!83, !83, !978, null}
!982 = !DISubprogram(name: "fputs_unlocked", scope: !509, file: !509, line: 691, type: !983, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!983 = !DISubroutineType(types: !984)
!984 = !{!83, !978, !977}
!985 = !DILocation(line: 0, scope: !180)
!986 = !DILocation(line: 581, column: 7, scope: !188)
!987 = !{!988, !988, i64 0}
!988 = !{!"int", !919, i64 0}
!989 = !DILocation(line: 581, column: 19, scope: !188)
!990 = !DILocation(line: 581, column: 7, scope: !180)
!991 = !DILocation(line: 585, column: 26, scope: !187)
!992 = !DILocation(line: 0, scope: !187)
!993 = !DILocation(line: 586, column: 23, scope: !187)
!994 = !DILocation(line: 586, column: 28, scope: !187)
!995 = !DILocation(line: 586, column: 32, scope: !187)
!996 = !{!919, !919, i64 0}
!997 = !DILocation(line: 586, column: 38, scope: !187)
!998 = !DILocalVariable(name: "__s1", arg: 1, scope: !999, file: !1000, line: 1359, type: !142)
!999 = distinct !DISubprogram(name: "streq", scope: !1000, file: !1000, line: 1359, type: !1001, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1003)
!1000 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!168, !142, !142}
!1003 = !{!998, !1004}
!1004 = !DILocalVariable(name: "__s2", arg: 2, scope: !999, file: !1000, line: 1359, type: !142)
!1005 = !DILocation(line: 0, scope: !999, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 586, column: 41, scope: !187)
!1007 = !DILocation(line: 1361, column: 11, scope: !999, inlinedAt: !1006)
!1008 = !DILocation(line: 1361, column: 10, scope: !999, inlinedAt: !1006)
!1009 = !DILocation(line: 586, column: 19, scope: !187)
!1010 = !DILocation(line: 587, column: 5, scope: !187)
!1011 = !DILocation(line: 588, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !180, file: !82, line: 588, column: 7)
!1013 = !DILocation(line: 588, column: 7, scope: !180)
!1014 = !DILocation(line: 590, column: 7, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1012, file: !82, line: 589, column: 5)
!1016 = !DILocation(line: 591, column: 7, scope: !1015)
!1017 = !DILocation(line: 595, column: 37, scope: !180)
!1018 = !DILocation(line: 595, column: 35, scope: !180)
!1019 = !DILocation(line: 596, column: 29, scope: !180)
!1020 = !DILocation(line: 597, column: 8, scope: !195)
!1021 = !DILocation(line: 597, column: 7, scope: !180)
!1022 = !DILocation(line: 604, column: 24, scope: !194)
!1023 = !DILocation(line: 604, column: 12, scope: !195)
!1024 = !DILocation(line: 0, scope: !193)
!1025 = !DILocation(line: 610, column: 16, scope: !193)
!1026 = !DILocation(line: 610, column: 7, scope: !193)
!1027 = !DILocation(line: 611, column: 21, scope: !193)
!1028 = !{!1029, !1029, i64 0}
!1029 = !{!"short", !919, i64 0}
!1030 = !DILocation(line: 611, column: 19, scope: !193)
!1031 = !DILocation(line: 611, column: 16, scope: !193)
!1032 = !DILocation(line: 610, column: 30, scope: !193)
!1033 = distinct !{!1033, !1026, !1027, !1034}
!1034 = !{!"llvm.loop.mustprogress"}
!1035 = !DILocation(line: 612, column: 18, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !193, file: !82, line: 612, column: 11)
!1037 = !DILocation(line: 612, column: 11, scope: !193)
!1038 = !DILocation(line: 620, column: 23, scope: !180)
!1039 = !DILocation(line: 625, column: 39, scope: !180)
!1040 = !DILocation(line: 626, column: 3, scope: !180)
!1041 = !DILocation(line: 626, column: 10, scope: !180)
!1042 = !DILocation(line: 626, column: 21, scope: !180)
!1043 = !DILocation(line: 628, column: 44, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !82, line: 628, column: 11)
!1045 = distinct !DILexicalBlock(scope: !180, file: !82, line: 627, column: 5)
!1046 = !DILocation(line: 628, column: 32, scope: !1044)
!1047 = !DILocation(line: 628, column: 49, scope: !1044)
!1048 = !DILocation(line: 628, column: 11, scope: !1045)
!1049 = !DILocation(line: 630, column: 11, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !82, line: 630, column: 11)
!1051 = !DILocation(line: 630, column: 11, scope: !1045)
!1052 = !DILocation(line: 632, column: 26, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1054, file: !82, line: 632, column: 15)
!1054 = distinct !DILexicalBlock(scope: !1050, file: !82, line: 631, column: 9)
!1055 = !DILocation(line: 632, column: 34, scope: !1053)
!1056 = !DILocation(line: 632, column: 37, scope: !1053)
!1057 = !DILocation(line: 632, column: 15, scope: !1054)
!1058 = !DILocation(line: 640, column: 16, scope: !1045)
!1059 = distinct !{!1059, !1040, !1060, !1034}
!1060 = !DILocation(line: 641, column: 5, scope: !180)
!1061 = !DILocation(line: 644, column: 3, scope: !180)
!1062 = !DILocation(line: 0, scope: !999, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 648, column: 31, scope: !180)
!1064 = !DILocation(line: 0, scope: !999, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 649, column: 31, scope: !180)
!1066 = !DILocation(line: 0, scope: !999, inlinedAt: !1067)
!1067 = distinct !DILocation(line: 650, column: 31, scope: !180)
!1068 = !DILocation(line: 0, scope: !999, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 651, column: 31, scope: !180)
!1070 = !DILocation(line: 0, scope: !999, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 652, column: 31, scope: !180)
!1072 = !DILocation(line: 0, scope: !999, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 653, column: 31, scope: !180)
!1074 = !DILocation(line: 0, scope: !999, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 654, column: 31, scope: !180)
!1076 = !DILocation(line: 0, scope: !999, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 655, column: 31, scope: !180)
!1078 = !DILocation(line: 0, scope: !999, inlinedAt: !1079)
!1079 = distinct !DILocation(line: 656, column: 31, scope: !180)
!1080 = !DILocation(line: 0, scope: !999, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 657, column: 31, scope: !180)
!1082 = !DILocation(line: 663, column: 7, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !180, file: !82, line: 663, column: 7)
!1084 = !DILocation(line: 664, column: 7, scope: !1083)
!1085 = !DILocation(line: 664, column: 10, scope: !1083)
!1086 = !DILocation(line: 663, column: 7, scope: !180)
!1087 = !DILocation(line: 669, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1083, file: !82, line: 665, column: 5)
!1089 = !DILocation(line: 671, column: 5, scope: !1088)
!1090 = !DILocation(line: 676, column: 7, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1083, file: !82, line: 673, column: 5)
!1092 = !DILocation(line: 679, column: 3, scope: !180)
!1093 = !DILocation(line: 683, column: 3, scope: !180)
!1094 = !DILocation(line: 686, column: 3, scope: !180)
!1095 = !DILocation(line: 688, column: 3, scope: !180)
!1096 = !DILocation(line: 691, column: 3, scope: !180)
!1097 = !DILocation(line: 695, column: 3, scope: !180)
!1098 = !DILocation(line: 696, column: 1, scope: !180)
!1099 = !DISubprogram(name: "setlocale", scope: !1100, file: !1100, line: 122, type: !1101, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1100 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!136, !83, !142}
!1103 = !DISubprogram(name: "strncmp", scope: !1104, file: !1104, line: 159, type: !1105, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1104 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!83, !142, !142, !139}
!1107 = !DISubprogram(name: "exit", scope: !1108, file: !1108, line: 624, type: !907, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1108 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1109 = !DISubprogram(name: "getenv", scope: !1108, file: !1108, line: 641, type: !1110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!136, !142}
!1112 = !DISubprogram(name: "strcmp", scope: !1104, file: !1104, line: 156, type: !1113, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!83, !142, !142}
!1115 = !DISubprogram(name: "strspn", scope: !1104, file: !1104, line: 297, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!141, !142, !142}
!1118 = !DISubprogram(name: "strchr", scope: !1104, file: !1104, line: 246, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!136, !142, !83}
!1121 = !DISubprogram(name: "__ctype_b_loc", scope: !88, file: !88, line: 79, type: !1122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!1124}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!1127 = !DISubprogram(name: "strcspn", scope: !1104, file: !1104, line: 293, type: !1116, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1128 = !DISubprogram(name: "fwrite_unlocked", scope: !509, file: !509, line: 704, type: !1129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!139, !1131, !139, !139, !977}
!1131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1134 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 289, type: !1135, scopeLine: 290, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1138)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!83, !83, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144, !1146}
!1139 = !DILocalVariable(name: "argc", arg: 1, scope: !1134, file: !2, line: 289, type: !83)
!1140 = !DILocalVariable(name: "argv", arg: 2, scope: !1134, file: !2, line: 289, type: !1137)
!1141 = !DILocalVariable(name: "width", scope: !1134, file: !2, line: 291, type: !139)
!1142 = !DILocalVariable(name: "optc", scope: !1134, file: !2, line: 292, type: !83)
!1143 = !DILocalVariable(name: "ok", scope: !1134, file: !2, line: 293, type: !168)
!1144 = !DILocalVariable(name: "optargbuf", scope: !1145, file: !2, line: 305, type: !163)
!1145 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 304, column: 5)
!1146 = !DILocalVariable(name: "i", scope: !1147, file: !2, line: 352, type: !83)
!1147 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 352, column: 7)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !2, line: 350, column: 5)
!1149 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 347, column: 7)
!1150 = !DILocation(line: 0, scope: !1134)
!1151 = !DILocation(line: 296, column: 21, scope: !1134)
!1152 = !DILocation(line: 296, column: 3, scope: !1134)
!1153 = !DILocation(line: 297, column: 3, scope: !1134)
!1154 = !DILocation(line: 298, column: 3, scope: !1134)
!1155 = !DILocation(line: 299, column: 3, scope: !1134)
!1156 = !DILocation(line: 301, column: 3, scope: !1134)
!1157 = !DILocation(line: 303, column: 18, scope: !1134)
!1158 = !DILocation(line: 303, column: 71, scope: !1134)
!1159 = !DILocation(line: 303, column: 3, scope: !1134)
!1160 = !DILocation(line: 305, column: 7, scope: !1145)
!1161 = !DILocation(line: 305, column: 12, scope: !1145)
!1162 = !DILocation(line: 307, column: 7, scope: !1145)
!1163 = !DILocation(line: 333, column: 31, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1145, file: !2, line: 308, column: 9)
!1165 = !DILocation(line: 310, column: 25, scope: !1164)
!1166 = !DILocation(line: 311, column: 11, scope: !1164)
!1167 = !DILocation(line: 314, column: 25, scope: !1164)
!1168 = !DILocation(line: 315, column: 11, scope: !1164)
!1169 = !DILocation(line: 318, column: 24, scope: !1164)
!1170 = !DILocation(line: 319, column: 11, scope: !1164)
!1171 = !DILocation(line: 323, column: 15, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1164, file: !2, line: 323, column: 15)
!1173 = !DILocation(line: 323, column: 15, scope: !1164)
!1174 = !DILocation(line: 324, column: 19, scope: !1172)
!1175 = !DILocation(line: 324, column: 13, scope: !1172)
!1176 = !DILocation(line: 327, column: 30, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 326, column: 13)
!1178 = !DILocation(line: 327, column: 28, scope: !1177)
!1179 = !DILocation(line: 328, column: 28, scope: !1177)
!1180 = !DILocation(line: 329, column: 22, scope: !1177)
!1181 = !DILocation(line: 334, column: 31, scope: !1164)
!1182 = !DILocation(line: 333, column: 19, scope: !1164)
!1183 = !DILocation(line: 336, column: 11, scope: !1164)
!1184 = !DILocation(line: 338, column: 9, scope: !1164)
!1185 = !DILocation(line: 340, column: 9, scope: !1164)
!1186 = !DILocation(line: 343, column: 11, scope: !1164)
!1187 = !DILocation(line: 345, column: 5, scope: !1134)
!1188 = distinct !{!1188, !1159, !1187, !1034}
!1189 = !DILocation(line: 347, column: 15, scope: !1149)
!1190 = !DILocation(line: 347, column: 12, scope: !1149)
!1191 = !DILocation(line: 347, column: 7, scope: !1134)
!1192 = !DILocation(line: 0, scope: !1147)
!1193 = !DILocation(line: 352, column: 30, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1147, file: !2, line: 352, column: 7)
!1195 = !DILocation(line: 352, column: 7, scope: !1147)
!1196 = !DILocation(line: 348, column: 10, scope: !1149)
!1197 = !DILocation(line: 348, column: 5, scope: !1149)
!1198 = !DILocation(line: 353, column: 26, scope: !1194)
!1199 = !DILocation(line: 353, column: 15, scope: !1194)
!1200 = !DILocation(line: 353, column: 12, scope: !1194)
!1201 = !DILocation(line: 352, column: 39, scope: !1194)
!1202 = distinct !{!1202, !1195, !1203, !1034}
!1203 = !DILocation(line: 353, column: 40, scope: !1147)
!1204 = !DILocation(line: 356, column: 7, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1134, file: !2, line: 356, column: 7)
!1206 = !DILocation(line: 356, column: 23, scope: !1205)
!1207 = !DILocation(line: 356, column: 34, scope: !1205)
!1208 = !DILocation(line: 356, column: 26, scope: !1205)
!1209 = !DILocation(line: 356, column: 41, scope: !1205)
!1210 = !DILocation(line: 356, column: 7, scope: !1134)
!1211 = !DILocation(line: 357, column: 5, scope: !1205)
!1212 = !DILocation(line: 359, column: 10, scope: !1134)
!1213 = !DILocation(line: 359, column: 3, scope: !1134)
!1214 = !DISubprogram(name: "bindtextdomain", scope: !970, file: !970, line: 86, type: !1215, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!136, !142, !142}
!1217 = !DISubprogram(name: "textdomain", scope: !970, file: !970, line: 82, type: !1110, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1218 = !DISubprogram(name: "atexit", scope: !1108, file: !1108, line: 602, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!83, !549}
!1221 = !DISubprogram(name: "getopt_long", scope: !392, file: !392, line: 66, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !926)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!83, !83, !1224, !142, !1226, !397}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!1227 = !DILocation(line: 0, scope: !403)
!1228 = !DILocation(line: 0, scope: !999, inlinedAt: !1229)
!1229 = distinct !DILocation(line: 169, column: 7, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !403, file: !2, line: 169, column: 7)
!1231 = !DILocation(line: 1361, column: 11, scope: !999, inlinedAt: !1229)
!1232 = !DILocation(line: 1361, column: 10, scope: !999, inlinedAt: !1229)
!1233 = !DILocation(line: 169, column: 7, scope: !403)
!1234 = !DILocation(line: 171, column: 17, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1230, file: !2, line: 170, column: 5)
!1236 = !DILocation(line: 172, column: 23, scope: !1235)
!1237 = !DILocation(line: 173, column: 5, scope: !1235)
!1238 = !DILocation(line: 175, column: 15, scope: !1230)
!1239 = !DILocation(line: 0, scope: !1230)
!1240 = !DILocation(line: 177, column: 15, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !403, file: !2, line: 177, column: 7)
!1242 = !DILocation(line: 177, column: 7, scope: !403)
!1243 = !DILocation(line: 179, column: 7, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1241, file: !2, line: 178, column: 5)
!1245 = !DILocation(line: 180, column: 7, scope: !1244)
!1246 = !DILocation(line: 183, column: 3, scope: !403)
!1247 = !DILocation(line: 187, column: 3, scope: !403)
!1248 = !DILocalVariable(name: "mbbuf", arg: 1, scope: !1249, file: !417, line: 71, type: !1252)
!1249 = distinct !DISubprogram(name: "mbbuf_get_char", scope: !417, file: !417, line: 71, type: !1250, scopeLine: 72, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1253)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!427, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!1253 = !{!1248, !1254, !1255, !1258}
!1254 = !DILocalVariable(name: "available", scope: !1249, file: !417, line: 73, type: !412)
!1255 = !DILocalVariable(name: "start", scope: !1256, file: !417, line: 77, type: !412)
!1256 = distinct !DILexicalBlock(scope: !1257, file: !417, line: 76, column: 5)
!1257 = distinct !DILexicalBlock(scope: !1249, file: !417, line: 75, column: 7)
!1258 = !DILocalVariable(name: "g", scope: !1249, file: !417, line: 92, type: !427)
!1259 = !DILocation(line: 0, scope: !1249, inlinedAt: !1260)
!1260 = distinct !DILocation(line: 187, column: 15, scope: !403)
!1261 = !DILocation(line: 73, column: 35, scope: !1249, inlinedAt: !1260)
!1262 = !DILocation(line: 75, column: 17, scope: !1257, inlinedAt: !1260)
!1263 = !DILocation(line: 75, column: 32, scope: !1257, inlinedAt: !1260)
!1264 = !DILocalVariable(name: "__stream", arg: 1, scope: !1265, file: !1266, line: 128, type: !202)
!1265 = distinct !DISubprogram(name: "feof_unlocked", scope: !1266, file: !1266, line: 128, type: !1267, scopeLine: 129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1269)
!1266 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!83, !202}
!1269 = !{!1264}
!1270 = !DILocation(line: 0, scope: !1265, inlinedAt: !1271)
!1271 = distinct !DILocation(line: 75, column: 37, scope: !1257, inlinedAt: !1260)
!1272 = !DILocation(line: 130, column: 10, scope: !1265, inlinedAt: !1271)
!1273 = !{!1274, !988, i64 0}
