; ModuleID = 'src/groups.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [37 x i8] c"Usage: %s [OPTION]... [USERNAME]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [155 x i8] c"Print group memberships for each USERNAME or, if no USERNAME is specified, for\0Athe current process (which may differ if the groups database has changed).\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"groups\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22

!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !84, !89, !94, !99, !104, !109, !111, !116, !121, !201, !206, !208, !213, !215, !220, !222, !224, !229, !231, !233, !235, !237, !242, !244, !246, !248, !250, !252, !254, !256, !261, !263, !268, !270, !272, !274, !276, !278, !283, !285, !287, !292, !297, !302, !307, !309, !47, !311}
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !86, isLocal: true, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 14)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !91, isLocal: true, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 16)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(scope: null, file: !2, line: 85, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 15)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 20)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(scope: null, file: !2, line: 106, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 25)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 111, type: !101, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 125, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 17)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(scope: null, file: !2, line: 133, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 6)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !123, file: !52, line: 575, type: !53, isLocal: true, isDefinition: true)
!123 = distinct !DISubprogram(name: "oputs_", scope: !52, file: !52, line: 573, type: !124, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !126)
!124 = !DISubroutineType(cc: DW_CC_nocall, types: !125)
!125 = !{null, !80, !80}
!126 = !{!127, !128, !129, !132, !134, !135, !136, !140, !141, !142, !143, !145, !195, !196, !197, !199, !200}
!127 = !DILocalVariable(name: "program", arg: 1, scope: !123, file: !52, line: 573, type: !80)
!128 = !DILocalVariable(name: "option", arg: 2, scope: !123, file: !52, line: 573, type: !80)
!129 = !DILocalVariable(name: "term", scope: !130, file: !52, line: 585, type: !80)
!130 = distinct !DILexicalBlock(scope: !131, file: !52, line: 582, column: 5)
!131 = distinct !DILexicalBlock(scope: !123, file: !52, line: 581, column: 7)
!132 = !DILocalVariable(name: "double_space", scope: !123, file: !52, line: 594, type: !133)
!133 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!134 = !DILocalVariable(name: "first_word", scope: !123, file: !52, line: 595, type: !80)
!135 = !DILocalVariable(name: "option_text", scope: !123, file: !52, line: 596, type: !80)
!136 = !DILocalVariable(name: "s", scope: !137, file: !52, line: 608, type: !80)
!137 = distinct !DILexicalBlock(scope: !138, file: !52, line: 605, column: 5)
!138 = distinct !DILexicalBlock(scope: !139, file: !52, line: 604, column: 12)
!139 = distinct !DILexicalBlock(scope: !123, file: !52, line: 597, column: 7)
!140 = !DILocalVariable(name: "spaces", scope: !137, file: !52, line: 609, type: !77)
!141 = !DILocalVariable(name: "anchor_len", scope: !123, file: !52, line: 620, type: !77)
!142 = !DILocalVariable(name: "desc_text", scope: !123, file: !52, line: 625, type: !80)
!143 = !DILocalVariable(name: "__ptr", scope: !144, file: !52, line: 644, type: !80)
!144 = distinct !DILexicalBlock(scope: !123, file: !52, line: 644, column: 3)
!145 = !DILocalVariable(name: "__stream", scope: !144, file: !52, line: 644, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !148, line: 7, baseType: !149)
!148 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !150, line: 49, size: 1728, elements: !151)
!150 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !167, !169, !170, !171, !175, !176, !178, !179, !182, !184, !187, !190, !191, !192, !193, !194}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !149, file: !150, line: 51, baseType: !53, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !149, file: !150, line: 54, baseType: !74, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !149, file: !150, line: 55, baseType: !74, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !149, file: !150, line: 56, baseType: !74, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !149, file: !150, line: 57, baseType: !74, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !149, file: !150, line: 58, baseType: !74, size: 64, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !149, file: !150, line: 59, baseType: !74, size: 64, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !149, file: !150, line: 60, baseType: !74, size: 64, offset: 448)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !149, file: !150, line: 61, baseType: !74, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !149, file: !150, line: 64, baseType: !74, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !149, file: !150, line: 65, baseType: !74, size: 64, offset: 640)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !149, file: !150, line: 66, baseType: !74, size: 64, offset: 704)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !149, file: !150, line: 68, baseType: !165, size: 64, offset: 768)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !150, line: 36, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !149, file: !150, line: 70, baseType: !168, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !149, file: !150, line: 72, baseType: !53, size: 32, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !149, file: !150, line: 73, baseType: !53, size: 32, offset: 928)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !149, file: !150, line: 74, baseType: !172, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !173, line: 152, baseType: !174)
!173 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!174 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !149, file: !150, line: 77, baseType: !76, size: 16, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !149, file: !150, line: 78, baseType: !177, size: 8, offset: 1040)
!177 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !149, file: !150, line: 79, baseType: !34, size: 8, offset: 1048)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !149, file: !150, line: 81, baseType: !180, size: 64, offset: 1088)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !150, line: 43, baseType: null)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !149, file: !150, line: 89, baseType: !183, size: 64, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !173, line: 153, baseType: !174)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !149, file: !150, line: 91, baseType: !185, size: 64, offset: 1216)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !150, line: 37, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !149, file: !150, line: 92, baseType: !188, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !150, line: 38, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !149, file: !150, line: 93, baseType: !168, size: 64, offset: 1344)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !149, file: !150, line: 94, baseType: !75, size: 64, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !149, file: !150, line: 95, baseType: !77, size: 64, offset: 1472)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !149, file: !150, line: 96, baseType: !53, size: 32, offset: 1536)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !149, file: !150, line: 98, baseType: !101, size: 160, offset: 1568)
!195 = !DILocalVariable(name: "__cnt", scope: !144, file: !52, line: 644, type: !77)
!196 = !DILocalVariable(name: "url_program", scope: !123, file: !52, line: 648, type: !80)
!197 = !DILocalVariable(name: "__ptr", scope: !198, file: !52, line: 686, type: !80)
!198 = distinct !DILexicalBlock(scope: !123, file: !52, line: 686, column: 3)
!199 = !DILocalVariable(name: "__stream", scope: !198, file: !52, line: 686, type: !146)
!200 = !DILocalVariable(name: "__cnt", scope: !198, file: !52, line: 686, type: !77)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !52, line: 585, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 5)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !52, line: 586, type: !203, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !52, line: 595, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 4)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(scope: null, file: !52, line: 620, type: !118, isLocal: true, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(scope: null, file: !52, line: 648, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 2)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !52, line: 648, type: !203, isLocal: true, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !52, line: 649, type: !210, isLocal: true, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(scope: null, file: !52, line: 649, type: !226, isLocal: true, isDefinition: true)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 3)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !52, line: 650, type: !203, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !52, line: 651, type: !118, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !52, line: 651, type: !118, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !52, line: 652, type: !19, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !52, line: 653, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 8)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !52, line: 654, type: !39, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !52, line: 655, type: !39, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !52, line: 656, type: !39, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !52, line: 657, type: !39, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !52, line: 663, type: !19, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !52, line: 664, type: !39, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !52, line: 669, type: !113, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !52, line: 669, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 40)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !52, line: 676, type: !96, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !52, line: 676, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 61)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !52, line: 679, type: !226, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !52, line: 683, type: !203, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !52, line: 688, type: !203, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !52, line: 691, type: !239, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !52, line: 839, type: !91, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !52, line: 840, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 22)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !52, line: 841, type: !96, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !52, line: 862, type: !210, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !52, line: 868, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 71)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !52, line: 875, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 27)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !52, line: 877, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 51)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !52, line: 877, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 12)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !203, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 42, type: !239, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !52, line: 952, type: !304, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 768, elements: !227)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !316, line: 50, size: 256, elements: !317)
!316 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!317 = !{!318, !319, !320, !322}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !316, line: 52, baseType: !80, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !315, file: !316, line: 55, baseType: !53, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !315, file: !316, line: 56, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !315, file: !316, line: 57, baseType: !53, size: 32, offset: 192)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !325, line: 67, type: !326, isLocal: true, isDefinition: true)
!325 = !DIFile(filename: "src/group-list.c", directory: "/src", checksumkind: CSK_MD5, checksum: "86bc740edd29a2e1277335d35d8d331e")
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 33)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !325, line: 72, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 45)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !325, line: 109, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 34)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !325, line: 116, type: !226, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !325, line: 118, type: !210, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !345, line: 3, type: !96, isLocal: true, isDefinition: true)
!345 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "Version", scope: !348, file: !345, line: 3, type: !80, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C11, file: !345, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !349, splitDebugInlining: false, nameTableKind: None)
!349 = !{!343, !346}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "file_name", scope: !352, file: !353, line: 45, type: !80, isLocal: true, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C11, file: !353, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !354, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!354 = !{!355, !357, !359, !361, !350, !363}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !353, line: 121, type: !19, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !353, line: 121, type: !304, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !353, line: 123, type: !19, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !353, line: 126, type: !226, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !352, file: !353, line: 55, type: !133, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !367, file: !368, line: 66, type: !419, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C11, file: !368, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !369, globals: !370, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!369 = !{!75, !82}
!370 = !{!371, !373, !398, !400, !402, !404, !365, !406, !408, !410, !412, !417}
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !368, line: 272, type: !203, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "old_file_name", scope: !375, file: !368, line: 304, type: !80, isLocal: true, isDefinition: true)
!375 = distinct !DISubprogram(name: "verror_at_line", scope: !368, file: !368, line: 298, type: !376, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !367, retainedNodes: !391)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !53, !53, !80, !59, !80, !378}
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !379, line: 52, baseType: !380)
!379 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !381, line: 14, baseType: !382)
!381 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !383, baseType: !384)
!383 = !DIFile(filename: "lib/error.c", directory: "/src")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !384, file: !383, baseType: !75, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !384, file: !383, baseType: !75, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !384, file: !383, baseType: !75, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !384, file: !383, baseType: !53, size: 32, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !384, file: !383, baseType: !53, size: 32, offset: 224)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DILocalVariable(name: "status", arg: 1, scope: !375, file: !368, line: 298, type: !53)
!393 = !DILocalVariable(name: "errnum", arg: 2, scope: !375, file: !368, line: 298, type: !53)
!394 = !DILocalVariable(name: "file_name", arg: 3, scope: !375, file: !368, line: 298, type: !80)
!395 = !DILocalVariable(name: "line_number", arg: 4, scope: !375, file: !368, line: 298, type: !59)
!396 = !DILocalVariable(name: "message", arg: 5, scope: !375, file: !368, line: 298, type: !80)
!397 = !DILocalVariable(name: "args", arg: 6, scope: !375, file: !368, line: 298, type: !378)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "old_line_number", scope: !375, file: !368, line: 305, type: !59, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !368, line: 338, type: !210, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !368, line: 346, type: !239, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !368, line: 346, type: !217, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "error_message_count", scope: !367, file: !368, line: 69, type: !59, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !367, file: !368, line: 295, type: !53, isLocal: false, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !368, line: 208, type: !19, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !368, line: 208, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 21)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !368, line: 214, type: !203, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "program_name", scope: !424, file: !425, line: 31, type: !80, isLocal: false, isDefinition: true)
!424 = distinct !DICompileUnit(language: DW_LANG_C11, file: !425, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !426, globals: !427, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!426 = !{!74}
!427 = !{!422, !428, !430}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !425, line: 46, type: !239, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !425, line: 49, type: !210, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "utf07FF", scope: !434, file: !435, line: 46, type: !462, isLocal: true, isDefinition: true)
!434 = distinct !DISubprogram(name: "proper_name_lite", scope: !435, file: !435, line: 38, type: !436, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !438, retainedNodes: !440)
!435 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!436 = !DISubroutineType(types: !437)
!437 = !{!80, !80, !80}
!438 = distinct !DICompileUnit(language: DW_LANG_C11, file: !435, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !439, splitDebugInlining: false, nameTableKind: None)
!439 = !{!432}
!440 = !{!441, !442, !443, !444, !449}
!441 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !434, file: !435, line: 38, type: !80)
!442 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !434, file: !435, line: 38, type: !80)
!443 = !DILocalVariable(name: "translation", scope: !434, file: !435, line: 40, type: !80)
!444 = !DILocalVariable(name: "w", scope: !434, file: !435, line: 47, type: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !446, line: 37, baseType: !447)
!446 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !173, line: 57, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !173, line: 42, baseType: !59)
!449 = !DILocalVariable(name: "mbs", scope: !434, file: !435, line: 48, type: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !451, line: 6, baseType: !452)
!451 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !453, line: 21, baseType: !454)
!453 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 13, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !454, file: !453, line: 15, baseType: !53, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !454, file: !453, line: 20, baseType: !458, size: 32, offset: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !454, file: !453, line: 16, size: 32, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !458, file: !453, line: 18, baseType: !59, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !458, file: !453, line: 19, baseType: !210, size: 32)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !218)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !465, line: 78, type: !239, isLocal: true, isDefinition: true)
!465 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !465, line: 79, type: !118, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !465, line: 80, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 13)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !465, line: 81, type: !470, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !465, line: 82, type: !101, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !465, line: 83, type: !217, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !465, line: 84, type: !239, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !465, line: 85, type: !19, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !465, line: 86, type: !19, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !465, line: 87, type: !239, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !489, file: !465, line: 76, type: !575, isLocal: false, isDefinition: true)
!489 = distinct !DICompileUnit(language: DW_LANG_C11, file: !465, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !490, retainedTypes: !510, globals: !511, splitDebugInlining: false, nameTableKind: None)
!490 = !{!491, !505, !57}
!491 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !492, line: 42, baseType: !59, size: 32, elements: !493)
!492 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!494 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!495 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!496 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!497 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!498 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!499 = !DIEnumerator(name: "c_quoting_style", value: 5)
!500 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!501 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!502 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!503 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!504 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!505 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !492, line: 254, baseType: !59, size: 32, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!508 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!509 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!510 = !{!53, !76, !77}
!511 = !{!463, !466, !468, !473, !475, !477, !479, !481, !483, !485, !487, !512, !516, !526, !528, !533, !535, !537, !539, !541, !564, !571, !573}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !489, file: !465, line: 92, type: !514, isLocal: false, isDefinition: true)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 320, elements: !40)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !489, file: !465, line: 1040, type: !518, isLocal: false, isDefinition: true)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !465, line: 56, size: 448, elements: !519)
!519 = !{!520, !521, !522, !524, !525}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !518, file: !465, line: 59, baseType: !491, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !518, file: !465, line: 62, baseType: !53, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !518, file: !465, line: 66, baseType: !523, size: 256, offset: 64)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !518, file: !465, line: 69, baseType: !80, size: 64, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !518, file: !465, line: 72, baseType: !80, size: 64, offset: 384)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !489, file: !465, line: 107, type: !518, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "slot0", scope: !489, file: !465, line: 831, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 256)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !465, line: 321, type: !217, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !465, line: 357, type: !217, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !465, line: 358, type: !217, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !465, line: 199, type: !19, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "quote", scope: !543, file: !465, line: 228, type: !562, isLocal: true, isDefinition: true)
!543 = distinct !DISubprogram(name: "gettext_quote", scope: !465, file: !465, line: 197, type: !544, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !489, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!80, !80, !491}
!546 = !{!547, !548, !549, !550, !551}
!547 = !DILocalVariable(name: "msgid", arg: 1, scope: !543, file: !465, line: 197, type: !80)
!548 = !DILocalVariable(name: "s", arg: 2, scope: !543, file: !465, line: 197, type: !491)
!549 = !DILocalVariable(name: "translation", scope: !543, file: !465, line: 199, type: !80)
!550 = !DILocalVariable(name: "w", scope: !543, file: !465, line: 229, type: !445)
!551 = !DILocalVariable(name: "mbs", scope: !543, file: !465, line: 230, type: !552)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !451, line: 6, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !453, line: 21, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 13, size: 64, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !554, file: !453, line: 15, baseType: !53, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !554, file: !453, line: 20, baseType: !558, size: 32, offset: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !453, line: 16, size: 32, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !558, file: !453, line: 18, baseType: !59, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !558, file: !453, line: 19, baseType: !210, size: 32)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !563)
!563 = !{!219, !212}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "slotvec", scope: !489, file: !465, line: 834, type: !566, isLocal: true, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !465, line: 823, size: 128, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !567, file: !465, line: 825, baseType: !77, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !567, file: !465, line: 826, baseType: !74, size: 64, offset: 64)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "nslots", scope: !489, file: !465, line: 832, type: !53, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "slotvec0", scope: !489, file: !465, line: 833, type: !567, isLocal: true, isDefinition: true)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 704, elements: !577)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!577 = !{!578}
!578 = !DISubrange(count: 11)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !581, line: 67, type: !304, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !581, line: 69, type: !19, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !581, line: 83, type: !19, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !581, line: 83, type: !210, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !581, line: 85, type: !217, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !581, line: 88, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 171)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !581, line: 88, type: !336, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !581, line: 105, type: !91, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !581, line: 109, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 23)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !581, line: 113, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 28)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !581, line: 120, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 32)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(scope: null, file: !581, line: 127, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 36)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !581, line: 134, type: !258, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !581, line: 142, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 44)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !581, line: 150, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 48)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !581, line: 159, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 52)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !581, line: 170, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 60)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !581, line: 248, type: !101, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !581, line: 248, type: !280, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !581, line: 254, type: !101, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !581, line: 254, type: !86, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !581, line: 254, type: !258, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !581, line: 259, type: !3, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !581, line: 259, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 29)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !660, file: !661, line: 26, type: !663, isLocal: false, isDefinition: true)
!660 = distinct !DICompileUnit(language: DW_LANG_C11, file: !661, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !662, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!662 = !{!658}
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 47)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "exit_failure", scope: !668, file: !669, line: 24, type: !671, isLocal: false, isDefinition: true)
!668 = distinct !DICompileUnit(language: DW_LANG_C11, file: !669, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !670, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!670 = !{!666}
!671 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !674, line: 34, type: !226, isLocal: true, isDefinition: true)
!674 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !674, line: 34, type: !19, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !674, line: 34, type: !113, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !681, line: 108, type: !34, isLocal: true, isDefinition: true)
!681 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "internal_state", scope: !684, file: !681, line: 97, type: !687, isLocal: true, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C11, file: !681, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !685, globals: !686, splitDebugInlining: false, nameTableKind: None)
!685 = !{!75, !77, !82}
!686 = !{!679, !682}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !451, line: 6, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !453, line: 21, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !453, line: 13, size: 64, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !689, file: !453, line: 15, baseType: !53, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !689, file: !453, line: 20, baseType: !693, size: 32, offset: 32)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !689, file: !453, line: 16, size: 32, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !693, file: !453, line: 18, baseType: !59, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !693, file: !453, line: 19, baseType: !210, size: 32)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !699, line: 35, type: !217, isLocal: true, isDefinition: true)
!699 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !699, line: 35, type: !118, isLocal: true, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !325, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !703, globals: !707, splitDebugInlining: false, nameTableKind: None)
!703 = !{!75, !704, !82}
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !705, line: 102, baseType: !706)
!705 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !173, line: 73, baseType: !79)
!707 = !{!323, !329, !334, !339, !341}
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !581, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !713, retainedTypes: !717, globals: !718, splitDebugInlining: false, nameTableKind: None)
!713 = !{!714}
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 40, baseType: !59, size: 32, elements: !715)
!715 = !{!716}
!716 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!717 = !{!75}
!718 = !{!579, !582, !584, !586, !588, !590, !595, !597, !599, !604, !609, !614, !619, !621, !626, !631, !636, !641, !643, !645, !647, !649, !651, !653}
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !721, retainedTypes: !752, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!721 = !{!722, !734}
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !723, file: !720, line: 188, baseType: !59, size: 32, elements: !732)
!723 = distinct !DISubprogram(name: "x2nrealloc", scope: !720, file: !720, line: 176, type: !724, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !719, retainedNodes: !727)
!724 = !DISubroutineType(types: !725)
!725 = !{!75, !75, !726, !77}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!727 = !{!728, !729, !730, !731}
!728 = !DILocalVariable(name: "p", arg: 1, scope: !723, file: !720, line: 176, type: !75)
!729 = !DILocalVariable(name: "pn", arg: 2, scope: !723, file: !720, line: 176, type: !726)
!730 = !DILocalVariable(name: "s", arg: 3, scope: !723, file: !720, line: 176, type: !77)
!731 = !DILocalVariable(name: "n", scope: !723, file: !720, line: 178, type: !77)
!732 = !{!733}
!733 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !735, file: !720, line: 228, baseType: !59, size: 32, elements: !732)
!735 = distinct !DISubprogram(name: "xpalloc", scope: !720, file: !720, line: 223, type: !736, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !719, retainedNodes: !742)
!736 = !DISubroutineType(types: !737)
!737 = !{!75, !75, !738, !739, !741, !739}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !740, line: 130, baseType: !741)
!740 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !78, line: 35, baseType: !174)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751}
!743 = !DILocalVariable(name: "pa", arg: 1, scope: !735, file: !720, line: 223, type: !75)
!744 = !DILocalVariable(name: "pn", arg: 2, scope: !735, file: !720, line: 223, type: !738)
!745 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !735, file: !720, line: 223, type: !739)
!746 = !DILocalVariable(name: "n_max", arg: 4, scope: !735, file: !720, line: 223, type: !741)
!747 = !DILocalVariable(name: "s", arg: 5, scope: !735, file: !720, line: 223, type: !739)
!748 = !DILocalVariable(name: "n0", scope: !735, file: !720, line: 230, type: !739)
!749 = !DILocalVariable(name: "n", scope: !735, file: !720, line: 237, type: !739)
!750 = !DILocalVariable(name: "nbytes", scope: !735, file: !720, line: 248, type: !739)
!751 = !DILocalVariable(name: "adjusted_nbytes", scope: !735, file: !720, line: 252, type: !739)
!752 = !{!74, !75, !133, !174, !79}
!753 = distinct !DICompileUnit(language: DW_LANG_C11, file: !674, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !754, splitDebugInlining: false, nameTableKind: None)
!754 = !{!672, !675, !677}
!755 = distinct !DICompileUnit(language: DW_LANG_C11, file: !756, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!756 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!757 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!758 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!759 = distinct !DICompileUnit(language: DW_LANG_C11, file: !760, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !767, retainedTypes: !805, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!767 = !{!768}
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !769, file: !766, line: 79, baseType: !59, size: 32, elements: !803)
!769 = distinct !DISubprogram(name: "mgetgroups", scope: !766, file: !766, line: 66, type: !770, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !765, retainedNodes: !777)
!770 = !DISubroutineType(types: !771)
!771 = !{!53, !80, !772, !775}
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !773, line: 64, baseType: !774)
!773 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !173, line: 147, baseType: !59)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!777 = !{!778, !779, !780, !781, !784, !785, !787, !788, !789, !790, !795, !796, !797, !800, !801}
!778 = !DILocalVariable(name: "username", arg: 1, scope: !769, file: !766, line: 66, type: !80)
!779 = !DILocalVariable(name: "gid", arg: 2, scope: !769, file: !766, line: 66, type: !772)
!780 = !DILocalVariable(name: "groups", arg: 3, scope: !769, file: !766, line: 66, type: !775)
!781 = !DILocalVariable(name: "max_n_groups", scope: !782, file: !766, line: 80, type: !53)
!782 = distinct !DILexicalBlock(scope: !783, file: !766, line: 78, column: 5)
!783 = distinct !DILexicalBlock(scope: !769, file: !766, line: 77, column: 7)
!784 = !DILocalVariable(name: "g", scope: !782, file: !766, line: 82, type: !776)
!785 = !DILocalVariable(name: "last_n_groups", scope: !786, file: !766, line: 88, type: !53)
!786 = distinct !DILexicalBlock(scope: !782, file: !766, line: 87, column: 9)
!787 = !DILocalVariable(name: "ng", scope: !786, file: !766, line: 91, type: !53)
!788 = !DILocalVariable(name: "h", scope: !786, file: !766, line: 98, type: !776)
!789 = !DILocalVariable(name: "max_n_groups", scope: !769, file: !766, line: 118, type: !53)
!790 = !DILocalVariable(name: "g", scope: !791, file: !766, line: 129, type: !776)
!791 = distinct !DILexicalBlock(scope: !792, file: !766, line: 128, column: 9)
!792 = distinct !DILexicalBlock(scope: !793, file: !766, line: 127, column: 11)
!793 = distinct !DILexicalBlock(scope: !794, file: !766, line: 126, column: 5)
!794 = distinct !DILexicalBlock(scope: !769, file: !766, line: 125, column: 7)
!795 = !DILocalVariable(name: "g", scope: !769, file: !766, line: 142, type: !776)
!796 = !DILocalVariable(name: "ng", scope: !769, file: !766, line: 146, type: !53)
!797 = !DILocalVariable(name: "first", scope: !798, file: !766, line: 183, type: !772)
!798 = distinct !DILexicalBlock(scope: !799, file: !766, line: 182, column: 5)
!799 = distinct !DILexicalBlock(scope: !769, file: !766, line: 181, column: 7)
!800 = !DILocalVariable(name: "groups_end", scope: !798, file: !766, line: 184, type: !776)
!801 = !DILocalVariable(name: "next", scope: !802, file: !766, line: 186, type: !776)
!802 = distinct !DILexicalBlock(scope: !798, file: !766, line: 186, column: 7)
!803 = !{!804}
!804 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!805 = !{!75, !772}
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !808, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!808 = !{!133, !79, !75}
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !699, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !810, splitDebugInlining: false, nameTableKind: None)
!810 = !{!697, !700}
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!813 = distinct !DICompileUnit(language: DW_LANG_C11, file: !814, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!815 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!816 = !{i32 7, !"Dwarf Version", i32 5}
!817 = !{i32 2, !"Debug Info Version", i32 3}
!818 = !{i32 1, !"wchar_size", i32 4}
!819 = !{i32 8, !"PIC Level", i32 2}
!820 = !{i32 7, !"PIE Level", i32 2}
!821 = !{i32 7, !"uwtable", i32 2}
!822 = !{i32 7, !"frame-pointer", i32 1}
!823 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 47, type: !824, scopeLine: 48, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !826)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !53}
!826 = !{!827}
!827 = !DILocalVariable(name: "status", arg: 1, scope: !823, file: !2, line: 47, type: !53)
!828 = !DILocation(line: 0, scope: !823)
!829 = !DILocation(line: 49, column: 14, scope: !830)
!830 = distinct !DILexicalBlock(scope: !823, file: !2, line: 49, column: 7)
!831 = !DILocation(line: 49, column: 7, scope: !823)
!832 = !DILocation(line: 50, column: 5, scope: !833)
!833 = distinct !DILexicalBlock(scope: !830, file: !2, line: 50, column: 5)
!834 = !{!835, !835, i64 0}
!835 = !{!"any pointer", !836, i64 0}
!836 = !{!"omnipotent char", !837, i64 0}
!837 = !{!"Simple C/C++ TBAA"}
!838 = !DILocation(line: 53, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !830, file: !2, line: 52, column: 5)
!840 = !DILocation(line: 54, column: 7, scope: !839)
!841 = !DILocation(line: 59, column: 7, scope: !839)
!842 = !DILocation(line: 60, column: 7, scope: !839)
!843 = !DILocalVariable(name: "program", arg: 1, scope: !844, file: !52, line: 836, type: !80)
!844 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !52, file: !52, line: 836, type: !845, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !847)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !80}
!847 = !{!843, !848, !855, !856, !858, !859}
!848 = !DILocalVariable(name: "infomap", scope: !844, file: !52, line: 838, type: !849)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 896, elements: !20)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !844, file: !52, line: 838, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !851, file: !52, line: 838, baseType: !80, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !851, file: !52, line: 838, baseType: !80, size: 64, offset: 64)
!855 = !DILocalVariable(name: "node", scope: !844, file: !52, line: 848, type: !80)
!856 = !DILocalVariable(name: "map_prog", scope: !844, file: !52, line: 849, type: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!858 = !DILocalVariable(name: "lc_messages", scope: !844, file: !52, line: 861, type: !80)
!859 = !DILocalVariable(name: "url_program", scope: !844, file: !52, line: 874, type: !80)
!860 = !DILocation(line: 0, scope: !844, inlinedAt: !861)
!861 = distinct !DILocation(line: 61, column: 7, scope: !839)
!862 = !DILocation(line: 857, column: 3, scope: !844, inlinedAt: !861)
!863 = !DILocation(line: 861, column: 29, scope: !844, inlinedAt: !861)
!864 = !DILocation(line: 862, column: 7, scope: !865, inlinedAt: !861)
!865 = distinct !DILexicalBlock(scope: !844, file: !52, line: 862, column: 7)
!866 = !DILocation(line: 862, column: 19, scope: !865, inlinedAt: !861)
!867 = !DILocation(line: 862, column: 22, scope: !865, inlinedAt: !861)
!868 = !DILocation(line: 862, column: 7, scope: !844, inlinedAt: !861)
!869 = !DILocation(line: 868, column: 7, scope: !870, inlinedAt: !861)
!870 = distinct !DILexicalBlock(scope: !865, file: !52, line: 863, column: 5)
!871 = !DILocation(line: 870, column: 5, scope: !870, inlinedAt: !861)
!872 = !DILocation(line: 875, column: 3, scope: !844, inlinedAt: !861)
!873 = !DILocation(line: 877, column: 3, scope: !844, inlinedAt: !861)
!874 = !DILocation(line: 63, column: 3, scope: !823)
!875 = !DISubprogram(name: "dcgettext", scope: !876, file: !876, line: 51, type: !877, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!876 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!877 = !DISubroutineType(types: !878)
!878 = !{!74, !80, !80, !53}
!879 = !{}
!880 = !DISubprogram(name: "__fprintf_chk", scope: !881, file: !881, line: 93, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!881 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!882 = !DISubroutineType(types: !883)
!883 = !{!53, !884, !53, !885, null}
!884 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !146)
!885 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!886 = !DISubprogram(name: "__printf_chk", scope: !881, file: !881, line: 95, type: !887, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!887 = !DISubroutineType(types: !888)
!888 = !{!53, !53, !885, null}
!889 = !DISubprogram(name: "fputs_unlocked", scope: !379, file: !379, line: 691, type: !890, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!890 = !DISubroutineType(types: !891)
!891 = !{!53, !885, !884}
!892 = !DILocation(line: 0, scope: !123)
!893 = !DILocation(line: 581, column: 7, scope: !131)
!894 = !{!895, !895, i64 0}
!895 = !{!"int", !836, i64 0}
!896 = !DILocation(line: 581, column: 19, scope: !131)
!897 = !DILocation(line: 581, column: 7, scope: !123)
!898 = !DILocation(line: 585, column: 26, scope: !130)
!899 = !DILocation(line: 0, scope: !130)
!900 = !DILocation(line: 586, column: 23, scope: !130)
!901 = !DILocation(line: 586, column: 28, scope: !130)
!902 = !DILocation(line: 586, column: 32, scope: !130)
!903 = !{!836, !836, i64 0}
!904 = !DILocation(line: 586, column: 38, scope: !130)
!905 = !DILocalVariable(name: "__s1", arg: 1, scope: !906, file: !907, line: 1359, type: !80)
!906 = distinct !DISubprogram(name: "streq", scope: !907, file: !907, line: 1359, type: !908, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !910)
!907 = !DIFile(filename: "./lib/string.h", directory: "/src")
!908 = !DISubroutineType(types: !909)
!909 = !{!133, !80, !80}
!910 = !{!905, !911}
!911 = !DILocalVariable(name: "__s2", arg: 2, scope: !906, file: !907, line: 1359, type: !80)
!912 = !DILocation(line: 0, scope: !906, inlinedAt: !913)
!913 = distinct !DILocation(line: 586, column: 41, scope: !130)
!914 = !DILocation(line: 1361, column: 11, scope: !906, inlinedAt: !913)
!915 = !DILocation(line: 1361, column: 10, scope: !906, inlinedAt: !913)
!916 = !DILocation(line: 586, column: 19, scope: !130)
!917 = !DILocation(line: 587, column: 5, scope: !130)
!918 = !DILocation(line: 588, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !123, file: !52, line: 588, column: 7)
!920 = !DILocation(line: 588, column: 7, scope: !123)
!921 = !DILocation(line: 590, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !919, file: !52, line: 589, column: 5)
!923 = !DILocation(line: 591, column: 7, scope: !922)
!924 = !DILocation(line: 595, column: 37, scope: !123)
!925 = !DILocation(line: 595, column: 35, scope: !123)
!926 = !DILocation(line: 596, column: 29, scope: !123)
!927 = !DILocation(line: 597, column: 8, scope: !139)
!928 = !DILocation(line: 597, column: 7, scope: !123)
!929 = !DILocation(line: 604, column: 24, scope: !138)
!930 = !DILocation(line: 604, column: 12, scope: !139)
!931 = !DILocation(line: 0, scope: !137)
!932 = !DILocation(line: 610, column: 16, scope: !137)
!933 = !DILocation(line: 610, column: 7, scope: !137)
!934 = !DILocation(line: 611, column: 21, scope: !137)
!935 = !{!936, !936, i64 0}
!936 = !{!"short", !836, i64 0}
!937 = !DILocation(line: 611, column: 19, scope: !137)
!938 = !DILocation(line: 611, column: 16, scope: !137)
!939 = !DILocation(line: 610, column: 30, scope: !137)
!940 = distinct !{!940, !933, !934, !941}
!941 = !{!"llvm.loop.mustprogress"}
!942 = !DILocation(line: 612, column: 18, scope: !943)
!943 = distinct !DILexicalBlock(scope: !137, file: !52, line: 612, column: 11)
!944 = !DILocation(line: 612, column: 11, scope: !137)
!945 = !DILocation(line: 620, column: 23, scope: !123)
!946 = !DILocation(line: 625, column: 39, scope: !123)
!947 = !DILocation(line: 626, column: 3, scope: !123)
!948 = !DILocation(line: 626, column: 10, scope: !123)
!949 = !DILocation(line: 626, column: 21, scope: !123)
!950 = !DILocation(line: 628, column: 44, scope: !951)
!951 = distinct !DILexicalBlock(scope: !952, file: !52, line: 628, column: 11)
!952 = distinct !DILexicalBlock(scope: !123, file: !52, line: 627, column: 5)
!953 = !DILocation(line: 628, column: 32, scope: !951)
!954 = !DILocation(line: 628, column: 49, scope: !951)
!955 = !DILocation(line: 628, column: 11, scope: !952)
!956 = !DILocation(line: 630, column: 11, scope: !957)
!957 = distinct !DILexicalBlock(scope: !952, file: !52, line: 630, column: 11)
!958 = !DILocation(line: 630, column: 11, scope: !952)
!959 = !DILocation(line: 632, column: 26, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !52, line: 632, column: 15)
!961 = distinct !DILexicalBlock(scope: !957, file: !52, line: 631, column: 9)
!962 = !DILocation(line: 632, column: 34, scope: !960)
!963 = !DILocation(line: 632, column: 37, scope: !960)
!964 = !DILocation(line: 632, column: 15, scope: !961)
!965 = !DILocation(line: 640, column: 16, scope: !952)
!966 = distinct !{!966, !947, !967, !941}
!967 = !DILocation(line: 641, column: 5, scope: !123)
!968 = !DILocation(line: 644, column: 3, scope: !123)
!969 = !DILocation(line: 0, scope: !906, inlinedAt: !970)
!970 = distinct !DILocation(line: 648, column: 31, scope: !123)
!971 = !DILocation(line: 0, scope: !906, inlinedAt: !972)
!972 = distinct !DILocation(line: 649, column: 31, scope: !123)
!973 = !DILocation(line: 0, scope: !906, inlinedAt: !974)
!974 = distinct !DILocation(line: 650, column: 31, scope: !123)
!975 = !DILocation(line: 0, scope: !906, inlinedAt: !976)
!976 = distinct !DILocation(line: 651, column: 31, scope: !123)
!977 = !DILocation(line: 0, scope: !906, inlinedAt: !978)
!978 = distinct !DILocation(line: 652, column: 31, scope: !123)
!979 = !DILocation(line: 0, scope: !906, inlinedAt: !980)
!980 = distinct !DILocation(line: 653, column: 31, scope: !123)
!981 = !DILocation(line: 0, scope: !906, inlinedAt: !982)
!982 = distinct !DILocation(line: 654, column: 31, scope: !123)
!983 = !DILocation(line: 0, scope: !906, inlinedAt: !984)
!984 = distinct !DILocation(line: 655, column: 31, scope: !123)
!985 = !DILocation(line: 0, scope: !906, inlinedAt: !986)
!986 = distinct !DILocation(line: 656, column: 31, scope: !123)
!987 = !DILocation(line: 0, scope: !906, inlinedAt: !988)
!988 = distinct !DILocation(line: 657, column: 31, scope: !123)
!989 = !DILocation(line: 663, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !123, file: !52, line: 663, column: 7)
!991 = !DILocation(line: 664, column: 7, scope: !990)
!992 = !DILocation(line: 664, column: 10, scope: !990)
!993 = !DILocation(line: 663, column: 7, scope: !123)
!994 = !DILocation(line: 669, column: 7, scope: !995)
!995 = distinct !DILexicalBlock(scope: !990, file: !52, line: 665, column: 5)
!996 = !DILocation(line: 671, column: 5, scope: !995)
!997 = !DILocation(line: 676, column: 7, scope: !998)
!998 = distinct !DILexicalBlock(scope: !990, file: !52, line: 673, column: 5)
!999 = !DILocation(line: 679, column: 3, scope: !123)
!1000 = !DILocation(line: 683, column: 3, scope: !123)
!1001 = !DILocation(line: 686, column: 3, scope: !123)
!1002 = !DILocation(line: 688, column: 3, scope: !123)
!1003 = !DILocation(line: 691, column: 3, scope: !123)
!1004 = !DILocation(line: 695, column: 3, scope: !123)
!1005 = !DILocation(line: 696, column: 1, scope: !123)
!1006 = !DISubprogram(name: "setlocale", scope: !1007, file: !1007, line: 122, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1007 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!74, !53, !80}
!1010 = !DISubprogram(name: "strncmp", scope: !1011, file: !1011, line: 159, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1011 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!53, !80, !80, !77}
!1014 = !DISubprogram(name: "exit", scope: !1015, file: !1015, line: 624, type: !824, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1015 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1016 = !DISubprogram(name: "getenv", scope: !1015, file: !1015, line: 641, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!74, !80}
!1019 = !DISubprogram(name: "strcmp", scope: !1011, file: !1011, line: 156, type: !1020, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!53, !80, !80}
!1022 = !DISubprogram(name: "strspn", scope: !1011, file: !1011, line: 297, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!79, !80, !80}
!1025 = !DISubprogram(name: "strchr", scope: !1011, file: !1011, line: 246, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!74, !80, !53}
!1028 = !DISubprogram(name: "__ctype_b_loc", scope: !58, file: !58, line: 79, type: !1029, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!1034 = !DISubprogram(name: "strcspn", scope: !1011, file: !1011, line: 293, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1035 = !DISubprogram(name: "fwrite_unlocked", scope: !379, file: !379, line: 704, type: !1036, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!77, !1038, !77, !77, !884}
!1038 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1041 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 67, type: !1042, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1045)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!53, !53, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1055, !1056, !1057, !1058, !1059, !1075, !1076, !1077}
!1046 = !DILocalVariable(name: "argc", arg: 1, scope: !1041, file: !2, line: 67, type: !53)
!1047 = !DILocalVariable(name: "argv", arg: 2, scope: !1041, file: !2, line: 67, type: !1044)
!1048 = !DILocalVariable(name: "optc", scope: !1041, file: !2, line: 79, type: !53)
!1049 = !DILocalVariable(name: "ok", scope: !1041, file: !2, line: 91, type: !133)
!1050 = !DILocalVariable(name: "NO_UID", scope: !1051, file: !2, line: 95, type: !1053)
!1051 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 93, column: 5)
!1052 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 92, column: 7)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !773, line: 79, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !173, line: 146, baseType: !59)
!1055 = !DILocalVariable(name: "NO_GID", scope: !1051, file: !2, line: 96, type: !772)
!1056 = !DILocalVariable(name: "ruid", scope: !1051, file: !2, line: 99, type: !1053)
!1057 = !DILocalVariable(name: "egid", scope: !1051, file: !2, line: 104, type: !772)
!1058 = !DILocalVariable(name: "rgid", scope: !1051, file: !2, line: 109, type: !772)
!1059 = !DILocalVariable(name: "pwd", scope: !1060, file: !2, line: 122, type: !1064)
!1060 = distinct !DILexicalBlock(scope: !1061, file: !2, line: 121, column: 9)
!1061 = distinct !DILexicalBlock(scope: !1062, file: !2, line: 120, column: 7)
!1062 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 120, column: 7)
!1063 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 118, column: 5)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1066, line: 49, size: 384, elements: !1067)
!1066 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1065, file: !1066, line: 51, baseType: !74, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1065, file: !1066, line: 52, baseType: !74, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1065, file: !1066, line: 54, baseType: !1054, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1065, file: !1066, line: 55, baseType: !774, size: 32, offset: 160)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1065, file: !1066, line: 56, baseType: !74, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1065, file: !1066, line: 57, baseType: !74, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1065, file: !1066, line: 58, baseType: !74, size: 64, offset: 320)
!1075 = !DILocalVariable(name: "ruid", scope: !1060, file: !2, line: 129, type: !1053)
!1076 = !DILocalVariable(name: "rgid", scope: !1060, file: !2, line: 130, type: !772)
!1077 = !DILocalVariable(name: "egid", scope: !1060, file: !2, line: 131, type: !772)
!1078 = !DILocation(line: 0, scope: !1041)
!1079 = !DILocation(line: 70, column: 21, scope: !1041)
!1080 = !DILocation(line: 70, column: 3, scope: !1041)
!1081 = !DILocation(line: 71, column: 3, scope: !1041)
!1082 = !DILocation(line: 72, column: 3, scope: !1041)
!1083 = !DILocation(line: 73, column: 3, scope: !1041)
!1084 = !DILocation(line: 75, column: 3, scope: !1041)
!1085 = !DILocation(line: 80, column: 18, scope: !1041)
!1086 = !DILocation(line: 80, column: 3, scope: !1041)
!1087 = !DILocation(line: 84, column: 9, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1089, file: !2, line: 83, column: 9)
!1089 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 81, column: 5)
!1090 = !DILocation(line: 85, column: 9, scope: !1088)
!1091 = !DILocation(line: 87, column: 11, scope: !1088)
!1092 = !DILocation(line: 92, column: 7, scope: !1052)
!1093 = !DILocation(line: 92, column: 14, scope: !1052)
!1094 = !DILocation(line: 92, column: 7, scope: !1041)
!1095 = !DILocation(line: 120, column: 22, scope: !1061)
!1096 = !DILocation(line: 120, column: 7, scope: !1062)
!1097 = !DILocation(line: 0, scope: !1051)
!1098 = !DILocation(line: 98, column: 7, scope: !1051)
!1099 = !DILocation(line: 98, column: 13, scope: !1051)
!1100 = !DILocation(line: 99, column: 20, scope: !1051)
!1101 = !DILocation(line: 100, column: 16, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 100, column: 11)
!1103 = !DILocation(line: 100, column: 26, scope: !1102)
!1104 = !DILocation(line: 100, column: 29, scope: !1102)
!1105 = !DILocation(line: 100, column: 11, scope: !1051)
!1106 = !DILocation(line: 101, column: 9, scope: !1102)
!1107 = !DILocation(line: 103, column: 13, scope: !1051)
!1108 = !DILocation(line: 104, column: 20, scope: !1051)
!1109 = !DILocation(line: 105, column: 16, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 105, column: 11)
!1111 = !DILocation(line: 105, column: 26, scope: !1110)
!1112 = !DILocation(line: 105, column: 29, scope: !1110)
!1113 = !DILocation(line: 105, column: 11, scope: !1051)
!1114 = !DILocation(line: 106, column: 9, scope: !1110)
!1115 = !DILocation(line: 108, column: 13, scope: !1051)
!1116 = !DILocation(line: 109, column: 20, scope: !1051)
!1117 = !DILocation(line: 110, column: 16, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 110, column: 11)
!1119 = !DILocation(line: 110, column: 26, scope: !1118)
!1120 = !DILocation(line: 110, column: 29, scope: !1118)
!1121 = !DILocation(line: 110, column: 11, scope: !1051)
!1122 = !DILocation(line: 111, column: 9, scope: !1118)
!1123 = !DILocation(line: 113, column: 12, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1051, file: !2, line: 113, column: 11)
!1125 = !DILocalVariable(name: "__c", arg: 1, scope: !1126, file: !1127, line: 108, type: !53)
!1126 = distinct !DISubprogram(name: "putchar_unlocked", scope: !1127, file: !1127, line: 108, type: !1128, scopeLine: 109, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1130)
!1127 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!53, !53}
!1130 = !{!1125}
!1131 = !DILocation(line: 0, scope: !1126, inlinedAt: !1132)
!1132 = distinct !DILocation(line: 115, column: 7, scope: !1051)
!1133 = !DILocation(line: 110, column: 10, scope: !1126, inlinedAt: !1132)
!1134 = !{!1135, !835, i64 40}
!1135 = !{!"_IO_FILE", !895, i64 0, !835, i64 8, !835, i64 16, !835, i64 24, !835, i64 32, !835, i64 40, !835, i64 48, !835, i64 56, !835, i64 64, !835, i64 72, !835, i64 80, !835, i64 88, !835, i64 96, !835, i64 104, !895, i64 112, !895, i64 116, !1136, i64 120, !936, i64 128, !836, i64 130, !836, i64 131, !835, i64 136, !1136, i64 144, !835, i64 152, !835, i64 160, !835, i64 168, !835, i64 176, !1136, i64 184, !895, i64 192, !836, i64 196}
!1136 = !{!"long", !836, i64 0}
!1137 = !{!1135, !835, i64 48}
!1138 = !{!"branch_weights", i32 2000, i32 1}
!1139 = !DILocation(line: 122, column: 42, scope: !1060)
!1140 = !DILocation(line: 122, column: 32, scope: !1060)
!1141 = !DILocation(line: 0, scope: !1060)
!1142 = !DILocation(line: 123, column: 19, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 123, column: 15)
!1144 = !DILocation(line: 123, column: 15, scope: !1060)
!1145 = !DILocation(line: 125, column: 15, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1143, file: !2, line: 124, column: 13)
!1147 = !DILocation(line: 127, column: 15, scope: !1146)
!1148 = !DILocation(line: 129, column: 29, scope: !1060)
!1149 = !{!1150, !895, i64 16}
!1150 = !{!"passwd", !835, i64 0, !835, i64 8, !895, i64 16, !895, i64 20, !835, i64 24, !835, i64 32, !835, i64 40}
!1151 = !DILocation(line: 130, column: 29, scope: !1060)
!1152 = !{!1150, !895, i64 20}
!1153 = !DILocation(line: 133, column: 11, scope: !1060)
!1154 = !DILocation(line: 134, column: 39, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 134, column: 15)
!1156 = !DILocation(line: 134, column: 34, scope: !1155)
!1157 = !DILocation(line: 134, column: 16, scope: !1155)
!1158 = !DILocation(line: 134, column: 15, scope: !1060)
!1159 = !DILocation(line: 0, scope: !1126, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 136, column: 11, scope: !1060)
!1161 = !DILocation(line: 110, column: 10, scope: !1126, inlinedAt: !1160)
!1162 = !DILocation(line: 138, column: 15, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 138, column: 15)
!1164 = !DILocalVariable(name: "__stream", arg: 1, scope: !1165, file: !1127, line: 135, type: !146)
!1165 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1127, file: !1127, line: 135, type: !1166, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1168)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!53, !146}
!1168 = !{!1164}
!1169 = !DILocation(line: 0, scope: !1165, inlinedAt: !1170)
!1170 = distinct !DILocation(line: 138, column: 15, scope: !1163)
!1171 = !DILocation(line: 137, column: 10, scope: !1165, inlinedAt: !1170)
!1172 = !{!1135, !895, i64 0}
!1173 = !DILocation(line: 138, column: 15, scope: !1060)
!1174 = !DILocation(line: 948, column: 21, scope: !1175, inlinedAt: !1178)
!1175 = distinct !DISubprogram(name: "write_error", scope: !52, file: !52, line: 946, type: !420, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !1176)
!1176 = !{!1177}
!1177 = !DILocalVariable(name: "saved_errno", scope: !1175, file: !52, line: 948, type: !53)
!1178 = distinct !DILocation(line: 139, column: 13, scope: !1163)
!1179 = !DILocation(line: 0, scope: !1175, inlinedAt: !1178)
!1180 = !DILocation(line: 949, column: 3, scope: !1175, inlinedAt: !1178)
!1181 = !DILocation(line: 950, column: 11, scope: !1175, inlinedAt: !1178)
!1182 = !DILocation(line: 950, column: 3, scope: !1175, inlinedAt: !1178)
!1183 = !DILocation(line: 951, column: 3, scope: !1175, inlinedAt: !1178)
!1184 = !DILocation(line: 952, column: 3, scope: !1175, inlinedAt: !1178)
!1185 = !DILocation(line: 120, column: 36, scope: !1061)
!1186 = distinct !{!1186, !1096, !1187, !941}
!1187 = !DILocation(line: 140, column: 9, scope: !1062)
!1188 = !DILocation(line: 143, column: 10, scope: !1041)
!1189 = !DILocation(line: 144, column: 1, scope: !1041)
!1190 = !DISubprogram(name: "bindtextdomain", scope: !876, file: !876, line: 86, type: !1191, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!74, !80, !80}
!1193 = !DISubprogram(name: "textdomain", scope: !876, file: !876, line: 82, type: !1017, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1194 = !DISubprogram(name: "atexit", scope: !1015, file: !1015, line: 602, type: !1195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!53, !419}
!1197 = !DISubprogram(name: "getopt_long", scope: !316, file: !316, line: 66, type: !1198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!53, !53, !1200, !80, !1202, !321}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!1203 = !DISubprogram(name: "__errno_location", scope: !1204, file: !1204, line: 37, type: !1205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1204 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!321}
!1207 = !DISubprogram(name: "getuid", scope: !1208, file: !1208, line: 697, type: !1209, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1208 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1054}
!1211 = !DISubprogram(name: "getegid", scope: !1208, file: !1208, line: 706, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!774}
!1214 = !DISubprogram(name: "getgid", scope: !1208, file: !1208, line: 703, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1215 = !DISubprogram(name: "__overflow", scope: !379, file: !379, line: 886, type: !1216, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!53, !146, !53}
!1218 = !DISubprogram(name: "getpwnam", scope: !1066, file: !1066, line: 116, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!1064, !80}
!1221 = !DISubprogram(name: "fflush_unlocked", scope: !379, file: !379, line: 239, type: !1166, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1222 = !DISubprogram(name: "clearerr_unlocked", scope: !379, file: !379, line: 794, type: !1223, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !879)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !146}
