; ModuleID = 'src/head.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.linebuffer = type { [8193 x i8], i64, i64, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.8 }
%union.anon.8 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7

!160 = distinct !DIGlobalVariable(scope: null, file: !2, line: 995, type: !161, isLocal: true, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 30)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1014, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 18)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 14)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 16)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1054, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 13)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "presume_input_pipe", scope: !70, file: !2, line: 55, type: !186, isLocal: true, isDefinition: true)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "print_headers", scope: !70, file: !2, line: 58, type: !186, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !70, file: !2, line: 70, type: !186, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(scope: null, file: !82, line: 729, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 56)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !82, line: 736, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 75)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !203, file: !82, line: 575, type: !67, isLocal: true, isDefinition: true)
!203 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !204, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !206)
!204 = !DISubroutineType(cc: DW_CC_nocall, types: !205)
!205 = !{null, !131, !131}
!206 = !{!207, !208, !209, !212, !213, !214, !215, !219, !220, !221, !222, !224, !277, !278, !279, !281, !282}
!207 = !DILocalVariable(name: "program", arg: 1, scope: !203, file: !82, line: 573, type: !131)
!208 = !DILocalVariable(name: "option", arg: 2, scope: !203, file: !82, line: 573, type: !131)
!209 = !DILocalVariable(name: "term", scope: !210, file: !82, line: 585, type: !131)
!210 = distinct !DILexicalBlock(scope: !211, file: !82, line: 582, column: 5)
!211 = distinct !DILexicalBlock(scope: !203, file: !82, line: 581, column: 7)
!212 = !DILocalVariable(name: "double_space", scope: !203, file: !82, line: 594, type: !186)
!213 = !DILocalVariable(name: "first_word", scope: !203, file: !82, line: 595, type: !131)
!214 = !DILocalVariable(name: "option_text", scope: !203, file: !82, line: 596, type: !131)
!215 = !DILocalVariable(name: "s", scope: !216, file: !82, line: 608, type: !131)
!216 = distinct !DILexicalBlock(scope: !217, file: !82, line: 605, column: 5)
!217 = distinct !DILexicalBlock(scope: !218, file: !82, line: 604, column: 12)
!218 = distinct !DILexicalBlock(scope: !203, file: !82, line: 597, column: 7)
!219 = !DILocalVariable(name: "spaces", scope: !216, file: !82, line: 609, type: !134)
!220 = !DILocalVariable(name: "anchor_len", scope: !203, file: !82, line: 620, type: !134)
!221 = !DILocalVariable(name: "desc_text", scope: !203, file: !82, line: 625, type: !131)
!222 = !DILocalVariable(name: "__ptr", scope: !223, file: !82, line: 644, type: !131)
!223 = distinct !DILexicalBlock(scope: !203, file: !82, line: 644, column: 3)
!224 = !DILocalVariable(name: "__stream", scope: !223, file: !82, line: 644, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !227, line: 7, baseType: !228)
!227 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !229, line: 49, size: 1728, elements: !230)
!229 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !246, !248, !249, !250, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !228, file: !229, line: 51, baseType: !67, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !228, file: !229, line: 54, baseType: !69, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !228, file: !229, line: 55, baseType: !69, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !228, file: !229, line: 56, baseType: !69, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !228, file: !229, line: 57, baseType: !69, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !228, file: !229, line: 58, baseType: !69, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !228, file: !229, line: 59, baseType: !69, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !228, file: !229, line: 60, baseType: !69, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !228, file: !229, line: 61, baseType: !69, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !228, file: !229, line: 64, baseType: !69, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !228, file: !229, line: 65, baseType: !69, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !228, file: !229, line: 66, baseType: !69, size: 64, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !228, file: !229, line: 68, baseType: !244, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !229, line: 36, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !228, file: !229, line: 70, baseType: !247, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !228, file: !229, line: 72, baseType: !67, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !228, file: !229, line: 73, baseType: !67, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !228, file: !229, line: 74, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !252, line: 152, baseType: !253)
!252 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!253 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !228, file: !229, line: 77, baseType: !133, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !228, file: !229, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !228, file: !229, line: 79, baseType: !146, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !228, file: !229, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !229, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !228, file: !229, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !252, line: 153, baseType: !253)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !228, file: !229, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !229, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !228, file: !229, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !229, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !228, file: !229, line: 93, baseType: !247, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !228, file: !229, line: 94, baseType: !128, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !228, file: !229, line: 95, baseType: !134, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !228, file: !229, line: 96, baseType: !67, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !228, file: !229, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !223, file: !82, line: 644, type: !134)
!278 = !DILocalVariable(name: "url_program", scope: !203, file: !82, line: 648, type: !131)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !82, line: 686, type: !131)
!280 = distinct !DILexicalBlock(scope: !203, file: !82, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !82, line: 686, type: !225)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !82, line: 686, type: !134)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !82, line: 585, type: !19, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !82, line: 586, type: !19, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !82, line: 595, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 4)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !82, line: 620, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 6)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !141, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !19, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !289, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !82, line: 650, type: !19, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !294, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !294, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !82, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !82, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !82, line: 654, type: !151, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !82, line: 655, type: !151, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !82, line: 656, type: !151, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !82, line: 657, type: !151, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !82, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !82, line: 664, type: !151, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 17)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 40)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 15)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 61)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !82, line: 679, type: !305, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !82, line: 683, type: !19, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !82, line: 688, type: !19, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !82, line: 691, type: !321, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !82, line: 839, type: !176, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !82, line: 840, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 22)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !82, line: 841, type: !348, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(scope: null, file: !82, line: 862, type: !289, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !82, line: 868, type: !377, isLocal: true, isDefinition: true)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 71)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !82, line: 875, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 27)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !387, isLocal: true, isDefinition: true)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 51)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 12)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "line_end", scope: !70, file: !2, line: 61, type: !4, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 907, type: !348, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !2, line: 909, type: !156, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 910, type: !156, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !294, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !294, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !274, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 92, type: !294, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 93, type: !316, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !321, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !176, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 96, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 97, type: !321, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "long_options", scope: !70, file: !2, line: 86, type: !423, isLocal: true, isDefinition: true)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 2560, elements: !152)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !426, line: 50, size: 256, elements: !427)
!426 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!427 = !{!428, !429, !430, !432}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !425, file: !426, line: 52, baseType: !131, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !425, file: !426, line: 55, baseType: !67, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !425, file: !426, line: 56, baseType: !431, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !425, file: !426, line: 57, baseType: !67, size: 32, offset: 192)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 875, type: !348, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 883, type: !382, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 891, type: !439, isLocal: true, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 19)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !2, line: 842, type: !176, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "first_file", scope: !446, file: !2, line: 181, type: !186, isLocal: true, isDefinition: true)
!446 = distinct !DISubprogram(name: "write_header", scope: !2, file: !2, line: 179, type: !447, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !449)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !131}
!449 = !{!450}
!450 = !DILocalVariable(name: "filename", arg: 1, scope: !446, file: !2, line: 179, type: !131)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !171, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !141, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !161, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !3, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !338, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !2, line: 197, type: !176, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !338, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 29)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !141, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 11)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 520, elements: !40)
!480 = !{!481, !482, !483, !484, !485, !486, !490, !491, !492, !493, !496, !497, !498, !499}
!481 = !DILocalVariable(name: "argc", arg: 1, scope: !64, file: !2, line: 915, type: !67)
!482 = !DILocalVariable(name: "argv", arg: 2, scope: !64, file: !2, line: 915, type: !68)
!483 = !DILocalVariable(name: "header_mode", scope: !64, file: !2, line: 917, type: !72)
!484 = !DILocalVariable(name: "ok", scope: !64, file: !2, line: 918, type: !186)
!485 = !DILocalVariable(name: "c", scope: !64, file: !2, line: 919, type: !67)
!486 = !DILocalVariable(name: "n_units", scope: !64, file: !2, line: 923, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !488, line: 102, baseType: !489)
!488 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !252, line: 73, baseType: !136)
!490 = !DILocalVariable(name: "count_lines", scope: !64, file: !2, line: 927, type: !186)
!491 = !DILocalVariable(name: "elide_from_end", scope: !64, file: !2, line: 931, type: !186)
!492 = !DILocalVariable(name: "file_list", scope: !64, file: !2, line: 936, type: !129)
!493 = !DILocalVariable(name: "a", scope: !494, file: !2, line: 948, type: !69)
!494 = distinct !DILexicalBlock(scope: !495, file: !2, line: 947, column: 5)
!495 = distinct !DILexicalBlock(scope: !64, file: !2, line: 946, column: 7)
!496 = !DILocalVariable(name: "n_string", scope: !494, file: !2, line: 949, type: !69)
!497 = !DILocalVariable(name: "end_n_string", scope: !494, file: !2, line: 950, type: !69)
!498 = !DILocalVariable(name: "multiplier_char", scope: !494, file: !2, line: 951, type: !4)
!499 = !DILocalVariable(name: "i", scope: !500, file: !2, line: 1073, type: !134)
!500 = distinct !DILexicalBlock(scope: !64, file: !2, line: 1073, column: 3)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 128, elements: !142)
!502 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551606, DW_OP_mul, DW_OP_constu, 10, DW_OP_plus, DW_OP_stack_value))
!503 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !509, line: 3, type: !348, isLocal: true, isDefinition: true)
!509 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "Version", scope: !512, file: !509, line: 3, type: !131, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C11, file: !509, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !513, splitDebugInlining: false, nameTableKind: None)
!513 = !{!507, !510}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "file_name", scope: !516, file: !517, line: 45, type: !131, isLocal: true, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C11, file: !517, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !518, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!518 = !{!519, !521, !523, !525, !514, !527}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !517, line: 121, type: !316, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !517, line: 121, type: !392, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !517, line: 123, type: !316, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !517, line: 126, type: !305, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !516, file: !517, line: 55, type: !186, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !531, file: !532, line: 66, type: !583, isLocal: false, isDefinition: true)
!531 = distinct !DICompileUnit(language: DW_LANG_C11, file: !532, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!532 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!533 = !{!128, !137}
!534 = !{!535, !537, !562, !564, !566, !568, !529, !570, !572, !574, !576, !581}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !532, line: 272, type: !19, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "old_file_name", scope: !539, file: !532, line: 304, type: !131, isLocal: true, isDefinition: true)
!539 = distinct !DISubprogram(name: "verror_at_line", scope: !532, file: !532, line: 298, type: !540, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !531, retainedNodes: !555)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !67, !67, !131, !73, !131, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !543, line: 52, baseType: !544)
!543 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !545, line: 14, baseType: !546)
!545 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !547, baseType: !548)
!547 = !DIFile(filename: "lib/error.c", directory: "/src")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !549)
!549 = !{!550, !551, !552, !553, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !548, file: !547, baseType: !128, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !548, file: !547, baseType: !128, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !548, file: !547, baseType: !128, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !548, file: !547, baseType: !67, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !548, file: !547, baseType: !67, size: 32, offset: 224)
!555 = !{!556, !557, !558, !559, !560, !561}
!556 = !DILocalVariable(name: "status", arg: 1, scope: !539, file: !532, line: 298, type: !67)
!557 = !DILocalVariable(name: "errnum", arg: 2, scope: !539, file: !532, line: 298, type: !67)
!558 = !DILocalVariable(name: "file_name", arg: 3, scope: !539, file: !532, line: 298, type: !131)
!559 = !DILocalVariable(name: "line_number", arg: 4, scope: !539, file: !532, line: 298, type: !73)
!560 = !DILocalVariable(name: "message", arg: 5, scope: !539, file: !532, line: 298, type: !131)
!561 = !DILocalVariable(name: "args", arg: 6, scope: !539, file: !532, line: 298, type: !542)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "old_line_number", scope: !539, file: !532, line: 305, type: !73, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !532, line: 338, type: !289, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !532, line: 346, type: !321, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !532, line: 346, type: !141, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "error_message_count", scope: !531, file: !532, line: 69, type: !73, isLocal: false, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !531, file: !532, line: 295, type: !67, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !532, line: 208, type: !316, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !532, line: 208, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 21)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(scope: null, file: !532, line: 214, type: !19, isLocal: true, isDefinition: true)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "program_name", scope: !588, file: !589, line: 31, type: !131, isLocal: false, isDefinition: true)
!588 = distinct !DICompileUnit(language: DW_LANG_C11, file: !589, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !590, globals: !591, splitDebugInlining: false, nameTableKind: None)
!589 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!590 = !{!69}
!591 = !{!586, !592, !594}
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !589, line: 46, type: !321, isLocal: true, isDefinition: true)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !589, line: 49, type: !289, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "utf07FF", scope: !598, file: !599, line: 46, type: !626, isLocal: true, isDefinition: true)
!598 = distinct !DISubprogram(name: "proper_name_lite", scope: !599, file: !599, line: 38, type: !600, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !602, retainedNodes: !604)
!599 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!600 = !DISubroutineType(types: !601)
!601 = !{!131, !131, !131}
!602 = distinct !DICompileUnit(language: DW_LANG_C11, file: !599, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !603, splitDebugInlining: false, nameTableKind: None)
!603 = !{!596}
!604 = !{!605, !606, !607, !608, !613}
!605 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !598, file: !599, line: 38, type: !131)
!606 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !598, file: !599, line: 38, type: !131)
!607 = !DILocalVariable(name: "translation", scope: !598, file: !599, line: 40, type: !131)
!608 = !DILocalVariable(name: "w", scope: !598, file: !599, line: 47, type: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !610, line: 37, baseType: !611)
!610 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !252, line: 57, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !252, line: 42, baseType: !73)
!613 = !DILocalVariable(name: "mbs", scope: !598, file: !599, line: 48, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !615, line: 6, baseType: !616)
!615 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !617, line: 21, baseType: !618)
!617 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 13, size: 64, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !618, file: !617, line: 15, baseType: !67, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !618, file: !617, line: 20, baseType: !622, size: 32, offset: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !617, line: 16, size: 32, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !622, file: !617, line: 18, baseType: !73, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !622, file: !617, line: 19, baseType: !289, size: 32)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 16, elements: !142)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !629, line: 78, type: !321, isLocal: true, isDefinition: true)
!629 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !629, line: 79, type: !294, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !629, line: 80, type: !181, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !629, line: 81, type: !181, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !629, line: 82, type: !274, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !629, line: 83, type: !141, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !629, line: 84, type: !321, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !629, line: 85, type: !316, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !629, line: 86, type: !316, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !629, line: 87, type: !321, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !650, file: !629, line: 76, type: !722, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !629, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !651, retainedTypes: !657, globals: !658, splitDebugInlining: false, nameTableKind: None)
!651 = !{!108, !652, !86}
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !109, line: 254, baseType: !73, size: 32, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!655 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!656 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!657 = !{!67, !133, !134}
!658 = !{!627, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !659, !663, !673, !675, !680, !682, !684, !686, !688, !711, !718, !720}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !650, file: !629, line: 92, type: !661, isLocal: false, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 320, elements: !152)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !650, file: !629, line: 1040, type: !665, isLocal: false, isDefinition: true)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !629, line: 56, size: 448, elements: !666)
!666 = !{!667, !668, !669, !671, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !665, file: !629, line: 59, baseType: !108, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !665, file: !629, line: 62, baseType: !67, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !665, file: !629, line: 66, baseType: !670, size: 256, offset: 64)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 256, elements: !322)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !665, file: !629, line: 69, baseType: !131, size: 64, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !665, file: !629, line: 72, baseType: !131, size: 64, offset: 384)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !650, file: !629, line: 107, type: !665, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "slot0", scope: !650, file: !629, line: 831, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 256)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !629, line: 321, type: !141, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !629, line: 357, type: !141, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !629, line: 358, type: !141, isLocal: true, isDefinition: true)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(scope: null, file: !629, line: 199, type: !316, isLocal: true, isDefinition: true)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "quote", scope: !690, file: !629, line: 228, type: !709, isLocal: true, isDefinition: true)
!690 = distinct !DISubprogram(name: "gettext_quote", scope: !629, file: !629, line: 197, type: !691, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !693)
!691 = !DISubroutineType(types: !692)
!692 = !{!131, !131, !108}
!693 = !{!694, !695, !696, !697, !698}
!694 = !DILocalVariable(name: "msgid", arg: 1, scope: !690, file: !629, line: 197, type: !131)
!695 = !DILocalVariable(name: "s", arg: 2, scope: !690, file: !629, line: 197, type: !108)
!696 = !DILocalVariable(name: "translation", scope: !690, file: !629, line: 199, type: !131)
!697 = !DILocalVariable(name: "w", scope: !690, file: !629, line: 229, type: !609)
!698 = !DILocalVariable(name: "mbs", scope: !690, file: !629, line: 230, type: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !615, line: 6, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !617, line: 21, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 13, size: 64, elements: !702)
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !701, file: !617, line: 15, baseType: !67, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !701, file: !617, line: 20, baseType: !705, size: 32, offset: 32)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !701, file: !617, line: 16, size: 32, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !705, file: !617, line: 18, baseType: !73, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !705, file: !617, line: 19, baseType: !289, size: 32)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 64, elements: !710)
!710 = !{!143, !291}
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "slotvec", scope: !650, file: !629, line: 834, type: !713, isLocal: true, isDefinition: true)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !629, line: 823, size: 128, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !714, file: !629, line: 825, baseType: !134, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !714, file: !629, line: 826, baseType: !69, size: 64, offset: 64)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "nslots", scope: !650, file: !629, line: 832, type: !67, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "slotvec0", scope: !650, file: !629, line: 833, type: !714, isLocal: true, isDefinition: true)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 704, elements: !475)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !725, line: 67, type: !392, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !725, line: 69, type: !316, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !316, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !289, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !725, line: 85, type: !141, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 171)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 34)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !725, line: 105, type: !176, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !725, line: 109, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 23)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !725, line: 113, type: !753, isLocal: true, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 28)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !725, line: 120, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 32)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !725, line: 127, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 36)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !725, line: 134, type: !343, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(scope: null, file: !725, line: 142, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 44)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !725, line: 150, type: !775, isLocal: true, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 48)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !725, line: 159, type: !780, isLocal: true, isDefinition: true)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 52)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !725, line: 170, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 60)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !274, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !368, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !274, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !171, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !343, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !3, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !467, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !804, file: !805, line: 26, type: !807, isLocal: false, isDefinition: true)
!804 = distinct !DICompileUnit(language: DW_LANG_C11, file: !805, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !806, splitDebugInlining: false, nameTableKind: None)
!805 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!806 = !{!802}
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 376, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 47)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "exit_failure", scope: !812, file: !813, line: 24, type: !815, isLocal: false, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !814, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!814 = !{!810}
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !305, isLocal: true, isDefinition: true)
!818 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !316, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !818, line: 34, type: !338, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !825, line: 80, type: !316, isLocal: true, isDefinition: true)
!825 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !828, line: 108, type: !146, isLocal: true, isDefinition: true)
!828 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "internal_state", scope: !831, file: !828, line: 97, type: !834, isLocal: true, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !832, globals: !833, splitDebugInlining: false, nameTableKind: None)
!832 = !{!128, !134, !137}
!833 = !{!826, !829}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !615, line: 6, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !617, line: 21, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 13, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !836, file: !617, line: 15, baseType: !67, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !836, file: !617, line: 20, baseType: !840, size: 32, offset: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !617, line: 16, size: 32, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !840, file: !617, line: 18, baseType: !73, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !840, file: !617, line: 19, baseType: !289, size: 32)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !141, isLocal: true, isDefinition: true)
!846 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !846, line: 35, type: !294, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !851, line: 202, type: !316, isLocal: true, isDefinition: true)
!851 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !854, file: !851, line: 211, type: !1038, isLocal: true, isDefinition: true)
!854 = distinct !DISubprogram(name: "printf_fetchargs", scope: !851, file: !851, line: 42, type: !855, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1029, retainedNodes: !1033)
!855 = !DISubroutineType(types: !856)
!856 = !{!67, !857, !867}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !545, line: 22, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !859, baseType: !860)
!859 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !861)
!861 = !{!862, !863, !864, !865, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !860, file: !859, baseType: !128, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !860, file: !859, baseType: !128, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !860, file: !859, baseType: !128, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !860, file: !859, baseType: !67, size: 32, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !860, file: !859, baseType: !67, size: 32, offset: 224)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !869, line: 185, baseType: !870)
!869 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !869, line: 179, size: 1920, elements: !871)
!871 = !{!872, !873, !1027}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !870, file: !869, line: 181, baseType: !134, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !870, file: !869, line: 182, baseType: !874, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !869, line: 174, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !869, line: 111, size: 256, elements: !877)
!877 = !{!878, !929}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !876, file: !869, line: 113, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !869, line: 108, baseType: !880)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !869, line: 47, baseType: !73, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928}
!882 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!883 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!884 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!885 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!886 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!887 = !DIEnumerator(name: "TYPE_INT", value: 5)
!888 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!889 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!890 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!891 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!892 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!893 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!894 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!895 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!896 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!897 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!898 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!899 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!900 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!901 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!902 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!903 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!904 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!905 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!906 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!907 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!908 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!909 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!910 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!911 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!912 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!913 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!914 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!915 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!916 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!917 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!918 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!919 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!920 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!921 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!922 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!923 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!924 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!925 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!926 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!927 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!928 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !876, file: !869, line: 172, baseType: !930, size: 128, offset: 128)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !876, file: !869, line: 114, size: 128, elements: !931)
!931 = !{!932, !933, !934, !936, !937, !938, !939, !940, !941, !943, !945, !949, !953, !956, !959, !962, !964, !967, !970, !972, !974, !976, !978, !980, !982, !984, !986, !988, !990, !992, !993, !996, !997, !1001, !1002, !1004, !1006, !1007, !1009, !1011, !1013, !1015, !1017, !1019, !1021, !1023, !1025}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !930, file: !869, line: 116, baseType: !256, size: 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !930, file: !869, line: 117, baseType: !137, size: 8)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !930, file: !869, line: 118, baseType: !935, size: 16)
!935 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !930, file: !869, line: 119, baseType: !133, size: 16)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !930, file: !869, line: 120, baseType: !67, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !930, file: !869, line: 121, baseType: !73, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !930, file: !869, line: 122, baseType: !253, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !930, file: !869, line: 123, baseType: !136, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !930, file: !869, line: 124, baseType: !942, size: 64)
!942 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !930, file: !869, line: 125, baseType: !944, size: 64)
!944 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !930, file: !869, line: 126, baseType: !946, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !947, line: 24, baseType: !948)
!947 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !252, line: 37, baseType: !256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !930, file: !869, line: 127, baseType: !950, size: 8)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !951, line: 24, baseType: !952)
!951 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !252, line: 38, baseType: !137)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !930, file: !869, line: 128, baseType: !954, size: 16)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !947, line: 25, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !252, line: 39, baseType: !935)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !930, file: !869, line: 129, baseType: !957, size: 16)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !951, line: 25, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !252, line: 40, baseType: !133)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !930, file: !869, line: 130, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !947, line: 26, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !252, line: 41, baseType: !67)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !930, file: !869, line: 131, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !951, line: 26, baseType: !612)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !930, file: !869, line: 132, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !947, line: 27, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !252, line: 44, baseType: !253)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !930, file: !869, line: 133, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !951, line: 27, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !252, line: 45, baseType: !136)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !930, file: !869, line: 134, baseType: !971, size: 8)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !488, line: 58, baseType: !256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !930, file: !869, line: 135, baseType: !973, size: 8)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !488, line: 71, baseType: !137)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !930, file: !869, line: 136, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !488, line: 60, baseType: !253)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !930, file: !869, line: 137, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !488, line: 73, baseType: !136)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !930, file: !869, line: 138, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !488, line: 61, baseType: !253)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !930, file: !869, line: 139, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !488, line: 74, baseType: !136)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !930, file: !869, line: 140, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !488, line: 62, baseType: !253)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !930, file: !869, line: 141, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !488, line: 75, baseType: !136)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !930, file: !869, line: 142, baseType: !987, size: 32)
!987 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !930, file: !869, line: 143, baseType: !989, size: 64)
!989 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !930, file: !869, line: 144, baseType: !991, size: 128)
!991 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !930, file: !869, line: 145, baseType: !67, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !930, file: !869, line: 147, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !995, line: 20, baseType: !73)
!995 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !930, file: !869, line: 149, baseType: !131, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !930, file: !869, line: 150, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !135, line: 74, baseType: !73)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !930, file: !869, line: 151, baseType: !128, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !930, file: !869, line: 152, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !930, file: !869, line: 153, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !930, file: !869, line: 154, baseType: !431, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !930, file: !869, line: 155, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !930, file: !869, line: 156, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !930, file: !869, line: 157, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !930, file: !869, line: 158, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !930, file: !869, line: 159, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !930, file: !869, line: 160, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !930, file: !869, line: 161, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !930, file: !869, line: 162, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !930, file: !869, line: 163, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !930, file: !869, line: 164, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !870, file: !869, line: 183, baseType: !1028, size: 1792, offset: 128)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 1792, elements: !317)
!1029 = distinct !DICompileUnit(language: DW_LANG_C11, file: !851, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1030, retainedTypes: !1031, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!1030 = !{!880}
!1031 = !{!128}
!1032 = !{!849, !852}
!1033 = !{!1034, !1035, !1036, !1037}
!1034 = !DILocalVariable(name: "args", arg: 1, scope: !854, file: !851, line: 42, type: !857)
!1035 = !DILocalVariable(name: "a", arg: 2, scope: !854, file: !851, line: 42, type: !867)
!1036 = !DILocalVariable(name: "i", scope: !854, file: !851, line: 44, type: !134)
!1037 = !DILocalVariable(name: "ap", scope: !854, file: !851, line: 45, type: !874)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 224, elements: !317)
!1039 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1040, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1040 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1041 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1042, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !590, splitDebugInlining: false, nameTableKind: None)
!1042 = !DIFile(filename: "lib/full-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "717d8293e026c44a771a83b22da54cc2")
!1043 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1044, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1044 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1045 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, retainedTypes: !1052, splitDebugInlining: false, nameTableKind: None)
!1046 = !DIFile(filename: "lib/safe-read.c", directory: "/src", checksumkind: CSK_MD5, checksum: "434e548fbeff241cc07e1dbcc7b4611f")
!1047 = !{!1048}
!1048 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1049, line: 36, baseType: !73, size: 32, elements: !1050)
!1049 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1050 = !{!1051}
!1051 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1052 = !{!134}
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1054, retainedTypes: !1031, globals: !1058, splitDebugInlining: false, nameTableKind: None)
!1054 = !{!1055}
!1055 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 40, baseType: !73, size: 32, elements: !1056)
!1056 = !{!1057}
!1057 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1058 = !{!723, !726, !728, !730, !732, !734, !739, !744, !746, !751, !756, !761, !766, !768, !773, !778, !783, !788, !790, !792, !794, !796, !798, !800}
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1092, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1061 = !{!1062, !1074}
!1062 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1063, file: !1060, line: 188, baseType: !73, size: 32, elements: !1072)
!1063 = distinct !DISubprogram(name: "x2nrealloc", scope: !1060, file: !1060, line: 176, type: !1064, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1059, retainedNodes: !1067)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!128, !128, !1066, !134}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!1067 = !{!1068, !1069, !1070, !1071}
!1068 = !DILocalVariable(name: "p", arg: 1, scope: !1063, file: !1060, line: 176, type: !128)
!1069 = !DILocalVariable(name: "pn", arg: 2, scope: !1063, file: !1060, line: 176, type: !1066)
!1070 = !DILocalVariable(name: "s", arg: 3, scope: !1063, file: !1060, line: 176, type: !134)
!1071 = !DILocalVariable(name: "n", scope: !1063, file: !1060, line: 178, type: !134)
!1072 = !{!1073}
!1073 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1074 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1075, file: !1060, line: 228, baseType: !73, size: 32, elements: !1072)
!1075 = distinct !DISubprogram(name: "xpalloc", scope: !1060, file: !1060, line: 223, type: !1076, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1059, retainedNodes: !1082)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!128, !128, !1078, !1079, !1081, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1080, line: 130, baseType: !1081)
!1080 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !135, line: 35, baseType: !253)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1083 = !DILocalVariable(name: "pa", arg: 1, scope: !1075, file: !1060, line: 223, type: !128)
!1084 = !DILocalVariable(name: "pn", arg: 2, scope: !1075, file: !1060, line: 223, type: !1078)
!1085 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1075, file: !1060, line: 223, type: !1079)
!1086 = !DILocalVariable(name: "n_max", arg: 4, scope: !1075, file: !1060, line: 223, type: !1081)
!1087 = !DILocalVariable(name: "s", arg: 5, scope: !1075, file: !1060, line: 223, type: !1079)
!1088 = !DILocalVariable(name: "n0", scope: !1075, file: !1060, line: 230, type: !1079)
!1089 = !DILocalVariable(name: "n", scope: !1075, file: !1060, line: 237, type: !1079)
!1090 = !DILocalVariable(name: "nbytes", scope: !1075, file: !1060, line: 248, type: !1079)
!1091 = !DILocalVariable(name: "adjusted_nbytes", scope: !1075, file: !1060, line: 252, type: !1079)
!1092 = !{!69, !128, !186, !253, !136}
!1093 = distinct !DICompileUnit(language: DW_LANG_C11, file: !818, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1094, splitDebugInlining: false, nameTableKind: None)
!1094 = !{!816, !819, !821}
!1095 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1096, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1097, globals: !1106, splitDebugInlining: false, nameTableKind: None)
!1096 = !DIFile(filename: "lib/xdectoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6a2abc20f912d83b8a29be2ad6ad0f21")
!1097 = !{!1098, !101}
!1098 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !1099, line: 30, baseType: !73, size: 32, elements: !1100)
!1099 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!1100 = !{!1101, !1102, !1103, !1104, !1105}
!1101 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!1102 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!1103 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!1104 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!1105 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!1106 = !{!823}
!1107 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1108, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1109, retainedTypes: !1110, splitDebugInlining: false, nameTableKind: None)
!1108 = !DIFile(filename: "lib/xstrtoumax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "54ffbccd458a53dd64c9445b3f0c9b17")
!1109 = !{!1098, !86}
!1110 = !{!67, !133, !69, !186, !136, !487}
!1111 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1112, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1031, splitDebugInlining: false, nameTableKind: None)
!1112 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!1113 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1114, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1114 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1116, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1116 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1117 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1118, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1031, splitDebugInlining: false, nameTableKind: None)
!1118 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1119 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1120, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1031, splitDebugInlining: false, nameTableKind: None)
!1120 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1121 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1122, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1123, splitDebugInlining: false, nameTableKind: None)
!1122 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1123 = !{!186, !136, !128}
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1125, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1030, retainedTypes: !1126, splitDebugInlining: false, nameTableKind: None)
!1125 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1126 = !{!69, !134, !128, !131, !73}
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !846, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1128, splitDebugInlining: false, nameTableKind: None)
!1128 = !{!844, !847}
!1129 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1130, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1130 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1131 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1132, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1031, splitDebugInlining: false, nameTableKind: None)
!1132 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1133 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1134, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1030, retainedTypes: !1135, splitDebugInlining: false, nameTableKind: None)
!1134 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!1135 = !{!134, !1136, !128, !1191}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !869, line: 174, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !869, line: 111, size: 256, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1138, file: !869, line: 113, baseType: !879, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1138, file: !869, line: 172, baseType: !1142, size: 128, offset: 128)
!1142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1138, file: !869, line: 114, size: 128, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1142, file: !869, line: 116, baseType: !256, size: 8)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1142, file: !869, line: 117, baseType: !137, size: 8)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1142, file: !869, line: 118, baseType: !935, size: 16)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1142, file: !869, line: 119, baseType: !133, size: 16)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1142, file: !869, line: 120, baseType: !67, size: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1142, file: !869, line: 121, baseType: !73, size: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1142, file: !869, line: 122, baseType: !253, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !1142, file: !869, line: 123, baseType: !136, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !1142, file: !869, line: 124, baseType: !942, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !1142, file: !869, line: 125, baseType: !944, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !1142, file: !869, line: 126, baseType: !946, size: 8)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !1142, file: !869, line: 127, baseType: !950, size: 8)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !1142, file: !869, line: 128, baseType: !954, size: 16)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !1142, file: !869, line: 129, baseType: !957, size: 16)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !1142, file: !869, line: 130, baseType: !960, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !1142, file: !869, line: 131, baseType: !963, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !1142, file: !869, line: 132, baseType: !965, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !1142, file: !869, line: 133, baseType: !968, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !1142, file: !869, line: 134, baseType: !971, size: 8)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !1142, file: !869, line: 135, baseType: !973, size: 8)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !1142, file: !869, line: 136, baseType: !975, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !1142, file: !869, line: 137, baseType: !977, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !1142, file: !869, line: 138, baseType: !979, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !1142, file: !869, line: 139, baseType: !981, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !1142, file: !869, line: 140, baseType: !983, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !1142, file: !869, line: 141, baseType: !985, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !1142, file: !869, line: 142, baseType: !987, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !1142, file: !869, line: 143, baseType: !989, size: 64)
