; ModuleID = 'src/hostid.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [89 x i8] c"Usage: %s [OPTION]\0APrint the numeric identifier (in hexadecimal) for the current host.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [7 x i8] c"hostid\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !27
@.str.6 = private unnamed_addr constant [10 x i8] c"coreutils\00", align 1, !dbg !32

!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !65, line: 676, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 61)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !65, line: 679, type: !122, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !65, line: 683, type: !99, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !65, line: 688, type: !99, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !65, line: 691, type: !135, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !65, line: 839, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 16)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !65, line: 840, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 22)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !65, line: 841, type: !159, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(scope: null, file: !65, line: 862, type: !106, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !65, line: 868, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 71)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !65, line: 875, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 27)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 51)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !65, line: 877, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 12)
!209 = !{!210, !211, !212, !215, !217, !218, !219, !223, !224, !225, !226, !228, !282, !283, !284, !286, !287}
!210 = !DILocalVariable(name: "program", arg: 1, scope: !64, file: !65, line: 573, type: !68)
!211 = !DILocalVariable(name: "option", arg: 2, scope: !64, file: !65, line: 573, type: !68)
!212 = !DILocalVariable(name: "term", scope: !213, file: !65, line: 585, type: !68)
!213 = distinct !DILexicalBlock(scope: !214, file: !65, line: 582, column: 5)
!214 = distinct !DILexicalBlock(scope: !64, file: !65, line: 581, column: 7)
!215 = !DILocalVariable(name: "double_space", scope: !64, file: !65, line: 594, type: !216)
!216 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!217 = !DILocalVariable(name: "first_word", scope: !64, file: !65, line: 595, type: !68)
!218 = !DILocalVariable(name: "option_text", scope: !64, file: !65, line: 596, type: !68)
!219 = !DILocalVariable(name: "s", scope: !220, file: !65, line: 608, type: !68)
!220 = distinct !DILexicalBlock(scope: !221, file: !65, line: 605, column: 5)
!221 = distinct !DILexicalBlock(scope: !222, file: !65, line: 604, column: 12)
!222 = distinct !DILexicalBlock(scope: !64, file: !65, line: 597, column: 7)
!223 = !DILocalVariable(name: "spaces", scope: !220, file: !65, line: 609, type: !92)
!224 = !DILocalVariable(name: "anchor_len", scope: !64, file: !65, line: 620, type: !92)
!225 = !DILocalVariable(name: "desc_text", scope: !64, file: !65, line: 625, type: !68)
!226 = !DILocalVariable(name: "__ptr", scope: !227, file: !65, line: 644, type: !68)
!227 = distinct !DILexicalBlock(scope: !64, file: !65, line: 644, column: 3)
!228 = !DILocalVariable(name: "__stream", scope: !227, file: !65, line: 644, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !232)
!231 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !234)
!233 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!234 = !{!235, !236, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !251, !253, !254, !255, !259, !260, !262, !263, !266, !268, !271, !274, !275, !276, !277, !278}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !232, file: !233, line: 51, baseType: !90, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !232, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !232, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !232, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !232, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !232, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !232, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !232, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !232, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !232, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !232, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !232, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !232, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !233, line: 36, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !232, file: !233, line: 70, baseType: !252, size: 64, offset: 832)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !232, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !232, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !232, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !257, line: 152, baseType: !258)
!257 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!258 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !232, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !232, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!261 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !232, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !232, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !233, line: 43, baseType: null)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !232, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !257, line: 153, baseType: !258)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !232, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !233, line: 37, flags: DIFlagFwdDecl)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !232, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !233, line: 38, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !232, file: !233, line: 93, baseType: !252, size: 64, offset: 1344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !232, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !232, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !232, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !232, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 20)
!282 = !DILocalVariable(name: "__cnt", scope: !227, file: !65, line: 644, type: !92)
!283 = !DILocalVariable(name: "url_program", scope: !64, file: !65, line: 648, type: !68)
!284 = !DILocalVariable(name: "__ptr", scope: !285, file: !65, line: 686, type: !68)
!285 = distinct !DILexicalBlock(scope: !64, file: !65, line: 686, column: 3)
!286 = !DILocalVariable(name: "__stream", scope: !285, file: !65, line: 686, type: !229)
!287 = !DILocalVariable(name: "__cnt", scope: !285, file: !65, line: 686, type: !92)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !290, line: 3, type: !159, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "Version", scope: !293, file: !290, line: 3, type: !68, isLocal: false, isDefinition: true)
!293 = distinct !DICompileUnit(language: DW_LANG_C11, file: !290, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !294, splitDebugInlining: false, nameTableKind: None)
!294 = !{!288, !291}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !298, line: 45, type: !68, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C11, file: !298, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !299, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!299 = !{!300, !302, !304, !306, !295, !308}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !14, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !298, line: 121, type: !206, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !298, line: 123, type: !14, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !298, line: 126, type: !122, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !298, line: 55, type: !216, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !312, file: !313, line: 66, type: !364, isLocal: false, isDefinition: true)
!312 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !314, globals: !315, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!314 = !{!89, !95}
!315 = !{!316, !318, !343, !345, !347, !349, !310, !351, !353, !355, !357, !362}
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !313, line: 272, type: !99, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "old_file_name", scope: !320, file: !313, line: 304, type: !68, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "verror_at_line", scope: !313, file: !313, line: 298, type: !321, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !336)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !90, !90, !68, !74, !68, !323}
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !324, line: 52, baseType: !325)
!324 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !326, line: 14, baseType: !327)
!326 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !328, baseType: !329)
!328 = !DIFile(filename: "lib/error.c", directory: "/src")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !330)
!330 = !{!331, !332, !333, !334, !335}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !329, file: !328, baseType: !89, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !329, file: !328, baseType: !89, size: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !329, file: !328, baseType: !89, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !329, file: !328, baseType: !90, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !329, file: !328, baseType: !90, size: 32, offset: 224)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !320, file: !313, line: 298, type: !90)
!338 = !DILocalVariable(name: "errnum", arg: 2, scope: !320, file: !313, line: 298, type: !90)
!339 = !DILocalVariable(name: "file_name", arg: 3, scope: !320, file: !313, line: 298, type: !68)
!340 = !DILocalVariable(name: "line_number", arg: 4, scope: !320, file: !313, line: 298, type: !74)
!341 = !DILocalVariable(name: "message", arg: 5, scope: !320, file: !313, line: 298, type: !68)
!342 = !DILocalVariable(name: "args", arg: 6, scope: !320, file: !313, line: 298, type: !323)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "old_line_number", scope: !320, file: !313, line: 305, type: !74, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !313, line: 338, type: !106, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !135, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !313, line: 346, type: !113, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "error_message_count", scope: !312, file: !313, line: 69, type: !74, isLocal: false, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !312, file: !313, line: 295, type: !90, isLocal: false, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !14, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !313, line: 208, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 21)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !313, line: 214, type: !99, isLocal: true, isDefinition: true)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !369, line: 60, type: !113, isLocal: true, isDefinition: true)
!369 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "long_options", scope: !372, file: !369, line: 34, type: !380, isLocal: true, isDefinition: true)
!372 = distinct !DICompileUnit(language: DW_LANG_C11, file: !369, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !373, splitDebugInlining: false, nameTableKind: None)
!373 = !{!367, !374, !376, !378, !370}
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !369, line: 112, type: !29, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !369, line: 36, type: !99, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !369, line: 37, type: !135, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 768, elements: !123)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !383, line: 50, size: 256, elements: !384)
!383 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!384 = !{!385, !386, !387, !389}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !383, line: 52, baseType: !68, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !382, file: !383, line: 55, baseType: !90, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !382, file: !383, line: 56, baseType: !388, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !382, file: !383, line: 57, baseType: !90, size: 32, offset: 192)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "program_name", scope: !392, file: !393, line: 31, type: !68, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C11, file: !393, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !394, globals: !395, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!394 = !{!237}
!395 = !{!390, !396, !398}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !393, line: 46, type: !135, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !393, line: 49, type: !106, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "utf07FF", scope: !402, file: !403, line: 46, type: !430, isLocal: true, isDefinition: true)
!402 = distinct !DISubprogram(name: "proper_name_lite", scope: !403, file: !403, line: 38, type: !404, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !406, retainedNodes: !408)
!403 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!404 = !DISubroutineType(types: !405)
!405 = !{!68, !68, !68}
!406 = distinct !DICompileUnit(language: DW_LANG_C11, file: !403, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !407, splitDebugInlining: false, nameTableKind: None)
!407 = !{!400}
!408 = !{!409, !410, !411, !412, !417}
!409 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !402, file: !403, line: 38, type: !68)
!410 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !402, file: !403, line: 38, type: !68)
!411 = !DILocalVariable(name: "translation", scope: !402, file: !403, line: 40, type: !68)
!412 = !DILocalVariable(name: "w", scope: !402, file: !403, line: 47, type: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !414, line: 37, baseType: !415)
!414 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !257, line: 57, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !257, line: 42, baseType: !74)
!417 = !DILocalVariable(name: "mbs", scope: !402, file: !403, line: 48, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !419, line: 6, baseType: !420)
!419 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !421, line: 21, baseType: !422)
!421 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 13, size: 64, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !422, file: !421, line: 15, baseType: !90, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !422, file: !421, line: 20, baseType: !426, size: 32, offset: 32)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !422, file: !421, line: 16, size: 32, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !426, file: !421, line: 18, baseType: !74, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !426, file: !421, line: 19, baseType: !106, size: 32)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !114)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !433, line: 78, type: !135, isLocal: true, isDefinition: true)
!433 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !433, line: 79, type: !59, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !433, line: 80, type: !49, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !433, line: 81, type: !49, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !433, line: 82, type: !279, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !433, line: 83, type: !113, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !433, line: 84, type: !135, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !433, line: 85, type: !14, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !433, line: 86, type: !14, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !433, line: 87, type: !135, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !454, file: !433, line: 76, type: !540, isLocal: false, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C11, file: !433, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !455, retainedTypes: !475, globals: !476, splitDebugInlining: false, nameTableKind: None)
!455 = !{!456, !470, !72}
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !457, line: 42, baseType: !74, size: 32, elements: !458)
!457 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!459 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!460 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!461 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!462 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!463 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!464 = !DIEnumerator(name: "c_quoting_style", value: 5)
!465 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!466 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!467 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!468 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!469 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !457, line: 254, baseType: !74, size: 32, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!473 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!474 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!475 = !{!90, !91, !92}
!476 = !{!431, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !477, !481, !491, !493, !498, !500, !502, !504, !506, !529, !536, !538}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !454, file: !433, line: 92, type: !479, isLocal: false, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 320, elements: !35)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !454, file: !433, line: 1040, type: !483, isLocal: false, isDefinition: true)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !433, line: 56, size: 448, elements: !484)
!484 = !{!485, !486, !487, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !483, file: !433, line: 59, baseType: !456, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !433, line: 62, baseType: !90, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !483, file: !433, line: 66, baseType: !488, size: 256, offset: 64)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !136)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !483, file: !433, line: 69, baseType: !68, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !483, file: !433, line: 72, baseType: !68, size: 64, offset: 384)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !454, file: !433, line: 107, type: !483, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "slot0", scope: !454, file: !433, line: 831, type: !495, isLocal: true, isDefinition: true)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 256)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !433, line: 321, type: !113, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !433, line: 357, type: !113, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !433, line: 358, type: !113, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !433, line: 199, type: !14, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "quote", scope: !508, file: !433, line: 228, type: !527, isLocal: true, isDefinition: true)
!508 = distinct !DISubprogram(name: "gettext_quote", scope: !433, file: !433, line: 197, type: !509, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !454, retainedNodes: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!68, !68, !456}
!511 = !{!512, !513, !514, !515, !516}
!512 = !DILocalVariable(name: "msgid", arg: 1, scope: !508, file: !433, line: 197, type: !68)
!513 = !DILocalVariable(name: "s", arg: 2, scope: !508, file: !433, line: 197, type: !456)
!514 = !DILocalVariable(name: "translation", scope: !508, file: !433, line: 199, type: !68)
!515 = !DILocalVariable(name: "w", scope: !508, file: !433, line: 229, type: !413)
!516 = !DILocalVariable(name: "mbs", scope: !508, file: !433, line: 230, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !419, line: 6, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !421, line: 21, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 13, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !519, file: !421, line: 15, baseType: !90, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !519, file: !421, line: 20, baseType: !523, size: 32, offset: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !519, file: !421, line: 16, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !523, file: !421, line: 18, baseType: !74, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !523, file: !421, line: 19, baseType: !106, size: 32)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 64, elements: !528)
!528 = !{!115, !108}
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "slotvec", scope: !454, file: !433, line: 834, type: !531, isLocal: true, isDefinition: true)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !433, line: 823, size: 128, elements: !533)
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !532, file: !433, line: 825, baseType: !92, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !532, file: !433, line: 826, baseType: !237, size: 64, offset: 64)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "nslots", scope: !454, file: !433, line: 832, type: !90, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "slotvec0", scope: !454, file: !433, line: 833, type: !532, isLocal: true, isDefinition: true)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 704, elements: !542)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!542 = !{!543}
!543 = !DISubrange(count: 11)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !546, line: 67, type: !206, isLocal: true, isDefinition: true)
!546 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !546, line: 69, type: !14, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !546, line: 83, type: !14, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !546, line: 83, type: !106, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !546, line: 85, type: !113, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !546, line: 88, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 171)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !546, line: 88, type: !562, isLocal: true, isDefinition: true)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 34)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !546, line: 105, type: !177, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !546, line: 109, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 23)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !546, line: 113, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 28)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !546, line: 120, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 32)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !546, line: 127, type: !584, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 36)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !546, line: 134, type: !154, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !546, line: 142, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 44)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !546, line: 150, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 48)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !546, line: 159, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 52)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !546, line: 170, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 60)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !546, line: 248, type: !279, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !546, line: 248, type: !182, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !546, line: 254, type: !279, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !546, line: 254, type: !44, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !546, line: 254, type: !154, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !546, line: 259, type: !3, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !546, line: 259, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 29)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !628, file: !629, line: 26, type: !631, isLocal: false, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C11, file: !629, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !630, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!630 = !{!626}
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 376, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 47)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "exit_failure", scope: !636, file: !637, line: 24, type: !639, isLocal: false, isDefinition: true)
!636 = distinct !DICompileUnit(language: DW_LANG_C11, file: !637, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !638, splitDebugInlining: false, nameTableKind: None)
!637 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!638 = !{!634}
!639 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !90)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !642, line: 34, type: !122, isLocal: true, isDefinition: true)
!642 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !642, line: 34, type: !14, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !642, line: 34, type: !54, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !649, line: 108, type: !29, isLocal: true, isDefinition: true)
!649 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "internal_state", scope: !652, file: !649, line: 97, type: !655, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !649, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !653, globals: !654, splitDebugInlining: false, nameTableKind: None)
!653 = !{!89, !92, !95}
!654 = !{!647, !650}
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !419, line: 6, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !421, line: 21, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 13, size: 64, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !657, file: !421, line: 15, baseType: !90, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !657, file: !421, line: 20, baseType: !661, size: 32, offset: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !657, file: !421, line: 16, size: 32, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !661, file: !421, line: 18, baseType: !74, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !661, file: !421, line: 19, baseType: !106, size: 32)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !667, line: 35, type: !113, isLocal: true, isDefinition: true)
!667 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !667, line: 35, type: !59, isLocal: true, isDefinition: true)
!670 = distinct !DICompileUnit(language: DW_LANG_C11, file: !671, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!672 = distinct !DICompileUnit(language: DW_LANG_C11, file: !546, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !677, globals: !678, splitDebugInlining: false, nameTableKind: None)
!673 = !{!674}
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !546, line: 40, baseType: !74, size: 32, elements: !675)
!675 = !{!676}
!676 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!677 = !{!89}
!678 = !{!544, !547, !549, !551, !553, !555, !560, !565, !567, !572, !577, !582, !587, !589, !594, !599, !604, !609, !611, !613, !615, !617, !619, !621}
!679 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !681, retainedTypes: !712, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!681 = !{!682, !694}
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !683, file: !680, line: 188, baseType: !74, size: 32, elements: !692)
!683 = distinct !DISubprogram(name: "x2nrealloc", scope: !680, file: !680, line: 176, type: !684, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !679, retainedNodes: !687)
!684 = !DISubroutineType(types: !685)
!685 = !{!89, !89, !686, !92}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!687 = !{!688, !689, !690, !691}
!688 = !DILocalVariable(name: "p", arg: 1, scope: !683, file: !680, line: 176, type: !89)
!689 = !DILocalVariable(name: "pn", arg: 2, scope: !683, file: !680, line: 176, type: !686)
!690 = !DILocalVariable(name: "s", arg: 3, scope: !683, file: !680, line: 176, type: !92)
!691 = !DILocalVariable(name: "n", scope: !683, file: !680, line: 178, type: !92)
!692 = !{!693}
!693 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !695, file: !680, line: 228, baseType: !74, size: 32, elements: !692)
!695 = distinct !DISubprogram(name: "xpalloc", scope: !680, file: !680, line: 223, type: !696, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !679, retainedNodes: !702)
!696 = !DISubroutineType(types: !697)
!697 = !{!89, !89, !698, !699, !701, !699}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !700, line: 130, baseType: !701)
!700 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !93, line: 35, baseType: !258)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711}
!703 = !DILocalVariable(name: "pa", arg: 1, scope: !695, file: !680, line: 223, type: !89)
!704 = !DILocalVariable(name: "pn", arg: 2, scope: !695, file: !680, line: 223, type: !698)
!705 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !695, file: !680, line: 223, type: !699)
!706 = !DILocalVariable(name: "n_max", arg: 4, scope: !695, file: !680, line: 223, type: !701)
!707 = !DILocalVariable(name: "s", arg: 5, scope: !695, file: !680, line: 223, type: !699)
!708 = !DILocalVariable(name: "n0", scope: !695, file: !680, line: 230, type: !699)
!709 = !DILocalVariable(name: "n", scope: !695, file: !680, line: 237, type: !699)
!710 = !DILocalVariable(name: "nbytes", scope: !695, file: !680, line: 248, type: !699)
!711 = !DILocalVariable(name: "adjusted_nbytes", scope: !695, file: !680, line: 252, type: !699)
!712 = !{!237, !89, !216, !258, !94}
!713 = distinct !DICompileUnit(language: DW_LANG_C11, file: !642, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !714, splitDebugInlining: false, nameTableKind: None)
!714 = !{!640, !643, !645}
!715 = distinct !DICompileUnit(language: DW_LANG_C11, file: !716, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!717 = distinct !DICompileUnit(language: DW_LANG_C11, file: !718, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!718 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !722, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!725 = !{!216, !94, !89}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !727, splitDebugInlining: false, nameTableKind: None)
!727 = !{!665, !668}
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !677, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!732 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!733 = !{i32 7, !"Dwarf Version", i32 5}
!734 = !{i32 2, !"Debug Info Version", i32 3}
!735 = !{i32 1, !"wchar_size", i32 4}
!736 = !{i32 8, !"PIC Level", i32 2}
!737 = !{i32 7, !"PIE Level", i32 2}
!738 = !{i32 7, !"uwtable", i32 2}
!739 = !{i32 7, !"frame-pointer", i32 1}
!740 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 34, type: !741, scopeLine: 35, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !743)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !90}
!743 = !{!744}
!744 = !DILocalVariable(name: "status", arg: 1, scope: !740, file: !2, line: 34, type: !90)
!745 = !DILocation(line: 0, scope: !740)
!746 = !DILocation(line: 36, column: 14, scope: !747)
!747 = distinct !DILexicalBlock(scope: !740, file: !2, line: 36, column: 7)
!748 = !DILocation(line: 36, column: 7, scope: !740)
!749 = !DILocation(line: 37, column: 5, scope: !750)
!750 = distinct !DILexicalBlock(scope: !747, file: !2, line: 37, column: 5)
!751 = !{!752, !752, i64 0}
!752 = !{!"any pointer", !753, i64 0}
!753 = !{!"omnipotent char", !754, i64 0}
!754 = !{!"Simple C/C++ TBAA"}
!755 = !DILocation(line: 40, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !747, file: !2, line: 39, column: 5)
!757 = !DILocation(line: 45, column: 7, scope: !756)
!758 = !DILocation(line: 46, column: 7, scope: !756)
!759 = !DILocalVariable(name: "program", arg: 1, scope: !760, file: !65, line: 836, type: !68)
!760 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !65, file: !65, line: 836, type: !761, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !68}
!763 = !{!759, !764, !771, !772, !774, !775}
!764 = !DILocalVariable(name: "infomap", scope: !760, file: !65, line: 838, type: !765)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 896, elements: !15)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !760, file: !65, line: 838, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !767, file: !65, line: 838, baseType: !68, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !767, file: !65, line: 838, baseType: !68, size: 64, offset: 64)
!771 = !DILocalVariable(name: "node", scope: !760, file: !65, line: 848, type: !68)
!772 = !DILocalVariable(name: "map_prog", scope: !760, file: !65, line: 849, type: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!774 = !DILocalVariable(name: "lc_messages", scope: !760, file: !65, line: 861, type: !68)
!775 = !DILocalVariable(name: "url_program", scope: !760, file: !65, line: 874, type: !68)
!776 = !DILocation(line: 0, scope: !760, inlinedAt: !777)
!777 = distinct !DILocation(line: 47, column: 7, scope: !756)
!778 = !DILocation(line: 857, column: 3, scope: !760, inlinedAt: !777)
!779 = !DILocation(line: 861, column: 29, scope: !760, inlinedAt: !777)
!780 = !DILocation(line: 862, column: 7, scope: !781, inlinedAt: !777)
!781 = distinct !DILexicalBlock(scope: !760, file: !65, line: 862, column: 7)
!782 = !DILocation(line: 862, column: 19, scope: !781, inlinedAt: !777)
!783 = !DILocation(line: 862, column: 22, scope: !781, inlinedAt: !777)
!784 = !DILocation(line: 862, column: 7, scope: !760, inlinedAt: !777)
!785 = !DILocation(line: 868, column: 7, scope: !786, inlinedAt: !777)
!786 = distinct !DILexicalBlock(scope: !781, file: !65, line: 863, column: 5)
!787 = !DILocation(line: 870, column: 5, scope: !786, inlinedAt: !777)
!788 = !DILocation(line: 875, column: 3, scope: !760, inlinedAt: !777)
!789 = !DILocation(line: 877, column: 3, scope: !760, inlinedAt: !777)
!790 = !DILocation(line: 49, column: 3, scope: !740)
!791 = !DISubprogram(name: "dcgettext", scope: !792, file: !792, line: 51, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!792 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!793 = !DISubroutineType(types: !794)
!794 = !{!237, !68, !68, !90}
!795 = !{}
!796 = !DISubprogram(name: "__fprintf_chk", scope: !797, file: !797, line: 93, type: !798, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!797 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!798 = !DISubroutineType(types: !799)
!799 = !{!90, !800, !90, !801, null}
!800 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !229)
!801 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !68)
!802 = !DISubprogram(name: "__printf_chk", scope: !797, file: !797, line: 95, type: !803, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!803 = !DISubroutineType(types: !804)
!804 = !{!90, !90, !801, null}
!805 = !DILocation(line: 0, scope: !64)
!806 = !DILocation(line: 581, column: 7, scope: !214)
!807 = !{!808, !808, i64 0}
!808 = !{!"int", !753, i64 0}
!809 = !DILocation(line: 581, column: 19, scope: !214)
!810 = !DILocation(line: 581, column: 7, scope: !64)
!811 = !DILocation(line: 585, column: 26, scope: !213)
!812 = !DILocation(line: 0, scope: !213)
!813 = !DILocation(line: 586, column: 23, scope: !213)
!814 = !DILocation(line: 586, column: 28, scope: !213)
!815 = !DILocation(line: 586, column: 32, scope: !213)
!816 = !{!753, !753, i64 0}
!817 = !DILocation(line: 586, column: 38, scope: !213)
!818 = !DILocalVariable(name: "__s1", arg: 1, scope: !819, file: !820, line: 1359, type: !68)
!819 = distinct !DISubprogram(name: "streq", scope: !820, file: !820, line: 1359, type: !821, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !823)
!820 = !DIFile(filename: "./lib/string.h", directory: "/src")
!821 = !DISubroutineType(types: !822)
!822 = !{!216, !68, !68}
!823 = !{!818, !824}
!824 = !DILocalVariable(name: "__s2", arg: 2, scope: !819, file: !820, line: 1359, type: !68)
!825 = !DILocation(line: 0, scope: !819, inlinedAt: !826)
!826 = distinct !DILocation(line: 586, column: 41, scope: !213)
!827 = !DILocation(line: 1361, column: 11, scope: !819, inlinedAt: !826)
!828 = !DILocation(line: 1361, column: 10, scope: !819, inlinedAt: !826)
!829 = !DILocation(line: 586, column: 19, scope: !213)
!830 = !DILocation(line: 587, column: 5, scope: !213)
!831 = !DILocation(line: 588, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !64, file: !65, line: 588, column: 7)
!833 = !DILocation(line: 588, column: 7, scope: !64)
!834 = !DILocation(line: 590, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !832, file: !65, line: 589, column: 5)
!836 = !DILocation(line: 591, column: 7, scope: !835)
!837 = !DILocation(line: 595, column: 37, scope: !64)
!838 = !DILocation(line: 595, column: 35, scope: !64)
!839 = !DILocation(line: 596, column: 29, scope: !64)
!840 = !DILocation(line: 597, column: 8, scope: !222)
!841 = !DILocation(line: 597, column: 7, scope: !64)
!842 = !DILocation(line: 604, column: 24, scope: !221)
!843 = !DILocation(line: 604, column: 12, scope: !222)
!844 = !DILocation(line: 0, scope: !220)
!845 = !DILocation(line: 610, column: 16, scope: !220)
!846 = !DILocation(line: 610, column: 7, scope: !220)
!847 = !DILocation(line: 611, column: 21, scope: !220)
!848 = !{!849, !849, i64 0}
!849 = !{!"short", !753, i64 0}
!850 = !DILocation(line: 611, column: 19, scope: !220)
!851 = !DILocation(line: 611, column: 16, scope: !220)
!852 = !DILocation(line: 610, column: 30, scope: !220)
!853 = distinct !{!853, !846, !847, !854}
!854 = !{!"llvm.loop.mustprogress"}
!855 = !DILocation(line: 612, column: 18, scope: !856)
!856 = distinct !DILexicalBlock(scope: !220, file: !65, line: 612, column: 11)
!857 = !DILocation(line: 612, column: 11, scope: !220)
!858 = !DILocation(line: 620, column: 23, scope: !64)
!859 = !DILocation(line: 625, column: 39, scope: !64)
!860 = !DILocation(line: 626, column: 3, scope: !64)
!861 = !DILocation(line: 626, column: 10, scope: !64)
!862 = !DILocation(line: 626, column: 21, scope: !64)
!863 = !DILocation(line: 628, column: 44, scope: !864)
!864 = distinct !DILexicalBlock(scope: !865, file: !65, line: 628, column: 11)
!865 = distinct !DILexicalBlock(scope: !64, file: !65, line: 627, column: 5)
!866 = !DILocation(line: 628, column: 32, scope: !864)
!867 = !DILocation(line: 628, column: 49, scope: !864)
!868 = !DILocation(line: 628, column: 11, scope: !865)
!869 = !DILocation(line: 630, column: 11, scope: !870)
!870 = distinct !DILexicalBlock(scope: !865, file: !65, line: 630, column: 11)
!871 = !DILocation(line: 630, column: 11, scope: !865)
!872 = !DILocation(line: 632, column: 26, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !65, line: 632, column: 15)
!874 = distinct !DILexicalBlock(scope: !870, file: !65, line: 631, column: 9)
!875 = !DILocation(line: 632, column: 34, scope: !873)
!876 = !DILocation(line: 632, column: 37, scope: !873)
!877 = !DILocation(line: 632, column: 15, scope: !874)
!878 = !DILocation(line: 640, column: 16, scope: !865)
!879 = distinct !{!879, !860, !880, !854}
!880 = !DILocation(line: 641, column: 5, scope: !64)
!881 = !DILocation(line: 644, column: 3, scope: !64)
!882 = !DILocation(line: 0, scope: !819, inlinedAt: !883)
!883 = distinct !DILocation(line: 648, column: 31, scope: !64)
!884 = !DILocation(line: 0, scope: !819, inlinedAt: !885)
!885 = distinct !DILocation(line: 649, column: 31, scope: !64)
!886 = !DILocation(line: 0, scope: !819, inlinedAt: !887)
!887 = distinct !DILocation(line: 650, column: 31, scope: !64)
!888 = !DILocation(line: 0, scope: !819, inlinedAt: !889)
!889 = distinct !DILocation(line: 651, column: 31, scope: !64)
!890 = !DILocation(line: 0, scope: !819, inlinedAt: !891)
!891 = distinct !DILocation(line: 652, column: 31, scope: !64)
!892 = !DILocation(line: 0, scope: !819, inlinedAt: !893)
!893 = distinct !DILocation(line: 653, column: 31, scope: !64)
!894 = !DILocation(line: 0, scope: !819, inlinedAt: !895)
!895 = distinct !DILocation(line: 654, column: 31, scope: !64)
!896 = !DILocation(line: 0, scope: !819, inlinedAt: !897)
!897 = distinct !DILocation(line: 655, column: 31, scope: !64)
!898 = !DILocation(line: 0, scope: !819, inlinedAt: !899)
!899 = distinct !DILocation(line: 656, column: 31, scope: !64)
!900 = !DILocation(line: 0, scope: !819, inlinedAt: !901)
!901 = distinct !DILocation(line: 657, column: 31, scope: !64)
!902 = !DILocation(line: 663, column: 7, scope: !903)
!903 = distinct !DILexicalBlock(scope: !64, file: !65, line: 663, column: 7)
!904 = !DILocation(line: 664, column: 7, scope: !903)
!905 = !DILocation(line: 664, column: 10, scope: !903)
!906 = !DILocation(line: 663, column: 7, scope: !64)
!907 = !DILocation(line: 669, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !903, file: !65, line: 665, column: 5)
!909 = !DILocation(line: 671, column: 5, scope: !908)
!910 = !DILocation(line: 676, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !903, file: !65, line: 673, column: 5)
!912 = !DILocation(line: 679, column: 3, scope: !64)
!913 = !DILocation(line: 683, column: 3, scope: !64)
!914 = !DILocation(line: 686, column: 3, scope: !64)
!915 = !DILocation(line: 688, column: 3, scope: !64)
!916 = !DILocation(line: 691, column: 3, scope: !64)
!917 = !DILocation(line: 695, column: 3, scope: !64)
!918 = !DILocation(line: 696, column: 1, scope: !64)
!919 = !DISubprogram(name: "setlocale", scope: !920, file: !920, line: 122, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!920 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!921 = !DISubroutineType(types: !922)
!922 = !{!237, !90, !68}
!923 = !DISubprogram(name: "strncmp", scope: !924, file: !924, line: 159, type: !925, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!924 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!925 = !DISubroutineType(types: !926)
!926 = !{!90, !68, !68, !92}
!927 = !DISubprogram(name: "fputs_unlocked", scope: !324, file: !324, line: 691, type: !928, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!928 = !DISubroutineType(types: !929)
!929 = !{!90, !801, !800}
!930 = !DISubprogram(name: "exit", scope: !931, file: !931, line: 624, type: !741, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !795)
!931 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!932 = !DISubprogram(name: "getenv", scope: !931, file: !931, line: 641, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!933 = !DISubroutineType(types: !934)
!934 = !{!237, !68}
!935 = !DISubprogram(name: "strcmp", scope: !924, file: !924, line: 156, type: !936, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!936 = !DISubroutineType(types: !937)
!937 = !{!90, !68, !68}
!938 = !DISubprogram(name: "strspn", scope: !924, file: !924, line: 297, type: !939, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!939 = !DISubroutineType(types: !940)
!940 = !{!94, !68, !68}
!941 = !DISubprogram(name: "strchr", scope: !924, file: !924, line: 246, type: !942, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!942 = !DISubroutineType(types: !943)
!943 = !{!237, !68, !90}
!944 = !DISubprogram(name: "__ctype_b_loc", scope: !73, file: !73, line: 79, type: !945, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!945 = !DISubroutineType(types: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!950 = !DISubprogram(name: "strcspn", scope: !924, file: !924, line: 293, type: !939, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!951 = !DISubprogram(name: "fwrite_unlocked", scope: !324, file: !324, line: 704, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!952 = !DISubroutineType(types: !953)
!953 = !{!92, !954, !92, !92, !800}
!954 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!957 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 53, type: !958, scopeLine: 54, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !70, retainedNodes: !961)
!958 = !DISubroutineType(types: !959)
!959 = !{!90, !90, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!961 = !{!962, !963, !964}
!962 = !DILocalVariable(name: "argc", arg: 1, scope: !957, file: !2, line: 53, type: !90)
!963 = !DILocalVariable(name: "argv", arg: 2, scope: !957, file: !2, line: 53, type: !960)
!964 = !DILocalVariable(name: "id", scope: !957, file: !2, line: 76, type: !74)
!965 = !DILocation(line: 0, scope: !957)
!966 = !DILocation(line: 56, column: 21, scope: !957)
!967 = !DILocation(line: 56, column: 3, scope: !957)
!968 = !DILocation(line: 57, column: 3, scope: !957)
!969 = !DILocation(line: 58, column: 3, scope: !957)
!970 = !DILocation(line: 59, column: 3, scope: !957)
!971 = !DILocation(line: 61, column: 3, scope: !957)
!972 = !DILocation(line: 64, column: 36, scope: !957)
!973 = !DILocation(line: 64, column: 58, scope: !957)
!974 = !DILocation(line: 63, column: 3, scope: !957)
!975 = !DILocation(line: 67, column: 7, scope: !976)
!976 = distinct !DILexicalBlock(scope: !957, file: !2, line: 67, column: 7)
!977 = !DILocation(line: 67, column: 14, scope: !976)
!978 = !DILocation(line: 67, column: 7, scope: !957)
!979 = !DILocation(line: 69, column: 7, scope: !980)
!980 = distinct !DILexicalBlock(scope: !976, file: !2, line: 68, column: 5)
!981 = !DILocation(line: 70, column: 7, scope: !980)
!982 = !DILocation(line: 76, column: 21, scope: !957)
!983 = !DILocation(line: 78, column: 3, scope: !957)
!984 = !DILocation(line: 80, column: 3, scope: !957)
!985 = !DISubprogram(name: "bindtextdomain", scope: !792, file: !792, line: 86, type: !986, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!986 = !DISubroutineType(types: !987)
!987 = !{!237, !68, !68}
!988 = !DISubprogram(name: "textdomain", scope: !792, file: !792, line: 82, type: !933, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!989 = !DISubprogram(name: "atexit", scope: !931, file: !931, line: 602, type: !990, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!990 = !DISubroutineType(types: !991)
!991 = !{!90, !364}
!992 = !DISubprogram(name: "gethostid", scope: !993, file: !993, line: 1002, type: !994, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!993 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!994 = !DISubroutineType(types: !995)
!995 = !{!258}
!996 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !298, file: !298, line: 50, type: !761, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !997)
!997 = !{!998}
!998 = !DILocalVariable(name: "file", arg: 1, scope: !996, file: !298, line: 50, type: !68)
!999 = !DILocation(line: 0, scope: !996)
!1000 = !DILocation(line: 52, column: 13, scope: !996)
!1001 = !DILocation(line: 53, column: 1, scope: !996)
!1002 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !298, file: !298, line: 87, type: !1003, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1005)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !216}
!1005 = !{!1006}
!1006 = !DILocalVariable(name: "ignore", arg: 1, scope: !1002, file: !298, line: 87, type: !216)
!1007 = !DILocation(line: 0, scope: !1002)
!1008 = !DILocation(line: 89, column: 16, scope: !1002)
!1009 = !{!1010, !1010, i64 0}
!1010 = !{!"_Bool", !753, i64 0}
!1011 = !DILocation(line: 90, column: 1, scope: !1002)
!1012 = distinct !DISubprogram(name: "close_stdout", scope: !298, file: !298, line: 116, type: !365, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !1013)
!1013 = !{!1014}
!1014 = !DILocalVariable(name: "write_error", scope: !1015, file: !298, line: 121, type: !68)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !298, line: 120, column: 5)
!1016 = distinct !DILexicalBlock(scope: !1012, file: !298, line: 118, column: 7)
!1017 = !DILocation(line: 118, column: 21, scope: !1016)
!1018 = !DILocation(line: 118, column: 7, scope: !1016)
!1019 = !DILocation(line: 118, column: 29, scope: !1016)
!1020 = !DILocation(line: 119, column: 7, scope: !1016)
!1021 = !DILocation(line: 119, column: 12, scope: !1016)
!1022 = !{i8 0, i8 2}
!1023 = !DILocation(line: 119, column: 25, scope: !1016)
!1024 = !DILocation(line: 119, column: 28, scope: !1016)
!1025 = !DILocation(line: 119, column: 34, scope: !1016)
!1026 = !DILocation(line: 118, column: 7, scope: !1012)
!1027 = !DILocation(line: 121, column: 33, scope: !1015)
!1028 = !DILocation(line: 0, scope: !1015)
!1029 = !DILocation(line: 122, column: 11, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1015, file: !298, line: 122, column: 11)
!1031 = !DILocation(line: 0, scope: !1030)
!1032 = !DILocation(line: 122, column: 11, scope: !1015)
!1033 = !DILocation(line: 123, column: 9, scope: !1030)
!1034 = !DILocation(line: 126, column: 9, scope: !1030)
!1035 = !DILocation(line: 128, column: 14, scope: !1015)
!1036 = !DILocation(line: 128, column: 7, scope: !1015)
!1037 = !DILocation(line: 133, column: 42, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1012, file: !298, line: 133, column: 7)
!1039 = !DILocation(line: 133, column: 28, scope: !1038)
!1040 = !DILocation(line: 133, column: 50, scope: !1038)
!1041 = !DILocation(line: 133, column: 7, scope: !1012)
!1042 = !DILocation(line: 134, column: 12, scope: !1038)
!1043 = !DILocation(line: 134, column: 5, scope: !1038)
!1044 = !DILocation(line: 135, column: 1, scope: !1012)
!1045 = !DISubprogram(name: "__errno_location", scope: !1046, file: !1046, line: 37, type: !1047, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1046 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!388}
!1049 = !DISubprogram(name: "_exit", scope: !993, file: !993, line: 624, type: !741, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1050 = distinct !DISubprogram(name: "verror", scope: !313, file: !313, line: 251, type: !1051, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !90, !90, !68, !323}
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DILocalVariable(name: "status", arg: 1, scope: !1050, file: !313, line: 251, type: !90)
!1055 = !DILocalVariable(name: "errnum", arg: 2, scope: !1050, file: !313, line: 251, type: !90)
!1056 = !DILocalVariable(name: "message", arg: 3, scope: !1050, file: !313, line: 251, type: !68)
!1057 = !DILocalVariable(name: "args", arg: 4, scope: !1050, file: !313, line: 251, type: !323)
!1058 = !DILocation(line: 0, scope: !1050)
!1059 = !DILocation(line: 251, column: 1, scope: !1050)
!1060 = !DILocation(line: 261, column: 3, scope: !1050)
!1061 = !DILocation(line: 265, column: 7, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1050, file: !313, line: 265, column: 7)
!1063 = !DILocation(line: 265, column: 7, scope: !1050)
!1064 = !DILocation(line: 266, column: 5, scope: !1062)
!1065 = !DILocation(line: 272, column: 7, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1062, file: !313, line: 268, column: 5)
!1067 = !DILocation(line: 276, column: 3, scope: !1050)
!1068 = !{i64 0, i64 8, !751, i64 8, i64 8, !751, i64 16, i64 8, !751, i64 24, i64 4, !807, i64 28, i64 4, !807}
!1069 = !DILocation(line: 282, column: 1, scope: !1050)
!1070 = distinct !DISubprogram(name: "flush_stdout", scope: !313, file: !313, line: 163, type: !365, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1071)
!1071 = !{!1072}
!1072 = !DILocalVariable(name: "stdout_fd", scope: !1070, file: !313, line: 166, type: !90)
!1073 = !DILocation(line: 0, scope: !1070)
!1074 = !DILocalVariable(name: "fd", arg: 1, scope: !1075, file: !313, line: 145, type: !90)
!1075 = distinct !DISubprogram(name: "is_open", scope: !313, file: !313, line: 145, type: !1076, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1078)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!90, !90}
!1078 = !{!1074}
!1079 = !DILocation(line: 0, scope: !1075, inlinedAt: !1080)
!1080 = distinct !DILocation(line: 182, column: 25, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1070, file: !313, line: 182, column: 7)
!1082 = !DILocation(line: 157, column: 15, scope: !1075, inlinedAt: !1080)
!1083 = !DILocation(line: 157, column: 12, scope: !1075, inlinedAt: !1080)
!1084 = !DILocation(line: 182, column: 7, scope: !1070)
!1085 = !DILocation(line: 184, column: 5, scope: !1081)
!1086 = !DILocation(line: 185, column: 1, scope: !1070)
!1087 = distinct !DISubprogram(name: "error_tail", scope: !313, file: !313, line: 219, type: !1051, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1088)
!1088 = !{!1089, !1090, !1091, !1092}
!1089 = !DILocalVariable(name: "status", arg: 1, scope: !1087, file: !313, line: 219, type: !90)
!1090 = !DILocalVariable(name: "errnum", arg: 2, scope: !1087, file: !313, line: 219, type: !90)
!1091 = !DILocalVariable(name: "message", arg: 3, scope: !1087, file: !313, line: 219, type: !68)
!1092 = !DILocalVariable(name: "args", arg: 4, scope: !1087, file: !313, line: 219, type: !323)
!1093 = !DILocation(line: 0, scope: !1087)
!1094 = !DILocation(line: 219, column: 1, scope: !1087)
!1095 = !DILocation(line: 229, column: 13, scope: !1087)
!1096 = !DILocation(line: 135, column: 10, scope: !1097, inlinedAt: !1139)
!1097 = distinct !DISubprogram(name: "vfprintf", scope: !797, file: !797, line: 132, type: !1098, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1135)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!90, !1100, !801, !325}
!1100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !231, line: 7, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !233, line: 49, size: 1728, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1103, file: !233, line: 51, baseType: !90, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1103, file: !233, line: 54, baseType: !237, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1103, file: !233, line: 55, baseType: !237, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1103, file: !233, line: 56, baseType: !237, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1103, file: !233, line: 57, baseType: !237, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1103, file: !233, line: 58, baseType: !237, size: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1103, file: !233, line: 59, baseType: !237, size: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1103, file: !233, line: 60, baseType: !237, size: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1103, file: !233, line: 61, baseType: !237, size: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1103, file: !233, line: 64, baseType: !237, size: 64, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1103, file: !233, line: 65, baseType: !237, size: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1103, file: !233, line: 66, baseType: !237, size: 64, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1103, file: !233, line: 68, baseType: !249, size: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1103, file: !233, line: 70, baseType: !1119, size: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1103, file: !233, line: 72, baseType: !90, size: 32, offset: 896)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1103, file: !233, line: 73, baseType: !90, size: 32, offset: 928)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1103, file: !233, line: 74, baseType: !256, size: 64, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1103, file: !233, line: 77, baseType: !91, size: 16, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1103, file: !233, line: 78, baseType: !261, size: 8, offset: 1040)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1103, file: !233, line: 79, baseType: !29, size: 8, offset: 1048)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1103, file: !233, line: 81, baseType: !264, size: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1103, file: !233, line: 89, baseType: !267, size: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1103, file: !233, line: 91, baseType: !269, size: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1103, file: !233, line: 92, baseType: !272, size: 64, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1103, file: !233, line: 93, baseType: !1119, size: 64, offset: 1344)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1103, file: !233, line: 94, baseType: !89, size: 64, offset: 1408)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1103, file: !233, line: 95, baseType: !92, size: 64, offset: 1472)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1103, file: !233, line: 96, baseType: !90, size: 32, offset: 1536)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1103, file: !233, line: 98, baseType: !279, size: 160, offset: 1568)
!1135 = !{!1136, !1137, !1138}
!1136 = !DILocalVariable(name: "__stream", arg: 1, scope: !1097, file: !797, line: 132, type: !1100)
!1137 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1097, file: !797, line: 133, type: !801)
!1138 = !DILocalVariable(name: "__ap", arg: 3, scope: !1097, file: !797, line: 133, type: !325)
!1139 = distinct !DILocation(line: 229, column: 3, scope: !1087)
!1140 = !{!1141, !1143}
!1141 = distinct !{!1141, !1142, !"vfprintf.inline: argument 0"}
!1142 = distinct !{!1142, !"vfprintf.inline"}
!1143 = distinct !{!1143, !1142, !"vfprintf.inline: argument 1"}
!1144 = !DILocation(line: 229, column: 3, scope: !1087)
!1145 = !DILocation(line: 0, scope: !1097, inlinedAt: !1139)
!1146 = !DILocation(line: 133, column: 49, scope: !1097, inlinedAt: !1139)
!1147 = !DILocation(line: 232, column: 3, scope: !1087)
!1148 = !DILocation(line: 233, column: 7, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1087, file: !313, line: 233, column: 7)
!1150 = !DILocation(line: 233, column: 7, scope: !1087)
!1151 = !DILocalVariable(name: "errnum", arg: 1, scope: !1152, file: !313, line: 188, type: !90)
!1152 = distinct !DISubprogram(name: "print_errno_message", scope: !313, file: !313, line: 188, type: !741, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1153)
!1153 = !{!1151, !1154, !1155}
!1154 = !DILocalVariable(name: "s", scope: !1152, file: !313, line: 190, type: !68)
!1155 = !DILocalVariable(name: "errbuf", scope: !1152, file: !313, line: 193, type: !1156)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 1024)
!1159 = !DILocation(line: 0, scope: !1152, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 234, column: 5, scope: !1149)
!1161 = !DILocation(line: 193, column: 3, scope: !1152, inlinedAt: !1160)
!1162 = !DILocation(line: 193, column: 8, scope: !1152, inlinedAt: !1160)
!1163 = !DILocation(line: 195, column: 7, scope: !1152, inlinedAt: !1160)
!1164 = !DILocation(line: 207, column: 9, scope: !1165, inlinedAt: !1160)
!1165 = distinct !DILexicalBlock(scope: !1152, file: !313, line: 207, column: 7)
!1166 = !DILocation(line: 207, column: 7, scope: !1152, inlinedAt: !1160)
!1167 = !DILocation(line: 208, column: 9, scope: !1165, inlinedAt: !1160)
!1168 = !DILocation(line: 208, column: 5, scope: !1165, inlinedAt: !1160)
!1169 = !DILocation(line: 214, column: 3, scope: !1152, inlinedAt: !1160)
!1170 = !DILocation(line: 216, column: 1, scope: !1152, inlinedAt: !1160)
!1171 = !DILocation(line: 234, column: 5, scope: !1149)
!1172 = !DILocation(line: 238, column: 3, scope: !1087)
!1173 = !DILocalVariable(name: "__c", arg: 1, scope: !1174, file: !1175, line: 101, type: !90)
!1174 = distinct !DISubprogram(name: "putc_unlocked", scope: !1175, file: !1175, line: 101, type: !1176, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1178)
!1175 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!90, !90, !1101}
!1178 = !{!1173, !1179}
!1179 = !DILocalVariable(name: "__stream", arg: 2, scope: !1174, file: !1175, line: 101, type: !1101)
!1180 = !DILocation(line: 0, scope: !1174, inlinedAt: !1181)
!1181 = distinct !DILocation(line: 238, column: 3, scope: !1087)
!1182 = !DILocation(line: 103, column: 10, scope: !1174, inlinedAt: !1181)
!1183 = !{!1184, !752, i64 40}
!1184 = !{!"_IO_FILE", !808, i64 0, !752, i64 8, !752, i64 16, !752, i64 24, !752, i64 32, !752, i64 40, !752, i64 48, !752, i64 56, !752, i64 64, !752, i64 72, !752, i64 80, !752, i64 88, !752, i64 96, !752, i64 104, !808, i64 112, !808, i64 116, !1185, i64 120, !849, i64 128, !753, i64 130, !753, i64 131, !752, i64 136, !1185, i64 144, !752, i64 152, !752, i64 160, !752, i64 168, !752, i64 176, !1185, i64 184, !808, i64 192, !753, i64 196}
!1185 = !{!"long", !753, i64 0}
!1186 = !{!1184, !752, i64 48}
!1187 = !{!"branch_weights", i32 2000, i32 1}
!1188 = !DILocation(line: 240, column: 3, scope: !1087)
!1189 = !DILocation(line: 241, column: 7, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1087, file: !313, line: 241, column: 7)
!1191 = !DILocation(line: 241, column: 7, scope: !1087)
!1192 = !DILocation(line: 242, column: 5, scope: !1190)
!1193 = !DILocation(line: 243, column: 1, scope: !1087)
!1194 = !DISubprogram(name: "__vfprintf_chk", scope: !797, file: !797, line: 96, type: !1195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!90, !1100, !90, !801, !325}
!1197 = !DISubprogram(name: "strerror_r", scope: !924, file: !924, line: 444, type: !1198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!237, !90, !237, !92}
!1200 = !DISubprogram(name: "__overflow", scope: !324, file: !324, line: 886, type: !1201, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!90, !1101, !90}
!1203 = !DISubprogram(name: "fflush_unlocked", scope: !324, file: !324, line: 239, type: !1204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!90, !1101}
!1206 = !DISubprogram(name: "fcntl", scope: !1207, file: !1207, line: 149, type: !1208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !795)
!1207 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!90, !90, !90, null}
!1210 = distinct !DISubprogram(name: "error", scope: !313, file: !313, line: 285, type: !1211, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1213)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{null, !90, !90, !68, null}
!1213 = !{!1214, !1215, !1216, !1217}
!1214 = !DILocalVariable(name: "status", arg: 1, scope: !1210, file: !313, line: 285, type: !90)
!1215 = !DILocalVariable(name: "errnum", arg: 2, scope: !1210, file: !313, line: 285, type: !90)
!1216 = !DILocalVariable(name: "message", arg: 3, scope: !1210, file: !313, line: 285, type: !68)
!1217 = !DILocalVariable(name: "ap", scope: !1210, file: !313, line: 287, type: !323)
!1218 = !DILocation(line: 0, scope: !1210)
!1219 = !DILocation(line: 287, column: 3, scope: !1210)
!1220 = !DILocation(line: 287, column: 11, scope: !1210)
!1221 = !DILocation(line: 288, column: 3, scope: !1210)
!1222 = !DILocation(line: 289, column: 3, scope: !1210)
!1223 = !DILocation(line: 290, column: 3, scope: !1210)
!1224 = !DILocation(line: 291, column: 1, scope: !1210)
!1225 = !DILocation(line: 0, scope: !320)
!1226 = !DILocation(line: 298, column: 1, scope: !320)
!1227 = !DILocation(line: 302, column: 7, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !320, file: !313, line: 302, column: 7)
!1229 = !DILocation(line: 302, column: 7, scope: !320)
!1230 = !DILocation(line: 307, column: 11, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !313, line: 307, column: 11)
!1232 = distinct !DILexicalBlock(scope: !1228, file: !313, line: 303, column: 5)
!1233 = !DILocation(line: 307, column: 27, scope: !1231)
!1234 = !DILocation(line: 308, column: 11, scope: !1231)
!1235 = !DILocation(line: 308, column: 28, scope: !1231)
!1236 = !DILocation(line: 308, column: 25, scope: !1231)
!1237 = !DILocation(line: 309, column: 15, scope: !1231)
!1238 = !DILocation(line: 309, column: 33, scope: !1231)
!1239 = !DILocation(line: 310, column: 19, scope: !1231)
!1240 = !DILocation(line: 311, column: 22, scope: !1231)
!1241 = !DILocation(line: 311, column: 56, scope: !1231)
!1242 = !DILocation(line: 307, column: 11, scope: !1232)
!1243 = !DILocation(line: 316, column: 21, scope: !1232)
!1244 = !DILocation(line: 317, column: 23, scope: !1232)
!1245 = !DILocation(line: 318, column: 5, scope: !1232)
!1246 = !DILocation(line: 327, column: 3, scope: !320)
!1247 = !DILocation(line: 331, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !320, file: !313, line: 331, column: 7)
!1249 = !DILocation(line: 331, column: 7, scope: !320)
!1250 = !DILocation(line: 332, column: 5, scope: !1248)
!1251 = !DILocation(line: 338, column: 7, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1248, file: !313, line: 334, column: 5)
!1253 = !DILocation(line: 346, column: 3, scope: !320)
!1254 = !DILocation(line: 350, column: 3, scope: !320)
!1255 = !DILocation(line: 356, column: 1, scope: !320)
!1256 = distinct !DISubprogram(name: "error_at_line", scope: !313, file: !313, line: 359, type: !1257, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !1259)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !90, !90, !68, !74, !68, null}
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1265}
!1260 = !DILocalVariable(name: "status", arg: 1, scope: !1256, file: !313, line: 359, type: !90)
!1261 = !DILocalVariable(name: "errnum", arg: 2, scope: !1256, file: !313, line: 359, type: !90)
!1262 = !DILocalVariable(name: "file_name", arg: 3, scope: !1256, file: !313, line: 359, type: !68)
!1263 = !DILocalVariable(name: "line_number", arg: 4, scope: !1256, file: !313, line: 360, type: !74)
!1264 = !DILocalVariable(name: "message", arg: 5, scope: !1256, file: !313, line: 360, type: !68)
!1265 = !DILocalVariable(name: "ap", scope: !1256, file: !313, line: 362, type: !323)
!1266 = !DILocation(line: 0, scope: !1256)
!1267 = !DILocation(line: 362, column: 3, scope: !1256)
!1268 = !DILocation(line: 362, column: 11, scope: !1256)
!1269 = !DILocation(line: 363, column: 3, scope: !1256)
!1270 = !DILocation(line: 364, column: 3, scope: !1256)
!1271 = !DILocation(line: 366, column: 3, scope: !1256)
!1272 = !DILocation(line: 367, column: 1, scope: !1256)
!1273 = distinct !DISubprogram(name: "getprogname", scope: !671, file: !671, line: 54, type: !1274, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !670, retainedNodes: !795)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!68}
!1276 = !DILocation(line: 58, column: 10, scope: !1273)
!1277 = !DILocation(line: 58, column: 3, scope: !1273)
!1278 = distinct !DISubprogram(name: "parse_long_options", scope: !369, file: !369, line: 45, type: !1279, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !372, retainedNodes: !1282)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{null, !90, !960, !68, !68, !68, !1281, null}
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1293}
!1283 = !DILocalVariable(name: "argc", arg: 1, scope: !1278, file: !369, line: 45, type: !90)
!1284 = !DILocalVariable(name: "argv", arg: 2, scope: !1278, file: !369, line: 46, type: !960)
!1285 = !DILocalVariable(name: "command_name", arg: 3, scope: !1278, file: !369, line: 47, type: !68)
!1286 = !DILocalVariable(name: "package", arg: 4, scope: !1278, file: !369, line: 48, type: !68)
!1287 = !DILocalVariable(name: "version", arg: 5, scope: !1278, file: !369, line: 49, type: !68)
!1288 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1278, file: !369, line: 50, type: !1281)
!1289 = !DILocalVariable(name: "saved_opterr", scope: !1278, file: !369, line: 53, type: !90)
!1290 = !DILocalVariable(name: "c", scope: !1291, file: !369, line: 60, type: !90)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !369, line: 59, column: 5)
!1292 = distinct !DILexicalBlock(scope: !1278, file: !369, line: 58, column: 7)
!1293 = !DILocalVariable(name: "authors", scope: !1294, file: !369, line: 71, type: !1298)
!1294 = distinct !DILexicalBlock(scope: !1295, file: !369, line: 70, column: 15)
!1295 = distinct !DILexicalBlock(scope: !1296, file: !369, line: 64, column: 13)
!1296 = distinct !DILexicalBlock(scope: !1297, file: !369, line: 62, column: 9)
!1297 = distinct !DILexicalBlock(scope: !1291, file: !369, line: 61, column: 11)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !324, line: 52, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !326, line: 14, baseType: !1300)
