; ModuleID = 'src/id.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.group = type { ptr, ptr, i32, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [USER]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [108 x i8] c"Print user and group information for each specified USER,\0Aor (when USER omitted) for the current process.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [3 x i8] c"id\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [61 x i8] c"  -a\0A         ignore, for compatibility with other versions\0A\00", align 1, !dbg !22

!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 26)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !181, isLocal: true, isDefinition: true)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 17)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(scope: null, file: !2, line: 300, type: !186, isLocal: true, isDefinition: true)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 25)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(scope: null, file: !2, line: 309, type: !191, isLocal: true, isDefinition: true)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(scope: null, file: !2, line: 317, type: !186, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(scope: null, file: !2, line: 322, type: !191, isLocal: true, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "ruid", scope: !99, file: !2, line: 62, type: !200, isLocal: true, isDefinition: true)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !201, line: 79, baseType: !202)
!201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !136, line: 146, baseType: !109)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "euid", scope: !99, file: !2, line: 62, type: !200, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "rgid", scope: !99, file: !2, line: 63, type: !207, isLocal: true, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !201, line: 64, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !136, line: 147, baseType: !109)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "egid", scope: !99, file: !2, line: 63, type: !207, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !213, file: !102, line: 575, type: !103, isLocal: true, isDefinition: true)
!213 = distinct !DISubprogram(name: "oputs_", scope: !102, file: !102, line: 573, type: !214, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !216)
!214 = !DISubroutineType(cc: DW_CC_nocall, types: !215)
!215 = !{null, !130, !130}
!216 = !{!217, !218, !219, !222, !224, !225, !226, !230, !231, !232, !233, !235, !284, !285, !286, !288, !289}
!217 = !DILocalVariable(name: "program", arg: 1, scope: !213, file: !102, line: 573, type: !130)
!218 = !DILocalVariable(name: "option", arg: 2, scope: !213, file: !102, line: 573, type: !130)
!219 = !DILocalVariable(name: "term", scope: !220, file: !102, line: 585, type: !130)
!220 = distinct !DILexicalBlock(scope: !221, file: !102, line: 582, column: 5)
!221 = distinct !DILexicalBlock(scope: !213, file: !102, line: 581, column: 7)
!222 = !DILocalVariable(name: "double_space", scope: !213, file: !102, line: 594, type: !223)
!223 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!224 = !DILocalVariable(name: "first_word", scope: !213, file: !102, line: 595, type: !130)
!225 = !DILocalVariable(name: "option_text", scope: !213, file: !102, line: 596, type: !130)
!226 = !DILocalVariable(name: "s", scope: !227, file: !102, line: 608, type: !130)
!227 = distinct !DILexicalBlock(scope: !228, file: !102, line: 605, column: 5)
!228 = distinct !DILexicalBlock(scope: !229, file: !102, line: 604, column: 12)
!229 = distinct !DILexicalBlock(scope: !213, file: !102, line: 597, column: 7)
!230 = !DILocalVariable(name: "spaces", scope: !227, file: !102, line: 609, type: !127)
!231 = !DILocalVariable(name: "anchor_len", scope: !213, file: !102, line: 620, type: !127)
!232 = !DILocalVariable(name: "desc_text", scope: !213, file: !102, line: 625, type: !130)
!233 = !DILocalVariable(name: "__ptr", scope: !234, file: !102, line: 644, type: !130)
!234 = distinct !DILexicalBlock(scope: !213, file: !102, line: 644, column: 3)
!235 = !DILocalVariable(name: "__stream", scope: !234, file: !102, line: 644, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !238, line: 7, baseType: !239)
!238 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !240, line: 49, size: 1728, elements: !241)
!240 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !257, !259, !260, !261, !264, !265, !267, !268, !271, !273, !276, !279, !280, !281, !282, !283}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !239, file: !240, line: 51, baseType: !103, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !239, file: !240, line: 54, baseType: !124, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !239, file: !240, line: 55, baseType: !124, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !239, file: !240, line: 56, baseType: !124, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !239, file: !240, line: 57, baseType: !124, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !239, file: !240, line: 58, baseType: !124, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !239, file: !240, line: 59, baseType: !124, size: 64, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !239, file: !240, line: 60, baseType: !124, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !239, file: !240, line: 61, baseType: !124, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !239, file: !240, line: 64, baseType: !124, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !239, file: !240, line: 65, baseType: !124, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !239, file: !240, line: 66, baseType: !124, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !239, file: !240, line: 68, baseType: !255, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !240, line: 36, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !239, file: !240, line: 70, baseType: !258, size: 64, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !239, file: !240, line: 72, baseType: !103, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !239, file: !240, line: 73, baseType: !103, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !239, file: !240, line: 74, baseType: !262, size: 64, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !136, line: 152, baseType: !263)
!263 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !239, file: !240, line: 77, baseType: !126, size: 16, offset: 1024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !239, file: !240, line: 78, baseType: !266, size: 8, offset: 1040)
!266 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !239, file: !240, line: 79, baseType: !79, size: 8, offset: 1048)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !239, file: !240, line: 81, baseType: !269, size: 64, offset: 1088)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !240, line: 43, baseType: null)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !239, file: !240, line: 89, baseType: !272, size: 64, offset: 1152)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !136, line: 153, baseType: !263)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !239, file: !240, line: 91, baseType: !274, size: 64, offset: 1216)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !240, line: 37, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !239, file: !240, line: 92, baseType: !277, size: 64, offset: 1280)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !240, line: 38, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !239, file: !240, line: 93, baseType: !258, size: 64, offset: 1344)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !239, file: !240, line: 94, baseType: !125, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !239, file: !240, line: 95, baseType: !127, size: 64, offset: 1472)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !239, file: !240, line: 96, baseType: !103, size: 32, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !239, file: !240, line: 98, baseType: !191, size: 160, offset: 1568)
!284 = !DILocalVariable(name: "__cnt", scope: !234, file: !102, line: 644, type: !127)
!285 = !DILocalVariable(name: "url_program", scope: !213, file: !102, line: 648, type: !130)
!286 = !DILocalVariable(name: "__ptr", scope: !287, file: !102, line: 686, type: !130)
!287 = distinct !DILexicalBlock(scope: !213, file: !102, line: 686, column: 3)
!288 = !DILocalVariable(name: "__stream", scope: !287, file: !102, line: 686, type: !236)
!289 = !DILocalVariable(name: "__cnt", scope: !287, file: !102, line: 686, type: !127)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !102, line: 585, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 5)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !102, line: 586, type: !292, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !102, line: 595, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 4)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !102, line: 620, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 6)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !102, line: 648, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 2)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !102, line: 648, type: !292, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !102, line: 649, type: !299, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !102, line: 649, type: !19, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !102, line: 650, type: !292, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !102, line: 651, type: !304, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !102, line: 651, type: !304, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !102, line: 652, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 7)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !102, line: 653, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 8)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !102, line: 654, type: !84, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !102, line: 655, type: !84, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !102, line: 656, type: !84, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !102, line: 657, type: !84, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !102, line: 663, type: !326, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !102, line: 664, type: !84, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !102, line: 669, type: !181, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !102, line: 669, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 40)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !102, line: 676, type: !150, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !102, line: 676, type: !24, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !102, line: 679, type: !19, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !102, line: 683, type: !292, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !102, line: 688, type: !292, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !102, line: 691, type: !331, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !102, line: 839, type: !155, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !102, line: 840, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 22)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !102, line: 841, type: !150, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !102, line: 862, type: !299, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !102, line: 868, type: !74, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !102, line: 875, type: !380, isLocal: true, isDefinition: true)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 27)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !102, line: 877, type: !385, isLocal: true, isDefinition: true)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 51)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !102, line: 877, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 12)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !331, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !304, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !326, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !292, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !292, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !292, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !292, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !292, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !331, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "just_context", scope: !99, file: !2, line: 43, type: !223, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "just_group", scope: !99, file: !2, line: 49, type: !223, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "use_name", scope: !99, file: !2, line: 59, type: !223, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "use_real", scope: !99, file: !2, line: 51, type: !223, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "just_user", scope: !99, file: !2, line: 53, type: !223, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "opt_zero", scope: !99, file: !2, line: 45, type: !223, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "just_group_list", scope: !99, file: !2, line: 47, type: !223, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "context", scope: !99, file: !2, line: 67, type: !124, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "multiple_users", scope: !99, file: !2, line: 57, type: !223, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "ok", scope: !99, file: !2, line: 55, type: !223, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !102, line: 952, type: !390, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !9, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !19, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !299, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !331, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !292, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !2, line: 366, type: !94, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !2, line: 373, type: !84, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !2, line: 381, type: !84, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !9, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !39, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !94, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 425, type: !390, isLocal: true, isDefinition: true)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 2560, elements: !85)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !460, line: 50, size: 256, elements: !461)
!460 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!461 = !{!462, !463, !464, !466}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !459, file: !460, line: 52, baseType: !130, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !459, file: !460, line: 55, baseType: !103, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !459, file: !460, line: 56, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !459, file: !460, line: 57, baseType: !103, size: 32, offset: 192)
!467 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!468 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!469 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!470 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!471 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!472 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !475, line: 67, type: !9, isLocal: true, isDefinition: true)
!475 = !DIFile(filename: "src/group-list.c", directory: "/src", checksumkind: CSK_MD5, checksum: "86bc740edd29a2e1277335d35d8d331e")
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !475, line: 72, type: !39, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !475, line: 109, type: !480, isLocal: true, isDefinition: true)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 34)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !475, line: 116, type: !19, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !475, line: 118, type: !299, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !489, line: 3, type: !150, isLocal: true, isDefinition: true)
!489 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "Version", scope: !492, file: !489, line: 3, type: !130, isLocal: false, isDefinition: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C11, file: !489, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !493, splitDebugInlining: false, nameTableKind: None)
!493 = !{!487, !490}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "file_name", scope: !496, file: !497, line: 45, type: !130, isLocal: true, isDefinition: true)
!496 = distinct !DICompileUnit(language: DW_LANG_C11, file: !497, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!498 = !{!499, !501, !503, !505, !494, !507}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !497, line: 121, type: !326, isLocal: true, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !497, line: 121, type: !390, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !497, line: 123, type: !326, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !497, line: 126, type: !19, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !496, file: !497, line: 55, type: !223, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !511, file: !512, line: 66, type: !563, isLocal: false, isDefinition: true)
!511 = distinct !DICompileUnit(language: DW_LANG_C11, file: !512, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !513, globals: !514, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!513 = !{!125, !132}
!514 = !{!515, !517, !542, !544, !546, !548, !509, !550, !552, !554, !556, !561}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !512, line: 272, type: !292, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "old_file_name", scope: !519, file: !512, line: 304, type: !130, isLocal: true, isDefinition: true)
!519 = distinct !DISubprogram(name: "verror_at_line", scope: !512, file: !512, line: 298, type: !520, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !511, retainedNodes: !535)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !103, !103, !130, !109, !130, !522}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !523, line: 52, baseType: !524)
!523 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !525, line: 14, baseType: !526)
!525 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !527, baseType: !528)
!527 = !DIFile(filename: "lib/error.c", directory: "/src")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !529)
!529 = !{!530, !531, !532, !533, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !528, file: !527, baseType: !125, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !528, file: !527, baseType: !125, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !528, file: !527, baseType: !125, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !528, file: !527, baseType: !103, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !528, file: !527, baseType: !103, size: 32, offset: 224)
!535 = !{!536, !537, !538, !539, !540, !541}
!536 = !DILocalVariable(name: "status", arg: 1, scope: !519, file: !512, line: 298, type: !103)
!537 = !DILocalVariable(name: "errnum", arg: 2, scope: !519, file: !512, line: 298, type: !103)
!538 = !DILocalVariable(name: "file_name", arg: 3, scope: !519, file: !512, line: 298, type: !130)
!539 = !DILocalVariable(name: "line_number", arg: 4, scope: !519, file: !512, line: 298, type: !109)
!540 = !DILocalVariable(name: "message", arg: 5, scope: !519, file: !512, line: 298, type: !130)
!541 = !DILocalVariable(name: "args", arg: 6, scope: !519, file: !512, line: 298, type: !522)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "old_line_number", scope: !519, file: !512, line: 305, type: !109, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !512, line: 338, type: !299, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !512, line: 346, type: !331, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !512, line: 346, type: !309, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "error_message_count", scope: !511, file: !512, line: 69, type: !109, isLocal: false, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !511, file: !512, line: 295, type: !103, isLocal: false, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !512, line: 208, type: !326, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !512, line: 208, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 21)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !512, line: 214, type: !292, isLocal: true, isDefinition: true)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{null}
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "program_name", scope: !568, file: !569, line: 31, type: !130, isLocal: false, isDefinition: true)
!568 = distinct !DICompileUnit(language: DW_LANG_C11, file: !569, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !570, globals: !571, splitDebugInlining: false, nameTableKind: None)
!569 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!570 = !{!124}
!571 = !{!566, !572, !574}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !569, line: 46, type: !331, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !569, line: 49, type: !299, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "utf07FF", scope: !578, file: !579, line: 46, type: !606, isLocal: true, isDefinition: true)
!578 = distinct !DISubprogram(name: "proper_name_lite", scope: !579, file: !579, line: 38, type: !580, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !582, retainedNodes: !584)
!579 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!580 = !DISubroutineType(types: !581)
!581 = !{!130, !130, !130}
!582 = distinct !DICompileUnit(language: DW_LANG_C11, file: !579, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !583, splitDebugInlining: false, nameTableKind: None)
!583 = !{!576}
!584 = !{!585, !586, !587, !588, !593}
!585 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !578, file: !579, line: 38, type: !130)
!586 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !578, file: !579, line: 38, type: !130)
!587 = !DILocalVariable(name: "translation", scope: !578, file: !579, line: 40, type: !130)
!588 = !DILocalVariable(name: "w", scope: !578, file: !579, line: 47, type: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !590, line: 37, baseType: !591)
!590 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !136, line: 57, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !136, line: 42, baseType: !109)
!593 = !DILocalVariable(name: "mbs", scope: !578, file: !579, line: 48, type: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !595, line: 6, baseType: !596)
!595 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !597, line: 21, baseType: !598)
!597 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 13, size: 64, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !598, file: !597, line: 15, baseType: !103, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !598, file: !597, line: 20, baseType: !602, size: 32, offset: 32)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !598, file: !597, line: 16, size: 32, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !602, file: !597, line: 18, baseType: !109, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !602, file: !597, line: 19, baseType: !299, size: 32)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 16, elements: !310)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !609, line: 78, type: !331, isLocal: true, isDefinition: true)
!609 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !609, line: 79, type: !304, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !609, line: 80, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 13)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !609, line: 81, type: !614, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !609, line: 82, type: !191, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !609, line: 83, type: !309, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !609, line: 84, type: !331, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !609, line: 85, type: !326, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !609, line: 86, type: !326, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !609, line: 87, type: !331, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !633, file: !609, line: 76, type: !719, isLocal: false, isDefinition: true)
!633 = distinct !DICompileUnit(language: DW_LANG_C11, file: !609, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !634, retainedTypes: !654, globals: !655, splitDebugInlining: false, nameTableKind: None)
!634 = !{!635, !649, !107}
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !636, line: 42, baseType: !109, size: 32, elements: !637)
!636 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!638 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!639 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!640 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!641 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!642 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!643 = !DIEnumerator(name: "c_quoting_style", value: 5)
!644 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!645 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!646 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!647 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!648 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!649 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !636, line: 254, baseType: !109, size: 32, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!652 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!653 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!654 = !{!103, !126, !127}
!655 = !{!607, !610, !612, !617, !619, !621, !623, !625, !627, !629, !631, !656, !660, !670, !672, !677, !679, !681, !683, !685, !708, !715, !717}
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !633, file: !609, line: 92, type: !658, isLocal: false, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 320, elements: !85)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !633, file: !609, line: 1040, type: !662, isLocal: false, isDefinition: true)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !609, line: 56, size: 448, elements: !663)
!663 = !{!664, !665, !666, !668, !669}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !662, file: !609, line: 59, baseType: !635, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !662, file: !609, line: 62, baseType: !103, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !662, file: !609, line: 66, baseType: !667, size: 256, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 256, elements: !332)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !662, file: !609, line: 69, baseType: !130, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !662, file: !609, line: 72, baseType: !130, size: 64, offset: 384)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !633, file: !609, line: 107, type: !662, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "slot0", scope: !633, file: !609, line: 831, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 256)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !609, line: 321, type: !309, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !609, line: 357, type: !309, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !609, line: 358, type: !309, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !609, line: 199, type: !326, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "quote", scope: !687, file: !609, line: 228, type: !706, isLocal: true, isDefinition: true)
!687 = distinct !DISubprogram(name: "gettext_quote", scope: !609, file: !609, line: 197, type: !688, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !633, retainedNodes: !690)
!688 = !DISubroutineType(types: !689)
!689 = !{!130, !130, !635}
!690 = !{!691, !692, !693, !694, !695}
!691 = !DILocalVariable(name: "msgid", arg: 1, scope: !687, file: !609, line: 197, type: !130)
!692 = !DILocalVariable(name: "s", arg: 2, scope: !687, file: !609, line: 197, type: !635)
!693 = !DILocalVariable(name: "translation", scope: !687, file: !609, line: 199, type: !130)
!694 = !DILocalVariable(name: "w", scope: !687, file: !609, line: 229, type: !589)
!695 = !DILocalVariable(name: "mbs", scope: !687, file: !609, line: 230, type: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !595, line: 6, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !597, line: 21, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 13, size: 64, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !698, file: !597, line: 15, baseType: !103, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !698, file: !597, line: 20, baseType: !702, size: 32, offset: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !698, file: !597, line: 16, size: 32, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !702, file: !597, line: 18, baseType: !109, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !702, file: !597, line: 19, baseType: !299, size: 32)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, elements: !707)
!707 = !{!311, !301}
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "slotvec", scope: !633, file: !609, line: 834, type: !710, isLocal: true, isDefinition: true)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !609, line: 823, size: 128, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !711, file: !609, line: 825, baseType: !127, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !711, file: !609, line: 826, baseType: !124, size: 64, offset: 64)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "nslots", scope: !633, file: !609, line: 832, type: !103, isLocal: true, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "slotvec0", scope: !633, file: !609, line: 833, type: !711, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 704, elements: !721)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!721 = !{!722}
!722 = !DISubrange(count: 11)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !725, line: 274, type: !380, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "lib/userspec.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9b1d112c5d74602907b912457199dc83")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !725, line: 160, type: !614, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !725, line: 165, type: !79, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !725, line: 169, type: !614, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !725, line: 202, type: !145, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !725, line: 229, type: !326, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !738, line: 67, type: !390, isLocal: true, isDefinition: true)
!738 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !738, line: 69, type: !326, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !738, line: 83, type: !326, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !738, line: 83, type: !299, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !738, line: 85, type: !309, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !738, line: 88, type: !749, isLocal: true, isDefinition: true)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 171)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !738, line: 88, type: !480, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !738, line: 105, type: !155, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !738, line: 109, type: !758, isLocal: true, isDefinition: true)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 23)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !738, line: 113, type: !763, isLocal: true, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 28)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(scope: null, file: !738, line: 120, type: !768, isLocal: true, isDefinition: true)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 32)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !738, line: 127, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 36)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !738, line: 134, type: !350, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !738, line: 142, type: !162, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !738, line: 150, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 48)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !738, line: 159, type: !787, isLocal: true, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 52)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !738, line: 170, type: !792, isLocal: true, isDefinition: true)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 60)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !738, line: 248, type: !191, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !738, line: 248, type: !369, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !738, line: 254, type: !191, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !738, line: 254, type: !145, isLocal: true, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !738, line: 254, type: !350, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(scope: null, file: !738, line: 259, type: !3, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !738, line: 259, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 29)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !814, file: !815, line: 26, type: !817, isLocal: false, isDefinition: true)
!814 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !816, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!816 = !{!812}
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 376, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 47)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "exit_failure", scope: !822, file: !823, line: 24, type: !825, isLocal: false, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !824, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!824 = !{!820}
!825 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !828, line: 34, type: !19, isLocal: true, isDefinition: true)
!828 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(scope: null, file: !828, line: 34, type: !326, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(scope: null, file: !828, line: 34, type: !181, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(scope: null, file: !835, line: 108, type: !79, isLocal: true, isDefinition: true)
!835 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "internal_state", scope: !838, file: !835, line: 97, type: !841, isLocal: true, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C11, file: !835, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !839, globals: !840, splitDebugInlining: false, nameTableKind: None)
!839 = !{!125, !127, !132}
!840 = !{!833, !836}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !595, line: 6, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !597, line: 21, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !597, line: 13, size: 64, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !843, file: !597, line: 15, baseType: !103, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !843, file: !597, line: 20, baseType: !847, size: 32, offset: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !843, file: !597, line: 16, size: 32, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !847, file: !597, line: 18, baseType: !109, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !847, file: !597, line: 19, baseType: !299, size: 32)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !853, line: 35, type: !309, isLocal: true, isDefinition: true)
!853 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !853, line: 35, type: !304, isLocal: true, isDefinition: true)
!856 = distinct !DICompileUnit(language: DW_LANG_C11, file: !475, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !857, globals: !858, splitDebugInlining: false, nameTableKind: None)
!857 = !{!125, !133, !132}
!858 = !{!473, !476, !478, !483, !485}
!859 = distinct !DICompileUnit(language: DW_LANG_C11, file: !860, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!861 = distinct !DICompileUnit(language: DW_LANG_C11, file: !862, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!862 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!863 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !864, retainedTypes: !873, globals: !874, splitDebugInlining: false, nameTableKind: None)
!864 = !{!865}
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !866, line: 30, baseType: !109, size: 32, elements: !867)
!866 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!867 = !{!868, !869, !870, !871, !872}
!868 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!869 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!870 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!871 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!872 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!873 = !{!125, !200, !207}
!874 = !{!723, !726, !728, !730, !732, !734}
!875 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !876, retainedTypes: !880, globals: !881, splitDebugInlining: false, nameTableKind: None)
!876 = !{!877}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !738, line: 40, baseType: !109, size: 32, elements: !878)
!878 = !{!879}
!879 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!880 = !{!125}
!881 = !{!736, !739, !741, !743, !745, !747, !752, !754, !756, !761, !766, !771, !776, !778, !780, !785, !790, !795, !797, !799, !801, !803, !805, !807}
!882 = distinct !DICompileUnit(language: DW_LANG_C11, file: !883, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884, retainedTypes: !915, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!884 = !{!885, !897}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !886, file: !883, line: 188, baseType: !109, size: 32, elements: !895)
!886 = distinct !DISubprogram(name: "x2nrealloc", scope: !883, file: !883, line: 176, type: !887, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !882, retainedNodes: !890)
!887 = !DISubroutineType(types: !888)
!888 = !{!125, !125, !889, !127}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!890 = !{!891, !892, !893, !894}
!891 = !DILocalVariable(name: "p", arg: 1, scope: !886, file: !883, line: 176, type: !125)
!892 = !DILocalVariable(name: "pn", arg: 2, scope: !886, file: !883, line: 176, type: !889)
!893 = !DILocalVariable(name: "s", arg: 3, scope: !886, file: !883, line: 176, type: !127)
!894 = !DILocalVariable(name: "n", scope: !886, file: !883, line: 178, type: !127)
!895 = !{!896}
!896 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !898, file: !883, line: 228, baseType: !109, size: 32, elements: !895)
!898 = distinct !DISubprogram(name: "xpalloc", scope: !883, file: !883, line: 223, type: !899, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !882, retainedNodes: !905)
!899 = !DISubroutineType(types: !900)
!900 = !{!125, !125, !901, !902, !904, !902}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !903, line: 130, baseType: !904)
!903 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !128, line: 35, baseType: !263)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914}
!906 = !DILocalVariable(name: "pa", arg: 1, scope: !898, file: !883, line: 223, type: !125)
!907 = !DILocalVariable(name: "pn", arg: 2, scope: !898, file: !883, line: 223, type: !901)
!908 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !898, file: !883, line: 223, type: !902)
!909 = !DILocalVariable(name: "n_max", arg: 4, scope: !898, file: !883, line: 223, type: !904)
!910 = !DILocalVariable(name: "s", arg: 5, scope: !898, file: !883, line: 223, type: !902)
!911 = !DILocalVariable(name: "n0", scope: !898, file: !883, line: 230, type: !902)
!912 = !DILocalVariable(name: "n", scope: !898, file: !883, line: 237, type: !902)
!913 = !DILocalVariable(name: "nbytes", scope: !898, file: !883, line: 248, type: !902)
!914 = !DILocalVariable(name: "adjusted_nbytes", scope: !898, file: !883, line: 252, type: !902)
!915 = !{!124, !125, !223, !263, !129}
!916 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !917, splitDebugInlining: false, nameTableKind: None)
!917 = !{!826, !829, !831}
!918 = distinct !DICompileUnit(language: DW_LANG_C11, file: !919, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "lib/xgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b5210c3f5d54a118d66836a8f2f46b25")
!920 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !922, retainedTypes: !923, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/xstrtoul.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2b318e5928e8382cfa3ae094c8d00222")
!922 = !{!865, !107}
!923 = !{!103, !126, !124, !223, !129}
!924 = distinct !DICompileUnit(language: DW_LANG_C11, file: !925, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!926 = distinct !DICompileUnit(language: DW_LANG_C11, file: !927, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!928 = distinct !DICompileUnit(language: DW_LANG_C11, file: !929, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!929 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!930 = distinct !DICompileUnit(language: DW_LANG_C11, file: !931, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!931 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!932 = distinct !DICompileUnit(language: DW_LANG_C11, file: !933, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !934, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/umaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "afa759af6e92fed26f32f683da6c23a8")
!934 = !{!133}
!935 = distinct !DICompileUnit(language: DW_LANG_C11, file: !936, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !937, retainedTypes: !972, splitDebugInlining: false, nameTableKind: None)
!936 = !DIFile(filename: "lib/mgetgroups.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c6d0df677a26dbd2695c193e3d6de3d1")
!937 = !{!938}
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !939, file: !936, line: 79, baseType: !109, size: 32, elements: !970)
!939 = distinct !DISubprogram(name: "mgetgroups", scope: !936, file: !936, line: 66, type: !940, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !935, retainedNodes: !944)
!940 = !DISubroutineType(types: !941)
!941 = !{!103, !130, !207, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!944 = !{!945, !946, !947, !948, !951, !952, !954, !955, !956, !957, !962, !963, !964, !967, !968}
!945 = !DILocalVariable(name: "username", arg: 1, scope: !939, file: !936, line: 66, type: !130)
!946 = !DILocalVariable(name: "gid", arg: 2, scope: !939, file: !936, line: 66, type: !207)
!947 = !DILocalVariable(name: "groups", arg: 3, scope: !939, file: !936, line: 66, type: !942)
!948 = !DILocalVariable(name: "max_n_groups", scope: !949, file: !936, line: 80, type: !103)
!949 = distinct !DILexicalBlock(scope: !950, file: !936, line: 78, column: 5)
!950 = distinct !DILexicalBlock(scope: !939, file: !936, line: 77, column: 7)
!951 = !DILocalVariable(name: "g", scope: !949, file: !936, line: 82, type: !943)
!952 = !DILocalVariable(name: "last_n_groups", scope: !953, file: !936, line: 88, type: !103)
!953 = distinct !DILexicalBlock(scope: !949, file: !936, line: 87, column: 9)
!954 = !DILocalVariable(name: "ng", scope: !953, file: !936, line: 91, type: !103)
!955 = !DILocalVariable(name: "h", scope: !953, file: !936, line: 98, type: !943)
!956 = !DILocalVariable(name: "max_n_groups", scope: !939, file: !936, line: 118, type: !103)
!957 = !DILocalVariable(name: "g", scope: !958, file: !936, line: 129, type: !943)
!958 = distinct !DILexicalBlock(scope: !959, file: !936, line: 128, column: 9)
!959 = distinct !DILexicalBlock(scope: !960, file: !936, line: 127, column: 11)
!960 = distinct !DILexicalBlock(scope: !961, file: !936, line: 126, column: 5)
!961 = distinct !DILexicalBlock(scope: !939, file: !936, line: 125, column: 7)
!962 = !DILocalVariable(name: "g", scope: !939, file: !936, line: 142, type: !943)
!963 = !DILocalVariable(name: "ng", scope: !939, file: !936, line: 146, type: !103)
!964 = !DILocalVariable(name: "first", scope: !965, file: !936, line: 183, type: !207)
!965 = distinct !DILexicalBlock(scope: !966, file: !936, line: 182, column: 5)
!966 = distinct !DILexicalBlock(scope: !939, file: !936, line: 181, column: 7)
!967 = !DILocalVariable(name: "groups_end", scope: !965, file: !936, line: 184, type: !943)
!968 = !DILocalVariable(name: "next", scope: !969, file: !936, line: 186, type: !943)
!969 = distinct !DILexicalBlock(scope: !965, file: !936, line: 186, column: 7)
!970 = !{!971}
!971 = !DIEnumerator(name: "N_GROUPS_INIT", value: 10)
!972 = !{!125, !207}
!973 = distinct !DICompileUnit(language: DW_LANG_C11, file: !974, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !975, splitDebugInlining: false, nameTableKind: None)
!974 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!975 = !{!223, !129, !125}
!976 = distinct !DICompileUnit(language: DW_LANG_C11, file: !853, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !977, splitDebugInlining: false, nameTableKind: None)
!977 = !{!851, !854}
!978 = distinct !DICompileUnit(language: DW_LANG_C11, file: !979, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!980 = distinct !DICompileUnit(language: DW_LANG_C11, file: !981, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!982 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!983 = !{i32 7, !"Dwarf Version", i32 5}
!984 = !{i32 2, !"Debug Info Version", i32 3}
!985 = !{i32 1, !"wchar_size", i32 4}
!986 = !{i32 8, !"PIC Level", i32 2}
!987 = !{i32 7, !"PIE Level", i32 2}
!988 = !{i32 7, !"uwtable", i32 2}
!989 = !{i32 7, !"frame-pointer", i32 1}
!990 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 88, type: !991, scopeLine: 89, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !993)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !103}
!993 = !{!994}
!994 = !DILocalVariable(name: "status", arg: 1, scope: !990, file: !2, line: 88, type: !103)
!995 = !DILocation(line: 0, scope: !990)
!996 = !DILocation(line: 90, column: 14, scope: !997)
!997 = distinct !DILexicalBlock(scope: !990, file: !2, line: 90, column: 7)
!998 = !DILocation(line: 90, column: 7, scope: !990)
!999 = !DILocation(line: 91, column: 5, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !997, file: !2, line: 91, column: 5)
!1001 = !{!1002, !1002, i64 0}
!1002 = !{!"any pointer", !1003, i64 0}
!1003 = !{!"omnipotent char", !1004, i64 0}
!1004 = !{!"Simple C/C++ TBAA"}
!1005 = !DILocation(line: 94, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !997, file: !2, line: 93, column: 5)
!1007 = !DILocation(line: 95, column: 7, scope: !1006)
!1008 = !DILocation(line: 100, column: 7, scope: !1006)
!1009 = !DILocation(line: 104, column: 7, scope: !1006)
!1010 = !DILocation(line: 108, column: 7, scope: !1006)
!1011 = !DILocation(line: 112, column: 7, scope: !1006)
!1012 = !DILocation(line: 116, column: 7, scope: !1006)
!1013 = !DILocation(line: 120, column: 7, scope: !1006)
!1014 = !DILocation(line: 124, column: 7, scope: !1006)
!1015 = !DILocation(line: 128, column: 7, scope: !1006)
!1016 = !DILocation(line: 133, column: 7, scope: !1006)
!1017 = !DILocation(line: 134, column: 7, scope: !1006)
!1018 = !DILocation(line: 135, column: 7, scope: !1006)
!1019 = !DILocalVariable(name: "program", arg: 1, scope: !1020, file: !102, line: 836, type: !130)
!1020 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !102, file: !102, line: 836, type: !1021, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !1023)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !130}
!1023 = !{!1019, !1024, !1031, !1032, !1034, !1035}
!1024 = !DILocalVariable(name: "infomap", scope: !1020, file: !102, line: 838, type: !1025)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1026, size: 896, elements: !327)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1020, file: !102, line: 838, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1027, file: !102, line: 838, baseType: !130, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1027, file: !102, line: 838, baseType: !130, size: 64, offset: 64)
!1031 = !DILocalVariable(name: "node", scope: !1020, file: !102, line: 848, type: !130)
!1032 = !DILocalVariable(name: "map_prog", scope: !1020, file: !102, line: 849, type: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1034 = !DILocalVariable(name: "lc_messages", scope: !1020, file: !102, line: 861, type: !130)
!1035 = !DILocalVariable(name: "url_program", scope: !1020, file: !102, line: 874, type: !130)
!1036 = !DILocation(line: 0, scope: !1020, inlinedAt: !1037)
!1037 = distinct !DILocation(line: 139, column: 7, scope: !1006)
!1038 = !DILocation(line: 857, column: 3, scope: !1020, inlinedAt: !1037)
!1039 = !DILocation(line: 861, column: 29, scope: !1020, inlinedAt: !1037)
!1040 = !DILocation(line: 862, column: 7, scope: !1041, inlinedAt: !1037)
!1041 = distinct !DILexicalBlock(scope: !1020, file: !102, line: 862, column: 7)
!1042 = !DILocation(line: 862, column: 19, scope: !1041, inlinedAt: !1037)
!1043 = !DILocation(line: 862, column: 22, scope: !1041, inlinedAt: !1037)
!1044 = !DILocation(line: 862, column: 7, scope: !1020, inlinedAt: !1037)
!1045 = !DILocation(line: 868, column: 7, scope: !1046, inlinedAt: !1037)
!1046 = distinct !DILexicalBlock(scope: !1041, file: !102, line: 863, column: 5)
!1047 = !DILocation(line: 870, column: 5, scope: !1046, inlinedAt: !1037)
!1048 = !DILocation(line: 875, column: 3, scope: !1020, inlinedAt: !1037)
!1049 = !DILocation(line: 877, column: 3, scope: !1020, inlinedAt: !1037)
!1050 = !DILocation(line: 141, column: 3, scope: !990)
!1051 = !DISubprogram(name: "dcgettext", scope: !1052, file: !1052, line: 51, type: !1053, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1052 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!124, !130, !130, !103}
!1055 = !{}
!1056 = !DISubprogram(name: "__fprintf_chk", scope: !1057, file: !1057, line: 93, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1057 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!103, !1060, !103, !1061, null}
!1060 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !236)
!1061 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !130)
!1062 = !DISubprogram(name: "__printf_chk", scope: !1057, file: !1057, line: 95, type: !1063, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!103, !103, !1061, null}
!1065 = !DISubprogram(name: "fputs_unlocked", scope: !523, file: !523, line: 691, type: !1066, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!103, !1061, !1060}
!1068 = !DILocation(line: 0, scope: !213)
!1069 = !DILocation(line: 581, column: 7, scope: !221)
!1070 = !{!1071, !1071, i64 0}
!1071 = !{!"int", !1003, i64 0}
!1072 = !DILocation(line: 581, column: 19, scope: !221)
!1073 = !DILocation(line: 581, column: 7, scope: !213)
!1074 = !DILocation(line: 585, column: 26, scope: !220)
!1075 = !DILocation(line: 0, scope: !220)
!1076 = !DILocation(line: 586, column: 23, scope: !220)
!1077 = !DILocation(line: 586, column: 28, scope: !220)
!1078 = !DILocation(line: 586, column: 32, scope: !220)
!1079 = !{!1003, !1003, i64 0}
!1080 = !DILocation(line: 586, column: 38, scope: !220)
!1081 = !DILocalVariable(name: "__s1", arg: 1, scope: !1082, file: !1083, line: 1359, type: !130)
!1082 = distinct !DISubprogram(name: "streq", scope: !1083, file: !1083, line: 1359, type: !1084, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !1086)
!1083 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!223, !130, !130}
!1086 = !{!1081, !1087}
!1087 = !DILocalVariable(name: "__s2", arg: 2, scope: !1082, file: !1083, line: 1359, type: !130)
!1088 = !DILocation(line: 0, scope: !1082, inlinedAt: !1089)
!1089 = distinct !DILocation(line: 586, column: 41, scope: !220)
!1090 = !DILocation(line: 1361, column: 11, scope: !1082, inlinedAt: !1089)
!1091 = !DILocation(line: 1361, column: 10, scope: !1082, inlinedAt: !1089)
!1092 = !DILocation(line: 586, column: 19, scope: !220)
!1093 = !DILocation(line: 587, column: 5, scope: !220)
!1094 = !DILocation(line: 588, column: 7, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !213, file: !102, line: 588, column: 7)
!1096 = !DILocation(line: 588, column: 7, scope: !213)
!1097 = !DILocation(line: 590, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1095, file: !102, line: 589, column: 5)
!1099 = !DILocation(line: 591, column: 7, scope: !1098)
!1100 = !DILocation(line: 595, column: 37, scope: !213)
!1101 = !DILocation(line: 595, column: 35, scope: !213)
!1102 = !DILocation(line: 596, column: 29, scope: !213)
!1103 = !DILocation(line: 597, column: 8, scope: !229)
!1104 = !DILocation(line: 597, column: 7, scope: !213)
!1105 = !DILocation(line: 604, column: 24, scope: !228)
!1106 = !DILocation(line: 604, column: 12, scope: !229)
!1107 = !DILocation(line: 0, scope: !227)
!1108 = !DILocation(line: 610, column: 16, scope: !227)
!1109 = !DILocation(line: 610, column: 7, scope: !227)
!1110 = !DILocation(line: 611, column: 21, scope: !227)
!1111 = !{!1112, !1112, i64 0}
!1112 = !{!"short", !1003, i64 0}
!1113 = !DILocation(line: 611, column: 19, scope: !227)
!1114 = !DILocation(line: 611, column: 16, scope: !227)
!1115 = !DILocation(line: 610, column: 30, scope: !227)
!1116 = distinct !{!1116, !1109, !1110, !1117}
!1117 = !{!"llvm.loop.mustprogress"}
!1118 = !DILocation(line: 612, column: 18, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !227, file: !102, line: 612, column: 11)
!1120 = !DILocation(line: 612, column: 11, scope: !227)
!1121 = !DILocation(line: 620, column: 23, scope: !213)
!1122 = !DILocation(line: 625, column: 39, scope: !213)
!1123 = !DILocation(line: 626, column: 3, scope: !213)
!1124 = !DILocation(line: 626, column: 10, scope: !213)
!1125 = !DILocation(line: 626, column: 21, scope: !213)
!1126 = !DILocation(line: 628, column: 44, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !102, line: 628, column: 11)
!1128 = distinct !DILexicalBlock(scope: !213, file: !102, line: 627, column: 5)
!1129 = !DILocation(line: 628, column: 32, scope: !1127)
!1130 = !DILocation(line: 628, column: 49, scope: !1127)
!1131 = !DILocation(line: 628, column: 11, scope: !1128)
!1132 = !DILocation(line: 630, column: 11, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1128, file: !102, line: 630, column: 11)
!1134 = !DILocation(line: 630, column: 11, scope: !1128)
!1135 = !DILocation(line: 632, column: 26, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !102, line: 632, column: 15)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !102, line: 631, column: 9)
!1138 = !DILocation(line: 632, column: 34, scope: !1136)
!1139 = !DILocation(line: 632, column: 37, scope: !1136)
!1140 = !DILocation(line: 632, column: 15, scope: !1137)
!1141 = !DILocation(line: 640, column: 16, scope: !1128)
!1142 = distinct !{!1142, !1123, !1143, !1117}
!1143 = !DILocation(line: 641, column: 5, scope: !213)
!1144 = !DILocation(line: 644, column: 3, scope: !213)
!1145 = !DILocation(line: 0, scope: !1082, inlinedAt: !1146)
!1146 = distinct !DILocation(line: 648, column: 31, scope: !213)
!1147 = !DILocation(line: 0, scope: !1082, inlinedAt: !1148)
!1148 = distinct !DILocation(line: 649, column: 31, scope: !213)
!1149 = !DILocation(line: 0, scope: !1082, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 650, column: 31, scope: !213)
!1151 = !DILocation(line: 0, scope: !1082, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 651, column: 31, scope: !213)
!1153 = !DILocation(line: 0, scope: !1082, inlinedAt: !1154)
!1154 = distinct !DILocation(line: 652, column: 31, scope: !213)
!1155 = !DILocation(line: 0, scope: !1082, inlinedAt: !1156)
!1156 = distinct !DILocation(line: 653, column: 31, scope: !213)
!1157 = !DILocation(line: 0, scope: !1082, inlinedAt: !1158)
!1158 = distinct !DILocation(line: 654, column: 31, scope: !213)
!1159 = !DILocation(line: 0, scope: !1082, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 655, column: 31, scope: !213)
!1161 = !DILocation(line: 0, scope: !1082, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 656, column: 31, scope: !213)
!1163 = !DILocation(line: 0, scope: !1082, inlinedAt: !1164)
!1164 = distinct !DILocation(line: 657, column: 31, scope: !213)
!1165 = !DILocation(line: 663, column: 7, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !213, file: !102, line: 663, column: 7)
!1167 = !DILocation(line: 664, column: 7, scope: !1166)
!1168 = !DILocation(line: 664, column: 10, scope: !1166)
!1169 = !DILocation(line: 663, column: 7, scope: !213)
!1170 = !DILocation(line: 669, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1166, file: !102, line: 665, column: 5)
!1172 = !DILocation(line: 671, column: 5, scope: !1171)
!1173 = !DILocation(line: 676, column: 7, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1166, file: !102, line: 673, column: 5)
!1175 = !DILocation(line: 679, column: 3, scope: !213)
!1176 = !DILocation(line: 683, column: 3, scope: !213)
!1177 = !DILocation(line: 686, column: 3, scope: !213)
!1178 = !DILocation(line: 688, column: 3, scope: !213)
!1179 = !DILocation(line: 691, column: 3, scope: !213)
!1180 = !DILocation(line: 695, column: 3, scope: !213)
!1181 = !DILocation(line: 696, column: 1, scope: !213)
!1182 = !DISubprogram(name: "setlocale", scope: !1183, file: !1183, line: 122, type: !1184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1183 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!124, !103, !130}
!1186 = !DISubprogram(name: "strncmp", scope: !1187, file: !1187, line: 159, type: !1188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1187 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!103, !130, !130, !127}
!1190 = !DISubprogram(name: "exit", scope: !1191, file: !1191, line: 624, type: !991, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1191 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1192 = !DISubprogram(name: "getenv", scope: !1191, file: !1191, line: 641, type: !1193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!124, !130}
!1195 = !DISubprogram(name: "strcmp", scope: !1187, file: !1187, line: 156, type: !1196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!103, !130, !130}
!1198 = !DISubprogram(name: "strspn", scope: !1187, file: !1187, line: 297, type: !1199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!129, !130, !130}
!1201 = !DISubprogram(name: "strchr", scope: !1187, file: !1187, line: 246, type: !1202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!124, !130, !103}
!1204 = !DISubprogram(name: "__ctype_b_loc", scope: !108, file: !108, line: 79, type: !1205, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1207}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!1210 = !DISubprogram(name: "strcspn", scope: !1187, file: !1187, line: 293, type: !1199, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1211 = !DISubprogram(name: "fwrite_unlocked", scope: !523, file: !523, line: 704, type: !1212, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1055)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!127, !1214, !127, !127, !1060}
!1214 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1217 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 145, type: !1218, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !99, retainedNodes: !1221)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!103, !103, !1220}
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1235, !1247, !1248, !1250}
!1222 = !DILocalVariable(name: "argc", arg: 1, scope: !1217, file: !2, line: 145, type: !103)
!1223 = !DILocalVariable(name: "argv", arg: 2, scope: !1217, file: !2, line: 145, type: !1220)
!1224 = !DILocalVariable(name: "optc", scope: !1217, file: !2, line: 147, type: !103)
!1225 = !DILocalVariable(name: "selinux_enabled", scope: !1217, file: !2, line: 148, type: !103)
!1226 = !DILocalVariable(name: "smack_enabled", scope: !1217, file: !2, line: 149, type: !223)
!1227 = !DILocalVariable(name: "n_ids", scope: !1217, file: !2, line: 207, type: !127)
!1228 = !DILocalVariable(name: "default_format", scope: !1217, file: !2, line: 216, type: !223)
!1229 = !DILocalVariable(name: "pw_name", scope: !1230, file: !2, line: 257, type: !124)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !2, line: 256, column: 9)
!1231 = distinct !DILexicalBlock(scope: !1232, file: !2, line: 255, column: 7)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !2, line: 255, column: 7)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !2, line: 247, column: 5)
!1234 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 246, column: 7)
!1235 = !DILocalVariable(name: "pwd", scope: !1230, file: !2, line: 258, type: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !1238, line: 49, size: 384, elements: !1239)
!1238 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1237, file: !1238, line: 51, baseType: !124, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1237, file: !1238, line: 52, baseType: !124, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1237, file: !1238, line: 54, baseType: !202, size: 32, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1237, file: !1238, line: 55, baseType: !208, size: 32, offset: 160)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1237, file: !1238, line: 56, baseType: !124, size: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1237, file: !1238, line: 57, baseType: !124, size: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1237, file: !1238, line: 58, baseType: !124, size: 64, offset: 320)
!1247 = !DILocalVariable(name: "spec", scope: !1230, file: !2, line: 259, type: !130)
!1248 = !DILocalVariable(name: "NO_UID", scope: !1249, file: !2, line: 291, type: !200)
!1249 = distinct !DILexicalBlock(scope: !1234, file: !2, line: 287, column: 5)
!1250 = !DILocalVariable(name: "NO_GID", scope: !1249, file: !2, line: 292, type: !207)
!1251 = !DILocation(line: 0, scope: !1217)
!1252 = !DILocation(line: 152, column: 21, scope: !1217)
!1253 = !DILocation(line: 152, column: 3, scope: !1217)
!1254 = !DILocation(line: 153, column: 3, scope: !1217)
!1255 = !DILocation(line: 154, column: 3, scope: !1217)
!1256 = !DILocation(line: 155, column: 3, scope: !1217)
!1257 = !DILocation(line: 157, column: 3, scope: !1217)
!1258 = !DILocation(line: 159, column: 3, scope: !1217)
!1259 = !DILocation(line: 159, column: 18, scope: !1217)
!1260 = !DILocation(line: 176, column: 13, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !2, line: 175, column: 15)
!1262 = distinct !DILexicalBlock(scope: !1263, file: !2, line: 162, column: 9)
!1263 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 160, column: 5)
!1264 = !DILocation(line: 187, column: 11, scope: !1262)
!1265 = !DILocation(line: 190, column: 11, scope: !1262)
!1266 = !DILocation(line: 193, column: 11, scope: !1262)
!1267 = !DILocation(line: 196, column: 11, scope: !1262)
!1268 = !DILocation(line: 199, column: 11, scope: !1262)
!1269 = !DILocation(line: 200, column: 9, scope: !1262)
!1270 = !DILocation(line: 201, column: 9, scope: !1262)
!1271 = !DILocation(line: 203, column: 11, scope: !1262)
!1272 = !DILocation(line: 0, scope: !1262)
!1273 = distinct !{!1273, !1258, !1274, !1117}
!1274 = !DILocation(line: 205, column: 5, scope: !1217)
!1275 = !DILocation(line: 207, column: 25, scope: !1217)
!1276 = !DILocation(line: 207, column: 23, scope: !1217)
