; ModuleID = 'src/link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [40 x i8] c"Usage: %s FILE1 FILE2\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [76 x i8] c"Call the link function to create a link named FILE2 to an existing FILE1.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [5 x i8] c"link\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !32

!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 15)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !77, line: 676, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 61)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !77, line: 679, type: !148, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !77, line: 683, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !77, line: 688, type: !19, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !77, line: 691, type: !164, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(scope: null, file: !77, line: 839, type: !56, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(scope: null, file: !77, line: 840, type: !205, isLocal: true, isDefinition: true)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 22)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(scope: null, file: !77, line: 841, type: !185, isLocal: true, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !77, line: 862, type: !129, isLocal: true, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(scope: null, file: !77, line: 868, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 71)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(scope: null, file: !77, line: 875, type: !219, isLocal: true, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 27)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 51)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !77, line: 877, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 12)
!232 = !{!233, !234, !235, !238, !240, !241, !242, !246, !247, !248, !249, !251, !305, !306, !307, !309, !310}
!233 = !DILocalVariable(name: "program", arg: 1, scope: !76, file: !77, line: 573, type: !80)
!234 = !DILocalVariable(name: "option", arg: 2, scope: !76, file: !77, line: 573, type: !80)
!235 = !DILocalVariable(name: "term", scope: !236, file: !77, line: 585, type: !80)
!236 = distinct !DILexicalBlock(scope: !237, file: !77, line: 582, column: 5)
!237 = distinct !DILexicalBlock(scope: !76, file: !77, line: 581, column: 7)
!238 = !DILocalVariable(name: "double_space", scope: !76, file: !77, line: 594, type: !239)
!239 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!240 = !DILocalVariable(name: "first_word", scope: !76, file: !77, line: 595, type: !80)
!241 = !DILocalVariable(name: "option_text", scope: !76, file: !77, line: 596, type: !80)
!242 = !DILocalVariable(name: "s", scope: !243, file: !77, line: 608, type: !80)
!243 = distinct !DILexicalBlock(scope: !244, file: !77, line: 605, column: 5)
!244 = distinct !DILexicalBlock(scope: !245, file: !77, line: 604, column: 12)
!245 = distinct !DILexicalBlock(scope: !76, file: !77, line: 597, column: 7)
!246 = !DILocalVariable(name: "spaces", scope: !243, file: !77, line: 609, type: !118)
!247 = !DILocalVariable(name: "anchor_len", scope: !76, file: !77, line: 620, type: !118)
!248 = !DILocalVariable(name: "desc_text", scope: !76, file: !77, line: 625, type: !80)
!249 = !DILocalVariable(name: "__ptr", scope: !250, file: !77, line: 644, type: !80)
!250 = distinct !DILexicalBlock(scope: !76, file: !77, line: 644, column: 3)
!251 = !DILocalVariable(name: "__stream", scope: !250, file: !77, line: 644, type: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !255)
!254 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !257)
!256 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!257 = !{!258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !274, !276, !277, !278, !282, !283, !285, !286, !289, !291, !294, !297, !298, !299, !300, !301}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !255, file: !256, line: 51, baseType: !116, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !255, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !255, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !255, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !255, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !255, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !255, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !255, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !255, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !255, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !255, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !255, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !255, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !256, line: 36, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !255, file: !256, line: 70, baseType: !275, size: 64, offset: 832)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !255, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !255, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !255, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !280, line: 152, baseType: !281)
!280 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!281 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !255, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !255, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!284 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !255, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !255, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !256, line: 43, baseType: null)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !255, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !280, line: 153, baseType: !281)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !255, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !256, line: 37, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !255, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !256, line: 38, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !255, file: !256, line: 93, baseType: !275, size: 64, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !255, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !255, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !255, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !255, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 20)
!305 = !DILocalVariable(name: "__cnt", scope: !250, file: !77, line: 644, type: !118)
!306 = !DILocalVariable(name: "url_program", scope: !76, file: !77, line: 648, type: !80)
!307 = !DILocalVariable(name: "__ptr", scope: !308, file: !77, line: 686, type: !80)
!308 = distinct !DILexicalBlock(scope: !76, file: !77, line: 686, column: 3)
!309 = !DILocalVariable(name: "__stream", scope: !308, file: !77, line: 686, type: !252)
!310 = !DILocalVariable(name: "__cnt", scope: !308, file: !77, line: 686, type: !118)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !313, line: 3, type: !185, isLocal: true, isDefinition: true)
!313 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "Version", scope: !316, file: !313, line: 3, type: !80, isLocal: false, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C11, file: !313, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !317, splitDebugInlining: false, nameTableKind: None)
!317 = !{!311, !314}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "file_name", scope: !320, file: !321, line: 45, type: !80, isLocal: true, isDefinition: true)
!320 = distinct !DICompileUnit(language: DW_LANG_C11, file: !321, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!322 = !{!323, !325, !327, !329, !318, !331}
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !159, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !321, line: 121, type: !229, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !321, line: 123, type: !159, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !321, line: 126, type: !148, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !320, file: !321, line: 55, type: !239, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !335, file: !336, line: 66, type: !387, isLocal: false, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C11, file: !336, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !337, globals: !338, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!337 = !{!115, !121}
!338 = !{!339, !341, !366, !368, !370, !372, !333, !374, !376, !378, !380, !385}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !336, line: 272, type: !19, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "old_file_name", scope: !343, file: !336, line: 304, type: !80, isLocal: true, isDefinition: true)
!343 = distinct !DISubprogram(name: "verror_at_line", scope: !336, file: !336, line: 298, type: !344, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !359)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !116, !116, !80, !86, !80, !346}
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !347, line: 52, baseType: !348)
!347 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !349, line: 14, baseType: !350)
!349 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !351, baseType: !352)
!351 = !DIFile(filename: "lib/error.c", directory: "/src")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !353)
!353 = !{!354, !355, !356, !357, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !352, file: !351, baseType: !115, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !352, file: !351, baseType: !115, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !352, file: !351, baseType: !115, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !352, file: !351, baseType: !116, size: 32, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !352, file: !351, baseType: !116, size: 32, offset: 224)
!359 = !{!360, !361, !362, !363, !364, !365}
!360 = !DILocalVariable(name: "status", arg: 1, scope: !343, file: !336, line: 298, type: !116)
!361 = !DILocalVariable(name: "errnum", arg: 2, scope: !343, file: !336, line: 298, type: !116)
!362 = !DILocalVariable(name: "file_name", arg: 3, scope: !343, file: !336, line: 298, type: !80)
!363 = !DILocalVariable(name: "line_number", arg: 4, scope: !343, file: !336, line: 298, type: !86)
!364 = !DILocalVariable(name: "message", arg: 5, scope: !343, file: !336, line: 298, type: !80)
!365 = !DILocalVariable(name: "args", arg: 6, scope: !343, file: !336, line: 298, type: !346)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "old_line_number", scope: !343, file: !336, line: 305, type: !86, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !336, line: 338, type: !129, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !164, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !336, line: 346, type: !139, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "error_message_count", scope: !335, file: !336, line: 69, type: !86, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !335, file: !336, line: 295, type: !116, isLocal: false, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !159, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !336, line: 208, type: !382, isLocal: true, isDefinition: true)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 21)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !336, line: 214, type: !19, isLocal: true, isDefinition: true)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !392, line: 60, type: !139, isLocal: true, isDefinition: true)
!392 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "long_options", scope: !395, file: !392, line: 34, type: !403, isLocal: true, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C11, file: !392, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !396, splitDebugInlining: false, nameTableKind: None)
!396 = !{!390, !397, !399, !401, !393}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !392, line: 112, type: !34, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !392, line: 36, type: !19, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !392, line: 37, type: !164, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 768, elements: !149)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !406, line: 50, size: 256, elements: !407)
!406 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!407 = !{!408, !409, !410, !412}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 52, baseType: !80, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !405, file: !406, line: 55, baseType: !116, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !406, line: 56, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !405, file: !406, line: 57, baseType: !116, size: 32, offset: 192)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "program_name", scope: !415, file: !416, line: 31, type: !80, isLocal: false, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C11, file: !416, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !417, globals: !418, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!417 = !{!260}
!418 = !{!413, !419, !421}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !416, line: 46, type: !164, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !416, line: 49, type: !129, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "utf07FF", scope: !425, file: !426, line: 46, type: !453, isLocal: true, isDefinition: true)
!425 = distinct !DISubprogram(name: "proper_name_lite", scope: !426, file: !426, line: 38, type: !427, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !429, retainedNodes: !431)
!426 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!427 = !DISubroutineType(types: !428)
!428 = !{!80, !80, !80}
!429 = distinct !DICompileUnit(language: DW_LANG_C11, file: !426, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !430, splitDebugInlining: false, nameTableKind: None)
!430 = !{!423}
!431 = !{!432, !433, !434, !435, !440}
!432 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !425, file: !426, line: 38, type: !80)
!433 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !425, file: !426, line: 38, type: !80)
!434 = !DILocalVariable(name: "translation", scope: !425, file: !426, line: 40, type: !80)
!435 = !DILocalVariable(name: "w", scope: !425, file: !426, line: 47, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !437, line: 37, baseType: !438)
!437 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !280, line: 57, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !280, line: 42, baseType: !86)
!440 = !DILocalVariable(name: "mbs", scope: !425, file: !426, line: 48, type: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !443)
!442 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !445)
!444 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !446)
!446 = !{!447, !448}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !445, file: !444, line: 15, baseType: !116, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !445, file: !444, line: 20, baseType: !449, size: 32, offset: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !444, line: 16, size: 32, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !449, file: !444, line: 18, baseType: !86, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !449, file: !444, line: 19, baseType: !129, size: 32)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 16, elements: !140)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !456, line: 78, type: !164, isLocal: true, isDefinition: true)
!456 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !456, line: 79, type: !134, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !456, line: 80, type: !461, isLocal: true, isDefinition: true)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 13)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !456, line: 81, type: !461, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !456, line: 82, type: !302, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !456, line: 83, type: !139, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !456, line: 84, type: !164, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !456, line: 85, type: !159, isLocal: true, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !456, line: 86, type: !159, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !456, line: 87, type: !164, isLocal: true, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !480, file: !456, line: 76, type: !552, isLocal: false, isDefinition: true)
!480 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !481, retainedTypes: !487, globals: !488, splitDebugInlining: false, nameTableKind: None)
!481 = !{!84, !482, !99}
!482 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !85, line: 254, baseType: !86, size: 32, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!485 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!486 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!487 = !{!116, !117, !118}
!488 = !{!454, !457, !459, !464, !466, !468, !470, !472, !474, !476, !478, !489, !493, !503, !505, !510, !512, !514, !516, !518, !541, !548, !550}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !480, file: !456, line: 92, type: !491, isLocal: false, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 320, elements: !40)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !480, file: !456, line: 1040, type: !495, isLocal: false, isDefinition: true)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !456, line: 56, size: 448, elements: !496)
!496 = !{!497, !498, !499, !501, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !495, file: !456, line: 59, baseType: !84, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !456, line: 62, baseType: !116, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !495, file: !456, line: 66, baseType: !500, size: 256, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 256, elements: !165)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !495, file: !456, line: 69, baseType: !80, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !495, file: !456, line: 72, baseType: !80, size: 64, offset: 384)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !480, file: !456, line: 107, type: !495, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "slot0", scope: !480, file: !456, line: 831, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 256)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !456, line: 321, type: !139, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !456, line: 357, type: !139, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !456, line: 358, type: !139, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !456, line: 199, type: !159, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "quote", scope: !520, file: !456, line: 228, type: !539, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "gettext_quote", scope: !456, file: !456, line: 197, type: !521, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !480, retainedNodes: !523)
!521 = !DISubroutineType(types: !522)
!522 = !{!80, !80, !84}
!523 = !{!524, !525, !526, !527, !528}
!524 = !DILocalVariable(name: "msgid", arg: 1, scope: !520, file: !456, line: 197, type: !80)
!525 = !DILocalVariable(name: "s", arg: 2, scope: !520, file: !456, line: 197, type: !84)
!526 = !DILocalVariable(name: "translation", scope: !520, file: !456, line: 199, type: !80)
!527 = !DILocalVariable(name: "w", scope: !520, file: !456, line: 229, type: !436)
!528 = !DILocalVariable(name: "mbs", scope: !520, file: !456, line: 230, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !531, file: !444, line: 15, baseType: !116, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !531, file: !444, line: 20, baseType: !535, size: 32, offset: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !531, file: !444, line: 16, size: 32, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !535, file: !444, line: 18, baseType: !86, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !535, file: !444, line: 19, baseType: !129, size: 32)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, elements: !540)
!540 = !{!141, !131}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "slotvec", scope: !480, file: !456, line: 834, type: !543, isLocal: true, isDefinition: true)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !456, line: 823, size: 128, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !456, line: 825, baseType: !118, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !544, file: !456, line: 826, baseType: !260, size: 64, offset: 64)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "nslots", scope: !480, file: !456, line: 832, type: !116, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "slotvec0", scope: !480, file: !456, line: 833, type: !544, isLocal: true, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 704, elements: !554)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!554 = !{!555}
!555 = !DISubrange(count: 11)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !558, line: 67, type: !229, isLocal: true, isDefinition: true)
!558 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !558, line: 69, type: !159, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !558, line: 83, type: !159, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !558, line: 83, type: !129, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !558, line: 85, type: !139, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !558, line: 88, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 171)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !558, line: 88, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 34)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !558, line: 105, type: !56, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(scope: null, file: !558, line: 109, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 23)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !558, line: 113, type: !71, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !558, line: 120, type: !588, isLocal: true, isDefinition: true)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 32)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !558, line: 127, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 36)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !558, line: 134, type: !9, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !558, line: 142, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 44)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !558, line: 150, type: !605, isLocal: true, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 48)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !558, line: 159, type: !610, isLocal: true, isDefinition: true)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 52)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !558, line: 170, type: !615, isLocal: true, isDefinition: true)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 60)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(scope: null, file: !558, line: 248, type: !302, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !558, line: 248, type: !205, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !302, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !49, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !558, line: 254, type: !9, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !558, line: 259, type: !3, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !558, line: 259, type: !632, isLocal: true, isDefinition: true)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 29)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !637, file: !638, line: 26, type: !640, isLocal: false, isDefinition: true)
!637 = distinct !DICompileUnit(language: DW_LANG_C11, file: !638, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !639, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!639 = !{!635}
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 376, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 47)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "exit_failure", scope: !645, file: !646, line: 24, type: !648, isLocal: false, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !647, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!647 = !{!643}
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !148, isLocal: true, isDefinition: true)
!651 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !159, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !651, line: 34, type: !66, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !658, line: 108, type: !34, isLocal: true, isDefinition: true)
!658 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "internal_state", scope: !661, file: !658, line: 97, type: !664, isLocal: true, isDefinition: true)
!661 = distinct !DICompileUnit(language: DW_LANG_C11, file: !658, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !662, globals: !663, splitDebugInlining: false, nameTableKind: None)
!662 = !{!115, !118, !121}
!663 = !{!656, !659}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !442, line: 6, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !444, line: 21, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 13, size: 64, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !666, file: !444, line: 15, baseType: !116, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !666, file: !444, line: 20, baseType: !670, size: 32, offset: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !666, file: !444, line: 16, size: 32, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !670, file: !444, line: 18, baseType: !86, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !670, file: !444, line: 19, baseType: !129, size: 32)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !676, line: 35, type: !139, isLocal: true, isDefinition: true)
!676 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !676, line: 35, type: !134, isLocal: true, isDefinition: true)
!679 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!680 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!681 = distinct !DICompileUnit(language: DW_LANG_C11, file: !558, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !686, globals: !687, splitDebugInlining: false, nameTableKind: None)
!682 = !{!683}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !558, line: 40, baseType: !86, size: 32, elements: !684)
!684 = !{!685}
!685 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!686 = !{!115}
!687 = !{!556, !559, !561, !563, !565, !567, !572, !577, !579, !584, !586, !591, !596, !598, !603, !608, !613, !618, !620, !622, !624, !626, !628, !630}
!688 = distinct !DICompileUnit(language: DW_LANG_C11, file: !689, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !690, retainedTypes: !721, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!690 = !{!691, !703}
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !692, file: !689, line: 188, baseType: !86, size: 32, elements: !701)
!692 = distinct !DISubprogram(name: "x2nrealloc", scope: !689, file: !689, line: 176, type: !693, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !688, retainedNodes: !696)
!693 = !DISubroutineType(types: !694)
!694 = !{!115, !115, !695, !118}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!696 = !{!697, !698, !699, !700}
!697 = !DILocalVariable(name: "p", arg: 1, scope: !692, file: !689, line: 176, type: !115)
!698 = !DILocalVariable(name: "pn", arg: 2, scope: !692, file: !689, line: 176, type: !695)
!699 = !DILocalVariable(name: "s", arg: 3, scope: !692, file: !689, line: 176, type: !118)
!700 = !DILocalVariable(name: "n", scope: !692, file: !689, line: 178, type: !118)
!701 = !{!702}
!702 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !704, file: !689, line: 228, baseType: !86, size: 32, elements: !701)
!704 = distinct !DISubprogram(name: "xpalloc", scope: !689, file: !689, line: 223, type: !705, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !688, retainedNodes: !711)
!705 = !DISubroutineType(types: !706)
!706 = !{!115, !115, !707, !708, !710, !708}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !709, line: 130, baseType: !710)
!709 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !119, line: 35, baseType: !281)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720}
!712 = !DILocalVariable(name: "pa", arg: 1, scope: !704, file: !689, line: 223, type: !115)
!713 = !DILocalVariable(name: "pn", arg: 2, scope: !704, file: !689, line: 223, type: !707)
!714 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !704, file: !689, line: 223, type: !708)
!715 = !DILocalVariable(name: "n_max", arg: 4, scope: !704, file: !689, line: 223, type: !710)
!716 = !DILocalVariable(name: "s", arg: 5, scope: !704, file: !689, line: 223, type: !708)
!717 = !DILocalVariable(name: "n0", scope: !704, file: !689, line: 230, type: !708)
!718 = !DILocalVariable(name: "n", scope: !704, file: !689, line: 237, type: !708)
!719 = !DILocalVariable(name: "nbytes", scope: !704, file: !689, line: 248, type: !708)
!720 = !DILocalVariable(name: "adjusted_nbytes", scope: !704, file: !689, line: 252, type: !708)
!721 = !{!260, !115, !239, !281, !120}
!722 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !723, splitDebugInlining: false, nameTableKind: None)
!723 = !{!649, !652, !654}
!724 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !686, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !686, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!734 = !{!239, !120, !115}
!735 = distinct !DICompileUnit(language: DW_LANG_C11, file: !676, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !736, splitDebugInlining: false, nameTableKind: None)
!736 = !{!674, !677}
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!739 = distinct !DICompileUnit(language: DW_LANG_C11, file: !740, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !686, splitDebugInlining: false, nameTableKind: None)
!740 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!741 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!742 = !{i32 7, !"Dwarf Version", i32 5}
!743 = !{i32 2, !"Debug Info Version", i32 3}
!744 = !{i32 1, !"wchar_size", i32 4}
!745 = !{i32 8, !"PIC Level", i32 2}
!746 = !{i32 7, !"PIE Level", i32 2}
!747 = !{i32 7, !"uwtable", i32 2}
!748 = !{i32 7, !"frame-pointer", i32 1}
!749 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 37, type: !750, scopeLine: 38, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !752)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !116}
!752 = !{!753}
!753 = !DILocalVariable(name: "status", arg: 1, scope: !749, file: !2, line: 37, type: !116)
!754 = !DILocation(line: 0, scope: !749)
!755 = !DILocation(line: 39, column: 14, scope: !756)
!756 = distinct !DILexicalBlock(scope: !749, file: !2, line: 39, column: 7)
!757 = !DILocation(line: 39, column: 7, scope: !749)
!758 = !DILocation(line: 40, column: 5, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !2, line: 40, column: 5)
!760 = !{!761, !761, i64 0}
!761 = !{!"any pointer", !762, i64 0}
!762 = !{!"omnipotent char", !763, i64 0}
!763 = !{!"Simple C/C++ TBAA"}
!764 = !DILocation(line: 43, column: 7, scope: !765)
!765 = distinct !DILexicalBlock(scope: !756, file: !2, line: 42, column: 5)
!766 = !DILocation(line: 46, column: 7, scope: !765)
!767 = !DILocation(line: 49, column: 7, scope: !765)
!768 = !DILocation(line: 50, column: 7, scope: !765)
!769 = !DILocalVariable(name: "program", arg: 1, scope: !770, file: !77, line: 836, type: !80)
!770 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !77, file: !77, line: 836, type: !771, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !773)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !80}
!773 = !{!769, !774, !781, !782, !784, !785}
!774 = !DILocalVariable(name: "infomap", scope: !770, file: !77, line: 838, type: !775)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 896, elements: !160)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !770, file: !77, line: 838, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !777, file: !77, line: 838, baseType: !80, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !777, file: !77, line: 838, baseType: !80, size: 64, offset: 64)
!781 = !DILocalVariable(name: "node", scope: !770, file: !77, line: 848, type: !80)
!782 = !DILocalVariable(name: "map_prog", scope: !770, file: !77, line: 849, type: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!784 = !DILocalVariable(name: "lc_messages", scope: !770, file: !77, line: 861, type: !80)
!785 = !DILocalVariable(name: "url_program", scope: !770, file: !77, line: 874, type: !80)
!786 = !DILocation(line: 0, scope: !770, inlinedAt: !787)
!787 = distinct !DILocation(line: 51, column: 7, scope: !765)
!788 = !DILocation(line: 857, column: 3, scope: !770, inlinedAt: !787)
!789 = !DILocation(line: 861, column: 29, scope: !770, inlinedAt: !787)
!790 = !DILocation(line: 862, column: 7, scope: !791, inlinedAt: !787)
!791 = distinct !DILexicalBlock(scope: !770, file: !77, line: 862, column: 7)
!792 = !DILocation(line: 862, column: 19, scope: !791, inlinedAt: !787)
!793 = !DILocation(line: 862, column: 22, scope: !791, inlinedAt: !787)
!794 = !DILocation(line: 862, column: 7, scope: !770, inlinedAt: !787)
!795 = !DILocation(line: 868, column: 7, scope: !796, inlinedAt: !787)
!796 = distinct !DILexicalBlock(scope: !791, file: !77, line: 863, column: 5)
!797 = !DILocation(line: 870, column: 5, scope: !796, inlinedAt: !787)
!798 = !DILocation(line: 875, column: 3, scope: !770, inlinedAt: !787)
!799 = !DILocation(line: 877, column: 3, scope: !770, inlinedAt: !787)
!800 = !DILocation(line: 53, column: 3, scope: !749)
!801 = !DISubprogram(name: "dcgettext", scope: !802, file: !802, line: 51, type: !803, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!802 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!803 = !DISubroutineType(types: !804)
!804 = !{!260, !80, !80, !116}
!805 = !{}
!806 = !DISubprogram(name: "__fprintf_chk", scope: !807, file: !807, line: 93, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!807 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!808 = !DISubroutineType(types: !809)
!809 = !{!116, !810, !116, !811, null}
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !252)
!811 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!812 = !DISubprogram(name: "__printf_chk", scope: !807, file: !807, line: 95, type: !813, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!813 = !DISubroutineType(types: !814)
!814 = !{!116, !116, !811, null}
!815 = !DISubprogram(name: "fputs_unlocked", scope: !347, file: !347, line: 691, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!816 = !DISubroutineType(types: !817)
!817 = !{!116, !811, !810}
!818 = !DILocation(line: 0, scope: !76)
!819 = !DILocation(line: 581, column: 7, scope: !237)
!820 = !{!821, !821, i64 0}
!821 = !{!"int", !762, i64 0}
!822 = !DILocation(line: 581, column: 19, scope: !237)
!823 = !DILocation(line: 581, column: 7, scope: !76)
!824 = !DILocation(line: 585, column: 26, scope: !236)
!825 = !DILocation(line: 0, scope: !236)
!826 = !DILocation(line: 586, column: 23, scope: !236)
!827 = !DILocation(line: 586, column: 28, scope: !236)
!828 = !DILocation(line: 586, column: 32, scope: !236)
!829 = !{!762, !762, i64 0}
!830 = !DILocation(line: 586, column: 38, scope: !236)
!831 = !DILocalVariable(name: "__s1", arg: 1, scope: !832, file: !833, line: 1359, type: !80)
!832 = distinct !DISubprogram(name: "streq", scope: !833, file: !833, line: 1359, type: !834, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !836)
!833 = !DIFile(filename: "./lib/string.h", directory: "/src")
!834 = !DISubroutineType(types: !835)
!835 = !{!239, !80, !80}
!836 = !{!831, !837}
!837 = !DILocalVariable(name: "__s2", arg: 2, scope: !832, file: !833, line: 1359, type: !80)
!838 = !DILocation(line: 0, scope: !832, inlinedAt: !839)
!839 = distinct !DILocation(line: 586, column: 41, scope: !236)
!840 = !DILocation(line: 1361, column: 11, scope: !832, inlinedAt: !839)
!841 = !DILocation(line: 1361, column: 10, scope: !832, inlinedAt: !839)
!842 = !DILocation(line: 586, column: 19, scope: !236)
!843 = !DILocation(line: 587, column: 5, scope: !236)
!844 = !DILocation(line: 588, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !76, file: !77, line: 588, column: 7)
!846 = !DILocation(line: 588, column: 7, scope: !76)
!847 = !DILocation(line: 590, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !77, line: 589, column: 5)
!849 = !DILocation(line: 591, column: 7, scope: !848)
!850 = !DILocation(line: 595, column: 37, scope: !76)
!851 = !DILocation(line: 595, column: 35, scope: !76)
!852 = !DILocation(line: 596, column: 29, scope: !76)
!853 = !DILocation(line: 597, column: 8, scope: !245)
!854 = !DILocation(line: 597, column: 7, scope: !76)
!855 = !DILocation(line: 604, column: 24, scope: !244)
!856 = !DILocation(line: 604, column: 12, scope: !245)
!857 = !DILocation(line: 0, scope: !243)
!858 = !DILocation(line: 610, column: 16, scope: !243)
!859 = !DILocation(line: 610, column: 7, scope: !243)
!860 = !DILocation(line: 611, column: 21, scope: !243)
!861 = !{!862, !862, i64 0}
!862 = !{!"short", !762, i64 0}
!863 = !DILocation(line: 611, column: 19, scope: !243)
!864 = !DILocation(line: 611, column: 16, scope: !243)
!865 = !DILocation(line: 610, column: 30, scope: !243)
!866 = distinct !{!866, !859, !860, !867}
!867 = !{!"llvm.loop.mustprogress"}
!868 = !DILocation(line: 612, column: 18, scope: !869)
!869 = distinct !DILexicalBlock(scope: !243, file: !77, line: 612, column: 11)
!870 = !DILocation(line: 612, column: 11, scope: !243)
!871 = !DILocation(line: 620, column: 23, scope: !76)
!872 = !DILocation(line: 625, column: 39, scope: !76)
!873 = !DILocation(line: 626, column: 3, scope: !76)
!874 = !DILocation(line: 626, column: 10, scope: !76)
!875 = !DILocation(line: 626, column: 21, scope: !76)
!876 = !DILocation(line: 628, column: 44, scope: !877)
!877 = distinct !DILexicalBlock(scope: !878, file: !77, line: 628, column: 11)
!878 = distinct !DILexicalBlock(scope: !76, file: !77, line: 627, column: 5)
!879 = !DILocation(line: 628, column: 32, scope: !877)
!880 = !DILocation(line: 628, column: 49, scope: !877)
!881 = !DILocation(line: 628, column: 11, scope: !878)
!882 = !DILocation(line: 630, column: 11, scope: !883)
!883 = distinct !DILexicalBlock(scope: !878, file: !77, line: 630, column: 11)
!884 = !DILocation(line: 630, column: 11, scope: !878)
!885 = !DILocation(line: 632, column: 26, scope: !886)
!886 = distinct !DILexicalBlock(scope: !887, file: !77, line: 632, column: 15)
!887 = distinct !DILexicalBlock(scope: !883, file: !77, line: 631, column: 9)
!888 = !DILocation(line: 632, column: 34, scope: !886)
!889 = !DILocation(line: 632, column: 37, scope: !886)
!890 = !DILocation(line: 632, column: 15, scope: !887)
!891 = !DILocation(line: 640, column: 16, scope: !878)
!892 = distinct !{!892, !873, !893, !867}
!893 = !DILocation(line: 641, column: 5, scope: !76)
!894 = !DILocation(line: 644, column: 3, scope: !76)
!895 = !DILocation(line: 0, scope: !832, inlinedAt: !896)
!896 = distinct !DILocation(line: 648, column: 31, scope: !76)
!897 = !DILocation(line: 0, scope: !832, inlinedAt: !898)
!898 = distinct !DILocation(line: 649, column: 31, scope: !76)
!899 = !DILocation(line: 0, scope: !832, inlinedAt: !900)
!900 = distinct !DILocation(line: 650, column: 31, scope: !76)
!901 = !DILocation(line: 0, scope: !832, inlinedAt: !902)
!902 = distinct !DILocation(line: 651, column: 31, scope: !76)
!903 = !DILocation(line: 0, scope: !832, inlinedAt: !904)
!904 = distinct !DILocation(line: 652, column: 31, scope: !76)
!905 = !DILocation(line: 0, scope: !832, inlinedAt: !906)
!906 = distinct !DILocation(line: 653, column: 31, scope: !76)
!907 = !DILocation(line: 0, scope: !832, inlinedAt: !908)
!908 = distinct !DILocation(line: 654, column: 31, scope: !76)
!909 = !DILocation(line: 0, scope: !832, inlinedAt: !910)
!910 = distinct !DILocation(line: 655, column: 31, scope: !76)
!911 = !DILocation(line: 0, scope: !832, inlinedAt: !912)
!912 = distinct !DILocation(line: 656, column: 31, scope: !76)
!913 = !DILocation(line: 0, scope: !832, inlinedAt: !914)
!914 = distinct !DILocation(line: 657, column: 31, scope: !76)
!915 = !DILocation(line: 663, column: 7, scope: !916)
!916 = distinct !DILexicalBlock(scope: !76, file: !77, line: 663, column: 7)
!917 = !DILocation(line: 664, column: 7, scope: !916)
!918 = !DILocation(line: 664, column: 10, scope: !916)
!919 = !DILocation(line: 663, column: 7, scope: !76)
!920 = !DILocation(line: 669, column: 7, scope: !921)
!921 = distinct !DILexicalBlock(scope: !916, file: !77, line: 665, column: 5)
!922 = !DILocation(line: 671, column: 5, scope: !921)
!923 = !DILocation(line: 676, column: 7, scope: !924)
!924 = distinct !DILexicalBlock(scope: !916, file: !77, line: 673, column: 5)
!925 = !DILocation(line: 679, column: 3, scope: !76)
!926 = !DILocation(line: 683, column: 3, scope: !76)
!927 = !DILocation(line: 686, column: 3, scope: !76)
!928 = !DILocation(line: 688, column: 3, scope: !76)
!929 = !DILocation(line: 691, column: 3, scope: !76)
!930 = !DILocation(line: 695, column: 3, scope: !76)
!931 = !DILocation(line: 696, column: 1, scope: !76)
!932 = !DISubprogram(name: "setlocale", scope: !933, file: !933, line: 122, type: !934, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!933 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!934 = !DISubroutineType(types: !935)
!935 = !{!260, !116, !80}
!936 = !DISubprogram(name: "strncmp", scope: !937, file: !937, line: 159, type: !938, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!937 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!938 = !DISubroutineType(types: !939)
!939 = !{!116, !80, !80, !118}
!940 = !DISubprogram(name: "exit", scope: !941, file: !941, line: 624, type: !750, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !805)
!941 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!942 = !DISubprogram(name: "getenv", scope: !941, file: !941, line: 641, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!943 = !DISubroutineType(types: !944)
!944 = !{!260, !80}
!945 = !DISubprogram(name: "strcmp", scope: !937, file: !937, line: 156, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!946 = !DISubroutineType(types: !947)
!947 = !{!116, !80, !80}
!948 = !DISubprogram(name: "strspn", scope: !937, file: !937, line: 297, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!949 = !DISubroutineType(types: !950)
!950 = !{!120, !80, !80}
!951 = !DISubprogram(name: "strchr", scope: !937, file: !937, line: 246, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!952 = !DISubroutineType(types: !953)
!953 = !{!260, !80, !116}
!954 = !DISubprogram(name: "__ctype_b_loc", scope: !100, file: !100, line: 79, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!955 = !DISubroutineType(types: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!960 = !DISubprogram(name: "strcspn", scope: !937, file: !937, line: 293, type: !949, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!961 = !DISubprogram(name: "fwrite_unlocked", scope: !347, file: !347, line: 704, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!962 = !DISubroutineType(types: !963)
!963 = !{!118, !964, !118, !118, !810}
!964 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!967 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 57, type: !968, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !971)
!968 = !DISubroutineType(types: !969)
!969 = !{!116, !116, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!971 = !{!972, !973}
!972 = !DILocalVariable(name: "argc", arg: 1, scope: !967, file: !2, line: 57, type: !116)
!973 = !DILocalVariable(name: "argv", arg: 2, scope: !967, file: !2, line: 57, type: !970)
!974 = !DILocation(line: 0, scope: !967)
!975 = !DILocation(line: 60, column: 21, scope: !967)
!976 = !DILocation(line: 60, column: 3, scope: !967)
!977 = !DILocation(line: 61, column: 3, scope: !967)
!978 = !DILocation(line: 62, column: 3, scope: !967)
!979 = !DILocation(line: 63, column: 3, scope: !967)
!980 = !DILocation(line: 65, column: 3, scope: !967)
!981 = !DILocation(line: 68, column: 36, scope: !967)
!982 = !DILocation(line: 68, column: 58, scope: !967)
!983 = !DILocation(line: 67, column: 3, scope: !967)
!984 = !DILocation(line: 71, column: 14, scope: !985)
!985 = distinct !DILexicalBlock(scope: !967, file: !2, line: 71, column: 7)
!986 = !DILocation(line: 71, column: 21, scope: !985)
!987 = !DILocation(line: 71, column: 12, scope: !985)
!988 = !DILocation(line: 71, column: 7, scope: !967)
!989 = !DILocation(line: 73, column: 16, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !2, line: 73, column: 11)
!991 = distinct !DILexicalBlock(scope: !985, file: !2, line: 72, column: 5)
!992 = !DILocation(line: 73, column: 11, scope: !991)
!993 = !DILocation(line: 74, column: 9, scope: !990)
!994 = !DILocation(line: 76, column: 9, scope: !990)
!995 = !DILocation(line: 77, column: 7, scope: !991)
!996 = !DILocation(line: 80, column: 18, scope: !997)
!997 = distinct !DILexicalBlock(scope: !967, file: !2, line: 80, column: 7)
!998 = !DILocation(line: 80, column: 7, scope: !967)
!999 = !DILocation(line: 82, column: 7, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !997, file: !2, line: 81, column: 5)
!1001 = !DILocation(line: 83, column: 7, scope: !1000)
!1002 = !DILocation(line: 86, column: 13, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !967, file: !2, line: 86, column: 7)
!1004 = !DILocation(line: 86, column: 39, scope: !1003)
!1005 = !DILocation(line: 86, column: 27, scope: !1003)
!1006 = !DILocation(line: 86, column: 7, scope: !1003)
!1007 = !DILocation(line: 86, column: 45, scope: !1003)
!1008 = !DILocation(line: 86, column: 7, scope: !967)
!1009 = !DILocation(line: 87, column: 5, scope: !1003)
!1010 = !DILocation(line: 90, column: 3, scope: !967)
!1011 = !DISubprogram(name: "bindtextdomain", scope: !802, file: !802, line: 86, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!260, !80, !80}
!1014 = !DISubprogram(name: "textdomain", scope: !802, file: !802, line: 82, type: !943, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1015 = !DISubprogram(name: "atexit", scope: !941, file: !941, line: 602, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!116, !387}
!1018 = !DISubprogram(name: "link", scope: !1019, file: !1019, line: 819, type: !946, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1019 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1020 = !DISubprogram(name: "__errno_location", scope: !1021, file: !1021, line: 37, type: !1022, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1021 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!411}
!1024 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !321, file: !321, line: 50, type: !771, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1025)
!1025 = !{!1026}
!1026 = !DILocalVariable(name: "file", arg: 1, scope: !1024, file: !321, line: 50, type: !80)
!1027 = !DILocation(line: 0, scope: !1024)
!1028 = !DILocation(line: 52, column: 13, scope: !1024)
!1029 = !DILocation(line: 53, column: 1, scope: !1024)
!1030 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !321, file: !321, line: 87, type: !1031, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1033)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !239}
!1033 = !{!1034}
!1034 = !DILocalVariable(name: "ignore", arg: 1, scope: !1030, file: !321, line: 87, type: !239)
!1035 = !DILocation(line: 0, scope: !1030)
!1036 = !DILocation(line: 89, column: 16, scope: !1030)
!1037 = !{!1038, !1038, i64 0}
!1038 = !{!"_Bool", !762, i64 0}
!1039 = !DILocation(line: 90, column: 1, scope: !1030)
!1040 = distinct !DISubprogram(name: "close_stdout", scope: !321, file: !321, line: 116, type: !388, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !320, retainedNodes: !1041)
!1041 = !{!1042}
!1042 = !DILocalVariable(name: "write_error", scope: !1043, file: !321, line: 121, type: !80)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !321, line: 120, column: 5)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !321, line: 118, column: 7)
!1045 = !DILocation(line: 118, column: 21, scope: !1044)
!1046 = !DILocation(line: 118, column: 7, scope: !1044)
!1047 = !DILocation(line: 118, column: 29, scope: !1044)
!1048 = !DILocation(line: 119, column: 7, scope: !1044)
!1049 = !DILocation(line: 119, column: 12, scope: !1044)
!1050 = !{i8 0, i8 2}
!1051 = !DILocation(line: 119, column: 25, scope: !1044)
!1052 = !DILocation(line: 119, column: 28, scope: !1044)
!1053 = !DILocation(line: 119, column: 34, scope: !1044)
!1054 = !DILocation(line: 118, column: 7, scope: !1040)
!1055 = !DILocation(line: 121, column: 33, scope: !1043)
!1056 = !DILocation(line: 0, scope: !1043)
!1057 = !DILocation(line: 122, column: 11, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1043, file: !321, line: 122, column: 11)
!1059 = !DILocation(line: 0, scope: !1058)
!1060 = !DILocation(line: 122, column: 11, scope: !1043)
!1061 = !DILocation(line: 123, column: 9, scope: !1058)
!1062 = !DILocation(line: 126, column: 9, scope: !1058)
!1063 = !DILocation(line: 128, column: 14, scope: !1043)
!1064 = !DILocation(line: 128, column: 7, scope: !1043)
!1065 = !DILocation(line: 133, column: 42, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1040, file: !321, line: 133, column: 7)
!1067 = !DILocation(line: 133, column: 28, scope: !1066)
!1068 = !DILocation(line: 133, column: 50, scope: !1066)
!1069 = !DILocation(line: 133, column: 7, scope: !1040)
!1070 = !DILocation(line: 134, column: 12, scope: !1066)
!1071 = !DILocation(line: 134, column: 5, scope: !1066)
!1072 = !DILocation(line: 135, column: 1, scope: !1040)
!1073 = !DISubprogram(name: "_exit", scope: !1019, file: !1019, line: 624, type: !750, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1074 = distinct !DISubprogram(name: "verror", scope: !336, file: !336, line: 251, type: !1075, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1077)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !116, !116, !80, !346}
!1077 = !{!1078, !1079, !1080, !1081}
!1078 = !DILocalVariable(name: "status", arg: 1, scope: !1074, file: !336, line: 251, type: !116)
!1079 = !DILocalVariable(name: "errnum", arg: 2, scope: !1074, file: !336, line: 251, type: !116)
!1080 = !DILocalVariable(name: "message", arg: 3, scope: !1074, file: !336, line: 251, type: !80)
!1081 = !DILocalVariable(name: "args", arg: 4, scope: !1074, file: !336, line: 251, type: !346)
!1082 = !DILocation(line: 0, scope: !1074)
!1083 = !DILocation(line: 251, column: 1, scope: !1074)
!1084 = !DILocation(line: 261, column: 3, scope: !1074)
!1085 = !DILocation(line: 265, column: 7, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1074, file: !336, line: 265, column: 7)
!1087 = !DILocation(line: 265, column: 7, scope: !1074)
!1088 = !DILocation(line: 266, column: 5, scope: !1086)
!1089 = !DILocation(line: 272, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1086, file: !336, line: 268, column: 5)
!1091 = !DILocation(line: 276, column: 3, scope: !1074)
!1092 = !{i64 0, i64 8, !760, i64 8, i64 8, !760, i64 16, i64 8, !760, i64 24, i64 4, !820, i64 28, i64 4, !820}
!1093 = !DILocation(line: 282, column: 1, scope: !1074)
!1094 = distinct !DISubprogram(name: "flush_stdout", scope: !336, file: !336, line: 163, type: !388, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1095)
!1095 = !{!1096}
!1096 = !DILocalVariable(name: "stdout_fd", scope: !1094, file: !336, line: 166, type: !116)
!1097 = !DILocation(line: 0, scope: !1094)
!1098 = !DILocalVariable(name: "fd", arg: 1, scope: !1099, file: !336, line: 145, type: !116)
!1099 = distinct !DISubprogram(name: "is_open", scope: !336, file: !336, line: 145, type: !1100, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1102)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!116, !116}
!1102 = !{!1098}
!1103 = !DILocation(line: 0, scope: !1099, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 182, column: 25, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1094, file: !336, line: 182, column: 7)
!1106 = !DILocation(line: 157, column: 15, scope: !1099, inlinedAt: !1104)
!1107 = !DILocation(line: 157, column: 12, scope: !1099, inlinedAt: !1104)
!1108 = !DILocation(line: 182, column: 7, scope: !1094)
!1109 = !DILocation(line: 184, column: 5, scope: !1105)
!1110 = !DILocation(line: 185, column: 1, scope: !1094)
!1111 = distinct !DISubprogram(name: "error_tail", scope: !336, file: !336, line: 219, type: !1075, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1112)
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DILocalVariable(name: "status", arg: 1, scope: !1111, file: !336, line: 219, type: !116)
!1114 = !DILocalVariable(name: "errnum", arg: 2, scope: !1111, file: !336, line: 219, type: !116)
!1115 = !DILocalVariable(name: "message", arg: 3, scope: !1111, file: !336, line: 219, type: !80)
!1116 = !DILocalVariable(name: "args", arg: 4, scope: !1111, file: !336, line: 219, type: !346)
!1117 = !DILocation(line: 0, scope: !1111)
!1118 = !DILocation(line: 219, column: 1, scope: !1111)
!1119 = !DILocation(line: 229, column: 13, scope: !1111)
!1120 = !DILocation(line: 135, column: 10, scope: !1121, inlinedAt: !1163)
!1121 = distinct !DISubprogram(name: "vfprintf", scope: !807, file: !807, line: 132, type: !1122, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1159)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!116, !1124, !811, !348}
!1124 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !254, line: 7, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !256, line: 49, size: 1728, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1127, file: !256, line: 51, baseType: !116, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1127, file: !256, line: 54, baseType: !260, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1127, file: !256, line: 55, baseType: !260, size: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1127, file: !256, line: 56, baseType: !260, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1127, file: !256, line: 57, baseType: !260, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1127, file: !256, line: 58, baseType: !260, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1127, file: !256, line: 59, baseType: !260, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1127, file: !256, line: 60, baseType: !260, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1127, file: !256, line: 61, baseType: !260, size: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1127, file: !256, line: 64, baseType: !260, size: 64, offset: 576)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1127, file: !256, line: 65, baseType: !260, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1127, file: !256, line: 66, baseType: !260, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1127, file: !256, line: 68, baseType: !272, size: 64, offset: 768)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1127, file: !256, line: 70, baseType: !1143, size: 64, offset: 832)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1127, file: !256, line: 72, baseType: !116, size: 32, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1127, file: !256, line: 73, baseType: !116, size: 32, offset: 928)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1127, file: !256, line: 74, baseType: !279, size: 64, offset: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1127, file: !256, line: 77, baseType: !117, size: 16, offset: 1024)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1127, file: !256, line: 78, baseType: !284, size: 8, offset: 1040)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1127, file: !256, line: 79, baseType: !34, size: 8, offset: 1048)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1127, file: !256, line: 81, baseType: !287, size: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1127, file: !256, line: 89, baseType: !290, size: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1127, file: !256, line: 91, baseType: !292, size: 64, offset: 1216)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1127, file: !256, line: 92, baseType: !295, size: 64, offset: 1280)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1127, file: !256, line: 93, baseType: !1143, size: 64, offset: 1344)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1127, file: !256, line: 94, baseType: !115, size: 64, offset: 1408)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1127, file: !256, line: 95, baseType: !118, size: 64, offset: 1472)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1127, file: !256, line: 96, baseType: !116, size: 32, offset: 1536)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1127, file: !256, line: 98, baseType: !302, size: 160, offset: 1568)
!1159 = !{!1160, !1161, !1162}
!1160 = !DILocalVariable(name: "__stream", arg: 1, scope: !1121, file: !807, line: 132, type: !1124)
!1161 = !DILocalVariable(name: "__fmt", arg: 2, scope: !1121, file: !807, line: 133, type: !811)
!1162 = !DILocalVariable(name: "__ap", arg: 3, scope: !1121, file: !807, line: 133, type: !348)
!1163 = distinct !DILocation(line: 229, column: 3, scope: !1111)
!1164 = !{!1165, !1167}
!1165 = distinct !{!1165, !1166, !"vfprintf.inline: argument 0"}
!1166 = distinct !{!1166, !"vfprintf.inline"}
!1167 = distinct !{!1167, !1166, !"vfprintf.inline: argument 1"}
!1168 = !DILocation(line: 229, column: 3, scope: !1111)
!1169 = !DILocation(line: 0, scope: !1121, inlinedAt: !1163)
!1170 = !DILocation(line: 133, column: 49, scope: !1121, inlinedAt: !1163)
!1171 = !DILocation(line: 232, column: 3, scope: !1111)
!1172 = !DILocation(line: 233, column: 7, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1111, file: !336, line: 233, column: 7)
!1174 = !DILocation(line: 233, column: 7, scope: !1111)
!1175 = !DILocalVariable(name: "errnum", arg: 1, scope: !1176, file: !336, line: 188, type: !116)
!1176 = distinct !DISubprogram(name: "print_errno_message", scope: !336, file: !336, line: 188, type: !750, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1177)
!1177 = !{!1175, !1178, !1179}
!1178 = !DILocalVariable(name: "s", scope: !1176, file: !336, line: 190, type: !80)
!1179 = !DILocalVariable(name: "errbuf", scope: !1176, file: !336, line: 193, type: !1180)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 1024)
!1183 = !DILocation(line: 0, scope: !1176, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 234, column: 5, scope: !1173)
!1185 = !DILocation(line: 193, column: 3, scope: !1176, inlinedAt: !1184)
!1186 = !DILocation(line: 193, column: 8, scope: !1176, inlinedAt: !1184)
!1187 = !DILocation(line: 195, column: 7, scope: !1176, inlinedAt: !1184)
!1188 = !DILocation(line: 207, column: 9, scope: !1189, inlinedAt: !1184)
!1189 = distinct !DILexicalBlock(scope: !1176, file: !336, line: 207, column: 7)
!1190 = !DILocation(line: 207, column: 7, scope: !1176, inlinedAt: !1184)
!1191 = !DILocation(line: 208, column: 9, scope: !1189, inlinedAt: !1184)
!1192 = !DILocation(line: 208, column: 5, scope: !1189, inlinedAt: !1184)
!1193 = !DILocation(line: 214, column: 3, scope: !1176, inlinedAt: !1184)
!1194 = !DILocation(line: 216, column: 1, scope: !1176, inlinedAt: !1184)
!1195 = !DILocation(line: 234, column: 5, scope: !1173)
!1196 = !DILocation(line: 238, column: 3, scope: !1111)
!1197 = !DILocalVariable(name: "__c", arg: 1, scope: !1198, file: !1199, line: 101, type: !116)
!1198 = distinct !DISubprogram(name: "putc_unlocked", scope: !1199, file: !1199, line: 101, type: !1200, scopeLine: 102, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1202)
!1199 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!116, !116, !1125}
!1202 = !{!1197, !1203}
!1203 = !DILocalVariable(name: "__stream", arg: 2, scope: !1198, file: !1199, line: 101, type: !1125)
!1204 = !DILocation(line: 0, scope: !1198, inlinedAt: !1205)
!1205 = distinct !DILocation(line: 238, column: 3, scope: !1111)
!1206 = !DILocation(line: 103, column: 10, scope: !1198, inlinedAt: !1205)
!1207 = !{!1208, !761, i64 40}
!1208 = !{!"_IO_FILE", !821, i64 0, !761, i64 8, !761, i64 16, !761, i64 24, !761, i64 32, !761, i64 40, !761, i64 48, !761, i64 56, !761, i64 64, !761, i64 72, !761, i64 80, !761, i64 88, !761, i64 96, !761, i64 104, !821, i64 112, !821, i64 116, !1209, i64 120, !862, i64 128, !762, i64 130, !762, i64 131, !761, i64 136, !1209, i64 144, !761, i64 152, !761, i64 160, !761, i64 168, !761, i64 176, !1209, i64 184, !821, i64 192, !762, i64 196}
!1209 = !{!"long", !762, i64 0}
!1210 = !{!1208, !761, i64 48}
!1211 = !{!"branch_weights", i32 2000, i32 1}
!1212 = !DILocation(line: 240, column: 3, scope: !1111)
!1213 = !DILocation(line: 241, column: 7, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1111, file: !336, line: 241, column: 7)
!1215 = !DILocation(line: 241, column: 7, scope: !1111)
!1216 = !DILocation(line: 242, column: 5, scope: !1214)
!1217 = !DILocation(line: 243, column: 1, scope: !1111)
!1218 = !DISubprogram(name: "__vfprintf_chk", scope: !807, file: !807, line: 96, type: !1219, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!116, !1124, !116, !811, !348}
!1221 = !DISubprogram(name: "strerror_r", scope: !937, file: !937, line: 444, type: !1222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!260, !116, !260, !118}
!1224 = !DISubprogram(name: "__overflow", scope: !347, file: !347, line: 886, type: !1225, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!116, !1125, !116}
!1227 = !DISubprogram(name: "fflush_unlocked", scope: !347, file: !347, line: 239, type: !1228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!116, !1125}
!1230 = !DISubprogram(name: "fcntl", scope: !1231, file: !1231, line: 149, type: !1232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !805)
!1231 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!116, !116, !116, null}
!1234 = distinct !DISubprogram(name: "error", scope: !336, file: !336, line: 285, type: !1235, scopeLine: 286, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1237)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !116, !116, !80, null}
!1237 = !{!1238, !1239, !1240, !1241}
!1238 = !DILocalVariable(name: "status", arg: 1, scope: !1234, file: !336, line: 285, type: !116)
!1239 = !DILocalVariable(name: "errnum", arg: 2, scope: !1234, file: !336, line: 285, type: !116)
!1240 = !DILocalVariable(name: "message", arg: 3, scope: !1234, file: !336, line: 285, type: !80)
!1241 = !DILocalVariable(name: "ap", scope: !1234, file: !336, line: 287, type: !346)
!1242 = !DILocation(line: 0, scope: !1234)
!1243 = !DILocation(line: 287, column: 3, scope: !1234)
!1244 = !DILocation(line: 287, column: 11, scope: !1234)
!1245 = !DILocation(line: 288, column: 3, scope: !1234)
!1246 = !DILocation(line: 289, column: 3, scope: !1234)
!1247 = !DILocation(line: 290, column: 3, scope: !1234)
!1248 = !DILocation(line: 291, column: 1, scope: !1234)
!1249 = !DILocation(line: 0, scope: !343)
!1250 = !DILocation(line: 298, column: 1, scope: !343)
!1251 = !DILocation(line: 302, column: 7, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !343, file: !336, line: 302, column: 7)
!1253 = !DILocation(line: 302, column: 7, scope: !343)
!1254 = !DILocation(line: 307, column: 11, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !336, line: 307, column: 11)
!1256 = distinct !DILexicalBlock(scope: !1252, file: !336, line: 303, column: 5)
!1257 = !DILocation(line: 307, column: 27, scope: !1255)
!1258 = !DILocation(line: 308, column: 11, scope: !1255)
!1259 = !DILocation(line: 308, column: 28, scope: !1255)
!1260 = !DILocation(line: 308, column: 25, scope: !1255)
!1261 = !DILocation(line: 309, column: 15, scope: !1255)
!1262 = !DILocation(line: 309, column: 33, scope: !1255)
!1263 = !DILocation(line: 310, column: 19, scope: !1255)
!1264 = !DILocation(line: 311, column: 22, scope: !1255)
!1265 = !DILocation(line: 311, column: 56, scope: !1255)
!1266 = !DILocation(line: 307, column: 11, scope: !1256)
!1267 = !DILocation(line: 316, column: 21, scope: !1256)
!1268 = !DILocation(line: 317, column: 23, scope: !1256)
!1269 = !DILocation(line: 318, column: 5, scope: !1256)
!1270 = !DILocation(line: 327, column: 3, scope: !343)
!1271 = !DILocation(line: 331, column: 7, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !343, file: !336, line: 331, column: 7)
!1273 = !DILocation(line: 331, column: 7, scope: !343)
!1274 = !DILocation(line: 332, column: 5, scope: !1272)
!1275 = !DILocation(line: 338, column: 7, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1272, file: !336, line: 334, column: 5)
!1277 = !DILocation(line: 346, column: 3, scope: !343)
!1278 = !DILocation(line: 350, column: 3, scope: !343)
!1279 = !DILocation(line: 356, column: 1, scope: !343)
!1280 = distinct !DISubprogram(name: "error_at_line", scope: !336, file: !336, line: 359, type: !1281, scopeLine: 361, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !335, retainedNodes: !1283)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !116, !116, !80, !86, !80, null}
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289}
!1284 = !DILocalVariable(name: "status", arg: 1, scope: !1280, file: !336, line: 359, type: !116)
!1285 = !DILocalVariable(name: "errnum", arg: 2, scope: !1280, file: !336, line: 359, type: !116)
!1286 = !DILocalVariable(name: "file_name", arg: 3, scope: !1280, file: !336, line: 359, type: !80)
!1287 = !DILocalVariable(name: "line_number", arg: 4, scope: !1280, file: !336, line: 360, type: !86)
!1288 = !DILocalVariable(name: "message", arg: 5, scope: !1280, file: !336, line: 360, type: !80)
!1289 = !DILocalVariable(name: "ap", scope: !1280, file: !336, line: 362, type: !346)
!1290 = !DILocation(line: 0, scope: !1280)
!1291 = !DILocation(line: 362, column: 3, scope: !1280)
!1292 = !DILocation(line: 362, column: 11, scope: !1280)
!1293 = !DILocation(line: 363, column: 3, scope: !1280)
!1294 = !DILocation(line: 364, column: 3, scope: !1280)
!1295 = !DILocation(line: 366, column: 3, scope: !1280)
!1296 = !DILocation(line: 367, column: 1, scope: !1280)
!1297 = distinct !DISubprogram(name: "getprogname", scope: !680, file: !680, line: 54, type: !1298, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !679, retainedNodes: !805)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!80}
!1300 = !DILocation(line: 58, column: 10, scope: !1297)
!1301 = !DILocation(line: 58, column: 3, scope: !1297)
!1302 = distinct !DISubprogram(name: "parse_long_options", scope: !392, file: !392, line: 45, type: !1303, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !395, retainedNodes: !1306)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !116, !970, !80, !80, !80, !1305, null}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1317}
!1307 = !DILocalVariable(name: "argc", arg: 1, scope: !1302, file: !392, line: 45, type: !116)
!1308 = !DILocalVariable(name: "argv", arg: 2, scope: !1302, file: !392, line: 46, type: !970)
!1309 = !DILocalVariable(name: "command_name", arg: 3, scope: !1302, file: !392, line: 47, type: !80)
!1310 = !DILocalVariable(name: "package", arg: 4, scope: !1302, file: !392, line: 48, type: !80)
!1311 = !DILocalVariable(name: "version", arg: 5, scope: !1302, file: !392, line: 49, type: !80)
!1312 = !DILocalVariable(name: "usage_func", arg: 6, scope: !1302, file: !392, line: 50, type: !1305)
!1313 = !DILocalVariable(name: "saved_opterr", scope: !1302, file: !392, line: 53, type: !116)
!1314 = !DILocalVariable(name: "c", scope: !1315, file: !392, line: 60, type: !116)
!1315 = distinct !DILexicalBlock(scope: !1316, file: !392, line: 59, column: 5)
!1316 = distinct !DILexicalBlock(scope: !1302, file: !392, line: 58, column: 7)
!1317 = !DILocalVariable(name: "authors", scope: !1318, file: !392, line: 71, type: !1322)
!1318 = distinct !DILexicalBlock(scope: !1319, file: !392, line: 70, column: 15)
!1319 = distinct !DILexicalBlock(scope: !1320, file: !392, line: 64, column: 13)
!1320 = distinct !DILexicalBlock(scope: !1321, file: !392, line: 62, column: 9)
!1321 = distinct !DILexicalBlock(scope: !1315, file: !392, line: 61, column: 11)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !347, line: 52, baseType: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !349, line: 14, baseType: !1324)
