; ModuleID = 'src/mkfifo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.mode_change = type { i8, i8, i32, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [50 x i8] c"Create named pipes (FIFOs) with the given NAMEs.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"mkfifo\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [79 x i8] c"  -m, --mode=MODE\0A         set file permission bits to MODE, not a=rw - umask\0A\00", align 1, !dbg !22

!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 122, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 73)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 14)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 128, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 16)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(scope: null, file: !2, line: 136, type: !127, isLocal: true, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !2, line: 149, type: !14, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 13)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !141, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 44)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !146, isLocal: true, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 22)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !151, isLocal: true, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 29)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(scope: null, file: !69, line: 736, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 75)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !161, file: !69, line: 575, type: !70, isLocal: true, isDefinition: true)
!161 = distinct !DISubprogram(name: "oputs_", scope: !69, file: !69, line: 573, type: !162, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !164)
!162 = !DISubroutineType(cc: DW_CC_nocall, types: !163)
!163 = !{null, !111, !111}
!164 = !{!165, !166, !167, !170, !172, !173, !174, !178, !179, !180, !181, !183, !236, !237, !238, !240, !241}
!165 = !DILocalVariable(name: "program", arg: 1, scope: !161, file: !69, line: 573, type: !111)
!166 = !DILocalVariable(name: "option", arg: 2, scope: !161, file: !69, line: 573, type: !111)
!167 = !DILocalVariable(name: "term", scope: !168, file: !69, line: 585, type: !111)
!168 = distinct !DILexicalBlock(scope: !169, file: !69, line: 582, column: 5)
!169 = distinct !DILexicalBlock(scope: !161, file: !69, line: 581, column: 7)
!170 = !DILocalVariable(name: "double_space", scope: !161, file: !69, line: 594, type: !171)
!171 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!172 = !DILocalVariable(name: "first_word", scope: !161, file: !69, line: 595, type: !111)
!173 = !DILocalVariable(name: "option_text", scope: !161, file: !69, line: 596, type: !111)
!174 = !DILocalVariable(name: "s", scope: !175, file: !69, line: 608, type: !111)
!175 = distinct !DILexicalBlock(scope: !176, file: !69, line: 605, column: 5)
!176 = distinct !DILexicalBlock(scope: !177, file: !69, line: 604, column: 12)
!177 = distinct !DILexicalBlock(scope: !161, file: !69, line: 597, column: 7)
!178 = !DILocalVariable(name: "spaces", scope: !175, file: !69, line: 609, type: !108)
!179 = !DILocalVariable(name: "anchor_len", scope: !161, file: !69, line: 620, type: !108)
!180 = !DILocalVariable(name: "desc_text", scope: !161, file: !69, line: 625, type: !111)
!181 = !DILocalVariable(name: "__ptr", scope: !182, file: !69, line: 644, type: !111)
!182 = distinct !DILexicalBlock(scope: !161, file: !69, line: 644, column: 3)
!183 = !DILocalVariable(name: "__stream", scope: !182, file: !69, line: 644, type: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !186, line: 7, baseType: !187)
!186 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !188, line: 49, size: 1728, elements: !189)
!188 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !205, !207, !208, !209, !213, !214, !216, !217, !220, !222, !225, !228, !229, !230, !231, !232}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !187, file: !188, line: 51, baseType: !70, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !187, file: !188, line: 54, baseType: !105, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !187, file: !188, line: 55, baseType: !105, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !187, file: !188, line: 56, baseType: !105, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !187, file: !188, line: 57, baseType: !105, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !187, file: !188, line: 58, baseType: !105, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !187, file: !188, line: 59, baseType: !105, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !187, file: !188, line: 60, baseType: !105, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !187, file: !188, line: 61, baseType: !105, size: 64, offset: 512)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !187, file: !188, line: 64, baseType: !105, size: 64, offset: 576)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !187, file: !188, line: 65, baseType: !105, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !187, file: !188, line: 66, baseType: !105, size: 64, offset: 704)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !187, file: !188, line: 68, baseType: !203, size: 64, offset: 768)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !188, line: 36, flags: DIFlagFwdDecl)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !187, file: !188, line: 70, baseType: !206, size: 64, offset: 832)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !187, file: !188, line: 72, baseType: !70, size: 32, offset: 896)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !187, file: !188, line: 73, baseType: !70, size: 32, offset: 928)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !187, file: !188, line: 74, baseType: !210, size: 64, offset: 960)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !211, line: 152, baseType: !212)
!211 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!212 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !187, file: !188, line: 77, baseType: !107, size: 16, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !187, file: !188, line: 78, baseType: !215, size: 8, offset: 1040)
!215 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !187, file: !188, line: 79, baseType: !46, size: 8, offset: 1048)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !187, file: !188, line: 81, baseType: !218, size: 64, offset: 1088)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !188, line: 43, baseType: null)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !187, file: !188, line: 89, baseType: !221, size: 64, offset: 1152)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !211, line: 153, baseType: !212)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !187, file: !188, line: 91, baseType: !223, size: 64, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !188, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !187, file: !188, line: 92, baseType: !226, size: 64, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !188, line: 38, flags: DIFlagFwdDecl)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !187, file: !188, line: 93, baseType: !206, size: 64, offset: 1344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !187, file: !188, line: 94, baseType: !106, size: 64, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !187, file: !188, line: 95, baseType: !108, size: 64, offset: 1472)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !187, file: !188, line: 96, baseType: !70, size: 32, offset: 1536)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !187, file: !188, line: 98, baseType: !233, size: 160, offset: 1568)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 20)
!236 = !DILocalVariable(name: "__cnt", scope: !182, file: !69, line: 644, type: !108)
!237 = !DILocalVariable(name: "url_program", scope: !161, file: !69, line: 648, type: !111)
!238 = !DILocalVariable(name: "__ptr", scope: !239, file: !69, line: 686, type: !111)
!239 = distinct !DILexicalBlock(scope: !161, file: !69, line: 686, column: 3)
!240 = !DILocalVariable(name: "__stream", scope: !239, file: !69, line: 686, type: !184)
!241 = !DILocalVariable(name: "__cnt", scope: !239, file: !69, line: 686, type: !108)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !69, line: 585, type: !244, isLocal: true, isDefinition: true)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 5)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !69, line: 586, type: !244, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !69, line: 595, type: !61, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !69, line: 620, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 6)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 2)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !69, line: 648, type: !244, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !61, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !69, line: 649, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 3)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !69, line: 650, type: !244, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !253, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !69, line: 651, type: !253, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !69, line: 652, type: !19, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !69, line: 653, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !69, line: 654, type: !51, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !69, line: 655, type: !51, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !69, line: 656, type: !51, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !69, line: 657, type: !51, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !69, line: 663, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !69, line: 664, type: !51, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 17)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !69, line: 669, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 40)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 15)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !69, line: 676, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 61)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !69, line: 679, type: !267, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !69, line: 683, type: !244, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !69, line: 688, type: !244, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !69, line: 691, type: !280, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !69, line: 839, type: !127, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !69, line: 840, type: !146, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !69, line: 841, type: !307, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !69, line: 862, type: !61, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !69, line: 868, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 71)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !69, line: 875, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 27)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 51)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !69, line: 877, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 12)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 38, type: !280, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 39, type: !244, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 40, type: !244, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !280, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 1280, elements: !245)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !362, line: 50, size: 256, elements: !363)
!362 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!363 = !{!364, !365, !366, !368}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !362, line: 52, baseType: !111, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !361, file: !362, line: 55, baseType: !70, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !361, file: !362, line: 56, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !361, file: !362, line: 57, baseType: !70, size: 32, offset: 192)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !371, line: 3, type: !307, isLocal: true, isDefinition: true)
!371 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "Version", scope: !374, file: !371, line: 3, type: !111, isLocal: false, isDefinition: true)
!374 = distinct !DICompileUnit(language: DW_LANG_C11, file: !371, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !375, splitDebugInlining: false, nameTableKind: None)
!375 = !{!369, !372}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "file_name", scope: !378, file: !379, line: 45, type: !111, isLocal: true, isDefinition: true)
!378 = distinct !DICompileUnit(language: DW_LANG_C11, file: !379, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !380, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!380 = !{!381, !383, !385, !387, !376, !389}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !379, line: 121, type: !19, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !379, line: 121, type: !348, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !379, line: 123, type: !19, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !379, line: 126, type: !267, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !378, file: !379, line: 55, type: !171, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !393, file: !394, line: 66, type: !445, isLocal: false, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!395 = !{!106, !113}
!396 = !{!397, !399, !424, !426, !428, !430, !391, !432, !434, !436, !438, !443}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !394, line: 272, type: !244, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "old_file_name", scope: !401, file: !394, line: 304, type: !111, isLocal: true, isDefinition: true)
!401 = distinct !DISubprogram(name: "verror_at_line", scope: !394, file: !394, line: 298, type: !402, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !417)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !70, !70, !111, !76, !111, !404}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !405, line: 52, baseType: !406)
!405 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !407, line: 14, baseType: !408)
!407 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !409, baseType: !410)
!409 = !DIFile(filename: "lib/error.c", directory: "/src")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !411)
!411 = !{!412, !413, !414, !415, !416}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !410, file: !409, baseType: !106, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !410, file: !409, baseType: !106, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !410, file: !409, baseType: !106, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !410, file: !409, baseType: !70, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !410, file: !409, baseType: !70, size: 32, offset: 224)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DILocalVariable(name: "status", arg: 1, scope: !401, file: !394, line: 298, type: !70)
!419 = !DILocalVariable(name: "errnum", arg: 2, scope: !401, file: !394, line: 298, type: !70)
!420 = !DILocalVariable(name: "file_name", arg: 3, scope: !401, file: !394, line: 298, type: !111)
!421 = !DILocalVariable(name: "line_number", arg: 4, scope: !401, file: !394, line: 298, type: !76)
!422 = !DILocalVariable(name: "message", arg: 5, scope: !401, file: !394, line: 298, type: !111)
!423 = !DILocalVariable(name: "args", arg: 6, scope: !401, file: !394, line: 298, type: !404)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "old_line_number", scope: !401, file: !394, line: 305, type: !76, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !394, line: 338, type: !61, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !394, line: 346, type: !280, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !394, line: 346, type: !258, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "error_message_count", scope: !393, file: !394, line: 69, type: !76, isLocal: false, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !393, file: !394, line: 295, type: !70, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !394, line: 208, type: !19, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !394, line: 208, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 21)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !394, line: 214, type: !244, isLocal: true, isDefinition: true)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "program_name", scope: !450, file: !451, line: 31, type: !111, isLocal: false, isDefinition: true)
!450 = distinct !DICompileUnit(language: DW_LANG_C11, file: !451, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !452, globals: !453, splitDebugInlining: false, nameTableKind: None)
!451 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!452 = !{!105}
!453 = !{!448, !454, !456}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !451, line: 46, type: !280, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !451, line: 49, type: !61, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "utf07FF", scope: !460, file: !461, line: 46, type: !488, isLocal: true, isDefinition: true)
!460 = distinct !DISubprogram(name: "proper_name_lite", scope: !461, file: !461, line: 38, type: !462, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !464, retainedNodes: !466)
!461 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!462 = !DISubroutineType(types: !463)
!463 = !{!111, !111, !111}
!464 = distinct !DICompileUnit(language: DW_LANG_C11, file: !461, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !465, splitDebugInlining: false, nameTableKind: None)
!465 = !{!458}
!466 = !{!467, !468, !469, !470, !475}
!467 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !460, file: !461, line: 38, type: !111)
!468 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !460, file: !461, line: 38, type: !111)
!469 = !DILocalVariable(name: "translation", scope: !460, file: !461, line: 40, type: !111)
!470 = !DILocalVariable(name: "w", scope: !460, file: !461, line: 47, type: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !472, line: 37, baseType: !473)
!472 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !211, line: 57, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !211, line: 42, baseType: !76)
!475 = !DILocalVariable(name: "mbs", scope: !460, file: !461, line: 48, type: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !477, line: 6, baseType: !478)
!477 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !479, line: 21, baseType: !480)
!479 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 13, size: 64, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !480, file: !479, line: 15, baseType: !70, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !480, file: !479, line: 20, baseType: !484, size: 32, offset: 32)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !479, line: 16, size: 32, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !484, file: !479, line: 18, baseType: !76, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !484, file: !479, line: 19, baseType: !61, size: 32)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 16, elements: !259)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !491, line: 78, type: !280, isLocal: true, isDefinition: true)
!491 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !491, line: 79, type: !253, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !491, line: 80, type: !136, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !491, line: 81, type: !136, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !491, line: 82, type: !233, isLocal: true, isDefinition: true)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !491, line: 83, type: !258, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(scope: null, file: !491, line: 84, type: !280, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !491, line: 85, type: !19, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !491, line: 86, type: !19, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !491, line: 87, type: !280, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !512, file: !491, line: 76, type: !584, isLocal: false, isDefinition: true)
!512 = distinct !DICompileUnit(language: DW_LANG_C11, file: !491, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !513, retainedTypes: !519, globals: !520, splitDebugInlining: false, nameTableKind: None)
!513 = !{!74, !514, !89}
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !75, line: 254, baseType: !76, size: 32, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!517 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!518 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!519 = !{!70, !107, !108}
!520 = !{!489, !492, !494, !496, !498, !500, !502, !504, !506, !508, !510, !521, !525, !535, !537, !542, !544, !546, !548, !550, !573, !580, !582}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !512, file: !491, line: 92, type: !523, isLocal: false, isDefinition: true)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 320, elements: !52)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !512, file: !491, line: 1040, type: !527, isLocal: false, isDefinition: true)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !491, line: 56, size: 448, elements: !528)
!528 = !{!529, !530, !531, !533, !534}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !527, file: !491, line: 59, baseType: !74, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !527, file: !491, line: 62, baseType: !70, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !527, file: !491, line: 66, baseType: !532, size: 256, offset: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 256, elements: !281)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !527, file: !491, line: 69, baseType: !111, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !527, file: !491, line: 72, baseType: !111, size: 64, offset: 384)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !512, file: !491, line: 107, type: !527, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "slot0", scope: !512, file: !491, line: 831, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 256)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !491, line: 321, type: !258, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !491, line: 357, type: !258, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !491, line: 358, type: !258, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !491, line: 199, type: !19, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "quote", scope: !552, file: !491, line: 228, type: !571, isLocal: true, isDefinition: true)
!552 = distinct !DISubprogram(name: "gettext_quote", scope: !491, file: !491, line: 197, type: !553, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !512, retainedNodes: !555)
!553 = !DISubroutineType(types: !554)
!554 = !{!111, !111, !74}
!555 = !{!556, !557, !558, !559, !560}
!556 = !DILocalVariable(name: "msgid", arg: 1, scope: !552, file: !491, line: 197, type: !111)
!557 = !DILocalVariable(name: "s", arg: 2, scope: !552, file: !491, line: 197, type: !74)
!558 = !DILocalVariable(name: "translation", scope: !552, file: !491, line: 199, type: !111)
!559 = !DILocalVariable(name: "w", scope: !552, file: !491, line: 229, type: !471)
!560 = !DILocalVariable(name: "mbs", scope: !552, file: !491, line: 230, type: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !477, line: 6, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !479, line: 21, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 13, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !563, file: !479, line: 15, baseType: !70, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !563, file: !479, line: 20, baseType: !567, size: 32, offset: 32)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !479, line: 16, size: 32, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !567, file: !479, line: 18, baseType: !76, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !567, file: !479, line: 19, baseType: !61, size: 32)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 64, elements: !572)
!572 = !{!260, !63}
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "slotvec", scope: !512, file: !491, line: 834, type: !575, isLocal: true, isDefinition: true)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !491, line: 823, size: 128, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !576, file: !491, line: 825, baseType: !108, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !576, file: !491, line: 826, baseType: !105, size: 64, offset: 64)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "nslots", scope: !512, file: !491, line: 832, type: !70, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "slotvec0", scope: !512, file: !491, line: 833, type: !576, isLocal: true, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 704, elements: !586)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!586 = !{!587}
!587 = !DISubrange(count: 11)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !590, line: 67, type: !348, isLocal: true, isDefinition: true)
!590 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !590, line: 69, type: !19, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !590, line: 83, type: !19, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !590, line: 83, type: !61, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !590, line: 85, type: !258, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !590, line: 88, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 171)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !590, line: 88, type: !606, isLocal: true, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 34)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !590, line: 105, type: !127, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !590, line: 109, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 23)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !590, line: 113, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 28)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !590, line: 120, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 32)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !590, line: 127, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 36)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !590, line: 134, type: !302, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(scope: null, file: !590, line: 142, type: !141, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !590, line: 150, type: !637, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !638)
!638 = !{!639}
!639 = !DISubrange(count: 48)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !590, line: 159, type: !642, isLocal: true, isDefinition: true)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 52)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !590, line: 170, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 60)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !590, line: 248, type: !233, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !590, line: 248, type: !146, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !233, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !122, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !590, line: 254, type: !302, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !590, line: 259, type: !3, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !590, line: 259, type: !151, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !666, file: !667, line: 26, type: !669, isLocal: false, isDefinition: true)
!666 = distinct !DICompileUnit(language: DW_LANG_C11, file: !667, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !668, splitDebugInlining: false, nameTableKind: None)
!667 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!668 = !{!664}
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 376, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 47)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "exit_failure", scope: !674, file: !675, line: 24, type: !677, isLocal: false, isDefinition: true)
!674 = distinct !DICompileUnit(language: DW_LANG_C11, file: !675, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !676, splitDebugInlining: false, nameTableKind: None)
!675 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!676 = !{!672}
!677 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !680, line: 34, type: !267, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !680, line: 34, type: !19, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !680, line: 34, type: !297, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !687, line: 108, type: !46, isLocal: true, isDefinition: true)
!687 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "internal_state", scope: !690, file: !687, line: 97, type: !693, isLocal: true, isDefinition: true)
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !687, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !691, globals: !692, splitDebugInlining: false, nameTableKind: None)
!691 = !{!106, !108, !113}
!692 = !{!685, !688}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !477, line: 6, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !479, line: 21, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 13, size: 64, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !695, file: !479, line: 15, baseType: !70, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !695, file: !479, line: 20, baseType: !699, size: 32, offset: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !479, line: 16, size: 32, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !699, file: !479, line: 18, baseType: !76, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !699, file: !479, line: 19, baseType: !61, size: 32)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !705, line: 35, type: !258, isLocal: true, isDefinition: true)
!705 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !705, line: 35, type: !253, isLocal: true, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "src/selinux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f2fe0a2ae80ab081d56e5c6fc8b81c38")
!710 = distinct !DICompileUnit(language: DW_LANG_C11, file: !711, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!711 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!712 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !714, splitDebugInlining: false, nameTableKind: None)
!713 = !DIFile(filename: "lib/modechange.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d9d9323c1a974dc920f948d08984b73e")
!714 = !{!715}
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !713, line: 78, baseType: !76, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIEnumerator(name: "MODE_DONE", value: 0)
!718 = !DIEnumerator(name: "MODE_ORDINARY_CHANGE", value: 1)
!719 = !DIEnumerator(name: "MODE_X_IF_ANY_X", value: 2)
!720 = !DIEnumerator(name: "MODE_COPY_EXISTING", value: 3)
!721 = distinct !DICompileUnit(language: DW_LANG_C11, file: !590, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !726, globals: !727, splitDebugInlining: false, nameTableKind: None)
!722 = !{!723}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !590, line: 40, baseType: !76, size: 32, elements: !724)
!724 = !{!725}
!725 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!726 = !{!106}
!727 = !{!588, !591, !593, !595, !597, !599, !604, !609, !611, !616, !621, !626, !631, !633, !635, !640, !645, !650, !652, !654, !656, !658, !660, !662}
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, retainedTypes: !761, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!730 = !{!731, !743}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !732, file: !729, line: 188, baseType: !76, size: 32, elements: !741)
!732 = distinct !DISubprogram(name: "x2nrealloc", scope: !729, file: !729, line: 176, type: !733, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !736)
!733 = !DISubroutineType(types: !734)
!734 = !{!106, !106, !735, !108}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!736 = !{!737, !738, !739, !740}
!737 = !DILocalVariable(name: "p", arg: 1, scope: !732, file: !729, line: 176, type: !106)
!738 = !DILocalVariable(name: "pn", arg: 2, scope: !732, file: !729, line: 176, type: !735)
!739 = !DILocalVariable(name: "s", arg: 3, scope: !732, file: !729, line: 176, type: !108)
!740 = !DILocalVariable(name: "n", scope: !732, file: !729, line: 178, type: !108)
!741 = !{!742}
!742 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !744, file: !729, line: 228, baseType: !76, size: 32, elements: !741)
!744 = distinct !DISubprogram(name: "xpalloc", scope: !729, file: !729, line: 223, type: !745, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !751)
!745 = !DISubroutineType(types: !746)
!746 = !{!106, !106, !747, !748, !750, !748}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !749, line: 130, baseType: !750)
!749 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !109, line: 35, baseType: !212)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760}
!752 = !DILocalVariable(name: "pa", arg: 1, scope: !744, file: !729, line: 223, type: !106)
!753 = !DILocalVariable(name: "pn", arg: 2, scope: !744, file: !729, line: 223, type: !747)
!754 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !744, file: !729, line: 223, type: !748)
!755 = !DILocalVariable(name: "n_max", arg: 4, scope: !744, file: !729, line: 223, type: !750)
!756 = !DILocalVariable(name: "s", arg: 5, scope: !744, file: !729, line: 223, type: !748)
!757 = !DILocalVariable(name: "n0", scope: !744, file: !729, line: 230, type: !748)
!758 = !DILocalVariable(name: "n", scope: !744, file: !729, line: 237, type: !748)
!759 = !DILocalVariable(name: "nbytes", scope: !744, file: !729, line: 248, type: !748)
!760 = !DILocalVariable(name: "adjusted_nbytes", scope: !744, file: !729, line: 252, type: !748)
!761 = !{!105, !106, !171, !212, !110}
!762 = distinct !DICompileUnit(language: DW_LANG_C11, file: !680, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !763, splitDebugInlining: false, nameTableKind: None)
!763 = !{!678, !681, !683}
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !765, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!765 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !726, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !771, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !726, splitDebugInlining: false, nameTableKind: None)
!771 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!772 = distinct !DICompileUnit(language: DW_LANG_C11, file: !773, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !774, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!774 = !{!171, !110, !106}
!775 = distinct !DICompileUnit(language: DW_LANG_C11, file: !705, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !776, splitDebugInlining: false, nameTableKind: None)
!776 = !{!703, !706}
!777 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !780, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !726, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!781 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!782 = !{i32 7, !"Dwarf Version", i32 5}
!783 = !{i32 2, !"Debug Info Version", i32 3}
!784 = !{i32 1, !"wchar_size", i32 4}
!785 = !{i32 8, !"PIC Level", i32 2}
!786 = !{i32 7, !"PIE Level", i32 2}
!787 = !{i32 7, !"uwtable", i32 2}
!788 = !{i32 7, !"frame-pointer", i32 1}
!789 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 46, type: !790, scopeLine: 47, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !792)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !70}
!792 = !{!793}
!793 = !DILocalVariable(name: "status", arg: 1, scope: !789, file: !2, line: 46, type: !70)
!794 = !DILocation(line: 0, scope: !789)
!795 = !DILocation(line: 48, column: 14, scope: !796)
!796 = distinct !DILexicalBlock(scope: !789, file: !2, line: 48, column: 7)
!797 = !DILocation(line: 48, column: 7, scope: !789)
!798 = !DILocation(line: 49, column: 5, scope: !799)
!799 = distinct !DILexicalBlock(scope: !796, file: !2, line: 49, column: 5)
!800 = !{!801, !801, i64 0}
!801 = !{!"any pointer", !802, i64 0}
!802 = !{!"omnipotent char", !803, i64 0}
!803 = !{!"Simple C/C++ TBAA"}
!804 = !DILocation(line: 52, column: 7, scope: !805)
!805 = distinct !DILexicalBlock(scope: !796, file: !2, line: 51, column: 5)
!806 = !DILocation(line: 53, column: 7, scope: !805)
!807 = !DILocation(line: 736, column: 3, scope: !808, inlinedAt: !810)
!808 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !69, file: !69, line: 734, type: !446, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !809)
!809 = !{}
!810 = distinct !DILocation(line: 57, column: 7, scope: !805)
!811 = !DILocation(line: 59, column: 7, scope: !805)
!812 = !DILocation(line: 63, column: 7, scope: !805)
!813 = !DILocation(line: 67, column: 7, scope: !805)
!814 = !DILocation(line: 72, column: 7, scope: !805)
!815 = !DILocation(line: 73, column: 7, scope: !805)
!816 = !DILocalVariable(name: "program", arg: 1, scope: !817, file: !69, line: 836, type: !111)
!817 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !69, file: !69, line: 836, type: !818, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !820)
!818 = !DISubroutineType(types: !819)
!819 = !{null, !111}
!820 = !{!816, !821, !828, !829, !831, !832}
!821 = !DILocalVariable(name: "infomap", scope: !817, file: !69, line: 838, type: !822)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 896, elements: !20)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !817, file: !69, line: 838, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !824, file: !69, line: 838, baseType: !111, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !824, file: !69, line: 838, baseType: !111, size: 64, offset: 64)
!828 = !DILocalVariable(name: "node", scope: !817, file: !69, line: 848, type: !111)
!829 = !DILocalVariable(name: "map_prog", scope: !817, file: !69, line: 849, type: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!831 = !DILocalVariable(name: "lc_messages", scope: !817, file: !69, line: 861, type: !111)
!832 = !DILocalVariable(name: "url_program", scope: !817, file: !69, line: 874, type: !111)
!833 = !DILocation(line: 0, scope: !817, inlinedAt: !834)
!834 = distinct !DILocation(line: 74, column: 7, scope: !805)
!835 = !DILocation(line: 857, column: 3, scope: !817, inlinedAt: !834)
!836 = !DILocation(line: 861, column: 29, scope: !817, inlinedAt: !834)
!837 = !DILocation(line: 862, column: 7, scope: !838, inlinedAt: !834)
!838 = distinct !DILexicalBlock(scope: !817, file: !69, line: 862, column: 7)
!839 = !DILocation(line: 862, column: 19, scope: !838, inlinedAt: !834)
!840 = !DILocation(line: 862, column: 22, scope: !838, inlinedAt: !834)
!841 = !DILocation(line: 862, column: 7, scope: !817, inlinedAt: !834)
!842 = !DILocation(line: 868, column: 7, scope: !843, inlinedAt: !834)
!843 = distinct !DILexicalBlock(scope: !838, file: !69, line: 863, column: 5)
!844 = !DILocation(line: 870, column: 5, scope: !843, inlinedAt: !834)
!845 = !DILocation(line: 875, column: 3, scope: !817, inlinedAt: !834)
!846 = !DILocation(line: 877, column: 3, scope: !817, inlinedAt: !834)
!847 = !DILocation(line: 76, column: 3, scope: !789)
!848 = !DISubprogram(name: "dcgettext", scope: !849, file: !849, line: 51, type: !850, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!849 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!850 = !DISubroutineType(types: !851)
!851 = !{!105, !111, !111, !70}
!852 = !DISubprogram(name: "__fprintf_chk", scope: !853, file: !853, line: 93, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!853 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!854 = !DISubroutineType(types: !855)
!855 = !{!70, !856, !70, !857, null}
!856 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !184)
!857 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !111)
!858 = !DISubprogram(name: "__printf_chk", scope: !853, file: !853, line: 95, type: !859, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!859 = !DISubroutineType(types: !860)
!860 = !{!70, !70, !857, null}
!861 = !DISubprogram(name: "fputs_unlocked", scope: !405, file: !405, line: 691, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!862 = !DISubroutineType(types: !863)
!863 = !{!70, !857, !856}
!864 = !DILocation(line: 0, scope: !161)
!865 = !DILocation(line: 581, column: 7, scope: !169)
!866 = !{!867, !867, i64 0}
!867 = !{!"int", !802, i64 0}
!868 = !DILocation(line: 581, column: 19, scope: !169)
!869 = !DILocation(line: 581, column: 7, scope: !161)
!870 = !DILocation(line: 585, column: 26, scope: !168)
!871 = !DILocation(line: 0, scope: !168)
!872 = !DILocation(line: 586, column: 23, scope: !168)
!873 = !DILocation(line: 586, column: 28, scope: !168)
!874 = !DILocation(line: 586, column: 32, scope: !168)
!875 = !{!802, !802, i64 0}
!876 = !DILocation(line: 586, column: 38, scope: !168)
!877 = !DILocalVariable(name: "__s1", arg: 1, scope: !878, file: !879, line: 1359, type: !111)
!878 = distinct !DISubprogram(name: "streq", scope: !879, file: !879, line: 1359, type: !880, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !882)
!879 = !DIFile(filename: "./lib/string.h", directory: "/src")
!880 = !DISubroutineType(types: !881)
!881 = !{!171, !111, !111}
!882 = !{!877, !883}
!883 = !DILocalVariable(name: "__s2", arg: 2, scope: !878, file: !879, line: 1359, type: !111)
!884 = !DILocation(line: 0, scope: !878, inlinedAt: !885)
!885 = distinct !DILocation(line: 586, column: 41, scope: !168)
!886 = !DILocation(line: 1361, column: 11, scope: !878, inlinedAt: !885)
!887 = !DILocation(line: 1361, column: 10, scope: !878, inlinedAt: !885)
!888 = !DILocation(line: 586, column: 19, scope: !168)
!889 = !DILocation(line: 587, column: 5, scope: !168)
!890 = !DILocation(line: 588, column: 7, scope: !891)
!891 = distinct !DILexicalBlock(scope: !161, file: !69, line: 588, column: 7)
!892 = !DILocation(line: 588, column: 7, scope: !161)
!893 = !DILocation(line: 590, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !891, file: !69, line: 589, column: 5)
!895 = !DILocation(line: 591, column: 7, scope: !894)
!896 = !DILocation(line: 595, column: 37, scope: !161)
!897 = !DILocation(line: 595, column: 35, scope: !161)
!898 = !DILocation(line: 596, column: 29, scope: !161)
!899 = !DILocation(line: 597, column: 8, scope: !177)
!900 = !DILocation(line: 597, column: 7, scope: !161)
!901 = !DILocation(line: 604, column: 24, scope: !176)
!902 = !DILocation(line: 604, column: 12, scope: !177)
!903 = !DILocation(line: 0, scope: !175)
!904 = !DILocation(line: 610, column: 16, scope: !175)
!905 = !DILocation(line: 610, column: 7, scope: !175)
!906 = !DILocation(line: 611, column: 21, scope: !175)
!907 = !{!908, !908, i64 0}
!908 = !{!"short", !802, i64 0}
!909 = !DILocation(line: 611, column: 19, scope: !175)
!910 = !DILocation(line: 611, column: 16, scope: !175)
!911 = !DILocation(line: 610, column: 30, scope: !175)
!912 = distinct !{!912, !905, !906, !913}
!913 = !{!"llvm.loop.mustprogress"}
!914 = !DILocation(line: 612, column: 18, scope: !915)
!915 = distinct !DILexicalBlock(scope: !175, file: !69, line: 612, column: 11)
!916 = !DILocation(line: 612, column: 11, scope: !175)
!917 = !DILocation(line: 620, column: 23, scope: !161)
!918 = !DILocation(line: 625, column: 39, scope: !161)
!919 = !DILocation(line: 626, column: 3, scope: !161)
!920 = !DILocation(line: 626, column: 10, scope: !161)
!921 = !DILocation(line: 626, column: 21, scope: !161)
!922 = !DILocation(line: 628, column: 44, scope: !923)
!923 = distinct !DILexicalBlock(scope: !924, file: !69, line: 628, column: 11)
!924 = distinct !DILexicalBlock(scope: !161, file: !69, line: 627, column: 5)
!925 = !DILocation(line: 628, column: 32, scope: !923)
!926 = !DILocation(line: 628, column: 49, scope: !923)
!927 = !DILocation(line: 628, column: 11, scope: !924)
!928 = !DILocation(line: 630, column: 11, scope: !929)
!929 = distinct !DILexicalBlock(scope: !924, file: !69, line: 630, column: 11)
!930 = !DILocation(line: 630, column: 11, scope: !924)
!931 = !DILocation(line: 632, column: 26, scope: !932)
!932 = distinct !DILexicalBlock(scope: !933, file: !69, line: 632, column: 15)
!933 = distinct !DILexicalBlock(scope: !929, file: !69, line: 631, column: 9)
!934 = !DILocation(line: 632, column: 34, scope: !932)
!935 = !DILocation(line: 632, column: 37, scope: !932)
!936 = !DILocation(line: 632, column: 15, scope: !933)
!937 = !DILocation(line: 640, column: 16, scope: !924)
!938 = distinct !{!938, !919, !939, !913}
!939 = !DILocation(line: 641, column: 5, scope: !161)
!940 = !DILocation(line: 644, column: 3, scope: !161)
!941 = !DILocation(line: 0, scope: !878, inlinedAt: !942)
!942 = distinct !DILocation(line: 648, column: 31, scope: !161)
!943 = !DILocation(line: 0, scope: !878, inlinedAt: !944)
!944 = distinct !DILocation(line: 649, column: 31, scope: !161)
!945 = !DILocation(line: 0, scope: !878, inlinedAt: !946)
!946 = distinct !DILocation(line: 650, column: 31, scope: !161)
!947 = !DILocation(line: 0, scope: !878, inlinedAt: !948)
!948 = distinct !DILocation(line: 651, column: 31, scope: !161)
!949 = !DILocation(line: 0, scope: !878, inlinedAt: !950)
!950 = distinct !DILocation(line: 652, column: 31, scope: !161)
!951 = !DILocation(line: 0, scope: !878, inlinedAt: !952)
!952 = distinct !DILocation(line: 653, column: 31, scope: !161)
!953 = !DILocation(line: 0, scope: !878, inlinedAt: !954)
!954 = distinct !DILocation(line: 654, column: 31, scope: !161)
!955 = !DILocation(line: 0, scope: !878, inlinedAt: !956)
!956 = distinct !DILocation(line: 655, column: 31, scope: !161)
!957 = !DILocation(line: 0, scope: !878, inlinedAt: !958)
!958 = distinct !DILocation(line: 656, column: 31, scope: !161)
!959 = !DILocation(line: 0, scope: !878, inlinedAt: !960)
!960 = distinct !DILocation(line: 657, column: 31, scope: !161)
!961 = !DILocation(line: 663, column: 7, scope: !962)
!962 = distinct !DILexicalBlock(scope: !161, file: !69, line: 663, column: 7)
!963 = !DILocation(line: 664, column: 7, scope: !962)
!964 = !DILocation(line: 664, column: 10, scope: !962)
!965 = !DILocation(line: 663, column: 7, scope: !161)
!966 = !DILocation(line: 669, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !962, file: !69, line: 665, column: 5)
!968 = !DILocation(line: 671, column: 5, scope: !967)
!969 = !DILocation(line: 676, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !962, file: !69, line: 673, column: 5)
!971 = !DILocation(line: 679, column: 3, scope: !161)
!972 = !DILocation(line: 683, column: 3, scope: !161)
!973 = !DILocation(line: 686, column: 3, scope: !161)
!974 = !DILocation(line: 688, column: 3, scope: !161)
!975 = !DILocation(line: 691, column: 3, scope: !161)
!976 = !DILocation(line: 695, column: 3, scope: !161)
!977 = !DILocation(line: 696, column: 1, scope: !161)
!978 = !DISubprogram(name: "setlocale", scope: !979, file: !979, line: 122, type: !980, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!979 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!980 = !DISubroutineType(types: !981)
!981 = !{!105, !70, !111}
!982 = !DISubprogram(name: "strncmp", scope: !983, file: !983, line: 159, type: !984, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!983 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!984 = !DISubroutineType(types: !985)
!985 = !{!70, !111, !111, !108}
!986 = !DISubprogram(name: "exit", scope: !987, file: !987, line: 624, type: !790, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !809)
!987 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!988 = !DISubprogram(name: "getenv", scope: !987, file: !987, line: 641, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!989 = !DISubroutineType(types: !990)
!990 = !{!105, !111}
!991 = !DISubprogram(name: "strcmp", scope: !983, file: !983, line: 156, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!992 = !DISubroutineType(types: !993)
!993 = !{!70, !111, !111}
!994 = !DISubprogram(name: "strspn", scope: !983, file: !983, line: 297, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!995 = !DISubroutineType(types: !996)
!996 = !{!110, !111, !111}
!997 = !DISubprogram(name: "strchr", scope: !983, file: !983, line: 246, type: !998, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!998 = !DISubroutineType(types: !999)
!999 = !{!105, !111, !70}
!1000 = !DISubprogram(name: "__ctype_b_loc", scope: !90, file: !90, line: 79, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!1006 = !DISubprogram(name: "strcspn", scope: !983, file: !983, line: 293, type: !995, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1007 = !DISubprogram(name: "fwrite_unlocked", scope: !405, file: !405, line: 704, type: !1008, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!108, !1010, !108, !108, !856}
!1010 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1013 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 80, type: !1014, scopeLine: 81, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1017)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!70, !70, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1026, !1027, !1030, !1034, !1040, !1041}
!1018 = !DILocalVariable(name: "argc", arg: 1, scope: !1013, file: !2, line: 80, type: !70)
!1019 = !DILocalVariable(name: "argv", arg: 2, scope: !1013, file: !2, line: 80, type: !1016)
!1020 = !DILocalVariable(name: "specified_mode", scope: !1013, file: !2, line: 82, type: !111)
!1021 = !DILocalVariable(name: "scontext", scope: !1013, file: !2, line: 83, type: !111)
!1022 = !DILocalVariable(name: "set_security_context", scope: !1013, file: !2, line: 84, type: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DICompositeType(tag: DW_TAG_structure_type, name: "selabel_handle", file: !1025, line: 53, flags: DIFlagFwdDecl)
!1025 = !DIFile(filename: "./lib/selinux/label.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a430a70cff1d2c3fd1539e29c9e5e879")
!1026 = !DILocalVariable(name: "optc", scope: !1013, file: !2, line: 94, type: !70)
!1027 = !DILocalVariable(name: "ret", scope: !1028, file: !2, line: 142, type: !70)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !2, line: 141, column: 5)
!1029 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 140, column: 7)
!1030 = !DILocalVariable(name: "newmode", scope: !1013, file: !2, line: 154, type: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !1032, line: 69, baseType: !1033)
!1032 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !211, line: 150, baseType: !76)
!1034 = !DILocalVariable(name: "change", scope: !1035, file: !2, line: 157, type: !1037)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 156, column: 5)
!1036 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 155, column: 7)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "mode_change", file: !1039, line: 35, flags: DIFlagFwdDecl)
!1039 = !DIFile(filename: "./lib/modechange.h", directory: "/src", checksumkind: CSK_MD5, checksum: "41f2efe3cfeccb00721320834728c24b")
!1040 = !DILocalVariable(name: "umask_value", scope: !1035, file: !2, line: 160, type: !1031)
!1041 = !DILocalVariable(name: "exit_status", scope: !1013, file: !2, line: 169, type: !70)
!1042 = !DILocation(line: 0, scope: !1013)
!1043 = !DILocation(line: 87, column: 21, scope: !1013)
!1044 = !DILocation(line: 87, column: 3, scope: !1013)
!1045 = !DILocation(line: 88, column: 3, scope: !1013)
!1046 = !DILocation(line: 89, column: 3, scope: !1013)
!1047 = !DILocation(line: 90, column: 3, scope: !1013)
!1048 = !DILocation(line: 92, column: 3, scope: !1013)
!1049 = !DILocation(line: 95, column: 3, scope: !1013)
!1050 = !DILocation(line: 95, column: 18, scope: !1013)
!1051 = !DILocation(line: 100, column: 28, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1053, file: !2, line: 98, column: 9)
!1053 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 96, column: 5)
!1054 = !DILocation(line: 101, column: 11, scope: !1052)
!1055 = distinct !{!1055, !1049, !1056, !913}
!1056 = !DILocation(line: 132, column: 5, scope: !1013)
!1057 = !DILocation(line: 120, column: 20, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !1059, file: !2, line: 120, column: 20)
!1059 = distinct !DILexicalBlock(scope: !1060, file: !2, line: 108, column: 20)
!1060 = distinct !DILexicalBlock(scope: !1052, file: !2, line: 103, column: 15)
!1061 = !DILocation(line: 120, column: 20, scope: !1059)
!1062 = !DILocation(line: 122, column: 15, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 121, column: 13)
!1064 = !DILocation(line: 125, column: 13, scope: !1063)
!1065 = !DILocation(line: 127, column: 9, scope: !1052)
!1066 = !DILocation(line: 128, column: 9, scope: !1052)
!1067 = !DILocation(line: 130, column: 11, scope: !1052)
!1068 = !DILocation(line: 134, column: 7, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 134, column: 7)
!1070 = !DILocation(line: 134, column: 14, scope: !1069)
!1071 = !DILocation(line: 134, column: 7, scope: !1013)
!1072 = !DILocation(line: 136, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !2, line: 135, column: 5)
!1074 = !DILocation(line: 137, column: 7, scope: !1073)
!1075 = !DILocation(line: 155, column: 7, scope: !1036)
!1076 = !DILocation(line: 155, column: 7, scope: !1013)
!1077 = !DILocation(line: 157, column: 36, scope: !1035)
!1078 = !DILocation(line: 0, scope: !1035)
!1079 = !DILocation(line: 158, column: 12, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 158, column: 11)
!1081 = !DILocation(line: 158, column: 11, scope: !1035)
!1082 = !DILocation(line: 159, column: 9, scope: !1080)
!1083 = !DILocation(line: 160, column: 28, scope: !1035)
!1084 = !DILocation(line: 161, column: 7, scope: !1035)
!1085 = !DILocation(line: 162, column: 17, scope: !1035)
!1086 = !DILocation(line: 163, column: 7, scope: !1035)
!1087 = !DILocation(line: 164, column: 19, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 164, column: 11)
!1089 = !DILocation(line: 164, column: 11, scope: !1035)
!1090 = !DILocation(line: 170, column: 10, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1092, file: !2, line: 170, column: 3)
!1092 = distinct !DILexicalBlock(scope: !1013, file: !2, line: 170, column: 3)
!1093 = !DILocation(line: 165, column: 9, scope: !1088)
!1094 = !DILocation(line: 170, column: 17, scope: !1091)
!1095 = !DILocation(line: 170, column: 3, scope: !1092)
!1096 = !DILocation(line: 174, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !2, line: 174, column: 11)
!1098 = distinct !DILexicalBlock(scope: !1091, file: !2, line: 171, column: 5)
!1099 = !DILocation(line: 174, column: 11, scope: !1097)
!1100 = !DILocation(line: 174, column: 42, scope: !1097)
!1101 = !DILocation(line: 174, column: 11, scope: !1098)
!1102 = !DILocation(line: 179, column: 31, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1097, file: !2, line: 179, column: 16)
!1104 = !DILocation(line: 179, column: 47, scope: !1103)
!1105 = !DILocation(line: 179, column: 42, scope: !1103)
!1106 = !DILocation(line: 179, column: 34, scope: !1103)
!1107 = !DILocation(line: 179, column: 65, scope: !1103)
!1108 = !DILocation(line: 179, column: 16, scope: !1097)
!1109 = !DILocation(line: 0, scope: !1097)
!1110 = !DILocation(line: 170, column: 25, scope: !1091)
!1111 = distinct !{!1111, !1095, !1112, !913}
!1112 = !DILocation(line: 185, column: 5, scope: !1092)
!1113 = !DILocation(line: 187, column: 3, scope: !1013)
!1114 = !DISubprogram(name: "bindtextdomain", scope: !849, file: !849, line: 86, type: !1115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!105, !111, !111}
!1117 = !DISubprogram(name: "textdomain", scope: !849, file: !849, line: 82, type: !989, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1118 = !DISubprogram(name: "atexit", scope: !987, file: !987, line: 602, type: !1119, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!70, !445}
!1121 = !DISubprogram(name: "getopt_long", scope: !362, file: !362, line: 66, type: !1122, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!70, !70, !1124, !111, !1126, !367}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!1127 = !DISubprogram(name: "umask", scope: !1128, file: !1128, line: 380, type: !1129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1128 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!1033, !1033}
!1131 = !DISubprogram(name: "free", scope: !987, file: !987, line: 555, type: !1132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !106}
!1134 = !DISubprogram(name: "mkfifo", scope: !1128, file: !1128, line: 418, type: !1135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!70, !111, !1033}
!1137 = !DISubprogram(name: "lchmod", scope: !1128, file: !1128, line: 359, type: !1135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1138 = !DISubprogram(name: "__errno_location", scope: !1139, file: !1139, line: 37, type: !1140, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1139 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!367}
!1142 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !379, file: !379, line: 50, type: !818, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1143)
!1143 = !{!1144}
!1144 = !DILocalVariable(name: "file", arg: 1, scope: !1142, file: !379, line: 50, type: !111)
!1145 = !DILocation(line: 0, scope: !1142)
!1146 = !DILocation(line: 52, column: 13, scope: !1142)
!1147 = !DILocation(line: 53, column: 1, scope: !1142)
!1148 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !379, file: !379, line: 87, type: !1149, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1151)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{null, !171}
!1151 = !{!1152}
!1152 = !DILocalVariable(name: "ignore", arg: 1, scope: !1148, file: !379, line: 87, type: !171)
!1153 = !DILocation(line: 0, scope: !1148)
!1154 = !DILocation(line: 89, column: 16, scope: !1148)
!1155 = !{!1156, !1156, i64 0}
!1156 = !{!"_Bool", !802, i64 0}
!1157 = !DILocation(line: 90, column: 1, scope: !1148)
!1158 = distinct !DISubprogram(name: "close_stdout", scope: !379, file: !379, line: 116, type: !446, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !378, retainedNodes: !1159)
!1159 = !{!1160}
!1160 = !DILocalVariable(name: "write_error", scope: !1161, file: !379, line: 121, type: !111)
!1161 = distinct !DILexicalBlock(scope: !1162, file: !379, line: 120, column: 5)
!1162 = distinct !DILexicalBlock(scope: !1158, file: !379, line: 118, column: 7)
!1163 = !DILocation(line: 118, column: 21, scope: !1162)
!1164 = !DILocation(line: 118, column: 7, scope: !1162)
!1165 = !DILocation(line: 118, column: 29, scope: !1162)
!1166 = !DILocation(line: 119, column: 7, scope: !1162)
!1167 = !DILocation(line: 119, column: 12, scope: !1162)
!1168 = !{i8 0, i8 2}
!1169 = !DILocation(line: 119, column: 25, scope: !1162)
!1170 = !DILocation(line: 119, column: 28, scope: !1162)
!1171 = !DILocation(line: 119, column: 34, scope: !1162)
!1172 = !DILocation(line: 118, column: 7, scope: !1158)
!1173 = !DILocation(line: 121, column: 33, scope: !1161)
!1174 = !DILocation(line: 0, scope: !1161)
!1175 = !DILocation(line: 122, column: 11, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1161, file: !379, line: 122, column: 11)
!1177 = !DILocation(line: 0, scope: !1176)
!1178 = !DILocation(line: 122, column: 11, scope: !1161)
!1179 = !DILocation(line: 123, column: 9, scope: !1176)
!1180 = !DILocation(line: 126, column: 9, scope: !1176)
!1181 = !DILocation(line: 128, column: 14, scope: !1161)
!1182 = !DILocation(line: 128, column: 7, scope: !1161)
!1183 = !DILocation(line: 133, column: 42, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1158, file: !379, line: 133, column: 7)
!1185 = !DILocation(line: 133, column: 28, scope: !1184)
!1186 = !DILocation(line: 133, column: 50, scope: !1184)
!1187 = !DILocation(line: 133, column: 7, scope: !1158)
!1188 = !DILocation(line: 134, column: 12, scope: !1184)
!1189 = !DILocation(line: 134, column: 5, scope: !1184)
!1190 = !DILocation(line: 135, column: 1, scope: !1158)
!1191 = !DISubprogram(name: "_exit", scope: !1192, file: !1192, line: 624, type: !790, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !809)
!1192 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1193 = distinct !DISubprogram(name: "verror", scope: !394, file: !394, line: 251, type: !1194, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1196)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !70, !70, !111, !404}
!1196 = !{!1197, !1198, !1199, !1200}
!1197 = !DILocalVariable(name: "status", arg: 1, scope: !1193, file: !394, line: 251, type: !70)
!1198 = !DILocalVariable(name: "errnum", arg: 2, scope: !1193, file: !394, line: 251, type: !70)
!1199 = !DILocalVariable(name: "message", arg: 3, scope: !1193, file: !394, line: 251, type: !111)
!1200 = !DILocalVariable(name: "args", arg: 4, scope: !1193, file: !394, line: 251, type: !404)
!1201 = !DILocation(line: 0, scope: !1193)
!1202 = !DILocation(line: 251, column: 1, scope: !1193)
!1203 = !DILocation(line: 261, column: 3, scope: !1193)
!1204 = !DILocation(line: 265, column: 7, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1193, file: !394, line: 265, column: 7)
!1206 = !DILocation(line: 265, column: 7, scope: !1193)
!1207 = !DILocation(line: 266, column: 5, scope: !1205)
!1208 = !DILocation(line: 272, column: 7, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1205, file: !394, line: 268, column: 5)
!1210 = !DILocation(line: 276, column: 3, scope: !1193)
!1211 = !{i64 0, i64 8, !800, i64 8, i64 8, !800, i64 16, i64 8, !800, i64 24, i64 4, !866, i64 28, i64 4, !866}
!1212 = !DILocation(line: 282, column: 1, scope: !1193)
!1213 = distinct !DISubprogram(name: "flush_stdout", scope: !394, file: !394, line: 163, type: !446, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1214)
!1214 = !{!1215}
!1215 = !DILocalVariable(name: "stdout_fd", scope: !1213, file: !394, line: 166, type: !70)
!1216 = !DILocation(line: 0, scope: !1213)
!1217 = !DILocalVariable(name: "fd", arg: 1, scope: !1218, file: !394, line: 145, type: !70)
!1218 = distinct !DISubprogram(name: "is_open", scope: !394, file: !394, line: 145, type: !1219, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1221)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!70, !70}
!1221 = !{!1217}
!1222 = !DILocation(line: 0, scope: !1218, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 182, column: 25, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1213, file: !394, line: 182, column: 7)
!1225 = !DILocation(line: 157, column: 15, scope: !1218, inlinedAt: !1223)
!1226 = !DILocation(line: 157, column: 12, scope: !1218, inlinedAt: !1223)
!1227 = !DILocation(line: 182, column: 7, scope: !1213)
!1228 = !DILocation(line: 184, column: 5, scope: !1224)
!1229 = !DILocation(line: 185, column: 1, scope: !1213)
!1230 = distinct !DISubprogram(name: "error_tail", scope: !394, file: !394, line: 219, type: !1194, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1231)
!1231 = !{!1232, !1233, !1234, !1235}
!1232 = !DILocalVariable(name: "status", arg: 1, scope: !1230, file: !394, line: 219, type: !70)
!1233 = !DILocalVariable(name: "errnum", arg: 2, scope: !1230, file: !394, line: 219, type: !70)
!1234 = !DILocalVariable(name: "message", arg: 3, scope: !1230, file: !394, line: 219, type: !111)
!1235 = !DILocalVariable(name: "args", arg: 4, scope: !1230, file: !394, line: 219, type: !404)
!1236 = !DILocation(line: 0, scope: !1230)
!1237 = !DILocation(line: 219, column: 1, scope: !1230)
!1238 = !DILocation(line: 229, column: 13, scope: !1230)
!1239 = !DILocation(line: 135, column: 10, scope: !1240, inlinedAt: !1282)
!1240 = distinct !DISubprogram(name: "vfprintf", scope: !853, file: !853, line: 132, type: !1241, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !393, retainedNodes: !1278)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!70, !1243, !857, !406}
!1243 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !186, line: 7, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !188, line: 49, size: 1728, elements: !1247)
!1247 = !{!1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1246, file: !188, line: 51, baseType: !70, size: 32)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1246, file: !188, line: 54, baseType: !105, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1246, file: !188, line: 55, baseType: !105, size: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1246, file: !188, line: 56, baseType: !105, size: 64, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1246, file: !188, line: 57, baseType: !105, size: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1246, file: !188, line: 58, baseType: !105, size: 64, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1246, file: !188, line: 59, baseType: !105, size: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1246, file: !188, line: 60, baseType: !105, size: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1246, file: !188, line: 61, baseType: !105, size: 64, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1246, file: !188, line: 64, baseType: !105, size: 64, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1246, file: !188, line: 65, baseType: !105, size: 64, offset: 640)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1246, file: !188, line: 66, baseType: !105, size: 64, offset: 704)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1246, file: !188, line: 68, baseType: !203, size: 64, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1246, file: !188, line: 70, baseType: !1262, size: 64, offset: 832)
