; ModuleID = 'src/mv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.timespec = type { i64, i64 }
%struct.copy_debug = type { i32, i32, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.27 }
%union.anon.27 = type { i32 }
%struct.cp_options = type { i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, ptr, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i32, i8, i8, i8, i8, i8, i8, i32, i32, ptr, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.dir_list = type { ptr, i64, i64 }

!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !2, line: 433, type: !128, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 445, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 21)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !2, line: 447, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 42)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 458, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 70)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 17)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !2, line: 471, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 20)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 507, type: !118, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 67)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !2, line: 536, type: !265, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !180, line: 736, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 75)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !316, file: !180, line: 575, type: !181, isLocal: true, isDefinition: true)
!316 = distinct !DISubprogram(name: "oputs_", scope: !180, file: !180, line: 573, type: !317, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !319)
!317 = !DISubroutineType(cc: DW_CC_nocall, types: !318)
!318 = !{null, !236, !236}
!319 = !{!320, !321, !322, !325, !327, !328, !329, !333, !334, !335, !336, !338, !388, !389, !390, !392, !393}
!320 = !DILocalVariable(name: "program", arg: 1, scope: !316, file: !180, line: 573, type: !236)
!321 = !DILocalVariable(name: "option", arg: 2, scope: !316, file: !180, line: 573, type: !236)
!322 = !DILocalVariable(name: "term", scope: !323, file: !180, line: 585, type: !236)
!323 = distinct !DILexicalBlock(scope: !324, file: !180, line: 582, column: 5)
!324 = distinct !DILexicalBlock(scope: !316, file: !180, line: 581, column: 7)
!325 = !DILocalVariable(name: "double_space", scope: !316, file: !180, line: 594, type: !326)
!326 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!327 = !DILocalVariable(name: "first_word", scope: !316, file: !180, line: 595, type: !236)
!328 = !DILocalVariable(name: "option_text", scope: !316, file: !180, line: 596, type: !236)
!329 = !DILocalVariable(name: "s", scope: !330, file: !180, line: 608, type: !236)
!330 = distinct !DILexicalBlock(scope: !331, file: !180, line: 605, column: 5)
!331 = distinct !DILexicalBlock(scope: !332, file: !180, line: 604, column: 12)
!332 = distinct !DILexicalBlock(scope: !316, file: !180, line: 597, column: 7)
!333 = !DILocalVariable(name: "spaces", scope: !330, file: !180, line: 609, type: !233)
!334 = !DILocalVariable(name: "anchor_len", scope: !316, file: !180, line: 620, type: !233)
!335 = !DILocalVariable(name: "desc_text", scope: !316, file: !180, line: 625, type: !236)
!336 = !DILocalVariable(name: "__ptr", scope: !337, file: !180, line: 644, type: !236)
!337 = distinct !DILexicalBlock(scope: !316, file: !180, line: 644, column: 3)
!338 = !DILocalVariable(name: "__stream", scope: !337, file: !180, line: 644, type: !339)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !341, line: 7, baseType: !342)
!341 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !343, line: 49, size: 1728, elements: !344)
!343 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !360, !362, !363, !364, !368, !369, !371, !372, !375, !377, !380, !383, !384, !385, !386, !387}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !342, file: !343, line: 51, baseType: !181, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !342, file: !343, line: 54, baseType: !230, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !342, file: !343, line: 55, baseType: !230, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !342, file: !343, line: 56, baseType: !230, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !342, file: !343, line: 57, baseType: !230, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !342, file: !343, line: 58, baseType: !230, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !342, file: !343, line: 59, baseType: !230, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !342, file: !343, line: 60, baseType: !230, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !342, file: !343, line: 61, baseType: !230, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !342, file: !343, line: 64, baseType: !230, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !342, file: !343, line: 65, baseType: !230, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !342, file: !343, line: 66, baseType: !230, size: 64, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !342, file: !343, line: 68, baseType: !358, size: 64, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !343, line: 36, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !342, file: !343, line: 70, baseType: !361, size: 64, offset: 832)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !342, file: !343, line: 72, baseType: !181, size: 32, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !342, file: !343, line: 73, baseType: !181, size: 32, offset: 928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !342, file: !343, line: 74, baseType: !365, size: 64, offset: 960)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !366, line: 152, baseType: !367)
!366 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!367 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !342, file: !343, line: 77, baseType: !232, size: 16, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !342, file: !343, line: 78, baseType: !370, size: 8, offset: 1040)
!370 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !342, file: !343, line: 79, baseType: !113, size: 8, offset: 1048)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !342, file: !343, line: 81, baseType: !373, size: 64, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !343, line: 43, baseType: null)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !342, file: !343, line: 89, baseType: !376, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !366, line: 153, baseType: !367)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !342, file: !343, line: 91, baseType: !378, size: 64, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !343, line: 37, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !342, file: !343, line: 92, baseType: !381, size: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !343, line: 38, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !342, file: !343, line: 93, baseType: !361, size: 64, offset: 1344)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !342, file: !343, line: 94, baseType: !231, size: 64, offset: 1408)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !342, file: !343, line: 95, baseType: !233, size: 64, offset: 1472)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !342, file: !343, line: 96, baseType: !181, size: 32, offset: 1536)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !342, file: !343, line: 98, baseType: !297, size: 160, offset: 1568)
!388 = !DILocalVariable(name: "__cnt", scope: !337, file: !180, line: 644, type: !233)
!389 = !DILocalVariable(name: "url_program", scope: !316, file: !180, line: 648, type: !236)
!390 = !DILocalVariable(name: "__ptr", scope: !391, file: !180, line: 686, type: !236)
!391 = distinct !DILexicalBlock(scope: !316, file: !180, line: 686, column: 3)
!392 = !DILocalVariable(name: "__stream", scope: !391, file: !180, line: 686, type: !339)
!393 = !DILocalVariable(name: "__cnt", scope: !391, file: !180, line: 686, type: !233)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !180, line: 585, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 5)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !180, line: 586, type: !396, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !180, line: 595, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 4)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !180, line: 620, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 6)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !180, line: 648, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !180, line: 648, type: !396, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !180, line: 649, type: !403, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !180, line: 649, type: !19, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !180, line: 650, type: !396, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !180, line: 651, type: !408, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !180, line: 651, type: !408, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !180, line: 652, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 7)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !180, line: 653, type: !435, isLocal: true, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 8)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !180, line: 654, type: !118, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !180, line: 655, type: !118, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !180, line: 656, type: !118, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(scope: null, file: !180, line: 657, type: !118, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !180, line: 663, type: !430, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !180, line: 664, type: !118, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !180, line: 669, type: !292, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !180, line: 669, type: !454, isLocal: true, isDefinition: true)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 40)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !180, line: 676, type: !459, isLocal: true, isDefinition: true)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 15)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !180, line: 676, type: !29, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !180, line: 679, type: !19, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !180, line: 683, type: !396, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !180, line: 688, type: !396, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !180, line: 691, type: !435, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !180, line: 764, type: !474, isLocal: true, isDefinition: true)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 4976, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 622)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !180, line: 781, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1768, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 221)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !180, line: 788, type: !484, isLocal: true, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1776, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 222)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !180, line: 839, type: !270, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !180, line: 840, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 22)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !180, line: 841, type: !459, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !180, line: 862, type: !403, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !180, line: 868, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 71)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !180, line: 875, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 27)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !180, line: 877, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 51)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !180, line: 877, type: !265, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !430, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !435, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !408, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 71, type: !250, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 72, type: !408, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !265, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 11)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !435, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !297, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 77, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 23)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !430, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !292, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !430, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !435, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !396, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !2, line: 84, type: !435, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "update_type", scope: !133, file: !2, line: 60, type: !555, isLocal: true, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !404)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !403, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !396, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !118, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !408, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "update_type_string", scope: !133, file: !2, line: 56, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 320, elements: !397)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 864, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 108)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !250, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !2, line: 237, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 704, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 88)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !583, file: !2, line: 110, type: !596, isLocal: true, isDefinition: true)
!583 = distinct !DISubprogram(name: "rm_option_init", scope: !2, file: !2, line: 89, type: !584, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !133, retainedNodes: !610)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !215, line: 32, size: 256, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !606, !607, !608, !609}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !587, file: !215, line: 35, baseType: !326, size: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !587, file: !215, line: 38, baseType: !214, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !587, file: !215, line: 47, baseType: !326, size: 8, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !587, file: !215, line: 50, baseType: !326, size: 8, offset: 72)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !587, file: !215, line: 53, baseType: !326, size: 8, offset: 80)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !587, file: !215, line: 57, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !597, line: 30, size: 128, elements: !598)
!597 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!598 = !{!599, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !596, file: !597, line: 32, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !601, line: 47, baseType: !602)
!601 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !366, line: 148, baseType: !235)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !596, file: !597, line: 33, baseType: !604, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !601, line: 59, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !366, line: 145, baseType: !235)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !587, file: !215, line: 61, baseType: !326, size: 8, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !587, file: !215, line: 64, baseType: !326, size: 8, offset: 200)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !587, file: !215, line: 67, baseType: !326, size: 8, offset: 208)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !587, file: !215, line: 75, baseType: !326, size: 8, offset: 216)
!610 = !{!611}
!611 = !DILocalVariable(name: "x", arg: 1, scope: !583, file: !2, line: 89, type: !586)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 31)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 113, type: !413, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 4352, elements: !293)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !622, line: 50, size: 256, elements: !623)
!622 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!623 = !{!624, !625, !626, !628}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !622, line: 52, baseType: !236, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !621, file: !622, line: 55, baseType: !181, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !621, file: !622, line: 56, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !621, file: !622, line: 57, baseType: !181, size: 32, offset: 192)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !631, line: 625, type: !270, isLocal: true, isDefinition: true)
!631 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !631, line: 633, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !579)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(scope: null, file: !631, line: 633, type: !128, isLocal: true, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !631, line: 633, type: !639, isLocal: true, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 480, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 60)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !631, line: 639, type: !292, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !631, line: 456, type: !292, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !510, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !413, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !631, line: 469, type: !19, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !413, isLocal: true, isDefinition: true)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !656, isLocal: true, isDefinition: true)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 45)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !88, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !631, line: 482, type: !663, isLocal: true, isDefinition: true)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 49)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !631, line: 498, type: !614, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !631, line: 511, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 46)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !631, line: 514, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 37)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !631, line: 576, type: !680, isLocal: true, isDefinition: true)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 186)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !631, line: 583, type: !277, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !631, line: 589, type: !14, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !631, line: 589, type: !491, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !631, line: 276, type: !691, isLocal: true, isDefinition: true)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 48)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !631, line: 276, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 32)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !631, line: 297, type: !510, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !631, line: 309, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 35)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !631, line: 309, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 19)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !631, line: 398, type: !491, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !631, line: 398, type: !265, isLocal: true, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(scope: null, file: !717, line: 606, type: !675, isLocal: true, isDefinition: true)
!717 = !DIFile(filename: "src/copy.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2468b988b487bb70a5564b296b3014eb")
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !717, line: 648, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 41)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "top_level_src_name", scope: !725, file: !717, line: 128, type: !236, isLocal: true, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C11, file: !717, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !747, globals: !748, splitDebugInlining: false, nameTableKind: None)
!726 = !{!135, !143, !150, !156, !162, !168, !185, !727, !731, !738}
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !728, line: 32, baseType: !137, size: 32, elements: !729)
!728 = !DIFile(filename: "./lib/utimecmp.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f602805edcb41bf216811616bd42cad2")
!729 = !{!730}
!730 = !DIEnumerator(name: "UTIMECMP_TRUNCATE_SOURCE", value: 1)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "savedir_option", file: !732, line: 37, baseType: !137, size: 32, elements: !733)
!732 = !DIFile(filename: "./lib/savedir.h", directory: "/src", checksumkind: CSK_MD5, checksum: "f2bb9be9f16e0215620cf0d56009bad4")
!733 = !{!734, !735, !736, !737}
!734 = !DIEnumerator(name: "SAVEDIR_SORT_NONE", value: 0)
!735 = !DIEnumerator(name: "SAVEDIR_SORT_NAME", value: 1)
!736 = !DIEnumerator(name: "SAVEDIR_SORT_INODE", value: 2)
!737 = !DIEnumerator(name: "SAVEDIR_SORT_FASTREAD", value: 2)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_debug_val", file: !144, line: 305, baseType: !137, size: 32, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746}
!740 = !DIEnumerator(name: "COPY_DEBUG_UNKNOWN", value: 0)
!741 = !DIEnumerator(name: "COPY_DEBUG_NO", value: 1)
!742 = !DIEnumerator(name: "COPY_DEBUG_YES", value: 2)
!743 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL", value: 3)
!744 = !DIEnumerator(name: "COPY_DEBUG_EXTERNAL_INTERNAL", value: 4)
!745 = !DIEnumerator(name: "COPY_DEBUG_AVOIDED", value: 5)
!746 = !DIEnumerator(name: "COPY_DEBUG_UNSUPPORTED", value: 6)
!747 = !{!137, !231, !235, !238}
!748 = !{!749, !715, !751, !718, !753, !761, !723, !763, !765, !770, !772, !775, !780, !785, !787, !792, !794, !796, !798, !800, !802, !804, !806, !808, !813, !815, !820, !822, !824, !826, !828, !830, !832, !834, !836, !838, !840, !842, !844, !849, !854, !856, !858, !861, !863, !868, !870, !872, !874, !876, !878, !880, !885, !890, !892, !894, !899, !901, !903, !905, !907, !912, !914, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !948, !950, !952, !954, !956, !958, !960, !962, !964, !966, !971, !973}
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !717, line: 591, type: !103, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !717, line: 621, type: !510, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "mask", scope: !755, file: !717, line: 2890, type: !758, isLocal: true, isDefinition: true)
!755 = distinct !DISubprogram(name: "cached_umask", scope: !717, file: !717, line: 2888, type: !756, scopeLine: 2889, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !725, retainedNodes: !760)
!756 = !DISubroutineType(types: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !601, line: 69, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !366, line: 150, baseType: !137)
!760 = !{}
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "cached", scope: !755, file: !717, line: 2891, type: !326, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "top_level_dst_name", scope: !725, file: !717, line: 129, type: !236, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2779, type: !767, isLocal: true, isDefinition: true)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 440, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 55)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2779, type: !529, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2779, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 368, elements: !671)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2780, type: !777, isLocal: true, isDefinition: true)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 880, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 110)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2781, type: !782, isLocal: true, isDefinition: true)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 928, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 116)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2782, type: !245, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2783, type: !789, isLocal: true, isDefinition: true)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 584, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 73)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1643, type: !413, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1673, type: !459, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1681, type: !454, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1681, type: !491, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1706, type: !663, isLocal: true, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1780, type: !255, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1870, type: !292, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1872, type: !265, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1885, type: !810, isLocal: true, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 52)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1885, type: !810, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1906, type: !817, isLocal: true, isDefinition: true)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 43)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1934, type: !103, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1935, type: !510, isLocal: true, isDefinition: true)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1961, type: !292, isLocal: true, isDefinition: true)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1978, type: !292, isLocal: true, isDefinition: true)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1983, type: !265, isLocal: true, isDefinition: true)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2008, type: !663, isLocal: true, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2020, type: !250, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2091, type: !656, isLocal: true, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2100, type: !49, isLocal: true, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2128, type: !656, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2157, type: !297, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2158, type: !292, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2195, type: !846, isLocal: true, isDefinition: true)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 376, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 47)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2239, type: !851, isLocal: true, isDefinition: true)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 26)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2252, type: !297, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2257, type: !277, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2276, type: !860, isLocal: true, isDefinition: true)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !640)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2284, type: !270, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2319, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 36)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2340, type: !505, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2363, type: !505, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2382, type: !491, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2445, type: !54, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2456, type: !675, isLocal: true, isDefinition: true)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2514, type: !491, isLocal: true, isDefinition: true)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2523, type: !882, isLocal: true, isDefinition: true)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 30)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2534, type: !887, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 29)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2561, type: !614, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2579, type: !865, isLocal: true, isDefinition: true)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2595, type: !896, isLocal: true, isDefinition: true)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 25)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2651, type: !123, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2737, type: !882, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2765, type: !297, isLocal: true, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !717, line: 2769, type: !277, isLocal: true, isDefinition: true)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1562, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 33)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1492, type: !128, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1492, type: !916, isLocal: true, isDefinition: true)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 800, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 100)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1422, type: !656, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1422, type: !663, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1433, type: !708, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1512, type: !260, isLocal: true, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !717, line: 397, type: !292, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !717, line: 754, type: !505, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !717, line: 760, type: !270, isLocal: true, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !717, line: 769, type: !14, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !717, line: 978, type: !454, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !717, line: 999, type: !882, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1135, type: !708, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "copy_debug", scope: !725, file: !717, line: 132, type: !943, isLocal: true, isDefinition: true)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "copy_debug", file: !144, line: 317, size: 96, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "offload", scope: !943, file: !144, line: 319, baseType: !738, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "reflink", scope: !943, file: !144, line: 320, baseType: !738, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sparse_detection", scope: !943, file: !144, line: 321, baseType: !738, size: 32, offset: 64)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !717, line: 692, type: !505, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !717, line: 173, type: !93, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !717, line: 139, type: !19, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !717, line: 140, type: !403, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(scope: null, file: !717, line: 141, type: !435, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !717, line: 142, type: !265, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !717, line: 143, type: !435, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !717, line: 157, type: !408, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !717, line: 158, type: !118, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !717, line: 159, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 18)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !717, line: 1521, type: !810, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !717, line: 510, type: !255, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !978, line: 554, type: !270, isLocal: true, isDefinition: true)
!978 = !DIFile(filename: "src/copy-file-data.c", directory: "/src", checksumkind: CSK_MD5, checksum: "10bf938861a2599d1da9956990f9d55d")
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !978, line: 633, type: !297, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !978, line: 639, type: !491, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !978, line: 409, type: !292, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !978, line: 177, type: !538, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !978, line: 203, type: !292, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !978, line: 247, type: !292, isLocal: true, isDefinition: true)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(scope: null, file: !978, line: 258, type: !297, isLocal: true, isDefinition: true)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "src_to_dest", scope: !995, file: !996, line: 45, type: !1002, isLocal: true, isDefinition: true)
!995 = distinct !DICompileUnit(language: DW_LANG_C11, file: !996, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !997, globals: !1001, splitDebugInlining: false, nameTableKind: None)
!996 = !DIFile(filename: "src/cp-hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e1cbaa8dd82131aad9d092a28cc0016")
!997 = !{!231, !230, !998}
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !999, line: 102, baseType: !1000)
!999 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !366, line: 73, baseType: !235)
!1001 = !{!993}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_table", file: !1004, line: 56, baseType: !1005)
!1004 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "hash_table", file: !1004, line: 54, flags: DIFlagFwdDecl)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "simple_pattern", scope: !1008, file: !1009, line: 38, type: !1018, isLocal: true, isDefinition: true)
!1008 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1009, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1010, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1009 = !DIFile(filename: "src/force-link.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b907a62e6aed43af174fe983aea85ee1")
!1010 = !{!1011, !1014}
!1011 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1009, line: 39, baseType: !137, size: 32, elements: !1012)
!1012 = !{!1013}
!1013 = !DIEnumerator(name: "x_suffix_len", value: 6)
!1014 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1009, line: 44, baseType: !137, size: 32, elements: !1015)
!1015 = !{!1016}
!1016 = !DIEnumerator(name: "smallsize", value: 256)
!1017 = !{!1006}
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 72, elements: !251)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !1021, line: 3, type: !459, isLocal: true, isDefinition: true)
!1021 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "Version", scope: !1024, file: !1021, line: 3, type: !236, isLocal: false, isDefinition: true)
!1024 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1021, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!1025 = !{!1019, !1022}
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 51, type: !19, isLocal: true, isDefinition: true)
!1028 = !DIFile(filename: "lib/copy-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d19480c78a0966338b5bf17d8ed286c6")
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 55, type: !430, isLocal: true, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(scope: null, file: !1028, line: 55, type: !882, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(scope: null, file: !1035, line: 46, type: !430, isLocal: true, isDefinition: true)
!1035 = !DIFile(filename: "lib/set-acl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "722ad1ac2f97374f03af732c9ad7cf42")
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !1035, line: 46, type: !505, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 141, type: !430, isLocal: true, isDefinition: true)
!1040 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 141, type: !505, isLocal: true, isDefinition: true)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 142, type: !887, isLocal: true, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 160, type: !277, isLocal: true, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 165, type: !435, isLocal: true, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1040, line: 170, type: !396, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "simple_backup_suffix", scope: !1053, file: !1054, line: 77, type: !236, isLocal: false, isDefinition: true)
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1055, retainedTypes: !1118, globals: !1119, splitDebugInlining: false, nameTableKind: None)
!1054 = !DIFile(filename: "lib/backupfile.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d80c7bac43057afe2488869169d2a407")
!1055 = !{!135, !1056, !1088, !1094}
!1056 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1057, file: !1054, line: 325, baseType: !137, size: 32, elements: !1086)
!1057 = distinct !DISubprogram(name: "backupfile_internal", scope: !1054, file: !1054, line: 312, type: !1058, scopeLine: 314, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1053, retainedNodes: !1060)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!230, !181, !236, !135, !326}
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1069, !1070, !1071, !1072, !1073, !1074, !1079, !1080, !1081, !1083, !1084, !1085}
!1061 = !DILocalVariable(name: "dir_fd", arg: 1, scope: !1057, file: !1054, line: 312, type: !181)
!1062 = !DILocalVariable(name: "file", arg: 2, scope: !1057, file: !1054, line: 312, type: !236)
!1063 = !DILocalVariable(name: "backup_type", arg: 3, scope: !1057, file: !1054, line: 313, type: !135)
!1064 = !DILocalVariable(name: "rename", arg: 4, scope: !1057, file: !1054, line: 313, type: !326)
!1065 = !DILocalVariable(name: "base_offset", scope: !1057, file: !1054, line: 315, type: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1067, line: 130, baseType: !1068)
!1067 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !234, line: 35, baseType: !367)
!1069 = !DILocalVariable(name: "filelen", scope: !1057, file: !1054, line: 316, type: !1066)
!1070 = !DILocalVariable(name: "simple_backup_suffix_size", scope: !1057, file: !1054, line: 323, type: !1066)
!1071 = !DILocalVariable(name: "backup_suffix_size_guess", scope: !1057, file: !1054, line: 324, type: !1066)
!1072 = !DILocalVariable(name: "ssize", scope: !1057, file: !1054, line: 329, type: !1066)
!1073 = !DILocalVariable(name: "s", scope: !1057, file: !1054, line: 330, type: !230)
!1074 = !DILocalVariable(name: "dirp", scope: !1057, file: !1054, line: 334, type: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1077, line: 127, baseType: !1078)
!1077 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1077, line: 127, flags: DIFlagFwdDecl)
!1079 = !DILocalVariable(name: "sdir", scope: !1057, file: !1054, line: 335, type: !181)
!1080 = !DILocalVariable(name: "base_max", scope: !1057, file: !1054, line: 336, type: !1066)
!1081 = !DILocalVariable(name: "extended", scope: !1082, file: !1054, line: 339, type: !326)
!1082 = distinct !DILexicalBlock(scope: !1057, file: !1054, line: 338, column: 5)
!1083 = !DILocalVariable(name: "offset", scope: !1082, file: !1054, line: 375, type: !1066)
!1084 = !DILocalVariable(name: "flags", scope: !1082, file: !1054, line: 376, type: !137)
!1085 = !DILocalVariable(name: "saved_errno", scope: !1082, file: !1054, line: 379, type: !181)
!1086 = !{!1087}
!1087 = !DIEnumerator(name: "GUESS", value: 9)
!1088 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "numbered_backup_result", file: !1054, line: 171, baseType: !137, size: 32, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIEnumerator(name: "BACKUP_IS_SAME_LENGTH", value: 0)
!1091 = !DIEnumerator(name: "BACKUP_IS_LONGER", value: 1)
!1092 = !DIEnumerator(name: "BACKUP_IS_NEW", value: 2)
!1093 = !DIEnumerator(name: "BACKUP_NOMEM", value: 3)
!1094 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1095, line: 24, baseType: !137, size: 32, elements: !1096)
!1095 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/confname.h", directory: "", checksumkind: CSK_MD5, checksum: "78b98c9476f9b4c41f6f4ea6bcb3195f")
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117}
!1097 = !DIEnumerator(name: "_PC_LINK_MAX", value: 0)
!1098 = !DIEnumerator(name: "_PC_MAX_CANON", value: 1)
!1099 = !DIEnumerator(name: "_PC_MAX_INPUT", value: 2)
!1100 = !DIEnumerator(name: "_PC_NAME_MAX", value: 3)
!1101 = !DIEnumerator(name: "_PC_PATH_MAX", value: 4)
!1102 = !DIEnumerator(name: "_PC_PIPE_BUF", value: 5)
!1103 = !DIEnumerator(name: "_PC_CHOWN_RESTRICTED", value: 6)
!1104 = !DIEnumerator(name: "_PC_NO_TRUNC", value: 7)
!1105 = !DIEnumerator(name: "_PC_VDISABLE", value: 8)
!1106 = !DIEnumerator(name: "_PC_SYNC_IO", value: 9)
!1107 = !DIEnumerator(name: "_PC_ASYNC_IO", value: 10)
!1108 = !DIEnumerator(name: "_PC_PRIO_IO", value: 11)
!1109 = !DIEnumerator(name: "_PC_SOCK_MAXBUF", value: 12)
!1110 = !DIEnumerator(name: "_PC_FILESIZEBITS", value: 13)
!1111 = !DIEnumerator(name: "_PC_REC_INCR_XFER_SIZE", value: 14)
!1112 = !DIEnumerator(name: "_PC_REC_MAX_XFER_SIZE", value: 15)
!1113 = !DIEnumerator(name: "_PC_REC_MIN_XFER_SIZE", value: 16)
!1114 = !DIEnumerator(name: "_PC_REC_XFER_ALIGN", value: 17)
!1115 = !DIEnumerator(name: "_PC_ALLOC_SIZE_MIN", value: 18)
!1116 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!1117 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!1118 = !{!231, !137, !326}
!1119 = !{!1051, !1120, !1122, !1124, !1126}
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 86, type: !277, isLocal: true, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 87, type: !413, isLocal: true, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 225, type: !413, isLocal: true, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 230, type: !396, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "backup_types", scope: !1130, file: !1131, line: 53, type: !1158, isLocal: true, isDefinition: true)
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1131, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1132, retainedTypes: !1133, globals: !1134, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/backup-find.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3f359c23ab3cfe916b3fbf76e026681")
!1132 = !{!135}
!1133 = !{!231, !228}
!1134 = !{!1135, !1137, !1128, !1139, !1141, !1143, !1145, !1147, !1149, !1151, !1153, !1155}
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 92, type: !292, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 92, type: !270, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 46, type: !396, isLocal: true, isDefinition: true)
!1141 = !DIGlobalVariableExpression(var: !1142, expr: !DIExpression())
!1142 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 46, type: !403, isLocal: true, isDefinition: true)
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 47, type: !430, isLocal: true, isDefinition: true)
!1145 = !DIGlobalVariableExpression(var: !1146, expr: !DIExpression())
!1146 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 47, type: !408, isLocal: true, isDefinition: true)
!1147 = !DIGlobalVariableExpression(var: !1148, expr: !DIExpression())
!1148 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 48, type: !250, isLocal: true, isDefinition: true)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 48, type: !403, isLocal: true, isDefinition: true)
!1151 = !DIGlobalVariableExpression(var: !1152, expr: !DIExpression())
!1152 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 49, type: !250, isLocal: true, isDefinition: true)
!1153 = !DIGlobalVariableExpression(var: !1154, expr: !DIExpression())
!1154 = distinct !DIGlobalVariable(scope: null, file: !1131, line: 49, type: !413, isLocal: true, isDefinition: true)
!1155 = !DIGlobalVariableExpression(var: !1156, expr: !DIExpression())
!1156 = distinct !DIGlobalVariable(name: "backup_args", scope: !1130, file: !1131, line: 42, type: !1157, isLocal: true, isDefinition: true)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 576, elements: !251)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 256, elements: !436)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!1160 = !DIGlobalVariableExpression(var: !1161, expr: !DIExpression())
!1161 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !1162, file: !1040, line: 65, type: !1166, isLocal: false, isDefinition: true)
!1162 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1040, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1163, retainedTypes: !1164, globals: !1165, splitDebugInlining: false, nameTableKind: None)
!1163 = !{!185}
!1164 = !{!231, !236, !238}
!1165 = !{!1160, !1038, !1041, !1043, !1045, !1047, !1049}
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !1167, line: 69, baseType: !1168)
!1167 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null}
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(name: "file_name", scope: !1173, file: !1174, line: 36, type: !236, isLocal: true, isDefinition: true)
!1173 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1174, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1175, splitDebugInlining: false, nameTableKind: None)
!1174 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!1175 = !{!1176, !1178, !1180, !1182, !1171}
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(scope: null, file: !1174, line: 99, type: !430, isLocal: true, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(scope: null, file: !1174, line: 99, type: !708, isLocal: true, isDefinition: true)
!1180 = !DIGlobalVariableExpression(var: !1181, expr: !DIExpression())
!1181 = distinct !DIGlobalVariable(scope: null, file: !1174, line: 101, type: !430, isLocal: true, isDefinition: true)
!1182 = !DIGlobalVariableExpression(var: !1183, expr: !DIExpression())
!1183 = distinct !DIGlobalVariable(scope: null, file: !1174, line: 104, type: !19, isLocal: true, isDefinition: true)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(name: "file_name", scope: !1186, file: !1187, line: 45, type: !236, isLocal: true, isDefinition: true)
!1186 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1187, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1188, splitDebugInlining: false, nameTableKind: None)
!1187 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!1188 = !{!1189, !1191, !1193, !1195, !1184, !1197}
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(scope: null, file: !1187, line: 121, type: !430, isLocal: true, isDefinition: true)
!1191 = !DIGlobalVariableExpression(var: !1192, expr: !DIExpression())
!1192 = distinct !DIGlobalVariable(scope: null, file: !1187, line: 121, type: !265, isLocal: true, isDefinition: true)
!1193 = !DIGlobalVariableExpression(var: !1194, expr: !DIExpression())
!1194 = distinct !DIGlobalVariable(scope: null, file: !1187, line: 123, type: !430, isLocal: true, isDefinition: true)
!1195 = !DIGlobalVariableExpression(var: !1196, expr: !DIExpression())
!1196 = distinct !DIGlobalVariable(scope: null, file: !1187, line: 126, type: !19, isLocal: true, isDefinition: true)
!1197 = !DIGlobalVariableExpression(var: !1198, expr: !DIExpression())
!1198 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !1186, file: !1187, line: 55, type: !326, isLocal: true, isDefinition: true)
!1199 = !DIGlobalVariableExpression(var: !1200, expr: !DIExpression())
!1200 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !1201, file: !1202, line: 66, type: !1168, isLocal: false, isDefinition: true)
!1201 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1202, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1203, globals: !1204, splitDebugInlining: false, nameTableKind: None)
!1202 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!1203 = !{!231, !238}
!1204 = !{!1205, !1207, !1232, !1234, !1236, !1238, !1199, !1240, !1242, !1244, !1246, !1248}
!1205 = !DIGlobalVariableExpression(var: !1206, expr: !DIExpression())
!1206 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 272, type: !396, isLocal: true, isDefinition: true)
!1207 = !DIGlobalVariableExpression(var: !1208, expr: !DIExpression())
!1208 = distinct !DIGlobalVariable(name: "old_file_name", scope: !1209, file: !1202, line: 304, type: !236, isLocal: true, isDefinition: true)
!1209 = distinct !DISubprogram(name: "verror_at_line", scope: !1202, file: !1202, line: 298, type: !1210, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1201, retainedNodes: !1225)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{null, !181, !181, !236, !137, !236, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1213, line: 52, baseType: !1214)
!1213 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1215, line: 14, baseType: !1216)
!1215 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1217, baseType: !1218)
!1217 = !DIFile(filename: "lib/error.c", directory: "/src")
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1218, file: !1217, baseType: !231, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1218, file: !1217, baseType: !231, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1218, file: !1217, baseType: !231, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1218, file: !1217, baseType: !181, size: 32, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1218, file: !1217, baseType: !181, size: 32, offset: 224)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231}
!1226 = !DILocalVariable(name: "status", arg: 1, scope: !1209, file: !1202, line: 298, type: !181)
!1227 = !DILocalVariable(name: "errnum", arg: 2, scope: !1209, file: !1202, line: 298, type: !181)
!1228 = !DILocalVariable(name: "file_name", arg: 3, scope: !1209, file: !1202, line: 298, type: !236)
!1229 = !DILocalVariable(name: "line_number", arg: 4, scope: !1209, file: !1202, line: 298, type: !137)
!1230 = !DILocalVariable(name: "message", arg: 5, scope: !1209, file: !1202, line: 298, type: !236)
!1231 = !DILocalVariable(name: "args", arg: 6, scope: !1209, file: !1202, line: 298, type: !1212)
!1232 = !DIGlobalVariableExpression(var: !1233, expr: !DIExpression())
!1233 = distinct !DIGlobalVariable(name: "old_line_number", scope: !1209, file: !1202, line: 305, type: !137, isLocal: true, isDefinition: true)
!1234 = !DIGlobalVariableExpression(var: !1235, expr: !DIExpression())
!1235 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 338, type: !403, isLocal: true, isDefinition: true)
!1236 = !DIGlobalVariableExpression(var: !1237, expr: !DIExpression())
!1237 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 346, type: !435, isLocal: true, isDefinition: true)
!1238 = !DIGlobalVariableExpression(var: !1239, expr: !DIExpression())
!1239 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 346, type: !413, isLocal: true, isDefinition: true)
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(name: "error_message_count", scope: !1201, file: !1202, line: 69, type: !137, isLocal: false, isDefinition: true)
!1242 = !DIGlobalVariableExpression(var: !1243, expr: !DIExpression())
!1243 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !1201, file: !1202, line: 295, type: !181, isLocal: false, isDefinition: true)
!1244 = !DIGlobalVariableExpression(var: !1245, expr: !DIExpression())
!1245 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 208, type: !430, isLocal: true, isDefinition: true)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 208, type: !277, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(scope: null, file: !1202, line: 214, type: !396, isLocal: true, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(scope: null, file: !1252, line: 30, type: !430, isLocal: true, isDefinition: true)
!1252 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!1253 = !DIGlobalVariableExpression(var: !1254, expr: !DIExpression())
!1254 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 399, type: !413, isLocal: true, isDefinition: true)
!1255 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!1256 = !DIGlobalVariableExpression(var: !1257, expr: !DIExpression())
!1257 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 441, type: !113, isLocal: true, isDefinition: true)
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !1255, line: 1080, type: !19, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 226, type: !123, isLocal: true, isDefinition: true)
!1262 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 227, type: !123, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
!1266 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 228, type: !909, isLocal: true, isDefinition: true)
!1267 = !DIGlobalVariableExpression(var: !1268, expr: !DIExpression())
!1268 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 231, type: !123, isLocal: true, isDefinition: true)
!1269 = !DIGlobalVariableExpression(var: !1270, expr: !DIExpression())
!1270 = distinct !DIGlobalVariable(name: "default_tuning", scope: !1271, file: !1262, line: 134, type: !1275, isLocal: true, isDefinition: true)
!1271 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1262, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1272, globals: !1274, splitDebugInlining: false, nameTableKind: None)
!1272 = !{!235, !231, !1273, !233}
!1273 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1274 = !{!1260, !1263, !1265, !1267, !1269}
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !1004, line: 52, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !1004, line: 40, size: 160, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !1277, file: !1004, line: 45, baseType: !1273, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !1277, file: !1004, line: 46, baseType: !1273, size: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !1277, file: !1004, line: 47, baseType: !1273, size: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !1277, file: !1004, line: 48, baseType: !1273, size: 32, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !1277, file: !1004, line: 49, baseType: !326, size: 8, offset: 128)
!1284 = !DIGlobalVariableExpression(var: !1285, expr: !DIExpression())
!1285 = distinct !DIGlobalVariable(name: "program_name", scope: !1286, file: !1287, line: 31, type: !236, isLocal: false, isDefinition: true)
!1286 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1287, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1288, globals: !1289, splitDebugInlining: false, nameTableKind: None)
!1287 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1288 = !{!230}
!1289 = !{!1284, !1290, !1292}
!1290 = !DIGlobalVariableExpression(var: !1291, expr: !DIExpression())
!1291 = distinct !DIGlobalVariable(scope: null, file: !1287, line: 46, type: !435, isLocal: true, isDefinition: true)
!1292 = !DIGlobalVariableExpression(var: !1293, expr: !DIExpression())
!1293 = distinct !DIGlobalVariable(scope: null, file: !1287, line: 49, type: !403, isLocal: true, isDefinition: true)
!1294 = !DIGlobalVariableExpression(var: !1295, expr: !DIExpression())
!1295 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1296, file: !1297, line: 46, type: !1324, isLocal: true, isDefinition: true)
!1296 = distinct !DISubprogram(name: "proper_name_lite", scope: !1297, file: !1297, line: 38, type: !1298, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1300, retainedNodes: !1302)
!1297 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!236, !236, !236}
!1300 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1297, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1301, splitDebugInlining: false, nameTableKind: None)
!1301 = !{!1294}
!1302 = !{!1303, !1304, !1305, !1306, !1311}
!1303 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1296, file: !1297, line: 38, type: !236)
!1304 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1296, file: !1297, line: 38, type: !236)
!1305 = !DILocalVariable(name: "translation", scope: !1296, file: !1297, line: 40, type: !236)
!1306 = !DILocalVariable(name: "w", scope: !1296, file: !1297, line: 47, type: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1308, line: 37, baseType: !1309)
!1308 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !366, line: 57, baseType: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !366, line: 42, baseType: !137)
!1311 = !DILocalVariable(name: "mbs", scope: !1296, file: !1297, line: 48, type: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1313, line: 6, baseType: !1314)
!1313 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1315, line: 21, baseType: !1316)
!1315 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1315, line: 13, size: 64, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1316, file: !1315, line: 15, baseType: !181, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1316, file: !1315, line: 20, baseType: !1320, size: 32, offset: 32)
!1320 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1316, file: !1315, line: 16, size: 32, elements: !1321)
!1321 = !{!1322, !1323}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1320, file: !1315, line: 18, baseType: !137, size: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1320, file: !1315, line: 19, baseType: !403, size: 32)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 16, elements: !414)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 78, type: !435, isLocal: true, isDefinition: true)
!1327 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1328 = !DIGlobalVariableExpression(var: !1329, expr: !DIExpression())
!1329 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 79, type: !408, isLocal: true, isDefinition: true)
!1330 = !DIGlobalVariableExpression(var: !1331, expr: !DIExpression())
!1331 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 80, type: !128, isLocal: true, isDefinition: true)
!1332 = !DIGlobalVariableExpression(var: !1333, expr: !DIExpression())
!1333 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 81, type: !128, isLocal: true, isDefinition: true)
!1334 = !DIGlobalVariableExpression(var: !1335, expr: !DIExpression())
!1335 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 82, type: !297, isLocal: true, isDefinition: true)
!1336 = !DIGlobalVariableExpression(var: !1337, expr: !DIExpression())
!1337 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 83, type: !413, isLocal: true, isDefinition: true)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 84, type: !435, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 85, type: !430, isLocal: true, isDefinition: true)
!1342 = !DIGlobalVariableExpression(var: !1343, expr: !DIExpression())
!1343 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 86, type: !430, isLocal: true, isDefinition: true)
!1344 = !DIGlobalVariableExpression(var: !1345, expr: !DIExpression())
!1345 = distinct !DIGlobalVariable(scope: null, file: !1327, line: 87, type: !435, isLocal: true, isDefinition: true)
!1346 = !DIGlobalVariableExpression(var: !1347, expr: !DIExpression())
!1347 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1348, file: !1327, line: 76, type: !1420, isLocal: false, isDefinition: true)
!1348 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1327, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1349, retainedTypes: !1355, globals: !1356, splitDebugInlining: false, nameTableKind: None)
!1349 = !{!185, !1350, !199}
!1350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !186, line: 254, baseType: !137, size: 32, elements: !1351)
!1351 = !{!1352, !1353, !1354}
!1352 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1353 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1354 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1355 = !{!181, !232, !233}
!1356 = !{!1325, !1328, !1330, !1332, !1334, !1336, !1338, !1340, !1342, !1344, !1346, !1357, !1361, !1371, !1373, !1378, !1380, !1382, !1384, !1386, !1409, !1416, !1418}
