; ModuleID = 'src/nl.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.linebuffer = type { i64, i64, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [FILE]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [62 x i8] c"Write each FILE to standard output, with line numbers added.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [3 x i8] c"nl\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [70 x i8] c"  -b, --body-numbering=STYLE      use STYLE for numbering body lines\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [70 x i8] c"  -d, --section-delimiter=CC      use CC for logical page delimiters\0A\00", align 1, !dbg !27

!185 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !{!0, !7, !12, !17, !22, !27, !29, !34, !36, !38, !43, !48, !50, !52, !57, !62, !67, !69, !74, !79, !84, !89, !94, !99, !188, !193, !195, !197, !202, !207, !209, !214, !216, !218, !220, !225, !230, !235, !237, !242, !244, !246, !270, !272, !274, !279, !281, !283, !285, !287, !289, !291, !303, !309, !311, !316, !318, !398, !403, !405, !410, !415, !417, !419, !421, !423, !425, !427, !429, !434, !439, !441, !443, !445, !447, !449, !451, !456, !461, !466, !471, !473, !475, !477, !479, !481, !483, !485, !487, !489, !494, !499, !504, !506, !508, !510, !515, !517, !519, !521, !523, !528, !530, !535, !537, !104, !539, !541, !543, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !565, !568, !570, !573, !575, !577, !582, !584, !586, !588, !590, !593, !595, !597, !607, !609, !611}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 521, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 35)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 529, type: !9, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 537, type: !190, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(scope: null, file: !2, line: 544, type: !199, isLocal: true, isDefinition: true)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 29)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !2, line: 549, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 30)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(scope: null, file: !2, line: 556, type: !190, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 564, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 568, type: !19, isLocal: true, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 570, type: !19, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !2, line: 572, type: !19, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !2, line: 576, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 34)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !2, line: 591, type: !227, isLocal: true, isDefinition: true)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !232, isLocal: true, isDefinition: true)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 14)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !232, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !2, line: 604, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 16)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(scope: null, file: !2, line: 643, type: !227, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "current_type", scope: !106, file: !2, line: 75, type: !183, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "body_regex", scope: !106, file: !2, line: 78, type: !248, isLocal: true, isDefinition: true)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !249, line: 413, size: 512, elements: !250)
!249 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!250 = !{!251, !254, !256, !257, !259, !260, !262, !263, !264, !265, !266, !267, !268, !269}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !248, file: !249, line: 417, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !249, line: 417, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !248, file: !249, line: 420, baseType: !255, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !249, line: 56, baseType: !182)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !248, file: !249, line: 423, baseType: !255, size: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !248, file: !249, line: 426, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !249, line: 71, baseType: !182)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !248, file: !249, line: 431, baseType: !177, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !248, file: !249, line: 437, baseType: !261, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !248, file: !249, line: 440, baseType: !180, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !248, file: !249, line: 446, baseType: !110, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !248, file: !249, line: 457, baseType: !110, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !248, file: !249, line: 461, baseType: !110, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !248, file: !249, line: 465, baseType: !110, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !248, file: !249, line: 469, baseType: !110, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !248, file: !249, line: 472, baseType: !110, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !248, file: !249, line: 475, baseType: !110, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "header_regex", scope: !106, file: !2, line: 81, type: !248, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "footer_regex", scope: !106, file: !2, line: 84, type: !248, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "body_fastmap", scope: !106, file: !2, line: 87, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "header_fastmap", scope: !106, file: !2, line: 88, type: !276, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "footer_fastmap", scope: !106, file: !2, line: 89, type: !276, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "section_del_len", scope: !106, file: !2, line: 101, type: !180, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "header_del_len", scope: !106, file: !2, line: 107, type: !180, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "body_del_len", scope: !106, file: !2, line: 113, type: !180, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "footer_del_len", scope: !106, file: !2, line: 119, type: !180, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "line_buf", scope: !106, file: !2, line: 122, type: !293, isLocal: true, isDefinition: true)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linebuffer", file: !294, line: 32, size: 192, elements: !295)
!294 = !DIFile(filename: "./lib/linebuffer.h", directory: "/src", checksumkind: CSK_MD5, checksum: "a0b4e97fdade8fc6fdf94c5a34c83419")
!295 = !{!296, !301, !302}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !294, line: 34, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !298, line: 130, baseType: !299)
!298 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !181, line: 35, baseType: !300)
!300 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !293, file: !294, line: 35, baseType: !297, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !293, file: !294, line: 36, baseType: !177, size: 64, offset: 128)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "line_no", scope: !106, file: !2, line: 146, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !306, line: 101, baseType: !307)
!306 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !308, line: 72, baseType: !300)
!308 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !106, file: !2, line: 152, type: !186, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !117, line: 729, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 56)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !117, line: 736, type: !45, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !320, file: !117, line: 575, type: !118, isLocal: true, isDefinition: true)
!320 = distinct !DISubprogram(name: "oputs_", scope: !117, file: !117, line: 573, type: !321, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !323)
!321 = !DISubroutineType(cc: DW_CC_nocall, types: !322)
!322 = !{null, !183, !183}
!323 = !{!324, !325, !326, !329, !330, !331, !332, !336, !337, !338, !339, !341, !392, !393, !394, !396, !397}
!324 = !DILocalVariable(name: "program", arg: 1, scope: !320, file: !117, line: 573, type: !183)
!325 = !DILocalVariable(name: "option", arg: 2, scope: !320, file: !117, line: 573, type: !183)
!326 = !DILocalVariable(name: "term", scope: !327, file: !117, line: 585, type: !183)
!327 = distinct !DILexicalBlock(scope: !328, file: !117, line: 582, column: 5)
!328 = distinct !DILexicalBlock(scope: !320, file: !117, line: 581, column: 7)
!329 = !DILocalVariable(name: "double_space", scope: !320, file: !117, line: 594, type: !186)
!330 = !DILocalVariable(name: "first_word", scope: !320, file: !117, line: 595, type: !183)
!331 = !DILocalVariable(name: "option_text", scope: !320, file: !117, line: 596, type: !183)
!332 = !DILocalVariable(name: "s", scope: !333, file: !117, line: 608, type: !183)
!333 = distinct !DILexicalBlock(scope: !334, file: !117, line: 605, column: 5)
!334 = distinct !DILexicalBlock(scope: !335, file: !117, line: 604, column: 12)
!335 = distinct !DILexicalBlock(scope: !320, file: !117, line: 597, column: 7)
!336 = !DILocalVariable(name: "spaces", scope: !333, file: !117, line: 609, type: !180)
!337 = !DILocalVariable(name: "anchor_len", scope: !320, file: !117, line: 620, type: !180)
!338 = !DILocalVariable(name: "desc_text", scope: !320, file: !117, line: 625, type: !183)
!339 = !DILocalVariable(name: "__ptr", scope: !340, file: !117, line: 644, type: !183)
!340 = distinct !DILexicalBlock(scope: !320, file: !117, line: 644, column: 3)
!341 = !DILocalVariable(name: "__stream", scope: !340, file: !117, line: 644, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !344, line: 7, baseType: !345)
!344 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !346, line: 49, size: 1728, elements: !347)
!346 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !363, !365, !366, !367, !369, !370, !372, !373, !376, !378, !381, !384, !385, !386, !387, !388}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !345, file: !346, line: 51, baseType: !118, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !345, file: !346, line: 54, baseType: !177, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !345, file: !346, line: 55, baseType: !177, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !345, file: !346, line: 56, baseType: !177, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !345, file: !346, line: 57, baseType: !177, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !345, file: !346, line: 58, baseType: !177, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !345, file: !346, line: 59, baseType: !177, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !345, file: !346, line: 60, baseType: !177, size: 64, offset: 448)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !345, file: !346, line: 61, baseType: !177, size: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !345, file: !346, line: 64, baseType: !177, size: 64, offset: 576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !345, file: !346, line: 65, baseType: !177, size: 64, offset: 640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !345, file: !346, line: 66, baseType: !177, size: 64, offset: 704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !345, file: !346, line: 68, baseType: !361, size: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !346, line: 36, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !345, file: !346, line: 70, baseType: !364, size: 64, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !345, file: !346, line: 72, baseType: !118, size: 32, offset: 896)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !345, file: !346, line: 73, baseType: !118, size: 32, offset: 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !345, file: !346, line: 74, baseType: !368, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !308, line: 152, baseType: !300)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !345, file: !346, line: 77, baseType: !179, size: 16, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !345, file: !346, line: 78, baseType: !371, size: 8, offset: 1040)
!371 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !345, file: !346, line: 79, baseType: !86, size: 8, offset: 1048)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !345, file: !346, line: 81, baseType: !374, size: 64, offset: 1088)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !346, line: 43, baseType: null)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !345, file: !346, line: 89, baseType: !377, size: 64, offset: 1152)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !308, line: 153, baseType: !300)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !345, file: !346, line: 91, baseType: !379, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !346, line: 37, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !345, file: !346, line: 92, baseType: !382, size: 64, offset: 1280)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !346, line: 38, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !345, file: !346, line: 93, baseType: !364, size: 64, offset: 1344)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !345, file: !346, line: 94, baseType: !178, size: 64, offset: 1408)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !345, file: !346, line: 95, baseType: !180, size: 64, offset: 1472)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !345, file: !346, line: 96, baseType: !118, size: 32, offset: 1536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !345, file: !346, line: 98, baseType: !389, size: 160, offset: 1568)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 20)
!392 = !DILocalVariable(name: "__cnt", scope: !340, file: !117, line: 644, type: !180)
!393 = !DILocalVariable(name: "url_program", scope: !320, file: !117, line: 648, type: !183)
!394 = !DILocalVariable(name: "__ptr", scope: !395, file: !117, line: 686, type: !183)
!395 = distinct !DILexicalBlock(scope: !320, file: !117, line: 686, column: 3)
!396 = !DILocalVariable(name: "__stream", scope: !395, file: !117, line: 686, type: !342)
!397 = !DILocalVariable(name: "__cnt", scope: !395, file: !117, line: 686, type: !180)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !117, line: 585, type: !400, isLocal: true, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !117, line: 586, type: !400, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !117, line: 595, type: !407, isLocal: true, isDefinition: true)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 4)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !117, line: 620, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 6)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !117, line: 648, type: !227, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !117, line: 648, type: !400, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !117, line: 649, type: !407, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !117, line: 649, type: !19, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !117, line: 650, type: !400, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !117, line: 651, type: !412, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !117, line: 651, type: !412, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !117, line: 652, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 7)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !117, line: 653, type: !436, isLocal: true, isDefinition: true)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 8)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !117, line: 654, type: !91, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !117, line: 655, type: !91, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !117, line: 656, type: !91, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !117, line: 657, type: !91, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !117, line: 663, type: !431, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !117, line: 664, type: !91, isLocal: true, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !117, line: 669, type: !453, isLocal: true, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 17)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !117, line: 669, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 40)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !117, line: 676, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 15)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !117, line: 676, type: !468, isLocal: true, isDefinition: true)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 61)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !117, line: 679, type: !19, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(scope: null, file: !117, line: 683, type: !400, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !117, line: 688, type: !400, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !117, line: 691, type: !436, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !117, line: 839, type: !239, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !117, line: 840, type: !101, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !117, line: 841, type: !463, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !117, line: 862, type: !407, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !117, line: 868, type: !59, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !117, line: 875, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 27)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !117, line: 877, type: !496, isLocal: true, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 51)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !117, line: 877, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 12)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !453, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !2, line: 157, type: !463, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !453, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 159, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 21)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 160, type: !463, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 161, type: !501, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 162, type: !453, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !453, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 164, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 13)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 165, type: !232, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !532, isLocal: true, isDefinition: true)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 18)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 167, type: !400, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 168, type: !436, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(scope: null, file: !2, line: 287, type: !19, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !227, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "header_type", scope: !106, file: !2, line: 69, type: !183, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !227, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "body_type", scope: !106, file: !2, line: 66, type: !183, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "footer_type", scope: !106, file: !2, line: 72, type: !183, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "starting_line_number", scope: !106, file: !2, line: 128, type: !305, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "page_incr", scope: !106, file: !2, line: 131, type: !305, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "reset_numbers", scope: !106, file: !2, line: 134, type: !186, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "blank_join", scope: !106, file: !2, line: 137, type: !305, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !2, line: 95, type: !227, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "separator_str", scope: !106, file: !2, line: 95, type: !183, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "lineno_width", scope: !106, file: !2, line: 140, type: !118, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "FORMAT_LEFT", scope: !106, file: !2, line: 53, type: !567, isLocal: true, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !437)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "lineno_format", scope: !106, file: !2, line: 143, type: !183, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_NOLZ", scope: !106, file: !2, line: 47, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 56, elements: !432)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "FORMAT_RIGHT_LZ", scope: !106, file: !2, line: 50, type: !567, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "section_del", scope: !106, file: !2, line: 98, type: !177, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "DEFAULT_SECTION_DELIMITERS", scope: !106, file: !2, line: 56, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 9)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "header_del", scope: !106, file: !2, line: 104, type: !177, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "body_del", scope: !106, file: !2, line: 110, type: !177, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "footer_del", scope: !106, file: !2, line: 116, type: !177, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "print_no_line_fmt", scope: !106, file: !2, line: 125, type: !177, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "current_regex", scope: !106, file: !2, line: 92, type: !592, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !2, line: 470, type: !227, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "line_no_overflow", scope: !106, file: !2, line: 149, type: !186, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "blank_lines", scope: !599, file: !2, line: 358, type: !305, isLocal: true, isDefinition: true)
!599 = distinct !DISubprogram(name: "proc_text", scope: !2, file: !2, line: 356, type: !600, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !602)
!600 = !DISubroutineType(types: !601)
!601 = !{null}
!602 = !{!603, !605, !606}
!603 = !DILocalVariable(name: "__ptr", scope: !604, file: !2, line: 401, type: !183)
!604 = distinct !DILexicalBlock(scope: !599, file: !2, line: 401, column: 3)
!605 = !DILocalVariable(name: "__stream", scope: !604, file: !2, line: 401, type: !342)
!606 = !DILocalVariable(name: "__cnt", scope: !604, file: !2, line: 401, type: !180)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 390, type: !190, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !512, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !117, line: 952, type: !501, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 3584, elements: !233)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !616, line: 50, size: 256, elements: !617)
!616 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!617 = !{!618, !619, !620, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !615, file: !616, line: 52, baseType: !183, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !615, file: !616, line: 55, baseType: !118, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !616, line: 56, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !615, file: !616, line: 57, baseType: !118, size: 32, offset: 192)
!623 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!624 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!625 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !628, line: 3, type: !463, isLocal: true, isDefinition: true)
!628 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "Version", scope: !631, file: !628, line: 3, type: !183, isLocal: false, isDefinition: true)
!631 = distinct !DICompileUnit(language: DW_LANG_C11, file: !628, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !632, splitDebugInlining: false, nameTableKind: None)
!632 = !{!626, !629}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "file_name", scope: !635, file: !636, line: 45, type: !183, isLocal: true, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !636, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !637, splitDebugInlining: false, nameTableKind: None)
!636 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!637 = !{!638, !640, !642, !644, !633, !646}
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !636, line: 121, type: !431, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(scope: null, file: !636, line: 121, type: !501, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !636, line: 123, type: !431, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !636, line: 126, type: !19, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !635, file: !636, line: 55, type: !186, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !650, file: !651, line: 66, type: !699, isLocal: false, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C11, file: !651, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !652, globals: !653, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!652 = !{!178, !185}
!653 = !{!654, !656, !681, !683, !685, !687, !648, !689, !691, !693, !695, !697}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(scope: null, file: !651, line: 272, type: !400, isLocal: true, isDefinition: true)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "old_file_name", scope: !658, file: !651, line: 304, type: !183, isLocal: true, isDefinition: true)
!658 = distinct !DISubprogram(name: "verror_at_line", scope: !651, file: !651, line: 298, type: !659, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !650, retainedNodes: !674)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !118, !118, !183, !110, !183, !661}
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !662, line: 52, baseType: !663)
!662 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !664, line: 14, baseType: !665)
!664 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !666, baseType: !667)
!666 = !DIFile(filename: "lib/error.c", directory: "/src")
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !668)
!668 = !{!669, !670, !671, !672, !673}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !667, file: !666, baseType: !178, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !667, file: !666, baseType: !178, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !667, file: !666, baseType: !178, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !667, file: !666, baseType: !118, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !667, file: !666, baseType: !118, size: 32, offset: 224)
!674 = !{!675, !676, !677, !678, !679, !680}
!675 = !DILocalVariable(name: "status", arg: 1, scope: !658, file: !651, line: 298, type: !118)
!676 = !DILocalVariable(name: "errnum", arg: 2, scope: !658, file: !651, line: 298, type: !118)
!677 = !DILocalVariable(name: "file_name", arg: 3, scope: !658, file: !651, line: 298, type: !183)
!678 = !DILocalVariable(name: "line_number", arg: 4, scope: !658, file: !651, line: 298, type: !110)
!679 = !DILocalVariable(name: "message", arg: 5, scope: !658, file: !651, line: 298, type: !183)
!680 = !DILocalVariable(name: "args", arg: 6, scope: !658, file: !651, line: 298, type: !661)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "old_line_number", scope: !658, file: !651, line: 305, type: !110, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !651, line: 338, type: !407, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !651, line: 346, type: !436, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !651, line: 346, type: !227, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "error_message_count", scope: !650, file: !651, line: 69, type: !110, isLocal: false, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !650, file: !651, line: 295, type: !118, isLocal: false, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !651, line: 208, type: !431, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !651, line: 208, type: !512, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !651, line: 214, type: !400, isLocal: true, isDefinition: true)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "program_name", scope: !702, file: !703, line: 31, type: !183, isLocal: false, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C11, file: !703, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !704, globals: !705, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!704 = !{!177}
!705 = !{!700, !706, !708}
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !703, line: 46, type: !436, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !703, line: 49, type: !407, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "utf07FF", scope: !712, file: !713, line: 46, type: !740, isLocal: true, isDefinition: true)
!712 = distinct !DISubprogram(name: "proper_name_lite", scope: !713, file: !713, line: 38, type: !714, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !716, retainedNodes: !718)
!713 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!714 = !DISubroutineType(types: !715)
!715 = !{!183, !183, !183}
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !717, splitDebugInlining: false, nameTableKind: None)
!717 = !{!710}
!718 = !{!719, !720, !721, !722, !727}
!719 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !712, file: !713, line: 38, type: !183)
!720 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !712, file: !713, line: 38, type: !183)
!721 = !DILocalVariable(name: "translation", scope: !712, file: !713, line: 40, type: !183)
!722 = !DILocalVariable(name: "w", scope: !712, file: !713, line: 47, type: !723)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !724, line: 37, baseType: !725)
!724 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !308, line: 57, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !308, line: 42, baseType: !110)
!727 = !DILocalVariable(name: "mbs", scope: !712, file: !713, line: 48, type: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !729, line: 6, baseType: !730)
!729 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !731, line: 21, baseType: !732)
!731 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 13, size: 64, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !732, file: !731, line: 15, baseType: !118, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !732, file: !731, line: 20, baseType: !736, size: 32, offset: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !731, line: 16, size: 32, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !736, file: !731, line: 18, baseType: !110, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !736, file: !731, line: 19, baseType: !407, size: 32)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 16, elements: !228)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !743, line: 78, type: !436, isLocal: true, isDefinition: true)
!743 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !743, line: 79, type: !412, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !743, line: 80, type: !525, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !743, line: 81, type: !525, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !743, line: 82, type: !389, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(scope: null, file: !743, line: 83, type: !227, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !743, line: 84, type: !436, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !743, line: 85, type: !431, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !743, line: 86, type: !431, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !743, line: 87, type: !436, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !764, file: !743, line: 76, type: !833, isLocal: false, isDefinition: true)
!764 = distinct !DICompileUnit(language: DW_LANG_C11, file: !743, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !765, retainedTypes: !771, globals: !772, splitDebugInlining: false, nameTableKind: None)
!765 = !{!147, !766, !122}
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !148, line: 254, baseType: !110, size: 32, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!769 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!770 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!771 = !{!118, !179, !180}
!772 = !{!741, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !773, !777, !787, !789, !791, !793, !795, !797, !799, !822, !829, !831}
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !764, file: !743, line: 92, type: !775, isLocal: false, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 320, elements: !92)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !764, file: !743, line: 1040, type: !779, isLocal: false, isDefinition: true)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !743, line: 56, size: 448, elements: !780)
!780 = !{!781, !782, !783, !785, !786}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !779, file: !743, line: 59, baseType: !147, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !743, line: 62, baseType: !118, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !779, file: !743, line: 66, baseType: !784, size: 256, offset: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 256, elements: !437)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !779, file: !743, line: 69, baseType: !183, size: 64, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !779, file: !743, line: 72, baseType: !183, size: 64, offset: 384)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !764, file: !743, line: 107, type: !779, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "slot0", scope: !764, file: !743, line: 831, type: !276, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !743, line: 321, type: !227, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !743, line: 357, type: !227, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !743, line: 358, type: !227, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !743, line: 199, type: !431, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "quote", scope: !801, file: !743, line: 228, type: !820, isLocal: true, isDefinition: true)
!801 = distinct !DISubprogram(name: "gettext_quote", scope: !743, file: !743, line: 197, type: !802, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !764, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{!183, !183, !147}
!804 = !{!805, !806, !807, !808, !809}
!805 = !DILocalVariable(name: "msgid", arg: 1, scope: !801, file: !743, line: 197, type: !183)
!806 = !DILocalVariable(name: "s", arg: 2, scope: !801, file: !743, line: 197, type: !147)
!807 = !DILocalVariable(name: "translation", scope: !801, file: !743, line: 199, type: !183)
!808 = !DILocalVariable(name: "w", scope: !801, file: !743, line: 229, type: !723)
!809 = !DILocalVariable(name: "mbs", scope: !801, file: !743, line: 230, type: !810)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !729, line: 6, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !731, line: 21, baseType: !812)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 13, size: 64, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !812, file: !731, line: 15, baseType: !118, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !812, file: !731, line: 20, baseType: !816, size: 32, offset: 32)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !812, file: !731, line: 16, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !816, file: !731, line: 18, baseType: !110, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !816, file: !731, line: 19, baseType: !407, size: 32)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !821)
!821 = !{!229, !409}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "slotvec", scope: !764, file: !743, line: 834, type: !824, isLocal: true, isDefinition: true)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !743, line: 823, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !825, file: !743, line: 825, baseType: !180, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !825, file: !743, line: 826, baseType: !177, size: 64, offset: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "nslots", scope: !764, file: !743, line: 832, type: !118, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "slotvec0", scope: !764, file: !743, line: 833, type: !825, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 704, elements: !835)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!835 = !{!836}
!836 = !DISubrange(count: 11)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(scope: null, file: !839, line: 67, type: !501, isLocal: true, isDefinition: true)
!839 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !839, line: 69, type: !431, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !839, line: 83, type: !431, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !839, line: 83, type: !407, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !839, line: 85, type: !227, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !839, line: 88, type: !850, isLocal: true, isDefinition: true)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 171)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(scope: null, file: !839, line: 88, type: !222, isLocal: true, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(scope: null, file: !839, line: 105, type: !239, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(scope: null, file: !839, line: 109, type: !859, isLocal: true, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 23)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !839, line: 113, type: !864, isLocal: true, isDefinition: true)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 28)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !839, line: 120, type: !211, isLocal: true, isDefinition: true)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(scope: null, file: !839, line: 127, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 36)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(scope: null, file: !839, line: 134, type: !458, isLocal: true, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !839, line: 142, type: !878, isLocal: true, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 44)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !839, line: 150, type: !883, isLocal: true, isDefinition: true)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 48)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(scope: null, file: !839, line: 159, type: !888, isLocal: true, isDefinition: true)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 52)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(scope: null, file: !839, line: 170, type: !893, isLocal: true, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 60)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(scope: null, file: !839, line: 248, type: !389, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(scope: null, file: !839, line: 248, type: !101, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(scope: null, file: !839, line: 254, type: !389, isLocal: true, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(scope: null, file: !839, line: 254, type: !232, isLocal: true, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !839, line: 254, type: !458, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !839, line: 259, type: !3, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !839, line: 259, type: !199, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !912, file: !913, line: 26, type: !915, isLocal: false, isDefinition: true)
!912 = distinct !DICompileUnit(language: DW_LANG_C11, file: !913, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !914, splitDebugInlining: false, nameTableKind: None)
!913 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!914 = !{!910}
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 376, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 47)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "exit_failure", scope: !920, file: !921, line: 24, type: !923, isLocal: false, isDefinition: true)
!920 = distinct !DICompileUnit(language: DW_LANG_C11, file: !921, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !922, splitDebugInlining: false, nameTableKind: None)
!921 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!922 = !{!918}
!923 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !926, line: 34, type: !19, isLocal: true, isDefinition: true)
!926 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !926, line: 34, type: !431, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !926, line: 34, type: !453, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(scope: null, file: !933, line: 80, type: !431, isLocal: true, isDefinition: true)
!933 = !DIFile(filename: "./lib/xdectoint.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1bda3f5eeaab6c7dbf872099af51e939")
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !936, line: 108, type: !86, isLocal: true, isDefinition: true)
!936 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "internal_state", scope: !939, file: !936, line: 97, type: !942, isLocal: true, isDefinition: true)
!939 = distinct !DICompileUnit(language: DW_LANG_C11, file: !936, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !940, globals: !941, splitDebugInlining: false, nameTableKind: None)
!940 = !{!178, !180, !185}
!941 = !{!934, !937}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !729, line: 6, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !731, line: 21, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 13, size: 64, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !944, file: !731, line: 15, baseType: !118, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !944, file: !731, line: 20, baseType: !948, size: 32, offset: 32)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !731, line: 16, size: 32, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !948, file: !731, line: 18, baseType: !110, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !948, file: !731, line: 19, baseType: !407, size: 32)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !954, line: 35, type: !227, isLocal: true, isDefinition: true)
!954 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !954, line: 35, type: !412, isLocal: true, isDefinition: true)
!957 = distinct !DICompileUnit(language: DW_LANG_C11, file: !958, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !959, splitDebugInlining: false, nameTableKind: None)
!958 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!959 = !{!161}
!960 = distinct !DICompileUnit(language: DW_LANG_C11, file: !961, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!961 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!962 = distinct !DICompileUnit(language: DW_LANG_C11, file: !963, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!963 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!964 = !{!178}
!965 = distinct !DICompileUnit(language: DW_LANG_C11, file: !966, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!966 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!967 = distinct !DICompileUnit(language: DW_LANG_C11, file: !968, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!968 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!969 = distinct !DICompileUnit(language: DW_LANG_C11, file: !970, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!971 = distinct !DICompileUnit(language: DW_LANG_C11, file: !972, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !973, splitDebugInlining: false, nameTableKind: None)
!972 = !DIFile(filename: "lib/linebuffer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d85d9b8947aefddab7f1bb42f1d43333")
!973 = !{!261}
!974 = distinct !DICompileUnit(language: DW_LANG_C11, file: !839, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !975, retainedTypes: !964, globals: !979, splitDebugInlining: false, nameTableKind: None)
!975 = !{!976}
!976 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 40, baseType: !110, size: 32, elements: !977)
!977 = !{!978}
!978 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!979 = !{!837, !840, !842, !844, !846, !848, !853, !855, !857, !862, !867, !869, !874, !876, !881, !886, !891, !896, !898, !900, !902, !904, !906, !908}
!980 = distinct !DICompileUnit(language: DW_LANG_C11, file: !981, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !982, retainedTypes: !1010, splitDebugInlining: false, nameTableKind: None)
!981 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!982 = !{!983, !995}
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !984, file: !981, line: 188, baseType: !110, size: 32, elements: !993)
!984 = distinct !DISubprogram(name: "x2nrealloc", scope: !981, file: !981, line: 176, type: !985, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !980, retainedNodes: !988)
!985 = !DISubroutineType(types: !986)
!986 = !{!178, !178, !987, !180}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!988 = !{!989, !990, !991, !992}
!989 = !DILocalVariable(name: "p", arg: 1, scope: !984, file: !981, line: 176, type: !178)
!990 = !DILocalVariable(name: "pn", arg: 2, scope: !984, file: !981, line: 176, type: !987)
!991 = !DILocalVariable(name: "s", arg: 3, scope: !984, file: !981, line: 176, type: !180)
!992 = !DILocalVariable(name: "n", scope: !984, file: !981, line: 178, type: !180)
!993 = !{!994}
!994 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!995 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !996, file: !981, line: 228, baseType: !110, size: 32, elements: !993)
!996 = distinct !DISubprogram(name: "xpalloc", scope: !981, file: !981, line: 223, type: !997, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !980, retainedNodes: !1000)
!997 = !DISubroutineType(types: !998)
!998 = !{!178, !178, !999, !297, !299, !297}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!1001 = !DILocalVariable(name: "pa", arg: 1, scope: !996, file: !981, line: 223, type: !178)
!1002 = !DILocalVariable(name: "pn", arg: 2, scope: !996, file: !981, line: 223, type: !999)
!1003 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !996, file: !981, line: 223, type: !297)
!1004 = !DILocalVariable(name: "n_max", arg: 4, scope: !996, file: !981, line: 223, type: !299)
!1005 = !DILocalVariable(name: "s", arg: 5, scope: !996, file: !981, line: 223, type: !297)
!1006 = !DILocalVariable(name: "n0", scope: !996, file: !981, line: 230, type: !297)
!1007 = !DILocalVariable(name: "n", scope: !996, file: !981, line: 237, type: !297)
!1008 = !DILocalVariable(name: "nbytes", scope: !996, file: !981, line: 248, type: !297)
!1009 = !DILocalVariable(name: "adjusted_nbytes", scope: !996, file: !981, line: 252, type: !297)
!1010 = !{!177, !178, !186, !300, !182}
!1011 = distinct !DICompileUnit(language: DW_LANG_C11, file: !926, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!1012 = !{!924, !927, !929}
!1013 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1014, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1015, globals: !1024, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "lib/xdectoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "42ac5dbff69ece7310ee4220582d5072")
!1015 = !{!1016, !108}
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !1017, line: 30, baseType: !110, size: 32, elements: !1018)
!1017 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!1018 = !{!1019, !1020, !1021, !1022, !1023}
!1019 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!1020 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!1021 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!1022 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!1023 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!1024 = !{!931}
!1025 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1026, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1027, retainedTypes: !1028, splitDebugInlining: false, nameTableKind: None)
!1026 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1027 = !{!1016}
!1028 = !{!186, !300, !182, !305}
!1029 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1030, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!1030 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1032, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1033 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1034, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1035, splitDebugInlining: false, nameTableKind: None)
!1034 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1035 = !{!186, !182, !178}
!1036 = distinct !DICompileUnit(language: DW_LANG_C11, file: !954, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1037, splitDebugInlining: false, nameTableKind: None)
!1037 = !{!952, !955}
!1038 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1039, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1039 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1040 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1041, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !964, splitDebugInlining: false, nameTableKind: None)
!1041 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1042 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!1043 = !{i32 7, !"Dwarf Version", i32 5}
!1044 = !{i32 2, !"Debug Info Version", i32 3}
!1045 = !{i32 1, !"wchar_size", i32 4}
!1046 = !{i32 8, !"PIC Level", i32 2}
!1047 = !{i32 7, !"PIE Level", i32 2}
!1048 = !{i32 7, !"uwtable", i32 2}
!1049 = !{i32 7, !"frame-pointer", i32 1}
!1050 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 175, type: !1051, scopeLine: 176, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1053)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{null, !118}
!1053 = !{!1054}
!1054 = !DILocalVariable(name: "status", arg: 1, scope: !1050, file: !2, line: 175, type: !118)
!1055 = !DILocation(line: 0, scope: !1050)
!1056 = !DILocation(line: 177, column: 14, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1050, file: !2, line: 177, column: 7)
!1058 = !DILocation(line: 177, column: 7, scope: !1050)
!1059 = !DILocation(line: 178, column: 5, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !2, line: 178, column: 5)
!1061 = !{!1062, !1062, i64 0}
!1062 = !{!"any pointer", !1063, i64 0}
!1063 = !{!"omnipotent char", !1064, i64 0}
!1064 = !{!"Simple C/C++ TBAA"}
!1065 = !DILocation(line: 181, column: 7, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1057, file: !2, line: 180, column: 5)
!1067 = !DILocation(line: 185, column: 7, scope: !1066)
!1068 = !DILocation(line: 729, column: 3, scope: !1069, inlinedAt: !1071)
!1069 = distinct !DISubprogram(name: "emit_stdin_note", scope: !117, file: !117, line: 727, type: !600, scopeLine: 728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1070)
!1070 = !{}
!1071 = distinct !DILocation(line: 189, column: 7, scope: !1066)
!1072 = !DILocation(line: 736, column: 3, scope: !1073, inlinedAt: !1074)
!1073 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !117, file: !117, line: 734, type: !600, scopeLine: 735, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1070)
!1074 = distinct !DILocation(line: 190, column: 7, scope: !1066)
!1075 = !DILocation(line: 192, column: 7, scope: !1066)
!1076 = !DILocation(line: 195, column: 7, scope: !1066)
!1077 = !DILocation(line: 198, column: 7, scope: !1066)
!1078 = !DILocation(line: 201, column: 7, scope: !1066)
!1079 = !DILocation(line: 204, column: 7, scope: !1066)
!1080 = !DILocation(line: 207, column: 7, scope: !1066)
!1081 = !DILocation(line: 210, column: 7, scope: !1066)
!1082 = !DILocation(line: 213, column: 7, scope: !1066)
!1083 = !DILocation(line: 216, column: 7, scope: !1066)
!1084 = !DILocation(line: 219, column: 7, scope: !1066)
!1085 = !DILocation(line: 222, column: 7, scope: !1066)
!1086 = !DILocation(line: 225, column: 7, scope: !1066)
!1087 = !DILocation(line: 226, column: 7, scope: !1066)
!1088 = !DILocation(line: 227, column: 7, scope: !1066)
!1089 = !DILocation(line: 236, column: 7, scope: !1066)
!1090 = !DILocation(line: 246, column: 7, scope: !1066)
!1091 = !DILocalVariable(name: "program", arg: 1, scope: !1092, file: !117, line: 836, type: !183)
!1092 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !117, file: !117, line: 836, type: !1093, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1095)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !183}
!1095 = !{!1091, !1096, !1103, !1104, !1106, !1107}
!1096 = !DILocalVariable(name: "infomap", scope: !1092, file: !117, line: 838, type: !1097)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 896, elements: !432)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !1092, file: !117, line: 838, size: 128, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !1099, file: !117, line: 838, baseType: !183, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1099, file: !117, line: 838, baseType: !183, size: 64, offset: 64)
!1103 = !DILocalVariable(name: "node", scope: !1092, file: !117, line: 848, type: !183)
!1104 = !DILocalVariable(name: "map_prog", scope: !1092, file: !117, line: 849, type: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1106 = !DILocalVariable(name: "lc_messages", scope: !1092, file: !117, line: 861, type: !183)
!1107 = !DILocalVariable(name: "url_program", scope: !1092, file: !117, line: 874, type: !183)
!1108 = !DILocation(line: 0, scope: !1092, inlinedAt: !1109)
!1109 = distinct !DILocation(line: 255, column: 7, scope: !1066)
!1110 = !DILocation(line: 857, column: 3, scope: !1092, inlinedAt: !1109)
!1111 = !DILocation(line: 861, column: 29, scope: !1092, inlinedAt: !1109)
!1112 = !DILocation(line: 862, column: 7, scope: !1113, inlinedAt: !1109)
!1113 = distinct !DILexicalBlock(scope: !1092, file: !117, line: 862, column: 7)
!1114 = !DILocation(line: 862, column: 19, scope: !1113, inlinedAt: !1109)
!1115 = !DILocation(line: 862, column: 22, scope: !1113, inlinedAt: !1109)
!1116 = !DILocation(line: 862, column: 7, scope: !1092, inlinedAt: !1109)
!1117 = !DILocation(line: 868, column: 7, scope: !1118, inlinedAt: !1109)
!1118 = distinct !DILexicalBlock(scope: !1113, file: !117, line: 863, column: 5)
!1119 = !DILocation(line: 870, column: 5, scope: !1118, inlinedAt: !1109)
!1120 = !DILocation(line: 875, column: 3, scope: !1092, inlinedAt: !1109)
!1121 = !DILocation(line: 877, column: 3, scope: !1092, inlinedAt: !1109)
!1122 = !DILocation(line: 257, column: 3, scope: !1050)
!1123 = !DISubprogram(name: "dcgettext", scope: !1124, file: !1124, line: 51, type: !1125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1070)
!1124 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!177, !183, !183, !118}
!1127 = !DISubprogram(name: "__fprintf_chk", scope: !1128, file: !1128, line: 93, type: !1129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1070)
!1128 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!118, !1131, !118, !1132, null}
!1131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !342)
!1132 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !183)
!1133 = !DISubprogram(name: "__printf_chk", scope: !1128, file: !1128, line: 95, type: !1134, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1070)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!118, !118, !1132, null}
!1136 = !DISubprogram(name: "fputs_unlocked", scope: !662, file: !662, line: 691, type: !1137, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !1070)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!118, !1132, !1131}
!1139 = !DILocation(line: 0, scope: !320)
!1140 = !DILocation(line: 581, column: 7, scope: !328)
!1141 = !{!1142, !1142, i64 0}
!1142 = !{!"int", !1063, i64 0}
!1143 = !DILocation(line: 581, column: 19, scope: !328)
!1144 = !DILocation(line: 581, column: 7, scope: !320)
!1145 = !DILocation(line: 585, column: 26, scope: !327)
!1146 = !DILocation(line: 0, scope: !327)
!1147 = !DILocation(line: 586, column: 23, scope: !327)
!1148 = !DILocation(line: 586, column: 28, scope: !327)
!1149 = !DILocation(line: 586, column: 32, scope: !327)
!1150 = !{!1063, !1063, i64 0}
!1151 = !DILocation(line: 586, column: 38, scope: !327)
!1152 = !DILocalVariable(name: "__s1", arg: 1, scope: !1153, file: !1154, line: 1359, type: !183)
!1153 = distinct !DISubprogram(name: "streq", scope: !1154, file: !1154, line: 1359, type: !1155, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !106, retainedNodes: !1157)
!1154 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!186, !183, !183}
!1157 = !{!1152, !1158}
!1158 = !DILocalVariable(name: "__s2", arg: 2, scope: !1153, file: !1154, line: 1359, type: !183)
!1159 = !DILocation(line: 0, scope: !1153, inlinedAt: !1160)
!1160 = distinct !DILocation(line: 586, column: 41, scope: !327)
!1161 = !DILocation(line: 1361, column: 11, scope: !1153, inlinedAt: !1160)
!1162 = !DILocation(line: 1361, column: 10, scope: !1153, inlinedAt: !1160)
!1163 = !DILocation(line: 586, column: 19, scope: !327)
!1164 = !DILocation(line: 587, column: 5, scope: !327)
!1165 = !DILocation(line: 588, column: 7, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !320, file: !117, line: 588, column: 7)
!1167 = !DILocation(line: 588, column: 7, scope: !320)
!1168 = !DILocation(line: 590, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1166, file: !117, line: 589, column: 5)
!1170 = !DILocation(line: 591, column: 7, scope: !1169)
!1171 = !DILocation(line: 595, column: 37, scope: !320)
!1172 = !DILocation(line: 595, column: 35, scope: !320)
!1173 = !DILocation(line: 596, column: 29, scope: !320)
!1174 = !DILocation(line: 597, column: 8, scope: !335)
!1175 = !DILocation(line: 597, column: 7, scope: !320)
!1176 = !DILocation(line: 604, column: 24, scope: !334)
!1177 = !DILocation(line: 604, column: 12, scope: !335)
!1178 = !DILocation(line: 0, scope: !333)
!1179 = !DILocation(line: 610, column: 16, scope: !333)
!1180 = !DILocation(line: 610, column: 7, scope: !333)
!1181 = !DILocation(line: 611, column: 21, scope: !333)
!1182 = !{!1183, !1183, i64 0}
!1183 = !{!"short", !1063, i64 0}
!1184 = !DILocation(line: 611, column: 19, scope: !333)
!1185 = !DILocation(line: 611, column: 16, scope: !333)
!1186 = !DILocation(line: 610, column: 30, scope: !333)
!1187 = distinct !{!1187, !1180, !1181, !1188}
!1188 = !{!"llvm.loop.mustprogress"}
!1189 = !DILocation(line: 612, column: 18, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !333, file: !117, line: 612, column: 11)
!1191 = !DILocation(line: 612, column: 11, scope: !333)
!1192 = !DILocation(line: 620, column: 23, scope: !320)
!1193 = !DILocation(line: 625, column: 39, scope: !320)
!1194 = !DILocation(line: 626, column: 3, scope: !320)
!1195 = !DILocation(line: 626, column: 10, scope: !320)
!1196 = !DILocation(line: 626, column: 21, scope: !320)
!1197 = !DILocation(line: 628, column: 44, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !117, line: 628, column: 11)
!1199 = distinct !DILexicalBlock(scope: !320, file: !117, line: 627, column: 5)
!1200 = !DILocation(line: 628, column: 32, scope: !1198)
!1201 = !DILocation(line: 628, column: 49, scope: !1198)
!1202 = !DILocation(line: 628, column: 11, scope: !1199)
!1203 = !DILocation(line: 630, column: 11, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1199, file: !117, line: 630, column: 11)
!1205 = !DILocation(line: 630, column: 11, scope: !1199)
!1206 = !DILocation(line: 632, column: 26, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1208, file: !117, line: 632, column: 15)
!1208 = distinct !DILexicalBlock(scope: !1204, file: !117, line: 631, column: 9)
!1209 = !DILocation(line: 632, column: 34, scope: !1207)
!1210 = !DILocation(line: 632, column: 37, scope: !1207)
!1211 = !DILocation(line: 632, column: 15, scope: !1208)
!1212 = !DILocation(line: 640, column: 16, scope: !1199)
!1213 = distinct !{!1213, !1194, !1214, !1188}
!1214 = !DILocation(line: 641, column: 5, scope: !320)
!1215 = !DILocation(line: 644, column: 3, scope: !320)
!1216 = !DILocation(line: 0, scope: !1153, inlinedAt: !1217)
!1217 = distinct !DILocation(line: 648, column: 31, scope: !320)
!1218 = !DILocation(line: 0, scope: !1153, inlinedAt: !1219)
!1219 = distinct !DILocation(line: 649, column: 31, scope: !320)
!1220 = !DILocation(line: 0, scope: !1153, inlinedAt: !1221)
!1221 = distinct !DILocation(line: 650, column: 31, scope: !320)
!1222 = !DILocation(line: 0, scope: !1153, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 651, column: 31, scope: !320)
!1224 = !DILocation(line: 0, scope: !1153, inlinedAt: !1225)
!1225 = distinct !DILocation(line: 652, column: 31, scope: !320)
!1226 = !DILocation(line: 0, scope: !1153, inlinedAt: !1227)
!1227 = distinct !DILocation(line: 653, column: 31, scope: !320)
!1228 = !DILocation(line: 0, scope: !1153, inlinedAt: !1229)
!1229 = distinct !DILocation(line: 654, column: 31, scope: !320)
!1230 = !DILocation(line: 0, scope: !1153, inlinedAt: !1231)
!1231 = distinct !DILocation(line: 655, column: 31, scope: !320)
!1232 = !DILocation(line: 0, scope: !1153, inlinedAt: !1233)
!1233 = distinct !DILocation(line: 656, column: 31, scope: !320)
!1234 = !DILocation(line: 0, scope: !1153, inlinedAt: !1235)
!1235 = distinct !DILocation(line: 657, column: 31, scope: !320)
!1236 = !DILocation(line: 663, column: 7, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !320, file: !117, line: 663, column: 7)
!1238 = !DILocation(line: 664, column: 7, scope: !1237)
!1239 = !DILocation(line: 664, column: 10, scope: !1237)
!1240 = !DILocation(line: 663, column: 7, scope: !320)
!1241 = !DILocation(line: 669, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1237, file: !117, line: 665, column: 5)
!1243 = !DILocation(line: 671, column: 5, scope: !1242)
!1244 = !DILocation(line: 676, column: 7, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1237, file: !117, line: 673, column: 5)
!1246 = !DILocation(line: 679, column: 3, scope: !320)
!1247 = !DILocation(line: 683, column: 3, scope: !320)
!1248 = !DILocation(line: 686, column: 3, scope: !320)
!1249 = !DILocation(line: 688, column: 3, scope: !320)
!1250 = !DILocation(line: 691, column: 3, scope: !320)
!1251 = !DILocation(line: 695, column: 3, scope: !320)
!1252 = !DILocation(line: 696, column: 1, scope: !320)
