; ModuleID = 'src/nohup.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [45 x i8] c"Usage: %s COMMAND [ARG]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [40 x i8] c"Run COMMAND, ignoring hangup signals.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"nohup\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 61)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !131, line: 679, type: !213, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !131, line: 683, type: !90, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !131, line: 688, type: !90, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !131, line: 691, type: !229, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !131, line: 826, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1440, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 180)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(scope: null, file: !131, line: 839, type: !59, isLocal: true, isDefinition: true)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !131, line: 840, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 22)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !131, line: 841, type: !83, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !131, line: 862, type: !197, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !131, line: 868, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 71)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !131, line: 875, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 27)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !131, line: 877, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 51)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !131, line: 877, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 12)
!302 = !{!303, !304, !305, !308, !310, !311, !312, !316, !317, !318, !319, !321, !375, !376, !377, !379, !380}
!303 = !DILocalVariable(name: "program", arg: 1, scope: !130, file: !131, line: 573, type: !134)
!304 = !DILocalVariable(name: "option", arg: 2, scope: !130, file: !131, line: 573, type: !134)
!305 = !DILocalVariable(name: "term", scope: !306, file: !131, line: 585, type: !134)
!306 = distinct !DILexicalBlock(scope: !307, file: !131, line: 582, column: 5)
!307 = distinct !DILexicalBlock(scope: !130, file: !131, line: 581, column: 7)
!308 = !DILocalVariable(name: "double_space", scope: !130, file: !131, line: 594, type: !309)
!309 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!310 = !DILocalVariable(name: "first_word", scope: !130, file: !131, line: 595, type: !134)
!311 = !DILocalVariable(name: "option_text", scope: !130, file: !131, line: 596, type: !134)
!312 = !DILocalVariable(name: "s", scope: !313, file: !131, line: 608, type: !134)
!313 = distinct !DILexicalBlock(scope: !314, file: !131, line: 605, column: 5)
!314 = distinct !DILexicalBlock(scope: !315, file: !131, line: 604, column: 12)
!315 = distinct !DILexicalBlock(scope: !130, file: !131, line: 597, column: 7)
!316 = !DILocalVariable(name: "spaces", scope: !313, file: !131, line: 609, type: !186)
!317 = !DILocalVariable(name: "anchor_len", scope: !130, file: !131, line: 620, type: !186)
!318 = !DILocalVariable(name: "desc_text", scope: !130, file: !131, line: 625, type: !134)
!319 = !DILocalVariable(name: "__ptr", scope: !320, file: !131, line: 644, type: !134)
!320 = distinct !DILexicalBlock(scope: !130, file: !131, line: 644, column: 3)
!321 = !DILocalVariable(name: "__stream", scope: !320, file: !131, line: 644, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !324, line: 7, baseType: !325)
!324 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !326, line: 49, size: 1728, elements: !327)
!326 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!327 = !{!328, !329, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !344, !346, !347, !348, !352, !353, !355, !356, !359, !361, !364, !367, !368, !369, !370, !371}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !325, file: !326, line: 51, baseType: !184, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !325, file: !326, line: 54, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !325, file: !326, line: 55, baseType: !330, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !325, file: !326, line: 56, baseType: !330, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !325, file: !326, line: 57, baseType: !330, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !325, file: !326, line: 58, baseType: !330, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !325, file: !326, line: 59, baseType: !330, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !325, file: !326, line: 60, baseType: !330, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !325, file: !326, line: 61, baseType: !330, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !325, file: !326, line: 64, baseType: !330, size: 64, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !325, file: !326, line: 65, baseType: !330, size: 64, offset: 640)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !325, file: !326, line: 66, baseType: !330, size: 64, offset: 704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !325, file: !326, line: 68, baseType: !342, size: 64, offset: 768)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !326, line: 36, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !325, file: !326, line: 70, baseType: !345, size: 64, offset: 832)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !325, file: !326, line: 72, baseType: !184, size: 32, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !325, file: !326, line: 73, baseType: !184, size: 32, offset: 928)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !325, file: !326, line: 74, baseType: !349, size: 64, offset: 960)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !350, line: 152, baseType: !351)
!350 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!351 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !325, file: !326, line: 77, baseType: !185, size: 16, offset: 1024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !325, file: !326, line: 78, baseType: !354, size: 8, offset: 1040)
!354 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !325, file: !326, line: 79, baseType: !44, size: 8, offset: 1048)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !325, file: !326, line: 81, baseType: !357, size: 64, offset: 1088)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !326, line: 43, baseType: null)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !325, file: !326, line: 89, baseType: !360, size: 64, offset: 1152)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !350, line: 153, baseType: !351)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !325, file: !326, line: 91, baseType: !362, size: 64, offset: 1216)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !326, line: 37, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !325, file: !326, line: 92, baseType: !365, size: 64, offset: 1280)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !326, line: 38, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !325, file: !326, line: 93, baseType: !345, size: 64, offset: 1344)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !325, file: !326, line: 94, baseType: !178, size: 64, offset: 1408)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !325, file: !326, line: 95, baseType: !186, size: 64, offset: 1472)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !325, file: !326, line: 96, baseType: !184, size: 32, offset: 1536)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !325, file: !326, line: 98, baseType: !372, size: 160, offset: 1568)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 20)
!375 = !DILocalVariable(name: "__cnt", scope: !320, file: !131, line: 644, type: !186)
!376 = !DILocalVariable(name: "url_program", scope: !130, file: !131, line: 648, type: !134)
!377 = !DILocalVariable(name: "__ptr", scope: !378, file: !131, line: 686, type: !134)
!378 = distinct !DILexicalBlock(scope: !130, file: !131, line: 686, column: 3)
!379 = !DILocalVariable(name: "__stream", scope: !378, file: !131, line: 686, type: !322)
!380 = !DILocalVariable(name: "__cnt", scope: !378, file: !131, line: 686, type: !186)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 3, type: !83, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "Version", scope: !386, file: !383, line: 3, type: !134, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C11, file: !383, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !387, splitDebugInlining: false, nameTableKind: None)
!387 = !{!381, !384}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "file_name", scope: !390, file: !391, line: 45, type: !134, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C11, file: !391, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !392, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!392 = !{!393, !395, !397, !399, !388, !401}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !391, line: 121, type: !224, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !391, line: 121, type: !299, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(scope: null, file: !391, line: 123, type: !224, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !391, line: 126, type: !213, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !390, file: !391, line: 55, type: !309, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !405, file: !406, line: 66, type: !457, isLocal: false, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C11, file: !406, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!407 = !{!178, !189}
!408 = !{!409, !411, !436, !438, !440, !442, !403, !444, !446, !448, !450, !455}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !406, line: 272, type: !90, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "old_file_name", scope: !413, file: !406, line: 304, type: !134, isLocal: true, isDefinition: true)
!413 = distinct !DISubprogram(name: "verror_at_line", scope: !406, file: !406, line: 298, type: !414, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !429)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !184, !184, !134, !139, !134, !416}
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !417, line: 52, baseType: !418)
!417 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !419, line: 14, baseType: !420)
!419 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !421, baseType: !422)
!421 = !DIFile(filename: "lib/error.c", directory: "/src")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !422, file: !421, baseType: !178, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !422, file: !421, baseType: !178, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !422, file: !421, baseType: !178, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !422, file: !421, baseType: !184, size: 32, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !422, file: !421, baseType: !184, size: 32, offset: 224)
!429 = !{!430, !431, !432, !433, !434, !435}
!430 = !DILocalVariable(name: "status", arg: 1, scope: !413, file: !406, line: 298, type: !184)
!431 = !DILocalVariable(name: "errnum", arg: 2, scope: !413, file: !406, line: 298, type: !184)
!432 = !DILocalVariable(name: "file_name", arg: 3, scope: !413, file: !406, line: 298, type: !134)
!433 = !DILocalVariable(name: "line_number", arg: 4, scope: !413, file: !406, line: 298, type: !139)
!434 = !DILocalVariable(name: "message", arg: 5, scope: !413, file: !406, line: 298, type: !134)
!435 = !DILocalVariable(name: "args", arg: 6, scope: !413, file: !406, line: 298, type: !416)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "old_line_number", scope: !413, file: !406, line: 305, type: !139, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(scope: null, file: !406, line: 338, type: !197, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(scope: null, file: !406, line: 346, type: !229, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(scope: null, file: !406, line: 346, type: !204, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "error_message_count", scope: !405, file: !406, line: 69, type: !139, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !405, file: !406, line: 295, type: !184, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !406, line: 208, type: !224, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !406, line: 208, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 21)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !406, line: 214, type: !90, isLocal: true, isDefinition: true)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !462, file: !463, line: 506, type: !184, isLocal: true, isDefinition: true)
!462 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !463, file: !463, line: 485, type: !464, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !466, retainedNodes: !468)
!463 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!464 = !DISubroutineType(types: !465)
!465 = !{!184, !184, !184}
!466 = distinct !DICompileUnit(language: DW_LANG_C11, file: !463, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !467, splitDebugInlining: false, nameTableKind: None)
!467 = !{!460}
!468 = !{!469, !470, !471, !472, !475}
!469 = !DILocalVariable(name: "fd", arg: 1, scope: !462, file: !463, line: 485, type: !184)
!470 = !DILocalVariable(name: "target", arg: 2, scope: !462, file: !463, line: 485, type: !184)
!471 = !DILocalVariable(name: "result", scope: !462, file: !463, line: 487, type: !184)
!472 = !DILocalVariable(name: "flags", scope: !473, file: !463, line: 530, type: !184)
!473 = distinct !DILexicalBlock(scope: !474, file: !463, line: 529, column: 5)
!474 = distinct !DILexicalBlock(scope: !462, file: !463, line: 528, column: 7)
!475 = !DILocalVariable(name: "saved_errno", scope: !476, file: !463, line: 533, type: !184)
!476 = distinct !DILexicalBlock(scope: !477, file: !463, line: 532, column: 9)
!477 = distinct !DILexicalBlock(scope: !473, file: !463, line: 531, column: 11)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(scope: null, file: !480, line: 60, type: !204, isLocal: true, isDefinition: true)
!480 = !DIFile(filename: "lib/long-options.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f9207327ba8a7df3cab41412dd2273a8")
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "long_options", scope: !483, file: !480, line: 34, type: !491, isLocal: true, isDefinition: true)
!483 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !484, splitDebugInlining: false, nameTableKind: None)
!484 = !{!478, !485, !487, !489, !481}
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !480, line: 112, type: !44, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !480, line: 36, type: !90, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !480, line: 37, type: !229, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 768, elements: !214)
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !494, line: 50, size: 256, elements: !495)
!494 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!495 = !{!496, !497, !498, !500}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !493, file: !494, line: 52, baseType: !134, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !493, file: !494, line: 55, baseType: !184, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !493, file: !494, line: 56, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !493, file: !494, line: 57, baseType: !184, size: 32, offset: 192)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "program_name", scope: !503, file: !504, line: 31, type: !134, isLocal: false, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C11, file: !504, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, globals: !506, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!505 = !{!330}
!506 = !{!501, !507, !509}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !504, line: 46, type: !229, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !504, line: 49, type: !197, isLocal: true, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "utf07FF", scope: !513, file: !514, line: 46, type: !541, isLocal: true, isDefinition: true)
!513 = distinct !DISubprogram(name: "proper_name_lite", scope: !514, file: !514, line: 38, type: !515, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !517, retainedNodes: !519)
!514 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!515 = !DISubroutineType(types: !516)
!516 = !{!134, !134, !134}
!517 = distinct !DICompileUnit(language: DW_LANG_C11, file: !514, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !518, splitDebugInlining: false, nameTableKind: None)
!518 = !{!511}
!519 = !{!520, !521, !522, !523, !528}
!520 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !513, file: !514, line: 38, type: !134)
!521 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !513, file: !514, line: 38, type: !134)
!522 = !DILocalVariable(name: "translation", scope: !513, file: !514, line: 40, type: !134)
!523 = !DILocalVariable(name: "w", scope: !513, file: !514, line: 47, type: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !525, line: 37, baseType: !526)
!525 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !350, line: 57, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !350, line: 42, baseType: !139)
!528 = !DILocalVariable(name: "mbs", scope: !513, file: !514, line: 48, type: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !530, line: 6, baseType: !531)
!530 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !532, line: 21, baseType: !533)
!532 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 13, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !533, file: !532, line: 15, baseType: !184, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !533, file: !532, line: 20, baseType: !537, size: 32, offset: 32)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !532, line: 16, size: 32, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !537, file: !532, line: 18, baseType: !139, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !537, file: !532, line: 19, baseType: !197, size: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 16, elements: !205)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !544, line: 78, type: !229, isLocal: true, isDefinition: true)
!544 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(scope: null, file: !544, line: 79, type: !19, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(scope: null, file: !544, line: 80, type: !69, isLocal: true, isDefinition: true)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !544, line: 81, type: !69, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !544, line: 82, type: !372, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !544, line: 83, type: !204, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !544, line: 84, type: !229, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !544, line: 85, type: !224, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(scope: null, file: !544, line: 86, type: !224, isLocal: true, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !544, line: 87, type: !229, isLocal: true, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !565, file: !544, line: 76, type: !637, isLocal: false, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C11, file: !544, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !566, retainedTypes: !572, globals: !573, splitDebugInlining: false, nameTableKind: None)
!566 = !{!148, !567, !162}
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !149, line: 254, baseType: !139, size: 32, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!570 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!571 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!572 = !{!184, !185, !186}
!573 = !{!542, !545, !547, !549, !551, !553, !555, !557, !559, !561, !563, !574, !578, !588, !590, !595, !597, !599, !601, !603, !626, !633, !635}
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !565, file: !544, line: 92, type: !576, isLocal: false, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 320, elements: !50)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !565, file: !544, line: 1040, type: !580, isLocal: false, isDefinition: true)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !544, line: 56, size: 448, elements: !581)
!581 = !{!582, !583, !584, !586, !587}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !580, file: !544, line: 59, baseType: !148, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !544, line: 62, baseType: !184, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !580, file: !544, line: 66, baseType: !585, size: 256, offset: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !230)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !580, file: !544, line: 69, baseType: !134, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !580, file: !544, line: 72, baseType: !134, size: 64, offset: 384)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !565, file: !544, line: 107, type: !580, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "slot0", scope: !565, file: !544, line: 831, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 256)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !544, line: 321, type: !204, isLocal: true, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !544, line: 357, type: !204, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !544, line: 358, type: !204, isLocal: true, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !544, line: 199, type: !224, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "quote", scope: !605, file: !544, line: 228, type: !624, isLocal: true, isDefinition: true)
!605 = distinct !DISubprogram(name: "gettext_quote", scope: !544, file: !544, line: 197, type: !606, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !565, retainedNodes: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!134, !134, !148}
!608 = !{!609, !610, !611, !612, !613}
!609 = !DILocalVariable(name: "msgid", arg: 1, scope: !605, file: !544, line: 197, type: !134)
!610 = !DILocalVariable(name: "s", arg: 2, scope: !605, file: !544, line: 197, type: !148)
!611 = !DILocalVariable(name: "translation", scope: !605, file: !544, line: 199, type: !134)
!612 = !DILocalVariable(name: "w", scope: !605, file: !544, line: 229, type: !524)
!613 = !DILocalVariable(name: "mbs", scope: !605, file: !544, line: 230, type: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !530, line: 6, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !532, line: 21, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 13, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !616, file: !532, line: 15, baseType: !184, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !616, file: !532, line: 20, baseType: !620, size: 32, offset: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !616, file: !532, line: 16, size: 32, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !620, file: !532, line: 18, baseType: !139, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !620, file: !532, line: 19, baseType: !197, size: 32)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 64, elements: !625)
!625 = !{!206, !199}
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "slotvec", scope: !565, file: !544, line: 834, type: !628, isLocal: true, isDefinition: true)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !544, line: 823, size: 128, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !544, line: 825, baseType: !186, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !629, file: !544, line: 826, baseType: !330, size: 64, offset: 64)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "nslots", scope: !565, file: !544, line: 832, type: !184, isLocal: true, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "slotvec0", scope: !565, file: !544, line: 833, type: !629, isLocal: true, isDefinition: true)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 704, elements: !639)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!639 = !{!640}
!640 = !DISubrange(count: 11)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !643, line: 67, type: !299, isLocal: true, isDefinition: true)
!643 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !643, line: 69, type: !224, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !643, line: 83, type: !224, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !643, line: 83, type: !197, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !643, line: 85, type: !204, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !643, line: 88, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 171)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !643, line: 88, type: !120, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !643, line: 105, type: !59, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !643, line: 109, type: !105, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !643, line: 113, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 28)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !643, line: 120, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 32)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !643, line: 127, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 36)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !643, line: 134, type: !14, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !643, line: 142, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 44)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !643, line: 150, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 48)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !643, line: 159, type: !692, isLocal: true, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 52)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !643, line: 170, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 60)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !643, line: 248, type: !372, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(scope: null, file: !643, line: 248, type: !275, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !643, line: 254, type: !372, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !643, line: 254, type: !64, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !643, line: 254, type: !14, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !643, line: 259, type: !3, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !643, line: 259, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 29)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !719, file: !720, line: 26, type: !722, isLocal: false, isDefinition: true)
!719 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !721, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!721 = !{!717}
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 376, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 47)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "exit_failure", scope: !727, file: !728, line: 24, type: !730, isLocal: false, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C11, file: !728, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !729, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!729 = !{!725}
!730 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(scope: null, file: !733, line: 34, type: !213, isLocal: true, isDefinition: true)
!733 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !733, line: 34, type: !224, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !733, line: 34, type: !246, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !740, line: 108, type: !44, isLocal: true, isDefinition: true)
!740 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "internal_state", scope: !743, file: !740, line: 97, type: !746, isLocal: true, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !740, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !744, globals: !745, splitDebugInlining: false, nameTableKind: None)
!744 = !{!178, !186, !189}
!745 = !{!738, !741}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !530, line: 6, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !532, line: 21, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 13, size: 64, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !748, file: !532, line: 15, baseType: !184, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !748, file: !532, line: 20, baseType: !752, size: 32, offset: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !748, file: !532, line: 16, size: 32, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !752, file: !532, line: 18, baseType: !139, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !752, file: !532, line: 19, baseType: !197, size: 32)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !758, line: 35, type: !204, isLocal: true, isDefinition: true)
!758 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !758, line: 35, type: !19, isLocal: true, isDefinition: true)
!761 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "lib/fd-reopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "062fe9c324b2740011a864ab02c109e2")
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!765 = !{!178}
!766 = distinct !DICompileUnit(language: DW_LANG_C11, file: !767, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!767 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !769, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!770 = distinct !DICompileUnit(language: DW_LANG_C11, file: !643, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !771, retainedTypes: !765, globals: !775, splitDebugInlining: false, nameTableKind: None)
!771 = !{!772}
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !643, line: 40, baseType: !139, size: 32, elements: !773)
!773 = !{!774}
!774 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!775 = !{!641, !644, !646, !648, !650, !652, !657, !659, !661, !663, !668, !673, !678, !680, !685, !690, !695, !700, !702, !704, !706, !708, !710, !712}
!776 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !778, retainedTypes: !809, splitDebugInlining: false, nameTableKind: None)
!777 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!778 = !{!779, !791}
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !780, file: !777, line: 188, baseType: !139, size: 32, elements: !789)
!780 = distinct !DISubprogram(name: "x2nrealloc", scope: !777, file: !777, line: 176, type: !781, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !784)
!781 = !DISubroutineType(types: !782)
!782 = !{!178, !178, !783, !186}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!784 = !{!785, !786, !787, !788}
!785 = !DILocalVariable(name: "p", arg: 1, scope: !780, file: !777, line: 176, type: !178)
!786 = !DILocalVariable(name: "pn", arg: 2, scope: !780, file: !777, line: 176, type: !783)
!787 = !DILocalVariable(name: "s", arg: 3, scope: !780, file: !777, line: 176, type: !186)
!788 = !DILocalVariable(name: "n", scope: !780, file: !777, line: 178, type: !186)
!789 = !{!790}
!790 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !792, file: !777, line: 228, baseType: !139, size: 32, elements: !789)
!792 = distinct !DISubprogram(name: "xpalloc", scope: !777, file: !777, line: 223, type: !793, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !776, retainedNodes: !799)
!793 = !DISubroutineType(types: !794)
!794 = !{!178, !178, !795, !796, !798, !796}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !797, line: 130, baseType: !798)
!797 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !187, line: 35, baseType: !351)
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808}
!800 = !DILocalVariable(name: "pa", arg: 1, scope: !792, file: !777, line: 223, type: !178)
!801 = !DILocalVariable(name: "pn", arg: 2, scope: !792, file: !777, line: 223, type: !795)
!802 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !792, file: !777, line: 223, type: !796)
!803 = !DILocalVariable(name: "n_max", arg: 4, scope: !792, file: !777, line: 223, type: !798)
!804 = !DILocalVariable(name: "s", arg: 5, scope: !792, file: !777, line: 223, type: !796)
!805 = !DILocalVariable(name: "n0", scope: !792, file: !777, line: 230, type: !796)
!806 = !DILocalVariable(name: "n", scope: !792, file: !777, line: 237, type: !796)
!807 = !DILocalVariable(name: "nbytes", scope: !792, file: !777, line: 248, type: !796)
!808 = !DILocalVariable(name: "adjusted_nbytes", scope: !792, file: !777, line: 252, type: !796)
!809 = !{!330, !178, !309, !351, !188}
!810 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !811, splitDebugInlining: false, nameTableKind: None)
!811 = !{!731, !734, !736}
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !505, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!814 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !819, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!819 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !824, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!824 = !{!309, !188, !178}
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !758, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !826, splitDebugInlining: false, nameTableKind: None)
!826 = !{!756, !759}
!827 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!829 = distinct !DICompileUnit(language: DW_LANG_C11, file: !830, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!830 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!831 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!832 = !{i32 7, !"Dwarf Version", i32 5}
!833 = !{i32 2, !"Debug Info Version", i32 3}
!834 = !{i32 1, !"wchar_size", i32 4}
!835 = !{i32 8, !"PIC Level", i32 2}
!836 = !{i32 7, !"PIE Level", i32 2}
!837 = !{i32 7, !"uwtable", i32 2}
!838 = !{i32 7, !"frame-pointer", i32 1}
!839 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 43, type: !182, scopeLine: 44, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !840)
!840 = !{!841}
!841 = !DILocalVariable(name: "status", arg: 1, scope: !839, file: !2, line: 43, type: !184)
!842 = !DILocation(line: 0, scope: !839)
!843 = !DILocation(line: 45, column: 14, scope: !844)
!844 = distinct !DILexicalBlock(scope: !839, file: !2, line: 45, column: 7)
!845 = !DILocation(line: 45, column: 7, scope: !839)
!846 = !DILocation(line: 46, column: 5, scope: !847)
!847 = distinct !DILexicalBlock(scope: !844, file: !2, line: 46, column: 5)
!848 = !{!849, !849, i64 0}
!849 = !{!"any pointer", !850, i64 0}
!850 = !{!"omnipotent char", !851, i64 0}
!851 = !{!"Simple C/C++ TBAA"}
!852 = !DILocation(line: 49, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !844, file: !2, line: 48, column: 5)
!854 = !DILocation(line: 55, column: 7, scope: !853)
!855 = !DILocation(line: 59, column: 7, scope: !853)
!856 = !DILocation(line: 60, column: 7, scope: !853)
!857 = !DILocation(line: 61, column: 7, scope: !853)
!858 = !DILocation(line: 68, column: 7, scope: !853)
!859 = !DILocalVariable(name: "program", arg: 1, scope: !860, file: !131, line: 824, type: !134)
!860 = distinct !DISubprogram(name: "emit_exec_status", scope: !131, file: !131, line: 824, type: !861, scopeLine: 825, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !134}
!863 = !{!859}
!864 = !DILocation(line: 0, scope: !860, inlinedAt: !865)
!865 = distinct !DILocation(line: 69, column: 7, scope: !853)
!866 = !DILocation(line: 826, column: 7, scope: !860, inlinedAt: !865)
!867 = !DILocalVariable(name: "program", arg: 1, scope: !868, file: !131, line: 836, type: !134)
!868 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !131, file: !131, line: 836, type: !861, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !869)
!869 = !{!867, !870, !877, !878, !880, !881}
!870 = !DILocalVariable(name: "infomap", scope: !868, file: !131, line: 838, type: !871)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 896, elements: !225)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !868, file: !131, line: 838, size: 128, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !873, file: !131, line: 838, baseType: !134, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !873, file: !131, line: 838, baseType: !134, size: 64, offset: 64)
!877 = !DILocalVariable(name: "node", scope: !868, file: !131, line: 848, type: !134)
!878 = !DILocalVariable(name: "map_prog", scope: !868, file: !131, line: 849, type: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!880 = !DILocalVariable(name: "lc_messages", scope: !868, file: !131, line: 861, type: !134)
!881 = !DILocalVariable(name: "url_program", scope: !868, file: !131, line: 874, type: !134)
!882 = !DILocation(line: 0, scope: !868, inlinedAt: !883)
!883 = distinct !DILocation(line: 70, column: 7, scope: !853)
!884 = !DILocation(line: 857, column: 3, scope: !868, inlinedAt: !883)
!885 = !DILocation(line: 861, column: 29, scope: !868, inlinedAt: !883)
!886 = !DILocation(line: 862, column: 7, scope: !887, inlinedAt: !883)
!887 = distinct !DILexicalBlock(scope: !868, file: !131, line: 862, column: 7)
!888 = !DILocation(line: 862, column: 19, scope: !887, inlinedAt: !883)
!889 = !DILocation(line: 862, column: 22, scope: !887, inlinedAt: !883)
!890 = !DILocation(line: 862, column: 7, scope: !868, inlinedAt: !883)
!891 = !DILocation(line: 868, column: 7, scope: !892, inlinedAt: !883)
!892 = distinct !DILexicalBlock(scope: !887, file: !131, line: 863, column: 5)
!893 = !DILocation(line: 870, column: 5, scope: !892, inlinedAt: !883)
!894 = !DILocation(line: 875, column: 3, scope: !868, inlinedAt: !883)
!895 = !DILocation(line: 877, column: 3, scope: !868, inlinedAt: !883)
!896 = !DILocation(line: 72, column: 3, scope: !839)
!897 = !DISubprogram(name: "dcgettext", scope: !898, file: !898, line: 51, type: !899, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!898 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!899 = !DISubroutineType(types: !900)
!900 = !{!330, !134, !134, !184}
!901 = !{}
!902 = !DISubprogram(name: "__fprintf_chk", scope: !903, file: !903, line: 93, type: !904, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!903 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!904 = !DISubroutineType(types: !905)
!905 = !{!184, !906, !184, !907, null}
!906 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !322)
!907 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!908 = !DISubprogram(name: "__printf_chk", scope: !903, file: !903, line: 95, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!909 = !DISubroutineType(types: !910)
!910 = !{!184, !184, !907, null}
!911 = !DISubprogram(name: "fputs_unlocked", scope: !417, file: !417, line: 691, type: !912, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!912 = !DISubroutineType(types: !913)
!913 = !{!184, !907, !906}
!914 = !DILocation(line: 0, scope: !130)
!915 = !DILocation(line: 581, column: 7, scope: !307)
!916 = !{!917, !917, i64 0}
!917 = !{!"int", !850, i64 0}
!918 = !DILocation(line: 581, column: 19, scope: !307)
!919 = !DILocation(line: 581, column: 7, scope: !130)
!920 = !DILocation(line: 585, column: 26, scope: !306)
!921 = !DILocation(line: 0, scope: !306)
!922 = !DILocation(line: 586, column: 23, scope: !306)
!923 = !DILocation(line: 586, column: 28, scope: !306)
!924 = !DILocation(line: 586, column: 32, scope: !306)
!925 = !{!850, !850, i64 0}
!926 = !DILocation(line: 586, column: 38, scope: !306)
!927 = !DILocalVariable(name: "__s1", arg: 1, scope: !928, file: !929, line: 1359, type: !134)
!928 = distinct !DISubprogram(name: "streq", scope: !929, file: !929, line: 1359, type: !930, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !932)
!929 = !DIFile(filename: "./lib/string.h", directory: "/src")
!930 = !DISubroutineType(types: !931)
!931 = !{!309, !134, !134}
!932 = !{!927, !933}
!933 = !DILocalVariable(name: "__s2", arg: 2, scope: !928, file: !929, line: 1359, type: !134)
!934 = !DILocation(line: 0, scope: !928, inlinedAt: !935)
!935 = distinct !DILocation(line: 586, column: 41, scope: !306)
!936 = !DILocation(line: 1361, column: 11, scope: !928, inlinedAt: !935)
!937 = !DILocation(line: 1361, column: 10, scope: !928, inlinedAt: !935)
!938 = !DILocation(line: 586, column: 19, scope: !306)
!939 = !DILocation(line: 587, column: 5, scope: !306)
!940 = !DILocation(line: 588, column: 7, scope: !941)
!941 = distinct !DILexicalBlock(scope: !130, file: !131, line: 588, column: 7)
!942 = !DILocation(line: 588, column: 7, scope: !130)
!943 = !DILocation(line: 590, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !941, file: !131, line: 589, column: 5)
!945 = !DILocation(line: 591, column: 7, scope: !944)
!946 = !DILocation(line: 595, column: 37, scope: !130)
!947 = !DILocation(line: 595, column: 35, scope: !130)
!948 = !DILocation(line: 596, column: 29, scope: !130)
!949 = !DILocation(line: 597, column: 8, scope: !315)
!950 = !DILocation(line: 597, column: 7, scope: !130)
!951 = !DILocation(line: 604, column: 24, scope: !314)
!952 = !DILocation(line: 604, column: 12, scope: !315)
!953 = !DILocation(line: 0, scope: !313)
!954 = !DILocation(line: 610, column: 16, scope: !313)
!955 = !DILocation(line: 610, column: 7, scope: !313)
!956 = !DILocation(line: 611, column: 21, scope: !313)
!957 = !{!958, !958, i64 0}
!958 = !{!"short", !850, i64 0}
!959 = !DILocation(line: 611, column: 19, scope: !313)
!960 = !DILocation(line: 611, column: 16, scope: !313)
!961 = !DILocation(line: 610, column: 30, scope: !313)
!962 = distinct !{!962, !955, !956, !963}
!963 = !{!"llvm.loop.mustprogress"}
!964 = !DILocation(line: 612, column: 18, scope: !965)
!965 = distinct !DILexicalBlock(scope: !313, file: !131, line: 612, column: 11)
!966 = !DILocation(line: 612, column: 11, scope: !313)
!967 = !DILocation(line: 620, column: 23, scope: !130)
!968 = !DILocation(line: 625, column: 39, scope: !130)
!969 = !DILocation(line: 626, column: 3, scope: !130)
!970 = !DILocation(line: 626, column: 10, scope: !130)
!971 = !DILocation(line: 626, column: 21, scope: !130)
!972 = !DILocation(line: 628, column: 44, scope: !973)
!973 = distinct !DILexicalBlock(scope: !974, file: !131, line: 628, column: 11)
!974 = distinct !DILexicalBlock(scope: !130, file: !131, line: 627, column: 5)
!975 = !DILocation(line: 628, column: 32, scope: !973)
!976 = !DILocation(line: 628, column: 49, scope: !973)
!977 = !DILocation(line: 628, column: 11, scope: !974)
!978 = !DILocation(line: 630, column: 11, scope: !979)
!979 = distinct !DILexicalBlock(scope: !974, file: !131, line: 630, column: 11)
!980 = !DILocation(line: 630, column: 11, scope: !974)
!981 = !DILocation(line: 632, column: 26, scope: !982)
!982 = distinct !DILexicalBlock(scope: !983, file: !131, line: 632, column: 15)
!983 = distinct !DILexicalBlock(scope: !979, file: !131, line: 631, column: 9)
!984 = !DILocation(line: 632, column: 34, scope: !982)
!985 = !DILocation(line: 632, column: 37, scope: !982)
!986 = !DILocation(line: 632, column: 15, scope: !983)
!987 = !DILocation(line: 640, column: 16, scope: !974)
!988 = distinct !{!988, !969, !989, !963}
!989 = !DILocation(line: 641, column: 5, scope: !130)
!990 = !DILocation(line: 644, column: 3, scope: !130)
!991 = !DILocation(line: 0, scope: !928, inlinedAt: !992)
!992 = distinct !DILocation(line: 648, column: 31, scope: !130)
!993 = !DILocation(line: 0, scope: !928, inlinedAt: !994)
!994 = distinct !DILocation(line: 649, column: 31, scope: !130)
!995 = !DILocation(line: 0, scope: !928, inlinedAt: !996)
!996 = distinct !DILocation(line: 650, column: 31, scope: !130)
!997 = !DILocation(line: 0, scope: !928, inlinedAt: !998)
!998 = distinct !DILocation(line: 651, column: 31, scope: !130)
!999 = !DILocation(line: 0, scope: !928, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 652, column: 31, scope: !130)
!1001 = !DILocation(line: 0, scope: !928, inlinedAt: !1002)
!1002 = distinct !DILocation(line: 653, column: 31, scope: !130)
!1003 = !DILocation(line: 0, scope: !928, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 654, column: 31, scope: !130)
!1005 = !DILocation(line: 0, scope: !928, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 655, column: 31, scope: !130)
!1007 = !DILocation(line: 0, scope: !928, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 656, column: 31, scope: !130)
!1009 = !DILocation(line: 0, scope: !928, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 657, column: 31, scope: !130)
!1011 = !DILocation(line: 663, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !130, file: !131, line: 663, column: 7)
!1013 = !DILocation(line: 664, column: 7, scope: !1012)
!1014 = !DILocation(line: 664, column: 10, scope: !1012)
!1015 = !DILocation(line: 663, column: 7, scope: !130)
!1016 = !DILocation(line: 669, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !131, line: 665, column: 5)
!1018 = !DILocation(line: 671, column: 5, scope: !1017)
!1019 = !DILocation(line: 676, column: 7, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1012, file: !131, line: 673, column: 5)
!1021 = !DILocation(line: 679, column: 3, scope: !130)
!1022 = !DILocation(line: 683, column: 3, scope: !130)
!1023 = !DILocation(line: 686, column: 3, scope: !130)
!1024 = !DILocation(line: 688, column: 3, scope: !130)
!1025 = !DILocation(line: 691, column: 3, scope: !130)
!1026 = !DILocation(line: 695, column: 3, scope: !130)
!1027 = !DILocation(line: 696, column: 1, scope: !130)
!1028 = !DISubprogram(name: "setlocale", scope: !1029, file: !1029, line: 122, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1029 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!330, !184, !134}
!1032 = !DISubprogram(name: "strncmp", scope: !1033, file: !1033, line: 159, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1033 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!184, !134, !134, !186}
!1036 = !DISubprogram(name: "exit", scope: !1037, file: !1037, line: 624, type: !182, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1037 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1038 = !DISubprogram(name: "getenv", scope: !1037, file: !1037, line: 641, type: !1039, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!330, !134}
!1041 = !DISubprogram(name: "strcmp", scope: !1033, file: !1033, line: 156, type: !1042, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!184, !134, !134}
!1044 = !DISubprogram(name: "strspn", scope: !1033, file: !1033, line: 297, type: !1045, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!188, !134, !134}
!1047 = !DISubprogram(name: "strchr", scope: !1033, file: !1033, line: 246, type: !1048, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!330, !134, !184}
!1050 = !DISubprogram(name: "__ctype_b_loc", scope: !163, file: !163, line: 79, type: !1051, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!1056 = !DISubprogram(name: "strcspn", scope: !1033, file: !1033, line: 293, type: !1045, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1057 = !DISubprogram(name: "fwrite_unlocked", scope: !417, file: !417, line: 704, type: !1058, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!186, !1060, !186, !186, !906}
!1060 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1063 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !1064, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1067)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!184, !184, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1081, !1082, !1085, !1086, !1087, !1091, !1092, !1095, !1096, !1099, !1100, !1105, !1106, !1107}
!1068 = !DILocalVariable(name: "argc", arg: 1, scope: !1063, file: !2, line: 82, type: !184)
!1069 = !DILocalVariable(name: "argv", arg: 2, scope: !1063, file: !2, line: 82, type: !1066)
!1070 = !DILocalVariable(name: "exit_internal_failure", scope: !1063, file: !2, line: 94, type: !184)
!1071 = !DILocalVariable(name: "ignoring_input", scope: !1063, file: !2, line: 109, type: !309)
!1072 = !DILocalVariable(name: "redirecting_stdout", scope: !1063, file: !2, line: 110, type: !309)
!1073 = !DILocalVariable(name: "stdout_is_closed", scope: !1063, file: !2, line: 111, type: !309)
!1074 = !DILocalVariable(name: "redirecting_stderr", scope: !1063, file: !2, line: 112, type: !309)
!1075 = !DILocalVariable(name: "__errstatus", scope: !1076, file: !2, line: 120, type: !1080)
!1076 = distinct !DILexicalBlock(scope: !1077, file: !2, line: 120, column: 9)
!1077 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 119, column: 11)
!1078 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 118, column: 5)
!1079 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 117, column: 7)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!1081 = !DILocalVariable(name: "out_fd", scope: !1063, file: !2, line: 130, type: !184)
!1082 = !DILocalVariable(name: "in_home", scope: !1083, file: !2, line: 133, type: !330)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !2, line: 132, column: 5)
!1084 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 131, column: 7)
!1085 = !DILocalVariable(name: "file", scope: !1083, file: !2, line: 134, type: !134)
!1086 = !DILocalVariable(name: "flags", scope: !1083, file: !2, line: 135, type: !184)
!1087 = !DILocalVariable(name: "mode", scope: !1083, file: !2, line: 136, type: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !1089, line: 69, baseType: !1090)
!1089 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !350, line: 150, baseType: !139)
!1091 = !DILocalVariable(name: "umask_value", scope: !1083, file: !2, line: 137, type: !1088)
!1092 = !DILocalVariable(name: "saved_errno", scope: !1093, file: !2, line: 144, type: !184)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !2, line: 143, column: 9)
!1094 = distinct !DILexicalBlock(scope: !1083, file: !2, line: 142, column: 11)
!1095 = !DILocalVariable(name: "home", scope: !1093, file: !2, line: 145, type: !134)
!1096 = !DILocalVariable(name: "saved_errno2", scope: !1097, file: !2, line: 155, type: !184)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !2, line: 154, column: 13)
!1098 = distinct !DILexicalBlock(scope: !1093, file: !2, line: 153, column: 15)
!1099 = !DILocalVariable(name: "saved_stderr_fd", scope: !1063, file: !2, line: 175, type: !184)
!1100 = !DILocalVariable(name: "__errstatus", scope: !1101, file: !2, line: 193, type: !1080)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !2, line: 193, column: 9)
!1102 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 192, column: 11)
!1103 = distinct !DILexicalBlock(scope: !1104, file: !2, line: 177, column: 5)
!1104 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 176, column: 7)
!1105 = !DILocalVariable(name: "cmd", scope: !1063, file: !2, line: 211, type: !1066)
!1106 = !DILocalVariable(name: "exit_status", scope: !1063, file: !2, line: 213, type: !184)
!1107 = !DILocalVariable(name: "saved_errno", scope: !1063, file: !2, line: 214, type: !184)
!1108 = !DILocation(line: 0, scope: !1063)
!1109 = !DILocation(line: 85, column: 21, scope: !1063)
!1110 = !DILocation(line: 85, column: 3, scope: !1063)
!1111 = !DILocation(line: 86, column: 3, scope: !1063)
!1112 = !DILocation(line: 87, column: 3, scope: !1063)
!1113 = !DILocation(line: 88, column: 3, scope: !1063)
!1114 = !DILocation(line: 94, column: 32, scope: !1063)
!1115 = !DILocalVariable(name: "status", arg: 1, scope: !1116, file: !131, line: 102, type: !184)
!1116 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !131, file: !131, line: 102, type: !182, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1117)
!1117 = !{!1115}
!1118 = !DILocation(line: 0, scope: !1116, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 96, column: 3, scope: !1063)
!1120 = !DILocation(line: 105, column: 18, scope: !1121, inlinedAt: !1119)
!1121 = distinct !DILexicalBlock(scope: !1116, file: !131, line: 104, column: 7)
!1122 = !DILocation(line: 97, column: 3, scope: !1063)
!1123 = !DILocation(line: 100, column: 36, scope: !1063)
!1124 = !DILocation(line: 100, column: 59, scope: !1063)
!1125 = !DILocation(line: 99, column: 3, scope: !1063)
!1126 = !DILocation(line: 103, column: 15, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 103, column: 7)
!1128 = !DILocation(line: 103, column: 12, scope: !1127)
!1129 = !DILocation(line: 103, column: 7, scope: !1063)
!1130 = !DILocation(line: 105, column: 7, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1127, file: !2, line: 104, column: 5)
!1132 = !DILocation(line: 106, column: 7, scope: !1131)
!1133 = !DILocation(line: 109, column: 25, scope: !1063)
!1134 = !DILocation(line: 110, column: 29, scope: !1063)
!1135 = !DILocation(line: 111, column: 48, scope: !1063)
!1136 = !DILocation(line: 111, column: 51, scope: !1063)
!1137 = !DILocation(line: 111, column: 57, scope: !1063)
!1138 = !DILocation(line: 112, column: 29, scope: !1063)
!1139 = !DILocation(line: 117, column: 7, scope: !1063)
!1140 = !DILocation(line: 119, column: 11, scope: !1077)
!1141 = !DILocation(line: 119, column: 62, scope: !1077)
!1142 = !DILocation(line: 119, column: 11, scope: !1078)
!1143 = !DILocation(line: 120, column: 9, scope: !1077)
!1144 = !DILocation(line: 122, column: 31, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 122, column: 11)
!1146 = !DILocation(line: 123, column: 9, scope: !1145)
!1147 = !DILocation(line: 131, column: 26, scope: !1084)
!1148 = !DILocation(line: 0, scope: !1083)
!1149 = !DILocation(line: 137, column: 28, scope: !1083)
!1150 = !DILocation(line: 138, column: 17, scope: !1083)
!1151 = !DILocation(line: 139, column: 19, scope: !1083)
!1152 = !DILocation(line: 140, column: 19, scope: !1083)
!1153 = !DILocation(line: 142, column: 18, scope: !1094)
!1154 = !DILocation(line: 142, column: 11, scope: !1083)
!1155 = !DILocation(line: 144, column: 29, scope: !1093)
!1156 = !DILocation(line: 0, scope: !1093)
!1157 = !DILocation(line: 145, column: 30, scope: !1093)
!1158 = !DILocation(line: 146, column: 15, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1093, file: !2, line: 146, column: 15)
!1160 = !DILocation(line: 146, column: 15, scope: !1093)
!1161 = !DILocation(line: 148, column: 25, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1159, file: !2, line: 147, column: 13)
!1163 = !DILocation(line: 149, column: 25, scope: !1162)
!1164 = !DILocation(line: 150, column: 27, scope: !1162)
!1165 = !DILocation(line: 151, column: 27, scope: !1162)
!1166 = !DILocation(line: 153, column: 22, scope: !1098)
!1167 = !DILocation(line: 153, column: 15, scope: !1093)
!1168 = !DILocation(line: 155, column: 34, scope: !1097)
!1169 = !DILocation(line: 0, scope: !1097)
!1170 = !DILocation(line: 156, column: 15, scope: !1097)
!1171 = !DILocation(line: 157, column: 19, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1097, file: !2, line: 157, column: 19)
!1173 = !DILocation(line: 157, column: 19, scope: !1097)
!1174 = !DILocation(line: 158, column: 17, scope: !1172)
!1175 = !DILocation(line: 134, column: 19, scope: !1083)
!1176 = !DILocation(line: 165, column: 7, scope: !1083)
!1177 = !DILocation(line: 166, column: 7, scope: !1083)
!1178 = !DILocation(line: 171, column: 7, scope: !1083)
!1179 = !DILocation(line: 176, column: 7, scope: !1063)
!1180 = !DILocation(line: 182, column: 25, scope: !1103)
!1181 = !DILocation(line: 185, column: 11, scope: !1103)
!1182 = !DILocation(line: 186, column: 9, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 185, column: 11)
!1184 = !DILocation(line: 192, column: 11, scope: !1102)
!1185 = !DILocation(line: 192, column: 40, scope: !1102)
!1186 = !DILocation(line: 192, column: 11, scope: !1103)
!1187 = !DILocation(line: 193, column: 9, scope: !1102)
!1188 = !DILocation(line: 196, column: 11, scope: !1103)
!1189 = !DILocation(line: 197, column: 9, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 196, column: 11)
!1191 = !DILocation(line: 206, column: 7, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 206, column: 7)
!1193 = !DILocalVariable(name: "__stream", arg: 1, scope: !1194, file: !1195, line: 135, type: !322)
!1194 = distinct !DISubprogram(name: "ferror_unlocked", scope: !1195, file: !1195, line: 135, type: !1196, scopeLine: 136, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !136, retainedNodes: !1198)
!1195 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c10e343656e7a2bf1044ef4e4442d902")
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!184, !322}
!1198 = !{!1193}
!1199 = !DILocation(line: 0, scope: !1194, inlinedAt: !1200)
!1200 = distinct !DILocation(line: 206, column: 7, scope: !1192)
!1201 = !DILocation(line: 137, column: 10, scope: !1194, inlinedAt: !1200)
!1202 = !{!1203, !917, i64 0}
!1203 = !{!"_IO_FILE", !917, i64 0, !849, i64 8, !849, i64 16, !849, i64 24, !849, i64 32, !849, i64 40, !849, i64 48, !849, i64 56, !849, i64 64, !849, i64 72, !849, i64 80, !849, i64 88, !849, i64 96, !849, i64 104, !917, i64 112, !917, i64 116, !1204, i64 120, !958, i64 128, !850, i64 130, !850, i64 131, !849, i64 136, !1204, i64 144, !849, i64 152, !849, i64 160, !849, i64 168, !849, i64 176, !1204, i64 184, !917, i64 192, !850, i64 196}
!1204 = !{!"long", !850, i64 0}
!1205 = !DILocation(line: 206, column: 7, scope: !1063)
!1206 = !DILocation(line: 209, column: 3, scope: !1063)
!1207 = !DILocation(line: 211, column: 23, scope: !1063)
!1208 = !DILocation(line: 211, column: 21, scope: !1063)
!1209 = !DILocation(line: 212, column: 11, scope: !1063)
!1210 = !DILocation(line: 212, column: 3, scope: !1063)
!1211 = !DILocation(line: 213, column: 21, scope: !1063)
!1212 = !DILocation(line: 213, column: 27, scope: !1063)
!1213 = !DILocation(line: 222, column: 7, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1063, file: !2, line: 222, column: 7)
!1215 = !DILocation(line: 222, column: 45, scope: !1214)
!1216 = !DILocation(line: 222, column: 7, scope: !1063)
!1217 = !DILocation(line: 223, column: 5, scope: !1214)
!1218 = !DILocation(line: 226, column: 1, scope: !1063)
!1219 = !DISubprogram(name: "bindtextdomain", scope: !898, file: !898, line: 86, type: !1220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!330, !134, !134}
!1222 = !DISubprogram(name: "textdomain", scope: !898, file: !898, line: 82, type: !1039, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1223 = !DISubprogram(name: "atexit", scope: !1037, file: !1037, line: 602, type: !1224, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!184, !457}
!1226 = !DISubprogram(name: "isatty", scope: !1227, file: !1227, line: 809, type: !1228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1227 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!184, !184}
!1230 = !DISubprogram(name: "__errno_location", scope: !1231, file: !1231, line: 37, type: !1232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1231 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!499}
!1234 = !DISubprogram(name: "umask", scope: !1235, file: !1235, line: 380, type: !1236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1235 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/stat.h", directory: "", checksumkind: CSK_MD5, checksum: "1e5cd132abb12ea0c79aeae3bfa4573e")
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1090, !1090}
!1238 = !DISubprogram(name: "open", scope: !1239, file: !1239, line: 181, type: !1240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1239 = !DIFile(filename: "/usr/include/fcntl.h", directory: "", checksumkind: CSK_MD5, checksum: "1a9bb91818c37dc7bc291ca6e49fc221")
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!184, !134, !184, null}
!1242 = !DISubprogram(name: "free", scope: !1037, file: !1037, line: 555, type: !1243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{null, !178}
!1245 = !DISubprogram(name: "dup2", scope: !1227, file: !1227, line: 555, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1246 = !DISubprogram(name: "close", scope: !1227, file: !1227, line: 358, type: !1228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1247 = !DISubprogram(name: "signal", scope: !180, file: !180, line: 88, type: !1248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!179, !184, !179}
!1250 = !DISubprogram(name: "execvp", scope: !1227, file: !1227, line: 599, type: !1251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!184, !134, !1253}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!1255 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !391, file: !391, line: 50, type: !861, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1256)
!1256 = !{!1257}
!1257 = !DILocalVariable(name: "file", arg: 1, scope: !1255, file: !391, line: 50, type: !134)
!1258 = !DILocation(line: 0, scope: !1255)
!1259 = !DILocation(line: 52, column: 13, scope: !1255)
!1260 = !DILocation(line: 53, column: 1, scope: !1255)
!1261 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !391, file: !391, line: 87, type: !1262, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1264)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !309}
!1264 = !{!1265}
!1265 = !DILocalVariable(name: "ignore", arg: 1, scope: !1261, file: !391, line: 87, type: !309)
!1266 = !DILocation(line: 0, scope: !1261)
!1267 = !DILocation(line: 89, column: 16, scope: !1261)
!1268 = !{!1269, !1269, i64 0}
!1269 = !{!"_Bool", !850, i64 0}
!1270 = !DILocation(line: 90, column: 1, scope: !1261)
!1271 = distinct !DISubprogram(name: "close_stdout", scope: !391, file: !391, line: 116, type: !458, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !1272)
!1272 = !{!1273}
!1273 = !DILocalVariable(name: "write_error", scope: !1274, file: !391, line: 121, type: !134)
!1274 = distinct !DILexicalBlock(scope: !1275, file: !391, line: 120, column: 5)
!1275 = distinct !DILexicalBlock(scope: !1271, file: !391, line: 118, column: 7)
!1276 = !DILocation(line: 118, column: 21, scope: !1275)
!1277 = !DILocation(line: 118, column: 7, scope: !1275)
!1278 = !DILocation(line: 118, column: 29, scope: !1275)
!1279 = !DILocation(line: 119, column: 7, scope: !1275)
!1280 = !DILocation(line: 119, column: 12, scope: !1275)
!1281 = !{i8 0, i8 2}
!1282 = !DILocation(line: 119, column: 25, scope: !1275)
!1283 = !DILocation(line: 119, column: 28, scope: !1275)
!1284 = !DILocation(line: 119, column: 34, scope: !1275)
!1285 = !DILocation(line: 118, column: 7, scope: !1271)
!1286 = !DILocation(line: 121, column: 33, scope: !1274)
!1287 = !DILocation(line: 0, scope: !1274)
!1288 = !DILocation(line: 122, column: 11, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1274, file: !391, line: 122, column: 11)
!1290 = !DILocation(line: 0, scope: !1289)
!1291 = !DILocation(line: 122, column: 11, scope: !1274)
!1292 = !DILocation(line: 123, column: 9, scope: !1289)
!1293 = !DILocation(line: 126, column: 9, scope: !1289)
!1294 = !DILocation(line: 128, column: 14, scope: !1274)
!1295 = !DILocation(line: 128, column: 7, scope: !1274)
!1296 = !DILocation(line: 133, column: 42, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1271, file: !391, line: 133, column: 7)
!1298 = !DILocation(line: 133, column: 28, scope: !1297)
!1299 = !DILocation(line: 133, column: 50, scope: !1297)
!1300 = !DILocation(line: 133, column: 7, scope: !1271)
!1301 = !DILocation(line: 134, column: 12, scope: !1297)
!1302 = !DILocation(line: 134, column: 5, scope: !1297)
!1303 = !DILocation(line: 135, column: 1, scope: !1271)
!1304 = !DISubprogram(name: "_exit", scope: !1227, file: !1227, line: 624, type: !182, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !901)
!1305 = distinct !DISubprogram(name: "verror", scope: !406, file: !406, line: 251, type: !1306, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1308)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{null, !184, !184, !134, !416}
!1308 = !{!1309, !1310, !1311, !1312}
!1309 = !DILocalVariable(name: "status", arg: 1, scope: !1305, file: !406, line: 251, type: !184)
!1310 = !DILocalVariable(name: "errnum", arg: 2, scope: !1305, file: !406, line: 251, type: !184)
!1311 = !DILocalVariable(name: "message", arg: 3, scope: !1305, file: !406, line: 251, type: !134)
!1312 = !DILocalVariable(name: "args", arg: 4, scope: !1305, file: !406, line: 251, type: !416)
!1313 = !DILocation(line: 0, scope: !1305)
!1314 = !DILocation(line: 251, column: 1, scope: !1305)
!1315 = !DILocation(line: 261, column: 3, scope: !1305)
!1316 = !DILocation(line: 265, column: 7, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1305, file: !406, line: 265, column: 7)
!1318 = !DILocation(line: 265, column: 7, scope: !1305)
!1319 = !DILocation(line: 266, column: 5, scope: !1317)
!1320 = !DILocation(line: 272, column: 7, scope: !1321)
!1321 = distinct !DILexicalBlock(scope: !1317, file: !406, line: 268, column: 5)
!1322 = !DILocation(line: 276, column: 3, scope: !1305)
!1323 = !{i64 0, i64 8, !848, i64 8, i64 8, !848, i64 16, i64 8, !848, i64 24, i64 4, !916, i64 28, i64 4, !916}
!1324 = !DILocation(line: 282, column: 1, scope: !1305)
!1325 = distinct !DISubprogram(name: "flush_stdout", scope: !406, file: !406, line: 163, type: !458, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1326)
!1326 = !{!1327}
!1327 = !DILocalVariable(name: "stdout_fd", scope: !1325, file: !406, line: 166, type: !184)
!1328 = !DILocation(line: 0, scope: !1325)
!1329 = !DILocalVariable(name: "fd", arg: 1, scope: !1330, file: !406, line: 145, type: !184)
!1330 = distinct !DISubprogram(name: "is_open", scope: !406, file: !406, line: 145, type: !1228, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1331)
!1331 = !{!1329}
!1332 = !DILocation(line: 0, scope: !1330, inlinedAt: !1333)
!1333 = distinct !DILocation(line: 182, column: 25, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1325, file: !406, line: 182, column: 7)
!1335 = !DILocation(line: 157, column: 15, scope: !1330, inlinedAt: !1333)
!1336 = !DILocation(line: 157, column: 12, scope: !1330, inlinedAt: !1333)
!1337 = !DILocation(line: 182, column: 7, scope: !1325)
!1338 = !DILocation(line: 184, column: 5, scope: !1334)
!1339 = !DILocation(line: 185, column: 1, scope: !1325)
!1340 = distinct !DISubprogram(name: "error_tail", scope: !406, file: !406, line: 219, type: !1306, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1341)
!1341 = !{!1342, !1343, !1344, !1345}
!1342 = !DILocalVariable(name: "status", arg: 1, scope: !1340, file: !406, line: 219, type: !184)
!1343 = !DILocalVariable(name: "errnum", arg: 2, scope: !1340, file: !406, line: 219, type: !184)
!1344 = !DILocalVariable(name: "message", arg: 3, scope: !1340, file: !406, line: 219, type: !134)
!1345 = !DILocalVariable(name: "args", arg: 4, scope: !1340, file: !406, line: 219, type: !416)
!1346 = !DILocation(line: 0, scope: !1340)
!1347 = !DILocation(line: 219, column: 1, scope: !1340)
!1348 = !DILocation(line: 229, column: 13, scope: !1340)
!1349 = !DILocation(line: 135, column: 10, scope: !1350, inlinedAt: !1392)
!1350 = distinct !DISubprogram(name: "vfprintf", scope: !903, file: !903, line: 132, type: !1351, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !405, retainedNodes: !1388)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!184, !1353, !907, !418}
!1353 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !324, line: 7, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !326, line: 49, size: 1728, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1356, file: !326, line: 51, baseType: !184, size: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1356, file: !326, line: 54, baseType: !330, size: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1356, file: !326, line: 55, baseType: !330, size: 64, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1356, file: !326, line: 56, baseType: !330, size: 64, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1356, file: !326, line: 57, baseType: !330, size: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1356, file: !326, line: 58, baseType: !330, size: 64, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1356, file: !326, line: 59, baseType: !330, size: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1356, file: !326, line: 60, baseType: !330, size: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1356, file: !326, line: 61, baseType: !330, size: 64, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1356, file: !326, line: 64, baseType: !330, size: 64, offset: 576)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1356, file: !326, line: 65, baseType: !330, size: 64, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1356, file: !326, line: 66, baseType: !330, size: 64, offset: 704)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1356, file: !326, line: 68, baseType: !342, size: 64, offset: 768)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1356, file: !326, line: 70, baseType: !1372, size: 64, offset: 832)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
