; ModuleID = 'src/od.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.tspec = type { i32, i32, ptr, [18 x i8], i8, i32, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.12 }
%union.anon.12 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1829, type: !24, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !24, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1832, type: !24, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1833, type: !24, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1835, type: !24, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !318, isLocal: true, isDefinition: true)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 14)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1863, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 13)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 46)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1949, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 17)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !24, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1950, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 45)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1970, type: !100, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1973, type: !24, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2012, type: !340, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2031, type: !333, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2061, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 15)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "string_min", scope: !161, file: !2, line: 193, type: !257, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "flag_dump_strings", scope: !161, file: !2, line: 196, type: !241, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "traditional", scope: !161, file: !2, line: 201, type: !241, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "flag_pseudo_start", scope: !161, file: !2, line: 204, type: !241, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "pseudo_offset", scope: !161, file: !2, line: 208, type: !366, isLocal: true, isDefinition: true)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !367, line: 101, baseType: !368)
!367 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !369, line: 72, baseType: !260)
!369 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "n_bytes_to_skip", scope: !161, file: !2, line: 216, type: !366, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "spec", scope: !161, file: !2, line: 228, type: !374, isLocal: true, isDefinition: true)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tspec", file: !2, line: 122, size: 384, elements: !376)
!376 = !{!377, !378, !379, !380, !384, !385, !386}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !375, file: !2, line: 124, baseType: !185, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !375, file: !2, line: 125, baseType: !196, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "print_function", scope: !375, file: !2, line: 126, baseType: !253, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_string", scope: !375, file: !2, line: 127, baseType: !381, size: 144, offset: 128)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 18)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "hexl_mode_trailer", scope: !375, file: !2, line: 128, baseType: !241, size: 8, offset: 272)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "field_width", scope: !375, file: !2, line: 129, baseType: !158, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pad_width", scope: !375, file: !2, line: 130, baseType: !257, size: 64, offset: 320)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "n_specs", scope: !161, file: !2, line: 231, type: !257, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "bytes_per_block", scope: !161, file: !2, line: 240, type: !257, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "file_list", scope: !161, file: !2, line: 247, type: !244, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "in_stream", scope: !161, file: !2, line: 254, type: !395, isLocal: true, isDefinition: true)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !397, line: 7, baseType: !398)
!397 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !399, line: 49, size: 1728, elements: !400)
!399 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !416, !418, !419, !420, !422, !423, !425, !426, !429, !431, !434, !437, !438, !439, !440, !441}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !398, file: !399, line: 51, baseType: !158, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !398, file: !399, line: 54, baseType: !160, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !398, file: !399, line: 55, baseType: !160, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !398, file: !399, line: 56, baseType: !160, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !398, file: !399, line: 57, baseType: !160, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !398, file: !399, line: 58, baseType: !160, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !398, file: !399, line: 59, baseType: !160, size: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !398, file: !399, line: 60, baseType: !160, size: 64, offset: 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !398, file: !399, line: 61, baseType: !160, size: 64, offset: 512)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !398, file: !399, line: 64, baseType: !160, size: 64, offset: 576)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !398, file: !399, line: 65, baseType: !160, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !398, file: !399, line: 66, baseType: !160, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !398, file: !399, line: 68, baseType: !414, size: 64, offset: 768)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !399, line: 36, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !398, file: !399, line: 70, baseType: !417, size: 64, offset: 832)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !398, file: !399, line: 72, baseType: !158, size: 32, offset: 896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !398, file: !399, line: 73, baseType: !158, size: 32, offset: 928)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !398, file: !399, line: 74, baseType: !421, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !369, line: 152, baseType: !260)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !398, file: !399, line: 77, baseType: !248, size: 16, offset: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !398, file: !399, line: 78, baseType: !424, size: 8, offset: 1040)
!424 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !398, file: !399, line: 79, baseType: !265, size: 8, offset: 1048)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !398, file: !399, line: 81, baseType: !427, size: 64, offset: 1088)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !399, line: 43, baseType: null)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !398, file: !399, line: 89, baseType: !430, size: 64, offset: 1152)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !369, line: 153, baseType: !260)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !398, file: !399, line: 91, baseType: !432, size: 64, offset: 1216)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !399, line: 37, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !398, file: !399, line: 92, baseType: !435, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !399, line: 38, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !398, file: !399, line: 93, baseType: !417, size: 64, offset: 1344)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !398, file: !399, line: 94, baseType: !240, size: 64, offset: 1408)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !398, file: !399, line: 95, baseType: !249, size: 64, offset: 1472)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !398, file: !399, line: 96, baseType: !158, size: 32, offset: 1536)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !398, file: !399, line: 98, baseType: !442, size: 160, offset: 1568)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 20)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !161, file: !2, line: 257, type: !241, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "input_swap", scope: !161, file: !2, line: 305, type: !241, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !181, line: 729, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 56)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !181, line: 736, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 75)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !461, file: !181, line: 575, type: !158, isLocal: true, isDefinition: true)
!461 = distinct !DISubprogram(name: "oputs_", scope: !181, file: !181, line: 573, type: !462, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !464)
!462 = !DISubroutineType(cc: DW_CC_nocall, types: !463)
!463 = !{null, !246, !246}
!464 = !{!465, !466, !467, !470, !471, !472, !473, !477, !478, !479, !480, !482, !483, !484, !485, !487, !488}
!465 = !DILocalVariable(name: "program", arg: 1, scope: !461, file: !181, line: 573, type: !246)
!466 = !DILocalVariable(name: "option", arg: 2, scope: !461, file: !181, line: 573, type: !246)
!467 = !DILocalVariable(name: "term", scope: !468, file: !181, line: 585, type: !246)
!468 = distinct !DILexicalBlock(scope: !469, file: !181, line: 582, column: 5)
!469 = distinct !DILexicalBlock(scope: !461, file: !181, line: 581, column: 7)
!470 = !DILocalVariable(name: "double_space", scope: !461, file: !181, line: 594, type: !241)
!471 = !DILocalVariable(name: "first_word", scope: !461, file: !181, line: 595, type: !246)
!472 = !DILocalVariable(name: "option_text", scope: !461, file: !181, line: 596, type: !246)
!473 = !DILocalVariable(name: "s", scope: !474, file: !181, line: 608, type: !246)
!474 = distinct !DILexicalBlock(scope: !475, file: !181, line: 605, column: 5)
!475 = distinct !DILexicalBlock(scope: !476, file: !181, line: 604, column: 12)
!476 = distinct !DILexicalBlock(scope: !461, file: !181, line: 597, column: 7)
!477 = !DILocalVariable(name: "spaces", scope: !474, file: !181, line: 609, type: !249)
!478 = !DILocalVariable(name: "anchor_len", scope: !461, file: !181, line: 620, type: !249)
!479 = !DILocalVariable(name: "desc_text", scope: !461, file: !181, line: 625, type: !246)
!480 = !DILocalVariable(name: "__ptr", scope: !481, file: !181, line: 644, type: !246)
!481 = distinct !DILexicalBlock(scope: !461, file: !181, line: 644, column: 3)
!482 = !DILocalVariable(name: "__stream", scope: !481, file: !181, line: 644, type: !395)
!483 = !DILocalVariable(name: "__cnt", scope: !481, file: !181, line: 644, type: !249)
!484 = !DILocalVariable(name: "url_program", scope: !461, file: !181, line: 648, type: !246)
!485 = !DILocalVariable(name: "__ptr", scope: !486, file: !181, line: 686, type: !246)
!486 = distinct !DILexicalBlock(scope: !461, file: !181, line: 686, column: 3)
!487 = !DILocalVariable(name: "__stream", scope: !486, file: !181, line: 686, type: !395)
!488 = !DILocalVariable(name: "__cnt", scope: !486, file: !181, line: 686, type: !249)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !181, line: 585, type: !491, isLocal: true, isDefinition: true)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 5)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !181, line: 586, type: !491, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !181, line: 595, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 4)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(scope: null, file: !181, line: 620, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 6)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !287, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !181, line: 648, type: !491, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !498, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !181, line: 649, type: !24, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !181, line: 650, type: !491, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !503, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !181, line: 651, type: !503, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !181, line: 652, type: !522, isLocal: true, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 7)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !181, line: 653, type: !527, isLocal: true, isDefinition: true)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 8)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !181, line: 654, type: !270, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !181, line: 655, type: !270, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !181, line: 656, type: !270, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !181, line: 657, type: !270, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !181, line: 663, type: !522, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !181, line: 664, type: !270, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !333, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !181, line: 669, type: !546, isLocal: true, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 40)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !353, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(scope: null, file: !181, line: 676, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 61)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !181, line: 679, type: !24, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !181, line: 683, type: !491, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !181, line: 688, type: !491, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !181, line: 691, type: !527, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !181, line: 839, type: !566, isLocal: true, isDefinition: true)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 16)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !181, line: 840, type: !571, isLocal: true, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 22)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(scope: null, file: !181, line: 841, type: !353, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !181, line: 862, type: !498, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !181, line: 868, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 71)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !181, line: 875, type: !585, isLocal: true, isDefinition: true)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 27)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !120, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(scope: null, file: !181, line: 877, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 12)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "short_options", scope: !161, file: !2, line: 307, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 280, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 35)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !2, line: 335, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 11)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 336, type: !318, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 337, type: !602, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 338, type: !522, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 339, type: !381, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !527, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !592, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !2, line: 342, type: !503, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !2, line: 343, type: !522, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !2, line: 345, type: !491, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !2, line: 346, type: !527, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "long_options", scope: !161, file: !2, line: 333, type: !627, isLocal: true, isDefinition: true)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 3072, elements: !593)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !630, line: 50, size: 256, elements: !631)
!630 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!631 = !{!632, !633, !634, !636}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !629, file: !630, line: 52, baseType: !246, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !629, file: !630, line: 55, baseType: !158, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !629, file: !630, line: 56, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !629, file: !630, line: 57, baseType: !158, size: 32, offset: 192)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1267, type: !333, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "format_address", scope: !161, file: !2, line: 213, type: !641, isLocal: true, isDefinition: true)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{null, !366, !4}
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "address_base", scope: !161, file: !2, line: 182, type: !158, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "address_pad_len", scope: !161, file: !2, line: 190, type: !158, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !270, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !282, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 328, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 41)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "n_specs_allocated", scope: !161, file: !2, line: 234, type: !257, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !2, line: 797, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 23)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !2, line: 807, type: !666, isLocal: true, isDefinition: true)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 608, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 76)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !503, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !287, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !498, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 824, type: !24, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !282, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !287, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !498, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !2, line: 831, type: !24, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !287, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !498, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !2, line: 838, type: !24, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !287, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !498, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 845, type: !24, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !287, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 868, type: !709, isLocal: true, isDefinition: true)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 664, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 83)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !2, line: 921, type: !714, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 656, elements: !715)
!715 = !{!716}
!716 = !DISubrange(count: 82)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(scope: null, file: !2, line: 937, type: !719, isLocal: true, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 53)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !724, isLocal: true, isDefinition: true)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !655)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "integral_type_size", scope: !161, file: !2, line: 265, type: !727, isLocal: true, isDefinition: true)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 288, elements: !283)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "fp_type_size", scope: !161, file: !2, line: 288, type: !731, isLocal: true, isDefinition: true)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 544, elements: !334)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !2, line: 585, type: !498, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !2, line: 618, type: !498, isLocal: true, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "charname", scope: !161, file: !2, line: 172, type: !738, isLocal: true, isDefinition: true)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 1056, elements: !739)
!739 = !{!740, !500}
!740 = !DISubrange(count: 33)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(scope: null, file: !2, line: 651, type: !24, isLocal: true, isDefinition: true)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !2, line: 655, type: !24, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !2, line: 659, type: !24, isLocal: true, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !2, line: 663, type: !24, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !2, line: 667, type: !24, isLocal: true, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !2, line: 671, type: !24, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !2, line: 675, type: !24, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !2, line: 679, type: !24, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !24, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !2, line: 683, type: !491, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "abbreviate_duplicate_blocks", scope: !161, file: !2, line: 225, type: !241, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "endian_types", scope: !161, file: !2, line: 328, type: !765, isLocal: true, isDefinition: true)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 64, elements: !288)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !522, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !498, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "endian_args", scope: !161, file: !2, line: 323, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 192, elements: !25)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1488, type: !24, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1294, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !598)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "end_offset", scope: !161, file: !2, line: 220, type: !366, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !2, line: 251, type: !287, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "default_file_list", scope: !161, file: !2, line: 251, type: !785, isLocal: true, isDefinition: true)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 128, elements: !288)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1039, type: !287, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "input_filename", scope: !161, file: !2, line: 244, type: !246, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1227, type: !3, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1086, type: !592, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "width_bytes", scope: !161, file: !2, line: 134, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 288, elements: !283)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 32)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1540, type: !805, isLocal: true, isDefinition: true)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 136, elements: !334)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 30)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1409, type: !654, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "first", scope: !815, file: !2, line: 1313, type: !241, isLocal: true, isDefinition: true)
!815 = distinct !DISubprogram(name: "write_block", scope: !2, file: !2, line: 1310, type: !816, scopeLine: 1312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !161, retainedNodes: !818)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !366, !257, !246, !246}
!818 = !{!819, !820, !821, !822, !823, !827, !830, !831, !832, !835, !837}
!819 = !DILocalVariable(name: "current_offset", arg: 1, scope: !815, file: !2, line: 1310, type: !366)
!820 = !DILocalVariable(name: "n_bytes", arg: 2, scope: !815, file: !2, line: 1310, type: !257)
!821 = !DILocalVariable(name: "prev_block", arg: 3, scope: !815, file: !2, line: 1311, type: !246)
!822 = !DILocalVariable(name: "curr_block", arg: 4, scope: !815, file: !2, line: 1311, type: !246)
!823 = !DILocalVariable(name: "i", scope: !824, file: !2, line: 1334, type: !257)
!824 = distinct !DILexicalBlock(scope: !825, file: !2, line: 1334, column: 7)
!825 = distinct !DILexicalBlock(scope: !826, file: !2, line: 1332, column: 5)
!826 = distinct !DILexicalBlock(scope: !815, file: !2, line: 1316, column: 7)
!827 = !DILocalVariable(name: "datum_width", scope: !828, file: !2, line: 1336, type: !158)
!828 = distinct !DILexicalBlock(scope: !829, file: !2, line: 1335, column: 9)
!829 = distinct !DILexicalBlock(scope: !824, file: !2, line: 1334, column: 7)
!830 = !DILocalVariable(name: "fields_per_block", scope: !828, file: !2, line: 1337, type: !257)
!831 = !DILocalVariable(name: "blank_fields", scope: !828, file: !2, line: 1338, type: !257)
!832 = !DILocalVariable(name: "field_width", scope: !833, file: !2, line: 1349, type: !158)
!833 = distinct !DILexicalBlock(scope: !834, file: !2, line: 1347, column: 13)
!834 = distinct !DILexicalBlock(scope: !828, file: !2, line: 1346, column: 15)
!835 = !DILocalVariable(name: "f", scope: !836, file: !2, line: 1350, type: !257)
!836 = distinct !DILexicalBlock(scope: !833, file: !2, line: 1350, column: 15)
!837 = !DILocalVariable(name: "pad_width", scope: !833, file: !2, line: 1352, type: !257)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "prev_pair_equal", scope: !815, file: !2, line: 1314, type: !241, isLocal: true, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1327, type: !24, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !2, line: 594, type: !498, isLocal: true, isDefinition: true)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !857, !858, !859, !860, !864, !867, !870, !871, !873, !876, !877, !879, !882, !883}
!845 = !DILocalVariable(name: "argc", arg: 1, scope: !155, file: !2, line: 1677, type: !158)
!846 = !DILocalVariable(name: "argv", arg: 2, scope: !155, file: !2, line: 1677, type: !159)
!847 = !DILocalVariable(name: "n_files", scope: !155, file: !2, line: 1679, type: !158)
!848 = !DILocalVariable(name: "l_c_m", scope: !155, file: !2, line: 1680, type: !158)
!849 = !DILocalVariable(name: "desired_width", scope: !155, file: !2, line: 1681, type: !257)
!850 = !DILocalVariable(name: "modern", scope: !155, file: !2, line: 1682, type: !241)
!851 = !DILocalVariable(name: "ok", scope: !155, file: !2, line: 1683, type: !241)
!852 = !DILocalVariable(name: "width_per_block", scope: !155, file: !2, line: 1684, type: !257)
!853 = !DILocalVariable(name: "max_bytes_to_format", scope: !155, file: !2, line: 1689, type: !366)
!854 = !DILocalVariable(name: "pseudo_start", scope: !155, file: !2, line: 1693, type: !366)
!855 = !DILocalVariable(name: "tmp", scope: !856, file: !2, line: 1705, type: !366)
!856 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1704, column: 5)
!857 = !DILocalVariable(name: "s_err", scope: !856, file: !2, line: 1706, type: !163)
!858 = !DILocalVariable(name: "oi", scope: !856, file: !2, line: 1707, type: !158)
!859 = !DILocalVariable(name: "c", scope: !856, file: !2, line: 1708, type: !158)
!860 = !DILocalVariable(name: "i", scope: !861, file: !2, line: 1769, type: !257)
!861 = distinct !DILexicalBlock(scope: !862, file: !2, line: 1765, column: 13)
!862 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1762, column: 15)
!863 = distinct !DILexicalBlock(scope: !856, file: !2, line: 1713, column: 9)
!864 = !DILocalVariable(name: "w_tmp", scope: !865, file: !2, line: 1847, type: !366)
!865 = distinct !DILexicalBlock(scope: !866, file: !2, line: 1846, column: 13)
!866 = distinct !DILexicalBlock(scope: !863, file: !2, line: 1841, column: 15)
!867 = !DILocalVariable(name: "o1", scope: !868, file: !2, line: 1894, type: !366)
!868 = distinct !DILexicalBlock(scope: !869, file: !2, line: 1893, column: 5)
!869 = distinct !DILexicalBlock(scope: !155, file: !2, line: 1892, column: 7)
!870 = !DILocalVariable(name: "o2", scope: !868, file: !2, line: 1895, type: !366)
!871 = !DILocalVariable(name: "i", scope: !872, file: !2, line: 2027, type: !257)
!872 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2027, column: 3)
!873 = !DILocalVariable(name: "fields_per_block", scope: !874, file: !2, line: 2029, type: !257)
!874 = distinct !DILexicalBlock(scope: !875, file: !2, line: 2028, column: 5)
!875 = distinct !DILexicalBlock(scope: !872, file: !2, line: 2027, column: 3)
!876 = !DILocalVariable(name: "block_width", scope: !874, file: !2, line: 2032, type: !257)
!877 = !DILocalVariable(name: "i", scope: !878, file: !2, line: 2036, type: !257)
!878 = distinct !DILexicalBlock(scope: !155, file: !2, line: 2036, column: 3)
!879 = !DILocalVariable(name: "fields_per_block", scope: !880, file: !2, line: 2038, type: !257)
!880 = distinct !DILexicalBlock(scope: !881, file: !2, line: 2037, column: 5)
!881 = distinct !DILexicalBlock(scope: !878, file: !2, line: 2036, column: 3)
!882 = !DILocalVariable(name: "block_width", scope: !880, file: !2, line: 2039, type: !257)
!883 = !DILabel(scope: !155, name: "cleanup", file: !2, line: 2058)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 120, elements: !354)
!885 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!886 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!887 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!888 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!889 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!890 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!891 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(scope: null, file: !895, line: 3, type: !353, isLocal: true, isDefinition: true)
!895 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "Version", scope: !898, file: !895, line: 3, type: !246, isLocal: false, isDefinition: true)
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !895, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !899, splitDebugInlining: false, nameTableKind: None)
!899 = !{!893, !896}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !902, file: !903, line: 65, type: !925, isLocal: false, isDefinition: true)
!902 = distinct !DICompileUnit(language: DW_LANG_C11, file: !903, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !904, retainedTypes: !905, globals: !906, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!904 = !{!225}
!905 = !{!240, !246, !252}
!906 = !{!900, !907, !909, !911, !916, !921, !923}
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(scope: null, file: !903, line: 141, type: !522, isLocal: true, isDefinition: true)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(scope: null, file: !903, line: 141, type: !585, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(scope: null, file: !903, line: 142, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 29)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !903, line: 160, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 21)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !903, line: 165, type: !527, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !903, line: 170, type: !491, isLocal: true, isDefinition: true)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !926, line: 69, baseType: !927)
!926 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{null}
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "file_name", scope: !932, file: !933, line: 45, type: !246, isLocal: true, isDefinition: true)
!932 = distinct !DICompileUnit(language: DW_LANG_C11, file: !933, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !934, splitDebugInlining: false, nameTableKind: None)
!933 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!934 = !{!935, !937, !939, !941, !930, !943}
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !933, line: 121, type: !522, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !933, line: 121, type: !592, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !933, line: 123, type: !522, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !933, line: 126, type: !24, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !932, file: !933, line: 55, type: !241, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !947, file: !948, line: 66, type: !927, isLocal: false, isDefinition: true)
!947 = distinct !DICompileUnit(language: DW_LANG_C11, file: !948, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !949, globals: !950, splitDebugInlining: false, nameTableKind: None)
!948 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!949 = !{!240, !252}
!950 = !{!951, !953, !978, !980, !982, !984, !945, !986, !988, !990, !992, !994}
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !948, line: 272, type: !491, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "old_file_name", scope: !955, file: !948, line: 304, type: !246, isLocal: true, isDefinition: true)
!955 = distinct !DISubprogram(name: "verror_at_line", scope: !948, file: !948, line: 298, type: !956, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !947, retainedNodes: !971)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !158, !158, !246, !165, !246, !958}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !959, line: 52, baseType: !960)
!959 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !961, line: 14, baseType: !962)
!961 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !963, baseType: !964)
!963 = !DIFile(filename: "lib/error.c", directory: "/src")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !964, file: !963, baseType: !240, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !964, file: !963, baseType: !240, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !964, file: !963, baseType: !240, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !964, file: !963, baseType: !158, size: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !964, file: !963, baseType: !158, size: 32, offset: 224)
!971 = !{!972, !973, !974, !975, !976, !977}
!972 = !DILocalVariable(name: "status", arg: 1, scope: !955, file: !948, line: 298, type: !158)
!973 = !DILocalVariable(name: "errnum", arg: 2, scope: !955, file: !948, line: 298, type: !158)
!974 = !DILocalVariable(name: "file_name", arg: 3, scope: !955, file: !948, line: 298, type: !246)
!975 = !DILocalVariable(name: "line_number", arg: 4, scope: !955, file: !948, line: 298, type: !165)
!976 = !DILocalVariable(name: "message", arg: 5, scope: !955, file: !948, line: 298, type: !246)
!977 = !DILocalVariable(name: "args", arg: 6, scope: !955, file: !948, line: 298, type: !958)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "old_line_number", scope: !955, file: !948, line: 305, type: !165, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !948, line: 338, type: !498, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !948, line: 346, type: !527, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !948, line: 346, type: !287, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "error_message_count", scope: !947, file: !948, line: 69, type: !165, isLocal: false, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !947, file: !948, line: 295, type: !158, isLocal: false, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !948, line: 208, type: !522, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !948, line: 208, type: !918, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !948, line: 214, type: !491, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "program_name", scope: !998, file: !999, line: 31, type: !246, isLocal: false, isDefinition: true)
!998 = distinct !DICompileUnit(language: DW_LANG_C11, file: !999, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1000, globals: !1001, splitDebugInlining: false, nameTableKind: None)
!999 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!1000 = !{!160}
!1001 = !{!996, !1002, !1004}
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !999, line: 46, type: !527, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !999, line: 49, type: !498, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "utf07FF", scope: !1008, file: !1009, line: 46, type: !1036, isLocal: true, isDefinition: true)
!1008 = distinct !DISubprogram(name: "proper_name_lite", scope: !1009, file: !1009, line: 38, type: !1010, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1012, retainedNodes: !1014)
!1009 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!246, !246, !246}
!1012 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1009, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1013, splitDebugInlining: false, nameTableKind: None)
!1013 = !{!1006}
!1014 = !{!1015, !1016, !1017, !1018, !1023}
!1015 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !1008, file: !1009, line: 38, type: !246)
!1016 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !1008, file: !1009, line: 38, type: !246)
!1017 = !DILocalVariable(name: "translation", scope: !1008, file: !1009, line: 40, type: !246)
!1018 = !DILocalVariable(name: "w", scope: !1008, file: !1009, line: 47, type: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !1020, line: 37, baseType: !1021)
!1020 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !369, line: 57, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !369, line: 42, baseType: !165)
!1023 = !DILocalVariable(name: "mbs", scope: !1008, file: !1009, line: 48, type: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1025, line: 6, baseType: !1026)
!1025 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1027, line: 21, baseType: !1028)
!1027 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 13, size: 64, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1028, file: !1027, line: 15, baseType: !158, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1028, file: !1027, line: 20, baseType: !1032, size: 32, offset: 32)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !1027, line: 16, size: 32, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1032, file: !1027, line: 18, baseType: !165, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1032, file: !1027, line: 19, baseType: !498, size: 32)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 16, elements: !288)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 78, type: !527, isLocal: true, isDefinition: true)
!1039 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 79, type: !503, isLocal: true, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 80, type: !323, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 81, type: !323, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 82, type: !442, isLocal: true, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 83, type: !287, isLocal: true, isDefinition: true)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 84, type: !527, isLocal: true, isDefinition: true)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 85, type: !522, isLocal: true, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 86, type: !522, isLocal: true, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 87, type: !527, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1060, file: !1039, line: 76, type: !1132, isLocal: false, isDefinition: true)
!1060 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1039, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1067, globals: !1068, splitDebugInlining: false, nameTableKind: None)
!1061 = !{!225, !1062, !210}
!1062 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !226, line: 254, baseType: !165, size: 32, elements: !1063)
!1063 = !{!1064, !1065, !1066}
!1064 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!1065 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!1066 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!1067 = !{!158, !248, !249}
!1068 = !{!1037, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1069, !1073, !1083, !1085, !1090, !1092, !1094, !1096, !1098, !1121, !1128, !1130}
!1069 = !DIGlobalVariableExpression(var: !1070, expr: !DIExpression())
!1070 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1060, file: !1039, line: 92, type: !1071, isLocal: false, isDefinition: true)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 320, elements: !271)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!1073 = !DIGlobalVariableExpression(var: !1074, expr: !DIExpression())
!1074 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1060, file: !1039, line: 1040, type: !1075, isLocal: false, isDefinition: true)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !1039, line: 56, size: 448, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1075, file: !1039, line: 59, baseType: !225, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !1039, line: 62, baseType: !158, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1075, file: !1039, line: 66, baseType: !1080, size: 256, offset: 64)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 256, elements: !528)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1075, file: !1039, line: 69, baseType: !246, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1075, file: !1039, line: 72, baseType: !246, size: 64, offset: 384)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1060, file: !1039, line: 107, type: !1075, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "slot0", scope: !1060, file: !1039, line: 831, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 256)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 321, type: !287, isLocal: true, isDefinition: true)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 357, type: !287, isLocal: true, isDefinition: true)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 358, type: !287, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(scope: null, file: !1039, line: 199, type: !522, isLocal: true, isDefinition: true)
!1098 = !DIGlobalVariableExpression(var: !1099, expr: !DIExpression())
!1099 = distinct !DIGlobalVariable(name: "quote", scope: !1100, file: !1039, line: 228, type: !1119, isLocal: true, isDefinition: true)
!1100 = distinct !DISubprogram(name: "gettext_quote", scope: !1039, file: !1039, line: 197, type: !1101, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1060, retainedNodes: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!246, !246, !225}
!1103 = !{!1104, !1105, !1106, !1107, !1108}
!1104 = !DILocalVariable(name: "msgid", arg: 1, scope: !1100, file: !1039, line: 197, type: !246)
!1105 = !DILocalVariable(name: "s", arg: 2, scope: !1100, file: !1039, line: 197, type: !225)
!1106 = !DILocalVariable(name: "translation", scope: !1100, file: !1039, line: 199, type: !246)
!1107 = !DILocalVariable(name: "w", scope: !1100, file: !1039, line: 229, type: !1019)
!1108 = !DILocalVariable(name: "mbs", scope: !1100, file: !1039, line: 230, type: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1025, line: 6, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1027, line: 21, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 13, size: 64, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1111, file: !1027, line: 15, baseType: !158, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1111, file: !1027, line: 20, baseType: !1115, size: 32, offset: 32)
!1115 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1111, file: !1027, line: 16, size: 32, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1115, file: !1027, line: 18, baseType: !165, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1115, file: !1027, line: 19, baseType: !498, size: 32)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 64, elements: !1120)
!1120 = !{!289, !500}
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "slotvec", scope: !1060, file: !1039, line: 834, type: !1123, isLocal: true, isDefinition: true)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !1039, line: 823, size: 128, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1039, line: 825, baseType: !249, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1124, file: !1039, line: 826, baseType: !160, size: 64, offset: 64)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "nslots", scope: !1060, file: !1039, line: 832, type: !158, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1060, file: !1039, line: 833, type: !1124, isLocal: true, isDefinition: true)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 704, elements: !603)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 67, type: !592, isLocal: true, isDefinition: true)
!1135 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 69, type: !522, isLocal: true, isDefinition: true)
!1138 = !DIGlobalVariableExpression(var: !1139, expr: !DIExpression())
!1139 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 83, type: !522, isLocal: true, isDefinition: true)
!1140 = !DIGlobalVariableExpression(var: !1141, expr: !DIExpression())
!1141 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 83, type: !498, isLocal: true, isDefinition: true)
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 85, type: !287, isLocal: true, isDefinition: true)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 88, type: !1146, isLocal: true, isDefinition: true)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 171)
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 88, type: !1151, isLocal: true, isDefinition: true)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !1152)
!1152 = !{!1153}
!1153 = !DISubrange(count: 34)
!1154 = !DIGlobalVariableExpression(var: !1155, expr: !DIExpression())
!1155 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 105, type: !566, isLocal: true, isDefinition: true)
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 109, type: !661, isLocal: true, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 113, type: !1160, isLocal: true, isDefinition: true)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !1161)
!1161 = !{!1162}
!1162 = !DISubrange(count: 28)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 120, type: !800, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 127, type: !1167, isLocal: true, isDefinition: true)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !1168)
!1168 = !{!1169}
!1169 = !DISubrange(count: 36)
!1170 = !DIGlobalVariableExpression(var: !1171, expr: !DIExpression())
!1171 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 134, type: !546, isLocal: true, isDefinition: true)
!1172 = !DIGlobalVariableExpression(var: !1173, expr: !DIExpression())
!1173 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 142, type: !110, isLocal: true, isDefinition: true)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 150, type: !1176, isLocal: true, isDefinition: true)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 48)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 159, type: !1181, isLocal: true, isDefinition: true)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1182)
!1182 = !{!1183}
!1183 = !DISubrange(count: 52)
!1184 = !DIGlobalVariableExpression(var: !1185, expr: !DIExpression())
!1185 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 170, type: !95, isLocal: true, isDefinition: true)
!1186 = !DIGlobalVariableExpression(var: !1187, expr: !DIExpression())
!1187 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 248, type: !442, isLocal: true, isDefinition: true)
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 248, type: !571, isLocal: true, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 254, type: !442, isLocal: true, isDefinition: true)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 254, type: !318, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 254, type: !546, isLocal: true, isDefinition: true)
!1196 = !DIGlobalVariableExpression(var: !1197, expr: !DIExpression())
!1197 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 259, type: !3, isLocal: true, isDefinition: true)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(scope: null, file: !1135, line: 259, type: !913, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1202, file: !1203, line: 26, type: !1205, isLocal: false, isDefinition: true)
!1202 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1203, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1204, splitDebugInlining: false, nameTableKind: None)
!1203 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1204 = !{!1200}
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 376, elements: !1206)
!1206 = !{!1207}
!1207 = !DISubrange(count: 47)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(scope: null, file: !1210, line: 34, type: !24, isLocal: true, isDefinition: true)
!1210 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1211 = !DIGlobalVariableExpression(var: !1212, expr: !DIExpression())
!1212 = distinct !DIGlobalVariable(scope: null, file: !1210, line: 34, type: !522, isLocal: true, isDefinition: true)
!1213 = !DIGlobalVariableExpression(var: !1214, expr: !DIExpression())
!1214 = distinct !DIGlobalVariable(scope: null, file: !1210, line: 34, type: !333, isLocal: true, isDefinition: true)
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(scope: null, file: !1217, line: 47, type: !522, isLocal: true, isDefinition: true)
!1217 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!1218 = !DIGlobalVariableExpression(var: !1219, expr: !DIExpression())
!1219 = distinct !DIGlobalVariable(scope: null, file: !1217, line: 47, type: !800, isLocal: true, isDefinition: true)
!1220 = !DIGlobalVariableExpression(var: !1221, expr: !DIExpression())
!1221 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1222, file: !1223, line: 24, type: !1225, isLocal: false, isDefinition: true)
!1222 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1223, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1224, splitDebugInlining: false, nameTableKind: None)
!1223 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1224 = !{!1220}
!1225 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(scope: null, file: !1228, line: 60, type: !585, isLocal: true, isDefinition: true)
!1228 = !DIFile(filename: "lib/xstrtol-error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2e52d914fe4a785afe55c8537f55bbf4")
!1229 = !DIGlobalVariableExpression(var: !1230, expr: !DIExpression())
!1230 = distinct !DIGlobalVariable(scope: null, file: !1228, line: 65, type: !100, isLocal: true, isDefinition: true)
!1231 = !DIGlobalVariableExpression(var: !1232, expr: !DIExpression())
!1232 = distinct !DIGlobalVariable(scope: null, file: !1228, line: 69, type: !913, isLocal: true, isDefinition: true)
!1233 = !DIGlobalVariableExpression(var: !1234, expr: !DIExpression())
!1234 = distinct !DIGlobalVariable(scope: null, file: !1228, line: 73, type: !24, isLocal: true, isDefinition: true)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(scope: null, file: !1228, line: 86, type: !522, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(scope: null, file: !1239, line: 108, type: !265, isLocal: true, isDefinition: true)
!1239 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1240 = !DIGlobalVariableExpression(var: !1241, expr: !DIExpression())
!1241 = distinct !DIGlobalVariable(name: "internal_state", scope: !1242, file: !1239, line: 97, type: !1245, isLocal: true, isDefinition: true)
!1242 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1239, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1243, globals: !1244, splitDebugInlining: false, nameTableKind: None)
!1243 = !{!240, !249, !252}
!1244 = !{!1237, !1240}
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !1025, line: 6, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !1027, line: 21, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1027, line: 13, size: 64, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1247, file: !1027, line: 15, baseType: !158, size: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1247, file: !1027, line: 20, baseType: !1251, size: 32, offset: 32)
!1251 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1247, file: !1027, line: 16, size: 32, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1251, file: !1027, line: 18, baseType: !165, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1251, file: !1027, line: 19, baseType: !498, size: 32)
!1255 = !DIGlobalVariableExpression(var: !1256, expr: !DIExpression())
!1256 = distinct !DIGlobalVariable(scope: null, file: !1257, line: 35, type: !287, isLocal: true, isDefinition: true)
!1257 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1258 = !DIGlobalVariableExpression(var: !1259, expr: !DIExpression())
!1259 = distinct !DIGlobalVariable(scope: null, file: !1257, line: 35, type: !503, isLocal: true, isDefinition: true)
!1260 = !DIGlobalVariableExpression(var: !1261, expr: !DIExpression())
!1261 = distinct !DIGlobalVariable(scope: null, file: !1262, line: 202, type: !522, isLocal: true, isDefinition: true)
!1262 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !1265, file: !1262, line: 211, type: !1449, isLocal: true, isDefinition: true)
!1265 = distinct !DISubprogram(name: "printf_fetchargs", scope: !1262, file: !1262, line: 42, type: !1266, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1440, retainedNodes: !1444)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!158, !1268, !1278}
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !961, line: 22, baseType: !1269)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1270, baseType: !1271)
!1270 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1271, file: !1270, baseType: !240, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1271, file: !1270, baseType: !240, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1271, file: !1270, baseType: !240, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1271, file: !1270, baseType: !158, size: 32, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1271, file: !1270, baseType: !158, size: 32, offset: 224)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !1280, line: 185, baseType: !1281)
!1280 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1280, line: 179, size: 1920, elements: !1282)
!1282 = !{!1283, !1284, !1438}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1281, file: !1280, line: 181, baseType: !249, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !1281, file: !1280, line: 182, baseType: !1285, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !1280, line: 174, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1280, line: 111, size: 256, elements: !1288)
!1288 = !{!1289, !1340}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1287, file: !1280, line: 113, baseType: !1290, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !1280, line: 108, baseType: !1291)
!1291 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1280, line: 47, baseType: !165, size: 32, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339}
!1293 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!1294 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!1295 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!1296 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!1297 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!1298 = !DIEnumerator(name: "TYPE_INT", value: 5)
!1299 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!1300 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!1301 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!1302 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!1303 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!1304 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!1305 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!1306 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!1307 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!1308 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!1309 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!1310 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!1311 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!1312 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!1313 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!1314 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!1315 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!1316 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!1317 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!1318 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!1319 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!1320 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!1321 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!1322 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!1323 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!1324 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!1325 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!1326 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!1327 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!1328 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!1329 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!1330 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!1331 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!1332 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!1333 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!1334 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!1335 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!1336 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!1337 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!1338 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!1339 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1287, file: !1280, line: 172, baseType: !1341, size: 128, offset: 128)
!1341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1287, file: !1280, line: 114, size: 128, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1347, !1348, !1349, !1350, !1351, !1352, !1354, !1356, !1360, !1364, !1367, !1370, !1373, !1375, !1378, !1381, !1383, !1385, !1387, !1389, !1391, !1393, !1395, !1397, !1399, !1401, !1403, !1404, !1407, !1408, !1412, !1413, !1415, !1417, !1418, !1420, !1422, !1424, !1426, !1428, !1430, !1432, !1434, !1436}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1341, file: !1280, line: 116, baseType: !424, size: 8)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1341, file: !1280, line: 117, baseType: !252, size: 8)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1341, file: !1280, line: 118, baseType: !1346, size: 16)
!1346 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !1341, file: !1280, line: 119, baseType: !248, size: 16)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !1341, file: !1280, line: 120, baseType: !158, size: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !1341, file: !1280, line: 121, baseType: !165, size: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !1341, file: !1280, line: 122, baseType: !260, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !1341, file: !1280, line: 123, baseType: !251, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !1341, file: !1280, line: 124, baseType: !1353, size: 64)
!1353 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !1341, file: !1280, line: 125, baseType: !1355, size: 64)
!1355 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !1341, file: !1280, line: 126, baseType: !1357, size: 8)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1358, line: 24, baseType: !1359)
!1358 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !369, line: 37, baseType: !424)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !1341, file: !1280, line: 127, baseType: !1361, size: 8)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1362, line: 24, baseType: !1363)
!1362 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !369, line: 38, baseType: !252)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !1341, file: !1280, line: 128, baseType: !1365, size: 16)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1358, line: 25, baseType: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !369, line: 39, baseType: !1346)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !1341, file: !1280, line: 129, baseType: !1368, size: 16)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1362, line: 25, baseType: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !369, line: 40, baseType: !248)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !1341, file: !1280, line: 130, baseType: !1371, size: 32)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1358, line: 26, baseType: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !369, line: 41, baseType: !158)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !1341, file: !1280, line: 131, baseType: !1374, size: 32)
