; ModuleID = 'src/pathchk.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [31 x i8] c"Usage: %s [OPTION]... NAME...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [47 x i8] c"Diagnose invalid or non-portable file names.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"pathchk\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [39 x i8] c"  -p     check for most POSIX systems\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [48 x i8] c"  -P     check for empty names and leading \22-\22\0A\00", align 1, !dbg !24

!129 = !DIEnumerator(name: "_PC_SYMLINK_MAX", value: 19)
!130 = !DIEnumerator(name: "_PC_2_SYMLINKS", value: 20)
!131 = !{!132, !133, !74, !134, !135, !138, !140}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!137 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !{!0, !7, !12, !17, !22, !24, !29, !34, !39, !44, !49, !54, !59, !142, !147, !152, !157, !162, !164, !247, !252, !254, !256, !261, !266, !268, !270, !275, !277, !279, !281, !286, !288, !290, !292, !294, !296, !298, !300, !305, !310, !315, !320, !322, !324, !326, !328, !330, !335, !337, !339, !344, !349, !354, !356, !358, !360, !64, !362, !364, !366, !368, !370, !375, !377, !382, !387, !392}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 14)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 12)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !159, isLocal: true, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 13)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 153, type: !154, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !166, file: !73, line: 575, type: !74, isLocal: true, isDefinition: true)
!166 = distinct !DISubprogram(name: "oputs_", scope: !73, file: !73, line: 573, type: !167, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !169)
!167 = !DISubroutineType(cc: DW_CC_nocall, types: !168)
!168 = !{null, !138, !138}
!169 = !{!170, !171, !172, !175, !177, !178, !179, !183, !184, !185, !186, !188, !241, !242, !243, !245, !246}
!170 = !DILocalVariable(name: "program", arg: 1, scope: !166, file: !73, line: 573, type: !138)
!171 = !DILocalVariable(name: "option", arg: 2, scope: !166, file: !73, line: 573, type: !138)
!172 = !DILocalVariable(name: "term", scope: !173, file: !73, line: 585, type: !138)
!173 = distinct !DILexicalBlock(scope: !174, file: !73, line: 582, column: 5)
!174 = distinct !DILexicalBlock(scope: !166, file: !73, line: 581, column: 7)
!175 = !DILocalVariable(name: "double_space", scope: !166, file: !73, line: 594, type: !176)
!176 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!177 = !DILocalVariable(name: "first_word", scope: !166, file: !73, line: 595, type: !138)
!178 = !DILocalVariable(name: "option_text", scope: !166, file: !73, line: 596, type: !138)
!179 = !DILocalVariable(name: "s", scope: !180, file: !73, line: 608, type: !138)
!180 = distinct !DILexicalBlock(scope: !181, file: !73, line: 605, column: 5)
!181 = distinct !DILexicalBlock(scope: !182, file: !73, line: 604, column: 12)
!182 = distinct !DILexicalBlock(scope: !166, file: !73, line: 597, column: 7)
!183 = !DILocalVariable(name: "spaces", scope: !180, file: !73, line: 609, type: !135)
!184 = !DILocalVariable(name: "anchor_len", scope: !166, file: !73, line: 620, type: !135)
!185 = !DILocalVariable(name: "desc_text", scope: !166, file: !73, line: 625, type: !138)
!186 = !DILocalVariable(name: "__ptr", scope: !187, file: !73, line: 644, type: !138)
!187 = distinct !DILexicalBlock(scope: !166, file: !73, line: 644, column: 3)
!188 = !DILocalVariable(name: "__stream", scope: !187, file: !73, line: 644, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !191, line: 7, baseType: !192)
!191 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !193, line: 49, size: 1728, elements: !194)
!193 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !212, !213, !214, !218, !219, !221, !222, !225, !227, !230, !233, !234, !235, !236, !237}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !192, file: !193, line: 51, baseType: !74, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !192, file: !193, line: 54, baseType: !132, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !192, file: !193, line: 55, baseType: !132, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !192, file: !193, line: 56, baseType: !132, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !192, file: !193, line: 57, baseType: !132, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !192, file: !193, line: 58, baseType: !132, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !192, file: !193, line: 59, baseType: !132, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !192, file: !193, line: 60, baseType: !132, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !192, file: !193, line: 61, baseType: !132, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !192, file: !193, line: 64, baseType: !132, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !192, file: !193, line: 65, baseType: !132, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !192, file: !193, line: 66, baseType: !132, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !192, file: !193, line: 68, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !193, line: 36, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !192, file: !193, line: 70, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !192, file: !193, line: 72, baseType: !74, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !192, file: !193, line: 73, baseType: !74, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !192, file: !193, line: 74, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !216, line: 152, baseType: !217)
!216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!217 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !192, file: !193, line: 77, baseType: !134, size: 16, offset: 1024)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !192, file: !193, line: 78, baseType: !220, size: 8, offset: 1040)
!220 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !192, file: !193, line: 79, baseType: !46, size: 8, offset: 1048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !192, file: !193, line: 81, baseType: !223, size: 64, offset: 1088)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !193, line: 43, baseType: null)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !192, file: !193, line: 89, baseType: !226, size: 64, offset: 1152)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !216, line: 153, baseType: !217)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !192, file: !193, line: 91, baseType: !228, size: 64, offset: 1216)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !193, line: 37, flags: DIFlagFwdDecl)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !192, file: !193, line: 92, baseType: !231, size: 64, offset: 1280)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !193, line: 38, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !192, file: !193, line: 93, baseType: !211, size: 64, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !192, file: !193, line: 94, baseType: !133, size: 64, offset: 1408)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !192, file: !193, line: 95, baseType: !135, size: 64, offset: 1472)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !192, file: !193, line: 96, baseType: !74, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !192, file: !193, line: 98, baseType: !238, size: 160, offset: 1568)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 20)
!241 = !DILocalVariable(name: "__cnt", scope: !187, file: !73, line: 644, type: !135)
!242 = !DILocalVariable(name: "url_program", scope: !166, file: !73, line: 648, type: !138)
!243 = !DILocalVariable(name: "__ptr", scope: !244, file: !73, line: 686, type: !138)
!244 = distinct !DILexicalBlock(scope: !166, file: !73, line: 686, column: 3)
!245 = !DILocalVariable(name: "__stream", scope: !244, file: !73, line: 686, type: !189)
!246 = !DILocalVariable(name: "__cnt", scope: !244, file: !73, line: 686, type: !135)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !73, line: 585, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 5)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !73, line: 586, type: !249, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !73, line: 595, type: !61, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !73, line: 620, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 6)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !73, line: 648, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !73, line: 648, type: !249, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !73, line: 649, type: !61, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !73, line: 649, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 3)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !73, line: 650, type: !249, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !73, line: 651, type: !258, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !73, line: 651, type: !258, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !73, line: 652, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 7)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !73, line: 653, type: !19, isLocal: true, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !73, line: 654, type: !51, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !73, line: 655, type: !51, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !73, line: 656, type: !51, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !73, line: 657, type: !51, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !73, line: 663, type: !283, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !73, line: 664, type: !51, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !73, line: 669, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 17)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !73, line: 669, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 40)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !73, line: 676, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 15)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !73, line: 676, type: !317, isLocal: true, isDefinition: true)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 61)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !73, line: 679, type: !272, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !73, line: 683, type: !249, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !73, line: 688, type: !249, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !73, line: 691, type: !19, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !73, line: 839, type: !154, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !73, line: 840, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 22)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !73, line: 841, type: !312, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !73, line: 862, type: !61, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !73, line: 868, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 71)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !73, line: 875, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 27)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !73, line: 877, type: !351, isLocal: true, isDefinition: true)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 51)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !73, line: 877, type: !149, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !149, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 75, type: !249, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !19, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !154, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !2, line: 295, type: !272, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !263, isLocal: true, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(scope: null, file: !2, line: 310, type: !263, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !2, line: 315, type: !372, isLocal: true, isDefinition: true)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 49)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(scope: null, file: !2, line: 325, type: !372, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 472, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 59)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !2, line: 173, type: !384, isLocal: true, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 344, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 43)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 67)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 198, type: !394, isLocal: true, isDefinition: true)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 42)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 1024, elements: !62)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !400, line: 50, size: 256, elements: !401)
!400 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!401 = !{!402, !403, !404, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 52, baseType: !138, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !399, file: !400, line: 55, baseType: !74, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !399, file: !400, line: 56, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !399, file: !400, line: 57, baseType: !74, size: 32, offset: 192)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !409, line: 3, type: !312, isLocal: true, isDefinition: true)
!409 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "Version", scope: !412, file: !409, line: 3, type: !138, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !413, splitDebugInlining: false, nameTableKind: None)
!413 = !{!407, !410}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "file_name", scope: !416, file: !417, line: 45, type: !138, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C11, file: !417, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !418, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!418 = !{!419, !421, !423, !425, !414, !427}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !417, line: 121, type: !283, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !417, line: 121, type: !149, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !417, line: 123, type: !283, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !417, line: 126, type: !272, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !416, file: !417, line: 55, type: !176, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !431, file: !432, line: 66, type: !483, isLocal: false, isDefinition: true)
!431 = distinct !DICompileUnit(language: DW_LANG_C11, file: !432, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !433, globals: !434, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!433 = !{!133, !140}
!434 = !{!435, !437, !462, !464, !466, !468, !429, !470, !472, !474, !476, !481}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !432, line: 272, type: !249, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "old_file_name", scope: !439, file: !432, line: 304, type: !138, isLocal: true, isDefinition: true)
!439 = distinct !DISubprogram(name: "verror_at_line", scope: !432, file: !432, line: 298, type: !440, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !431, retainedNodes: !455)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !74, !74, !138, !69, !138, !442}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !443, line: 52, baseType: !444)
!443 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !445, line: 14, baseType: !446)
!445 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !447, baseType: !448)
!447 = !DIFile(filename: "lib/error.c", directory: "/src")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !449)
!449 = !{!450, !451, !452, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !448, file: !447, baseType: !133, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !448, file: !447, baseType: !133, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !448, file: !447, baseType: !133, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !448, file: !447, baseType: !74, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !448, file: !447, baseType: !74, size: 32, offset: 224)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DILocalVariable(name: "status", arg: 1, scope: !439, file: !432, line: 298, type: !74)
!457 = !DILocalVariable(name: "errnum", arg: 2, scope: !439, file: !432, line: 298, type: !74)
!458 = !DILocalVariable(name: "file_name", arg: 3, scope: !439, file: !432, line: 298, type: !138)
!459 = !DILocalVariable(name: "line_number", arg: 4, scope: !439, file: !432, line: 298, type: !69)
!460 = !DILocalVariable(name: "message", arg: 5, scope: !439, file: !432, line: 298, type: !138)
!461 = !DILocalVariable(name: "args", arg: 6, scope: !439, file: !432, line: 298, type: !442)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "old_line_number", scope: !439, file: !432, line: 305, type: !69, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !432, line: 338, type: !61, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(scope: null, file: !432, line: 346, type: !19, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !432, line: 346, type: !263, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "error_message_count", scope: !431, file: !432, line: 69, type: !69, isLocal: false, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !431, file: !432, line: 295, type: !74, isLocal: false, isDefinition: true)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !432, line: 208, type: !283, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(scope: null, file: !432, line: 208, type: !478, isLocal: true, isDefinition: true)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 21)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !432, line: 214, type: !249, isLocal: true, isDefinition: true)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{null}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "internal_state", scope: !488, file: !489, line: 24, type: !492, isLocal: true, isDefinition: true)
!488 = distinct !DICompileUnit(language: DW_LANG_C11, file: !489, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, globals: !491, splitDebugInlining: false, nameTableKind: None)
!489 = !DIFile(filename: "lib/mbrlen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c924d5b17c62ecd87f5e0fdbef8c37ec")
!490 = !{!133}
!491 = !{!486}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !493, line: 6, baseType: !494)
!493 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !495, line: 21, baseType: !496)
!495 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 13, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !496, file: !495, line: 15, baseType: !74, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !496, file: !495, line: 20, baseType: !500, size: 32, offset: 32)
!500 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !495, line: 16, size: 32, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !500, file: !495, line: 18, baseType: !69, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !500, file: !495, line: 19, baseType: !61, size: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "program_name", scope: !506, file: !507, line: 31, type: !138, isLocal: false, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C11, file: !507, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !508, globals: !509, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!508 = !{!132}
!509 = !{!504, !510, !512}
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !507, line: 46, type: !19, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !507, line: 49, type: !61, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "utf07FF", scope: !516, file: !517, line: 46, type: !542, isLocal: true, isDefinition: true)
!516 = distinct !DISubprogram(name: "proper_name_lite", scope: !517, file: !517, line: 38, type: !518, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !520, retainedNodes: !522)
!517 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!518 = !DISubroutineType(types: !519)
!519 = !{!138, !138, !138}
!520 = distinct !DICompileUnit(language: DW_LANG_C11, file: !517, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !521, splitDebugInlining: false, nameTableKind: None)
!521 = !{!514}
!522 = !{!523, !524, !525, !526, !531}
!523 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !516, file: !517, line: 38, type: !138)
!524 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !516, file: !517, line: 38, type: !138)
!525 = !DILocalVariable(name: "translation", scope: !516, file: !517, line: 40, type: !138)
!526 = !DILocalVariable(name: "w", scope: !516, file: !517, line: 47, type: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !528, line: 37, baseType: !529)
!528 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !216, line: 57, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !216, line: 42, baseType: !69)
!531 = !DILocalVariable(name: "mbs", scope: !516, file: !517, line: 48, type: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !493, line: 6, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !495, line: 21, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 13, size: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !534, file: !495, line: 15, baseType: !74, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !534, file: !495, line: 20, baseType: !538, size: 32, offset: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !534, file: !495, line: 16, size: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !538, file: !495, line: 18, baseType: !69, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !538, file: !495, line: 19, baseType: !61, size: 32)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 16, elements: !264)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(scope: null, file: !545, line: 78, type: !19, isLocal: true, isDefinition: true)
!545 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !545, line: 79, type: !258, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !545, line: 80, type: !159, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !545, line: 81, type: !159, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(scope: null, file: !545, line: 82, type: !238, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(scope: null, file: !545, line: 83, type: !263, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !545, line: 84, type: !19, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !545, line: 85, type: !283, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !545, line: 86, type: !283, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !545, line: 87, type: !19, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !566, file: !545, line: 76, type: !638, isLocal: false, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C11, file: !545, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !567, retainedTypes: !573, globals: !574, splitDebugInlining: false, nameTableKind: None)
!567 = !{!93, !568, !78}
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !94, line: 254, baseType: !69, size: 32, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!571 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!572 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!573 = !{!74, !134, !135}
!574 = !{!543, !546, !548, !550, !552, !554, !556, !558, !560, !562, !564, !575, !579, !589, !591, !596, !598, !600, !602, !604, !627, !634, !636}
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !566, file: !545, line: 92, type: !577, isLocal: false, isDefinition: true)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 320, elements: !52)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !566, file: !545, line: 1040, type: !581, isLocal: false, isDefinition: true)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !545, line: 56, size: 448, elements: !582)
!582 = !{!583, !584, !585, !587, !588}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !581, file: !545, line: 59, baseType: !93, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !581, file: !545, line: 62, baseType: !74, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !581, file: !545, line: 66, baseType: !586, size: 256, offset: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !20)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !581, file: !545, line: 69, baseType: !138, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !581, file: !545, line: 72, baseType: !138, size: 64, offset: 384)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !566, file: !545, line: 107, type: !581, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "slot0", scope: !566, file: !545, line: 831, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 256)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !545, line: 321, type: !263, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !545, line: 357, type: !263, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !545, line: 358, type: !263, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !545, line: 199, type: !283, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "quote", scope: !606, file: !545, line: 228, type: !625, isLocal: true, isDefinition: true)
!606 = distinct !DISubprogram(name: "gettext_quote", scope: !545, file: !545, line: 197, type: !607, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !566, retainedNodes: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{!138, !138, !93}
!609 = !{!610, !611, !612, !613, !614}
!610 = !DILocalVariable(name: "msgid", arg: 1, scope: !606, file: !545, line: 197, type: !138)
!611 = !DILocalVariable(name: "s", arg: 2, scope: !606, file: !545, line: 197, type: !93)
!612 = !DILocalVariable(name: "translation", scope: !606, file: !545, line: 199, type: !138)
!613 = !DILocalVariable(name: "w", scope: !606, file: !545, line: 229, type: !527)
!614 = !DILocalVariable(name: "mbs", scope: !606, file: !545, line: 230, type: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !493, line: 6, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !495, line: 21, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 13, size: 64, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !617, file: !495, line: 15, baseType: !74, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !617, file: !495, line: 20, baseType: !621, size: 32, offset: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !495, line: 16, size: 32, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !621, file: !495, line: 18, baseType: !69, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !621, file: !495, line: 19, baseType: !61, size: 32)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 64, elements: !626)
!626 = !{!265, !63}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "slotvec", scope: !566, file: !545, line: 834, type: !629, isLocal: true, isDefinition: true)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !545, line: 823, size: 128, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !545, line: 825, baseType: !135, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !630, file: !545, line: 826, baseType: !132, size: 64, offset: 64)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "nslots", scope: !566, file: !545, line: 832, type: !74, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "slotvec0", scope: !566, file: !545, line: 833, type: !630, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 704, elements: !640)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!640 = !{!641}
!641 = !DISubrange(count: 11)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(scope: null, file: !644, line: 67, type: !149, isLocal: true, isDefinition: true)
!644 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !644, line: 69, type: !283, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(scope: null, file: !644, line: 83, type: !283, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !644, line: 83, type: !61, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !644, line: 85, type: !263, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(scope: null, file: !644, line: 88, type: !655, isLocal: true, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 171)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !644, line: 88, type: !660, isLocal: true, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 34)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !644, line: 105, type: !154, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !644, line: 109, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 23)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !644, line: 113, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 28)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !644, line: 120, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 32)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !644, line: 127, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 36)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !644, line: 134, type: !307, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !644, line: 142, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 44)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(scope: null, file: !644, line: 150, type: !26, isLocal: true, isDefinition: true)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(scope: null, file: !644, line: 159, type: !696, isLocal: true, isDefinition: true)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 52)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !644, line: 170, type: !701, isLocal: true, isDefinition: true)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 60)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !644, line: 248, type: !238, isLocal: true, isDefinition: true)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !644, line: 248, type: !332, isLocal: true, isDefinition: true)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(scope: null, file: !644, line: 254, type: !238, isLocal: true, isDefinition: true)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !644, line: 254, type: !144, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !644, line: 254, type: !307, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !644, line: 259, type: !3, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !644, line: 259, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 29)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !723, file: !724, line: 26, type: !726, isLocal: false, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !724, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!725 = !{!721}
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 376, elements: !15)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "exit_failure", scope: !729, file: !730, line: 24, type: !732, isLocal: false, isDefinition: true)
!729 = distinct !DICompileUnit(language: DW_LANG_C11, file: !730, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !731, splitDebugInlining: false, nameTableKind: None)
!730 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!731 = !{!727}
!732 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !735, line: 34, type: !272, isLocal: true, isDefinition: true)
!735 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(scope: null, file: !735, line: 34, type: !283, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !735, line: 34, type: !302, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !742, line: 35, type: !263, isLocal: true, isDefinition: true)
!742 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(scope: null, file: !742, line: 35, type: !258, isLocal: true, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !747, line: 108, type: !46, isLocal: true, isDefinition: true)
!747 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "internal_state", scope: !750, file: !747, line: 97, type: !753, isLocal: true, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C11, file: !747, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !751, globals: !752, splitDebugInlining: false, nameTableKind: None)
!751 = !{!133, !135, !140}
!752 = !{!745, !748}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !493, line: 6, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !495, line: 21, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 13, size: 64, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !755, file: !495, line: 15, baseType: !74, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !755, file: !495, line: 20, baseType: !759, size: 32, offset: 32)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !495, line: 16, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !759, file: !495, line: 18, baseType: !69, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !759, file: !495, line: 19, baseType: !61, size: 32)
!763 = distinct !DICompileUnit(language: DW_LANG_C11, file: !764, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!765 = distinct !DICompileUnit(language: DW_LANG_C11, file: !766, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !767, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!767 = !{!135}
!768 = distinct !DICompileUnit(language: DW_LANG_C11, file: !644, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !490, globals: !773, splitDebugInlining: false, nameTableKind: None)
!769 = !{!770}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !644, line: 40, baseType: !69, size: 32, elements: !771)
!771 = !{!772}
!772 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!773 = !{!642, !645, !647, !649, !651, !653, !658, !663, !665, !670, !675, !680, !685, !687, !692, !694, !699, !704, !706, !708, !710, !712, !714, !716}
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, retainedTypes: !807, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!776 = !{!777, !789}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !778, file: !775, line: 188, baseType: !69, size: 32, elements: !787)
!778 = distinct !DISubprogram(name: "x2nrealloc", scope: !775, file: !775, line: 176, type: !779, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !782)
!779 = !DISubroutineType(types: !780)
!780 = !{!133, !133, !781, !135}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!782 = !{!783, !784, !785, !786}
!783 = !DILocalVariable(name: "p", arg: 1, scope: !778, file: !775, line: 176, type: !133)
!784 = !DILocalVariable(name: "pn", arg: 2, scope: !778, file: !775, line: 176, type: !781)
!785 = !DILocalVariable(name: "s", arg: 3, scope: !778, file: !775, line: 176, type: !135)
!786 = !DILocalVariable(name: "n", scope: !778, file: !775, line: 178, type: !135)
!787 = !{!788}
!788 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !790, file: !775, line: 228, baseType: !69, size: 32, elements: !787)
!790 = distinct !DISubprogram(name: "xpalloc", scope: !775, file: !775, line: 223, type: !791, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !797)
!791 = !DISubroutineType(types: !792)
!792 = !{!133, !133, !793, !794, !796, !794}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !795, line: 130, baseType: !796)
!795 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !136, line: 35, baseType: !217)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806}
!798 = !DILocalVariable(name: "pa", arg: 1, scope: !790, file: !775, line: 223, type: !133)
!799 = !DILocalVariable(name: "pn", arg: 2, scope: !790, file: !775, line: 223, type: !793)
!800 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !790, file: !775, line: 223, type: !794)
!801 = !DILocalVariable(name: "n_max", arg: 4, scope: !790, file: !775, line: 223, type: !796)
!802 = !DILocalVariable(name: "s", arg: 5, scope: !790, file: !775, line: 223, type: !794)
!803 = !DILocalVariable(name: "n0", scope: !790, file: !775, line: 230, type: !794)
!804 = !DILocalVariable(name: "n", scope: !790, file: !775, line: 237, type: !794)
!805 = !DILocalVariable(name: "nbytes", scope: !790, file: !775, line: 248, type: !794)
!806 = !DILocalVariable(name: "adjusted_nbytes", scope: !790, file: !775, line: 252, type: !794)
!807 = !{!132, !133, !176, !217, !137}
!808 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !809, splitDebugInlining: false, nameTableKind: None)
!809 = !{!733, !736, !738}
!810 = distinct !DICompileUnit(language: DW_LANG_C11, file: !811, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!814 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!815 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!817 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !742, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !819, splitDebugInlining: false, nameTableKind: None)
!819 = !{!740, !743}
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !821, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !822, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!822 = !{!176, !137, !133}
!823 = distinct !DICompileUnit(language: DW_LANG_C11, file: !824, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!825 = distinct !DICompileUnit(language: DW_LANG_C11, file: !826, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !490, splitDebugInlining: false, nameTableKind: None)
!826 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!827 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!828 = !{i32 7, !"Dwarf Version", i32 5}
!829 = !{i32 2, !"Debug Info Version", i32 3}
!830 = !{i32 1, !"wchar_size", i32 4}
!831 = !{i32 8, !"PIC Level", i32 2}
!832 = !{i32 7, !"PIE Level", i32 2}
!833 = !{i32 7, !"uwtable", i32 2}
!834 = !{i32 7, !"frame-pointer", i32 1}
!835 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 81, type: !836, scopeLine: 82, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !838)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !74}
!838 = !{!839}
!839 = !DILocalVariable(name: "status", arg: 1, scope: !835, file: !2, line: 81, type: !74)
!840 = !DILocation(line: 0, scope: !835)
!841 = !DILocation(line: 83, column: 14, scope: !842)
!842 = distinct !DILexicalBlock(scope: !835, file: !2, line: 83, column: 7)
!843 = !DILocation(line: 83, column: 7, scope: !835)
!844 = !DILocation(line: 84, column: 5, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !2, line: 84, column: 5)
!846 = !{!847, !847, i64 0}
!847 = !{!"any pointer", !848, i64 0}
!848 = !{!"omnipotent char", !849, i64 0}
!849 = !{!"Simple C/C++ TBAA"}
!850 = !DILocation(line: 87, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !842, file: !2, line: 86, column: 5)
!852 = !DILocation(line: 88, column: 7, scope: !851)
!853 = !DILocation(line: 92, column: 7, scope: !851)
!854 = !DILocation(line: 95, column: 7, scope: !851)
!855 = !DILocation(line: 98, column: 7, scope: !851)
!856 = !DILocation(line: 102, column: 7, scope: !851)
!857 = !DILocation(line: 103, column: 7, scope: !851)
!858 = !DILocalVariable(name: "program", arg: 1, scope: !859, file: !73, line: 836, type: !138)
!859 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !73, file: !73, line: 836, type: !860, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !862)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !138}
!862 = !{!858, !863, !870, !871, !873, !874}
!863 = !DILocalVariable(name: "infomap", scope: !859, file: !73, line: 838, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 896, elements: !284)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !859, file: !73, line: 838, size: 128, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !866, file: !73, line: 838, baseType: !138, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !866, file: !73, line: 838, baseType: !138, size: 64, offset: 64)
!870 = !DILocalVariable(name: "node", scope: !859, file: !73, line: 848, type: !138)
!871 = !DILocalVariable(name: "map_prog", scope: !859, file: !73, line: 849, type: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!873 = !DILocalVariable(name: "lc_messages", scope: !859, file: !73, line: 861, type: !138)
!874 = !DILocalVariable(name: "url_program", scope: !859, file: !73, line: 874, type: !138)
!875 = !DILocation(line: 0, scope: !859, inlinedAt: !876)
!876 = distinct !DILocation(line: 104, column: 7, scope: !851)
!877 = !DILocation(line: 857, column: 3, scope: !859, inlinedAt: !876)
!878 = !DILocation(line: 861, column: 29, scope: !859, inlinedAt: !876)
!879 = !DILocation(line: 862, column: 7, scope: !880, inlinedAt: !876)
!880 = distinct !DILexicalBlock(scope: !859, file: !73, line: 862, column: 7)
!881 = !DILocation(line: 862, column: 19, scope: !880, inlinedAt: !876)
!882 = !DILocation(line: 862, column: 22, scope: !880, inlinedAt: !876)
!883 = !DILocation(line: 862, column: 7, scope: !859, inlinedAt: !876)
!884 = !DILocation(line: 868, column: 7, scope: !885, inlinedAt: !876)
!885 = distinct !DILexicalBlock(scope: !880, file: !73, line: 863, column: 5)
!886 = !DILocation(line: 870, column: 5, scope: !885, inlinedAt: !876)
!887 = !DILocation(line: 875, column: 3, scope: !859, inlinedAt: !876)
!888 = !DILocation(line: 877, column: 3, scope: !859, inlinedAt: !876)
!889 = !DILocation(line: 106, column: 3, scope: !835)
!890 = !DISubprogram(name: "dcgettext", scope: !891, file: !891, line: 51, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!891 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!892 = !DISubroutineType(types: !893)
!893 = !{!132, !138, !138, !74}
!894 = !{}
!895 = !DISubprogram(name: "__fprintf_chk", scope: !896, file: !896, line: 93, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!896 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!897 = !DISubroutineType(types: !898)
!898 = !{!74, !899, !74, !900, null}
!899 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !189)
!900 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !138)
!901 = !DISubprogram(name: "__printf_chk", scope: !896, file: !896, line: 95, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!902 = !DISubroutineType(types: !903)
!903 = !{!74, !74, !900, null}
!904 = !DISubprogram(name: "fputs_unlocked", scope: !443, file: !443, line: 691, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!905 = !DISubroutineType(types: !906)
!906 = !{!74, !900, !899}
!907 = !DILocation(line: 0, scope: !166)
!908 = !DILocation(line: 581, column: 7, scope: !174)
!909 = !{!910, !910, i64 0}
!910 = !{!"int", !848, i64 0}
!911 = !DILocation(line: 581, column: 19, scope: !174)
!912 = !DILocation(line: 581, column: 7, scope: !166)
!913 = !DILocation(line: 585, column: 26, scope: !173)
!914 = !DILocation(line: 0, scope: !173)
!915 = !DILocation(line: 586, column: 23, scope: !173)
!916 = !DILocation(line: 586, column: 28, scope: !173)
!917 = !DILocation(line: 586, column: 32, scope: !173)
!918 = !{!848, !848, i64 0}
!919 = !DILocation(line: 586, column: 38, scope: !173)
!920 = !DILocalVariable(name: "__s1", arg: 1, scope: !921, file: !922, line: 1359, type: !138)
!921 = distinct !DISubprogram(name: "streq", scope: !922, file: !922, line: 1359, type: !923, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !925)
!922 = !DIFile(filename: "./lib/string.h", directory: "/src")
!923 = !DISubroutineType(types: !924)
!924 = !{!176, !138, !138}
!925 = !{!920, !926}
!926 = !DILocalVariable(name: "__s2", arg: 2, scope: !921, file: !922, line: 1359, type: !138)
!927 = !DILocation(line: 0, scope: !921, inlinedAt: !928)
!928 = distinct !DILocation(line: 586, column: 41, scope: !173)
!929 = !DILocation(line: 1361, column: 11, scope: !921, inlinedAt: !928)
!930 = !DILocation(line: 1361, column: 10, scope: !921, inlinedAt: !928)
!931 = !DILocation(line: 586, column: 19, scope: !173)
!932 = !DILocation(line: 587, column: 5, scope: !173)
!933 = !DILocation(line: 588, column: 7, scope: !934)
!934 = distinct !DILexicalBlock(scope: !166, file: !73, line: 588, column: 7)
!935 = !DILocation(line: 588, column: 7, scope: !166)
!936 = !DILocation(line: 590, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !934, file: !73, line: 589, column: 5)
!938 = !DILocation(line: 591, column: 7, scope: !937)
!939 = !DILocation(line: 595, column: 37, scope: !166)
!940 = !DILocation(line: 595, column: 35, scope: !166)
!941 = !DILocation(line: 596, column: 29, scope: !166)
!942 = !DILocation(line: 597, column: 8, scope: !182)
!943 = !DILocation(line: 597, column: 7, scope: !166)
!944 = !DILocation(line: 604, column: 24, scope: !181)
!945 = !DILocation(line: 604, column: 12, scope: !182)
!946 = !DILocation(line: 0, scope: !180)
!947 = !DILocation(line: 610, column: 16, scope: !180)
!948 = !DILocation(line: 610, column: 7, scope: !180)
!949 = !DILocation(line: 611, column: 21, scope: !180)
!950 = !{!951, !951, i64 0}
!951 = !{!"short", !848, i64 0}
!952 = !DILocation(line: 611, column: 19, scope: !180)
!953 = !DILocation(line: 611, column: 16, scope: !180)
!954 = !DILocation(line: 610, column: 30, scope: !180)
!955 = distinct !{!955, !948, !949, !956}
!956 = !{!"llvm.loop.mustprogress"}
!957 = !DILocation(line: 612, column: 18, scope: !958)
!958 = distinct !DILexicalBlock(scope: !180, file: !73, line: 612, column: 11)
!959 = !DILocation(line: 612, column: 11, scope: !180)
!960 = !DILocation(line: 620, column: 23, scope: !166)
!961 = !DILocation(line: 625, column: 39, scope: !166)
!962 = !DILocation(line: 626, column: 3, scope: !166)
!963 = !DILocation(line: 626, column: 10, scope: !166)
!964 = !DILocation(line: 626, column: 21, scope: !166)
!965 = !DILocation(line: 628, column: 44, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !73, line: 628, column: 11)
!967 = distinct !DILexicalBlock(scope: !166, file: !73, line: 627, column: 5)
!968 = !DILocation(line: 628, column: 32, scope: !966)
!969 = !DILocation(line: 628, column: 49, scope: !966)
!970 = !DILocation(line: 628, column: 11, scope: !967)
!971 = !DILocation(line: 630, column: 11, scope: !972)
!972 = distinct !DILexicalBlock(scope: !967, file: !73, line: 630, column: 11)
!973 = !DILocation(line: 630, column: 11, scope: !967)
!974 = !DILocation(line: 632, column: 26, scope: !975)
!975 = distinct !DILexicalBlock(scope: !976, file: !73, line: 632, column: 15)
!976 = distinct !DILexicalBlock(scope: !972, file: !73, line: 631, column: 9)
!977 = !DILocation(line: 632, column: 34, scope: !975)
!978 = !DILocation(line: 632, column: 37, scope: !975)
!979 = !DILocation(line: 632, column: 15, scope: !976)
!980 = !DILocation(line: 640, column: 16, scope: !967)
!981 = distinct !{!981, !962, !982, !956}
!982 = !DILocation(line: 641, column: 5, scope: !166)
!983 = !DILocation(line: 644, column: 3, scope: !166)
!984 = !DILocation(line: 0, scope: !921, inlinedAt: !985)
!985 = distinct !DILocation(line: 648, column: 31, scope: !166)
!986 = !DILocation(line: 0, scope: !921, inlinedAt: !987)
!987 = distinct !DILocation(line: 649, column: 31, scope: !166)
!988 = !DILocation(line: 0, scope: !921, inlinedAt: !989)
!989 = distinct !DILocation(line: 650, column: 31, scope: !166)
!990 = !DILocation(line: 0, scope: !921, inlinedAt: !991)
!991 = distinct !DILocation(line: 651, column: 31, scope: !166)
!992 = !DILocation(line: 0, scope: !921, inlinedAt: !993)
!993 = distinct !DILocation(line: 652, column: 31, scope: !166)
!994 = !DILocation(line: 0, scope: !921, inlinedAt: !995)
!995 = distinct !DILocation(line: 653, column: 31, scope: !166)
!996 = !DILocation(line: 0, scope: !921, inlinedAt: !997)
!997 = distinct !DILocation(line: 654, column: 31, scope: !166)
!998 = !DILocation(line: 0, scope: !921, inlinedAt: !999)
!999 = distinct !DILocation(line: 655, column: 31, scope: !166)
!1000 = !DILocation(line: 0, scope: !921, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 656, column: 31, scope: !166)
!1002 = !DILocation(line: 0, scope: !921, inlinedAt: !1003)
!1003 = distinct !DILocation(line: 657, column: 31, scope: !166)
!1004 = !DILocation(line: 663, column: 7, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !166, file: !73, line: 663, column: 7)
!1006 = !DILocation(line: 664, column: 7, scope: !1005)
!1007 = !DILocation(line: 664, column: 10, scope: !1005)
!1008 = !DILocation(line: 663, column: 7, scope: !166)
!1009 = !DILocation(line: 669, column: 7, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1005, file: !73, line: 665, column: 5)
!1011 = !DILocation(line: 671, column: 5, scope: !1010)
!1012 = !DILocation(line: 676, column: 7, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !1005, file: !73, line: 673, column: 5)
!1014 = !DILocation(line: 679, column: 3, scope: !166)
!1015 = !DILocation(line: 683, column: 3, scope: !166)
!1016 = !DILocation(line: 686, column: 3, scope: !166)
!1017 = !DILocation(line: 688, column: 3, scope: !166)
!1018 = !DILocation(line: 691, column: 3, scope: !166)
!1019 = !DILocation(line: 695, column: 3, scope: !166)
!1020 = !DILocation(line: 696, column: 1, scope: !166)
!1021 = !DISubprogram(name: "setlocale", scope: !1022, file: !1022, line: 122, type: !1023, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1022 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!132, !74, !138}
!1025 = !DISubprogram(name: "strncmp", scope: !1026, file: !1026, line: 159, type: !1027, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1026 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!74, !138, !138, !135}
!1029 = !DISubprogram(name: "exit", scope: !1030, file: !1030, line: 624, type: !836, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1030 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1031 = !DISubprogram(name: "getenv", scope: !1030, file: !1030, line: 641, type: !1032, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!132, !138}
!1034 = !DISubprogram(name: "strcmp", scope: !1026, file: !1026, line: 156, type: !1035, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!74, !138, !138}
!1037 = !DISubprogram(name: "strspn", scope: !1026, file: !1026, line: 297, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!137, !138, !138}
!1040 = !DISubprogram(name: "strchr", scope: !1026, file: !1026, line: 246, type: !1041, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!132, !138, !74}
!1043 = !DISubprogram(name: "__ctype_b_loc", scope: !79, file: !79, line: 79, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!1049 = !DISubprogram(name: "strcspn", scope: !1026, file: !1026, line: 293, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1050 = !DISubprogram(name: "fwrite_unlocked", scope: !443, file: !443, line: 704, type: !1051, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !894)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!135, !1053, !135, !135, !899}
!1053 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1056 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 110, type: !1057, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1060)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!74, !74, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066}
!1061 = !DILocalVariable(name: "argc", arg: 1, scope: !1056, file: !2, line: 110, type: !74)
!1062 = !DILocalVariable(name: "argv", arg: 2, scope: !1056, file: !2, line: 110, type: !1059)
!1063 = !DILocalVariable(name: "ok", scope: !1056, file: !2, line: 112, type: !176)
!1064 = !DILocalVariable(name: "check_basic_portability", scope: !1056, file: !2, line: 113, type: !176)
!1065 = !DILocalVariable(name: "check_extra_portability", scope: !1056, file: !2, line: 114, type: !176)
!1066 = !DILocalVariable(name: "optc", scope: !1056, file: !2, line: 115, type: !74)
!1067 = !DILocation(line: 0, scope: !1056)
!1068 = !DILocation(line: 118, column: 21, scope: !1056)
!1069 = !DILocation(line: 118, column: 3, scope: !1056)
!1070 = !DILocation(line: 119, column: 3, scope: !1056)
!1071 = !DILocation(line: 120, column: 3, scope: !1056)
!1072 = !DILocation(line: 121, column: 3, scope: !1056)
!1073 = !DILocation(line: 123, column: 3, scope: !1056)
!1074 = !DILocation(line: 125, column: 3, scope: !1056)
!1075 = !DILocation(line: 125, column: 18, scope: !1056)
!1076 = distinct !{!1076, !1074, !1077, !956}
!1077 = !DILocation(line: 149, column: 5, scope: !1056)
!1078 = !DILocation(line: 136, column: 11, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1080, file: !2, line: 128, column: 9)
!1080 = distinct !DILexicalBlock(scope: !1056, file: !2, line: 126, column: 5)
!1081 = !DILocation(line: 140, column: 11, scope: !1079)
!1082 = distinct !{!1082, !1074, !1077, !956, !1083}
!1083 = !{!"llvm.loop.peeled.count", i32 1}
!1084 = !DILocation(line: 142, column: 9, scope: !1079)
!1085 = !DILocation(line: 144, column: 9, scope: !1079)
!1086 = !DILocation(line: 147, column: 11, scope: !1079)
!1087 = !DILocation(line: 151, column: 7, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1056, file: !2, line: 151, column: 7)
!1089 = !DILocation(line: 151, column: 14, scope: !1088)
!1090 = !DILocation(line: 151, column: 7, scope: !1056)
!1091 = !DILocation(line: 157, column: 17, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1093, file: !2, line: 157, column: 3)
!1093 = distinct !DILexicalBlock(scope: !1056, file: !2, line: 157, column: 3)
!1094 = !DILocation(line: 157, column: 3, scope: !1093)
!1095 = !DILocation(line: 153, column: 7, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1088, file: !2, line: 152, column: 5)
!1097 = !DILocation(line: 154, column: 7, scope: !1096)
!1098 = !DILocation(line: 158, column: 31, scope: !1092)
!1099 = !DILocalVariable(name: "file", arg: 1, scope: !1100, file: !2, line: 253, type: !132)
!1100 = distinct !DISubprogram(name: "validate_file_name", scope: !2, file: !2, line: 253, type: !1101, scopeLine: 255, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1103)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!176, !132, !176, !176}
!1103 = !{!1099, !1104, !1105, !1106, !1107, !1108, !1109, !1147, !1150, !1153, !1154, !1158, !1161, !1164, !1165, !1167, !1170, !1173, !1174, !1175}
!1104 = !DILocalVariable(name: "check_basic_portability", arg: 2, scope: !1100, file: !2, line: 253, type: !176)
!1105 = !DILocalVariable(name: "check_extra_portability", arg: 3, scope: !1100, file: !2, line: 254, type: !176)
!1106 = !DILocalVariable(name: "filelen", scope: !1100, file: !2, line: 256, type: !794)
!1107 = !DILocalVariable(name: "check_component_lengths", scope: !1100, file: !2, line: 259, type: !176)
!1108 = !DILocalVariable(name: "file_exists", scope: !1100, file: !2, line: 262, type: !176)
!1109 = !DILocalVariable(name: "st", scope: !1110, file: !2, line: 290, type: !1112)
!1110 = distinct !DILexicalBlock(scope: !1111, file: !2, line: 284, column: 5)
!1111 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 278, column: 7)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1113, line: 44, size: 1024, elements: !1114)
!1113 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1114 = !{!1115, !1117, !1119, !1121, !1123, !1125, !1127, !1128, !1129, !1130, !1132, !1133, !1135, !1143, !1144, !1145}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1112, file: !1113, line: 46, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !216, line: 145, baseType: !137)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1112, file: !1113, line: 47, baseType: !1118, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !216, line: 148, baseType: !137)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1112, file: !1113, line: 48, baseType: !1120, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !216, line: 150, baseType: !69)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1112, file: !1113, line: 49, baseType: !1122, size: 32, offset: 160)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !216, line: 151, baseType: !69)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1112, file: !1113, line: 50, baseType: !1124, size: 32, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !216, line: 146, baseType: !69)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1112, file: !1113, line: 51, baseType: !1126, size: 32, offset: 224)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !216, line: 147, baseType: !69)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1112, file: !1113, line: 52, baseType: !1116, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1112, file: !1113, line: 53, baseType: !1116, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1112, file: !1113, line: 54, baseType: !215, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1112, file: !1113, line: 55, baseType: !1131, size: 32, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !216, line: 175, baseType: !74)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1112, file: !1113, line: 56, baseType: !74, size: 32, offset: 480)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1112, file: !1113, line: 57, baseType: !1134, size: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !216, line: 180, baseType: !217)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1112, file: !1113, line: 65, baseType: !1136, size: 128, offset: 576)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1137, line: 11, size: 128, elements: !1138)
!1137 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1138 = !{!1139, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1136, file: !1137, line: 16, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !216, line: 160, baseType: !217)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1136, file: !1137, line: 21, baseType: !1142, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !216, line: 197, baseType: !217)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1112, file: !1113, line: 66, baseType: !1136, size: 128, offset: 704)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1112, file: !1113, line: 67, baseType: !1136, size: 128, offset: 832)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1112, file: !1113, line: 79, baseType: !1146, size: 64, offset: 960)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !264)
!1147 = !DILocalVariable(name: "maxsize", scope: !1148, file: !2, line: 303, type: !794)
!1148 = distinct !DILexicalBlock(scope: !1149, file: !2, line: 302, column: 5)
!1149 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 300, column: 7)
!1150 = !DILocalVariable(name: "size", scope: !1151, file: !2, line: 309, type: !217)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 308, column: 9)
!1152 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 305, column: 11)
!1153 = !DILocalVariable(name: "dir", scope: !1151, file: !2, line: 310, type: !138)
!1154 = !DILocalVariable(name: "start", scope: !1155, file: !2, line: 339, type: !132)
!1155 = distinct !DILexicalBlock(scope: !1156, file: !2, line: 339, column: 7)
!1156 = distinct !DILexicalBlock(scope: !1157, file: !2, line: 338, column: 5)
!1157 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 337, column: 7)
!1158 = !DILocalVariable(name: "length", scope: !1159, file: !2, line: 341, type: !135)
!1159 = distinct !DILexicalBlock(scope: !1160, file: !2, line: 340, column: 9)
!1160 = distinct !DILexicalBlock(scope: !1155, file: !2, line: 339, column: 7)
!1161 = !DILocalVariable(name: "name_max", scope: !1162, file: !2, line: 359, type: !794)
!1162 = distinct !DILexicalBlock(scope: !1163, file: !2, line: 354, column: 5)
!1163 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 353, column: 7)
!1164 = !DILocalVariable(name: "known_name_max", scope: !1162, file: !2, line: 362, type: !794)
!1165 = !DILocalVariable(name: "start", scope: !1166, file: !2, line: 364, type: !132)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !2, line: 364, column: 7)
!1167 = !DILocalVariable(name: "length", scope: !1168, file: !2, line: 366, type: !794)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !2, line: 365, column: 9)
!1169 = distinct !DILexicalBlock(scope: !1166, file: !2, line: 364, column: 7)
!1170 = !DILocalVariable(name: "len", scope: !1171, file: !2, line: 372, type: !217)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !2, line: 371, column: 13)
!1172 = distinct !DILexicalBlock(scope: !1168, file: !2, line: 368, column: 15)
!1173 = !DILocalVariable(name: "dir", scope: !1171, file: !2, line: 373, type: !138)
!1174 = !DILocalVariable(name: "c", scope: !1171, file: !2, line: 374, type: !4)
!1175 = !DILocalVariable(name: "c", scope: !1176, file: !2, line: 406, type: !4)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !2, line: 405, column: 13)
!1177 = distinct !DILexicalBlock(scope: !1168, file: !2, line: 404, column: 15)
!1178 = !DILocation(line: 0, scope: !1100, inlinedAt: !1179)
!1179 = distinct !DILocation(line: 158, column: 11, scope: !1092)
!1180 = !DILocation(line: 256, column: 19, scope: !1100, inlinedAt: !1179)
!1181 = !DILocation(line: 264, column: 31, scope: !1182, inlinedAt: !1179)
!1182 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 264, column: 7)
!1183 = !DILocalVariable(name: "file", arg: 1, scope: !1184, file: !2, line: 168, type: !138)
!1184 = distinct !DISubprogram(name: "no_leading_hyphen", scope: !2, file: !2, line: 168, type: !1185, scopeLine: 169, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1187)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!176, !138}
!1187 = !{!1183, !1188}
!1188 = !DILocalVariable(name: "p", scope: !1189, file: !2, line: 170, type: !138)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !2, line: 170, column: 3)
!1190 = !DILocation(line: 0, scope: !1184, inlinedAt: !1191)
!1191 = distinct !DILocation(line: 264, column: 36, scope: !1182, inlinedAt: !1179)
!1192 = !DILocation(line: 0, scope: !1189, inlinedAt: !1191)
!1193 = !DILocation(line: 170, column: 36, scope: !1194, inlinedAt: !1191)
!1194 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 170, column: 3)
!1195 = !DILocation(line: 170, column: 3, scope: !1189, inlinedAt: !1191)
!1196 = !DILocation(line: 170, column: 56, scope: !1194, inlinedAt: !1191)
!1197 = distinct !{!1197, !1195, !1198, !956}
!1198 = !DILocation(line: 176, column: 7, scope: !1189, inlinedAt: !1191)
!1199 = !DILocation(line: 171, column: 11, scope: !1200, inlinedAt: !1191)
!1200 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 171, column: 9)
!1201 = !DILocation(line: 171, column: 19, scope: !1200, inlinedAt: !1191)
!1202 = !DILocation(line: 171, column: 22, scope: !1200, inlinedAt: !1191)
!1203 = !DILocation(line: 171, column: 28, scope: !1200, inlinedAt: !1191)
!1204 = !DILocation(line: 171, column: 9, scope: !1194, inlinedAt: !1191)
!1205 = !DILocation(line: 173, column: 9, scope: !1206, inlinedAt: !1191)
!1206 = distinct !DILexicalBlock(scope: !1200, file: !2, line: 172, column: 7)
!1207 = !DILocation(line: 264, column: 7, scope: !1100, inlinedAt: !1179)
!1208 = !DILocation(line: 267, column: 32, scope: !1209, inlinedAt: !1179)
!1209 = distinct !DILexicalBlock(scope: !1100, file: !2, line: 267, column: 7)
!1210 = !DILocation(line: 268, column: 7, scope: !1209, inlinedAt: !1179)
!1211 = !DILocation(line: 267, column: 7, scope: !1100, inlinedAt: !1179)
!1212 = !DILocation(line: 274, column: 7, scope: !1213, inlinedAt: !1179)
!1213 = distinct !DILexicalBlock(scope: !1209, file: !2, line: 269, column: 5)
!1214 = !DILocation(line: 275, column: 7, scope: !1213, inlinedAt: !1179)
!1215 = !DILocalVariable(name: "file", arg: 1, scope: !1216, file: !2, line: 185, type: !138)
!1216 = distinct !DISubprogram(name: "portable_chars_only", scope: !2, file: !2, line: 185, type: !1217, scopeLine: 186, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !1219)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!176, !138, !135}
!1219 = !{!1215, !1220, !1221, !1222, !1223, !1236}
!1220 = !DILocalVariable(name: "filelen", arg: 2, scope: !1216, file: !2, line: 185, type: !135)
!1221 = !DILocalVariable(name: "validlen", scope: !1216, file: !2, line: 187, type: !135)
!1222 = !DILocalVariable(name: "invalid", scope: !1216, file: !2, line: 192, type: !138)
!1223 = !DILocalVariable(name: "mbstate", scope: !1224, file: !2, line: 196, type: !1226)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !2, line: 195, column: 5)
!1225 = distinct !DILexicalBlock(scope: !1216, file: !2, line: 194, column: 7)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !493, line: 6, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !495, line: 21, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 13, size: 64, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1228, file: !495, line: 15, baseType: !74, size: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1228, file: !495, line: 20, baseType: !1232, size: 32, offset: 32)
!1232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1228, file: !495, line: 16, size: 32, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1232, file: !495, line: 18, baseType: !69, size: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1232, file: !495, line: 19, baseType: !61, size: 32)
!1236 = !DILocalVariable(name: "charlen", scope: !1224, file: !2, line: 197, type: !135)
!1237 = !DILocation(line: 0, scope: !1216, inlinedAt: !1238)
!1238 = distinct !DILocation(line: 280, column: 13, scope: !1239, inlinedAt: !1179)
!1239 = distinct !DILexicalBlock(scope: !1240, file: !2, line: 280, column: 11)
!1240 = distinct !DILexicalBlock(scope: !1111, file: !2, line: 279, column: 5)
!1241 = !DILocation(line: 187, column: 21, scope: !1216, inlinedAt: !1238)
!1242 = !DILocation(line: 192, column: 30, scope: !1216, inlinedAt: !1238)
!1243 = !DILocation(line: 194, column: 7, scope: !1225, inlinedAt: !1238)
!1244 = !DILocation(line: 194, column: 7, scope: !1216, inlinedAt: !1238)
!1245 = !DILocation(line: 196, column: 7, scope: !1224, inlinedAt: !1238)
!1246 = !DILocation(line: 196, column: 17, scope: !1224, inlinedAt: !1238)
!1247 = !DILocalVariable(name: "ps", arg: 1, scope: !1248, file: !1249, line: 1135, type: !1252)
