; ModuleID = 'src/pinky.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, ptr, ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.passwd = type { ptr, ptr, i32, i32, ptr, ptr, ptr }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.gl_utmp = type { ptr, ptr, ptr, ptr, %struct.timespec, i32, i32, i16, %struct.anon }
%struct.timespec = type { i64, i64 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.sysinfo = type { i64, [3 x i64], i64, i64, i64, i64, i64, i64, i16, i16, i64, i64, i32, [0 x i8] }
%struct.utmp_alloc = type { ptr, i64, i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i64, %struct.timespec, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }


!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 46, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!174 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!179 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!180 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !59, !64, !69, !74, !79, !84, !89, !94, !99, !104, !181, !183, !188, !193, !198, !200, !202, !283, !288, !290, !295, !297, !299, !301, !303, !308, !310, !312, !314, !319, !324, !326, !328, !330, !332, !334, !336, !338, !343, !348, !350, !352, !354, !356, !358, !360, !365, !367, !369, !374, !379, !381, !383, !385, !387, !106, !389, !391, !393, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !423, !425, !427, !429, !431, !433, !435, !437, !439, !536, !538, !540, !542, !544, !546, !563, !565, !567, !569, !571, !594, !596, !601, !603, !605, !607, !609, !611, !613, !615, !620, !622}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !86, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 17)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 16)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 12)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !56, isLocal: true, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "do_lookup", scope: !108, file: !2, line: 68, type: !178, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !204, file: !115, line: 575, type: !116, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "oputs_", scope: !115, file: !115, line: 573, type: !205, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !207)
!205 = !DISubroutineType(cc: DW_CC_nocall, types: !206)
!206 = !{null, !175, !175}
!207 = !{!208, !209, !210, !213, !214, !215, !216, !220, !221, !222, !223, !225, !277, !278, !279, !281, !282}
!208 = !DILocalVariable(name: "program", arg: 1, scope: !204, file: !115, line: 573, type: !175)
!209 = !DILocalVariable(name: "option", arg: 2, scope: !204, file: !115, line: 573, type: !175)
!210 = !DILocalVariable(name: "term", scope: !211, file: !115, line: 585, type: !175)
!211 = distinct !DILexicalBlock(scope: !212, file: !115, line: 582, column: 5)
!212 = distinct !DILexicalBlock(scope: !204, file: !115, line: 581, column: 7)
!213 = !DILocalVariable(name: "double_space", scope: !204, file: !115, line: 594, type: !178)
!214 = !DILocalVariable(name: "first_word", scope: !204, file: !115, line: 595, type: !175)
!215 = !DILocalVariable(name: "option_text", scope: !204, file: !115, line: 596, type: !175)
!216 = !DILocalVariable(name: "s", scope: !217, file: !115, line: 608, type: !175)
!217 = distinct !DILexicalBlock(scope: !218, file: !115, line: 605, column: 5)
!218 = distinct !DILexicalBlock(scope: !219, file: !115, line: 604, column: 12)
!219 = distinct !DILexicalBlock(scope: !204, file: !115, line: 597, column: 7)
!220 = !DILocalVariable(name: "spaces", scope: !217, file: !115, line: 609, type: !172)
!221 = !DILocalVariable(name: "anchor_len", scope: !204, file: !115, line: 620, type: !172)
!222 = !DILocalVariable(name: "desc_text", scope: !204, file: !115, line: 625, type: !175)
!223 = !DILocalVariable(name: "__ptr", scope: !224, file: !115, line: 644, type: !175)
!224 = distinct !DILexicalBlock(scope: !204, file: !115, line: 644, column: 3)
!225 = !DILocalVariable(name: "__stream", scope: !224, file: !115, line: 644, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !228, line: 7, baseType: !229)
!228 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !230, line: 49, size: 1728, elements: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !249, !250, !251, !254, !255, !257, !258, !261, !263, !266, !269, !270, !271, !272, !273}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !229, file: !230, line: 51, baseType: !116, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !229, file: !230, line: 54, baseType: !169, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !229, file: !230, line: 55, baseType: !169, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !229, file: !230, line: 56, baseType: !169, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !229, file: !230, line: 57, baseType: !169, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !229, file: !230, line: 58, baseType: !169, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !229, file: !230, line: 59, baseType: !169, size: 64, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !229, file: !230, line: 60, baseType: !169, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !229, file: !230, line: 61, baseType: !169, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !229, file: !230, line: 64, baseType: !169, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !229, file: !230, line: 65, baseType: !169, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !229, file: !230, line: 66, baseType: !169, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !229, file: !230, line: 68, baseType: !245, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !230, line: 36, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !229, file: !230, line: 70, baseType: !248, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !229, file: !230, line: 72, baseType: !116, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !229, file: !230, line: 73, baseType: !116, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !229, file: !230, line: 74, baseType: !252, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !253, line: 152, baseType: !179)
!253 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !229, file: !230, line: 77, baseType: !171, size: 16, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !229, file: !230, line: 78, baseType: !256, size: 8, offset: 1040)
!256 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !229, file: !230, line: 79, baseType: !91, size: 8, offset: 1048)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !229, file: !230, line: 81, baseType: !259, size: 64, offset: 1088)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !230, line: 43, baseType: null)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !229, file: !230, line: 89, baseType: !262, size: 64, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !253, line: 153, baseType: !179)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !229, file: !230, line: 91, baseType: !264, size: 64, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !230, line: 37, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !229, file: !230, line: 92, baseType: !267, size: 64, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !230, line: 38, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !229, file: !230, line: 93, baseType: !248, size: 64, offset: 1344)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !229, file: !230, line: 94, baseType: !170, size: 64, offset: 1408)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !229, file: !230, line: 95, baseType: !172, size: 64, offset: 1472)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !229, file: !230, line: 96, baseType: !116, size: 32, offset: 1536)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !229, file: !230, line: 98, baseType: !274, size: 160, offset: 1568)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 20)
!277 = !DILocalVariable(name: "__cnt", scope: !224, file: !115, line: 644, type: !172)
!278 = !DILocalVariable(name: "url_program", scope: !204, file: !115, line: 648, type: !175)
!279 = !DILocalVariable(name: "__ptr", scope: !280, file: !115, line: 686, type: !175)
!280 = distinct !DILexicalBlock(scope: !204, file: !115, line: 686, column: 3)
!281 = !DILocalVariable(name: "__stream", scope: !280, file: !115, line: 686, type: !226)
!282 = !DILocalVariable(name: "__cnt", scope: !280, file: !115, line: 686, type: !172)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !115, line: 585, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 5)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(scope: null, file: !115, line: 586, type: !285, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !115, line: 595, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 4)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !115, line: 620, type: !19, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !14, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !115, line: 648, type: !285, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !292, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !115, line: 649, type: !305, isLocal: true, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 3)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !115, line: 650, type: !285, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !115, line: 651, type: !19, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !115, line: 652, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 7)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !115, line: 653, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 8)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !115, line: 654, type: !96, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !115, line: 655, type: !96, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !115, line: 656, type: !96, isLocal: true, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !115, line: 657, type: !96, isLocal: true, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(scope: null, file: !115, line: 663, type: !316, isLocal: true, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !115, line: 664, type: !96, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !185, isLocal: true, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !115, line: 669, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 40)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 15)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !115, line: 676, type: !24, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !115, line: 679, type: !305, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !115, line: 683, type: !285, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !115, line: 688, type: !285, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !115, line: 691, type: !321, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !115, line: 839, type: !190, isLocal: true, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !115, line: 840, type: !362, isLocal: true, isDefinition: true)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 22)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !115, line: 841, type: !345, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !115, line: 862, type: !292, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !115, line: 868, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 71)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !115, line: 875, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 27)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !39, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !115, line: 877, type: !195, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !316, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !285, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 90, type: !321, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "do_short_format", scope: !108, file: !2, line: 65, type: !178, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "include_heading", scope: !108, file: !2, line: 49, type: !178, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "include_fullname", scope: !108, file: !2, line: 52, type: !178, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "include_where", scope: !108, file: !2, line: 72, type: !178, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "include_idle", scope: !108, file: !2, line: 46, type: !178, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "include_project", scope: !108, file: !2, line: 55, type: !178, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "include_plan", scope: !108, file: !2, line: 58, type: !178, isLocal: true, isDefinition: true)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "include_home_and_shell", scope: !108, file: !2, line: 62, type: !178, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !2, line: 463, type: !305, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 422, type: !345, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !195, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "time_format", scope: !108, file: !2, line: 77, type: !175, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "time_format_width", scope: !108, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !285, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !2, line: 400, type: !19, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !316, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(scope: null, file: !2, line: 402, type: !285, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !19, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !285, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !19, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 405, type: !285, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !19, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !285, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !292, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !2, line: 409, type: !19, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dev_dirfd", scope: !441, file: !2, line: 212, type: !116, isLocal: true, isDefinition: true)
!441 = distinct !DISubprogram(name: "print_entry", scope: !2, file: !2, line: 200, type: !442, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !473)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !136, line: 92, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gl_utmp", file: !136, line: 65, size: 576, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !461, !465, !466, !468}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !447, file: !136, line: 69, baseType: !169, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !447, file: !136, line: 70, baseType: !169, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !447, file: !136, line: 71, baseType: !169, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !447, file: !136, line: 72, baseType: !169, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ut_ts", scope: !447, file: !136, line: 74, baseType: !454, size: 128, offset: 256)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 11, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 16, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !253, line: 160, baseType: !179)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 21, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !253, line: 197, baseType: !179)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !447, file: !136, line: 75, baseType: !462, size: 32, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !463, line: 97, baseType: !464)
!463 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !253, line: 154, baseType: !116)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !447, file: !136, line: 76, baseType: !462, size: 32, offset: 416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !447, file: !136, line: 77, baseType: !467, size: 16, offset: 448)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !447, file: !136, line: 79, baseType: !469, size: 64, offset: 480)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !136, line: 79, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !469, file: !136, line: 79, baseType: !116, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !469, file: !136, line: 79, baseType: !116, size: 32, offset: 32)
!473 = !{!474, !475, !476, !477, !478, !507, !510, !511, !512, !526, !530, !531, !534, !535}
!474 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !441, file: !2, line: 200, type: !444)
!475 = !DILocalVariable(name: "line", scope: !441, file: !2, line: 203, type: !169)
!476 = !DILocalVariable(name: "space", scope: !441, file: !2, line: 204, type: !169)
!477 = !DILocalVariable(name: "dirfd", scope: !441, file: !2, line: 207, type: !116)
!478 = !DILocalVariable(name: "stats", scope: !441, file: !2, line: 222, type: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !480, line: 44, size: 1024, elements: !481)
!480 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!481 = !{!482, !484, !486, !488, !490, !492, !494, !495, !496, !497, !499, !500, !502, !503, !504, !505}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !480, line: 46, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !253, line: 145, baseType: !174)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !480, line: 47, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !253, line: 148, baseType: !174)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !479, file: !480, line: 48, baseType: !487, size: 32, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !253, line: 150, baseType: !111)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !479, file: !480, line: 49, baseType: !489, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !253, line: 151, baseType: !111)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !479, file: !480, line: 50, baseType: !491, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !253, line: 146, baseType: !111)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !479, file: !480, line: 51, baseType: !493, size: 32, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !253, line: 147, baseType: !111)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !479, file: !480, line: 52, baseType: !483, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !479, file: !480, line: 53, baseType: !483, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !479, file: !480, line: 54, baseType: !252, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !479, file: !480, line: 55, baseType: !498, size: 32, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !253, line: 175, baseType: !116)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !479, file: !480, line: 56, baseType: !116, size: 32, offset: 480)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !479, file: !480, line: 57, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !253, line: 180, baseType: !179)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !479, file: !480, line: 65, baseType: !454, size: 128, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !479, file: !480, line: 66, baseType: !454, size: 128, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !479, file: !480, line: 67, baseType: !454, size: 128, offset: 832)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !479, file: !480, line: 79, baseType: !506, size: 64, offset: 960)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 64, elements: !15)
!507 = !DILocalVariable(name: "last_change", scope: !441, file: !2, line: 223, type: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !509, line: 10, baseType: !458)
!509 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "", checksumkind: CSK_MD5, checksum: "5c299a4954617c88bb03645c7864e1b1")
!510 = !DILocalVariable(name: "mesg", scope: !441, file: !2, line: 224, type: !4)
!511 = !DILocalVariable(name: "ut_user", scope: !441, file: !2, line: 236, type: !169)
!512 = !DILocalVariable(name: "pw", scope: !513, file: !2, line: 244, type: !515)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 243, column: 5)
!514 = distinct !DILexicalBlock(scope: !441, file: !2, line: 242, column: 7)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !517, line: 49, size: 384, elements: !518)
!517 = !DIFile(filename: "/usr/include/pwd.h", directory: "", checksumkind: CSK_MD5, checksum: "6682d47abdfe13134f841d46e0eadc7b")
!518 = !{!519, !520, !521, !522, !523, !524, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !516, file: !517, line: 51, baseType: !169, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !516, file: !517, line: 52, baseType: !169, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !516, file: !517, line: 54, baseType: !491, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !516, file: !517, line: 55, baseType: !493, size: 32, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !516, file: !517, line: 56, baseType: !169, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !516, file: !517, line: 57, baseType: !169, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !516, file: !517, line: 58, baseType: !169, size: 64, offset: 320)
!526 = !DILocalVariable(name: "comma", scope: !527, file: !2, line: 250, type: !529)
!527 = distinct !DILexicalBlock(scope: !528, file: !2, line: 249, column: 9)
!528 = distinct !DILexicalBlock(scope: !513, file: !2, line: 245, column: 11)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!530 = !DILocalVariable(name: "result", scope: !527, file: !2, line: 255, type: !169)
!531 = !DILocalVariable(name: "ut_host", scope: !532, file: !2, line: 282, type: !169)
!532 = distinct !DILexicalBlock(scope: !533, file: !2, line: 281, column: 5)
!533 = distinct !DILexicalBlock(scope: !441, file: !2, line: 280, column: 7)
!534 = !DILocalVariable(name: "display", scope: !532, file: !2, line: 285, type: !169)
!535 = !DILocalVariable(name: "host", scope: !532, file: !2, line: 289, type: !169)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(scope: null, file: !2, line: 215, type: !285, isLocal: true, isDefinition: true)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !19, isLocal: true, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !195, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 256, type: !96, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !19, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "now", scope: !548, file: !2, line: 158, type: !508, isLocal: true, isDefinition: true)
!548 = distinct !DISubprogram(name: "idle_string", scope: !2, file: !2, line: 156, type: !549, scopeLine: 157, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!175, !508}
!551 = !{!552, !553, !554, !557, !558}
!552 = !DILocalVariable(name: "when", arg: 1, scope: !548, file: !2, line: 156, type: !508)
!553 = !DILocalVariable(name: "seconds_idle", scope: !548, file: !2, line: 164, type: !508)
!554 = !DILocalVariable(name: "hours", scope: !555, file: !2, line: 169, type: !116)
!555 = distinct !DILexicalBlock(scope: !556, file: !2, line: 168, column: 5)
!556 = distinct !DILexicalBlock(scope: !548, file: !2, line: 167, column: 7)
!557 = !DILocalVariable(name: "minutes", scope: !555, file: !2, line: 170, type: !116)
!558 = !DILocalVariable(name: "days", scope: !559, file: !2, line: 175, type: !560)
!559 = distinct !DILexicalBlock(scope: !556, file: !2, line: 174, column: 5)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !561, line: 101, baseType: !562)
!561 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !253, line: 72, baseType: !179)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "buf", scope: !548, file: !2, line: 159, type: !362, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !19, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !2, line: 171, type: !96, isLocal: true, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(scope: null, file: !2, line: 176, type: !285, isLocal: true, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "buf", scope: !573, file: !2, line: 185, type: !9, isLocal: true, isDefinition: true)
!573 = distinct !DISubprogram(name: "time_string", scope: !2, file: !2, line: 183, type: !574, scopeLine: 184, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !108, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!175, !444}
!576 = !{!577, !578}
!577 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !573, file: !2, line: 183, type: !444)
!578 = !DILocalVariable(name: "tmp", scope: !573, file: !2, line: 186, type: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !581, line: 7, size: 448, elements: !582)
!581 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_tm.h", directory: "", checksumkind: CSK_MD5, checksum: "9e5545b565ef031c4cd0faf90b69386f")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !580, file: !581, line: 9, baseType: !116, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !580, file: !581, line: 10, baseType: !116, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !580, file: !581, line: 11, baseType: !116, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !580, file: !581, line: 12, baseType: !116, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !580, file: !581, line: 13, baseType: !116, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !580, file: !581, line: 14, baseType: !116, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !580, file: !581, line: 15, baseType: !116, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !580, file: !581, line: 16, baseType: !116, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !580, file: !581, line: 17, baseType: !116, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !580, file: !581, line: 20, baseType: !179, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !580, file: !581, line: 21, baseType: !175, size: 64, offset: 384)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !115, line: 952, type: !195, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !2, line: 349, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 13)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !19, isLocal: true, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !345, isLocal: true, isDefinition: true)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !2, line: 356, type: !285, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(scope: null, file: !2, line: 375, type: !195, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 376, type: !19, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !2, line: 377, type: !321, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !96, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !2, line: 383, type: !617, isLocal: true, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 9)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !316, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !2, line: 386, type: !19, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 1024, elements: !293)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !627, line: 50, size: 256, elements: !628)
!627 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!628 = !{!629, !630, !631, !633}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !627, line: 52, baseType: !175, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !626, file: !627, line: 55, baseType: !116, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !626, file: !627, line: 56, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !626, file: !627, line: 57, baseType: !116, size: 32, offset: 192)
!634 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!635 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!636 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!637 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!638 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!639 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!640 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!641 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!642 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !645, line: 3, type: !345, isLocal: true, isDefinition: true)
!645 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "Version", scope: !648, file: !645, line: 3, type: !175, isLocal: false, isDefinition: true)
!648 = distinct !DICompileUnit(language: DW_LANG_C11, file: !645, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !649, splitDebugInlining: false, nameTableKind: None)
!649 = !{!643, !646}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "last_cherror", scope: !652, file: !653, line: 28, type: !116, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C11, file: !653, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !654, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "lib/canon-host.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b27163e4eb904e69bce9c14960126cc5")
!654 = !{!655, !650}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "hints", scope: !657, file: !653, line: 63, type: !665, isLocal: true, isDefinition: true)
!657 = distinct !DISubprogram(name: "canon_host_r", scope: !653, file: !653, line: 61, type: !658, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !652, retainedNodes: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{!169, !175, !632}
!660 = !{!661, !662, !663, !686, !687}
!661 = !DILocalVariable(name: "host", arg: 1, scope: !657, file: !653, line: 61, type: !175)
!662 = !DILocalVariable(name: "cherror", arg: 2, scope: !657, file: !653, line: 61, type: !632)
!663 = !DILocalVariable(name: "res", scope: !657, file: !653, line: 66, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !666, line: 565, size: 384, elements: !667)
!666 = !DIFile(filename: "/usr/include/netdb.h", directory: "", checksumkind: CSK_MD5, checksum: "dd84cdc2a8dcb66c232d326e9ca8b469")
!667 = !{!668, !669, !670, !671, !672, !676, !684, !685}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !665, file: !666, line: 567, baseType: !116, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !665, file: !666, line: 568, baseType: !116, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !665, file: !666, line: 569, baseType: !116, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !665, file: !666, line: 570, baseType: !116, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !665, file: !666, line: 571, baseType: !673, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !674, line: 33, baseType: !675)
!674 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "", checksumkind: CSK_MD5, checksum: "e3826be048699664d9ef7b080f62f2e0")
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !253, line: 210, baseType: !111)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !665, file: !666, line: 572, baseType: !677, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !674, line: 180, size: 128, elements: !679)
!679 = !{!680, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !678, file: !674, line: 182, baseType: !681, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !682, line: 28, baseType: !171)
!682 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "", checksumkind: CSK_MD5, checksum: "dd7f1d9dd6e26f88d1726905ed5d9ff5")
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !678, file: !674, line: 183, baseType: !86, size: 112, offset: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !665, file: !666, line: 573, baseType: !169, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !665, file: !666, line: 574, baseType: !664, size: 64, offset: 320)
!686 = !DILocalVariable(name: "status", scope: !657, file: !653, line: 67, type: !116)
!687 = !DILocalVariable(name: "retval", scope: !657, file: !653, line: 69, type: !169)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "file_name", scope: !690, file: !691, line: 45, type: !175, isLocal: true, isDefinition: true)
!690 = distinct !DICompileUnit(language: DW_LANG_C11, file: !691, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !692, splitDebugInlining: false, nameTableKind: None)
!691 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!692 = !{!693, !695, !697, !699, !688, !701}
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !691, line: 121, type: !316, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !691, line: 121, type: !195, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !691, line: 123, type: !316, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !691, line: 126, type: !305, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !690, file: !691, line: 55, type: !178, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !705, file: !706, line: 66, type: !757, isLocal: false, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !707, globals: !708, splitDebugInlining: false, nameTableKind: None)
!706 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!707 = !{!170, !177}
!708 = !{!709, !711, !736, !738, !740, !742, !703, !744, !746, !748, !750, !755}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !706, line: 272, type: !285, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "old_file_name", scope: !713, file: !706, line: 304, type: !175, isLocal: true, isDefinition: true)
!713 = distinct !DISubprogram(name: "verror_at_line", scope: !706, file: !706, line: 298, type: !714, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !705, retainedNodes: !729)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !116, !116, !175, !111, !175, !716}
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !717, line: 52, baseType: !718)
!717 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !719, line: 14, baseType: !720)
!719 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !721, baseType: !722)
!721 = !DIFile(filename: "lib/error.c", directory: "/src")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !723)
!723 = !{!724, !725, !726, !727, !728}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !722, file: !721, baseType: !170, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !722, file: !721, baseType: !170, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !722, file: !721, baseType: !170, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !722, file: !721, baseType: !116, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !722, file: !721, baseType: !116, size: 32, offset: 224)
!729 = !{!730, !731, !732, !733, !734, !735}
!730 = !DILocalVariable(name: "status", arg: 1, scope: !713, file: !706, line: 298, type: !116)
!731 = !DILocalVariable(name: "errnum", arg: 2, scope: !713, file: !706, line: 298, type: !116)
!732 = !DILocalVariable(name: "file_name", arg: 3, scope: !713, file: !706, line: 298, type: !175)
!733 = !DILocalVariable(name: "line_number", arg: 4, scope: !713, file: !706, line: 298, type: !111)
!734 = !DILocalVariable(name: "message", arg: 5, scope: !713, file: !706, line: 298, type: !175)
!735 = !DILocalVariable(name: "args", arg: 6, scope: !713, file: !706, line: 298, type: !716)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "old_line_number", scope: !713, file: !706, line: 305, type: !111, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(scope: null, file: !706, line: 338, type: !292, isLocal: true, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !706, line: 346, type: !321, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !706, line: 346, type: !14, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "error_message_count", scope: !705, file: !706, line: 69, type: !111, isLocal: false, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !705, file: !706, line: 295, type: !116, isLocal: false, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(scope: null, file: !706, line: 208, type: !316, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !706, line: 208, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 21)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !706, line: 214, type: !285, isLocal: true, isDefinition: true)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null}
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !762, line: 35, type: !14, isLocal: true, isDefinition: true)
!762 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !762, line: 35, type: !19, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "program_name", scope: !767, file: !768, line: 31, type: !175, isLocal: false, isDefinition: true)
!767 = distinct !DICompileUnit(language: DW_LANG_C11, file: !768, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !769, globals: !770, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!769 = !{!169}
!770 = !{!765, !771, !773}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !768, line: 46, type: !321, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !768, line: 49, type: !292, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "utf07FF", scope: !777, file: !778, line: 46, type: !805, isLocal: true, isDefinition: true)
!777 = distinct !DISubprogram(name: "proper_name_lite", scope: !778, file: !778, line: 38, type: !779, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !781, retainedNodes: !783)
!778 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!779 = !DISubroutineType(types: !780)
!780 = !{!175, !175, !175}
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !782, splitDebugInlining: false, nameTableKind: None)
!782 = !{!775}
!783 = !{!784, !785, !786, !787, !792}
!784 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !777, file: !778, line: 38, type: !175)
!785 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !777, file: !778, line: 38, type: !175)
!786 = !DILocalVariable(name: "translation", scope: !777, file: !778, line: 40, type: !175)
!787 = !DILocalVariable(name: "w", scope: !777, file: !778, line: 47, type: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !789, line: 37, baseType: !790)
!789 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !253, line: 57, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !253, line: 42, baseType: !111)
!792 = !DILocalVariable(name: "mbs", scope: !777, file: !778, line: 48, type: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !794, line: 6, baseType: !795)
!794 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !796, line: 21, baseType: !797)
!796 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !796, line: 13, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !797, file: !796, line: 15, baseType: !116, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !797, file: !796, line: 20, baseType: !801, size: 32, offset: 32)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !797, file: !796, line: 16, size: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !801, file: !796, line: 18, baseType: !111, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !801, file: !796, line: 19, baseType: !292, size: 32)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 16, elements: !15)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(scope: null, file: !808, line: 78, type: !321, isLocal: true, isDefinition: true)
!808 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(scope: null, file: !808, line: 79, type: !19, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !808, line: 80, type: !598, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !808, line: 81, type: !598, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(scope: null, file: !808, line: 82, type: !274, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(scope: null, file: !808, line: 83, type: !14, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(scope: null, file: !808, line: 84, type: !321, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(scope: null, file: !808, line: 85, type: !316, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(scope: null, file: !808, line: 86, type: !316, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(scope: null, file: !808, line: 87, type: !321, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !829, file: !808, line: 76, type: !901, isLocal: false, isDefinition: true)
!829 = distinct !DICompileUnit(language: DW_LANG_C11, file: !808, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !830, retainedTypes: !836, globals: !837, splitDebugInlining: false, nameTableKind: None)
!830 = !{!142, !831, !120}
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !143, line: 254, baseType: !111, size: 32, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!834 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!835 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!836 = !{!116, !171, !172}
!837 = !{!806, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !838, !842, !852, !854, !859, !861, !863, !865, !867, !890, !897, !899}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !829, file: !808, line: 92, type: !840, isLocal: false, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 320, elements: !97)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !829, file: !808, line: 1040, type: !844, isLocal: false, isDefinition: true)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !808, line: 56, size: 448, elements: !845)
!845 = !{!846, !847, !848, !850, !851}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !844, file: !808, line: 59, baseType: !142, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !844, file: !808, line: 62, baseType: !116, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !844, file: !808, line: 66, baseType: !849, size: 256, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 256, elements: !322)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !844, file: !808, line: 69, baseType: !175, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !844, file: !808, line: 72, baseType: !175, size: 64, offset: 384)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !829, file: !808, line: 107, type: !844, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "slot0", scope: !829, file: !808, line: 831, type: !856, isLocal: true, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 256)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(scope: null, file: !808, line: 321, type: !14, isLocal: true, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(scope: null, file: !808, line: 357, type: !14, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(scope: null, file: !808, line: 358, type: !14, isLocal: true, isDefinition: true)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(scope: null, file: !808, line: 199, type: !316, isLocal: true, isDefinition: true)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "quote", scope: !869, file: !808, line: 228, type: !888, isLocal: true, isDefinition: true)
!869 = distinct !DISubprogram(name: "gettext_quote", scope: !808, file: !808, line: 197, type: !870, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !829, retainedNodes: !872)
!870 = !DISubroutineType(types: !871)
!871 = !{!175, !175, !142}
!872 = !{!873, !874, !875, !876, !877}
!873 = !DILocalVariable(name: "msgid", arg: 1, scope: !869, file: !808, line: 197, type: !175)
!874 = !DILocalVariable(name: "s", arg: 2, scope: !869, file: !808, line: 197, type: !142)
!875 = !DILocalVariable(name: "translation", scope: !869, file: !808, line: 199, type: !175)
!876 = !DILocalVariable(name: "w", scope: !869, file: !808, line: 229, type: !788)
!877 = !DILocalVariable(name: "mbs", scope: !869, file: !808, line: 230, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !794, line: 6, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !796, line: 21, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !796, line: 13, size: 64, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !880, file: !796, line: 15, baseType: !116, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !880, file: !796, line: 20, baseType: !884, size: 32, offset: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !796, line: 16, size: 32, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !884, file: !796, line: 18, baseType: !111, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !884, file: !796, line: 19, baseType: !292, size: 32)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !889)
!889 = !{!16, !294}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "slotvec", scope: !829, file: !808, line: 834, type: !892, isLocal: true, isDefinition: true)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !808, line: 823, size: 128, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !893, file: !808, line: 825, baseType: !172, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !893, file: !808, line: 826, baseType: !169, size: 64, offset: 64)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "nslots", scope: !829, file: !808, line: 832, type: !116, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "slotvec0", scope: !829, file: !808, line: 833, type: !893, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 704, elements: !903)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!903 = !{!904}
!904 = !DISubrange(count: 11)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(scope: null, file: !907, line: 347, type: !86, isLocal: true, isDefinition: true)
!907 = !DIFile(filename: "lib/readutmp.c", directory: "/src", checksumkind: CSK_MD5, checksum: "da68be8ee1104a39b5ac94d0be1eef81")
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !907, line: 398, type: !617, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !907, line: 399, type: !14, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !907, line: 446, type: !316, isLocal: true, isDefinition: true)
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(scope: null, file: !907, line: 447, type: !91, isLocal: true, isDefinition: true)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !918, line: 98, type: !919, isLocal: true, isDefinition: true)
!918 = !DIFile(filename: "./lib/boot-time-aux.h", directory: "/src", checksumkind: CSK_MD5, checksum: "56a7f792a9c98183f316974c092e6a70")
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 29)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !918, line: 99, type: !919, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(scope: null, file: !918, line: 100, type: !752, isLocal: true, isDefinition: true)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !918, line: 40, type: !598, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !918, line: 40, type: !305, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !932, line: 67, type: !195, isLocal: true, isDefinition: true)
!932 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(scope: null, file: !932, line: 69, type: !316, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !932, line: 83, type: !316, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !932, line: 83, type: !292, isLocal: true, isDefinition: true)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(scope: null, file: !932, line: 85, type: !14, isLocal: true, isDefinition: true)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !932, line: 88, type: !943, isLocal: true, isDefinition: true)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 171)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !932, line: 88, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 34)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !932, line: 105, type: !190, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !932, line: 109, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 23)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !932, line: 113, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 28)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(scope: null, file: !932, line: 120, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 32)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !932, line: 127, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 36)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !932, line: 134, type: !340, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !932, line: 142, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 44)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !932, line: 150, type: !982, isLocal: true, isDefinition: true)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 48)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !932, line: 159, type: !51, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !932, line: 170, type: !989, isLocal: true, isDefinition: true)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 60)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(scope: null, file: !932, line: 248, type: !274, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !932, line: 248, type: !362, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !932, line: 254, type: !274, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(scope: null, file: !932, line: 254, type: !86, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(scope: null, file: !932, line: 254, type: !340, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !932, line: 259, type: !3, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(scope: null, file: !932, line: 259, type: !919, isLocal: true, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1008, file: !1009, line: 26, type: !1011, isLocal: false, isDefinition: true)
!1008 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1009, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1010, splitDebugInlining: false, nameTableKind: None)
!1009 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1010 = !{!1006}
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 376, elements: !1012)
!1012 = !{!1013}
!1013 = !DISubrange(count: 47)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1016, file: !1017, line: 24, type: !1019, isLocal: false, isDefinition: true)
!1016 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1017, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1018, splitDebugInlining: false, nameTableKind: None)
!1017 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1018 = !{!1014}
!1019 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(scope: null, file: !1022, line: 34, type: !305, isLocal: true, isDefinition: true)
!1022 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(scope: null, file: !1022, line: 34, type: !316, isLocal: true, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(scope: null, file: !1022, line: 34, type: !185, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 108, type: !91, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "internal_state", scope: !1032, file: !1029, line: 97, type: !1035, isLocal: true, isDefinition: true)
!1032 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1033, globals: !1034, splitDebugInlining: false, nameTableKind: None)
!1033 = !{!170, !172, !177}
!1034 = !{!1027, !1030}
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !794, line: 6, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !796, line: 21, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !796, line: 13, size: 64, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1037, file: !796, line: 15, baseType: !116, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1037, file: !796, line: 20, baseType: !1041, size: 32, offset: 32)
!1041 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1037, file: !796, line: 16, size: 32, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1041, file: !796, line: 18, baseType: !111, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1041, file: !796, line: 19, baseType: !292, size: 32)
!1045 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1046, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1047, splitDebugInlining: false, nameTableKind: None)
!1046 = !DIFile(filename: "lib/fadvise.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4f050f925b6846c8ec117ac893b2a17f")
!1047 = !{!159}
!1048 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1049, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1050, splitDebugInlining: false, nameTableKind: None)
!1049 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1050 = !{!170}
!1051 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1052, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1050, splitDebugInlining: false, nameTableKind: None)
!1052 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1053 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1054 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1055 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1056, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1057, splitDebugInlining: false, nameTableKind: None)
!1056 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1057 = !{!175}
!1058 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1059, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1059 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1060 = distinct !DICompileUnit(language: DW_LANG_C11, file: !762, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1061, splitDebugInlining: false, nameTableKind: None)
!1061 = !{!760, !763}
!1062 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1063, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1064, splitDebugInlining: false, nameTableKind: None)
!1063 = !DIFile(filename: "lib/imaxtostr.c", directory: "/src", checksumkind: CSK_MD5, checksum: "87f2ca6b5c7f9122ee2018b2c996c5d5")
!1064 = !{!560}
!1065 = distinct !DICompileUnit(language: DW_LANG_C11, file: !907, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1066, retainedTypes: !1067, globals: !1097, splitDebugInlining: false, nameTableKind: None)
!1066 = !{!135}
!1067 = !{!169, !170, !1068, !1096, !172}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !1071, line: 55, size: 3200, elements: !1072)
!1071 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/utmpx.h", directory: "", checksumkind: CSK_MD5, checksum: "d076be7f45ef793a8c3c4dd5282b1b1a")
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1084, !1085, !1092, !1095}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1070, file: !1071, line: 57, baseType: !467, size: 16)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1070, file: !1071, line: 58, baseType: !464, size: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1070, file: !1071, line: 59, baseType: !965, size: 256, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1070, file: !1071, line: 61, baseType: !292, size: 32, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1070, file: !1071, line: 63, baseType: !965, size: 256, offset: 352)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1070, file: !1071, line: 65, baseType: !856, size: 2048, offset: 608)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1070, file: !1071, line: 67, baseType: !1080, size: 32, offset: 2656)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !1071, line: 42, size: 32, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1080, file: !1071, line: 45, baseType: !467, size: 16)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1080, file: !1071, line: 46, baseType: !467, size: 16, offset: 16)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1070, file: !1071, line: 81, baseType: !179, size: 64, offset: 2688)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !1070, file: !1071, line: 82, baseType: !1086, size: 128, offset: 2752)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1087, line: 8, size: 128, elements: !1088)
!1087 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "", checksumkind: CSK_MD5, checksum: "9b45d950050c215f216850b27bd1e8f3")
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1086, file: !1087, line: 14, baseType: !458, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1086, file: !1087, line: 15, baseType: !1091, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !253, line: 162, baseType: !179)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !1070, file: !1071, line: 84, baseType: !1093, size: 128, offset: 2880)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 128, elements: !293)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !253, line: 41, baseType: !116)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1070, file: !1071, line: 85, baseType: !274, size: 160, offset: 3008)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !561, line: 87, baseType: !179)
!1097 = !{!905, !908, !910, !912, !914, !916, !922, !924, !926, !928}
!1098 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1099, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1100, retainedTypes: !1105, splitDebugInlining: false, nameTableKind: None)
!1099 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!1100 = !{!1101}
!1101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1102, line: 36, baseType: !111, size: 32, elements: !1103)
!1102 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1103 = !{!1104}
!1104 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1105 = !{!172}
!1106 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1107, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1107 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1108 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1109, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1050, splitDebugInlining: false, nameTableKind: None)
!1109 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1110 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1111, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1050, splitDebugInlining: false, nameTableKind: None)
!1111 = !DIFile(filename: "lib/time.c", directory: "/src", checksumkind: CSK_MD5, checksum: "402c2ccc7a3a90dfc8381b5d9f8bcf84")
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !932, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1113, retainedTypes: !1050, globals: !1117, splitDebugInlining: false, nameTableKind: None)
!1113 = !{!1114}
!1114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !932, line: 40, baseType: !111, size: 32, elements: !1115)
!1115 = !{!1116}
!1116 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1117 = !{!930, !933, !935, !937, !939, !941, !946, !951, !953, !958, !963, !968, !973, !975, !980, !985, !987, !992, !994, !996, !998, !1000, !1002, !1004}
!1118 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1119, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1120, retainedTypes: !1151, splitDebugInlining: false, nameTableKind: None)
!1119 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1120 = !{!1121, !1133}
!1121 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1122, file: !1119, line: 188, baseType: !111, size: 32, elements: !1131)
!1122 = distinct !DISubprogram(name: "x2nrealloc", scope: !1119, file: !1119, line: 176, type: !1123, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1118, retainedNodes: !1126)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!170, !170, !1125, !172}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!1126 = !{!1127, !1128, !1129, !1130}
!1127 = !DILocalVariable(name: "p", arg: 1, scope: !1122, file: !1119, line: 176, type: !170)
!1128 = !DILocalVariable(name: "pn", arg: 2, scope: !1122, file: !1119, line: 176, type: !1125)
!1129 = !DILocalVariable(name: "s", arg: 3, scope: !1122, file: !1119, line: 176, type: !172)
!1130 = !DILocalVariable(name: "n", scope: !1122, file: !1119, line: 178, type: !172)
!1131 = !{!1132}
!1132 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1133 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1134, file: !1119, line: 228, baseType: !111, size: 32, elements: !1131)
!1134 = distinct !DISubprogram(name: "xpalloc", scope: !1119, file: !1119, line: 223, type: !1135, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1118, retainedNodes: !1141)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!170, !170, !1137, !1138, !1140, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1139, line: 130, baseType: !1140)
!1139 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !173, line: 35, baseType: !179)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1142 = !DILocalVariable(name: "pa", arg: 1, scope: !1134, file: !1119, line: 223, type: !170)
!1143 = !DILocalVariable(name: "pn", arg: 2, scope: !1134, file: !1119, line: 223, type: !1137)
!1144 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1134, file: !1119, line: 223, type: !1138)
!1145 = !DILocalVariable(name: "n_max", arg: 4, scope: !1134, file: !1119, line: 223, type: !1140)
!1146 = !DILocalVariable(name: "s", arg: 5, scope: !1134, file: !1119, line: 223, type: !1138)
!1147 = !DILocalVariable(name: "n0", scope: !1134, file: !1119, line: 230, type: !1138)
!1148 = !DILocalVariable(name: "n", scope: !1134, file: !1119, line: 237, type: !1138)
!1149 = !DILocalVariable(name: "nbytes", scope: !1134, file: !1119, line: 248, type: !1138)
!1150 = !DILocalVariable(name: "adjusted_nbytes", scope: !1134, file: !1119, line: 252, type: !1138)
!1151 = !{!169, !170, !178, !179, !174}
