; ModuleID = 'src/printenv.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [164 x i8] c"Usage: %s [OPTION] [VARIABLE]...\0APrint the values of the specified environment VARIABLE(s).\0AIf no VARIABLE is specified, print name and value pairs for them all.\0A\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [9 x i8] c"printenv\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [66 x i8] c"  -0, --null\0A         end each output line with NUL, not newline\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"      --help\0A         display this help and exit\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [62 x i8] c"      --version\0A         output version information and exit\0A\00", align 1, !dbg !27

!78 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!79 = !DIEnumerator(name: "_ISspace", value: 8192)
!80 = !DIEnumerator(name: "_ISprint", value: 16384)
!81 = !DIEnumerator(name: "_ISgraph", value: 32768)
!82 = !DIEnumerator(name: "_ISblank", value: 1)
!83 = !DIEnumerator(name: "_IScntrl", value: 2)
!84 = !DIEnumerator(name: "_ISpunct", value: 4)
!85 = !DIEnumerator(name: "_ISalnum", value: 8)
!86 = !{!87, !88, !67, !89, !90, !93, !95}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !91, line: 46, baseType: !92)
!91 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!92 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!95 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!96 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !97, !102, !107, !112, !117, !200, !202, !204, !209, !211, !216, !218, !220, !225, !227, !229, !231, !236, !241, !243, !245, !247, !249, !251, !253, !255, !260, !265, !270, !272, !274, !276, !278, !280, !285, !287, !289, !294, !299, !304, !309, !311, !313, !57}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 14)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 16)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 17)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 5)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !119, file: !66, line: 575, type: !67, isLocal: true, isDefinition: true)
!119 = distinct !DISubprogram(name: "oputs_", scope: !66, file: !66, line: 573, type: !120, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !122)
!120 = !DISubroutineType(cc: DW_CC_nocall, types: !121)
!121 = !{null, !93, !93}
!122 = !{!123, !124, !125, !128, !130, !131, !132, !136, !137, !138, !139, !141, !194, !195, !196, !198, !199}
!123 = !DILocalVariable(name: "program", arg: 1, scope: !119, file: !66, line: 573, type: !93)
!124 = !DILocalVariable(name: "option", arg: 2, scope: !119, file: !66, line: 573, type: !93)
!125 = !DILocalVariable(name: "term", scope: !126, file: !66, line: 585, type: !93)
!126 = distinct !DILexicalBlock(scope: !127, file: !66, line: 582, column: 5)
!127 = distinct !DILexicalBlock(scope: !119, file: !66, line: 581, column: 7)
!128 = !DILocalVariable(name: "double_space", scope: !119, file: !66, line: 594, type: !129)
!129 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!130 = !DILocalVariable(name: "first_word", scope: !119, file: !66, line: 595, type: !93)
!131 = !DILocalVariable(name: "option_text", scope: !119, file: !66, line: 596, type: !93)
!132 = !DILocalVariable(name: "s", scope: !133, file: !66, line: 608, type: !93)
!133 = distinct !DILexicalBlock(scope: !134, file: !66, line: 605, column: 5)
!134 = distinct !DILexicalBlock(scope: !135, file: !66, line: 604, column: 12)
!135 = distinct !DILexicalBlock(scope: !119, file: !66, line: 597, column: 7)
!136 = !DILocalVariable(name: "spaces", scope: !133, file: !66, line: 609, type: !90)
!137 = !DILocalVariable(name: "anchor_len", scope: !119, file: !66, line: 620, type: !90)
!138 = !DILocalVariable(name: "desc_text", scope: !119, file: !66, line: 625, type: !93)
!139 = !DILocalVariable(name: "__ptr", scope: !140, file: !66, line: 644, type: !93)
!140 = distinct !DILexicalBlock(scope: !119, file: !66, line: 644, column: 3)
!141 = !DILocalVariable(name: "__stream", scope: !140, file: !66, line: 644, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 7, baseType: !145)
!144 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 49, size: 1728, elements: !147)
!146 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !163, !165, !166, !167, !171, !172, !174, !175, !178, !180, !183, !186, !187, !188, !189, !190}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !145, file: !146, line: 51, baseType: !67, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !145, file: !146, line: 54, baseType: !87, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !145, file: !146, line: 55, baseType: !87, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !145, file: !146, line: 56, baseType: !87, size: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !145, file: !146, line: 57, baseType: !87, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !145, file: !146, line: 58, baseType: !87, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !145, file: !146, line: 59, baseType: !87, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !145, file: !146, line: 60, baseType: !87, size: 64, offset: 448)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !145, file: !146, line: 61, baseType: !87, size: 64, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !145, file: !146, line: 64, baseType: !87, size: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !145, file: !146, line: 65, baseType: !87, size: 64, offset: 640)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !145, file: !146, line: 66, baseType: !87, size: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !145, file: !146, line: 68, baseType: !161, size: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !146, line: 36, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !145, file: !146, line: 70, baseType: !164, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !145, file: !146, line: 72, baseType: !67, size: 32, offset: 896)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !145, file: !146, line: 73, baseType: !67, size: 32, offset: 928)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !145, file: !146, line: 74, baseType: !168, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !169, line: 152, baseType: !170)
!169 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!170 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !145, file: !146, line: 77, baseType: !89, size: 16, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !145, file: !146, line: 78, baseType: !173, size: 8, offset: 1040)
!173 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !145, file: !146, line: 79, baseType: !39, size: 8, offset: 1048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !145, file: !146, line: 81, baseType: !176, size: 64, offset: 1088)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !146, line: 43, baseType: null)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !145, file: !146, line: 89, baseType: !179, size: 64, offset: 1152)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !169, line: 153, baseType: !170)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !145, file: !146, line: 91, baseType: !181, size: 64, offset: 1216)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !146, line: 37, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !145, file: !146, line: 92, baseType: !184, size: 64, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !146, line: 38, flags: DIFlagFwdDecl)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !145, file: !146, line: 93, baseType: !164, size: 64, offset: 1344)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !145, file: !146, line: 94, baseType: !88, size: 64, offset: 1408)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !145, file: !146, line: 95, baseType: !90, size: 64, offset: 1472)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !145, file: !146, line: 96, baseType: !67, size: 32, offset: 1536)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !145, file: !146, line: 98, baseType: !191, size: 160, offset: 1568)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 20)
!194 = !DILocalVariable(name: "__cnt", scope: !140, file: !66, line: 644, type: !90)
!195 = !DILocalVariable(name: "url_program", scope: !119, file: !66, line: 648, type: !93)
!196 = !DILocalVariable(name: "__ptr", scope: !197, file: !66, line: 686, type: !93)
!197 = distinct !DILexicalBlock(scope: !119, file: !66, line: 686, column: 3)
!198 = !DILocalVariable(name: "__stream", scope: !197, file: !66, line: 686, type: !142)
!199 = !DILocalVariable(name: "__cnt", scope: !197, file: !66, line: 686, type: !90)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !66, line: 585, type: !114, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !66, line: 586, type: !114, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(scope: null, file: !66, line: 595, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 4)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !66, line: 620, type: !54, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !66, line: 648, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 2)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !66, line: 648, type: !114, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(scope: null, file: !66, line: 649, type: !206, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(scope: null, file: !66, line: 649, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 3)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(scope: null, file: !66, line: 650, type: !114, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(scope: null, file: !66, line: 651, type: !54, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !66, line: 651, type: !54, isLocal: true, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !66, line: 652, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 7)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !66, line: 653, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 8)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !66, line: 654, type: !44, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !66, line: 655, type: !44, isLocal: true, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !66, line: 656, type: !44, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(scope: null, file: !66, line: 657, type: !44, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !66, line: 663, type: !233, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(scope: null, file: !66, line: 664, type: !44, isLocal: true, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !66, line: 669, type: !109, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !66, line: 669, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 40)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !66, line: 676, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 15)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !66, line: 676, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 61)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !66, line: 679, type: !222, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !66, line: 683, type: !114, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !66, line: 688, type: !114, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !66, line: 691, type: !238, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !66, line: 839, type: !104, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !66, line: 840, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 22)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !66, line: 841, type: !262, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !66, line: 862, type: !206, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !66, line: 868, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 71)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !66, line: 875, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 27)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !66, line: 877, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 51)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !66, line: 877, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 12)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !114, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !114, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !238, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 1024, elements: !207)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !318, line: 50, size: 256, elements: !319)
!318 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!319 = !{!320, !321, !322, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !318, line: 52, baseType: !93, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !317, file: !318, line: 55, baseType: !67, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !318, line: 56, baseType: !323, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !317, file: !318, line: 57, baseType: !67, size: 32, offset: 192)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !327, line: 3, type: !262, isLocal: true, isDefinition: true)
!327 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "Version", scope: !330, file: !327, line: 3, type: !93, isLocal: false, isDefinition: true)
!330 = distinct !DICompileUnit(language: DW_LANG_C11, file: !327, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !331, splitDebugInlining: false, nameTableKind: None)
!331 = !{!325, !328}
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "file_name", scope: !334, file: !335, line: 45, type: !93, isLocal: true, isDefinition: true)
!334 = distinct !DICompileUnit(language: DW_LANG_C11, file: !335, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !336, splitDebugInlining: false, nameTableKind: None)
!335 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!336 = !{!337, !339, !341, !343, !332, !345}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !335, line: 121, type: !233, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !335, line: 121, type: !306, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !335, line: 123, type: !233, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !335, line: 126, type: !222, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !334, file: !335, line: 55, type: !129, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !349, file: !350, line: 66, type: !401, isLocal: false, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C11, file: !350, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !351, globals: !352, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!351 = !{!88, !95}
!352 = !{!353, !355, !380, !382, !384, !386, !347, !388, !390, !392, !394, !399}
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !350, line: 272, type: !114, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "old_file_name", scope: !357, file: !350, line: 304, type: !93, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "verror_at_line", scope: !350, file: !350, line: 298, type: !358, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !373)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !67, !67, !93, !62, !93, !360}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !361, line: 52, baseType: !362)
!361 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !363, line: 14, baseType: !364)
!363 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !365, baseType: !366)
!365 = !DIFile(filename: "lib/error.c", directory: "/src")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !367)
!367 = !{!368, !369, !370, !371, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !366, file: !365, baseType: !88, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !366, file: !365, baseType: !88, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !366, file: !365, baseType: !88, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !366, file: !365, baseType: !67, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !366, file: !365, baseType: !67, size: 32, offset: 224)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DILocalVariable(name: "status", arg: 1, scope: !357, file: !350, line: 298, type: !67)
!375 = !DILocalVariable(name: "errnum", arg: 2, scope: !357, file: !350, line: 298, type: !67)
!376 = !DILocalVariable(name: "file_name", arg: 3, scope: !357, file: !350, line: 298, type: !93)
!377 = !DILocalVariable(name: "line_number", arg: 4, scope: !357, file: !350, line: 298, type: !62)
!378 = !DILocalVariable(name: "message", arg: 5, scope: !357, file: !350, line: 298, type: !93)
!379 = !DILocalVariable(name: "args", arg: 6, scope: !357, file: !350, line: 298, type: !360)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "old_line_number", scope: !357, file: !350, line: 305, type: !62, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !350, line: 338, type: !206, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !350, line: 346, type: !238, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !350, line: 346, type: !213, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "error_message_count", scope: !349, file: !350, line: 69, type: !62, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !349, file: !350, line: 295, type: !67, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !350, line: 208, type: !233, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !350, line: 208, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 21)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(scope: null, file: !350, line: 214, type: !114, isLocal: true, isDefinition: true)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{null}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "program_name", scope: !406, file: !407, line: 31, type: !93, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C11, file: !407, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !408, globals: !409, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!408 = !{!87}
!409 = !{!404, !410, !412}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !407, line: 46, type: !238, isLocal: true, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !407, line: 49, type: !206, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "utf07FF", scope: !416, file: !417, line: 46, type: !444, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "proper_name_lite", scope: !417, file: !417, line: 38, type: !418, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !420, retainedNodes: !422)
!417 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!418 = !DISubroutineType(types: !419)
!419 = !{!93, !93, !93}
!420 = distinct !DICompileUnit(language: DW_LANG_C11, file: !417, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !421, splitDebugInlining: false, nameTableKind: None)
!421 = !{!414}
!422 = !{!423, !424, !425, !426, !431}
!423 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !416, file: !417, line: 38, type: !93)
!424 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !416, file: !417, line: 38, type: !93)
!425 = !DILocalVariable(name: "translation", scope: !416, file: !417, line: 40, type: !93)
!426 = !DILocalVariable(name: "w", scope: !416, file: !417, line: 47, type: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !428, line: 37, baseType: !429)
!428 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !169, line: 57, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !169, line: 42, baseType: !62)
!431 = !DILocalVariable(name: "mbs", scope: !416, file: !417, line: 48, type: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !433, line: 6, baseType: !434)
!433 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !435, line: 21, baseType: !436)
!435 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 13, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !436, file: !435, line: 15, baseType: !67, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !436, file: !435, line: 20, baseType: !440, size: 32, offset: 32)
!440 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !436, file: !435, line: 16, size: 32, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !440, file: !435, line: 18, baseType: !62, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !440, file: !435, line: 19, baseType: !206, size: 32)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 16, elements: !214)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !447, line: 78, type: !238, isLocal: true, isDefinition: true)
!447 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !447, line: 79, type: !54, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !447, line: 80, type: !452, isLocal: true, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 13)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !447, line: 81, type: !452, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(scope: null, file: !447, line: 82, type: !191, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(scope: null, file: !447, line: 83, type: !213, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(scope: null, file: !447, line: 84, type: !238, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(scope: null, file: !447, line: 85, type: !233, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !447, line: 86, type: !233, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !447, line: 87, type: !238, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !471, file: !447, line: 76, type: !557, isLocal: false, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C11, file: !447, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, retainedTypes: !492, globals: !493, splitDebugInlining: false, nameTableKind: None)
!472 = !{!473, !487, !71}
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !474, line: 42, baseType: !62, size: 32, elements: !475)
!474 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486}
!476 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!477 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!478 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!479 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!480 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!481 = !DIEnumerator(name: "c_quoting_style", value: 5)
!482 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!483 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!484 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!485 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!486 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !474, line: 254, baseType: !62, size: 32, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!490 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!491 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!492 = !{!67, !89, !90}
!493 = !{!445, !448, !450, !455, !457, !459, !461, !463, !465, !467, !469, !494, !498, !508, !510, !515, !517, !519, !521, !523, !546, !553, !555}
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !471, file: !447, line: 92, type: !496, isLocal: false, isDefinition: true)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 320, elements: !45)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !471, file: !447, line: 1040, type: !500, isLocal: false, isDefinition: true)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !447, line: 56, size: 448, elements: !501)
!501 = !{!502, !503, !504, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !500, file: !447, line: 59, baseType: !473, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !447, line: 62, baseType: !67, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !500, file: !447, line: 66, baseType: !505, size: 256, offset: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 256, elements: !239)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !500, file: !447, line: 69, baseType: !93, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !500, file: !447, line: 72, baseType: !93, size: 64, offset: 384)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !471, file: !447, line: 107, type: !500, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "slot0", scope: !471, file: !447, line: 831, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 256)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !447, line: 321, type: !213, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !447, line: 357, type: !213, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !447, line: 358, type: !213, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !447, line: 199, type: !233, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "quote", scope: !525, file: !447, line: 228, type: !544, isLocal: true, isDefinition: true)
!525 = distinct !DISubprogram(name: "gettext_quote", scope: !447, file: !447, line: 197, type: !526, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !528)
!526 = !DISubroutineType(types: !527)
!527 = !{!93, !93, !473}
!528 = !{!529, !530, !531, !532, !533}
!529 = !DILocalVariable(name: "msgid", arg: 1, scope: !525, file: !447, line: 197, type: !93)
!530 = !DILocalVariable(name: "s", arg: 2, scope: !525, file: !447, line: 197, type: !473)
!531 = !DILocalVariable(name: "translation", scope: !525, file: !447, line: 199, type: !93)
!532 = !DILocalVariable(name: "w", scope: !525, file: !447, line: 229, type: !427)
!533 = !DILocalVariable(name: "mbs", scope: !525, file: !447, line: 230, type: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !433, line: 6, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !435, line: 21, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 13, size: 64, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !536, file: !435, line: 15, baseType: !67, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !536, file: !435, line: 20, baseType: !540, size: 32, offset: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !536, file: !435, line: 16, size: 32, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !540, file: !435, line: 18, baseType: !62, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !540, file: !435, line: 19, baseType: !206, size: 32)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 64, elements: !545)
!545 = !{!215, !208}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "slotvec", scope: !471, file: !447, line: 834, type: !548, isLocal: true, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !447, line: 823, size: 128, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !549, file: !447, line: 825, baseType: !90, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !549, file: !447, line: 826, baseType: !87, size: 64, offset: 64)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "nslots", scope: !471, file: !447, line: 832, type: !67, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "slotvec0", scope: !471, file: !447, line: 833, type: !549, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 704, elements: !559)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!559 = !{!560}
!560 = !DISubrange(count: 11)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(scope: null, file: !563, line: 67, type: !306, isLocal: true, isDefinition: true)
!563 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !563, line: 69, type: !233, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !563, line: 83, type: !233, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !563, line: 83, type: !206, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(scope: null, file: !563, line: 85, type: !213, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !563, line: 88, type: !574, isLocal: true, isDefinition: true)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 171)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !563, line: 88, type: !579, isLocal: true, isDefinition: true)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 34)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(scope: null, file: !563, line: 105, type: !104, isLocal: true, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !563, line: 109, type: !586, isLocal: true, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 23)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !563, line: 113, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 28)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !563, line: 120, type: !596, isLocal: true, isDefinition: true)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 32)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(scope: null, file: !563, line: 127, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 36)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !563, line: 134, type: !257, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !563, line: 142, type: !608, isLocal: true, isDefinition: true)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 44)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !563, line: 150, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 48)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(scope: null, file: !563, line: 159, type: !618, isLocal: true, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 52)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !563, line: 170, type: !623, isLocal: true, isDefinition: true)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 60)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(scope: null, file: !563, line: 248, type: !191, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(scope: null, file: !563, line: 248, type: !282, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(scope: null, file: !563, line: 254, type: !191, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !563, line: 254, type: !99, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(scope: null, file: !563, line: 254, type: !257, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !563, line: 259, type: !3, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(scope: null, file: !563, line: 259, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 29)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !645, file: !646, line: 26, type: !648, isLocal: false, isDefinition: true)
!645 = distinct !DICompileUnit(language: DW_LANG_C11, file: !646, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !647, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!647 = !{!643}
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 376, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 47)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "exit_failure", scope: !653, file: !654, line: 24, type: !656, isLocal: false, isDefinition: true)
!653 = distinct !DICompileUnit(language: DW_LANG_C11, file: !654, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !655, splitDebugInlining: false, nameTableKind: None)
!654 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!655 = !{!651}
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !659, line: 34, type: !222, isLocal: true, isDefinition: true)
!659 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !659, line: 34, type: !233, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !659, line: 34, type: !109, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !666, line: 108, type: !39, isLocal: true, isDefinition: true)
!666 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "internal_state", scope: !669, file: !666, line: 97, type: !672, isLocal: true, isDefinition: true)
!669 = distinct !DICompileUnit(language: DW_LANG_C11, file: !666, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !670, globals: !671, splitDebugInlining: false, nameTableKind: None)
!670 = !{!88, !90, !95}
!671 = !{!664, !667}
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !433, line: 6, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !435, line: 21, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 13, size: 64, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !674, file: !435, line: 15, baseType: !67, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !674, file: !435, line: 20, baseType: !678, size: 32, offset: 32)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !674, file: !435, line: 16, size: 32, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !678, file: !435, line: 18, baseType: !62, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !678, file: !435, line: 19, baseType: !206, size: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !684, line: 35, type: !213, isLocal: true, isDefinition: true)
!684 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !684, line: 35, type: !54, isLocal: true, isDefinition: true)
!687 = distinct !DICompileUnit(language: DW_LANG_C11, file: !688, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!688 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !563, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !690, retainedTypes: !694, globals: !695, splitDebugInlining: false, nameTableKind: None)
!690 = !{!691}
!691 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !563, line: 40, baseType: !62, size: 32, elements: !692)
!692 = !{!693}
!693 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!694 = !{!88}
!695 = !{!561, !564, !566, !568, !570, !572, !577, !582, !584, !589, !594, !599, !604, !606, !611, !616, !621, !626, !628, !630, !632, !634, !636, !638}
!696 = distinct !DICompileUnit(language: DW_LANG_C11, file: !697, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !729, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!698 = !{!699, !711}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !700, file: !697, line: 188, baseType: !62, size: 32, elements: !709)
!700 = distinct !DISubprogram(name: "x2nrealloc", scope: !697, file: !697, line: 176, type: !701, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!88, !88, !703, !90}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!704 = !{!705, !706, !707, !708}
!705 = !DILocalVariable(name: "p", arg: 1, scope: !700, file: !697, line: 176, type: !88)
!706 = !DILocalVariable(name: "pn", arg: 2, scope: !700, file: !697, line: 176, type: !703)
!707 = !DILocalVariable(name: "s", arg: 3, scope: !700, file: !697, line: 176, type: !90)
!708 = !DILocalVariable(name: "n", scope: !700, file: !697, line: 178, type: !90)
!709 = !{!710}
!710 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !712, file: !697, line: 228, baseType: !62, size: 32, elements: !709)
!712 = distinct !DISubprogram(name: "xpalloc", scope: !697, file: !697, line: 223, type: !713, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !719)
!713 = !DISubroutineType(types: !714)
!714 = !{!88, !88, !715, !716, !718, !716}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !717, line: 130, baseType: !718)
!717 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !91, line: 35, baseType: !170)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728}
!720 = !DILocalVariable(name: "pa", arg: 1, scope: !712, file: !697, line: 223, type: !88)
!721 = !DILocalVariable(name: "pn", arg: 2, scope: !712, file: !697, line: 223, type: !715)
!722 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !712, file: !697, line: 223, type: !716)
!723 = !DILocalVariable(name: "n_max", arg: 4, scope: !712, file: !697, line: 223, type: !718)
!724 = !DILocalVariable(name: "s", arg: 5, scope: !712, file: !697, line: 223, type: !716)
!725 = !DILocalVariable(name: "n0", scope: !712, file: !697, line: 230, type: !716)
!726 = !DILocalVariable(name: "n", scope: !712, file: !697, line: 237, type: !716)
!727 = !DILocalVariable(name: "nbytes", scope: !712, file: !697, line: 248, type: !716)
!728 = !DILocalVariable(name: "adjusted_nbytes", scope: !712, file: !697, line: 252, type: !716)
!729 = !{!87, !88, !129, !170, !92}
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !659, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !731, splitDebugInlining: false, nameTableKind: None)
!731 = !{!657, !660, !662}
!732 = distinct !DICompileUnit(language: DW_LANG_C11, file: !733, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !737, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !694, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !739, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !694, splitDebugInlining: false, nameTableKind: None)
!739 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!740 = distinct !DICompileUnit(language: DW_LANG_C11, file: !741, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !742, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!742 = !{!129, !92, !88}
!743 = distinct !DICompileUnit(language: DW_LANG_C11, file: !684, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !744, splitDebugInlining: false, nameTableKind: None)
!744 = !{!682, !685}
!745 = distinct !DICompileUnit(language: DW_LANG_C11, file: !746, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!747 = distinct !DICompileUnit(language: DW_LANG_C11, file: !748, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !694, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!749 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!750 = !{i32 7, !"Dwarf Version", i32 5}
!751 = !{i32 2, !"Debug Info Version", i32 3}
!752 = !{i32 1, !"wchar_size", i32 4}
!753 = !{i32 8, !"PIC Level", i32 2}
!754 = !{i32 7, !"PIE Level", i32 2}
!755 = !{i32 7, !"uwtable", i32 2}
!756 = !{i32 7, !"frame-pointer", i32 1}
!757 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 56, type: !758, scopeLine: 57, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !67}
!760 = !{!761}
!761 = !DILocalVariable(name: "status", arg: 1, scope: !757, file: !2, line: 56, type: !67)
!762 = !DILocation(line: 0, scope: !757)
!763 = !DILocation(line: 58, column: 14, scope: !764)
!764 = distinct !DILexicalBlock(scope: !757, file: !2, line: 58, column: 7)
!765 = !DILocation(line: 58, column: 7, scope: !757)
!766 = !DILocation(line: 59, column: 5, scope: !767)
!767 = distinct !DILexicalBlock(scope: !764, file: !2, line: 59, column: 5)
!768 = !{!769, !769, i64 0}
!769 = !{!"any pointer", !770, i64 0}
!770 = !{!"omnipotent char", !771, i64 0}
!771 = !{!"Simple C/C++ TBAA"}
!772 = !DILocation(line: 62, column: 7, scope: !773)
!773 = distinct !DILexicalBlock(scope: !764, file: !2, line: 61, column: 5)
!774 = !DILocation(line: 69, column: 7, scope: !773)
!775 = !DILocation(line: 73, column: 7, scope: !773)
!776 = !DILocation(line: 74, column: 7, scope: !773)
!777 = !DILocation(line: 75, column: 7, scope: !773)
!778 = !DILocalVariable(name: "program", arg: 1, scope: !779, file: !66, line: 836, type: !93)
!779 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !66, file: !66, line: 836, type: !780, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !782)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !93}
!782 = !{!778, !783, !790, !791, !793, !794}
!783 = !DILocalVariable(name: "infomap", scope: !779, file: !66, line: 838, type: !784)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 896, elements: !234)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !779, file: !66, line: 838, size: 128, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !786, file: !66, line: 838, baseType: !93, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !786, file: !66, line: 838, baseType: !93, size: 64, offset: 64)
!790 = !DILocalVariable(name: "node", scope: !779, file: !66, line: 848, type: !93)
!791 = !DILocalVariable(name: "map_prog", scope: !779, file: !66, line: 849, type: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!793 = !DILocalVariable(name: "lc_messages", scope: !779, file: !66, line: 861, type: !93)
!794 = !DILocalVariable(name: "url_program", scope: !779, file: !66, line: 874, type: !93)
!795 = !DILocation(line: 0, scope: !779, inlinedAt: !796)
!796 = distinct !DILocation(line: 76, column: 7, scope: !773)
!797 = !DILocation(line: 857, column: 3, scope: !779, inlinedAt: !796)
!798 = !DILocation(line: 861, column: 29, scope: !779, inlinedAt: !796)
!799 = !DILocation(line: 862, column: 7, scope: !800, inlinedAt: !796)
!800 = distinct !DILexicalBlock(scope: !779, file: !66, line: 862, column: 7)
!801 = !DILocation(line: 862, column: 19, scope: !800, inlinedAt: !796)
!802 = !DILocation(line: 862, column: 22, scope: !800, inlinedAt: !796)
!803 = !DILocation(line: 862, column: 7, scope: !779, inlinedAt: !796)
!804 = !DILocation(line: 868, column: 7, scope: !805, inlinedAt: !796)
!805 = distinct !DILexicalBlock(scope: !800, file: !66, line: 863, column: 5)
!806 = !DILocation(line: 870, column: 5, scope: !805, inlinedAt: !796)
!807 = !DILocation(line: 875, column: 3, scope: !779, inlinedAt: !796)
!808 = !DILocation(line: 877, column: 3, scope: !779, inlinedAt: !796)
!809 = !DILocation(line: 78, column: 3, scope: !757)
!810 = !DISubprogram(name: "dcgettext", scope: !811, file: !811, line: 51, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!811 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!812 = !DISubroutineType(types: !813)
!813 = !{!87, !93, !93, !67}
!814 = !{}
!815 = !DISubprogram(name: "__fprintf_chk", scope: !816, file: !816, line: 93, type: !817, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!816 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!817 = !DISubroutineType(types: !818)
!818 = !{!67, !819, !67, !820, null}
!819 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !142)
!820 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !93)
!821 = !DISubprogram(name: "__printf_chk", scope: !816, file: !816, line: 95, type: !822, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!822 = !DISubroutineType(types: !823)
!823 = !{!67, !67, !820, null}
!824 = !DILocation(line: 0, scope: !119)
!825 = !DILocation(line: 581, column: 7, scope: !127)
!826 = !{!827, !827, i64 0}
!827 = !{!"int", !770, i64 0}
!828 = !DILocation(line: 581, column: 19, scope: !127)
!829 = !DILocation(line: 581, column: 7, scope: !119)
!830 = !DILocation(line: 585, column: 26, scope: !126)
!831 = !DILocation(line: 0, scope: !126)
!832 = !DILocation(line: 586, column: 23, scope: !126)
!833 = !DILocation(line: 586, column: 28, scope: !126)
!834 = !DILocation(line: 586, column: 32, scope: !126)
!835 = !{!770, !770, i64 0}
!836 = !DILocation(line: 586, column: 38, scope: !126)
!837 = !DILocalVariable(name: "__s1", arg: 1, scope: !838, file: !839, line: 1359, type: !93)
!838 = distinct !DISubprogram(name: "streq", scope: !839, file: !839, line: 1359, type: !840, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !842)
!839 = !DIFile(filename: "./lib/string.h", directory: "/src")
!840 = !DISubroutineType(types: !841)
!841 = !{!129, !93, !93}
!842 = !{!837, !843}
!843 = !DILocalVariable(name: "__s2", arg: 2, scope: !838, file: !839, line: 1359, type: !93)
!844 = !DILocation(line: 0, scope: !838, inlinedAt: !845)
!845 = distinct !DILocation(line: 586, column: 41, scope: !126)
!846 = !DILocation(line: 1361, column: 11, scope: !838, inlinedAt: !845)
!847 = !DILocation(line: 1361, column: 10, scope: !838, inlinedAt: !845)
!848 = !DILocation(line: 586, column: 19, scope: !126)
!849 = !DILocation(line: 587, column: 5, scope: !126)
!850 = !DILocation(line: 588, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !119, file: !66, line: 588, column: 7)
!852 = !DILocation(line: 588, column: 7, scope: !119)
!853 = !DILocation(line: 590, column: 7, scope: !854)
!854 = distinct !DILexicalBlock(scope: !851, file: !66, line: 589, column: 5)
!855 = !DILocation(line: 591, column: 7, scope: !854)
!856 = !DILocation(line: 595, column: 37, scope: !119)
!857 = !DILocation(line: 595, column: 35, scope: !119)
!858 = !DILocation(line: 596, column: 29, scope: !119)
!859 = !DILocation(line: 597, column: 8, scope: !135)
!860 = !DILocation(line: 597, column: 7, scope: !119)
!861 = !DILocation(line: 604, column: 24, scope: !134)
!862 = !DILocation(line: 604, column: 12, scope: !135)
!863 = !DILocation(line: 0, scope: !133)
!864 = !DILocation(line: 610, column: 16, scope: !133)
!865 = !DILocation(line: 610, column: 7, scope: !133)
!866 = !DILocation(line: 611, column: 21, scope: !133)
!867 = !{!868, !868, i64 0}
!868 = !{!"short", !770, i64 0}
!869 = !DILocation(line: 611, column: 19, scope: !133)
!870 = !DILocation(line: 611, column: 16, scope: !133)
!871 = !DILocation(line: 610, column: 30, scope: !133)
!872 = distinct !{!872, !865, !866, !873}
!873 = !{!"llvm.loop.mustprogress"}
!874 = !DILocation(line: 612, column: 18, scope: !875)
!875 = distinct !DILexicalBlock(scope: !133, file: !66, line: 612, column: 11)
!876 = !DILocation(line: 612, column: 11, scope: !133)
!877 = !DILocation(line: 620, column: 23, scope: !119)
!878 = !DILocation(line: 625, column: 39, scope: !119)
!879 = !DILocation(line: 626, column: 3, scope: !119)
!880 = !DILocation(line: 626, column: 10, scope: !119)
!881 = !DILocation(line: 626, column: 21, scope: !119)
!882 = !DILocation(line: 628, column: 44, scope: !883)
!883 = distinct !DILexicalBlock(scope: !884, file: !66, line: 628, column: 11)
!884 = distinct !DILexicalBlock(scope: !119, file: !66, line: 627, column: 5)
!885 = !DILocation(line: 628, column: 32, scope: !883)
!886 = !DILocation(line: 628, column: 49, scope: !883)
!887 = !DILocation(line: 628, column: 11, scope: !884)
!888 = !DILocation(line: 630, column: 11, scope: !889)
!889 = distinct !DILexicalBlock(scope: !884, file: !66, line: 630, column: 11)
!890 = !DILocation(line: 630, column: 11, scope: !884)
!891 = !DILocation(line: 632, column: 26, scope: !892)
!892 = distinct !DILexicalBlock(scope: !893, file: !66, line: 632, column: 15)
!893 = distinct !DILexicalBlock(scope: !889, file: !66, line: 631, column: 9)
!894 = !DILocation(line: 632, column: 34, scope: !892)
!895 = !DILocation(line: 632, column: 37, scope: !892)
!896 = !DILocation(line: 632, column: 15, scope: !893)
!897 = !DILocation(line: 640, column: 16, scope: !884)
!898 = distinct !{!898, !879, !899, !873}
!899 = !DILocation(line: 641, column: 5, scope: !119)
!900 = !DILocation(line: 644, column: 3, scope: !119)
!901 = !DILocation(line: 0, scope: !838, inlinedAt: !902)
!902 = distinct !DILocation(line: 648, column: 31, scope: !119)
!903 = !DILocation(line: 0, scope: !838, inlinedAt: !904)
!904 = distinct !DILocation(line: 649, column: 31, scope: !119)
!905 = !DILocation(line: 0, scope: !838, inlinedAt: !906)
!906 = distinct !DILocation(line: 650, column: 31, scope: !119)
!907 = !DILocation(line: 0, scope: !838, inlinedAt: !908)
!908 = distinct !DILocation(line: 651, column: 31, scope: !119)
!909 = !DILocation(line: 0, scope: !838, inlinedAt: !910)
!910 = distinct !DILocation(line: 652, column: 31, scope: !119)
!911 = !DILocation(line: 0, scope: !838, inlinedAt: !912)
!912 = distinct !DILocation(line: 653, column: 31, scope: !119)
!913 = !DILocation(line: 0, scope: !838, inlinedAt: !914)
!914 = distinct !DILocation(line: 654, column: 31, scope: !119)
!915 = !DILocation(line: 0, scope: !838, inlinedAt: !916)
!916 = distinct !DILocation(line: 655, column: 31, scope: !119)
!917 = !DILocation(line: 0, scope: !838, inlinedAt: !918)
!918 = distinct !DILocation(line: 656, column: 31, scope: !119)
!919 = !DILocation(line: 0, scope: !838, inlinedAt: !920)
!920 = distinct !DILocation(line: 657, column: 31, scope: !119)
!921 = !DILocation(line: 663, column: 7, scope: !922)
!922 = distinct !DILexicalBlock(scope: !119, file: !66, line: 663, column: 7)
!923 = !DILocation(line: 664, column: 7, scope: !922)
!924 = !DILocation(line: 664, column: 10, scope: !922)
!925 = !DILocation(line: 663, column: 7, scope: !119)
!926 = !DILocation(line: 669, column: 7, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !66, line: 665, column: 5)
!928 = !DILocation(line: 671, column: 5, scope: !927)
!929 = !DILocation(line: 676, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !922, file: !66, line: 673, column: 5)
!931 = !DILocation(line: 679, column: 3, scope: !119)
!932 = !DILocation(line: 683, column: 3, scope: !119)
!933 = !DILocation(line: 686, column: 3, scope: !119)
!934 = !DILocation(line: 688, column: 3, scope: !119)
!935 = !DILocation(line: 691, column: 3, scope: !119)
!936 = !DILocation(line: 695, column: 3, scope: !119)
!937 = !DILocation(line: 696, column: 1, scope: !119)
!938 = !DISubprogram(name: "setlocale", scope: !939, file: !939, line: 122, type: !940, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!939 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!940 = !DISubroutineType(types: !941)
!941 = !{!87, !67, !93}
!942 = !DISubprogram(name: "strncmp", scope: !943, file: !943, line: 159, type: !944, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!943 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!944 = !DISubroutineType(types: !945)
!945 = !{!67, !93, !93, !90}
!946 = !DISubprogram(name: "fputs_unlocked", scope: !361, file: !361, line: 691, type: !947, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!947 = !DISubroutineType(types: !948)
!948 = !{!67, !820, !819}
!949 = !DISubprogram(name: "exit", scope: !950, file: !950, line: 624, type: !758, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !814)
!950 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!951 = !DISubprogram(name: "getenv", scope: !950, file: !950, line: 641, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!952 = !DISubroutineType(types: !953)
!953 = !{!87, !93}
!954 = !DISubprogram(name: "strcmp", scope: !943, file: !943, line: 156, type: !955, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!955 = !DISubroutineType(types: !956)
!956 = !{!67, !93, !93}
!957 = !DISubprogram(name: "strspn", scope: !943, file: !943, line: 297, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!958 = !DISubroutineType(types: !959)
!959 = !{!92, !93, !93}
!960 = !DISubprogram(name: "strchr", scope: !943, file: !943, line: 246, type: !961, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!961 = !DISubroutineType(types: !962)
!962 = !{!87, !93, !67}
!963 = !DISubprogram(name: "__ctype_b_loc", scope: !72, file: !72, line: 79, type: !964, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!964 = !DISubroutineType(types: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!969 = !DISubprogram(name: "strcspn", scope: !943, file: !943, line: 293, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!970 = !DISubprogram(name: "fwrite_unlocked", scope: !361, file: !361, line: 704, type: !971, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!971 = !DISubroutineType(types: !972)
!972 = !{!90, !973, !90, !90, !819}
!973 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!976 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 82, type: !977, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !980)
!977 = !DISubroutineType(types: !978)
!978 = !{!67, !67, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!980 = !{!981, !982, !983, !984, !985, !986, !990, !992, !994, !997, !999, !1002}
!981 = !DILocalVariable(name: "argc", arg: 1, scope: !976, file: !2, line: 82, type: !67)
!982 = !DILocalVariable(name: "argv", arg: 2, scope: !976, file: !2, line: 82, type: !979)
!983 = !DILocalVariable(name: "opt_nul_terminate_output", scope: !976, file: !2, line: 84, type: !129)
!984 = !DILocalVariable(name: "optc", scope: !976, file: !2, line: 95, type: !67)
!985 = !DILocalVariable(name: "ok", scope: !976, file: !2, line: 110, type: !129)
!986 = !DILocalVariable(name: "env", scope: !987, file: !2, line: 113, type: !979)
!987 = distinct !DILexicalBlock(scope: !988, file: !2, line: 113, column: 7)
!988 = distinct !DILexicalBlock(scope: !989, file: !2, line: 112, column: 5)
!989 = distinct !DILexicalBlock(scope: !976, file: !2, line: 111, column: 7)
!990 = !DILocalVariable(name: "matches", scope: !991, file: !2, line: 119, type: !67)
!991 = distinct !DILexicalBlock(scope: !989, file: !2, line: 118, column: 5)
!992 = !DILocalVariable(name: "i", scope: !993, file: !2, line: 121, type: !67)
!993 = distinct !DILexicalBlock(scope: !991, file: !2, line: 121, column: 7)
!994 = !DILocalVariable(name: "matched", scope: !995, file: !2, line: 123, type: !129)
!995 = distinct !DILexicalBlock(scope: !996, file: !2, line: 122, column: 9)
!996 = distinct !DILexicalBlock(scope: !993, file: !2, line: 121, column: 7)
!997 = !DILocalVariable(name: "env", scope: !998, file: !2, line: 129, type: !979)
!998 = distinct !DILexicalBlock(scope: !995, file: !2, line: 129, column: 11)
!999 = !DILocalVariable(name: "ep", scope: !1000, file: !2, line: 131, type: !93)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !2, line: 130, column: 13)
!1001 = distinct !DILexicalBlock(scope: !998, file: !2, line: 129, column: 11)
!1002 = !DILocalVariable(name: "ap", scope: !1000, file: !2, line: 132, type: !93)
!1003 = !DILocation(line: 0, scope: !976)
!1004 = !DILocation(line: 87, column: 21, scope: !976)
!1005 = !DILocation(line: 87, column: 3, scope: !976)
!1006 = !DILocation(line: 88, column: 3, scope: !976)
!1007 = !DILocation(line: 89, column: 3, scope: !976)
!1008 = !DILocation(line: 90, column: 3, scope: !976)
!1009 = !DILocalVariable(name: "status", arg: 1, scope: !1010, file: !66, line: 102, type: !67)
!1010 = distinct !DISubprogram(name: "initialize_exit_failure", scope: !66, file: !66, line: 102, type: !758, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !1011)
!1011 = !{!1009}
!1012 = !DILocation(line: 0, scope: !1010, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 92, column: 3, scope: !976)
!1014 = !DILocation(line: 105, column: 18, scope: !1015, inlinedAt: !1013)
!1015 = distinct !DILexicalBlock(scope: !1010, file: !66, line: 104, column: 7)
!1016 = !DILocation(line: 93, column: 3, scope: !976)
!1017 = !DILocation(line: 96, column: 18, scope: !976)
!1018 = !DILocation(line: 96, column: 3, scope: !976)
!1019 = distinct !{!1019, !1018, !1020, !873, !1021}
!1020 = !DILocation(line: 108, column: 5, scope: !976)
!1021 = !{!"llvm.loop.peeled.count", i32 1}
!1022 = !DILocation(line: 103, column: 9, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !2, line: 99, column: 9)
!1024 = distinct !DILexicalBlock(scope: !976, file: !2, line: 97, column: 5)
!1025 = !DILocation(line: 104, column: 9, scope: !1023)
!1026 = !DILocation(line: 106, column: 11, scope: !1023)
!1027 = !DILocation(line: 111, column: 7, scope: !989)
!1028 = !DILocation(line: 111, column: 14, scope: !989)
!1029 = !DILocation(line: 111, column: 7, scope: !976)
!1030 = !DILocation(line: 121, column: 7, scope: !993)
!1031 = !DILocation(line: 113, column: 25, scope: !987)
!1032 = !DILocation(line: 0, scope: !987)
!1033 = !DILocation(line: 113, column: 34, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !987, file: !2, line: 113, column: 7)
!1035 = !DILocation(line: 113, column: 39, scope: !1034)
!1036 = !DILocation(line: 113, column: 7, scope: !987)
!1037 = !DILocation(line: 114, column: 9, scope: !1034)
!1038 = !DILocation(line: 113, column: 48, scope: !1034)
!1039 = distinct !{!1039, !1036, !1040, !873}
!1040 = !DILocation(line: 114, column: 9, scope: !987)
!1041 = !DILocation(line: 148, column: 31, scope: !991)
!1042 = !DILocation(line: 148, column: 29, scope: !991)
!1043 = !DILocation(line: 148, column: 21, scope: !991)
!1044 = !DILocation(line: 151, column: 10, scope: !976)
!1045 = !DILocation(line: 0, scope: !993)
!1046 = !DILocation(line: 0, scope: !991)
!1047 = !DILocation(line: 0, scope: !995)
!1048 = !DILocation(line: 126, column: 23, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !995, file: !2, line: 126, column: 15)
!1050 = !DILocation(line: 126, column: 15, scope: !1049)
!1051 = !DILocation(line: 126, column: 15, scope: !995)
!1052 = !DILocation(line: 129, column: 29, scope: !998)
!1053 = !DILocation(line: 0, scope: !998)
!1054 = !DILocation(line: 129, column: 38, scope: !1001)
!1055 = !DILocation(line: 129, column: 11, scope: !998)
!1056 = !DILocation(line: 145, column: 22, scope: !995)
!1057 = !DILocation(line: 145, column: 19, scope: !995)
!1058 = !DILocation(line: 146, column: 9, scope: !996)
!1059 = !DILocation(line: 0, scope: !1000)
!1060 = !DILocation(line: 133, column: 22, scope: !1000)
!1061 = !DILocation(line: 133, column: 26, scope: !1000)
!1062 = !DILocation(line: 133, column: 34, scope: !1000)
!1063 = !DILocation(line: 132, column: 32, scope: !1000)
!1064 = !DILocation(line: 133, column: 37, scope: !1000)
!1065 = !DILocation(line: 133, column: 41, scope: !1000)
!1066 = !DILocation(line: 133, column: 49, scope: !1000)
!1067 = !DILocation(line: 133, column: 55, scope: !1000)
!1068 = !DILocation(line: 133, column: 64, scope: !1000)
!1069 = !DILocation(line: 133, column: 58, scope: !1000)
!1070 = !DILocation(line: 133, column: 15, scope: !1000)
!1071 = !DILocation(line: 135, column: 23, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1073, file: !2, line: 135, column: 23)
!1073 = distinct !DILexicalBlock(scope: !1000, file: !2, line: 134, column: 17)
!1074 = !DILocation(line: 135, column: 34, scope: !1072)
!1075 = !DILocation(line: 135, column: 37, scope: !1072)
!1076 = !DILocation(line: 135, column: 41, scope: !1072)
!1077 = !DILocation(line: 135, column: 23, scope: !1073)
!1078 = !DILocation(line: 137, column: 23, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1072, file: !2, line: 136, column: 21)
!1080 = !DILocation(line: 140, column: 23, scope: !1079)
!1081 = distinct !{!1081, !1070, !1082, !873}
!1082 = !DILocation(line: 142, column: 17, scope: !1000)
!1083 = !DILocation(line: 129, column: 44, scope: !1001)
!1084 = distinct !{!1084, !1055, !1085, !873}
!1085 = !DILocation(line: 143, column: 13, scope: !998)
!1086 = !DILocation(line: 121, column: 38, scope: !996)
!1087 = !DILocation(line: 121, column: 30, scope: !996)
!1088 = distinct !{!1088, !1030, !1089, !873}
!1089 = !DILocation(line: 146, column: 9, scope: !993)
!1090 = !DILocation(line: 152, column: 1, scope: !976)
!1091 = !DISubprogram(name: "bindtextdomain", scope: !811, file: !811, line: 86, type: !1092, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!87, !93, !93}
!1094 = !DISubprogram(name: "textdomain", scope: !811, file: !811, line: 82, type: !952, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1095 = !DISubprogram(name: "atexit", scope: !950, file: !950, line: 602, type: !1096, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!67, !401}
!1098 = !DISubprogram(name: "getopt_long", scope: !318, file: !318, line: 66, type: !1099, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!67, !67, !1101, !93, !1103, !323}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!1104 = distinct !DISubprogram(name: "close_stdout_set_file_name", scope: !335, file: !335, line: 50, type: !780, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1105)
!1105 = !{!1106}
!1106 = !DILocalVariable(name: "file", arg: 1, scope: !1104, file: !335, line: 50, type: !93)
!1107 = !DILocation(line: 0, scope: !1104)
!1108 = !DILocation(line: 52, column: 13, scope: !1104)
!1109 = !DILocation(line: 53, column: 1, scope: !1104)
!1110 = distinct !DISubprogram(name: "close_stdout_set_ignore_EPIPE", scope: !335, file: !335, line: 87, type: !1111, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1113)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !129}
!1113 = !{!1114}
!1114 = !DILocalVariable(name: "ignore", arg: 1, scope: !1110, file: !335, line: 87, type: !129)
!1115 = !DILocation(line: 0, scope: !1110)
!1116 = !DILocation(line: 89, column: 16, scope: !1110)
!1117 = !{!1118, !1118, i64 0}
!1118 = !{!"_Bool", !770, i64 0}
!1119 = !DILocation(line: 90, column: 1, scope: !1110)
!1120 = distinct !DISubprogram(name: "close_stdout", scope: !335, file: !335, line: 116, type: !402, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !334, retainedNodes: !1121)
!1121 = !{!1122}
!1122 = !DILocalVariable(name: "write_error", scope: !1123, file: !335, line: 121, type: !93)
!1123 = distinct !DILexicalBlock(scope: !1124, file: !335, line: 120, column: 5)
!1124 = distinct !DILexicalBlock(scope: !1120, file: !335, line: 118, column: 7)
!1125 = !DILocation(line: 118, column: 21, scope: !1124)
!1126 = !DILocation(line: 118, column: 7, scope: !1124)
!1127 = !DILocation(line: 118, column: 29, scope: !1124)
!1128 = !DILocation(line: 119, column: 7, scope: !1124)
!1129 = !DILocation(line: 119, column: 12, scope: !1124)
!1130 = !{i8 0, i8 2}
!1131 = !DILocation(line: 119, column: 25, scope: !1124)
!1132 = !DILocation(line: 119, column: 28, scope: !1124)
!1133 = !DILocation(line: 119, column: 34, scope: !1124)
!1134 = !DILocation(line: 118, column: 7, scope: !1120)
!1135 = !DILocation(line: 121, column: 33, scope: !1123)
!1136 = !DILocation(line: 0, scope: !1123)
!1137 = !DILocation(line: 122, column: 11, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1123, file: !335, line: 122, column: 11)
!1139 = !DILocation(line: 0, scope: !1138)
!1140 = !DILocation(line: 122, column: 11, scope: !1123)
!1141 = !DILocation(line: 123, column: 9, scope: !1138)
!1142 = !DILocation(line: 126, column: 9, scope: !1138)
!1143 = !DILocation(line: 128, column: 14, scope: !1123)
!1144 = !DILocation(line: 128, column: 7, scope: !1123)
!1145 = !DILocation(line: 133, column: 42, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1120, file: !335, line: 133, column: 7)
!1147 = !DILocation(line: 133, column: 28, scope: !1146)
!1148 = !DILocation(line: 133, column: 50, scope: !1146)
!1149 = !DILocation(line: 133, column: 7, scope: !1120)
!1150 = !DILocation(line: 134, column: 12, scope: !1146)
!1151 = !DILocation(line: 134, column: 5, scope: !1146)
!1152 = !DILocation(line: 135, column: 1, scope: !1120)
!1153 = !DISubprogram(name: "__errno_location", scope: !1154, file: !1154, line: 37, type: !1155, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1154 = !DIFile(filename: "/usr/include/errno.h", directory: "", checksumkind: CSK_MD5, checksum: "01c14bf4ab600a3884f5da68eb763170")
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!323}
!1157 = !DISubprogram(name: "_exit", scope: !1158, file: !1158, line: 624, type: !758, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !814)
!1158 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
!1159 = distinct !DISubprogram(name: "verror", scope: !350, file: !350, line: 251, type: !1160, scopeLine: 253, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1162)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !67, !67, !93, !360}
!1162 = !{!1163, !1164, !1165, !1166}
!1163 = !DILocalVariable(name: "status", arg: 1, scope: !1159, file: !350, line: 251, type: !67)
!1164 = !DILocalVariable(name: "errnum", arg: 2, scope: !1159, file: !350, line: 251, type: !67)
!1165 = !DILocalVariable(name: "message", arg: 3, scope: !1159, file: !350, line: 251, type: !93)
!1166 = !DILocalVariable(name: "args", arg: 4, scope: !1159, file: !350, line: 251, type: !360)
!1167 = !DILocation(line: 0, scope: !1159)
!1168 = !DILocation(line: 251, column: 1, scope: !1159)
!1169 = !DILocation(line: 261, column: 3, scope: !1159)
!1170 = !DILocation(line: 265, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1159, file: !350, line: 265, column: 7)
!1172 = !DILocation(line: 265, column: 7, scope: !1159)
!1173 = !DILocation(line: 266, column: 5, scope: !1171)
!1174 = !DILocation(line: 272, column: 7, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1171, file: !350, line: 268, column: 5)
!1176 = !DILocation(line: 276, column: 3, scope: !1159)
!1177 = !{i64 0, i64 8, !768, i64 8, i64 8, !768, i64 16, i64 8, !768, i64 24, i64 4, !826, i64 28, i64 4, !826}
!1178 = !DILocation(line: 282, column: 1, scope: !1159)
!1179 = distinct !DISubprogram(name: "flush_stdout", scope: !350, file: !350, line: 163, type: !402, scopeLine: 164, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1180)
!1180 = !{!1181}
!1181 = !DILocalVariable(name: "stdout_fd", scope: !1179, file: !350, line: 166, type: !67)
!1182 = !DILocation(line: 0, scope: !1179)
!1183 = !DILocalVariable(name: "fd", arg: 1, scope: !1184, file: !350, line: 145, type: !67)
!1184 = distinct !DISubprogram(name: "is_open", scope: !350, file: !350, line: 145, type: !1185, scopeLine: 146, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1187)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!67, !67}
!1187 = !{!1183}
!1188 = !DILocation(line: 0, scope: !1184, inlinedAt: !1189)
!1189 = distinct !DILocation(line: 182, column: 25, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1179, file: !350, line: 182, column: 7)
!1191 = !DILocation(line: 157, column: 15, scope: !1184, inlinedAt: !1189)
!1192 = !DILocation(line: 157, column: 12, scope: !1184, inlinedAt: !1189)
!1193 = !DILocation(line: 182, column: 7, scope: !1179)
!1194 = !DILocation(line: 184, column: 5, scope: !1190)
!1195 = !DILocation(line: 185, column: 1, scope: !1179)
!1196 = distinct !DISubprogram(name: "error_tail", scope: !350, file: !350, line: 219, type: !1160, scopeLine: 221, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1197)
!1197 = !{!1198, !1199, !1200, !1201}
!1198 = !DILocalVariable(name: "status", arg: 1, scope: !1196, file: !350, line: 219, type: !67)
!1199 = !DILocalVariable(name: "errnum", arg: 2, scope: !1196, file: !350, line: 219, type: !67)
!1200 = !DILocalVariable(name: "message", arg: 3, scope: !1196, file: !350, line: 219, type: !93)
!1201 = !DILocalVariable(name: "args", arg: 4, scope: !1196, file: !350, line: 219, type: !360)
!1202 = !DILocation(line: 0, scope: !1196)
!1203 = !DILocation(line: 219, column: 1, scope: !1196)
!1204 = !DILocation(line: 229, column: 13, scope: !1196)
!1205 = !DILocation(line: 135, column: 10, scope: !1206, inlinedAt: !1248)
!1206 = distinct !DISubprogram(name: "vfprintf", scope: !816, file: !816, line: 132, type: !1207, scopeLine: 134, flags: DIFlagArtificial | DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !1244)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!67, !1209, !820, !362}
!1209 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !144, line: 7, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !146, line: 49, size: 1728, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1212, file: !146, line: 51, baseType: !67, size: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1212, file: !146, line: 54, baseType: !87, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1212, file: !146, line: 55, baseType: !87, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1212, file: !146, line: 56, baseType: !87, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1212, file: !146, line: 57, baseType: !87, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1212, file: !146, line: 58, baseType: !87, size: 64, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1212, file: !146, line: 59, baseType: !87, size: 64, offset: 384)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1212, file: !146, line: 60, baseType: !87, size: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1212, file: !146, line: 61, baseType: !87, size: 64, offset: 512)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1212, file: !146, line: 64, baseType: !87, size: 64, offset: 576)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1212, file: !146, line: 65, baseType: !87, size: 64, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1212, file: !146, line: 66, baseType: !87, size: 64, offset: 704)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1212, file: !146, line: 68, baseType: !161, size: 64, offset: 768)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1212, file: !146, line: 70, baseType: !1228, size: 64, offset: 832)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1212, file: !146, line: 72, baseType: !67, size: 32, offset: 896)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1212, file: !146, line: 73, baseType: !67, size: 32, offset: 928)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1212, file: !146, line: 74, baseType: !168, size: 64, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1212, file: !146, line: 77, baseType: !89, size: 16, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1212, file: !146, line: 78, baseType: !173, size: 8, offset: 1040)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1212, file: !146, line: 79, baseType: !39, size: 8, offset: 1048)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1212, file: !146, line: 81, baseType: !176, size: 64, offset: 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1212, file: !146, line: 89, baseType: !179, size: 64, offset: 1152)
