; ModuleID = 'src/printf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.12 }
%union.anon.12 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [49 x i8] c"Usage: %s FORMAT [ARGUMENT]...\0A  or:  %s OPTION\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [73 x i8] c"Print ARGUMENT(s) according to FORMAT, or execute according to OPTION:\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [7 x i8] c"printf\00", align 1, !dbg !17

!117 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!118 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !124, !126, !128, !133, !135, !140, !142, !147, !77, !149, !232, !237, !239, !244, !249, !254, !256, !258, !260, !262, !264, !266, !268, !273, !275, !277, !279, !281, !286, !291, !296, !301, !303, !305, !307, !309, !311, !316, !318, !320, !325, !330, !335, !340, !342, !344, !346, !348, !351, !356, !358, !363, !365, !367, !372, !374}
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 709, type: !19, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 712, type: !64, isLocal: true, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !130, isLocal: true, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 14)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(scope: null, file: !2, line: 714, type: !74, isLocal: true, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(scope: null, file: !2, line: 722, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 3)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(scope: null, file: !2, line: 730, type: !74, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(scope: null, file: !2, line: 747, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 53)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "exit_status", scope: !79, file: !2, line: 36, type: !114, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !151, file: !152, line: 575, type: !114, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "oputs_", scope: !152, file: !152, line: 573, type: !153, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !155)
!152 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!153 = !DISubroutineType(cc: DW_CC_nocall, types: !154)
!154 = !{null, !119, !119}
!155 = !{!156, !157, !158, !161, !162, !163, !164, !168, !169, !170, !171, !173, !226, !227, !228, !230, !231}
!156 = !DILocalVariable(name: "program", arg: 1, scope: !151, file: !152, line: 573, type: !119)
!157 = !DILocalVariable(name: "option", arg: 2, scope: !151, file: !152, line: 573, type: !119)
!158 = !DILocalVariable(name: "term", scope: !159, file: !152, line: 585, type: !119)
!159 = distinct !DILexicalBlock(scope: !160, file: !152, line: 582, column: 5)
!160 = distinct !DILexicalBlock(scope: !151, file: !152, line: 581, column: 7)
!161 = !DILocalVariable(name: "double_space", scope: !151, file: !152, line: 594, type: !122)
!162 = !DILocalVariable(name: "first_word", scope: !151, file: !152, line: 595, type: !119)
!163 = !DILocalVariable(name: "option_text", scope: !151, file: !152, line: 596, type: !119)
!164 = !DILocalVariable(name: "s", scope: !165, file: !152, line: 608, type: !119)
!165 = distinct !DILexicalBlock(scope: !166, file: !152, line: 605, column: 5)
!166 = distinct !DILexicalBlock(scope: !167, file: !152, line: 604, column: 12)
!167 = distinct !DILexicalBlock(scope: !151, file: !152, line: 597, column: 7)
!168 = !DILocalVariable(name: "spaces", scope: !165, file: !152, line: 609, type: !116)
!169 = !DILocalVariable(name: "anchor_len", scope: !151, file: !152, line: 620, type: !116)
!170 = !DILocalVariable(name: "desc_text", scope: !151, file: !152, line: 625, type: !119)
!171 = !DILocalVariable(name: "__ptr", scope: !172, file: !152, line: 644, type: !119)
!172 = distinct !DILexicalBlock(scope: !151, file: !152, line: 644, column: 3)
!173 = !DILocalVariable(name: "__stream", scope: !172, file: !152, line: 644, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !177)
!176 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !179)
!178 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!179 = !{!180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !195, !197, !198, !199, !203, !204, !206, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !177, file: !178, line: 51, baseType: !114, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !177, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !177, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !177, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !177, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !177, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !177, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !177, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !177, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !177, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !177, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !177, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !177, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !178, line: 36, flags: DIFlagFwdDecl)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !177, file: !178, line: 70, baseType: !196, size: 64, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !177, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !177, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !177, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !201, line: 152, baseType: !202)
!201 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!202 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !177, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !177, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !177, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !177, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !178, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !177, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !201, line: 153, baseType: !202)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !177, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !178, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !177, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !178, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !177, file: !178, line: 93, baseType: !196, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !177, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !177, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !177, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !177, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !DILocalVariable(name: "__cnt", scope: !172, file: !152, line: 644, type: !116)
!227 = !DILocalVariable(name: "url_program", scope: !151, file: !152, line: 648, type: !119)
!228 = !DILocalVariable(name: "__ptr", scope: !229, file: !152, line: 686, type: !119)
!229 = distinct !DILexicalBlock(scope: !151, file: !152, line: 686, column: 3)
!230 = !DILocalVariable(name: "__stream", scope: !229, file: !152, line: 686, type: !174)
!231 = !DILocalVariable(name: "__cnt", scope: !229, file: !152, line: 686, type: !116)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(scope: null, file: !152, line: 585, type: !234, isLocal: true, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 5)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(scope: null, file: !152, line: 586, type: !234, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(scope: null, file: !152, line: 595, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 4)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(scope: null, file: !152, line: 620, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 6)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !152, line: 648, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 2)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !152, line: 648, type: !234, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !152, line: 649, type: !241, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !152, line: 649, type: !137, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !152, line: 650, type: !234, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(scope: null, file: !152, line: 651, type: !246, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(scope: null, file: !152, line: 651, type: !246, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !152, line: 652, type: !19, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !152, line: 653, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !152, line: 654, type: !64, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !152, line: 655, type: !64, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !152, line: 656, type: !64, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !152, line: 657, type: !64, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !152, line: 669, type: !283, isLocal: true, isDefinition: true)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 17)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(scope: null, file: !152, line: 669, type: !288, isLocal: true, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 40)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !152, line: 676, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 15)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !152, line: 676, type: !298, isLocal: true, isDefinition: true)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 61)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !152, line: 679, type: !137, isLocal: true, isDefinition: true)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(scope: null, file: !152, line: 683, type: !234, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(scope: null, file: !152, line: 688, type: !234, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !152, line: 691, type: !270, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !152, line: 839, type: !74, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !152, line: 840, type: !313, isLocal: true, isDefinition: true)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 22)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !152, line: 841, type: !293, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !152, line: 862, type: !241, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !152, line: 868, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 71)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !152, line: 875, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 27)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !152, line: 877, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 51)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !152, line: 877, type: !337, isLocal: true, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 12)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !2, line: 607, type: !69, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(scope: null, file: !2, line: 638, type: !313, isLocal: true, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(scope: null, file: !2, line: 662, type: !3, isLocal: true, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !14, isLocal: true, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "cfcc_msg", scope: !79, file: !2, line: 43, type: !350, isLocal: true, isDefinition: true)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !2, line: 109, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 29)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !137, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 35)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !251, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 326, type: !251, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(scope: null, file: !2, line: 232, type: !369, isLocal: true, isDefinition: true)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 37)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 246, type: !337, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 41)
!379 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !382, line: 3, type: !293, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "Version", scope: !385, file: !382, line: 3, type: !119, isLocal: false, isDefinition: true)
!385 = distinct !DICompileUnit(language: DW_LANG_C11, file: !382, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !386, splitDebugInlining: false, nameTableKind: None)
!386 = !{!380, !383}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "file_name", scope: !389, file: !390, line: 45, type: !119, isLocal: true, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !390, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!391 = !{!392, !394, !396, !398, !387, !400}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !19, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !390, line: 121, type: !337, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !390, line: 123, type: !19, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !390, line: 126, type: !137, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !389, file: !390, line: 55, type: !122, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !404, file: !405, line: 66, type: !456, isLocal: false, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C11, file: !405, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!406 = !{!112, !121}
!407 = !{!408, !410, !435, !437, !439, !441, !402, !443, !445, !447, !449, !454}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !405, line: 272, type: !234, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "old_file_name", scope: !412, file: !405, line: 304, type: !119, isLocal: true, isDefinition: true)
!412 = distinct !DISubprogram(name: "verror_at_line", scope: !405, file: !405, line: 298, type: !413, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !404, retainedNodes: !428)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !114, !114, !119, !83, !119, !415}
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !416, line: 52, baseType: !417)
!416 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !418, line: 14, baseType: !419)
!418 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !420, baseType: !421)
!420 = !DIFile(filename: "lib/error.c", directory: "/src")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !422)
!422 = !{!423, !424, !425, !426, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !421, file: !420, baseType: !112, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !421, file: !420, baseType: !112, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !421, file: !420, baseType: !112, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !421, file: !420, baseType: !114, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !421, file: !420, baseType: !114, size: 32, offset: 224)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DILocalVariable(name: "status", arg: 1, scope: !412, file: !405, line: 298, type: !114)
!430 = !DILocalVariable(name: "errnum", arg: 2, scope: !412, file: !405, line: 298, type: !114)
!431 = !DILocalVariable(name: "file_name", arg: 3, scope: !412, file: !405, line: 298, type: !119)
!432 = !DILocalVariable(name: "line_number", arg: 4, scope: !412, file: !405, line: 298, type: !83)
!433 = !DILocalVariable(name: "message", arg: 5, scope: !412, file: !405, line: 298, type: !119)
!434 = !DILocalVariable(name: "args", arg: 6, scope: !412, file: !405, line: 298, type: !415)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "old_line_number", scope: !412, file: !405, line: 305, type: !83, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !405, line: 338, type: !241, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !270, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !405, line: 346, type: !251, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "error_message_count", scope: !404, file: !405, line: 69, type: !83, isLocal: false, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !404, file: !405, line: 295, type: !114, isLocal: false, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !19, isLocal: true, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(scope: null, file: !405, line: 208, type: !451, isLocal: true, isDefinition: true)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 21)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !405, line: 214, type: !234, isLocal: true, isDefinition: true)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{null}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "program_name", scope: !461, file: !462, line: 31, type: !119, isLocal: false, isDefinition: true)
!461 = distinct !DICompileUnit(language: DW_LANG_C11, file: !462, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !463, globals: !464, splitDebugInlining: false, nameTableKind: None)
!462 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!463 = !{!113}
!464 = !{!459, !465, !467}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !462, line: 46, type: !270, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(scope: null, file: !462, line: 49, type: !241, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "utf07FF", scope: !471, file: !472, line: 46, type: !499, isLocal: true, isDefinition: true)
!471 = distinct !DISubprogram(name: "proper_name_lite", scope: !472, file: !472, line: 38, type: !473, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !475, retainedNodes: !477)
!472 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!473 = !DISubroutineType(types: !474)
!474 = !{!119, !119, !119}
!475 = distinct !DICompileUnit(language: DW_LANG_C11, file: !472, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !476, splitDebugInlining: false, nameTableKind: None)
!476 = !{!469}
!477 = !{!478, !479, !480, !481, !486}
!478 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !471, file: !472, line: 38, type: !119)
!479 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !471, file: !472, line: 38, type: !119)
!480 = !DILocalVariable(name: "translation", scope: !471, file: !472, line: 40, type: !119)
!481 = !DILocalVariable(name: "w", scope: !471, file: !472, line: 47, type: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !483, line: 37, baseType: !484)
!483 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !201, line: 57, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !83)
!486 = !DILocalVariable(name: "mbs", scope: !471, file: !472, line: 48, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !489)
!488 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !491)
!490 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !491, file: !490, line: 15, baseType: !114, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !491, file: !490, line: 20, baseType: !495, size: 32, offset: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !491, file: !490, line: 16, size: 32, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !495, file: !490, line: 18, baseType: !83, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !495, file: !490, line: 19, baseType: !241, size: 32)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 16, elements: !252)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(scope: null, file: !502, line: 78, type: !270, isLocal: true, isDefinition: true)
!502 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !502, line: 79, type: !246, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !502, line: 80, type: !507, isLocal: true, isDefinition: true)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 13)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !502, line: 81, type: !507, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !502, line: 82, type: !223, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !502, line: 83, type: !251, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !502, line: 84, type: !270, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !502, line: 85, type: !19, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !502, line: 86, type: !19, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !502, line: 87, type: !270, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !526, file: !502, line: 76, type: !598, isLocal: false, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C11, file: !502, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !527, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!527 = !{!97, !528, !81}
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !98, line: 254, baseType: !83, size: 32, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!531 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!532 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!533 = !{!114, !115, !116}
!534 = !{!500, !503, !505, !510, !512, !514, !516, !518, !520, !522, !524, !535, !539, !549, !551, !556, !558, !560, !562, !564, !587, !594, !596}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !526, file: !502, line: 92, type: !537, isLocal: false, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 320, elements: !65)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !526, file: !502, line: 1040, type: !541, isLocal: false, isDefinition: true)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !502, line: 56, size: 448, elements: !542)
!542 = !{!543, !544, !545, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !541, file: !502, line: 59, baseType: !97, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !502, line: 62, baseType: !114, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !541, file: !502, line: 66, baseType: !546, size: 256, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !271)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !541, file: !502, line: 69, baseType: !119, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !541, file: !502, line: 72, baseType: !119, size: 64, offset: 384)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !526, file: !502, line: 107, type: !541, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "slot0", scope: !526, file: !502, line: 831, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 256)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !502, line: 321, type: !251, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !502, line: 357, type: !251, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !502, line: 358, type: !251, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !502, line: 199, type: !19, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "quote", scope: !566, file: !502, line: 228, type: !585, isLocal: true, isDefinition: true)
!566 = distinct !DISubprogram(name: "gettext_quote", scope: !502, file: !502, line: 197, type: !567, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !526, retainedNodes: !569)
!567 = !DISubroutineType(types: !568)
!568 = !{!119, !119, !97}
!569 = !{!570, !571, !572, !573, !574}
!570 = !DILocalVariable(name: "msgid", arg: 1, scope: !566, file: !502, line: 197, type: !119)
!571 = !DILocalVariable(name: "s", arg: 2, scope: !566, file: !502, line: 197, type: !97)
!572 = !DILocalVariable(name: "translation", scope: !566, file: !502, line: 199, type: !119)
!573 = !DILocalVariable(name: "w", scope: !566, file: !502, line: 229, type: !482)
!574 = !DILocalVariable(name: "mbs", scope: !566, file: !502, line: 230, type: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !577, file: !490, line: 15, baseType: !114, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !577, file: !490, line: 20, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !577, file: !490, line: 16, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !581, file: !490, line: 18, baseType: !83, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !581, file: !490, line: 19, baseType: !241, size: 32)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !586)
!586 = !{!253, !243}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "slotvec", scope: !526, file: !502, line: 834, type: !589, isLocal: true, isDefinition: true)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !502, line: 823, size: 128, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !502, line: 825, baseType: !116, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !590, file: !502, line: 826, baseType: !113, size: 64, offset: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "nslots", scope: !526, file: !502, line: 832, type: !114, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "slotvec0", scope: !526, file: !502, line: 833, type: !590, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 704, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 11)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!602 = distinct !DIGlobalVariable(name: "initialized", scope: !603, file: !604, line: 71, type: !114, isLocal: true, isDefinition: true)
!603 = distinct !DISubprogram(name: "unicode_to_mb", scope: !604, file: !604, line: 64, type: !605, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !613, retainedNodes: !686)
!604 = !DIFile(filename: "lib/unicodeio.c", directory: "/src", checksumkind: CSK_MD5, checksum: "34bd73d3f6fd35e045c925e67e34cd2b")
!605 = !DISubroutineType(types: !606)
!606 = !{!202, !83, !607, !610, !112}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!202, !119, !116, !112}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!202, !83, !119, !112}
!613 = distinct !DICompileUnit(language: DW_LANG_C11, file: !604, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !614, globals: !653, splitDebugInlining: false, nameTableKind: None)
!614 = !{!615, !617, !618, !116, !619, !112}
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "iconv_t", file: !616, line: 29, baseType: !112)
!616 = !DIFile(filename: "/usr/include/iconv.h", directory: "", checksumkind: CSK_MD5, checksum: "694d7c23a6e081413ae05832107726a3")
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !176, line: 7, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !178, line: 49, size: 1728, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !621, file: !178, line: 51, baseType: !114, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !621, file: !178, line: 54, baseType: !113, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !621, file: !178, line: 55, baseType: !113, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !621, file: !178, line: 56, baseType: !113, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !621, file: !178, line: 57, baseType: !113, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !621, file: !178, line: 58, baseType: !113, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !621, file: !178, line: 59, baseType: !113, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !621, file: !178, line: 60, baseType: !113, size: 64, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !621, file: !178, line: 61, baseType: !113, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !621, file: !178, line: 64, baseType: !113, size: 64, offset: 576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !621, file: !178, line: 65, baseType: !113, size: 64, offset: 640)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !621, file: !178, line: 66, baseType: !113, size: 64, offset: 704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !621, file: !178, line: 68, baseType: !193, size: 64, offset: 768)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !621, file: !178, line: 70, baseType: !637, size: 64, offset: 832)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !621, file: !178, line: 72, baseType: !114, size: 32, offset: 896)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !621, file: !178, line: 73, baseType: !114, size: 32, offset: 928)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !621, file: !178, line: 74, baseType: !200, size: 64, offset: 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !621, file: !178, line: 77, baseType: !115, size: 16, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !621, file: !178, line: 78, baseType: !205, size: 8, offset: 1040)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !621, file: !178, line: 79, baseType: !59, size: 8, offset: 1048)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !621, file: !178, line: 81, baseType: !208, size: 64, offset: 1088)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !621, file: !178, line: 89, baseType: !211, size: 64, offset: 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !621, file: !178, line: 91, baseType: !213, size: 64, offset: 1216)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !621, file: !178, line: 92, baseType: !216, size: 64, offset: 1280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !621, file: !178, line: 93, baseType: !637, size: 64, offset: 1344)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !621, file: !178, line: 94, baseType: !112, size: 64, offset: 1408)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !621, file: !178, line: 95, baseType: !116, size: 64, offset: 1472)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !621, file: !178, line: 96, baseType: !114, size: 32, offset: 1536)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !621, file: !178, line: 98, baseType: !223, size: 160, offset: 1568)
!653 = !{!654, !655, !657, !659, !661, !663, !665, !670, !675, !680, !682, !684}
!654 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "is_utf8", scope: !603, file: !604, line: 72, type: !114, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "utf8_to_local", scope: !603, file: !604, line: 74, type: !615, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(scope: null, file: !604, line: 81, type: !246, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !604, line: 88, type: !246, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(scope: null, file: !604, line: 99, type: !19, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(scope: null, file: !604, line: 99, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 26)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !604, line: 109, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 23)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !604, line: 178, type: !677, isLocal: true, isDefinition: true)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !678)
!678 = !{!679}
!679 = !DISubrange(count: 45)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !604, line: 180, type: !9, isLocal: true, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(scope: null, file: !604, line: 195, type: !19, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(scope: null, file: !604, line: 197, type: !19, isLocal: true, isDefinition: true)
!686 = !{!687, !688, !689, !690, !691, !694, !695, !696, !702, !703, !704, !705, !706}
!687 = !DILocalVariable(name: "code", arg: 1, scope: !603, file: !604, line: 64, type: !83)
!688 = !DILocalVariable(name: "success", arg: 2, scope: !603, file: !604, line: 65, type: !607)
!689 = !DILocalVariable(name: "failure", arg: 3, scope: !603, file: !604, line: 67, type: !610)
!690 = !DILocalVariable(name: "callback_arg", arg: 4, scope: !603, file: !604, line: 69, type: !112)
!691 = !DILocalVariable(name: "charset", scope: !692, file: !604, line: 79, type: !119)
!692 = distinct !DILexicalBlock(scope: !693, file: !604, line: 78, column: 5)
!693 = distinct !DILexicalBlock(scope: !603, file: !604, line: 77, column: 7)
!694 = !DILocalVariable(name: "inbuf", scope: !603, file: !604, line: 106, type: !246)
!695 = !DILocalVariable(name: "count", scope: !603, file: !604, line: 107, type: !114)
!696 = !DILocalVariable(name: "outbuf", scope: !697, file: !604, line: 114, type: !699)
!697 = distinct !DILexicalBlock(scope: !698, file: !604, line: 113, column: 5)
!698 = distinct !DILexicalBlock(scope: !603, file: !604, line: 112, column: 7)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 25)
!702 = !DILocalVariable(name: "inptr", scope: !697, file: !604, line: 115, type: !119)
!703 = !DILocalVariable(name: "inbytesleft", scope: !697, file: !604, line: 116, type: !116)
!704 = !DILocalVariable(name: "outptr", scope: !697, file: !604, line: 117, type: !113)
!705 = !DILocalVariable(name: "outbytesleft", scope: !697, file: !604, line: 118, type: !116)
!706 = !DILocalVariable(name: "res", scope: !697, file: !604, line: 121, type: !116)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !709, line: 67, type: !337, isLocal: true, isDefinition: true)
!709 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(scope: null, file: !709, line: 69, type: !19, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !709, line: 83, type: !19, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !709, line: 83, type: !241, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !709, line: 85, type: !251, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !709, line: 88, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 171)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !709, line: 88, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 34)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !709, line: 105, type: !74, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !709, line: 109, type: !672, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !709, line: 113, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 28)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(scope: null, file: !709, line: 120, type: !739, isLocal: true, isDefinition: true)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !709, line: 127, type: !744, isLocal: true, isDefinition: true)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 36)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(scope: null, file: !709, line: 134, type: !288, isLocal: true, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(scope: null, file: !709, line: 142, type: !751, isLocal: true, isDefinition: true)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 44)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(scope: null, file: !709, line: 150, type: !756, isLocal: true, isDefinition: true)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 48)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !709, line: 159, type: !761, isLocal: true, isDefinition: true)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 52)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(scope: null, file: !709, line: 170, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 60)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !709, line: 248, type: !223, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !709, line: 248, type: !313, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !709, line: 254, type: !223, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !709, line: 254, type: !130, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !709, line: 254, type: !288, isLocal: true, isDefinition: true)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(scope: null, file: !709, line: 259, type: !3, isLocal: true, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !709, line: 259, type: !353, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !785, file: !786, line: 26, type: !788, isLocal: false, isDefinition: true)
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !787, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!787 = !{!783}
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 376, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 47)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !793, line: 34, type: !137, isLocal: true, isDefinition: true)
!793 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !793, line: 34, type: !19, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(scope: null, file: !793, line: 34, type: !283, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "exit_failure", scope: !800, file: !801, line: 24, type: !803, isLocal: false, isDefinition: true)
!800 = distinct !DICompileUnit(language: DW_LANG_C11, file: !801, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !802, splitDebugInlining: false, nameTableKind: None)
!801 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!802 = !{!798}
!803 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(scope: null, file: !806, line: 47, type: !19, isLocal: true, isDefinition: true)
!806 = !DIFile(filename: "lib/xprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "97c399fecffeb47277bfe89bfa46e209")
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(scope: null, file: !806, line: 47, type: !739, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !811, file: !837, line: 58, type: !838, isLocal: true, isDefinition: true)
!811 = distinct !DICompileUnit(language: DW_LANG_C11, file: !812, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !813, globals: !834, splitDebugInlining: false, nameTableKind: None)
!812 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!813 = !{!113, !814}
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !815, line: 24, baseType: !816)
!815 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !817, line: 41, baseType: !818)
!817 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !817, line: 27, size: 1856, elements: !820)
!820 = !{!821, !825, !828, !831, !832}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !819, file: !817, line: 30, baseType: !822, size: 832)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 832, elements: !508)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !817, line: 30, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !819, file: !817, line: 33, baseType: !826, size: 64, offset: 832)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !819, file: !817, line: 34, baseType: !829, size: 64, offset: 896)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !819, file: !817, line: 35, baseType: !829, size: 64, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !819, file: !817, line: 38, baseType: !833, size: 832, offset: 1024)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 832, elements: !508)
!834 = !{!835, !809}
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(scope: null, file: !837, line: 66, type: !251, isLocal: true, isDefinition: true)
!837 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!838 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(scope: null, file: !841, line: 35, type: !251, isLocal: true, isDefinition: true)
!841 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(scope: null, file: !841, line: 35, type: !246, isLocal: true, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(scope: null, file: !846, line: 873, type: !59, isLocal: true, isDefinition: true)
!846 = !DIFile(filename: "lib/localcharset.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e5b15cc32a9d1ef7c3c611119f66fcd8")
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(scope: null, file: !846, line: 1032, type: !246, isLocal: true, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(scope: null, file: !851, line: 108, type: !59, isLocal: true, isDefinition: true)
!851 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "internal_state", scope: !854, file: !851, line: 97, type: !857, isLocal: true, isDefinition: true)
!854 = distinct !DICompileUnit(language: DW_LANG_C11, file: !851, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !855, globals: !856, splitDebugInlining: false, nameTableKind: None)
!855 = !{!112, !116, !121}
!856 = !{!849, !852}
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !488, line: 6, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !490, line: 21, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !490, line: 13, size: 64, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !859, file: !490, line: 15, baseType: !114, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !859, file: !490, line: 20, baseType: !863, size: 32, offset: 32)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !859, file: !490, line: 16, size: 32, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !863, file: !490, line: 18, baseType: !83, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !863, file: !490, line: 19, baseType: !241, size: 32)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(scope: null, file: !869, line: 202, type: !19, isLocal: true, isDefinition: true)
!869 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !872, file: !869, line: 211, type: !1058, isLocal: true, isDefinition: true)
!872 = distinct !DISubprogram(name: "printf_fetchargs", scope: !869, file: !869, line: 42, type: !873, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1049, retainedNodes: !1053)
!873 = !DISubroutineType(types: !874)
!874 = !{!114, !875, !885}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !418, line: 22, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !877, baseType: !878)
!877 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !879)
!879 = !{!880, !881, !882, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !878, file: !877, baseType: !112, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !878, file: !877, baseType: !112, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !878, file: !877, baseType: !112, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !878, file: !877, baseType: !114, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !878, file: !877, baseType: !114, size: 32, offset: 224)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !887, line: 185, baseType: !888)
!887 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !887, line: 179, size: 1920, elements: !889)
!889 = !{!890, !891, !1047}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !888, file: !887, line: 181, baseType: !116, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !888, file: !887, line: 182, baseType: !892, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !887, line: 174, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !887, line: 111, size: 256, elements: !895)
!895 = !{!896, !947}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !887, line: 113, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !887, line: 108, baseType: !898)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !887, line: 47, baseType: !83, size: 32, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!900 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!901 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!902 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!903 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!904 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!905 = !DIEnumerator(name: "TYPE_INT", value: 5)
!906 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!907 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!908 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!909 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!910 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!911 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!912 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!913 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!914 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!915 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!916 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!917 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!918 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!919 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!920 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!921 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!922 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!923 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!924 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!925 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!926 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!927 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!928 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!929 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!930 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!931 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!932 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!933 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!934 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!935 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!936 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!937 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!938 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!939 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!940 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!941 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!942 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!943 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!944 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!945 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!946 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !894, file: !887, line: 172, baseType: !948, size: 128, offset: 128)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !894, file: !887, line: 114, size: 128, elements: !949)
!949 = !{!950, !951, !952, !954, !955, !956, !957, !958, !959, !961, !963, !967, !971, !974, !977, !980, !982, !985, !988, !991, !993, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1012, !1015, !1016, !1020, !1021, !1023, !1025, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !948, file: !887, line: 116, baseType: !205, size: 8)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !948, file: !887, line: 117, baseType: !121, size: 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !948, file: !887, line: 118, baseType: !953, size: 16)
!953 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !948, file: !887, line: 119, baseType: !115, size: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !948, file: !887, line: 120, baseType: !114, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !948, file: !887, line: 121, baseType: !83, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !948, file: !887, line: 122, baseType: !202, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !948, file: !887, line: 123, baseType: !118, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !948, file: !887, line: 124, baseType: !960, size: 64)
!960 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !948, file: !887, line: 125, baseType: !962, size: 64)
!962 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !948, file: !887, line: 126, baseType: !964, size: 8)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !965, line: 24, baseType: !966)
!965 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !201, line: 37, baseType: !205)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !948, file: !887, line: 127, baseType: !968, size: 8)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !969, line: 24, baseType: !970)
!969 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !201, line: 38, baseType: !121)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !948, file: !887, line: 128, baseType: !972, size: 16)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !965, line: 25, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !201, line: 39, baseType: !953)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !948, file: !887, line: 129, baseType: !975, size: 16)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !969, line: 25, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !201, line: 40, baseType: !115)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !948, file: !887, line: 130, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !965, line: 26, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !201, line: 41, baseType: !114)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !948, file: !887, line: 131, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !969, line: 26, baseType: !485)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !948, file: !887, line: 132, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !965, line: 27, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !201, line: 44, baseType: !202)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !948, file: !887, line: 133, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !969, line: 27, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !201, line: 45, baseType: !118)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !948, file: !887, line: 134, baseType: !989, size: 8)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !990, line: 58, baseType: !205)
!990 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !948, file: !887, line: 135, baseType: !992, size: 8)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !990, line: 71, baseType: !121)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !948, file: !887, line: 136, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !990, line: 60, baseType: !202)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !948, file: !887, line: 137, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !990, line: 73, baseType: !118)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !948, file: !887, line: 138, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !990, line: 61, baseType: !202)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !948, file: !887, line: 139, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !990, line: 74, baseType: !118)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !948, file: !887, line: 140, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !990, line: 62, baseType: !202)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !948, file: !887, line: 141, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !990, line: 75, baseType: !118)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !948, file: !887, line: 142, baseType: !1006, size: 32)
!1006 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !948, file: !887, line: 143, baseType: !1008, size: 64)
!1008 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !948, file: !887, line: 144, baseType: !1010, size: 128)
!1010 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !948, file: !887, line: 145, baseType: !114, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !948, file: !887, line: 147, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1014, line: 20, baseType: !83)
!1014 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !948, file: !887, line: 149, baseType: !119, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !948, file: !887, line: 150, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !117, line: 74, baseType: !83)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !948, file: !887, line: 151, baseType: !112, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !948, file: !887, line: 152, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !948, file: !887, line: 153, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !948, file: !887, line: 154, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !948, file: !887, line: 155, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !948, file: !887, line: 156, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !948, file: !887, line: 157, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !948, file: !887, line: 158, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !948, file: !887, line: 159, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !948, file: !887, line: 160, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !948, file: !887, line: 161, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !948, file: !887, line: 162, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !948, file: !887, line: 163, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !948, file: !887, line: 164, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !888, file: !887, line: 183, baseType: !1048, size: 1792, offset: 128)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 1792, elements: !20)
!1049 = distinct !DICompileUnit(language: DW_LANG_C11, file: !869, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1050, retainedTypes: !1051, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!1050 = !{!898}
!1051 = !{!112}
!1052 = !{!867, !870}
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DILocalVariable(name: "args", arg: 1, scope: !872, file: !869, line: 42, type: !875)
!1055 = !DILocalVariable(name: "a", arg: 2, scope: !872, file: !869, line: 42, type: !885)
!1056 = !DILocalVariable(name: "i", scope: !872, file: !869, line: 44, type: !116)
!1057 = !DILocalVariable(name: "ap", scope: !872, file: !869, line: 45, type: !892)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 224, elements: !20)
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1062, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1062 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1063 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1064, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1065, splitDebugInlining: false, nameTableKind: None)
!1064 = !DIFile(filename: "lib/mbrtowc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bbc936af6884a5d6522de5c3d04ed069")
!1065 = !{!116}
!1066 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1067, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1067 = !DIFile(filename: "lib/unistr/u8-uctomb-aux.c", directory: "/src", checksumkind: CSK_MD5, checksum: "80f3a7ceaaa6337897c5977a21445312")
!1068 = distinct !DICompileUnit(language: DW_LANG_C11, file: !709, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1069, retainedTypes: !1051, globals: !1073, splitDebugInlining: false, nameTableKind: None)
!1069 = !{!1070}
!1070 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !709, line: 40, baseType: !83, size: 32, elements: !1071)
!1071 = !{!1072}
!1072 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1073 = !{!707, !710, !712, !714, !716, !718, !723, !728, !730, !732, !737, !742, !747, !749, !754, !759, !764, !769, !771, !773, !775, !777, !779, !781}
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1076, retainedTypes: !1107, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1076 = !{!1077, !1089}
!1077 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1078, file: !1075, line: 188, baseType: !83, size: 32, elements: !1087)
!1078 = distinct !DISubprogram(name: "x2nrealloc", scope: !1075, file: !1075, line: 176, type: !1079, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1074, retainedNodes: !1082)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!112, !112, !1081, !116}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!1082 = !{!1083, !1084, !1085, !1086}
!1083 = !DILocalVariable(name: "p", arg: 1, scope: !1078, file: !1075, line: 176, type: !112)
!1084 = !DILocalVariable(name: "pn", arg: 2, scope: !1078, file: !1075, line: 176, type: !1081)
!1085 = !DILocalVariable(name: "s", arg: 3, scope: !1078, file: !1075, line: 176, type: !116)
!1086 = !DILocalVariable(name: "n", scope: !1078, file: !1075, line: 178, type: !116)
!1087 = !{!1088}
!1088 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1090, file: !1075, line: 228, baseType: !83, size: 32, elements: !1087)
!1090 = distinct !DISubprogram(name: "xpalloc", scope: !1075, file: !1075, line: 223, type: !1091, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1074, retainedNodes: !1097)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!112, !112, !1093, !1094, !1096, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !1095, line: 130, baseType: !1096)
!1095 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !117, line: 35, baseType: !202)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1098 = !DILocalVariable(name: "pa", arg: 1, scope: !1090, file: !1075, line: 223, type: !112)
!1099 = !DILocalVariable(name: "pn", arg: 2, scope: !1090, file: !1075, line: 223, type: !1093)
!1100 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1090, file: !1075, line: 223, type: !1094)
!1101 = !DILocalVariable(name: "n_max", arg: 4, scope: !1090, file: !1075, line: 223, type: !1096)
!1102 = !DILocalVariable(name: "s", arg: 5, scope: !1090, file: !1075, line: 223, type: !1094)
!1103 = !DILocalVariable(name: "n0", scope: !1090, file: !1075, line: 230, type: !1094)
!1104 = !DILocalVariable(name: "n", scope: !1090, file: !1075, line: 237, type: !1094)
!1105 = !DILocalVariable(name: "nbytes", scope: !1090, file: !1075, line: 248, type: !1094)
!1106 = !DILocalVariable(name: "adjusted_nbytes", scope: !1090, file: !1075, line: 252, type: !1094)
!1107 = !{!113, !112, !122, !202, !118}
!1108 = distinct !DICompileUnit(language: DW_LANG_C11, file: !793, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1109, splitDebugInlining: false, nameTableKind: None)
!1109 = !{!791, !794, !796}
!1110 = distinct !DICompileUnit(language: DW_LANG_C11, file: !806, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1111, splitDebugInlining: false, nameTableKind: None)
!1111 = !{!804, !807}
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1113, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1113 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1114 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1115, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1115 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1116 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1117, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1051, splitDebugInlining: false, nameTableKind: None)
!1117 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1118 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1119, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1051, splitDebugInlining: false, nameTableKind: None)
!1119 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !841, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1121, splitDebugInlining: false, nameTableKind: None)
!1121 = !{!839, !842}
!1122 = distinct !DICompileUnit(language: DW_LANG_C11, file: !846, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1123, retainedTypes: !1051, globals: !1510, splitDebugInlining: false, nameTableKind: None)
!1123 = !{!1124}
!1124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1125, line: 41, baseType: !83, size: 32, elements: !1126)
!1125 = !DIFile(filename: "/usr/include/langinfo.h", directory: "", checksumkind: CSK_MD5, checksum: "86c2f6483d96e7a99fff318ddd13957f")
