; ModuleID = 'src/ptx.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.regex_data = type { ptr, %struct.re_pattern_buffer, [256 x i8] }
%struct.re_pattern_buffer = type { ptr, i64, i64, i64, ptr, ptr, i64, i8 }
%struct.WORD_TABLE = type { ptr, i64, i64 }
%struct.re_registers = type { i32, ptr, ptr }
%struct.BLOCK = type { ptr, ptr }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.WORD = type { ptr, i64 }
%struct.OCCURS = type { %struct.WORD, i64, i64, i64, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [91 x i8] c"Usage: %s [OPTION]... [INPUT]...   (without -G)\0A  or:  %s -G [OPTION]... [INPUT [OUTPUT]]\0A\00", align 1, !dbg !7

!114 = distinct !DIGlobalVariable(name: "long_options", scope: !115, file: !2, line: 1755, type: !683, isLocal: true, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !116, retainedTypes: !170, globals: !205, splitDebugInlining: false, nameTableKind: None)
!116 = !{!117, !126, !132, !135, !141, !155}
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !118, line: 30, baseType: !119, size: 32, elements: !120)
!118 = !DIFile(filename: "./lib/xstrtol.h", directory: "/src", checksumkind: CSK_MD5, checksum: "c0c36b5479e234e245bae53a387a6d92")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIEnumerator(name: "LONGINT_OK", value: 0)
!122 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1)
!123 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2)
!124 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3)
!125 = !DIEnumerator(name: "LONGINT_INVALID", value: 4)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Format", file: !2, line: 62, baseType: !119, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "UNKNOWN_FORMAT", value: 0)
!129 = !DIEnumerator(name: "DUMB_FORMAT", value: 1)
!130 = !DIEnumerator(name: "ROFF_FORMAT", value: 2)
!131 = !DIEnumerator(name: "TEX_FORMAT", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2, line: 1749, baseType: !119, size: 32, elements: !133)
!133 = !{!134}
!134 = !DIEnumerator(name: "FORMAT_OPTION", value: 256)
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 337, baseType: !137, size: 32, elements: !138)
!136 = !DIFile(filename: "src/system.h", directory: "/src", checksumkind: CSK_MD5, checksum: "2cecf68407656b1482c8595bbd6bc338")
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !{!139, !140}
!139 = !DIEnumerator(name: "GETOPT_HELP_CHAR", value: -2)
!140 = !DIEnumerator(name: "GETOPT_VERSION_CHAR", value: -3)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !142, line: 42, baseType: !119, size: 32, elements: !143)
!142 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!144 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!145 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!146 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!147 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!148 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!149 = !DIEnumerator(name: "c_quoting_style", value: 5)
!150 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!151 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!152 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!153 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!154 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 46, baseType: !119, size: 32, elements: !157)
!156 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "3ab3dd7fdf2578005732722ee2393e59")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!158 = !DIEnumerator(name: "_ISupper", value: 256)
!159 = !DIEnumerator(name: "_ISlower", value: 512)
!160 = !DIEnumerator(name: "_ISalpha", value: 1024)
!161 = !DIEnumerator(name: "_ISdigit", value: 2048)
!162 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!163 = !DIEnumerator(name: "_ISspace", value: 8192)
!164 = !DIEnumerator(name: "_ISprint", value: 16384)
!165 = !DIEnumerator(name: "_ISgraph", value: 32768)
!166 = !DIEnumerator(name: "_ISblank", value: 1)
!167 = !DIEnumerator(name: "_IScntrl", value: 2)
!168 = !DIEnumerator(name: "_ISpunct", value: 4)
!169 = !DIEnumerator(name: "_ISalnum", value: 8)
!170 = !{!171, !173, !174, !137, !175, !176, !179, !181, !182}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !177, line: 46, baseType: !178)
!177 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!178 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "OCCURS", file: !2, line: 230, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 222, size: 384, elements: !186)
!186 = !{!187, !197, !198, !199, !204}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !185, file: !2, line: 224, baseType: !188, size: 128)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD", file: !2, line: 117, baseType: !189)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 112, size: 128, elements: !190)
!190 = !{!191, !192}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !189, file: !2, line: 114, baseType: !173, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !189, file: !2, line: 115, baseType: !193, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !194, line: 130, baseType: !195)
!194 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !177, line: 35, baseType: !196)
!196 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !185, file: !2, line: 225, baseType: !195, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !185, file: !2, line: 226, baseType: !195, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !185, file: !2, line: 227, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !201, line: 101, baseType: !202)
!201 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !203, line: 72, baseType: !196)
!203 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "file_index", scope: !185, file: !2, line: 228, baseType: !137, size: 32, offset: 320)
!205 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !59, !64, !66, !68, !70, !72, !74, !79, !81, !83, !88, !93, !98, !103, !108, !206, !211, !216, !221, !226, !228, !233, !238, !240, !245, !247, !279, !281, !283, !285, !294, !296, !298, !300, !303, !306, !314, !317, !322, !327, !408, !413, !415, !417, !422, !424, !426, !428, !430, !432, !434, !436, !441, !446, !448, !450, !452, !454, !456, !458, !460, !465, !470, !475, !477, !479, !481, !483, !488, !490, !492, !494, !496, !498, !503, !508, !510, !515, !517, !519, !521, !523, !525, !527, !529, !531, !533, !535, !537, !542, !544, !546, !548, !113, !550, !552, !554, !556, !558, !560, !562, !564, !566, !568, !570, !572, !574, !576, !578, !580, !584, !586, !588, !592, !597, !599, !602, !607, !609, !614, !624, !629, !631, !633, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681}
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1830, type: !208, isLocal: true, isDefinition: true)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 22)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1858, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 23)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1902, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 9)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 14)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !100, isLocal: true, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1908, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 17)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1939, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 2)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1965, type: !235, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1966, type: !242, isLocal: true, isDefinition: true)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 3)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1974, type: !230, isLocal: true, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "context_regex", scope: !115, file: !2, line: 98, type: !249, isLocal: true, isDefinition: true)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regex_data", file: !2, line: 88, size: 2624, elements: !250)
!250 = !{!251, !252, !275}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !249, file: !2, line: 91, baseType: !179, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !249, file: !2, line: 94, baseType: !253, size: 512, offset: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_pattern_buffer", file: !254, line: 413, size: 512, elements: !255)
!254 = !DIFile(filename: "./lib/regex.h", directory: "/src", checksumkind: CSK_MD5, checksum: "fbbb1db427db36bb03cde72fd2b4622e")
!255 = !{!256, !259, !261, !262, !264, !265, !267, !268, !269, !270, !271, !272, !273, !274}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !253, file: !254, line: 417, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "re_dfa_t", file: !254, line: 417, flags: DIFlagFwdDecl)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !253, file: !254, line: 420, baseType: !260, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_long_size_t", file: !254, line: 56, baseType: !178)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !253, file: !254, line: 423, baseType: !260, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "syntax", scope: !253, file: !254, line: 426, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_syntax_t", file: !254, line: 71, baseType: !178)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !253, file: !254, line: 431, baseType: !173, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "translate", scope: !253, file: !254, line: 437, baseType: !266, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "re_nsub", scope: !253, file: !254, line: 440, baseType: !176, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_null", scope: !253, file: !254, line: 446, baseType: !119, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "regs_allocated", scope: !253, file: !254, line: 457, baseType: !119, size: 2, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap_accurate", scope: !253, file: !254, line: 461, baseType: !119, size: 1, offset: 451, flags: DIFlagBitField, extraData: i64 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "no_sub", scope: !253, file: !254, line: 465, baseType: !119, size: 1, offset: 452, flags: DIFlagBitField, extraData: i64 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "not_bol", scope: !253, file: !254, line: 469, baseType: !119, size: 1, offset: 453, flags: DIFlagBitField, extraData: i64 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "not_eol", scope: !253, file: !254, line: 472, baseType: !119, size: 1, offset: 454, flags: DIFlagBitField, extraData: i64 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "newline_anchor", scope: !253, file: !254, line: 475, baseType: !119, size: 1, offset: 455, flags: DIFlagBitField, extraData: i64 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "fastmap", scope: !249, file: !2, line: 95, baseType: !276, size: 2048, offset: 576)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 256)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "word_regex", scope: !115, file: !2, line: 99, type: !249, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "maximum_word_length", scope: !115, file: !2, line: 146, type: !193, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "reference_max_width", scope: !115, file: !2, line: 149, type: !193, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "ignore_table", scope: !115, file: !2, line: 153, type: !287, isLocal: true, isDefinition: true)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "WORD_TABLE", file: !2, line: 125, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 119, size: 192, elements: !289)
!289 = !{!290, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !288, file: !2, line: 121, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !288, file: !2, line: 122, baseType: !193, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !288, file: !2, line: 123, baseType: !193, size: 64, offset: 128)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "only_table", scope: !115, file: !2, line: 154, type: !287, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "number_input_files", scope: !115, file: !2, line: 158, type: !137, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "total_line_count", scope: !115, file: !2, line: 159, type: !200, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "input_file_name", scope: !115, file: !2, line: 160, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "file_line_count", scope: !115, file: !2, line: 161, type: !305, isLocal: true, isDefinition: true)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "text_buffers", scope: !115, file: !2, line: 163, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLOCK", file: !2, line: 110, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 105, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !310, file: !2, line: 107, baseType: !173, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !310, file: !2, line: 108, baseType: !173, size: 64, offset: 64)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "number_of_occurs", scope: !115, file: !2, line: 237, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !96)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !136, line: 729, type: !319, isLocal: true, isDefinition: true)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 56)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !136, line: 736, type: !324, isLocal: true, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 75)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !329, file: !136, line: 575, type: !137, isLocal: true, isDefinition: true)
!329 = distinct !DISubprogram(name: "oputs_", scope: !136, file: !136, line: 573, type: !330, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !115, retainedNodes: !332)
!330 = !DISubroutineType(cc: DW_CC_nocall, types: !331)
!331 = !{null, !179, !179}
!332 = !{!333, !334, !335, !338, !340, !341, !342, !346, !347, !348, !349, !351, !402, !403, !404, !406, !407}
!333 = !DILocalVariable(name: "program", arg: 1, scope: !329, file: !136, line: 573, type: !179)
!334 = !DILocalVariable(name: "option", arg: 2, scope: !329, file: !136, line: 573, type: !179)
!335 = !DILocalVariable(name: "term", scope: !336, file: !136, line: 585, type: !179)
!336 = distinct !DILexicalBlock(scope: !337, file: !136, line: 582, column: 5)
!337 = distinct !DILexicalBlock(scope: !329, file: !136, line: 581, column: 7)
!338 = !DILocalVariable(name: "double_space", scope: !329, file: !136, line: 594, type: !339)
!339 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!340 = !DILocalVariable(name: "first_word", scope: !329, file: !136, line: 595, type: !179)
!341 = !DILocalVariable(name: "option_text", scope: !329, file: !136, line: 596, type: !179)
!342 = !DILocalVariable(name: "s", scope: !343, file: !136, line: 608, type: !179)
!343 = distinct !DILexicalBlock(scope: !344, file: !136, line: 605, column: 5)
!344 = distinct !DILexicalBlock(scope: !345, file: !136, line: 604, column: 12)
!345 = distinct !DILexicalBlock(scope: !329, file: !136, line: 597, column: 7)
!346 = !DILocalVariable(name: "spaces", scope: !343, file: !136, line: 609, type: !176)
!347 = !DILocalVariable(name: "anchor_len", scope: !329, file: !136, line: 620, type: !176)
!348 = !DILocalVariable(name: "desc_text", scope: !329, file: !136, line: 625, type: !179)
!349 = !DILocalVariable(name: "__ptr", scope: !350, file: !136, line: 644, type: !179)
!350 = distinct !DILexicalBlock(scope: !329, file: !136, line: 644, column: 3)
!351 = !DILocalVariable(name: "__stream", scope: !350, file: !136, line: 644, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !354, line: 7, baseType: !355)
!354 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !356, line: 49, size: 1728, elements: !357)
!356 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !373, !375, !376, !377, !379, !380, !382, !383, !386, !388, !391, !394, !395, !396, !397, !398}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !355, file: !356, line: 51, baseType: !137, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !355, file: !356, line: 54, baseType: !173, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !355, file: !356, line: 55, baseType: !173, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !355, file: !356, line: 56, baseType: !173, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !355, file: !356, line: 57, baseType: !173, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !355, file: !356, line: 58, baseType: !173, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !355, file: !356, line: 59, baseType: !173, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !355, file: !356, line: 60, baseType: !173, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !355, file: !356, line: 61, baseType: !173, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !355, file: !356, line: 64, baseType: !173, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !355, file: !356, line: 65, baseType: !173, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !355, file: !356, line: 66, baseType: !173, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !355, file: !356, line: 68, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !356, line: 36, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !355, file: !356, line: 70, baseType: !374, size: 64, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !355, file: !356, line: 72, baseType: !137, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !355, file: !356, line: 73, baseType: !137, size: 32, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !355, file: !356, line: 74, baseType: !378, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !203, line: 152, baseType: !196)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !355, file: !356, line: 77, baseType: !175, size: 16, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !355, file: !356, line: 78, baseType: !381, size: 8, offset: 1040)
!381 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !355, file: !356, line: 79, baseType: !95, size: 8, offset: 1048)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !355, file: !356, line: 81, baseType: !384, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !356, line: 43, baseType: null)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !355, file: !356, line: 89, baseType: !387, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !203, line: 153, baseType: !196)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !355, file: !356, line: 91, baseType: !389, size: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !356, line: 37, flags: DIFlagFwdDecl)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !355, file: !356, line: 92, baseType: !392, size: 64, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !356, line: 38, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !355, file: !356, line: 93, baseType: !374, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !355, file: !356, line: 94, baseType: !174, size: 64, offset: 1408)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !355, file: !356, line: 95, baseType: !176, size: 64, offset: 1472)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !355, file: !356, line: 96, baseType: !137, size: 32, offset: 1536)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !355, file: !356, line: 98, baseType: !399, size: 160, offset: 1568)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 20)
!402 = !DILocalVariable(name: "__cnt", scope: !350, file: !136, line: 644, type: !176)
!403 = !DILocalVariable(name: "url_program", scope: !329, file: !136, line: 648, type: !179)
!404 = !DILocalVariable(name: "__ptr", scope: !405, file: !136, line: 686, type: !179)
!405 = distinct !DILexicalBlock(scope: !329, file: !136, line: 686, column: 3)
!406 = !DILocalVariable(name: "__stream", scope: !405, file: !136, line: 686, type: !352)
!407 = !DILocalVariable(name: "__cnt", scope: !405, file: !136, line: 686, type: !176)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !136, line: 585, type: !410, isLocal: true, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 5)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !136, line: 586, type: !410, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !136, line: 595, type: !19, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !136, line: 620, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 6)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !235, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !136, line: 648, type: !410, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !19, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !136, line: 649, type: !242, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !136, line: 650, type: !410, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !419, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !136, line: 651, type: !419, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !136, line: 652, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 7)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !136, line: 653, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 8)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !136, line: 654, type: !100, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !136, line: 655, type: !100, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !136, line: 656, type: !100, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !136, line: 657, type: !100, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !136, line: 663, type: !438, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !136, line: 664, type: !100, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !230, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !136, line: 669, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 40)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 15)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !136, line: 676, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 61)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !136, line: 679, type: !242, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(scope: null, file: !136, line: 683, type: !410, isLocal: true, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(scope: null, file: !136, line: 688, type: !410, isLocal: true, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(scope: null, file: !136, line: 691, type: !443, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !136, line: 839, type: !485, isLocal: true, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: 16)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !136, line: 840, type: !208, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !136, line: 841, type: !467, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(scope: null, file: !136, line: 862, type: !19, isLocal: true, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(scope: null, file: !136, line: 868, type: !54, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !136, line: 875, type: !110, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !500, isLocal: true, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 51)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !136, line: 877, type: !505, isLocal: true, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 12)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1757, type: !467, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1758, type: !512, isLocal: true, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 11)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1759, type: !485, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1760, type: !505, isLocal: true, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1761, type: !218, isLocal: true, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1762, type: !505, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1763, type: !512, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1764, type: !100, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1765, type: !512, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1766, type: !485, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1767, type: !438, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1768, type: !485, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1769, type: !505, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1770, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 13)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1771, type: !419, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1772, type: !505, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1773, type: !410, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1774, type: !443, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "gnu_extensions", scope: !115, file: !2, line: 70, type: !339, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "break_file", scope: !115, file: !2, line: 83, type: !179, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "ignore_case", scope: !115, file: !2, line: 82, type: !339, isLocal: true, isDefinition: true)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "gap_size", scope: !115, file: !2, line: 75, type: !193, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "ignore_file", scope: !115, file: !2, line: 85, type: !179, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "only_file", scope: !115, file: !2, line: 84, type: !179, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "input_reference", scope: !115, file: !2, line: 72, type: !339, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "line_width", scope: !115, file: !2, line: 74, type: !193, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "auto_reference", scope: !115, file: !2, line: 71, type: !339, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !235, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "truncation_string", scope: !115, file: !2, line: 76, type: !179, isLocal: true, isDefinition: true)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !242, isLocal: true, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "macro_name", scope: !115, file: !2, line: 78, type: !179, isLocal: true, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "output_format", scope: !115, file: !2, line: 79, type: !126, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "right_reference", scope: !115, file: !2, line: 73, type: !339, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "format_vals", scope: !115, file: !2, line: 1783, type: !582, isLocal: true, isDefinition: true)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !236)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !410, isLocal: true, isDefinition: true)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1780, type: !19, isLocal: true, isDefinition: true)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "format_args", scope: !115, file: !2, line: 1778, type: !590, isLocal: true, isDefinition: true)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 192, elements: !243)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(scope: null, file: !2, line: 442, type: !594, isLocal: true, isDefinition: true)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 32)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !235, isLocal: true, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "folded_chars", scope: !115, file: !2, line: 130, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, elements: !277)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !2, line: 406, type: !604, isLocal: true, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 19)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "word_fastmap", scope: !115, file: !2, line: 143, type: !276, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !2, line: 793, type: !611, isLocal: true, isDefinition: true)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 57)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "context_regs", scope: !115, file: !2, line: 133, type: !616, isLocal: true, isDefinition: true)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "re_registers", file: !254, line: 497, size: 192, elements: !617)
!617 = !{!618, !620, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "num_regs", scope: !616, file: !254, line: 499, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__re_size_t", file: !254, line: 55, baseType: !119)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !616, file: !254, line: 500, baseType: !621, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "regoff_t", file: !254, line: 490, baseType: !137)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !616, file: !254, line: 501, baseType: !621, size: 64, offset: 128)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(scope: null, file: !2, line: 286, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 36)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "word_regs", scope: !115, file: !2, line: 136, type: !616, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "occurs_alloc", scope: !115, file: !2, line: 236, type: !316, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "occurs_table", scope: !115, file: !2, line: 235, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 64, elements: !96)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1081, type: !19, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1194, type: !218, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "reference", scope: !115, file: !2, line: 277, type: !309, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "half_line_width", scope: !115, file: !2, line: 246, type: !193, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "before_max_width", scope: !115, file: !2, line: 250, type: !195, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "keyafter_max_width", scope: !115, file: !2, line: 254, type: !195, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "truncation_string_length", scope: !115, file: !2, line: 257, type: !193, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "edited_flag", scope: !115, file: !2, line: 243, type: !276, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "tail", scope: !115, file: !2, line: 265, type: !309, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "tail_truncation", scope: !115, file: !2, line: 266, type: !339, isLocal: true, isDefinition: true)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "head", scope: !115, file: !2, line: 274, type: !309, isLocal: true, isDefinition: true)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "head_truncation", scope: !115, file: !2, line: 275, type: !339, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1395, type: !410, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "keyafter", scope: !115, file: !2, line: 271, type: !309, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "keyafter_truncation", scope: !115, file: !2, line: 272, type: !339, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "before", scope: !115, file: !2, line: 268, type: !309, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "before_truncation", scope: !115, file: !2, line: 269, type: !339, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1040, type: !419, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1045, type: !539, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1420, type: !419, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1428, type: !242, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1473, type: !410, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1476, type: !242, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 4864, elements: !605)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !686, line: 50, size: 256, elements: !687)
!686 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!687 = !{!688, !689, !690, !692}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !686, line: 52, baseType: !179, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !685, file: !686, line: 55, baseType: !137, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !685, file: !686, line: 56, baseType: !691, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !685, file: !686, line: 57, baseType: !137, size: 32, offset: 192)
!693 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!694 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!695 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!696 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!697 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !700, line: 3, type: !467, isLocal: true, isDefinition: true)
!700 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "Version", scope: !703, file: !700, line: 3, type: !179, isLocal: false, isDefinition: true)
!703 = distinct !DICompileUnit(language: DW_LANG_C11, file: !700, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !704, splitDebugInlining: false, nameTableKind: None)
!704 = !{!698, !701}
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !707, file: !708, line: 65, type: !730, isLocal: false, isDefinition: true)
!707 = distinct !DICompileUnit(language: DW_LANG_C11, file: !708, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !709, retainedTypes: !710, globals: !711, splitDebugInlining: false, nameTableKind: None)
!708 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!709 = !{!141}
!710 = !{!174, !179, !181}
!711 = !{!705, !712, !714, !716, !721, !726, !728}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(scope: null, file: !708, line: 141, type: !438, isLocal: true, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !708, line: 141, type: !110, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !708, line: 142, type: !718, isLocal: true, isDefinition: true)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 29)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !708, line: 160, type: !723, isLocal: true, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 21)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !708, line: 165, type: !443, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !708, line: 170, type: !410, isLocal: true, isDefinition: true)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !731, line: 69, baseType: !732)
!731 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "file_name", scope: !737, file: !738, line: 45, type: !179, isLocal: true, isDefinition: true)
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !739, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!739 = !{!740, !742, !744, !746, !735, !748}
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !738, line: 121, type: !438, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(scope: null, file: !738, line: 121, type: !505, isLocal: true, isDefinition: true)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !738, line: 123, type: !438, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !738, line: 126, type: !242, isLocal: true, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !737, file: !738, line: 55, type: !339, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !752, file: !753, line: 66, type: !732, isLocal: false, isDefinition: true)
!752 = distinct !DICompileUnit(language: DW_LANG_C11, file: !753, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !754, globals: !755, splitDebugInlining: false, nameTableKind: None)
!753 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!754 = !{!174, !181}
!755 = !{!756, !758, !783, !785, !787, !789, !750, !791, !793, !795, !797, !799}
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(scope: null, file: !753, line: 272, type: !410, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "old_file_name", scope: !760, file: !753, line: 304, type: !179, isLocal: true, isDefinition: true)
!760 = distinct !DISubprogram(name: "verror_at_line", scope: !753, file: !753, line: 298, type: !761, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !752, retainedNodes: !776)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !137, !137, !179, !119, !179, !763}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !764, line: 52, baseType: !765)
!764 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !766, line: 14, baseType: !767)
!766 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !768, baseType: !769)
!768 = !DIFile(filename: "lib/error.c", directory: "/src")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !770)
!770 = !{!771, !772, !773, !774, !775}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !769, file: !768, baseType: !174, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !769, file: !768, baseType: !174, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !769, file: !768, baseType: !174, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !769, file: !768, baseType: !137, size: 32, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !769, file: !768, baseType: !137, size: 32, offset: 224)
!776 = !{!777, !778, !779, !780, !781, !782}
!777 = !DILocalVariable(name: "status", arg: 1, scope: !760, file: !753, line: 298, type: !137)
!778 = !DILocalVariable(name: "errnum", arg: 2, scope: !760, file: !753, line: 298, type: !137)
!779 = !DILocalVariable(name: "file_name", arg: 3, scope: !760, file: !753, line: 298, type: !179)
!780 = !DILocalVariable(name: "line_number", arg: 4, scope: !760, file: !753, line: 298, type: !119)
!781 = !DILocalVariable(name: "message", arg: 5, scope: !760, file: !753, line: 298, type: !179)
!782 = !DILocalVariable(name: "args", arg: 6, scope: !760, file: !753, line: 298, type: !763)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "old_line_number", scope: !760, file: !753, line: 305, type: !119, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !753, line: 338, type: !19, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(scope: null, file: !753, line: 346, type: !443, isLocal: true, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !753, line: 346, type: !235, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "error_message_count", scope: !752, file: !753, line: 69, type: !119, isLocal: false, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !752, file: !753, line: 295, type: !137, isLocal: false, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(scope: null, file: !753, line: 208, type: !438, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(scope: null, file: !753, line: 208, type: !723, isLocal: true, isDefinition: true)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(scope: null, file: !753, line: 214, type: !410, isLocal: true, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(scope: null, file: !803, line: 40, type: !100, isLocal: true, isDefinition: true)
!803 = !DIFile(filename: "lib/freopen-safer.c", directory: "/src", checksumkind: CSK_MD5, checksum: "380f3eea209580e07073525fbfd0dac5")
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "program_name", scope: !806, file: !807, line: 31, type: !179, isLocal: false, isDefinition: true)
!806 = distinct !DICompileUnit(language: DW_LANG_C11, file: !807, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !808, globals: !809, splitDebugInlining: false, nameTableKind: None)
!807 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!808 = !{!173}
!809 = !{!804, !810, !812}
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(scope: null, file: !807, line: 46, type: !443, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(scope: null, file: !807, line: 49, type: !19, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "utf07FF", scope: !816, file: !817, line: 46, type: !844, isLocal: true, isDefinition: true)
!816 = distinct !DISubprogram(name: "proper_name_lite", scope: !817, file: !817, line: 38, type: !818, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !820, retainedNodes: !822)
!817 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!818 = !DISubroutineType(types: !819)
!819 = !{!179, !179, !179}
!820 = distinct !DICompileUnit(language: DW_LANG_C11, file: !817, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !821, splitDebugInlining: false, nameTableKind: None)
!821 = !{!814}
!822 = !{!823, !824, !825, !826, !831}
!823 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !816, file: !817, line: 38, type: !179)
!824 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !816, file: !817, line: 38, type: !179)
!825 = !DILocalVariable(name: "translation", scope: !816, file: !817, line: 40, type: !179)
!826 = !DILocalVariable(name: "w", scope: !816, file: !817, line: 47, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !828, line: 37, baseType: !829)
!828 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !203, line: 57, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !203, line: 42, baseType: !119)
!831 = !DILocalVariable(name: "mbs", scope: !816, file: !817, line: 48, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !833, line: 6, baseType: !834)
!833 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !835, line: 21, baseType: !836)
!835 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 13, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !836, file: !835, line: 15, baseType: !137, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !836, file: !835, line: 20, baseType: !840, size: 32, offset: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !835, line: 16, size: 32, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !840, file: !835, line: 18, baseType: !119, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !840, file: !835, line: 19, baseType: !19, size: 32)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 16, elements: !236)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(scope: null, file: !847, line: 78, type: !443, isLocal: true, isDefinition: true)
!847 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(scope: null, file: !847, line: 79, type: !419, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !847, line: 80, type: !539, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(scope: null, file: !847, line: 81, type: !539, isLocal: true, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !847, line: 82, type: !399, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !847, line: 83, type: !235, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !847, line: 84, type: !443, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !847, line: 85, type: !438, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !847, line: 86, type: !438, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !847, line: 87, type: !443, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !868, file: !847, line: 76, type: !937, isLocal: false, isDefinition: true)
!868 = distinct !DICompileUnit(language: DW_LANG_C11, file: !847, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !875, globals: !876, splitDebugInlining: false, nameTableKind: None)
!869 = !{!141, !870, !155}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !142, line: 254, baseType: !119, size: 32, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!873 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!874 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!875 = !{!137, !175, !176}
!876 = !{!845, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !877, !881, !891, !893, !895, !897, !899, !901, !903, !926, !933, !935}
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !868, file: !847, line: 92, type: !879, isLocal: false, isDefinition: true)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 320, elements: !101)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !868, file: !847, line: 1040, type: !883, isLocal: false, isDefinition: true)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !847, line: 56, size: 448, elements: !884)
!884 = !{!885, !886, !887, !889, !890}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !883, file: !847, line: 59, baseType: !141, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !883, file: !847, line: 62, baseType: !137, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !883, file: !847, line: 66, baseType: !888, size: 256, offset: 64)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 256, elements: !444)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !883, file: !847, line: 69, baseType: !179, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !883, file: !847, line: 72, baseType: !179, size: 64, offset: 384)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !868, file: !847, line: 107, type: !883, isLocal: true, isDefinition: true)
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "slot0", scope: !868, file: !847, line: 831, type: !276, isLocal: true, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(scope: null, file: !847, line: 321, type: !235, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(scope: null, file: !847, line: 357, type: !235, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(scope: null, file: !847, line: 358, type: !235, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(scope: null, file: !847, line: 199, type: !438, isLocal: true, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "quote", scope: !905, file: !847, line: 228, type: !924, isLocal: true, isDefinition: true)
!905 = distinct !DISubprogram(name: "gettext_quote", scope: !847, file: !847, line: 197, type: !906, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !868, retainedNodes: !908)
!906 = !DISubroutineType(types: !907)
!907 = !{!179, !179, !141}
!908 = !{!909, !910, !911, !912, !913}
!909 = !DILocalVariable(name: "msgid", arg: 1, scope: !905, file: !847, line: 197, type: !179)
!910 = !DILocalVariable(name: "s", arg: 2, scope: !905, file: !847, line: 197, type: !141)
!911 = !DILocalVariable(name: "translation", scope: !905, file: !847, line: 199, type: !179)
!912 = !DILocalVariable(name: "w", scope: !905, file: !847, line: 229, type: !827)
!913 = !DILocalVariable(name: "mbs", scope: !905, file: !847, line: 230, type: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !833, line: 6, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !835, line: 21, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 13, size: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !916, file: !835, line: 15, baseType: !137, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !916, file: !835, line: 20, baseType: !920, size: 32, offset: 32)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !916, file: !835, line: 16, size: 32, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !920, file: !835, line: 18, baseType: !119, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !920, file: !835, line: 19, baseType: !19, size: 32)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 64, elements: !925)
!925 = !{!237, !21}
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "slotvec", scope: !868, file: !847, line: 834, type: !928, isLocal: true, isDefinition: true)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !847, line: 823, size: 128, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !929, file: !847, line: 825, baseType: !176, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !929, file: !847, line: 826, baseType: !173, size: 64, offset: 64)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "nslots", scope: !868, file: !847, line: 832, type: !137, isLocal: true, isDefinition: true)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "slotvec0", scope: !868, file: !847, line: 833, type: !929, isLocal: true, isDefinition: true)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 704, elements: !513)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !940, line: 192, type: !19, isLocal: true, isDefinition: true)
!940 = !DIFile(filename: "lib/read-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5e61a5e6b0c83d68cde0efd76e0ac088")
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !940, line: 192, type: !242, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !945, line: 67, type: !505, isLocal: true, isDefinition: true)
!945 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !945, line: 69, type: !438, isLocal: true, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(scope: null, file: !945, line: 83, type: !438, isLocal: true, isDefinition: true)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !945, line: 83, type: !19, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !945, line: 85, type: !235, isLocal: true, isDefinition: true)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(scope: null, file: !945, line: 88, type: !956, isLocal: true, isDefinition: true)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 171)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !945, line: 88, type: !961, isLocal: true, isDefinition: true)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 34)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(scope: null, file: !945, line: 105, type: !485, isLocal: true, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !945, line: 109, type: !213, isLocal: true, isDefinition: true)
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(scope: null, file: !945, line: 113, type: !970, isLocal: true, isDefinition: true)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 28)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !945, line: 120, type: !594, isLocal: true, isDefinition: true)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !945, line: 127, type: !626, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !945, line: 134, type: !462, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !945, line: 142, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !982)
!982 = !{!983}
!983 = !DISubrange(count: 44)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(scope: null, file: !945, line: 150, type: !986, isLocal: true, isDefinition: true)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 48)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !945, line: 159, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 52)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !945, line: 170, type: !996, isLocal: true, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 60)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(scope: null, file: !945, line: 248, type: !399, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !945, line: 248, type: !208, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !945, line: 254, type: !399, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !945, line: 254, type: !223, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !945, line: 254, type: !462, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !945, line: 259, type: !3, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !945, line: 259, type: !718, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1015, file: !1016, line: 26, type: !1018, isLocal: false, isDefinition: true)
!1015 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1016, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1017, splitDebugInlining: false, nameTableKind: None)
!1016 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1017 = !{!1013}
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 376, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 47)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1023, file: !1024, line: 24, type: !1026, isLocal: false, isDefinition: true)
!1023 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1024, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1025, splitDebugInlining: false, nameTableKind: None)
!1024 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1025 = !{!1021}
!1026 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !242, isLocal: true, isDefinition: true)
!1029 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !438, isLocal: true, isDefinition: true)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(scope: null, file: !1029, line: 34, type: !230, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !1036, line: 108, type: !95, isLocal: true, isDefinition: true)
!1036 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "internal_state", scope: !1039, file: !1036, line: 97, type: !1042, isLocal: true, isDefinition: true)
!1039 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1036, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1040, globals: !1041, splitDebugInlining: false, nameTableKind: None)
!1040 = !{!174, !176, !181}
!1041 = !{!1034, !1037}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !833, line: 6, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !835, line: 21, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !835, line: 13, size: 64, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1044, file: !835, line: 15, baseType: !137, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1044, file: !835, line: 20, baseType: !1048, size: 32, offset: 32)
!1048 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1044, file: !835, line: 16, size: 32, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1048, file: !835, line: 18, baseType: !119, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1048, file: !835, line: 19, baseType: !19, size: 32)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 35, type: !235, isLocal: true, isDefinition: true)
!1054 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(scope: null, file: !1054, line: 35, type: !419, isLocal: true, isDefinition: true)
!1057 = distinct !DICompileUnit(language: DW_LANG_C11, file: !803, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1058, splitDebugInlining: false, nameTableKind: None)
!1058 = !{!801}
!1059 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1060, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1061 = distinct !DICompileUnit(language: DW_LANG_C11, file: !940, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!1062 = !{!174, !178}
!1063 = !{!938, !941}
!1064 = distinct !DICompileUnit(language: DW_LANG_C11, file: !945, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1065, retainedTypes: !1069, globals: !1070, splitDebugInlining: false, nameTableKind: None)
!1065 = !{!1066}
!1066 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !945, line: 40, baseType: !119, size: 32, elements: !1067)
!1067 = !{!1068}
!1068 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1069 = !{!174}
!1070 = !{!943, !946, !948, !950, !952, !954, !959, !964, !966, !968, !973, !975, !977, !979, !984, !989, !994, !999, !1001, !1003, !1005, !1007, !1009, !1011}
!1071 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1072, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1073, retainedTypes: !1101, splitDebugInlining: false, nameTableKind: None)
!1072 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1073 = !{!1074, !1086}
!1074 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1075, file: !1072, line: 188, baseType: !119, size: 32, elements: !1084)
!1075 = distinct !DISubprogram(name: "x2nrealloc", scope: !1072, file: !1072, line: 176, type: !1076, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1071, retainedNodes: !1079)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!174, !174, !1078, !176}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!1079 = !{!1080, !1081, !1082, !1083}
!1080 = !DILocalVariable(name: "p", arg: 1, scope: !1075, file: !1072, line: 176, type: !174)
!1081 = !DILocalVariable(name: "pn", arg: 2, scope: !1075, file: !1072, line: 176, type: !1078)
!1082 = !DILocalVariable(name: "s", arg: 3, scope: !1075, file: !1072, line: 176, type: !176)
!1083 = !DILocalVariable(name: "n", scope: !1075, file: !1072, line: 178, type: !176)
!1084 = !{!1085}
!1085 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1086 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1087, file: !1072, line: 228, baseType: !119, size: 32, elements: !1084)
!1087 = distinct !DISubprogram(name: "xpalloc", scope: !1072, file: !1072, line: 223, type: !1088, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1071, retainedNodes: !1091)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!174, !174, !1090, !193, !195, !193}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1092 = !DILocalVariable(name: "pa", arg: 1, scope: !1087, file: !1072, line: 223, type: !174)
!1093 = !DILocalVariable(name: "pn", arg: 2, scope: !1087, file: !1072, line: 223, type: !1090)
!1094 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1087, file: !1072, line: 223, type: !193)
!1095 = !DILocalVariable(name: "n_max", arg: 4, scope: !1087, file: !1072, line: 223, type: !195)
!1096 = !DILocalVariable(name: "s", arg: 5, scope: !1087, file: !1072, line: 223, type: !193)
!1097 = !DILocalVariable(name: "n0", scope: !1087, file: !1072, line: 230, type: !193)
!1098 = !DILocalVariable(name: "n", scope: !1087, file: !1072, line: 237, type: !193)
!1099 = !DILocalVariable(name: "nbytes", scope: !1087, file: !1072, line: 248, type: !193)
!1100 = !DILocalVariable(name: "adjusted_nbytes", scope: !1087, file: !1072, line: 252, type: !193)
!1101 = !{!173, !174, !339, !196, !178}
!1102 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1029, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1103, splitDebugInlining: false, nameTableKind: None)
!1103 = !{!1027, !1030, !1032}
!1104 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1105, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1106, retainedTypes: !1107, splitDebugInlining: false, nameTableKind: None)
!1105 = !DIFile(filename: "lib/xstrtoimax.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d613cb456542443dde992ed5c05f2acb")
!1106 = !{!117}
!1107 = !{!339, !196, !178, !200}
!1108 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1109, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, splitDebugInlining: false, nameTableKind: None)
!1109 = !DIFile(filename: "lib/fopen.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e2a73b267ffe85e9e2028d0b4278a6b8")
!1110 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1111, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1111 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1112 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1113, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1113 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1114 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1115, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, splitDebugInlining: false, nameTableKind: None)
!1115 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1116 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1117, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, splitDebugInlining: false, nameTableKind: None)
!1117 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1118 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1119, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1119 = !DIFile(filename: "lib/memset_explicit.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5aa0e831d3f4d1a5017c23894634ef8c")
!1120 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1121, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1122, splitDebugInlining: false, nameTableKind: None)
!1121 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1122 = !{!339, !178, !174}
!1123 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1054, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1124, splitDebugInlining: false, nameTableKind: None)
!1124 = !{!1052, !1055}
!1125 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1126, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1126 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1127 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1128, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1069, splitDebugInlining: false, nameTableKind: None)
