; ModuleID = 'src/pwd.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.file_name = type { ptr, i64, ptr }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [60 x i8] c"Print the full filename of the current working directory.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"pwd\00", align 1, !dbg !17

!110 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!111 = !DIEnumerator(name: "c_quoting_style", value: 5)
!112 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!113 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!114 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!115 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!116 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 120, baseType: !89, size: 32, elements: !118)
!118 = !{!119}
!119 = !DIEnumerator(name: "NOT_AN_INODE_NUMBER", value: 0)
!120 = !{!121, !122, !83, !123, !124, !127, !129}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!123 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !125, line: 46, baseType: !126)
!125 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!126 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !131, !136, !141, !146, !229, !234, !236, !238, !243, !248, !250, !252, !254, !256, !258, !260, !265, !270, !272, !274, !276, !278, !280, !282, !287, !292, !297, !302, !304, !306, !308, !310, !312, !317, !319, !321, !326, !331, !336, !341, !343, !348, !350, !77, !352, !354, !356, !358, !363, !365, !370, !372, !377, !379, !384, !389}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 14)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 351, type: !138, isLocal: true, isDefinition: true)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 13)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 30)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !148, file: !82, line: 575, type: !83, isLocal: true, isDefinition: true)
!148 = distinct !DISubprogram(name: "oputs_", scope: !82, file: !82, line: 573, type: !149, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !151)
!149 = !DISubroutineType(cc: DW_CC_nocall, types: !150)
!150 = !{null, !127, !127}
!151 = !{!152, !153, !154, !157, !159, !160, !161, !165, !166, !167, !168, !170, !223, !224, !225, !227, !228}
!152 = !DILocalVariable(name: "program", arg: 1, scope: !148, file: !82, line: 573, type: !127)
!153 = !DILocalVariable(name: "option", arg: 2, scope: !148, file: !82, line: 573, type: !127)
!154 = !DILocalVariable(name: "term", scope: !155, file: !82, line: 585, type: !127)
!155 = distinct !DILexicalBlock(scope: !156, file: !82, line: 582, column: 5)
!156 = distinct !DILexicalBlock(scope: !148, file: !82, line: 581, column: 7)
!157 = !DILocalVariable(name: "double_space", scope: !148, file: !82, line: 594, type: !158)
!158 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!159 = !DILocalVariable(name: "first_word", scope: !148, file: !82, line: 595, type: !127)
!160 = !DILocalVariable(name: "option_text", scope: !148, file: !82, line: 596, type: !127)
!161 = !DILocalVariable(name: "s", scope: !162, file: !82, line: 608, type: !127)
!162 = distinct !DILexicalBlock(scope: !163, file: !82, line: 605, column: 5)
!163 = distinct !DILexicalBlock(scope: !164, file: !82, line: 604, column: 12)
!164 = distinct !DILexicalBlock(scope: !148, file: !82, line: 597, column: 7)
!165 = !DILocalVariable(name: "spaces", scope: !162, file: !82, line: 609, type: !124)
!166 = !DILocalVariable(name: "anchor_len", scope: !148, file: !82, line: 620, type: !124)
!167 = !DILocalVariable(name: "desc_text", scope: !148, file: !82, line: 625, type: !127)
!168 = !DILocalVariable(name: "__ptr", scope: !169, file: !82, line: 644, type: !127)
!169 = distinct !DILexicalBlock(scope: !148, file: !82, line: 644, column: 3)
!170 = !DILocalVariable(name: "__stream", scope: !169, file: !82, line: 644, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !173, line: 7, baseType: !174)
!173 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !175, line: 49, size: 1728, elements: !176)
!175 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !194, !195, !196, !200, !201, !203, !204, !207, !209, !212, !215, !216, !217, !218, !219}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !175, line: 51, baseType: !83, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !175, line: 54, baseType: !122, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !175, line: 55, baseType: !122, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !175, line: 56, baseType: !122, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !175, line: 57, baseType: !122, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !175, line: 58, baseType: !122, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !175, line: 59, baseType: !122, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !175, line: 60, baseType: !122, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !175, line: 61, baseType: !122, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !175, line: 64, baseType: !122, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !175, line: 65, baseType: !122, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !175, line: 66, baseType: !122, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !175, line: 68, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !175, line: 36, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !175, line: 70, baseType: !193, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !175, line: 72, baseType: !83, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !175, line: 73, baseType: !83, size: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !175, line: 74, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !199)
!198 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!199 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !175, line: 77, baseType: !123, size: 16, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !175, line: 78, baseType: !202, size: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !175, line: 79, baseType: !59, size: 8, offset: 1048)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 81, baseType: !205, size: 64, offset: 1088)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !175, line: 43, baseType: null)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !175, line: 89, baseType: !208, size: 64, offset: 1152)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !199)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !175, line: 91, baseType: !210, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !175, line: 37, flags: DIFlagFwdDecl)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !175, line: 92, baseType: !213, size: 64, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !175, line: 38, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !175, line: 93, baseType: !193, size: 64, offset: 1344)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !175, line: 94, baseType: !121, size: 64, offset: 1408)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !175, line: 95, baseType: !124, size: 64, offset: 1472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !175, line: 96, baseType: !83, size: 32, offset: 1536)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !175, line: 98, baseType: !220, size: 160, offset: 1568)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 20)
!223 = !DILocalVariable(name: "__cnt", scope: !169, file: !82, line: 644, type: !124)
!224 = !DILocalVariable(name: "url_program", scope: !148, file: !82, line: 648, type: !127)
!225 = !DILocalVariable(name: "__ptr", scope: !226, file: !82, line: 686, type: !127)
!226 = distinct !DILexicalBlock(scope: !148, file: !82, line: 686, column: 3)
!227 = !DILocalVariable(name: "__stream", scope: !226, file: !82, line: 686, type: !171)
!228 = !DILocalVariable(name: "__cnt", scope: !226, file: !82, line: 686, type: !124)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(scope: null, file: !82, line: 585, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 5)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(scope: null, file: !82, line: 586, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !82, line: 595, type: !19, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !82, line: 620, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 2)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !82, line: 648, type: !231, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !19, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !82, line: 649, type: !74, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !82, line: 650, type: !231, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !240, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(scope: null, file: !82, line: 651, type: !240, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(scope: null, file: !82, line: 652, type: !262, isLocal: true, isDefinition: true)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 7)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !82, line: 653, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !82, line: 654, type: !64, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !82, line: 655, type: !64, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(scope: null, file: !82, line: 656, type: !64, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(scope: null, file: !82, line: 657, type: !64, isLocal: true, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(scope: null, file: !82, line: 663, type: !262, isLocal: true, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !82, line: 664, type: !64, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 17)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !82, line: 669, type: !289, isLocal: true, isDefinition: true)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 40)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !294, isLocal: true, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 15)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !82, line: 676, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 61)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !82, line: 679, type: !74, isLocal: true, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !82, line: 683, type: !231, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !82, line: 688, type: !231, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !82, line: 691, type: !267, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !82, line: 839, type: !54, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !82, line: 840, type: !314, isLocal: true, isDefinition: true)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 22)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !82, line: 841, type: !294, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !82, line: 862, type: !19, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !82, line: 868, type: !323, isLocal: true, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 71)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !82, line: 875, type: !328, isLocal: true, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 27)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !333, isLocal: true, isDefinition: true)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !334)
!334 = !{!335}
!335 = !DISubrange(count: 51)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(scope: null, file: !82, line: 877, type: !338, isLocal: true, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 12)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !267, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !2, line: 42, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 9)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !231, isLocal: true, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !267, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !2, line: 296, type: !19, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !74, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !245, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 31)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 269, type: !245, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(scope: null, file: !2, line: 274, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 18)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(scope: null, file: !2, line: 156, type: !74, isLocal: true, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(scope: null, file: !2, line: 158, type: !374, isLocal: true, isDefinition: true)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 25)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !314, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 226, type: !381, isLocal: true, isDefinition: true)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 21)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 57)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !2, line: 134, type: !19, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 1280, elements: !232)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !394, line: 50, size: 256, elements: !395)
!394 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!395 = !{!396, !397, !398, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !394, line: 52, baseType: !127, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !393, file: !394, line: 55, baseType: !83, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !393, file: !394, line: 56, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !393, file: !394, line: 57, baseType: !83, size: 32, offset: 192)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !403, line: 3, type: !294, isLocal: true, isDefinition: true)
!403 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "Version", scope: !406, file: !403, line: 3, type: !127, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C11, file: !403, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !407, splitDebugInlining: false, nameTableKind: None)
!407 = !{!401, !404}
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "file_name", scope: !410, file: !411, line: 45, type: !127, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C11, file: !411, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !412, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!412 = !{!413, !415, !417, !419, !408, !421}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !411, line: 121, type: !262, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !411, line: 121, type: !338, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !411, line: 123, type: !262, isLocal: true, isDefinition: true)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !411, line: 126, type: !74, isLocal: true, isDefinition: true)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !410, file: !411, line: 55, type: !158, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !425, file: !426, line: 66, type: !474, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C11, file: !426, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !427, globals: !428, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!427 = !{!121, !129}
!428 = !{!429, !431, !456, !458, !460, !462, !423, !464, !466, !468, !470, !472}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !426, line: 272, type: !231, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "old_file_name", scope: !433, file: !426, line: 304, type: !127, isLocal: true, isDefinition: true)
!433 = distinct !DISubprogram(name: "verror_at_line", scope: !426, file: !426, line: 298, type: !434, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !425, retainedNodes: !449)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !83, !83, !127, !89, !127, !436}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !437, line: 52, baseType: !438)
!437 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !439, line: 14, baseType: !440)
!439 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !441, baseType: !442)
!441 = !DIFile(filename: "lib/error.c", directory: "/src")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !443)
!443 = !{!444, !445, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !442, file: !441, baseType: !121, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !442, file: !441, baseType: !121, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !442, file: !441, baseType: !121, size: 64, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !442, file: !441, baseType: !83, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !442, file: !441, baseType: !83, size: 32, offset: 224)
!449 = !{!450, !451, !452, !453, !454, !455}
!450 = !DILocalVariable(name: "status", arg: 1, scope: !433, file: !426, line: 298, type: !83)
!451 = !DILocalVariable(name: "errnum", arg: 2, scope: !433, file: !426, line: 298, type: !83)
!452 = !DILocalVariable(name: "file_name", arg: 3, scope: !433, file: !426, line: 298, type: !127)
!453 = !DILocalVariable(name: "line_number", arg: 4, scope: !433, file: !426, line: 298, type: !89)
!454 = !DILocalVariable(name: "message", arg: 5, scope: !433, file: !426, line: 298, type: !127)
!455 = !DILocalVariable(name: "args", arg: 6, scope: !433, file: !426, line: 298, type: !436)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "old_line_number", scope: !433, file: !426, line: 305, type: !89, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !426, line: 338, type: !19, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !426, line: 346, type: !267, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !426, line: 346, type: !245, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "error_message_count", scope: !425, file: !426, line: 69, type: !89, isLocal: false, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !425, file: !426, line: 295, type: !83, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(scope: null, file: !426, line: 208, type: !262, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !426, line: 208, type: !381, isLocal: true, isDefinition: true)
!472 = !DIGlobalVariableExpression(var: !473, expr: !DIExpression())
!473 = distinct !DIGlobalVariable(scope: null, file: !426, line: 214, type: !231, isLocal: true, isDefinition: true)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null}
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "program_name", scope: !479, file: !480, line: 31, type: !127, isLocal: false, isDefinition: true)
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !480, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !481, globals: !482, splitDebugInlining: false, nameTableKind: None)
!480 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!481 = !{!122}
!482 = !{!477, !483, !485}
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(scope: null, file: !480, line: 46, type: !267, isLocal: true, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(scope: null, file: !480, line: 49, type: !19, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "utf07FF", scope: !489, file: !490, line: 46, type: !517, isLocal: true, isDefinition: true)
!489 = distinct !DISubprogram(name: "proper_name_lite", scope: !490, file: !490, line: 38, type: !491, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !493, retainedNodes: !495)
!490 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!491 = !DISubroutineType(types: !492)
!492 = !{!127, !127, !127}
!493 = distinct !DICompileUnit(language: DW_LANG_C11, file: !490, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !494, splitDebugInlining: false, nameTableKind: None)
!494 = !{!487}
!495 = !{!496, !497, !498, !499, !504}
!496 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !489, file: !490, line: 38, type: !127)
!497 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !489, file: !490, line: 38, type: !127)
!498 = !DILocalVariable(name: "translation", scope: !489, file: !490, line: 40, type: !127)
!499 = !DILocalVariable(name: "w", scope: !489, file: !490, line: 47, type: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !501, line: 37, baseType: !502)
!501 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !198, line: 57, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !198, line: 42, baseType: !89)
!504 = !DILocalVariable(name: "mbs", scope: !489, file: !490, line: 48, type: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !506, line: 6, baseType: !507)
!506 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !508, line: 21, baseType: !509)
!508 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 13, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !509, file: !508, line: 15, baseType: !83, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !509, file: !508, line: 20, baseType: !513, size: 32, offset: 32)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !509, file: !508, line: 16, size: 32, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !513, file: !508, line: 18, baseType: !89, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !513, file: !508, line: 19, baseType: !19, size: 32)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 16, elements: !246)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !520, line: 78, type: !267, isLocal: true, isDefinition: true)
!520 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(scope: null, file: !520, line: 79, type: !240, isLocal: true, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(scope: null, file: !520, line: 80, type: !138, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !520, line: 81, type: !138, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !520, line: 82, type: !220, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(scope: null, file: !520, line: 83, type: !245, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(scope: null, file: !520, line: 84, type: !267, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(scope: null, file: !520, line: 85, type: !262, isLocal: true, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(scope: null, file: !520, line: 86, type: !262, isLocal: true, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(scope: null, file: !520, line: 87, type: !267, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !541, file: !520, line: 76, type: !613, isLocal: false, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C11, file: !520, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !542, retainedTypes: !548, globals: !549, splitDebugInlining: false, nameTableKind: None)
!542 = !{!103, !543, !87}
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !104, line: 254, baseType: !89, size: 32, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!546 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!547 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!548 = !{!83, !123, !124}
!549 = !{!518, !521, !523, !525, !527, !529, !531, !533, !535, !537, !539, !550, !554, !564, !566, !571, !573, !575, !577, !579, !602, !609, !611}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !541, file: !520, line: 92, type: !552, isLocal: false, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 320, elements: !65)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !541, file: !520, line: 1040, type: !556, isLocal: false, isDefinition: true)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !520, line: 56, size: 448, elements: !557)
!557 = !{!558, !559, !560, !562, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !556, file: !520, line: 59, baseType: !103, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !556, file: !520, line: 62, baseType: !83, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !556, file: !520, line: 66, baseType: !561, size: 256, offset: 64)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 256, elements: !268)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !556, file: !520, line: 69, baseType: !127, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !556, file: !520, line: 72, baseType: !127, size: 64, offset: 384)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !541, file: !520, line: 107, type: !556, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "slot0", scope: !541, file: !520, line: 831, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 256)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !520, line: 321, type: !245, isLocal: true, isDefinition: true)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(scope: null, file: !520, line: 357, type: !245, isLocal: true, isDefinition: true)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(scope: null, file: !520, line: 358, type: !245, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(scope: null, file: !520, line: 199, type: !262, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "quote", scope: !581, file: !520, line: 228, type: !600, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "gettext_quote", scope: !520, file: !520, line: 197, type: !582, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !541, retainedNodes: !584)
!582 = !DISubroutineType(types: !583)
!583 = !{!127, !127, !103}
!584 = !{!585, !586, !587, !588, !589}
!585 = !DILocalVariable(name: "msgid", arg: 1, scope: !581, file: !520, line: 197, type: !127)
!586 = !DILocalVariable(name: "s", arg: 2, scope: !581, file: !520, line: 197, type: !103)
!587 = !DILocalVariable(name: "translation", scope: !581, file: !520, line: 199, type: !127)
!588 = !DILocalVariable(name: "w", scope: !581, file: !520, line: 229, type: !500)
!589 = !DILocalVariable(name: "mbs", scope: !581, file: !520, line: 230, type: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !506, line: 6, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !508, line: 21, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 13, size: 64, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !592, file: !508, line: 15, baseType: !83, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !592, file: !508, line: 20, baseType: !596, size: 32, offset: 32)
!596 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !592, file: !508, line: 16, size: 32, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !596, file: !508, line: 18, baseType: !89, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !596, file: !508, line: 19, baseType: !19, size: 32)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 64, elements: !601)
!601 = !{!247, !21}
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "slotvec", scope: !541, file: !520, line: 834, type: !604, isLocal: true, isDefinition: true)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !520, line: 823, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !605, file: !520, line: 825, baseType: !124, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !605, file: !520, line: 826, baseType: !122, size: 64, offset: 64)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "nslots", scope: !541, file: !520, line: 832, type: !83, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "slotvec0", scope: !541, file: !520, line: 833, type: !605, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 704, elements: !615)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!615 = !{!616}
!616 = !DISubrange(count: 11)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !619, line: 32, type: !245, isLocal: true, isDefinition: true)
!619 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(scope: null, file: !622, line: 67, type: !338, isLocal: true, isDefinition: true)
!622 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !622, line: 69, type: !262, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !622, line: 83, type: !262, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !622, line: 83, type: !19, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !622, line: 85, type: !245, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !622, line: 88, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 171)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !622, line: 88, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 34)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !622, line: 105, type: !54, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !622, line: 109, type: !9, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !622, line: 113, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 28)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !622, line: 120, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 32)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(scope: null, file: !622, line: 127, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 36)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !622, line: 134, type: !289, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !622, line: 142, type: !44, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !622, line: 150, type: !29, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !622, line: 159, type: !668, isLocal: true, isDefinition: true)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 52)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(scope: null, file: !622, line: 170, type: !14, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(scope: null, file: !622, line: 248, type: !220, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(scope: null, file: !622, line: 248, type: !314, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(scope: null, file: !622, line: 254, type: !220, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !622, line: 254, type: !133, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !622, line: 254, type: !289, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !622, line: 259, type: !3, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !622, line: 259, type: !687, isLocal: true, isDefinition: true)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 29)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !692, file: !693, line: 26, type: !695, isLocal: false, isDefinition: true)
!692 = distinct !DICompileUnit(language: DW_LANG_C11, file: !693, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !694, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!694 = !{!690}
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 376, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 47)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "exit_failure", scope: !700, file: !701, line: 24, type: !703, isLocal: false, isDefinition: true)
!700 = distinct !DICompileUnit(language: DW_LANG_C11, file: !701, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !702, splitDebugInlining: false, nameTableKind: None)
!701 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!702 = !{!698}
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !83)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(scope: null, file: !706, line: 34, type: !74, isLocal: true, isDefinition: true)
!706 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !706, line: 34, type: !262, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !706, line: 34, type: !284, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !713, line: 108, type: !59, isLocal: true, isDefinition: true)
!713 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "internal_state", scope: !716, file: !713, line: 97, type: !719, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C11, file: !713, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !717, globals: !718, splitDebugInlining: false, nameTableKind: None)
!717 = !{!121, !124, !129}
!718 = !{!711, !714}
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !506, line: 6, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !508, line: 21, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 13, size: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !721, file: !508, line: 15, baseType: !83, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !721, file: !508, line: 20, baseType: !725, size: 32, offset: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !721, file: !508, line: 16, size: 32, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !725, file: !508, line: 18, baseType: !89, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !725, file: !508, line: 19, baseType: !19, size: 32)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(scope: null, file: !731, line: 35, type: !245, isLocal: true, isDefinition: true)
!731 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !731, line: 35, type: !240, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C11, file: !735, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!736 = distinct !DICompileUnit(language: DW_LANG_C11, file: !619, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !737, splitDebugInlining: false, nameTableKind: None)
!737 = !{!617}
!738 = distinct !DICompileUnit(language: DW_LANG_C11, file: !622, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !739, retainedTypes: !743, globals: !744, splitDebugInlining: false, nameTableKind: None)
!739 = !{!740}
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !622, line: 40, baseType: !89, size: 32, elements: !741)
!741 = !{!742}
!742 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!743 = !{!121}
!744 = !{!620, !623, !625, !627, !629, !631, !636, !641, !643, !645, !650, !655, !660, !662, !664, !666, !671, !673, !675, !677, !679, !681, !683, !685}
!745 = distinct !DICompileUnit(language: DW_LANG_C11, file: !746, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !747, retainedTypes: !778, splitDebugInlining: false, nameTableKind: None)
!746 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!747 = !{!748, !760}
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !749, file: !746, line: 188, baseType: !89, size: 32, elements: !758)
!749 = distinct !DISubprogram(name: "x2nrealloc", scope: !746, file: !746, line: 176, type: !750, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !745, retainedNodes: !753)
!750 = !DISubroutineType(types: !751)
!751 = !{!121, !121, !752, !124}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!753 = !{!754, !755, !756, !757}
!754 = !DILocalVariable(name: "p", arg: 1, scope: !749, file: !746, line: 176, type: !121)
!755 = !DILocalVariable(name: "pn", arg: 2, scope: !749, file: !746, line: 176, type: !752)
!756 = !DILocalVariable(name: "s", arg: 3, scope: !749, file: !746, line: 176, type: !124)
!757 = !DILocalVariable(name: "n", scope: !749, file: !746, line: 178, type: !124)
!758 = !{!759}
!759 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !761, file: !746, line: 228, baseType: !89, size: 32, elements: !758)
!761 = distinct !DISubprogram(name: "xpalloc", scope: !746, file: !746, line: 223, type: !762, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !745, retainedNodes: !768)
!762 = !DISubroutineType(types: !763)
!763 = !{!121, !121, !764, !765, !767, !765}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !766, line: 130, baseType: !767)
!766 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !125, line: 35, baseType: !199)
!768 = !{!769, !770, !771, !772, !773, !774, !775, !776, !777}
!769 = !DILocalVariable(name: "pa", arg: 1, scope: !761, file: !746, line: 223, type: !121)
!770 = !DILocalVariable(name: "pn", arg: 2, scope: !761, file: !746, line: 223, type: !764)
!771 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !761, file: !746, line: 223, type: !765)
!772 = !DILocalVariable(name: "n_max", arg: 4, scope: !761, file: !746, line: 223, type: !767)
!773 = !DILocalVariable(name: "s", arg: 5, scope: !761, file: !746, line: 223, type: !765)
!774 = !DILocalVariable(name: "n0", scope: !761, file: !746, line: 230, type: !765)
!775 = !DILocalVariable(name: "n", scope: !761, file: !746, line: 237, type: !765)
!776 = !DILocalVariable(name: "nbytes", scope: !761, file: !746, line: 248, type: !765)
!777 = !DILocalVariable(name: "adjusted_nbytes", scope: !761, file: !746, line: 252, type: !765)
!778 = !{!122, !121, !158, !199, !126}
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !706, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !780, splitDebugInlining: false, nameTableKind: None)
!780 = !{!704, !707, !709}
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !782, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!782 = !DIFile(filename: "lib/xgetcwd.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3727157833d2e1ec9b24b353bc14eccb")
!783 = distinct !DICompileUnit(language: DW_LANG_C11, file: !784, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!785 = distinct !DICompileUnit(language: DW_LANG_C11, file: !786, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!787 = distinct !DICompileUnit(language: DW_LANG_C11, file: !788, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !743, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!789 = distinct !DICompileUnit(language: DW_LANG_C11, file: !790, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !743, splitDebugInlining: false, nameTableKind: None)
!790 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!791 = distinct !DICompileUnit(language: DW_LANG_C11, file: !792, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !793, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!793 = !{!158, !126, !121}
!794 = distinct !DICompileUnit(language: DW_LANG_C11, file: !731, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !795, splitDebugInlining: false, nameTableKind: None)
!795 = !{!729, !732}
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !797, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !799, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !743, splitDebugInlining: false, nameTableKind: None)
!799 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!800 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!801 = !{i32 7, !"Dwarf Version", i32 5}
!802 = !{i32 2, !"Debug Info Version", i32 3}
!803 = !{i32 1, !"wchar_size", i32 4}
!804 = !{i32 8, !"PIC Level", i32 2}
!805 = !{i32 7, !"PIE Level", i32 2}
!806 = !{i32 7, !"uwtable", i32 2}
!807 = !{i32 7, !"frame-pointer", i32 1}
!808 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 49, type: !809, scopeLine: 50, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !83}
!811 = !{!812}
!812 = !DILocalVariable(name: "status", arg: 1, scope: !808, file: !2, line: 49, type: !83)
!813 = !DILocation(line: 0, scope: !808)
!814 = !DILocation(line: 51, column: 14, scope: !815)
!815 = distinct !DILexicalBlock(scope: !808, file: !2, line: 51, column: 7)
!816 = !DILocation(line: 51, column: 7, scope: !808)
!817 = !DILocation(line: 52, column: 5, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !2, line: 52, column: 5)
!819 = !{!820, !820, i64 0}
!820 = !{!"any pointer", !821, i64 0}
!821 = !{!"omnipotent char", !822, i64 0}
!822 = !{!"Simple C/C++ TBAA"}
!823 = !DILocation(line: 55, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !815, file: !2, line: 54, column: 5)
!825 = !DILocation(line: 56, column: 7, scope: !824)
!826 = !DILocation(line: 60, column: 7, scope: !824)
!827 = !DILocation(line: 64, column: 7, scope: !824)
!828 = !DILocation(line: 68, column: 7, scope: !824)
!829 = !DILocation(line: 69, column: 7, scope: !824)
!830 = !DILocation(line: 70, column: 7, scope: !824)
!831 = !DILocation(line: 73, column: 7, scope: !824)
!832 = !DILocalVariable(name: "program", arg: 1, scope: !833, file: !82, line: 836, type: !127)
!833 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !82, file: !82, line: 836, type: !834, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !127}
!836 = !{!832, !837, !844, !845, !847, !848}
!837 = !DILocalVariable(name: "infomap", scope: !833, file: !82, line: 838, type: !838)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 896, elements: !263)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !833, file: !82, line: 838, size: 128, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !840, file: !82, line: 838, baseType: !127, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !840, file: !82, line: 838, baseType: !127, size: 64, offset: 64)
!844 = !DILocalVariable(name: "node", scope: !833, file: !82, line: 848, type: !127)
!845 = !DILocalVariable(name: "map_prog", scope: !833, file: !82, line: 849, type: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!847 = !DILocalVariable(name: "lc_messages", scope: !833, file: !82, line: 861, type: !127)
!848 = !DILocalVariable(name: "url_program", scope: !833, file: !82, line: 874, type: !127)
!849 = !DILocation(line: 0, scope: !833, inlinedAt: !850)
!850 = distinct !DILocation(line: 74, column: 7, scope: !824)
!851 = !DILocation(line: 857, column: 3, scope: !833, inlinedAt: !850)
!852 = !DILocation(line: 861, column: 29, scope: !833, inlinedAt: !850)
!853 = !DILocation(line: 862, column: 7, scope: !854, inlinedAt: !850)
!854 = distinct !DILexicalBlock(scope: !833, file: !82, line: 862, column: 7)
!855 = !DILocation(line: 862, column: 19, scope: !854, inlinedAt: !850)
!856 = !DILocation(line: 862, column: 22, scope: !854, inlinedAt: !850)
!857 = !DILocation(line: 862, column: 7, scope: !833, inlinedAt: !850)
!858 = !DILocation(line: 868, column: 7, scope: !859, inlinedAt: !850)
!859 = distinct !DILexicalBlock(scope: !854, file: !82, line: 863, column: 5)
!860 = !DILocation(line: 870, column: 5, scope: !859, inlinedAt: !850)
!861 = !DILocation(line: 875, column: 3, scope: !833, inlinedAt: !850)
!862 = !DILocation(line: 877, column: 3, scope: !833, inlinedAt: !850)
!863 = !DILocation(line: 76, column: 3, scope: !808)
!864 = !DISubprogram(name: "dcgettext", scope: !865, file: !865, line: 51, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!865 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!866 = !DISubroutineType(types: !867)
!867 = !{!122, !127, !127, !83}
!868 = !{}
!869 = !DISubprogram(name: "__fprintf_chk", scope: !870, file: !870, line: 93, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!870 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!871 = !DISubroutineType(types: !872)
!872 = !{!83, !873, !83, !874, null}
!873 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !171)
!874 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !127)
!875 = !DISubprogram(name: "__printf_chk", scope: !870, file: !870, line: 95, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!876 = !DISubroutineType(types: !877)
!877 = !{!83, !83, !874, null}
!878 = !DISubprogram(name: "fputs_unlocked", scope: !437, file: !437, line: 691, type: !879, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!879 = !DISubroutineType(types: !880)
!880 = !{!83, !874, !873}
!881 = !DILocation(line: 0, scope: !148)
!882 = !DILocation(line: 581, column: 7, scope: !156)
!883 = !{!884, !884, i64 0}
!884 = !{!"int", !821, i64 0}
!885 = !DILocation(line: 581, column: 19, scope: !156)
!886 = !DILocation(line: 581, column: 7, scope: !148)
!887 = !DILocation(line: 585, column: 26, scope: !155)
!888 = !DILocation(line: 0, scope: !155)
!889 = !DILocation(line: 586, column: 23, scope: !155)
!890 = !DILocation(line: 586, column: 28, scope: !155)
!891 = !DILocation(line: 586, column: 32, scope: !155)
!892 = !{!821, !821, i64 0}
!893 = !DILocation(line: 586, column: 38, scope: !155)
!894 = !DILocalVariable(name: "__s1", arg: 1, scope: !895, file: !896, line: 1359, type: !127)
!895 = distinct !DISubprogram(name: "streq", scope: !896, file: !896, line: 1359, type: !897, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !899)
!896 = !DIFile(filename: "./lib/string.h", directory: "/src")
!897 = !DISubroutineType(types: !898)
!898 = !{!158, !127, !127}
!899 = !{!894, !900}
!900 = !DILocalVariable(name: "__s2", arg: 2, scope: !895, file: !896, line: 1359, type: !127)
!901 = !DILocation(line: 0, scope: !895, inlinedAt: !902)
!902 = distinct !DILocation(line: 586, column: 41, scope: !155)
!903 = !DILocation(line: 1361, column: 11, scope: !895, inlinedAt: !902)
!904 = !DILocation(line: 1361, column: 10, scope: !895, inlinedAt: !902)
!905 = !DILocation(line: 586, column: 19, scope: !155)
!906 = !DILocation(line: 587, column: 5, scope: !155)
!907 = !DILocation(line: 588, column: 7, scope: !908)
!908 = distinct !DILexicalBlock(scope: !148, file: !82, line: 588, column: 7)
!909 = !DILocation(line: 588, column: 7, scope: !148)
!910 = !DILocation(line: 590, column: 7, scope: !911)
!911 = distinct !DILexicalBlock(scope: !908, file: !82, line: 589, column: 5)
!912 = !DILocation(line: 591, column: 7, scope: !911)
!913 = !DILocation(line: 595, column: 37, scope: !148)
!914 = !DILocation(line: 595, column: 35, scope: !148)
!915 = !DILocation(line: 596, column: 29, scope: !148)
!916 = !DILocation(line: 597, column: 8, scope: !164)
!917 = !DILocation(line: 597, column: 7, scope: !148)
!918 = !DILocation(line: 604, column: 24, scope: !163)
!919 = !DILocation(line: 604, column: 12, scope: !164)
!920 = !DILocation(line: 0, scope: !162)
!921 = !DILocation(line: 610, column: 16, scope: !162)
!922 = !DILocation(line: 610, column: 7, scope: !162)
!923 = !DILocation(line: 611, column: 21, scope: !162)
!924 = !{!925, !925, i64 0}
!925 = !{!"short", !821, i64 0}
!926 = !DILocation(line: 611, column: 19, scope: !162)
!927 = !DILocation(line: 611, column: 16, scope: !162)
!928 = !DILocation(line: 610, column: 30, scope: !162)
!929 = distinct !{!929, !922, !923, !930}
!930 = !{!"llvm.loop.mustprogress"}
!931 = !DILocation(line: 612, column: 18, scope: !932)
!932 = distinct !DILexicalBlock(scope: !162, file: !82, line: 612, column: 11)
!933 = !DILocation(line: 612, column: 11, scope: !162)
!934 = !DILocation(line: 620, column: 23, scope: !148)
!935 = !DILocation(line: 625, column: 39, scope: !148)
!936 = !DILocation(line: 626, column: 3, scope: !148)
!937 = !DILocation(line: 626, column: 10, scope: !148)
!938 = !DILocation(line: 626, column: 21, scope: !148)
!939 = !DILocation(line: 628, column: 44, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !82, line: 628, column: 11)
!941 = distinct !DILexicalBlock(scope: !148, file: !82, line: 627, column: 5)
!942 = !DILocation(line: 628, column: 32, scope: !940)
!943 = !DILocation(line: 628, column: 49, scope: !940)
!944 = !DILocation(line: 628, column: 11, scope: !941)
!945 = !DILocation(line: 630, column: 11, scope: !946)
!946 = distinct !DILexicalBlock(scope: !941, file: !82, line: 630, column: 11)
!947 = !DILocation(line: 630, column: 11, scope: !941)
!948 = !DILocation(line: 632, column: 26, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !82, line: 632, column: 15)
!950 = distinct !DILexicalBlock(scope: !946, file: !82, line: 631, column: 9)
!951 = !DILocation(line: 632, column: 34, scope: !949)
!952 = !DILocation(line: 632, column: 37, scope: !949)
!953 = !DILocation(line: 632, column: 15, scope: !950)
!954 = !DILocation(line: 640, column: 16, scope: !941)
!955 = distinct !{!955, !936, !956, !930}
!956 = !DILocation(line: 641, column: 5, scope: !148)
!957 = !DILocation(line: 644, column: 3, scope: !148)
!958 = !DILocation(line: 0, scope: !895, inlinedAt: !959)
!959 = distinct !DILocation(line: 648, column: 31, scope: !148)
!960 = !DILocation(line: 0, scope: !895, inlinedAt: !961)
!961 = distinct !DILocation(line: 649, column: 31, scope: !148)
!962 = !DILocation(line: 0, scope: !895, inlinedAt: !963)
!963 = distinct !DILocation(line: 650, column: 31, scope: !148)
!964 = !DILocation(line: 0, scope: !895, inlinedAt: !965)
!965 = distinct !DILocation(line: 651, column: 31, scope: !148)
!966 = !DILocation(line: 0, scope: !895, inlinedAt: !967)
!967 = distinct !DILocation(line: 652, column: 31, scope: !148)
!968 = !DILocation(line: 0, scope: !895, inlinedAt: !969)
!969 = distinct !DILocation(line: 653, column: 31, scope: !148)
!970 = !DILocation(line: 0, scope: !895, inlinedAt: !971)
!971 = distinct !DILocation(line: 654, column: 31, scope: !148)
!972 = !DILocation(line: 0, scope: !895, inlinedAt: !973)
!973 = distinct !DILocation(line: 655, column: 31, scope: !148)
!974 = !DILocation(line: 0, scope: !895, inlinedAt: !975)
!975 = distinct !DILocation(line: 656, column: 31, scope: !148)
!976 = !DILocation(line: 0, scope: !895, inlinedAt: !977)
!977 = distinct !DILocation(line: 657, column: 31, scope: !148)
!978 = !DILocation(line: 663, column: 7, scope: !979)
!979 = distinct !DILexicalBlock(scope: !148, file: !82, line: 663, column: 7)
!980 = !DILocation(line: 664, column: 7, scope: !979)
!981 = !DILocation(line: 664, column: 10, scope: !979)
!982 = !DILocation(line: 663, column: 7, scope: !148)
!983 = !DILocation(line: 669, column: 7, scope: !984)
!984 = distinct !DILexicalBlock(scope: !979, file: !82, line: 665, column: 5)
!985 = !DILocation(line: 671, column: 5, scope: !984)
!986 = !DILocation(line: 676, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !979, file: !82, line: 673, column: 5)
!988 = !DILocation(line: 679, column: 3, scope: !148)
!989 = !DILocation(line: 683, column: 3, scope: !148)
!990 = !DILocation(line: 686, column: 3, scope: !148)
!991 = !DILocation(line: 688, column: 3, scope: !148)
!992 = !DILocation(line: 691, column: 3, scope: !148)
!993 = !DILocation(line: 695, column: 3, scope: !148)
!994 = !DILocation(line: 696, column: 1, scope: !148)
!995 = !DISubprogram(name: "setlocale", scope: !996, file: !996, line: 122, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!996 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!997 = !DISubroutineType(types: !998)
!998 = !{!122, !83, !127}
!999 = !DISubprogram(name: "strncmp", scope: !1000, file: !1000, line: 159, type: !1001, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1000 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!83, !127, !127, !124}
!1003 = !DISubprogram(name: "exit", scope: !1004, file: !1004, line: 624, type: !809, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1004 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1005 = !DISubprogram(name: "getenv", scope: !1004, file: !1004, line: 641, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!122, !127}
!1008 = !DISubprogram(name: "strcmp", scope: !1000, file: !1000, line: 156, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!83, !127, !127}
!1011 = !DISubprogram(name: "strspn", scope: !1000, file: !1000, line: 297, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!126, !127, !127}
!1014 = !DISubprogram(name: "strchr", scope: !1000, file: !1000, line: 246, type: !1015, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!122, !127, !83}
!1017 = !DISubprogram(name: "__ctype_b_loc", scope: !88, file: !88, line: 79, type: !1018, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!1023 = !DISubprogram(name: "strcspn", scope: !1000, file: !1000, line: 293, type: !1012, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1024 = !DISubprogram(name: "fwrite_unlocked", scope: !437, file: !437, line: 704, type: !1025, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !868)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!124, !1027, !124, !124, !873}
!1027 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1030 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 320, type: !1031, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1034)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!83, !83, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!1034 = !{!1035, !1036, !1037, !1038, !1040, !1043, !1044}
!1035 = !DILocalVariable(name: "argc", arg: 1, scope: !1030, file: !2, line: 320, type: !83)
!1036 = !DILocalVariable(name: "argv", arg: 2, scope: !1030, file: !2, line: 320, type: !1033)
!1037 = !DILocalVariable(name: "logical", scope: !1030, file: !2, line: 325, type: !158)
!1038 = !DILocalVariable(name: "c", scope: !1039, file: !2, line: 337, type: !83)
!1039 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 336, column: 5)
!1040 = !DILocalVariable(name: "wd", scope: !1041, file: !2, line: 363, type: !127)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 362, column: 5)
!1042 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 361, column: 7)
!1043 = !DILocalVariable(name: "wd", scope: !1030, file: !2, line: 371, type: !122)
!1044 = !DILocalVariable(name: "file_name", scope: !1045, file: !2, line: 379, type: !1047)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 378, column: 5)
!1046 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 372, column: 7)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !2, line: 32, size: 192, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1048, file: !2, line: 34, baseType: !122, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !1048, file: !2, line: 35, baseType: !765, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1048, file: !2, line: 36, baseType: !122, size: 64, offset: 128)
!1053 = !DILocation(line: 0, scope: !1030)
!1054 = !DILocation(line: 325, column: 19, scope: !1030)
!1055 = !DILocation(line: 325, column: 46, scope: !1030)
!1056 = !DILocation(line: 328, column: 21, scope: !1030)
!1057 = !DILocation(line: 328, column: 3, scope: !1030)
!1058 = !DILocation(line: 329, column: 3, scope: !1030)
!1059 = !DILocation(line: 330, column: 3, scope: !1030)
!1060 = !DILocation(line: 331, column: 3, scope: !1030)
!1061 = !DILocation(line: 333, column: 3, scope: !1030)
!1062 = !DILocation(line: 335, column: 3, scope: !1030)
!1063 = !DILocation(line: 337, column: 15, scope: !1039)
!1064 = !DILocation(line: 0, scope: !1039)
!1065 = !DILocation(line: 338, column: 11, scope: !1039)
!1066 = !DILocation(line: 347, column: 11, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 341, column: 9)
!1068 = !DILocation(line: 349, column: 9, scope: !1067)
!1069 = !DILocation(line: 351, column: 9, scope: !1067)
!1070 = !DILocation(line: 354, column: 11, scope: !1067)
!1071 = !DILocation(line: 358, column: 7, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1030, file: !2, line: 358, column: 7)
!1073 = !DILocation(line: 358, column: 14, scope: !1072)
!1074 = !DILocation(line: 358, column: 7, scope: !1030)
!1075 = !DILocation(line: 359, column: 5, scope: !1072)
!1076 = !DILocation(line: 361, column: 7, scope: !1030)
!1077 = !DILocation(line: 296, column: 20, scope: !1078, inlinedAt: !1121)
!1078 = distinct !DISubprogram(name: "logical_getcwd", scope: !2, file: !2, line: 294, type: !1079, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1081)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!127}
!1081 = !{!1082, !1083, !1084, !1120}
!1082 = !DILocalVariable(name: "wd", scope: !1078, file: !2, line: 296, type: !127)
!1083 = !DILocalVariable(name: "p", scope: !1078, file: !2, line: 301, type: !127)
!1084 = !DILocalVariable(name: "st1", scope: !1078, file: !2, line: 311, type: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1086, line: 44, size: 1024, elements: !1087)
!1086 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1087 = !{!1088, !1090, !1092, !1094, !1096, !1098, !1100, !1101, !1102, !1103, !1105, !1106, !1108, !1116, !1117, !1118}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1085, file: !1086, line: 46, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !198, line: 145, baseType: !126)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1085, file: !1086, line: 47, baseType: !1091, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !198, line: 148, baseType: !126)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1085, file: !1086, line: 48, baseType: !1093, size: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !198, line: 150, baseType: !89)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1085, file: !1086, line: 49, baseType: !1095, size: 32, offset: 160)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !198, line: 151, baseType: !89)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1085, file: !1086, line: 50, baseType: !1097, size: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !198, line: 146, baseType: !89)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1085, file: !1086, line: 51, baseType: !1099, size: 32, offset: 224)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !198, line: 147, baseType: !89)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1085, file: !1086, line: 52, baseType: !1089, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1085, file: !1086, line: 53, baseType: !1089, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1085, file: !1086, line: 54, baseType: !197, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1085, file: !1086, line: 55, baseType: !1104, size: 32, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !198, line: 175, baseType: !83)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1085, file: !1086, line: 56, baseType: !83, size: 32, offset: 480)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1085, file: !1086, line: 57, baseType: !1107, size: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !198, line: 180, baseType: !199)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1085, file: !1086, line: 65, baseType: !1109, size: 128, offset: 576)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1110, line: 11, size: 128, elements: !1111)
!1110 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1111 = !{!1112, !1114}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1109, file: !1110, line: 16, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !198, line: 160, baseType: !199)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1109, file: !1110, line: 21, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !198, line: 197, baseType: !199)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1085, file: !1086, line: 66, baseType: !1109, size: 128, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1085, file: !1086, line: 67, baseType: !1109, size: 128, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1085, file: !1086, line: 79, baseType: !1119, size: 64, offset: 960)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 64, elements: !246)
!1120 = !DILocalVariable(name: "st2", scope: !1078, file: !2, line: 312, type: !1085)
!1121 = distinct !DILocation(line: 363, column: 24, scope: !1041)
!1122 = !DILocation(line: 0, scope: !1078, inlinedAt: !1121)
!1123 = !DILocation(line: 299, column: 8, scope: !1124, inlinedAt: !1121)
!1124 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 299, column: 7)
!1125 = !DILocation(line: 299, column: 11, scope: !1124, inlinedAt: !1121)
!1126 = !DILocation(line: 299, column: 14, scope: !1124, inlinedAt: !1121)
!1127 = !DILocation(line: 299, column: 20, scope: !1124, inlinedAt: !1121)
!1128 = !DILocation(line: 299, column: 7, scope: !1078, inlinedAt: !1121)
!1129 = !DILocation(line: 302, column: 15, scope: !1078, inlinedAt: !1121)
!1130 = !DILocation(line: 302, column: 3, scope: !1078, inlinedAt: !1121)
!1131 = !DILocation(line: 304, column: 12, scope: !1132, inlinedAt: !1121)
!1132 = distinct !DILexicalBlock(scope: !1133, file: !2, line: 304, column: 11)
!1133 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 303, column: 5)
!1134 = !DILocation(line: 304, column: 17, scope: !1132, inlinedAt: !1121)
!1135 = !DILocation(line: 305, column: 32, scope: !1132, inlinedAt: !1121)
!1136 = !DILocation(line: 305, column: 37, scope: !1132, inlinedAt: !1121)
!1137 = !DILocation(line: 307, column: 8, scope: !1133, inlinedAt: !1121)
!1138 = distinct !{!1138, !1130, !1139, !930}
!1139 = !DILocation(line: 308, column: 5, scope: !1078, inlinedAt: !1121)
!1140 = !DILocation(line: 311, column: 3, scope: !1078, inlinedAt: !1121)
!1141 = !DILocation(line: 311, column: 15, scope: !1078, inlinedAt: !1121)
!1142 = !DILocation(line: 312, column: 3, scope: !1078, inlinedAt: !1121)
!1143 = !DILocation(line: 312, column: 15, scope: !1078, inlinedAt: !1121)
!1144 = !DILocation(line: 313, column: 7, scope: !1145, inlinedAt: !1121)
!1145 = distinct !DILexicalBlock(scope: !1078, file: !2, line: 313, column: 7)
!1146 = !DILocation(line: 313, column: 23, scope: !1145, inlinedAt: !1121)
!1147 = !DILocation(line: 313, column: 28, scope: !1145, inlinedAt: !1121)
!1148 = !DILocation(line: 313, column: 31, scope: !1145, inlinedAt: !1121)
!1149 = !DILocation(line: 313, column: 48, scope: !1145, inlinedAt: !1121)
!1150 = !DILocation(line: 313, column: 53, scope: !1145, inlinedAt: !1121)
!1151 = !DILocalVariable(name: "a", arg: 1, scope: !1152, file: !1153, line: 86, type: !1156)
!1152 = distinct !DISubprogram(name: "psame_inode", scope: !1153, file: !1153, line: 86, type: !1154, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1158)
!1153 = !DIFile(filename: "./lib/same-inode.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6a49db1c884e7bc93549038e7fb28788")
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!158, !1156, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1158 = !{!1151, !1159}
!1159 = !DILocalVariable(name: "b", arg: 2, scope: !1152, file: !1153, line: 86, type: !1156)
!1160 = !DILocation(line: 0, scope: !1152, inlinedAt: !1161)
!1161 = distinct !DILocation(line: 313, column: 56, scope: !1145, inlinedAt: !1121)
!1162 = !DILocation(line: 90, column: 14, scope: !1152, inlinedAt: !1161)
!1163 = !{!1164, !1165, i64 0}
!1164 = !{!"stat", !1165, i64 0, !1165, i64 8, !884, i64 16, !884, i64 20, !884, i64 24, !884, i64 28, !1165, i64 32, !1165, i64 40, !1165, i64 48, !884, i64 56, !884, i64 60, !1165, i64 64, !1166, i64 72, !1166, i64 88, !1166, i64 104, !821, i64 120}
!1165 = !{!"long", !821, i64 0}
!1166 = !{!"timespec", !1165, i64 0, !1165, i64 8}
!1167 = !{!1164, !1165, i64 8}
!1168 = !DILocation(line: 313, column: 7, scope: !1078, inlinedAt: !1121)
!1169 = !DILocation(line: 316, column: 1, scope: !1078, inlinedAt: !1121)
!1170 = !DILocation(line: 0, scope: !1041)
!1171 = !DILocation(line: 364, column: 11, scope: !1041)
!1172 = !DILocation(line: 366, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !2, line: 365, column: 9)
!1174 = distinct !DILexicalBlock(scope: !1041, file: !2, line: 364, column: 11)
!1175 = !DILocation(line: 371, column: 14, scope: !1030)
!1176 = !DILocation(line: 372, column: 10, scope: !1046)
!1177 = !DILocation(line: 372, column: 7, scope: !1030)
!1178 = !DILocation(line: 374, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1046, file: !2, line: 373, column: 5)
!1180 = !DILocation(line: 375, column: 7, scope: !1179)
!1181 = !DILocation(line: 376, column: 5, scope: !1179)
!1182 = !DILocation(line: 89, column: 25, scope: !1183, inlinedAt: !1189)
!1183 = distinct !DISubprogram(name: "file_name_init", scope: !2, file: !2, line: 87, type: !1184, scopeLine: 88, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1186)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!1047}
!1186 = !{!1187, !1188}
!1187 = !DILocalVariable(name: "p", scope: !1183, file: !2, line: 89, type: !1047)
!1188 = !DILocalVariable(name: "init_alloc", scope: !1183, file: !2, line: 93, type: !83)
!1189 = distinct !DILocation(line: 379, column: 37, scope: !1045)
!1190 = !DILocation(line: 0, scope: !1183, inlinedAt: !1189)
!1191 = !DILocation(line: 94, column: 6, scope: !1183, inlinedAt: !1189)
!1192 = !DILocation(line: 94, column: 14, scope: !1183, inlinedAt: !1189)
!1193 = !{!1194, !1165, i64 8}
!1194 = !{!"file_name", !820, i64 0, !1165, i64 8, !820, i64 16}
!1195 = !DILocation(line: 96, column: 12, scope: !1183, inlinedAt: !1189)
!1196 = !DILocation(line: 96, column: 10, scope: !1183, inlinedAt: !1189)
!1197 = !{!1194, !820, i64 0}
!1198 = !DILocation(line: 97, column: 34, scope: !1183, inlinedAt: !1189)
!1199 = !DILocation(line: 97, column: 6, scope: !1183, inlinedAt: !1189)
!1200 = !DILocation(line: 97, column: 12, scope: !1183, inlinedAt: !1189)
!1201 = !{!1194, !820, i64 16}
!1202 = !DILocation(line: 98, column: 15, scope: !1183, inlinedAt: !1189)
!1203 = !DILocation(line: 0, scope: !1045)
!1204 = !DILocalVariable(name: "file_name", arg: 1, scope: !1205, file: !2, line: 262, type: !1047)
!1205 = distinct !DISubprogram(name: "robust_getcwd", scope: !2, file: !2, line: 262, type: !1206, scopeLine: 263, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !79, retainedNodes: !1208)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1047}
!1208 = !{!1204, !1209, !1210, !1219, !1221}
!1209 = !DILocalVariable(name: "height", scope: !1205, file: !2, line: 264, type: !124)
!1210 = !DILocalVariable(name: "dev_ino_buf", scope: !1205, file: !2, line: 265, type: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !1212, line: 30, size: 128, elements: !1213)
!1212 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!1213 = !{!1214, !1217}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1211, file: !1212, line: 32, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !1216, line: 47, baseType: !1091)
!1216 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1211, file: !1212, line: 33, baseType: !1218, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !1216, line: 59, baseType: !1089)
!1219 = !DILocalVariable(name: "root_dev_ino", scope: !1205, file: !2, line: 266, type: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1221 = !DILocalVariable(name: "dot_sb", scope: !1205, file: !2, line: 272, type: !1085)
!1222 = !DILocation(line: 0, scope: !1205, inlinedAt: !1223)
!1223 = distinct !DILocation(line: 380, column: 7, scope: !1045)
!1224 = !DILocation(line: 265, column: 3, scope: !1205, inlinedAt: !1223)
!1225 = !DILocation(line: 265, column: 18, scope: !1205, inlinedAt: !1223)
!1226 = !DILocation(line: 266, column: 34, scope: !1205, inlinedAt: !1223)
!1227 = !DILocation(line: 268, column: 20, scope: !1228, inlinedAt: !1223)
!1228 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 268, column: 7)
!1229 = !DILocation(line: 268, column: 7, scope: !1205, inlinedAt: !1223)
!1230 = !DILocation(line: 269, column: 5, scope: !1228, inlinedAt: !1223)
!1231 = !DILocation(line: 272, column: 3, scope: !1205, inlinedAt: !1223)
!1232 = !DILocation(line: 272, column: 15, scope: !1205, inlinedAt: !1223)
!1233 = !DILocation(line: 273, column: 7, scope: !1234, inlinedAt: !1223)
!1234 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 273, column: 7)
!1235 = !DILocation(line: 273, column: 27, scope: !1234, inlinedAt: !1223)
!1236 = !DILocation(line: 273, column: 7, scope: !1205, inlinedAt: !1223)
!1237 = !DILocation(line: 279, column: 11, scope: !1238, inlinedAt: !1223)
!1238 = distinct !DILexicalBlock(scope: !1239, file: !2, line: 279, column: 11)
!1239 = distinct !DILexicalBlock(scope: !1205, file: !2, line: 277, column: 5)
!1240 = !{!1241, !1165, i64 8}
!1241 = !{!"dev_ino", !1165, i64 0, !1165, i64 8}
!1242 = !{!1241, !1165, i64 0}
