; ModuleID = 'src/realpath.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.10 }
%union.anon.10 = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.realpath_bufs = type { %struct.scratch_buffer, %struct.scratch_buffer, %struct.scratch_buffer }
%struct.scratch_buffer = type { ptr, i64, %union.anon }
%union.anon = type { %struct.max_align_t, [992 x i8] }
%struct.max_align_t = type { i64, fp128 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.F_triple = type { ptr, i64, i64 }
%struct.hash_table = type { ptr, ptr, i64, i64, i64, ptr, ptr, ptr, ptr, ptr }
%struct.hash_entry = type { ptr, ptr }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0

!154 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !49, !51, !56, !61, !66, !71, !76, !81, !86, !91, !155, !160, !162, !167, !172, !177, !180, !182, !184, !186, !268, !273, !275, !280, !285, !290, !292, !294, !296, !298, !300, !302, !307, !312, !314, !316, !318, !320, !322, !324, !329, !331, !333, !335, !337, !339, !341, !343, !345, !350, !352, !354, !359, !364, !369, !374, !379, !381, !386, !388, !390, !392, !394, !396, !398, !400, !402, !404, !93, !406, !408, !410}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !157, isLocal: true, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 14)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !157, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !2, line: 253, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 15)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !2, line: 261, type: !169, isLocal: true, isDefinition: true)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 16)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(scope: null, file: !2, line: 273, type: !174, isLocal: true, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "logical", scope: !95, file: !2, line: 40, type: !179, isLocal: true, isDefinition: true)
!179 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "use_nuls", scope: !95, file: !2, line: 41, type: !179, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "can_relative_to", scope: !95, file: !2, line: 42, type: !151, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "can_relative_base", scope: !95, file: !2, line: 43, type: !151, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !188, file: !110, line: 575, type: !111, isLocal: true, isDefinition: true)
!188 = distinct !DISubprogram(name: "oputs_", scope: !110, file: !110, line: 573, type: !189, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !191)
!189 = !DISubroutineType(cc: DW_CC_nocall, types: !190)
!190 = !{null, !151, !151}
!191 = !{!192, !193, !194, !197, !198, !199, !200, !204, !205, !206, !207, !209, !262, !263, !264, !266, !267}
!192 = !DILocalVariable(name: "program", arg: 1, scope: !188, file: !110, line: 573, type: !151)
!193 = !DILocalVariable(name: "option", arg: 2, scope: !188, file: !110, line: 573, type: !151)
!194 = !DILocalVariable(name: "term", scope: !195, file: !110, line: 585, type: !151)
!195 = distinct !DILexicalBlock(scope: !196, file: !110, line: 582, column: 5)
!196 = distinct !DILexicalBlock(scope: !188, file: !110, line: 581, column: 7)
!197 = !DILocalVariable(name: "double_space", scope: !188, file: !110, line: 594, type: !179)
!198 = !DILocalVariable(name: "first_word", scope: !188, file: !110, line: 595, type: !151)
!199 = !DILocalVariable(name: "option_text", scope: !188, file: !110, line: 596, type: !151)
!200 = !DILocalVariable(name: "s", scope: !201, file: !110, line: 608, type: !151)
!201 = distinct !DILexicalBlock(scope: !202, file: !110, line: 605, column: 5)
!202 = distinct !DILexicalBlock(scope: !203, file: !110, line: 604, column: 12)
!203 = distinct !DILexicalBlock(scope: !188, file: !110, line: 597, column: 7)
!204 = !DILocalVariable(name: "spaces", scope: !201, file: !110, line: 609, type: !148)
!205 = !DILocalVariable(name: "anchor_len", scope: !188, file: !110, line: 620, type: !148)
!206 = !DILocalVariable(name: "desc_text", scope: !188, file: !110, line: 625, type: !151)
!207 = !DILocalVariable(name: "__ptr", scope: !208, file: !110, line: 644, type: !151)
!208 = distinct !DILexicalBlock(scope: !188, file: !110, line: 644, column: 3)
!209 = !DILocalVariable(name: "__stream", scope: !208, file: !110, line: 644, type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !212, line: 7, baseType: !213)
!212 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !214, line: 49, size: 1728, elements: !215)
!214 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !231, !233, !234, !235, !239, !240, !242, !243, !246, !248, !251, !254, !255, !256, !257, !258}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !213, file: !214, line: 51, baseType: !111, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !213, file: !214, line: 54, baseType: !145, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !213, file: !214, line: 55, baseType: !145, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !213, file: !214, line: 56, baseType: !145, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !213, file: !214, line: 57, baseType: !145, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !213, file: !214, line: 58, baseType: !145, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !213, file: !214, line: 59, baseType: !145, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !213, file: !214, line: 60, baseType: !145, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !213, file: !214, line: 61, baseType: !145, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !213, file: !214, line: 64, baseType: !145, size: 64, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !213, file: !214, line: 65, baseType: !145, size: 64, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !213, file: !214, line: 66, baseType: !145, size: 64, offset: 704)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !213, file: !214, line: 68, baseType: !229, size: 64, offset: 768)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !214, line: 36, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !213, file: !214, line: 70, baseType: !232, size: 64, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !213, file: !214, line: 72, baseType: !111, size: 32, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !213, file: !214, line: 73, baseType: !111, size: 32, offset: 928)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !213, file: !214, line: 74, baseType: !236, size: 64, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !237, line: 152, baseType: !238)
!237 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!238 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !213, file: !214, line: 77, baseType: !147, size: 16, offset: 1024)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !213, file: !214, line: 78, baseType: !241, size: 8, offset: 1040)
!241 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !213, file: !214, line: 79, baseType: !78, size: 8, offset: 1048)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !213, file: !214, line: 81, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !214, line: 43, baseType: null)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !213, file: !214, line: 89, baseType: !247, size: 64, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !237, line: 153, baseType: !238)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !213, file: !214, line: 91, baseType: !249, size: 64, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !214, line: 37, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !213, file: !214, line: 92, baseType: !252, size: 64, offset: 1280)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !214, line: 38, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !213, file: !214, line: 93, baseType: !232, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !213, file: !214, line: 94, baseType: !146, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !213, file: !214, line: 95, baseType: !148, size: 64, offset: 1472)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !213, file: !214, line: 96, baseType: !111, size: 32, offset: 1536)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !213, file: !214, line: 98, baseType: !259, size: 160, offset: 1568)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 20)
!262 = !DILocalVariable(name: "__cnt", scope: !208, file: !110, line: 644, type: !148)
!263 = !DILocalVariable(name: "url_program", scope: !188, file: !110, line: 648, type: !151)
!264 = !DILocalVariable(name: "__ptr", scope: !265, file: !110, line: 686, type: !151)
!265 = distinct !DILexicalBlock(scope: !188, file: !110, line: 686, column: 3)
!266 = !DILocalVariable(name: "__stream", scope: !265, file: !110, line: 686, type: !210)
!267 = !DILocalVariable(name: "__cnt", scope: !265, file: !110, line: 686, type: !148)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !110, line: 585, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 5)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(scope: null, file: !110, line: 586, type: !270, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !110, line: 595, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 4)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(scope: null, file: !110, line: 620, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 6)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !110, line: 648, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(scope: null, file: !110, line: 648, type: !270, isLocal: true, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(scope: null, file: !110, line: 649, type: !277, isLocal: true, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !110, line: 649, type: !174, isLocal: true, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !110, line: 650, type: !270, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !110, line: 651, type: !282, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !110, line: 651, type: !282, isLocal: true, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(scope: null, file: !110, line: 652, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 7)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(scope: null, file: !110, line: 653, type: !309, isLocal: true, isDefinition: true)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 8)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !110, line: 654, type: !83, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !110, line: 655, type: !83, isLocal: true, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(scope: null, file: !110, line: 656, type: !83, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !110, line: 657, type: !83, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(scope: null, file: !110, line: 663, type: !304, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(scope: null, file: !110, line: 664, type: !83, isLocal: true, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !110, line: 669, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 17)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !110, line: 669, type: !14, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !110, line: 676, type: !164, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !110, line: 676, type: !46, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(scope: null, file: !110, line: 679, type: !174, isLocal: true, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(scope: null, file: !110, line: 683, type: !270, isLocal: true, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !110, line: 688, type: !270, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(scope: null, file: !110, line: 691, type: !309, isLocal: true, isDefinition: true)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !110, line: 839, type: !169, isLocal: true, isDefinition: true)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !110, line: 840, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 22)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(scope: null, file: !110, line: 841, type: !164, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(scope: null, file: !110, line: 862, type: !277, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(scope: null, file: !110, line: 868, type: !356, isLocal: true, isDefinition: true)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 71)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !110, line: 875, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 27)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !110, line: 877, type: !366, isLocal: true, isDefinition: true)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 51)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(scope: null, file: !110, line: 877, type: !371, isLocal: true, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 12)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(scope: null, file: !2, line: 47, type: !376, isLocal: true, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 13)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !347, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !383, isLocal: true, isDefinition: true)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 21)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !371, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !157, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !2, line: 52, type: !282, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !282, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !371, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !2, line: 55, type: !270, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !2, line: 56, type: !309, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 57, type: !19, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !270, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(scope: null, file: !2, line: 59, type: !309, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "verbose", scope: !95, file: !2, line: 39, type: !179, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !164, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(scope: null, file: !110, line: 952, type: !371, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 3584, elements: !158)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !415, line: 50, size: 256, elements: !416)
!415 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!416 = !{!417, !418, !419, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !415, line: 52, baseType: !151, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !414, file: !415, line: 55, baseType: !111, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !414, file: !415, line: 56, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !414, file: !415, line: 57, baseType: !111, size: 32, offset: 192)
!422 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!423 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!424 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !427, line: 110, type: !174, isLocal: true, isDefinition: true)
!427 = !DIFile(filename: "src/relpath.c", directory: "/src", checksumkind: CSK_MD5, checksum: "16c7701de380a03fd2bfbb50611956cf")
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(scope: null, file: !427, line: 114, type: !277, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(scope: null, file: !427, line: 119, type: !287, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(scope: null, file: !427, line: 125, type: !287, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !427, line: 130, type: !174, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !427, line: 130, type: !438, isLocal: true, isDefinition: true)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 25)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !443, line: 3, type: !164, isLocal: true, isDefinition: true)
!443 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "Version", scope: !446, file: !443, line: 3, type: !151, isLocal: false, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C11, file: !443, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !447, splitDebugInlining: false, nameTableKind: None)
!447 = !{!441, !444}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !450, line: 360, type: !287, isLocal: true, isDefinition: true)
!450 = !DIFile(filename: "lib/canonicalize.c", directory: "/src", checksumkind: CSK_MD5, checksum: "1ce9029b4559118b8c2b5e36c9cdad07")
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !450, line: 436, type: !287, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "file_name", scope: !455, file: !456, line: 45, type: !151, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C11, file: !456, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !457, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!457 = !{!458, !460, !462, !464, !453, !466}
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !456, line: 121, type: !304, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !456, line: 121, type: !371, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(scope: null, file: !456, line: 123, type: !304, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(scope: null, file: !456, line: 126, type: !174, isLocal: true, isDefinition: true)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !455, file: !456, line: 55, type: !179, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !470, file: !471, line: 66, type: !519, isLocal: false, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C11, file: !471, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !472, globals: !473, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!472 = !{!146, !153}
!473 = !{!474, !476, !501, !503, !505, !507, !468, !509, !511, !513, !515, !517}
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(scope: null, file: !471, line: 272, type: !270, isLocal: true, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "old_file_name", scope: !478, file: !471, line: 304, type: !151, isLocal: true, isDefinition: true)
!478 = distinct !DISubprogram(name: "verror_at_line", scope: !471, file: !471, line: 298, type: !479, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !470, retainedNodes: !494)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !111, !111, !151, !99, !151, !481}
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !482, line: 52, baseType: !483)
!482 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !484, line: 14, baseType: !485)
!484 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !486, baseType: !487)
!486 = !DIFile(filename: "lib/error.c", directory: "/src")
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !488)
!488 = !{!489, !490, !491, !492, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !487, file: !486, baseType: !146, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !487, file: !486, baseType: !146, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !487, file: !486, baseType: !146, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !487, file: !486, baseType: !111, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !487, file: !486, baseType: !111, size: 32, offset: 224)
!494 = !{!495, !496, !497, !498, !499, !500}
!495 = !DILocalVariable(name: "status", arg: 1, scope: !478, file: !471, line: 298, type: !111)
!496 = !DILocalVariable(name: "errnum", arg: 2, scope: !478, file: !471, line: 298, type: !111)
!497 = !DILocalVariable(name: "file_name", arg: 3, scope: !478, file: !471, line: 298, type: !151)
!498 = !DILocalVariable(name: "line_number", arg: 4, scope: !478, file: !471, line: 298, type: !99)
!499 = !DILocalVariable(name: "message", arg: 5, scope: !478, file: !471, line: 298, type: !151)
!500 = !DILocalVariable(name: "args", arg: 6, scope: !478, file: !471, line: 298, type: !481)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "old_line_number", scope: !478, file: !471, line: 305, type: !99, isLocal: true, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(scope: null, file: !471, line: 338, type: !277, isLocal: true, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(scope: null, file: !471, line: 346, type: !309, isLocal: true, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !471, line: 346, type: !287, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "error_message_count", scope: !470, file: !471, line: 69, type: !99, isLocal: false, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !470, file: !471, line: 295, type: !111, isLocal: false, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(scope: null, file: !471, line: 208, type: !304, isLocal: true, isDefinition: true)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(scope: null, file: !471, line: 208, type: !383, isLocal: true, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(scope: null, file: !471, line: 214, type: !270, isLocal: true, isDefinition: true)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null}
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !524, line: 226, type: !88, isLocal: true, isDefinition: true)
!524 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(scope: null, file: !524, line: 227, type: !88, isLocal: true, isDefinition: true)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(scope: null, file: !524, line: 228, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 33)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !524, line: 231, type: !88, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "default_tuning", scope: !536, file: !524, line: 134, type: !540, isLocal: true, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C11, file: !524, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !537, globals: !539, splitDebugInlining: false, nameTableKind: None)
!537 = !{!150, !146, !538, !148}
!538 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!539 = !{!522, !525, !527, !532, !534}
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !542, line: 52, baseType: !543)
!542 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !542, line: 40, size: 160, elements: !544)
!544 = !{!545, !546, !547, !548, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !543, file: !542, line: 45, baseType: !538, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !543, file: !542, line: 46, baseType: !538, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !543, file: !542, line: 47, baseType: !538, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !543, file: !542, line: 48, baseType: !538, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !543, file: !542, line: 49, baseType: !179, size: 8, offset: 128)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "program_name", scope: !552, file: !553, line: 31, type: !151, isLocal: false, isDefinition: true)
!552 = distinct !DICompileUnit(language: DW_LANG_C11, file: !553, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !554, globals: !555, splitDebugInlining: false, nameTableKind: None)
!553 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!554 = !{!145}
!555 = !{!550, !556, !558}
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !553, line: 46, type: !309, isLocal: true, isDefinition: true)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(scope: null, file: !553, line: 49, type: !277, isLocal: true, isDefinition: true)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "utf07FF", scope: !562, file: !563, line: 46, type: !590, isLocal: true, isDefinition: true)
!562 = distinct !DISubprogram(name: "proper_name_lite", scope: !563, file: !563, line: 38, type: !564, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !566, retainedNodes: !568)
!563 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!564 = !DISubroutineType(types: !565)
!565 = !{!151, !151, !151}
!566 = distinct !DICompileUnit(language: DW_LANG_C11, file: !563, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !567, splitDebugInlining: false, nameTableKind: None)
!567 = !{!560}
!568 = !{!569, !570, !571, !572, !577}
!569 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !562, file: !563, line: 38, type: !151)
!570 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !562, file: !563, line: 38, type: !151)
!571 = !DILocalVariable(name: "translation", scope: !562, file: !563, line: 40, type: !151)
!572 = !DILocalVariable(name: "w", scope: !562, file: !563, line: 47, type: !573)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !574, line: 37, baseType: !575)
!574 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !237, line: 57, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !237, line: 42, baseType: !99)
!577 = !DILocalVariable(name: "mbs", scope: !562, file: !563, line: 48, type: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !579, line: 6, baseType: !580)
!579 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !581, line: 21, baseType: !582)
!581 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 13, size: 64, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !582, file: !581, line: 15, baseType: !111, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !582, file: !581, line: 20, baseType: !586, size: 32, offset: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !582, file: !581, line: 16, size: 32, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !586, file: !581, line: 18, baseType: !99, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !586, file: !581, line: 19, baseType: !277, size: 32)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 16, elements: !288)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !593, line: 78, type: !309, isLocal: true, isDefinition: true)
!593 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(scope: null, file: !593, line: 79, type: !282, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(scope: null, file: !593, line: 80, type: !376, isLocal: true, isDefinition: true)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(scope: null, file: !593, line: 81, type: !376, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !593, line: 82, type: !259, isLocal: true, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(scope: null, file: !593, line: 83, type: !287, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(scope: null, file: !593, line: 84, type: !309, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !593, line: 85, type: !304, isLocal: true, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(scope: null, file: !593, line: 86, type: !304, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !593, line: 87, type: !309, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !614, file: !593, line: 76, type: !686, isLocal: false, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C11, file: !593, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !615, retainedTypes: !621, globals: !622, splitDebugInlining: false, nameTableKind: None)
!615 = !{!115, !616, !129}
!616 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !116, line: 254, baseType: !99, size: 32, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!619 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!620 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!621 = !{!111, !147, !148}
!622 = !{!591, !594, !596, !598, !600, !602, !604, !606, !608, !610, !612, !623, !627, !637, !639, !644, !646, !648, !650, !652, !675, !682, !684}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !614, file: !593, line: 92, type: !625, isLocal: false, isDefinition: true)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 320, elements: !84)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !614, file: !593, line: 1040, type: !629, isLocal: false, isDefinition: true)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !593, line: 56, size: 448, elements: !630)
!630 = !{!631, !632, !633, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !629, file: !593, line: 59, baseType: !115, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !629, file: !593, line: 62, baseType: !111, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !629, file: !593, line: 66, baseType: !634, size: 256, offset: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !310)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !629, file: !593, line: 69, baseType: !151, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !629, file: !593, line: 72, baseType: !151, size: 64, offset: 384)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !614, file: !593, line: 107, type: !629, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "slot0", scope: !614, file: !593, line: 831, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 256)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !593, line: 321, type: !287, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(scope: null, file: !593, line: 357, type: !287, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(scope: null, file: !593, line: 358, type: !287, isLocal: true, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !593, line: 199, type: !304, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "quote", scope: !654, file: !593, line: 228, type: !673, isLocal: true, isDefinition: true)
!654 = distinct !DISubprogram(name: "gettext_quote", scope: !593, file: !593, line: 197, type: !655, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !657)
!655 = !DISubroutineType(types: !656)
!656 = !{!151, !151, !115}
!657 = !{!658, !659, !660, !661, !662}
!658 = !DILocalVariable(name: "msgid", arg: 1, scope: !654, file: !593, line: 197, type: !151)
!659 = !DILocalVariable(name: "s", arg: 2, scope: !654, file: !593, line: 197, type: !115)
!660 = !DILocalVariable(name: "translation", scope: !654, file: !593, line: 199, type: !151)
!661 = !DILocalVariable(name: "w", scope: !654, file: !593, line: 229, type: !573)
!662 = !DILocalVariable(name: "mbs", scope: !654, file: !593, line: 230, type: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !579, line: 6, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !581, line: 21, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 13, size: 64, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !665, file: !581, line: 15, baseType: !111, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !665, file: !581, line: 20, baseType: !669, size: 32, offset: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !665, file: !581, line: 16, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !669, file: !581, line: 18, baseType: !99, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !669, file: !581, line: 19, baseType: !277, size: 32)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !674)
!674 = !{!289, !279}
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "slotvec", scope: !614, file: !593, line: 834, type: !677, isLocal: true, isDefinition: true)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !593, line: 823, size: 128, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !678, file: !593, line: 825, baseType: !148, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !678, file: !593, line: 826, baseType: !145, size: 64, offset: 64)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "nslots", scope: !614, file: !593, line: 832, type: !111, isLocal: true, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "slotvec0", scope: !614, file: !593, line: 833, type: !678, isLocal: true, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 704, elements: !688)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!688 = !{!689}
!689 = !DISubrange(count: 11)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !692, line: 67, type: !371, isLocal: true, isDefinition: true)
!692 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !692, line: 69, type: !304, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !692, line: 83, type: !304, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(scope: null, file: !692, line: 83, type: !277, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !692, line: 85, type: !287, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !692, line: 88, type: !703, isLocal: true, isDefinition: true)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 171)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(scope: null, file: !692, line: 88, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 34)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(scope: null, file: !692, line: 105, type: !169, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(scope: null, file: !692, line: 109, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 23)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !692, line: 113, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 28)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !692, line: 120, type: !725, isLocal: true, isDefinition: true)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 32)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !692, line: 127, type: !730, isLocal: true, isDefinition: true)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 36)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(scope: null, file: !692, line: 134, type: !14, isLocal: true, isDefinition: true)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(scope: null, file: !692, line: 142, type: !737, isLocal: true, isDefinition: true)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 44)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(scope: null, file: !692, line: 150, type: !742, isLocal: true, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 48)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(scope: null, file: !692, line: 159, type: !747, isLocal: true, isDefinition: true)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 52)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(scope: null, file: !692, line: 170, type: !752, isLocal: true, isDefinition: true)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 60)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(scope: null, file: !692, line: 248, type: !259, isLocal: true, isDefinition: true)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(scope: null, file: !692, line: 248, type: !347, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !692, line: 254, type: !259, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !692, line: 254, type: !157, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !692, line: 254, type: !14, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(scope: null, file: !692, line: 259, type: !3, isLocal: true, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !692, line: 259, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 29)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !774, file: !775, line: 26, type: !777, isLocal: false, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C11, file: !775, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !776, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!776 = !{!772}
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 376, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 47)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "exit_failure", scope: !782, file: !783, line: 24, type: !785, isLocal: false, isDefinition: true)
!782 = distinct !DICompileUnit(language: DW_LANG_C11, file: !783, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !784, splitDebugInlining: false, nameTableKind: None)
!783 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!784 = !{!780}
!785 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !174, isLocal: true, isDefinition: true)
!788 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !304, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(scope: null, file: !788, line: 34, type: !326, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(scope: null, file: !795, line: 108, type: !78, isLocal: true, isDefinition: true)
!795 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "internal_state", scope: !798, file: !795, line: 97, type: !801, isLocal: true, isDefinition: true)
!798 = distinct !DICompileUnit(language: DW_LANG_C11, file: !795, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !799, globals: !800, splitDebugInlining: false, nameTableKind: None)
!799 = !{!146, !148, !153}
!800 = !{!793, !796}
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !579, line: 6, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !581, line: 21, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 13, size: 64, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !803, file: !581, line: 15, baseType: !111, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !803, file: !581, line: 20, baseType: !807, size: 32, offset: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !581, line: 16, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !807, file: !581, line: 18, baseType: !99, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !807, file: !581, line: 19, baseType: !277, size: 32)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(scope: null, file: !813, line: 35, type: !287, isLocal: true, isDefinition: true)
!813 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(scope: null, file: !813, line: 35, type: !282, isLocal: true, isDefinition: true)
!816 = distinct !DICompileUnit(language: DW_LANG_C11, file: !427, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !817, splitDebugInlining: false, nameTableKind: None)
!817 = !{!425, !428, !430, !432, !434, !436}
!818 = distinct !DICompileUnit(language: DW_LANG_C11, file: !450, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !819, retainedTypes: !820, globals: !821, splitDebugInlining: false, nameTableKind: None)
!819 = !{!97}
!820 = !{!146}
!821 = !{!448, !451, !822}
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "dir_suffix", scope: !818, file: !450, line: 110, type: !590, isLocal: true, isDefinition: true)
!824 = distinct !DICompileUnit(language: DW_LANG_C11, file: !825, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !826, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "lib/file-set.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3d320575da71636c49afc307306f1ac8")
!826 = !{!146, !145}
!827 = distinct !DICompileUnit(language: DW_LANG_C11, file: !828, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!829 = distinct !DICompileUnit(language: DW_LANG_C11, file: !830, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!830 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!831 = distinct !DICompileUnit(language: DW_LANG_C11, file: !832, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "lib/malloc/scratch_buffer_grow.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fba9c701dee3b47e5d1bcebea676b381")
!833 = distinct !DICompileUnit(language: DW_LANG_C11, file: !834, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "lib/malloc/scratch_buffer_grow_preserve.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d5c2d2ce24447f49ca86e9062884c18e")
!835 = distinct !DICompileUnit(language: DW_LANG_C11, file: !836, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "lib/hashcode-named-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8b790eeaa7481543bca54c360cbd0d96")
!837 = distinct !DICompileUnit(language: DW_LANG_C11, file: !838, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "lib/hashcode-string2.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bb7d3d21b3889da1083126079aac0c8f")
!839 = distinct !DICompileUnit(language: DW_LANG_C11, file: !840, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "lib/next-prime.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9e10a95d0a1244096fa4fe5ba361f714")
!841 = distinct !DICompileUnit(language: DW_LANG_C11, file: !692, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !820, globals: !846, splitDebugInlining: false, nameTableKind: None)
!842 = !{!843}
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !692, line: 40, baseType: !99, size: 32, elements: !844)
!844 = !{!845}
!845 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!846 = !{!690, !693, !695, !697, !699, !701, !706, !711, !713, !718, !723, !728, !733, !735, !740, !745, !750, !755, !757, !759, !761, !763, !765, !767}
!847 = distinct !DICompileUnit(language: DW_LANG_C11, file: !848, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !849, retainedTypes: !880, splitDebugInlining: false, nameTableKind: None)
!848 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!849 = !{!850, !862}
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !851, file: !848, line: 188, baseType: !99, size: 32, elements: !860)
!851 = distinct !DISubprogram(name: "x2nrealloc", scope: !848, file: !848, line: 176, type: !852, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !855)
!852 = !DISubroutineType(types: !853)
!853 = !{!146, !146, !854, !148}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!855 = !{!856, !857, !858, !859}
!856 = !DILocalVariable(name: "p", arg: 1, scope: !851, file: !848, line: 176, type: !146)
!857 = !DILocalVariable(name: "pn", arg: 2, scope: !851, file: !848, line: 176, type: !854)
!858 = !DILocalVariable(name: "s", arg: 3, scope: !851, file: !848, line: 176, type: !148)
!859 = !DILocalVariable(name: "n", scope: !851, file: !848, line: 178, type: !148)
!860 = !{!861}
!861 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !863, file: !848, line: 228, baseType: !99, size: 32, elements: !860)
!863 = distinct !DISubprogram(name: "xpalloc", scope: !848, file: !848, line: 223, type: !864, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !847, retainedNodes: !870)
!864 = !DISubroutineType(types: !865)
!865 = !{!146, !146, !866, !867, !869, !867}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !868, line: 130, baseType: !869)
!868 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !149, line: 35, baseType: !238)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879}
!871 = !DILocalVariable(name: "pa", arg: 1, scope: !863, file: !848, line: 223, type: !146)
!872 = !DILocalVariable(name: "pn", arg: 2, scope: !863, file: !848, line: 223, type: !866)
!873 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !863, file: !848, line: 223, type: !867)
!874 = !DILocalVariable(name: "n_max", arg: 4, scope: !863, file: !848, line: 223, type: !869)
!875 = !DILocalVariable(name: "s", arg: 5, scope: !863, file: !848, line: 223, type: !867)
!876 = !DILocalVariable(name: "n0", scope: !863, file: !848, line: 230, type: !867)
!877 = !DILocalVariable(name: "n", scope: !863, file: !848, line: 237, type: !867)
!878 = !DILocalVariable(name: "nbytes", scope: !863, file: !848, line: 248, type: !867)
!879 = !DILocalVariable(name: "adjusted_nbytes", scope: !863, file: !848, line: 252, type: !867)
!880 = !{!145, !146, !179, !238, !150}
!881 = distinct !DICompileUnit(language: DW_LANG_C11, file: !788, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !882, splitDebugInlining: false, nameTableKind: None)
!882 = !{!786, !789, !791}
!883 = distinct !DICompileUnit(language: DW_LANG_C11, file: !884, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!884 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!885 = distinct !DICompileUnit(language: DW_LANG_C11, file: !886, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!887 = distinct !DICompileUnit(language: DW_LANG_C11, file: !888, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!888 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!889 = distinct !DICompileUnit(language: DW_LANG_C11, file: !890, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!891 = distinct !DICompileUnit(language: DW_LANG_C11, file: !892, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !893, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!893 = !{!179, !150, !146}
!894 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !895, splitDebugInlining: false, nameTableKind: None)
!895 = !{!811, !814}
!896 = distinct !DICompileUnit(language: DW_LANG_C11, file: !897, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!898 = distinct !DICompileUnit(language: DW_LANG_C11, file: !899, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !820, splitDebugInlining: false, nameTableKind: None)
!899 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!900 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!901 = !{i32 7, !"Dwarf Version", i32 5}
!902 = !{i32 2, !"Debug Info Version", i32 3}
!903 = !{i32 1, !"wchar_size", i32 4}
!904 = !{i32 8, !"PIC Level", i32 2}
!905 = !{i32 7, !"PIE Level", i32 2}
!906 = !{i32 7, !"uwtable", i32 2}
!907 = !{i32 7, !"frame-pointer", i32 1}
!908 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 64, type: !909, scopeLine: 65, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !111}
!911 = !{!912}
!912 = !DILocalVariable(name: "status", arg: 1, scope: !908, file: !2, line: 64, type: !111)
!913 = !DILocation(line: 0, scope: !908)
!914 = !DILocation(line: 66, column: 14, scope: !915)
!915 = distinct !DILexicalBlock(scope: !908, file: !2, line: 66, column: 7)
!916 = !DILocation(line: 66, column: 7, scope: !908)
!917 = !DILocation(line: 67, column: 5, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !2, line: 67, column: 5)
!919 = !{!920, !920, i64 0}
!920 = !{!"any pointer", !921, i64 0}
!921 = !{!"omnipotent char", !922, i64 0}
!922 = !{!"Simple C/C++ TBAA"}
!923 = !DILocation(line: 70, column: 7, scope: !924)
!924 = distinct !DILexicalBlock(scope: !915, file: !2, line: 69, column: 5)
!925 = !DILocation(line: 71, column: 7, scope: !924)
!926 = !DILocation(line: 74, column: 7, scope: !924)
!927 = !DILocation(line: 78, column: 7, scope: !924)
!928 = !DILocation(line: 81, column: 7, scope: !924)
!929 = !DILocation(line: 85, column: 7, scope: !924)
!930 = !DILocation(line: 88, column: 7, scope: !924)
!931 = !DILocation(line: 91, column: 7, scope: !924)
!932 = !DILocation(line: 94, column: 7, scope: !924)
!933 = !DILocation(line: 97, column: 7, scope: !924)
!934 = !DILocation(line: 100, column: 7, scope: !924)
!935 = !DILocation(line: 103, column: 7, scope: !924)
!936 = !DILocation(line: 106, column: 7, scope: !924)
!937 = !DILocation(line: 107, column: 7, scope: !924)
!938 = !DILocalVariable(name: "program", arg: 1, scope: !939, file: !110, line: 836, type: !151)
!939 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !110, file: !110, line: 836, type: !940, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !942)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !151}
!942 = !{!938, !943, !950, !951, !953, !954}
!943 = !DILocalVariable(name: "infomap", scope: !939, file: !110, line: 838, type: !944)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 896, elements: !305)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !939, file: !110, line: 838, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !946, file: !110, line: 838, baseType: !151, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !946, file: !110, line: 838, baseType: !151, size: 64, offset: 64)
!950 = !DILocalVariable(name: "node", scope: !939, file: !110, line: 848, type: !151)
!951 = !DILocalVariable(name: "map_prog", scope: !939, file: !110, line: 849, type: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!953 = !DILocalVariable(name: "lc_messages", scope: !939, file: !110, line: 861, type: !151)
!954 = !DILocalVariable(name: "url_program", scope: !939, file: !110, line: 874, type: !151)
!955 = !DILocation(line: 0, scope: !939, inlinedAt: !956)
!956 = distinct !DILocation(line: 108, column: 7, scope: !924)
!957 = !DILocation(line: 857, column: 3, scope: !939, inlinedAt: !956)
!958 = !DILocation(line: 861, column: 29, scope: !939, inlinedAt: !956)
!959 = !DILocation(line: 862, column: 7, scope: !960, inlinedAt: !956)
!960 = distinct !DILexicalBlock(scope: !939, file: !110, line: 862, column: 7)
!961 = !DILocation(line: 862, column: 19, scope: !960, inlinedAt: !956)
!962 = !DILocation(line: 862, column: 22, scope: !960, inlinedAt: !956)
!963 = !DILocation(line: 862, column: 7, scope: !939, inlinedAt: !956)
!964 = !DILocation(line: 868, column: 7, scope: !965, inlinedAt: !956)
!965 = distinct !DILexicalBlock(scope: !960, file: !110, line: 863, column: 5)
!966 = !DILocation(line: 870, column: 5, scope: !965, inlinedAt: !956)
!967 = !DILocation(line: 875, column: 3, scope: !939, inlinedAt: !956)
!968 = !DILocation(line: 877, column: 3, scope: !939, inlinedAt: !956)
!969 = !DILocation(line: 110, column: 3, scope: !908)
!970 = !DISubprogram(name: "dcgettext", scope: !971, file: !971, line: 51, type: !972, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!971 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!972 = !DISubroutineType(types: !973)
!973 = !{!145, !151, !151, !111}
!974 = !{}
!975 = !DISubprogram(name: "__fprintf_chk", scope: !976, file: !976, line: 93, type: !977, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!976 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!977 = !DISubroutineType(types: !978)
!978 = !{!111, !979, !111, !980, null}
!979 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !210)
!980 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!981 = !DISubprogram(name: "__printf_chk", scope: !976, file: !976, line: 95, type: !982, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!982 = !DISubroutineType(types: !983)
!983 = !{!111, !111, !980, null}
!984 = !DISubprogram(name: "fputs_unlocked", scope: !482, file: !482, line: 691, type: !985, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!985 = !DISubroutineType(types: !986)
!986 = !{!111, !980, !979}
!987 = !DILocation(line: 0, scope: !188)
!988 = !DILocation(line: 581, column: 7, scope: !196)
!989 = !{!990, !990, i64 0}
!990 = !{!"int", !921, i64 0}
!991 = !DILocation(line: 581, column: 19, scope: !196)
!992 = !DILocation(line: 581, column: 7, scope: !188)
!993 = !DILocation(line: 585, column: 26, scope: !195)
!994 = !DILocation(line: 0, scope: !195)
!995 = !DILocation(line: 586, column: 23, scope: !195)
!996 = !DILocation(line: 586, column: 28, scope: !195)
!997 = !DILocation(line: 586, column: 32, scope: !195)
!998 = !{!921, !921, i64 0}
!999 = !DILocation(line: 586, column: 38, scope: !195)
!1000 = !DILocalVariable(name: "__s1", arg: 1, scope: !1001, file: !1002, line: 1359, type: !151)
!1001 = distinct !DISubprogram(name: "streq", scope: !1002, file: !1002, line: 1359, type: !1003, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1005)
!1002 = !DIFile(filename: "./lib/string.h", directory: "/src")
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!179, !151, !151}
!1005 = !{!1000, !1006}
!1006 = !DILocalVariable(name: "__s2", arg: 2, scope: !1001, file: !1002, line: 1359, type: !151)
!1007 = !DILocation(line: 0, scope: !1001, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 586, column: 41, scope: !195)
!1009 = !DILocation(line: 1361, column: 11, scope: !1001, inlinedAt: !1008)
!1010 = !DILocation(line: 1361, column: 10, scope: !1001, inlinedAt: !1008)
!1011 = !DILocation(line: 586, column: 19, scope: !195)
!1012 = !DILocation(line: 587, column: 5, scope: !195)
!1013 = !DILocation(line: 588, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !188, file: !110, line: 588, column: 7)
!1015 = !DILocation(line: 588, column: 7, scope: !188)
!1016 = !DILocation(line: 590, column: 7, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !110, line: 589, column: 5)
!1018 = !DILocation(line: 591, column: 7, scope: !1017)
!1019 = !DILocation(line: 595, column: 37, scope: !188)
!1020 = !DILocation(line: 595, column: 35, scope: !188)
!1021 = !DILocation(line: 596, column: 29, scope: !188)
!1022 = !DILocation(line: 597, column: 8, scope: !203)
!1023 = !DILocation(line: 597, column: 7, scope: !188)
!1024 = !DILocation(line: 604, column: 24, scope: !202)
!1025 = !DILocation(line: 604, column: 12, scope: !203)
!1026 = !DILocation(line: 0, scope: !201)
!1027 = !DILocation(line: 610, column: 16, scope: !201)
!1028 = !DILocation(line: 610, column: 7, scope: !201)
!1029 = !DILocation(line: 611, column: 21, scope: !201)
!1030 = !{!1031, !1031, i64 0}
!1031 = !{!"short", !921, i64 0}
!1032 = !DILocation(line: 611, column: 19, scope: !201)
!1033 = !DILocation(line: 611, column: 16, scope: !201)
!1034 = !DILocation(line: 610, column: 30, scope: !201)
!1035 = distinct !{!1035, !1028, !1029, !1036}
!1036 = !{!"llvm.loop.mustprogress"}
!1037 = !DILocation(line: 612, column: 18, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !201, file: !110, line: 612, column: 11)
!1039 = !DILocation(line: 612, column: 11, scope: !201)
!1040 = !DILocation(line: 620, column: 23, scope: !188)
!1041 = !DILocation(line: 625, column: 39, scope: !188)
!1042 = !DILocation(line: 626, column: 3, scope: !188)
!1043 = !DILocation(line: 626, column: 10, scope: !188)
!1044 = !DILocation(line: 626, column: 21, scope: !188)
!1045 = !DILocation(line: 628, column: 44, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !110, line: 628, column: 11)
!1047 = distinct !DILexicalBlock(scope: !188, file: !110, line: 627, column: 5)
!1048 = !DILocation(line: 628, column: 32, scope: !1046)
!1049 = !DILocation(line: 628, column: 49, scope: !1046)
!1050 = !DILocation(line: 628, column: 11, scope: !1047)
!1051 = !DILocation(line: 630, column: 11, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !110, line: 630, column: 11)
!1053 = !DILocation(line: 630, column: 11, scope: !1047)
!1054 = !DILocation(line: 632, column: 26, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !110, line: 632, column: 15)
!1056 = distinct !DILexicalBlock(scope: !1052, file: !110, line: 631, column: 9)
!1057 = !DILocation(line: 632, column: 34, scope: !1055)
!1058 = !DILocation(line: 632, column: 37, scope: !1055)
!1059 = !DILocation(line: 632, column: 15, scope: !1056)
!1060 = !DILocation(line: 640, column: 16, scope: !1047)
!1061 = distinct !{!1061, !1042, !1062, !1036}
!1062 = !DILocation(line: 641, column: 5, scope: !188)
!1063 = !DILocation(line: 644, column: 3, scope: !188)
!1064 = !DILocation(line: 0, scope: !1001, inlinedAt: !1065)
!1065 = distinct !DILocation(line: 648, column: 31, scope: !188)
!1066 = !DILocation(line: 0, scope: !1001, inlinedAt: !1067)
!1067 = distinct !DILocation(line: 649, column: 31, scope: !188)
!1068 = !DILocation(line: 0, scope: !1001, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 650, column: 31, scope: !188)
!1070 = !DILocation(line: 0, scope: !1001, inlinedAt: !1071)
!1071 = distinct !DILocation(line: 651, column: 31, scope: !188)
!1072 = !DILocation(line: 0, scope: !1001, inlinedAt: !1073)
!1073 = distinct !DILocation(line: 652, column: 31, scope: !188)
!1074 = !DILocation(line: 0, scope: !1001, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 653, column: 31, scope: !188)
!1076 = !DILocation(line: 0, scope: !1001, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 654, column: 31, scope: !188)
!1078 = !DILocation(line: 0, scope: !1001, inlinedAt: !1079)
!1079 = distinct !DILocation(line: 655, column: 31, scope: !188)
!1080 = !DILocation(line: 0, scope: !1001, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 656, column: 31, scope: !188)
!1082 = !DILocation(line: 0, scope: !1001, inlinedAt: !1083)
!1083 = distinct !DILocation(line: 657, column: 31, scope: !188)
!1084 = !DILocation(line: 663, column: 7, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !188, file: !110, line: 663, column: 7)
!1086 = !DILocation(line: 664, column: 7, scope: !1085)
!1087 = !DILocation(line: 664, column: 10, scope: !1085)
!1088 = !DILocation(line: 663, column: 7, scope: !188)
!1089 = !DILocation(line: 669, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !110, line: 665, column: 5)
!1091 = !DILocation(line: 671, column: 5, scope: !1090)
!1092 = !DILocation(line: 676, column: 7, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1085, file: !110, line: 673, column: 5)
!1094 = !DILocation(line: 679, column: 3, scope: !188)
!1095 = !DILocation(line: 683, column: 3, scope: !188)
!1096 = !DILocation(line: 686, column: 3, scope: !188)
!1097 = !DILocation(line: 688, column: 3, scope: !188)
!1098 = !DILocation(line: 691, column: 3, scope: !188)
!1099 = !DILocation(line: 695, column: 3, scope: !188)
!1100 = !DILocation(line: 696, column: 1, scope: !188)
!1101 = !DISubprogram(name: "setlocale", scope: !1102, file: !1102, line: 122, type: !1103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1102 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!145, !111, !151}
!1105 = !DISubprogram(name: "strncmp", scope: !1106, file: !1106, line: 159, type: !1107, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1106 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!111, !151, !151, !148}
!1109 = !DISubprogram(name: "exit", scope: !1110, file: !1110, line: 624, type: !909, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1110 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!1111 = !DISubprogram(name: "getenv", scope: !1110, file: !1110, line: 641, type: !1112, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!145, !151}
!1114 = !DISubprogram(name: "strcmp", scope: !1106, file: !1106, line: 156, type: !1115, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!111, !151, !151}
!1117 = !DISubprogram(name: "strspn", scope: !1106, file: !1106, line: 297, type: !1118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!150, !151, !151}
!1120 = !DISubprogram(name: "strchr", scope: !1106, file: !1106, line: 246, type: !1121, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!145, !151, !111}
!1123 = !DISubprogram(name: "__ctype_b_loc", scope: !130, file: !130, line: 79, type: !1124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!1129 = !DISubprogram(name: "strcspn", scope: !1106, file: !1106, line: 293, type: !1118, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1130 = !DISubprogram(name: "fwrite_unlocked", scope: !482, file: !482, line: 704, type: !1131, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !974)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!148, !1133, !148, !148, !979}
!1133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1136 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 194, type: !1137, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1140)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!111, !111, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1150}
!1141 = !DILocalVariable(name: "argc", arg: 1, scope: !1136, file: !2, line: 194, type: !111)
!1142 = !DILocalVariable(name: "argv", arg: 2, scope: !1136, file: !2, line: 194, type: !1139)
!1143 = !DILocalVariable(name: "ok", scope: !1136, file: !2, line: 196, type: !179)
!1144 = !DILocalVariable(name: "can_mode", scope: !1136, file: !2, line: 197, type: !111)
!1145 = !DILocalVariable(name: "relative_to", scope: !1136, file: !2, line: 198, type: !151)
!1146 = !DILocalVariable(name: "relative_base", scope: !1136, file: !2, line: 199, type: !151)
!1147 = !DILocalVariable(name: "c", scope: !1148, file: !2, line: 211, type: !111)
!1148 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 210, column: 5)
!1149 = !DILocalVariable(name: "need_dir", scope: !1136, file: !2, line: 268, type: !179)
!1150 = !DILocalVariable(name: "base", scope: !1151, file: !2, line: 281, type: !145)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !2, line: 280, column: 5)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !2, line: 279, column: 12)
!1153 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 277, column: 7)
!1154 = !DILocation(line: 0, scope: !1136)
!1155 = !DILocation(line: 202, column: 21, scope: !1136)
!1156 = !DILocation(line: 202, column: 3, scope: !1136)
!1157 = !DILocation(line: 203, column: 3, scope: !1136)
!1158 = !DILocation(line: 204, column: 3, scope: !1136)
!1159 = !DILocation(line: 205, column: 3, scope: !1136)
!1160 = !DILocation(line: 207, column: 3, scope: !1136)
!1161 = !DILocation(line: 209, column: 3, scope: !1136)
!1162 = !DILocation(line: 198, column: 15, scope: !1136)
!1163 = !DILocation(line: 199, column: 15, scope: !1136)
!1164 = !DILocation(line: 197, column: 7, scope: !1136)
!1165 = !DILocation(line: 211, column: 15, scope: !1148)
!1166 = !DILocation(line: 0, scope: !1148)
!1167 = !DILocation(line: 212, column: 11, scope: !1148)
!1168 = !DILocation(line: 217, column: 20, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1148, file: !2, line: 215, column: 9)
!1170 = !DILocation(line: 218, column: 20, scope: !1169)
!1171 = !DILocation(line: 219, column: 11, scope: !1169)
!1172 = !DILocation(line: 221, column: 20, scope: !1169)
!1173 = !DILocation(line: 223, column: 11, scope: !1169)
!1174 = !DILocation(line: 225, column: 20, scope: !1169)
!1175 = !DILocation(line: 226, column: 20, scope: !1169)
!1176 = !DILocation(line: 227, column: 11, scope: !1169)
!1177 = !DILocation(line: 229, column: 20, scope: !1169)
!1178 = !DILocation(line: 230, column: 19, scope: !1169)
!1179 = !DILocation(line: 231, column: 11, scope: !1169)
!1180 = !DILocation(line: 233, column: 20, scope: !1169)
!1181 = !DILocation(line: 234, column: 19, scope: !1169)
!1182 = !DILocation(line: 235, column: 11, scope: !1169)
!1183 = !DILocation(line: 237, column: 20, scope: !1169)
!1184 = !DILocation(line: 238, column: 19, scope: !1169)
!1185 = !DILocation(line: 239, column: 11, scope: !1169)
!1186 = !DILocation(line: 241, column: 19, scope: !1169)
!1187 = !DILocation(line: 242, column: 11, scope: !1169)
!1188 = !DILocation(line: 244, column: 20, scope: !1169)
!1189 = !DILocation(line: 245, column: 11, scope: !1169)
!1190 = !DILocation(line: 247, column: 25, scope: !1169)
!1191 = !DILocation(line: 248, column: 11, scope: !1169)
!1192 = !DILocation(line: 250, column: 27, scope: !1169)
!1193 = !DILocation(line: 251, column: 11, scope: !1169)
!1194 = !DILocation(line: 252, column: 9, scope: !1169)
!1195 = !DILocation(line: 253, column: 9, scope: !1169)
!1196 = !DILocation(line: 255, column: 11, scope: !1169)
!1197 = !DILocation(line: 259, column: 7, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 259, column: 7)
!1199 = !DILocation(line: 259, column: 14, scope: !1198)
!1200 = !DILocation(line: 259, column: 7, scope: !1136)
!1201 = !DILocation(line: 261, column: 7, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !2, line: 260, column: 5)
!1203 = !DILocation(line: 262, column: 7, scope: !1202)
!1204 = !DILocation(line: 265, column: 7, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 265, column: 7)
!1206 = !DILocation(line: 265, column: 21, scope: !1205)
!1207 = !DILocation(line: 268, column: 29, scope: !1136)
!1208 = !DILocation(line: 268, column: 46, scope: !1136)
!1209 = !DILocation(line: 269, column: 7, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1136, file: !2, line: 269, column: 7)
!1211 = !DILocation(line: 269, column: 7, scope: !1136)
!1212 = !DILocalVariable(name: "fname", arg: 1, scope: !1213, file: !2, line: 116, type: !151)
!1213 = distinct !DISubprogram(name: "realpath_canon", scope: !2, file: !2, line: 116, type: !1121, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1214)
!1214 = !{!1212, !1215, !1216, !1217}
!1215 = !DILocalVariable(name: "can_mode", arg: 2, scope: !1213, file: !2, line: 116, type: !111)
!1216 = !DILocalVariable(name: "can_fname", scope: !1213, file: !2, line: 118, type: !145)
!1217 = !DILocalVariable(name: "can_fname2", scope: !1218, file: !2, line: 122, type: !145)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !2, line: 120, column: 5)
!1219 = distinct !DILexicalBlock(scope: !1213, file: !2, line: 119, column: 7)
!1220 = !DILocation(line: 0, scope: !1213, inlinedAt: !1221)
!1221 = distinct !DILocation(line: 271, column: 25, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1210, file: !2, line: 270, column: 5)
!1223 = !DILocation(line: 118, column: 21, scope: !1213, inlinedAt: !1221)
!1224 = !DILocation(line: 119, column: 7, scope: !1219, inlinedAt: !1221)
!1225 = !DILocation(line: 119, column: 15, scope: !1219, inlinedAt: !1221)
!1226 = !DILocation(line: 121, column: 16, scope: !1218, inlinedAt: !1221)
!1227 = !DILocation(line: 122, column: 26, scope: !1218, inlinedAt: !1221)
!1228 = !DILocation(line: 0, scope: !1218, inlinedAt: !1221)
!1229 = !DILocation(line: 123, column: 7, scope: !1218, inlinedAt: !1221)
!1230 = !DILocation(line: 271, column: 23, scope: !1222)
!1231 = !DILocation(line: 272, column: 12, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1222, file: !2, line: 272, column: 11)
!1233 = !DILocation(line: 272, column: 11, scope: !1222)
!1234 = !DILocation(line: 273, column: 9, scope: !1232)
!1235 = !DILocation(line: 274, column: 20, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1222, file: !2, line: 274, column: 11)
!1237 = !DILocalVariable(name: "path", arg: 1, scope: !1238, file: !2, line: 159, type: !151)
!1238 = distinct !DISubprogram(name: "isdir", scope: !2, file: !2, line: 159, type: !1239, scopeLine: 160, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !95, retainedNodes: !1241)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!179, !151}
!1241 = !{!1237, !1242}
!1242 = !DILocalVariable(name: "sb", scope: !1238, file: !2, line: 161, type: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1244, line: 44, size: 1024, elements: !1245)
!1244 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1245 = !{!1246, !1248, !1250, !1252, !1254, !1256, !1258, !1259, !1260, !1261, !1263, !1264, !1266, !1274, !1275, !1276}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1243, file: !1244, line: 46, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !237, line: 145, baseType: !150)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1243, file: !1244, line: 47, baseType: !1249, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !237, line: 148, baseType: !150)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1243, file: !1244, line: 48, baseType: !1251, size: 32, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !237, line: 150, baseType: !99)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1243, file: !1244, line: 49, baseType: !1253, size: 32, offset: 160)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !237, line: 151, baseType: !99)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1243, file: !1244, line: 50, baseType: !1255, size: 32, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !237, line: 146, baseType: !99)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1243, file: !1244, line: 51, baseType: !1257, size: 32, offset: 224)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !237, line: 147, baseType: !99)
