; ModuleID = 'src/rm.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.dev_ino = type { i64, i64 }
%struct.hash_tuning = type { float, float, float, float, i8 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.rm_options = type { i8, i32, i8, i8, i8, ptr, i8, i8, i8, i8 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [2 x i32] }
%struct.FTS = type { ptr, ptr, ptr, i64, ptr, i32, i32, i64, i64, ptr, i32, ptr, %union.anon, %struct.I_ring }
%union.anon = type { ptr }
%struct.I_ring = type { [4 x i32], i32, i32, i32, i8 }
%struct._ftsent = type { ptr, ptr, ptr, ptr, i64, ptr, ptr, ptr, i32, i32, i64, ptr, i64, i64, i16, i16, i16, [1 x %struct.stat], [0 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct.Active_dir = type { i64, i64, ptr }
%struct.cycle_check_state = type { %struct.dev_ino, i64, i32 }

!197 = !{!198, !200, !201, !158, !202, !203, !205, !207}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 46, baseType: !188)
!204 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!207 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!208 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !67, !72, !77, !79, !84, !89, !94, !99, !104, !109, !114, !209, !214, !219, !221, !226, !231, !233, !238, !243, !248, !253, !255, !299, !301, !306, !311, !313, !318, !323, !325, !330, !335, !413, !418, !420, !422, !427, !429, !431, !433, !435, !437, !439, !441, !446, !448, !450, !452, !454, !456, !458, !460, !465, !470, !475, !480, !482, !484, !486, !488, !490, !495, !497, !499, !504, !506, !511, !516, !518, !520, !522, !524, !526, !528, !530, !532, !534, !119, !536, !540, !542, !544, !546, !548, !550, !552, !556}
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(scope: null, file: !2, line: 289, type: !211, isLocal: true, isDefinition: true)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 14)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(scope: null, file: !2, line: 320, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 19)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(scope: null, file: !2, line: 321, type: !69, isLocal: true, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 329, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 4)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 332, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 42)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !211, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 11)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 16)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 20)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !2, line: 348, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 13)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !240, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dev_ino_buf", scope: !257, file: !2, line: 368, type: !276, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 234, type: !258, scopeLine: 235, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !261)
!258 = !DISubroutineType(types: !259)
!259 = !{!158, !158, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!261 = !{!262, !263, !264, !266, !290, !291, !292, !296, !297, !298}
!262 = !DILocalVariable(name: "argc", arg: 1, scope: !257, file: !2, line: 234, type: !158)
!263 = !DILocalVariable(name: "argv", arg: 2, scope: !257, file: !2, line: 234, type: !260)
!264 = !DILocalVariable(name: "preserve_root", scope: !257, file: !2, line: 236, type: !265)
!265 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!266 = !DILocalVariable(name: "x", scope: !257, file: !2, line: 237, type: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rm_options", file: !124, line: 32, size: 256, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !286, !287, !288, !289}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_missing_files", scope: !267, file: !124, line: 35, baseType: !265, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "interactive", scope: !267, file: !124, line: 38, baseType: !123, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "one_file_system", scope: !267, file: !124, line: 47, baseType: !265, size: 8, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recursive", scope: !267, file: !124, line: 50, baseType: !265, size: 8, offset: 72)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "remove_empty_directories", scope: !267, file: !124, line: 53, baseType: !265, size: 8, offset: 80)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "root_dev_ino", scope: !267, file: !124, line: 57, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !277, line: 30, size: 128, elements: !278)
!277 = !DIFile(filename: "./lib/dev-ino.h", directory: "/src", checksumkind: CSK_MD5, checksum: "7eae2ded9ac0c200760eafd719dd996d")
!278 = !{!279, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !276, file: !277, line: 32, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !281, line: 47, baseType: !282)
!281 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e62424071ad3f1b4d088c139fd9ccfd1")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !192, line: 148, baseType: !188)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !276, file: !277, line: 33, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !281, line: 59, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !192, line: 145, baseType: !188)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_all_root", scope: !267, file: !124, line: 61, baseType: !265, size: 8, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "stdin_tty", scope: !267, file: !124, line: 64, baseType: !265, size: 8, offset: 200)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !267, file: !124, line: 67, baseType: !265, size: 8, offset: 208)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "require_restore_cwd", scope: !267, file: !124, line: 75, baseType: !265, size: 8, offset: 216)
!290 = !DILocalVariable(name: "prompt_once", scope: !257, file: !2, line: 238, type: !265)
!291 = !DILocalVariable(name: "c", scope: !257, file: !2, line: 239, type: !158)
!292 = !DILocalVariable(name: "i", scope: !293, file: !2, line: 287, type: !158)
!293 = distinct !DILexicalBlock(scope: !294, file: !2, line: 286, column: 11)
!294 = distinct !DILexicalBlock(scope: !295, file: !2, line: 257, column: 9)
!295 = distinct !DILexicalBlock(scope: !257, file: !2, line: 255, column: 5)
!296 = !DILocalVariable(name: "n_files", scope: !257, file: !2, line: 375, type: !189)
!297 = !DILocalVariable(name: "file", scope: !257, file: !2, line: 376, type: !260)
!298 = !DILocalVariable(name: "status", scope: !257, file: !2, line: 393, type: !162)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !14, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !2, line: 371, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 38)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !3, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 26)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(scope: null, file: !2, line: 380, type: !320, isLocal: true, isDefinition: true)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 27)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !86, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !327, isLocal: true, isDefinition: true)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 9)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(scope: null, file: !2, line: 394, type: !332, isLocal: true, isDefinition: true)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 184, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 23)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !337, file: !157, line: 575, type: !158, isLocal: true, isDefinition: true)
!337 = distinct !DISubprogram(name: "oputs_", scope: !157, file: !157, line: 573, type: !338, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !121, retainedNodes: !340)
!338 = !DISubroutineType(cc: DW_CC_nocall, types: !339)
!339 = !{null, !205, !205}
!340 = !{!341, !342, !343, !346, !347, !348, !349, !353, !354, !355, !356, !358, !407, !408, !409, !411, !412}
!341 = !DILocalVariable(name: "program", arg: 1, scope: !337, file: !157, line: 573, type: !205)
!342 = !DILocalVariable(name: "option", arg: 2, scope: !337, file: !157, line: 573, type: !205)
!343 = !DILocalVariable(name: "term", scope: !344, file: !157, line: 585, type: !205)
!344 = distinct !DILexicalBlock(scope: !345, file: !157, line: 582, column: 5)
!345 = distinct !DILexicalBlock(scope: !337, file: !157, line: 581, column: 7)
!346 = !DILocalVariable(name: "double_space", scope: !337, file: !157, line: 594, type: !265)
!347 = !DILocalVariable(name: "first_word", scope: !337, file: !157, line: 595, type: !205)
!348 = !DILocalVariable(name: "option_text", scope: !337, file: !157, line: 596, type: !205)
!349 = !DILocalVariable(name: "s", scope: !350, file: !157, line: 608, type: !205)
!350 = distinct !DILexicalBlock(scope: !351, file: !157, line: 605, column: 5)
!351 = distinct !DILexicalBlock(scope: !352, file: !157, line: 604, column: 12)
!352 = distinct !DILexicalBlock(scope: !337, file: !157, line: 597, column: 7)
!353 = !DILocalVariable(name: "spaces", scope: !350, file: !157, line: 609, type: !203)
!354 = !DILocalVariable(name: "anchor_len", scope: !337, file: !157, line: 620, type: !203)
!355 = !DILocalVariable(name: "desc_text", scope: !337, file: !157, line: 625, type: !205)
!356 = !DILocalVariable(name: "__ptr", scope: !357, file: !157, line: 644, type: !205)
!357 = distinct !DILexicalBlock(scope: !337, file: !157, line: 644, column: 3)
!358 = !DILocalVariable(name: "__stream", scope: !357, file: !157, line: 644, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !361, line: 7, baseType: !362)
!361 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !363, line: 49, size: 1728, elements: !364)
!363 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !380, !382, !383, !384, !387, !388, !390, !391, !394, !396, !399, !402, !403, !404, !405, !406}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !362, file: !363, line: 51, baseType: !158, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !362, file: !363, line: 54, baseType: !200, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !362, file: !363, line: 55, baseType: !200, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !362, file: !363, line: 56, baseType: !200, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !362, file: !363, line: 57, baseType: !200, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !362, file: !363, line: 58, baseType: !200, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !362, file: !363, line: 59, baseType: !200, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !362, file: !363, line: 60, baseType: !200, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !362, file: !363, line: 61, baseType: !200, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !362, file: !363, line: 64, baseType: !200, size: 64, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !362, file: !363, line: 65, baseType: !200, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !362, file: !363, line: 66, baseType: !200, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !362, file: !363, line: 68, baseType: !378, size: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !363, line: 36, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !362, file: !363, line: 70, baseType: !381, size: 64, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !362, file: !363, line: 72, baseType: !158, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !362, file: !363, line: 73, baseType: !158, size: 32, offset: 928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !362, file: !363, line: 74, baseType: !385, size: 64, offset: 960)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 152, baseType: !386)
!386 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !362, file: !363, line: 77, baseType: !202, size: 16, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !362, file: !363, line: 78, baseType: !389, size: 8, offset: 1040)
!389 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !362, file: !363, line: 79, baseType: !101, size: 8, offset: 1048)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !362, file: !363, line: 81, baseType: !392, size: 64, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !363, line: 43, baseType: null)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !362, file: !363, line: 89, baseType: !395, size: 64, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !192, line: 153, baseType: !386)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !362, file: !363, line: 91, baseType: !397, size: 64, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !363, line: 37, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !362, file: !363, line: 92, baseType: !400, size: 64, offset: 1280)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !363, line: 38, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !362, file: !363, line: 93, baseType: !381, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !362, file: !363, line: 94, baseType: !201, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !362, file: !363, line: 95, baseType: !203, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !362, file: !363, line: 96, baseType: !158, size: 32, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !362, file: !363, line: 98, baseType: !245, size: 160, offset: 1568)
!407 = !DILocalVariable(name: "__cnt", scope: !357, file: !157, line: 644, type: !203)
!408 = !DILocalVariable(name: "url_program", scope: !337, file: !157, line: 648, type: !205)
!409 = !DILocalVariable(name: "__ptr", scope: !410, file: !157, line: 686, type: !205)
!410 = distinct !DILexicalBlock(scope: !337, file: !157, line: 686, column: 3)
!411 = !DILocalVariable(name: "__stream", scope: !410, file: !157, line: 686, type: !359)
!412 = !DILocalVariable(name: "__cnt", scope: !410, file: !157, line: 686, type: !203)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !157, line: 585, type: !415, isLocal: true, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 5)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !157, line: 586, type: !415, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(scope: null, file: !157, line: 595, type: !223, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !157, line: 620, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 6)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !303, isLocal: true, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !157, line: 648, type: !415, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !223, isLocal: true, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(scope: null, file: !157, line: 649, type: !19, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(scope: null, file: !157, line: 650, type: !415, isLocal: true, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(scope: null, file: !157, line: 651, type: !424, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !157, line: 652, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 7)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !157, line: 653, type: !116, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !157, line: 654, type: !106, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(scope: null, file: !157, line: 655, type: !106, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(scope: null, file: !157, line: 656, type: !106, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(scope: null, file: !157, line: 657, type: !106, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(scope: null, file: !157, line: 663, type: !443, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !157, line: 664, type: !106, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !462, isLocal: true, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 17)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(scope: null, file: !157, line: 669, type: !467, isLocal: true, isDefinition: true)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 40)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 15)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(scope: null, file: !157, line: 676, type: !477, isLocal: true, isDefinition: true)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 61)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(scope: null, file: !157, line: 679, type: !19, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(scope: null, file: !157, line: 683, type: !415, isLocal: true, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(scope: null, file: !157, line: 688, type: !415, isLocal: true, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(scope: null, file: !157, line: 691, type: !116, isLocal: true, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(scope: null, file: !157, line: 839, type: !240, isLocal: true, isDefinition: true)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(scope: null, file: !157, line: 840, type: !492, isLocal: true, isDefinition: true)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 22)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(scope: null, file: !157, line: 841, type: !472, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(scope: null, file: !157, line: 862, type: !223, isLocal: true, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(scope: null, file: !157, line: 868, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 71)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !157, line: 875, type: !320, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 51)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(scope: null, file: !157, line: 877, type: !513, isLocal: true, isDefinition: true)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 12)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !424, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !513, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !240, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !462, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !211, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !2, line: 74, type: !216, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !106, isLocal: true, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !116, isLocal: true, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(scope: null, file: !2, line: 79, type: !415, isLocal: true, isDefinition: true)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !116, isLocal: true, isDefinition: true)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "interactive_types", scope: !121, file: !2, line: 90, type: !538, isLocal: true, isDefinition: true)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 192, elements: !425)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !424, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !19, isLocal: true, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(scope: null, file: !2, line: 86, type: !415, isLocal: true, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !415, isLocal: true, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !443, isLocal: true, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(scope: null, file: !2, line: 88, type: !223, isLocal: true, isDefinition: true)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "interactive_args", scope: !121, file: !2, line: 84, type: !554, isLocal: true, isDefinition: true)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 448, elements: !444)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(scope: null, file: !2, line: 114, type: !308, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 3072, elements: !514)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !561, line: 50, size: 256, elements: !562)
!561 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!562 = !{!563, !564, !565, !567}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !561, line: 52, baseType: !205, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !560, file: !561, line: 55, baseType: !158, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !561, line: 56, baseType: !566, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !560, file: !561, line: 57, baseType: !158, size: 32, offset: 192)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(scope: null, file: !570, line: 625, type: !240, isLocal: true, isDefinition: true)
!570 = !DIFile(filename: "src/remove.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5b44ba291ad4d7b78c5ea04d27ccb860")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !573, isLocal: true, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 704, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 88)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !250, isLocal: true, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !570, line: 633, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 480, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 60)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(scope: null, file: !570, line: 639, type: !462, isLocal: true, isDefinition: true)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(scope: null, file: !570, line: 456, type: !462, isLocal: true, isDefinition: true)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !508, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !303, isLocal: true, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(scope: null, file: !570, line: 469, type: !19, isLocal: true, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !303, isLocal: true, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 45)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !602, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 58)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(scope: null, file: !570, line: 482, type: !607, isLocal: true, isDefinition: true)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 49)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(scope: null, file: !570, line: 498, type: !14, isLocal: true, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !570, line: 511, type: !614, isLocal: true, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 46)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !570, line: 514, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 37)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !570, line: 576, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1488, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 186)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !570, line: 583, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 21)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !634, isLocal: true, isDefinition: true)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 56)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(scope: null, file: !570, line: 589, type: !492, isLocal: true, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !641, isLocal: true, isDefinition: true)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 48)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(scope: null, file: !570, line: 276, type: !646, isLocal: true, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 32)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(scope: null, file: !570, line: 297, type: !508, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 35)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(scope: null, file: !570, line: 309, type: !216, isLocal: true, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !492, isLocal: true, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(scope: null, file: !570, line: 398, type: !513, isLocal: true, isDefinition: true)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !664, line: 3, type: !472, isLocal: true, isDefinition: true)
!664 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "Version", scope: !667, file: !664, line: 3, type: !205, isLocal: false, isDefinition: true)
!667 = distinct !DICompileUnit(language: DW_LANG_C11, file: !664, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !668, splitDebugInlining: false, nameTableKind: None)
!668 = !{!662, !665}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !671, file: !672, line: 65, type: !691, isLocal: false, isDefinition: true)
!671 = distinct !DICompileUnit(language: DW_LANG_C11, file: !672, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !673, retainedTypes: !674, globals: !675, splitDebugInlining: false, nameTableKind: None)
!672 = !DIFile(filename: "lib/argmatch.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b147d258438e01421d766b453f353b54")
!673 = !{!142}
!674 = !{!201, !205, !207}
!675 = !{!669, !676, !678, !680, !685, !687, !689}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(scope: null, file: !672, line: 141, type: !443, isLocal: true, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(scope: null, file: !672, line: 141, type: !320, isLocal: true, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(scope: null, file: !672, line: 142, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 29)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !672, line: 160, type: !629, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(scope: null, file: !672, line: 165, type: !116, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(scope: null, file: !672, line: 170, type: !415, isLocal: true, isDefinition: true)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !692, line: 69, baseType: !693)
!692 = !DIFile(filename: "./lib/argmatch.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0538d47ac978b3f52562dc3536aacea1")
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null}
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "file_name", scope: !698, file: !699, line: 36, type: !205, isLocal: true, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C11, file: !699, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !700, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "lib/closein.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9fec55e4ddd91bb874b8f9175b89c7e1")
!700 = !{!701, !703, !705, !707, !696}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !699, line: 99, type: !443, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !699, line: 99, type: !216, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !699, line: 101, type: !443, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !699, line: 104, type: !19, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "file_name", scope: !711, file: !712, line: 45, type: !205, isLocal: true, isDefinition: true)
!711 = distinct !DICompileUnit(language: DW_LANG_C11, file: !712, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !713, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!713 = !{!714, !716, !718, !720, !709, !722}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(scope: null, file: !712, line: 121, type: !443, isLocal: true, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(scope: null, file: !712, line: 121, type: !513, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !712, line: 123, type: !443, isLocal: true, isDefinition: true)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(scope: null, file: !712, line: 126, type: !19, isLocal: true, isDefinition: true)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !711, file: !712, line: 55, type: !265, isLocal: true, isDefinition: true)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !726, file: !727, line: 66, type: !693, isLocal: false, isDefinition: true)
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !728, globals: !729, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!728 = !{!201, !207}
!729 = !{!730, !732, !757, !759, !761, !763, !724, !765, !767, !769, !771, !773}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !727, line: 272, type: !415, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "old_file_name", scope: !734, file: !727, line: 304, type: !205, isLocal: true, isDefinition: true)
!734 = distinct !DISubprogram(name: "verror_at_line", scope: !727, file: !727, line: 298, type: !735, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !726, retainedNodes: !750)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !158, !158, !205, !125, !205, !737}
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !738, line: 52, baseType: !739)
!738 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !740, line: 14, baseType: !741)
!740 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !742, baseType: !743)
!742 = !DIFile(filename: "lib/error.c", directory: "/src")
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !744)
!744 = !{!745, !746, !747, !748, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !743, file: !742, baseType: !201, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !743, file: !742, baseType: !201, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !743, file: !742, baseType: !201, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !743, file: !742, baseType: !158, size: 32, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !743, file: !742, baseType: !158, size: 32, offset: 224)
!750 = !{!751, !752, !753, !754, !755, !756}
!751 = !DILocalVariable(name: "status", arg: 1, scope: !734, file: !727, line: 298, type: !158)
!752 = !DILocalVariable(name: "errnum", arg: 2, scope: !734, file: !727, line: 298, type: !158)
!753 = !DILocalVariable(name: "file_name", arg: 3, scope: !734, file: !727, line: 298, type: !205)
!754 = !DILocalVariable(name: "line_number", arg: 4, scope: !734, file: !727, line: 298, type: !125)
!755 = !DILocalVariable(name: "message", arg: 5, scope: !734, file: !727, line: 298, type: !205)
!756 = !DILocalVariable(name: "args", arg: 6, scope: !734, file: !727, line: 298, type: !737)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "old_line_number", scope: !734, file: !727, line: 305, type: !125, isLocal: true, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(scope: null, file: !727, line: 338, type: !223, isLocal: true, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(scope: null, file: !727, line: 346, type: !116, isLocal: true, isDefinition: true)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(scope: null, file: !727, line: 346, type: !303, isLocal: true, isDefinition: true)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "error_message_count", scope: !726, file: !727, line: 69, type: !125, isLocal: false, isDefinition: true)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !726, file: !727, line: 295, type: !158, isLocal: false, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(scope: null, file: !727, line: 208, type: !443, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(scope: null, file: !727, line: 208, type: !629, isLocal: true, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(scope: null, file: !727, line: 214, type: !415, isLocal: true, isDefinition: true)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(scope: null, file: !777, line: 30, type: !443, isLocal: true, isDefinition: true)
!777 = !DIFile(filename: "lib/file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "50015f77027750ae004026e1298a48e3")
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(scope: null, file: !780, line: 399, type: !303, isLocal: true, isDefinition: true)
!780 = !DIFile(filename: "lib/fts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "790475fd5d16e5b9bfdbc337c34f4fa2")
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(scope: null, file: !780, line: 441, type: !101, isLocal: true, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(scope: null, file: !780, line: 1080, type: !19, isLocal: true, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(scope: null, file: !787, line: 226, type: !111, isLocal: true, isDefinition: true)
!787 = !DIFile(filename: "lib/hash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "2781d14834549d64b116724df6536de6")
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !787, line: 227, type: !111, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !787, line: 228, type: !9, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !787, line: 231, type: !111, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "default_tuning", scope: !796, file: !787, line: 134, type: !800, isLocal: true, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C11, file: !787, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !797, globals: !799, splitDebugInlining: false, nameTableKind: None)
!797 = !{!188, !201, !798, !203}
!798 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!799 = !{!785, !788, !790, !792, !794}
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "Hash_tuning", file: !802, line: 52, baseType: !803)
!802 = !DIFile(filename: "./lib/hash.h", directory: "/src", checksumkind: CSK_MD5, checksum: "9030b0ff6bd942d16180da8e5c28e948")
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_tuning", file: !802, line: 40, size: 160, elements: !804)
!804 = !{!805, !806, !807, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_threshold", scope: !803, file: !802, line: 45, baseType: !798, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "shrink_factor", scope: !803, file: !802, line: 46, baseType: !798, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "growth_threshold", scope: !803, file: !802, line: 47, baseType: !798, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "growth_factor", scope: !803, file: !802, line: 48, baseType: !798, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "is_n_buckets", scope: !803, file: !802, line: 49, baseType: !265, size: 8, offset: 128)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "program_name", scope: !812, file: !813, line: 31, type: !205, isLocal: false, isDefinition: true)
!812 = distinct !DICompileUnit(language: DW_LANG_C11, file: !813, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, globals: !815, splitDebugInlining: false, nameTableKind: None)
!813 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!814 = !{!200}
!815 = !{!810, !816, !818}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !813, line: 46, type: !116, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !813, line: 49, type: !223, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "utf07FF", scope: !822, file: !823, line: 46, type: !850, isLocal: true, isDefinition: true)
!822 = distinct !DISubprogram(name: "proper_name_lite", scope: !823, file: !823, line: 38, type: !824, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !826, retainedNodes: !828)
!823 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!824 = !DISubroutineType(types: !825)
!825 = !{!205, !205, !205}
!826 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !827, splitDebugInlining: false, nameTableKind: None)
!827 = !{!820}
!828 = !{!829, !830, !831, !832, !837}
!829 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !822, file: !823, line: 38, type: !205)
!830 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !822, file: !823, line: 38, type: !205)
!831 = !DILocalVariable(name: "translation", scope: !822, file: !823, line: 40, type: !205)
!832 = !DILocalVariable(name: "w", scope: !822, file: !823, line: 47, type: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !834, line: 37, baseType: !835)
!834 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !192, line: 57, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !192, line: 42, baseType: !125)
!837 = !DILocalVariable(name: "mbs", scope: !822, file: !823, line: 48, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !839, line: 6, baseType: !840)
!839 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !841, line: 21, baseType: !842)
!841 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 13, size: 64, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !842, file: !841, line: 15, baseType: !158, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !842, file: !841, line: 20, baseType: !846, size: 32, offset: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !841, line: 16, size: 32, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !846, file: !841, line: 18, baseType: !125, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !846, file: !841, line: 19, baseType: !223, size: 32)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 16, elements: !304)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(scope: null, file: !853, line: 78, type: !116, isLocal: true, isDefinition: true)
!853 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(scope: null, file: !853, line: 79, type: !424, isLocal: true, isDefinition: true)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(scope: null, file: !853, line: 80, type: !250, isLocal: true, isDefinition: true)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(scope: null, file: !853, line: 81, type: !250, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(scope: null, file: !853, line: 82, type: !245, isLocal: true, isDefinition: true)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(scope: null, file: !853, line: 83, type: !303, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(scope: null, file: !853, line: 84, type: !116, isLocal: true, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(scope: null, file: !853, line: 85, type: !443, isLocal: true, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !853, line: 86, type: !443, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(scope: null, file: !853, line: 87, type: !116, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !874, file: !853, line: 76, type: !946, isLocal: false, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C11, file: !853, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !875, retainedTypes: !881, globals: !882, splitDebugInlining: false, nameTableKind: None)
!875 = !{!142, !876, !169}
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !143, line: 254, baseType: !125, size: 32, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!879 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!880 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!881 = !{!158, !202, !203}
!882 = !{!851, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !883, !887, !897, !899, !904, !906, !908, !910, !912, !935, !942, !944}
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !874, file: !853, line: 92, type: !885, isLocal: false, isDefinition: true)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 320, elements: !107)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !874, file: !853, line: 1040, type: !889, isLocal: false, isDefinition: true)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !853, line: 56, size: 448, elements: !890)
!890 = !{!891, !892, !893, !895, !896}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !889, file: !853, line: 59, baseType: !142, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !889, file: !853, line: 62, baseType: !158, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !889, file: !853, line: 66, baseType: !894, size: 256, offset: 64)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !117)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !889, file: !853, line: 69, baseType: !205, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !889, file: !853, line: 72, baseType: !205, size: 64, offset: 384)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !874, file: !853, line: 107, type: !889, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "slot0", scope: !874, file: !853, line: 831, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 256)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !853, line: 321, type: !303, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(scope: null, file: !853, line: 357, type: !303, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !853, line: 358, type: !303, isLocal: true, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(scope: null, file: !853, line: 199, type: !443, isLocal: true, isDefinition: true)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "quote", scope: !914, file: !853, line: 228, type: !933, isLocal: true, isDefinition: true)
!914 = distinct !DISubprogram(name: "gettext_quote", scope: !853, file: !853, line: 197, type: !915, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !917)
!915 = !DISubroutineType(types: !916)
!916 = !{!205, !205, !142}
!917 = !{!918, !919, !920, !921, !922}
!918 = !DILocalVariable(name: "msgid", arg: 1, scope: !914, file: !853, line: 197, type: !205)
!919 = !DILocalVariable(name: "s", arg: 2, scope: !914, file: !853, line: 197, type: !142)
!920 = !DILocalVariable(name: "translation", scope: !914, file: !853, line: 199, type: !205)
!921 = !DILocalVariable(name: "w", scope: !914, file: !853, line: 229, type: !833)
!922 = !DILocalVariable(name: "mbs", scope: !914, file: !853, line: 230, type: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !839, line: 6, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !841, line: 21, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 13, size: 64, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !925, file: !841, line: 15, baseType: !158, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !925, file: !841, line: 20, baseType: !929, size: 32, offset: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !925, file: !841, line: 16, size: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !929, file: !841, line: 18, baseType: !125, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !929, file: !841, line: 19, baseType: !223, size: 32)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 64, elements: !934)
!934 = !{!305, !225}
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "slotvec", scope: !874, file: !853, line: 834, type: !937, isLocal: true, isDefinition: true)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !853, line: 823, size: 128, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !938, file: !853, line: 825, baseType: !203, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !938, file: !853, line: 826, baseType: !200, size: 64, offset: 64)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "nslots", scope: !874, file: !853, line: 832, type: !158, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "slotvec0", scope: !874, file: !853, line: 833, type: !938, isLocal: true, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 704, elements: !236)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(scope: null, file: !949, line: 32, type: !303, isLocal: true, isDefinition: true)
!949 = !DIFile(filename: "lib/root-dev-ino.c", directory: "/src", checksumkind: CSK_MD5, checksum: "b0632229108c1521929601778d55996f")
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !952, line: 67, type: !513, isLocal: true, isDefinition: true)
!952 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !952, line: 69, type: !443, isLocal: true, isDefinition: true)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(scope: null, file: !952, line: 83, type: !443, isLocal: true, isDefinition: true)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !952, line: 83, type: !223, isLocal: true, isDefinition: true)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(scope: null, file: !952, line: 85, type: !303, isLocal: true, isDefinition: true)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(scope: null, file: !952, line: 88, type: !963, isLocal: true, isDefinition: true)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 171)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(scope: null, file: !952, line: 88, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 34)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !952, line: 105, type: !240, isLocal: true, isDefinition: true)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(scope: null, file: !952, line: 109, type: !975, isLocal: true, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !333)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(scope: null, file: !952, line: 113, type: !978, isLocal: true, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !979)
!979 = !{!980}
!980 = !DISubrange(count: 28)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(scope: null, file: !952, line: 120, type: !646, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(scope: null, file: !952, line: 127, type: !985, isLocal: true, isDefinition: true)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 36)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(scope: null, file: !952, line: 134, type: !467, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(scope: null, file: !952, line: 142, type: !992, isLocal: true, isDefinition: true)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 44)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(scope: null, file: !952, line: 150, type: !641, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(scope: null, file: !952, line: 159, type: !999, isLocal: true, isDefinition: true)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 52)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(scope: null, file: !952, line: 170, type: !1004, isLocal: true, isDefinition: true)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !581)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !952, line: 248, type: !245, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(scope: null, file: !952, line: 248, type: !492, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(scope: null, file: !952, line: 254, type: !245, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(scope: null, file: !952, line: 254, type: !211, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(scope: null, file: !952, line: 254, type: !467, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(scope: null, file: !952, line: 259, type: !3, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !952, line: 259, type: !682, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !1021, file: !1022, line: 26, type: !1024, isLocal: false, isDefinition: true)
!1021 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1022, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1023, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!1023 = !{!1019}
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 376, elements: !65)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1026 = distinct !DIGlobalVariable(name: "initialized", scope: !1027, file: !1028, line: 41, type: !265, isLocal: true, isDefinition: true)
!1027 = distinct !DISubprogram(name: "can_write_any_file", scope: !1028, file: !1028, line: 39, type: !1029, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1031, retainedNodes: !1036)
!1028 = !DIFile(filename: "lib/write-any-file.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d0180a8dace2a19c551daec82ca064f9")
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!265}
!1031 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1028, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!1032 = !{!1033, !1034}
!1033 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "can_write", scope: !1027, file: !1028, line: 42, type: !265, isLocal: true, isDefinition: true)
!1036 = !{!1037}
!1037 = !DILocalVariable(name: "can", scope: !1038, file: !1028, line: 46, type: !265)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !1028, line: 45, column: 5)
!1039 = distinct !DILexicalBlock(scope: !1027, file: !1028, line: 44, column: 7)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "exit_failure", scope: !1042, file: !1043, line: 24, type: !1045, isLocal: false, isDefinition: true)
!1042 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1043, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1044, splitDebugInlining: false, nameTableKind: None)
!1043 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!1044 = !{!1040}
!1045 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !158)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(scope: null, file: !1048, line: 34, type: !19, isLocal: true, isDefinition: true)
!1048 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(scope: null, file: !1048, line: 34, type: !443, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(scope: null, file: !1048, line: 34, type: !462, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(scope: null, file: !1055, line: 40, type: !682, isLocal: true, isDefinition: true)
!1055 = !DIFile(filename: "lib/xfts.c", directory: "/src", checksumkind: CSK_MD5, checksum: "84bc35d35364cd7c760cb21288203f20")
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(scope: null, file: !1055, line: 40, type: !235, isLocal: true, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(scope: null, file: !1055, line: 40, type: !1060, isLocal: true, isDefinition: true)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 624, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 78)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 40, type: !216, isLocal: true, isDefinition: true)
!1065 = !DIFile(filename: "lib/c-file-type.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a3dfce754b72420a39e7e891cf0b31be")
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 40, type: !250, isLocal: true, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 43, type: !106, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 46, type: !211, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 66, type: !216, isLocal: true, isDefinition: true)
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 69, type: !975, isLocal: true, isDefinition: true)
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 75, type: !415, isLocal: true, isDefinition: true)
!1078 = !DIGlobalVariableExpression(var: !1079, expr: !DIExpression())
!1079 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 105, type: !443, isLocal: true, isDefinition: true)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(scope: null, file: !1065, line: 110, type: !235, isLocal: true, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 59, type: !111, isLocal: true, isDefinition: true)
!1084 = !DIFile(filename: "lib/cycle-check.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e9029e4490609d8d0ac3188f897240e9")
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 59, type: !1087, isLocal: true, isDefinition: true)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 18)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(scope: null, file: !1084, line: 59, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 536, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 67)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "have_dupfd_cloexec", scope: !1097, file: !1098, line: 506, type: !158, isLocal: true, isDefinition: true)
!1097 = distinct !DISubprogram(name: "rpl_fcntl_DUPFD_CLOEXEC", scope: !1098, file: !1098, line: 485, type: !1099, scopeLine: 486, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1101, retainedNodes: !1103)
!1098 = !DIFile(filename: "lib/fcntl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bc4606a0e1e86be6126be7481cbd2f8d")
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!158, !158, !158}
!1101 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1098, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1102, splitDebugInlining: false, nameTableKind: None)
!1102 = !{!1095}
!1103 = !{!1104, !1105, !1106, !1107, !1110}
!1104 = !DILocalVariable(name: "fd", arg: 1, scope: !1097, file: !1098, line: 485, type: !158)
!1105 = !DILocalVariable(name: "target", arg: 2, scope: !1097, file: !1098, line: 485, type: !158)
!1106 = !DILocalVariable(name: "result", scope: !1097, file: !1098, line: 487, type: !158)
!1107 = !DILocalVariable(name: "flags", scope: !1108, file: !1098, line: 530, type: !158)
!1108 = distinct !DILexicalBlock(scope: !1109, file: !1098, line: 529, column: 5)
!1109 = distinct !DILexicalBlock(scope: !1097, file: !1098, line: 528, column: 7)
!1110 = !DILocalVariable(name: "saved_errno", scope: !1111, file: !1098, line: 533, type: !158)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !1098, line: 532, column: 9)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !1098, line: 531, column: 11)
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(scope: null, file: !1115, line: 108, type: !101, isLocal: true, isDefinition: true)
!1115 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "internal_state", scope: !1118, file: !1115, line: 97, type: !1121, isLocal: true, isDefinition: true)
!1118 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1115, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1119, globals: !1120, splitDebugInlining: false, nameTableKind: None)
!1119 = !{!201, !203, !207}
!1120 = !{!1113, !1116}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !839, line: 6, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !841, line: 21, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 13, size: 64, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !1123, file: !841, line: 15, baseType: !158, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !1123, file: !841, line: 20, baseType: !1127, size: 32, offset: 32)
!1127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1123, file: !841, line: 16, size: 32, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !1127, file: !841, line: 18, baseType: !125, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !1127, file: !841, line: 19, baseType: !223, size: 32)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(scope: null, file: !1133, line: 35, type: !303, isLocal: true, isDefinition: true)
!1133 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(scope: null, file: !1133, line: 35, type: !424, isLocal: true, isDefinition: true)
!1136 = distinct !DICompileUnit(language: DW_LANG_C11, file: !570, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1137, retainedTypes: !1159, globals: !1160, splitDebugInlining: false, nameTableKind: None)
!1137 = !{!162, !123, !1138, !142, !1143, !1147}
!1138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !157, line: 299, baseType: !158, size: 32, elements: !1139)
!1139 = !{!1140, !1141, !1142}
!1140 = !DIEnumerator(name: "DS_UNKNOWN", value: -2)
!1141 = !DIEnumerator(name: "DS_EMPTY", value: -1)
!1142 = !DIEnumerator(name: "DS_NONEMPTY", value: 0)
!1143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Prompt_action", file: !570, line: 38, baseType: !125, size: 32, elements: !1144)
!1144 = !{!1145, !1146}
!1145 = !DIEnumerator(name: "PA_DESCEND_INTO_DIR", value: 2)
!1146 = !DIEnumerator(name: "PA_REMOVE_DIR", value: 3)
!1147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1148, line: 97, baseType: !125, size: 32, elements: !1149)
!1148 = !DIFile(filename: "/usr/include/dirent.h", directory: "", checksumkind: CSK_MD5, checksum: "6eb1a2faa0cf53b967234cc6c0fe978e")
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1150 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!1151 = !DIEnumerator(name: "DT_FIFO", value: 1)
!1152 = !DIEnumerator(name: "DT_CHR", value: 2)
!1153 = !DIEnumerator(name: "DT_DIR", value: 4)
!1154 = !DIEnumerator(name: "DT_BLK", value: 6)
!1155 = !DIEnumerator(name: "DT_REG", value: 8)
!1156 = !DIEnumerator(name: "DT_LNK", value: 10)
!1157 = !DIEnumerator(name: "DT_SOCK", value: 12)
!1158 = !DIEnumerator(name: "DT_WHT", value: 14)
!1159 = !{!201}
!1160 = !{!568, !571, !576, !578, !583, !585, !587, !589, !591, !593, !595, !600, !605, !610, !612, !617, !622, !627, !632, !637, !639, !644, !649, !651, !656, !658, !660}
!1161 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1162, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !814, splitDebugInlining: false, nameTableKind: None)
!1162 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!1163 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1164, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1159, splitDebugInlining: false, nameTableKind: None)
!1164 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1165 = distinct !DICompileUnit(language: DW_LANG_C11, file: !777, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1166, splitDebugInlining: false, nameTableKind: None)
!1166 = !{!775}
!1167 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1168, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1159, splitDebugInlining: false, nameTableKind: None)
!1168 = !DIFile(filename: "lib/filenamecat.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a58f68c719d6eade07443f6349d1f193")
!1169 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1170, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1159, splitDebugInlining: false, nameTableKind: None)
!1170 = !DIFile(filename: "lib/filenamecat-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "19114c82e79ffcf16d6cc09933141d08")
!1171 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1172, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1172 = !DIFile(filename: "lib/freadahead.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0335573db6cc583acb894a308e230b2b")
!1173 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1174, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1159, splitDebugInlining: false, nameTableKind: None)
!1174 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1175 = distinct !DICompileUnit(language: DW_LANG_C11, file: !780, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1176, retainedTypes: !1319, globals: !1328, splitDebugInlining: false, nameTableKind: None)
!1176 = !{!1177, !1181, !1306, !1309, !1147, !1313, !1316}
!1177 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Fts_stat", file: !780, line: 159, baseType: !125, size: 32, elements: !1178)
!1178 = !{!1179, !1180}
!1179 = !DIEnumerator(name: "FTS_NO_STAT_REQUIRED", value: 1)
!1180 = !DIEnumerator(name: "FTS_STAT_REQUIRED", value: 2)
!1181 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1183, file: !1182, line: 54, baseType: !125, size: 32, elements: !1304)
!1182 = !DIFile(filename: "./lib/fts-cycle.c", directory: "/src", checksumkind: CSK_MD5, checksum: "270205dca4a7d3b7c2e61f5b3b63f3eb")
!1183 = distinct !DISubprogram(name: "setup_dir", scope: !1182, file: !1182, line: 50, type: !1184, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1175, retainedNodes: !1302)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!265, !1186}
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "FTS", file: !1188, line: 233, baseType: !1189)
!1188 = !DIFile(filename: "./lib/fts_.h", directory: "/src", checksumkind: CSK_MD5, checksum: "b8640bdd941d220a051ddea014397796")
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1188, line: 115, size: 1024, elements: !1190)
!1190 = !{!1191, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1271, !1272, !1275, !1291}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cur", scope: !1189, file: !1188, line: 116, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ftsent", file: !1188, line: 235, size: 1920, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1212, !1213, !1214, !1215, !1216, !1251}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "fts_cycle", scope: !1193, file: !1188, line: 236, baseType: !1192, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "fts_parent", scope: !1193, file: !1188, line: 237, baseType: !1192, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fts_link", scope: !1193, file: !1188, line: 238, baseType: !1192, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "fts_dirp", scope: !1193, file: !1188, line: 239, baseType: !1199, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1148, line: 127, baseType: !1201)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1148, line: 127, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "fts_number", scope: !1193, file: !1188, line: 242, baseType: !386, size: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pointer", scope: !1193, file: !1188, line: 243, baseType: !201, size: 64, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "fts_accpath", scope: !1193, file: !1188, line: 244, baseType: !200, size: 64, offset: 384)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "fts_path", scope: !1193, file: !1188, line: 245, baseType: !200, size: 64, offset: 448)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "fts_errno", scope: !1193, file: !1188, line: 246, baseType: !158, size: 32, offset: 512)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "fts_symfd", scope: !1193, file: !1188, line: 247, baseType: !158, size: 32, offset: 544)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "fts_pathlen", scope: !1193, file: !1188, line: 248, baseType: !203, size: 64, offset: 576)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "fts_fts", scope: !1193, file: !1188, line: 250, baseType: !1186, size: 64, offset: 640)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "fts_level", scope: !1193, file: !1188, line: 254, baseType: !1211, size: 64, offset: 704)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !204, line: 35, baseType: !386)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "fts_namelen", scope: !1193, file: !1188, line: 256, baseType: !203, size: 64, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "fts_info", scope: !1193, file: !1188, line: 272, baseType: !202, size: 16, offset: 832)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "fts_flags", scope: !1193, file: !1188, line: 276, baseType: !202, size: 16, offset: 848)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "fts_instr", scope: !1193, file: !1188, line: 282, baseType: !202, size: 16, offset: 864)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "fts_statp", scope: !1193, file: !1188, line: 284, baseType: !1217, size: 1024, offset: 896)
!1217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1218, size: 1024, elements: !102)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1219, line: 44, size: 1024, elements: !1220)
!1219 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1220 = !{!1221, !1222, !1223, !1225, !1227, !1229, !1231, !1232, !1233, !1234, !1236, !1237, !1239, !1247, !1248, !1249}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1218, file: !1219, line: 46, baseType: !285, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1218, file: !1219, line: 47, baseType: !282, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1218, file: !1219, line: 48, baseType: !1224, size: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !192, line: 150, baseType: !125)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1218, file: !1219, line: 49, baseType: !1226, size: 32, offset: 160)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !192, line: 151, baseType: !125)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1218, file: !1219, line: 50, baseType: !1228, size: 32, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !192, line: 146, baseType: !125)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1218, file: !1219, line: 51, baseType: !1230, size: 32, offset: 224)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !192, line: 147, baseType: !125)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1218, file: !1219, line: 52, baseType: !285, size: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1218, file: !1219, line: 53, baseType: !285, size: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1218, file: !1219, line: 54, baseType: !385, size: 64, offset: 384)
