; ModuleID = 'src/rmdir.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timespec, %struct.timespec, %struct.timespec, [2 x i32] }
%struct.timespec = type { i64, i64 }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [36 x i8] c"Usage: %s [OPTION]... DIRECTORY...\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [48 x i8] c"Remove the DIRECTORY(ies), if they are empty.\0A\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"rmdir\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [95 x i8] c"      --ignore-fail-on-non-empty\0A         ignore each failure to remove a non-empty directory\0A\00", align 1, !dbg !22

!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !126, !131, !136, !138, !143, !145, !150, !153, !155, !157, !236, !241, !243, !248, !250, !255, !257, !259, !261, !263, !265, !267, !272, !277, !279, !281, !283, !285, !287, !289, !294, !299, !304, !309, !311, !313, !315, !317, !319, !324, !326, !328, !333, !338, !343, !348, !353, !355, !357, !359, !361, !67, !363}
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 14)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 16)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !133, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(scope: null, file: !2, line: 242, type: !140, isLocal: true, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 23)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !14, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !147, isLocal: true, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 20)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "remove_empty_parents", scope: !69, file: !2, line: 40, type: !152, isLocal: true, isDefinition: true)
!152 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "ignore_fail_on_non_empty", scope: !69, file: !2, line: 44, type: !152, isLocal: true, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "verbose", scope: !69, file: !2, line: 47, type: !152, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !159, file: !76, line: 575, type: !77, isLocal: true, isDefinition: true)
!159 = distinct !DISubprogram(name: "oputs_", scope: !76, file: !76, line: 573, type: !160, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !162)
!160 = !DISubroutineType(cc: DW_CC_nocall, types: !161)
!161 = !{null, !122, !122}
!162 = !{!163, !164, !165, !168, !169, !170, !171, !175, !176, !177, !178, !180, !230, !231, !232, !234, !235}
!163 = !DILocalVariable(name: "program", arg: 1, scope: !159, file: !76, line: 573, type: !122)
!164 = !DILocalVariable(name: "option", arg: 2, scope: !159, file: !76, line: 573, type: !122)
!165 = !DILocalVariable(name: "term", scope: !166, file: !76, line: 585, type: !122)
!166 = distinct !DILexicalBlock(scope: !167, file: !76, line: 582, column: 5)
!167 = distinct !DILexicalBlock(scope: !159, file: !76, line: 581, column: 7)
!168 = !DILocalVariable(name: "double_space", scope: !159, file: !76, line: 594, type: !152)
!169 = !DILocalVariable(name: "first_word", scope: !159, file: !76, line: 595, type: !122)
!170 = !DILocalVariable(name: "option_text", scope: !159, file: !76, line: 596, type: !122)
!171 = !DILocalVariable(name: "s", scope: !172, file: !76, line: 608, type: !122)
!172 = distinct !DILexicalBlock(scope: !173, file: !76, line: 605, column: 5)
!173 = distinct !DILexicalBlock(scope: !174, file: !76, line: 604, column: 12)
!174 = distinct !DILexicalBlock(scope: !159, file: !76, line: 597, column: 7)
!175 = !DILocalVariable(name: "spaces", scope: !172, file: !76, line: 609, type: !119)
!176 = !DILocalVariable(name: "anchor_len", scope: !159, file: !76, line: 620, type: !119)
!177 = !DILocalVariable(name: "desc_text", scope: !159, file: !76, line: 625, type: !122)
!178 = !DILocalVariable(name: "__ptr", scope: !179, file: !76, line: 644, type: !122)
!179 = distinct !DILexicalBlock(scope: !159, file: !76, line: 644, column: 3)
!180 = !DILocalVariable(name: "__stream", scope: !179, file: !76, line: 644, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !183, line: 7, baseType: !184)
!183 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !185, line: 49, size: 1728, elements: !186)
!185 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !202, !204, !205, !206, !210, !211, !213, !214, !217, !219, !222, !225, !226, !227, !228, !229}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !184, file: !185, line: 51, baseType: !77, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !184, file: !185, line: 54, baseType: !116, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !184, file: !185, line: 55, baseType: !116, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !184, file: !185, line: 56, baseType: !116, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !184, file: !185, line: 57, baseType: !116, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !184, file: !185, line: 58, baseType: !116, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !184, file: !185, line: 59, baseType: !116, size: 64, offset: 384)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !184, file: !185, line: 60, baseType: !116, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !184, file: !185, line: 61, baseType: !116, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !184, file: !185, line: 64, baseType: !116, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !184, file: !185, line: 65, baseType: !116, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !184, file: !185, line: 66, baseType: !116, size: 64, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !184, file: !185, line: 68, baseType: !200, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !185, line: 36, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !184, file: !185, line: 70, baseType: !203, size: 64, offset: 832)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !184, file: !185, line: 72, baseType: !77, size: 32, offset: 896)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !184, file: !185, line: 73, baseType: !77, size: 32, offset: 928)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !184, file: !185, line: 74, baseType: !207, size: 64, offset: 960)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !208, line: 152, baseType: !209)
!208 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!209 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !184, file: !185, line: 77, baseType: !118, size: 16, offset: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !184, file: !185, line: 78, baseType: !212, size: 8, offset: 1040)
!212 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !184, file: !185, line: 79, baseType: !49, size: 8, offset: 1048)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !184, file: !185, line: 81, baseType: !215, size: 64, offset: 1088)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !185, line: 43, baseType: null)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !184, file: !185, line: 89, baseType: !218, size: 64, offset: 1152)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !208, line: 153, baseType: !209)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !184, file: !185, line: 91, baseType: !220, size: 64, offset: 1216)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !185, line: 37, flags: DIFlagFwdDecl)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !184, file: !185, line: 92, baseType: !223, size: 64, offset: 1280)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !185, line: 38, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !184, file: !185, line: 93, baseType: !203, size: 64, offset: 1344)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !184, file: !185, line: 94, baseType: !117, size: 64, offset: 1408)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !184, file: !185, line: 95, baseType: !119, size: 64, offset: 1472)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !184, file: !185, line: 96, baseType: !77, size: 32, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !184, file: !185, line: 98, baseType: !147, size: 160, offset: 1568)
!230 = !DILocalVariable(name: "__cnt", scope: !179, file: !76, line: 644, type: !119)
!231 = !DILocalVariable(name: "url_program", scope: !159, file: !76, line: 648, type: !122)
!232 = !DILocalVariable(name: "__ptr", scope: !233, file: !76, line: 686, type: !122)
!233 = distinct !DILexicalBlock(scope: !159, file: !76, line: 686, column: 3)
!234 = !DILocalVariable(name: "__stream", scope: !233, file: !76, line: 686, type: !181)
!235 = !DILocalVariable(name: "__cnt", scope: !233, file: !76, line: 686, type: !119)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !76, line: 585, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 5)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !76, line: 586, type: !238, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(scope: null, file: !76, line: 595, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(scope: null, file: !76, line: 620, type: !19, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(scope: null, file: !76, line: 648, type: !238, isLocal: true, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !245, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(scope: null, file: !76, line: 649, type: !64, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !76, line: 650, type: !238, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(scope: null, file: !76, line: 651, type: !19, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(scope: null, file: !76, line: 652, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 7)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(scope: null, file: !76, line: 653, type: !274, isLocal: true, isDefinition: true)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 8)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !76, line: 654, type: !54, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !76, line: 655, type: !54, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !76, line: 656, type: !54, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !76, line: 657, type: !54, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !76, line: 663, type: !269, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !76, line: 664, type: !54, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !291, isLocal: true, isDefinition: true)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 17)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(scope: null, file: !76, line: 669, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 40)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !301, isLocal: true, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 15)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(scope: null, file: !76, line: 676, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 61)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(scope: null, file: !76, line: 679, type: !64, isLocal: true, isDefinition: true)
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(scope: null, file: !76, line: 683, type: !238, isLocal: true, isDefinition: true)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(scope: null, file: !76, line: 688, type: !238, isLocal: true, isDefinition: true)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(scope: null, file: !76, line: 691, type: !274, isLocal: true, isDefinition: true)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(scope: null, file: !76, line: 839, type: !133, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !76, line: 840, type: !321, isLocal: true, isDefinition: true)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 22)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(scope: null, file: !76, line: 841, type: !301, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(scope: null, file: !76, line: 862, type: !245, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(scope: null, file: !76, line: 868, type: !330, isLocal: true, isDefinition: true)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 568, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 71)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !76, line: 875, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 27)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !340, isLocal: true, isDefinition: true)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 51)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(scope: null, file: !76, line: 877, type: !345, isLocal: true, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 12)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(scope: null, file: !2, line: 60, type: !350, isLocal: true, isDefinition: true)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 25)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !238, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !2, line: 64, type: !274, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(scope: null, file: !2, line: 65, type: !274, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !238, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !274, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 30)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 1792, elements: !270)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !371, line: 50, size: 256, elements: !372)
!371 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!372 = !{!373, !374, !375, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !370, file: !371, line: 52, baseType: !122, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !370, file: !371, line: 55, baseType: !77, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !370, file: !371, line: 56, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !370, file: !371, line: 57, baseType: !77, size: 32, offset: 192)
!378 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!379 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!380 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !383, line: 32, type: !64, isLocal: true, isDefinition: true)
!383 = !DIFile(filename: "src/prog-fprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8f170eec0f5223b6ba3ae07aa753e06a")
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !386, line: 3, type: !301, isLocal: true, isDefinition: true)
!386 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "Version", scope: !389, file: !386, line: 3, type: !122, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C11, file: !386, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !390, splitDebugInlining: false, nameTableKind: None)
!390 = !{!384, !387}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "file_name", scope: !393, file: !394, line: 45, type: !122, isLocal: true, isDefinition: true)
!393 = distinct !DICompileUnit(language: DW_LANG_C11, file: !394, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !395, splitDebugInlining: false, nameTableKind: None)
!394 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!395 = !{!396, !398, !400, !402, !391, !404}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !269, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !394, line: 121, type: !345, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !394, line: 123, type: !269, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(scope: null, file: !394, line: 126, type: !64, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !393, file: !394, line: 55, type: !152, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !408, file: !409, line: 66, type: !460, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C11, file: !409, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !410, globals: !411, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!410 = !{!117, !124}
!411 = !{!412, !414, !439, !441, !443, !445, !406, !447, !449, !451, !453, !458}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !409, line: 272, type: !238, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "old_file_name", scope: !416, file: !409, line: 304, type: !122, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "verror_at_line", scope: !409, file: !409, line: 298, type: !417, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !432)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !77, !77, !122, !72, !122, !419}
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !420, line: 52, baseType: !421)
!420 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !422, line: 14, baseType: !423)
!422 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !424, baseType: !425)
!424 = !DIFile(filename: "lib/error.c", directory: "/src")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !426)
!426 = !{!427, !428, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !425, file: !424, baseType: !117, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !425, file: !424, baseType: !117, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !425, file: !424, baseType: !117, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !425, file: !424, baseType: !77, size: 32, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !425, file: !424, baseType: !77, size: 32, offset: 224)
!432 = !{!433, !434, !435, !436, !437, !438}
!433 = !DILocalVariable(name: "status", arg: 1, scope: !416, file: !409, line: 298, type: !77)
!434 = !DILocalVariable(name: "errnum", arg: 2, scope: !416, file: !409, line: 298, type: !77)
!435 = !DILocalVariable(name: "file_name", arg: 3, scope: !416, file: !409, line: 298, type: !122)
!436 = !DILocalVariable(name: "line_number", arg: 4, scope: !416, file: !409, line: 298, type: !72)
!437 = !DILocalVariable(name: "message", arg: 5, scope: !416, file: !409, line: 298, type: !122)
!438 = !DILocalVariable(name: "args", arg: 6, scope: !416, file: !409, line: 298, type: !419)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "old_line_number", scope: !416, file: !409, line: 305, type: !72, isLocal: true, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !409, line: 338, type: !245, isLocal: true, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !274, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(scope: null, file: !409, line: 346, type: !252, isLocal: true, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "error_message_count", scope: !408, file: !409, line: 69, type: !72, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !408, file: !409, line: 295, type: !77, isLocal: false, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !269, isLocal: true, isDefinition: true)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !409, line: 208, type: !455, isLocal: true, isDefinition: true)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 21)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(scope: null, file: !409, line: 214, type: !238, isLocal: true, isDefinition: true)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "program_name", scope: !465, file: !466, line: 31, type: !122, isLocal: false, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C11, file: !466, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !467, globals: !468, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!467 = !{!116}
!468 = !{!463, !469, !471}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(scope: null, file: !466, line: 46, type: !274, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(scope: null, file: !466, line: 49, type: !245, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "utf07FF", scope: !475, file: !476, line: 46, type: !503, isLocal: true, isDefinition: true)
!475 = distinct !DISubprogram(name: "proper_name_lite", scope: !476, file: !476, line: 38, type: !477, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !479, retainedNodes: !481)
!476 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!477 = !DISubroutineType(types: !478)
!478 = !{!122, !122, !122}
!479 = distinct !DICompileUnit(language: DW_LANG_C11, file: !476, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !480, splitDebugInlining: false, nameTableKind: None)
!480 = !{!473}
!481 = !{!482, !483, !484, !485, !490}
!482 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !475, file: !476, line: 38, type: !122)
!483 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !475, file: !476, line: 38, type: !122)
!484 = !DILocalVariable(name: "translation", scope: !475, file: !476, line: 40, type: !122)
!485 = !DILocalVariable(name: "w", scope: !475, file: !476, line: 47, type: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !487, line: 37, baseType: !488)
!487 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !208, line: 57, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !208, line: 42, baseType: !72)
!490 = !DILocalVariable(name: "mbs", scope: !475, file: !476, line: 48, type: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !492, line: 6, baseType: !493)
!492 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !494, line: 21, baseType: !495)
!494 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 13, size: 64, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !495, file: !494, line: 15, baseType: !77, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !495, file: !494, line: 20, baseType: !499, size: 32, offset: 32)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !495, file: !494, line: 16, size: 32, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !499, file: !494, line: 18, baseType: !72, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !499, file: !494, line: 19, baseType: !245, size: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 16, elements: !253)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(scope: null, file: !506, line: 78, type: !274, isLocal: true, isDefinition: true)
!506 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(scope: null, file: !506, line: 79, type: !19, isLocal: true, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(scope: null, file: !506, line: 80, type: !511, isLocal: true, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 13)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !506, line: 81, type: !511, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(scope: null, file: !506, line: 82, type: !147, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(scope: null, file: !506, line: 83, type: !252, isLocal: true, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(scope: null, file: !506, line: 84, type: !274, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(scope: null, file: !506, line: 85, type: !269, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !506, line: 86, type: !269, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(scope: null, file: !506, line: 87, type: !274, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !530, file: !506, line: 76, type: !602, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C11, file: !506, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !531, retainedTypes: !537, globals: !538, splitDebugInlining: false, nameTableKind: None)
!531 = !{!81, !532, !95}
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !82, line: 254, baseType: !72, size: 32, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!535 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!536 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!537 = !{!77, !118, !119}
!538 = !{!504, !507, !509, !514, !516, !518, !520, !522, !524, !526, !528, !539, !543, !553, !555, !560, !562, !564, !566, !568, !591, !598, !600}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !530, file: !506, line: 92, type: !541, isLocal: false, isDefinition: true)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 320, elements: !55)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !530, file: !506, line: 1040, type: !545, isLocal: false, isDefinition: true)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !506, line: 56, size: 448, elements: !546)
!546 = !{!547, !548, !549, !551, !552}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !545, file: !506, line: 59, baseType: !81, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !506, line: 62, baseType: !77, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !545, file: !506, line: 66, baseType: !550, size: 256, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 256, elements: !275)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !545, file: !506, line: 69, baseType: !122, size: 64, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !545, file: !506, line: 72, baseType: !122, size: 64, offset: 384)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !530, file: !506, line: 107, type: !545, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "slot0", scope: !530, file: !506, line: 831, type: !557, isLocal: true, isDefinition: true)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 256)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(scope: null, file: !506, line: 321, type: !252, isLocal: true, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(scope: null, file: !506, line: 357, type: !252, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(scope: null, file: !506, line: 358, type: !252, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(scope: null, file: !506, line: 199, type: !269, isLocal: true, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "quote", scope: !570, file: !506, line: 228, type: !589, isLocal: true, isDefinition: true)
!570 = distinct !DISubprogram(name: "gettext_quote", scope: !506, file: !506, line: 197, type: !571, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !530, retainedNodes: !573)
!571 = !DISubroutineType(types: !572)
!572 = !{!122, !122, !81}
!573 = !{!574, !575, !576, !577, !578}
!574 = !DILocalVariable(name: "msgid", arg: 1, scope: !570, file: !506, line: 197, type: !122)
!575 = !DILocalVariable(name: "s", arg: 2, scope: !570, file: !506, line: 197, type: !81)
!576 = !DILocalVariable(name: "translation", scope: !570, file: !506, line: 199, type: !122)
!577 = !DILocalVariable(name: "w", scope: !570, file: !506, line: 229, type: !486)
!578 = !DILocalVariable(name: "mbs", scope: !570, file: !506, line: 230, type: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !492, line: 6, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !494, line: 21, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 13, size: 64, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !581, file: !494, line: 15, baseType: !77, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !581, file: !494, line: 20, baseType: !585, size: 32, offset: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !581, file: !494, line: 16, size: 32, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !585, file: !494, line: 18, baseType: !72, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !585, file: !494, line: 19, baseType: !245, size: 32)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !590)
!590 = !{!254, !247}
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "slotvec", scope: !530, file: !506, line: 834, type: !593, isLocal: true, isDefinition: true)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !506, line: 823, size: 128, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !594, file: !506, line: 825, baseType: !119, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !594, file: !506, line: 826, baseType: !116, size: 64, offset: 64)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "nslots", scope: !530, file: !506, line: 832, type: !77, isLocal: true, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "slotvec0", scope: !530, file: !506, line: 833, type: !594, isLocal: true, isDefinition: true)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 704, elements: !604)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!604 = !{!605}
!605 = !DISubrange(count: 11)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(scope: null, file: !608, line: 67, type: !345, isLocal: true, isDefinition: true)
!608 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(scope: null, file: !608, line: 69, type: !269, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(scope: null, file: !608, line: 83, type: !269, isLocal: true, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(scope: null, file: !608, line: 83, type: !245, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !608, line: 85, type: !252, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !608, line: 88, type: !619, isLocal: true, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 171)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(scope: null, file: !608, line: 88, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 34)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !608, line: 105, type: !133, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !608, line: 109, type: !140, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !608, line: 113, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 28)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(scope: null, file: !608, line: 120, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(scope: null, file: !608, line: 127, type: !9, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(scope: null, file: !608, line: 134, type: !296, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(scope: null, file: !608, line: 142, type: !647, isLocal: true, isDefinition: true)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 44)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(scope: null, file: !608, line: 150, type: !14, isLocal: true, isDefinition: true)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(scope: null, file: !608, line: 159, type: !654, isLocal: true, isDefinition: true)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 52)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(scope: null, file: !608, line: 170, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 60)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(scope: null, file: !608, line: 248, type: !147, isLocal: true, isDefinition: true)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(scope: null, file: !608, line: 248, type: !321, isLocal: true, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(scope: null, file: !608, line: 254, type: !147, isLocal: true, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(scope: null, file: !608, line: 254, type: !128, isLocal: true, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(scope: null, file: !608, line: 254, type: !296, isLocal: true, isDefinition: true)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(scope: null, file: !608, line: 259, type: !3, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(scope: null, file: !608, line: 259, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 29)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !681, file: !682, line: 26, type: !684, isLocal: false, isDefinition: true)
!681 = distinct !DICompileUnit(language: DW_LANG_C11, file: !682, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !683, splitDebugInlining: false, nameTableKind: None)
!682 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!683 = !{!679}
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 376, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 47)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "exit_failure", scope: !689, file: !690, line: 24, type: !692, isLocal: false, isDefinition: true)
!689 = distinct !DICompileUnit(language: DW_LANG_C11, file: !690, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !691, splitDebugInlining: false, nameTableKind: None)
!690 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!691 = !{!687}
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !77)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(scope: null, file: !695, line: 34, type: !64, isLocal: true, isDefinition: true)
!695 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(scope: null, file: !695, line: 34, type: !269, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(scope: null, file: !695, line: 34, type: !291, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(scope: null, file: !702, line: 108, type: !49, isLocal: true, isDefinition: true)
!702 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "internal_state", scope: !705, file: !702, line: 97, type: !708, isLocal: true, isDefinition: true)
!705 = distinct !DICompileUnit(language: DW_LANG_C11, file: !702, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !706, globals: !707, splitDebugInlining: false, nameTableKind: None)
!706 = !{!117, !119, !124}
!707 = !{!700, !703}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !492, line: 6, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !494, line: 21, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 13, size: 64, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !710, file: !494, line: 15, baseType: !77, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !710, file: !494, line: 20, baseType: !714, size: 32, offset: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !710, file: !494, line: 16, size: 32, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !714, file: !494, line: 18, baseType: !72, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !714, file: !494, line: 19, baseType: !245, size: 32)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(scope: null, file: !720, line: 35, type: !252, isLocal: true, isDefinition: true)
!720 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(scope: null, file: !720, line: 35, type: !19, isLocal: true, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C11, file: !383, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !724, globals: !725, splitDebugInlining: false, nameTableKind: None)
!724 = !{!124}
!725 = !{!381}
!726 = distinct !DICompileUnit(language: DW_LANG_C11, file: !727, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "lib/stripslash.c", directory: "/src", checksumkind: CSK_MD5, checksum: "128a5f12cafc5019074f64cf3b3d799b")
!728 = distinct !DICompileUnit(language: DW_LANG_C11, file: !729, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!730 = distinct !DICompileUnit(language: DW_LANG_C11, file: !608, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !731, retainedTypes: !735, globals: !736, splitDebugInlining: false, nameTableKind: None)
!731 = !{!732}
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 40, baseType: !72, size: 32, elements: !733)
!733 = !{!734}
!734 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!735 = !{!117}
!736 = !{!606, !609, !611, !613, !615, !617, !622, !627, !629, !631, !636, !641, !643, !645, !650, !652, !657, !662, !664, !666, !668, !670, !672, !674}
!737 = distinct !DICompileUnit(language: DW_LANG_C11, file: !738, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !739, retainedTypes: !770, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!739 = !{!740, !752}
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !741, file: !738, line: 188, baseType: !72, size: 32, elements: !750)
!741 = distinct !DISubprogram(name: "x2nrealloc", scope: !738, file: !738, line: 176, type: !742, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !737, retainedNodes: !745)
!742 = !DISubroutineType(types: !743)
!743 = !{!117, !117, !744, !119}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!745 = !{!746, !747, !748, !749}
!746 = !DILocalVariable(name: "p", arg: 1, scope: !741, file: !738, line: 176, type: !117)
!747 = !DILocalVariable(name: "pn", arg: 2, scope: !741, file: !738, line: 176, type: !744)
!748 = !DILocalVariable(name: "s", arg: 3, scope: !741, file: !738, line: 176, type: !119)
!749 = !DILocalVariable(name: "n", scope: !741, file: !738, line: 178, type: !119)
!750 = !{!751}
!751 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !753, file: !738, line: 228, baseType: !72, size: 32, elements: !750)
!753 = distinct !DISubprogram(name: "xpalloc", scope: !738, file: !738, line: 223, type: !754, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !737, retainedNodes: !760)
!754 = !DISubroutineType(types: !755)
!755 = !{!117, !117, !756, !757, !759, !757}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "idx_t", file: !758, line: 130, baseType: !759)
!758 = !DIFile(filename: "./lib/idx.h", directory: "/src", checksumkind: CSK_MD5, checksum: "0d05a20b05e839c55efc1b1ccc3db29e")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !120, line: 35, baseType: !209)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769}
!761 = !DILocalVariable(name: "pa", arg: 1, scope: !753, file: !738, line: 223, type: !117)
!762 = !DILocalVariable(name: "pn", arg: 2, scope: !753, file: !738, line: 223, type: !756)
!763 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !753, file: !738, line: 223, type: !757)
!764 = !DILocalVariable(name: "n_max", arg: 4, scope: !753, file: !738, line: 223, type: !759)
!765 = !DILocalVariable(name: "s", arg: 5, scope: !753, file: !738, line: 223, type: !757)
!766 = !DILocalVariable(name: "n0", scope: !753, file: !738, line: 230, type: !757)
!767 = !DILocalVariable(name: "n", scope: !753, file: !738, line: 237, type: !757)
!768 = !DILocalVariable(name: "nbytes", scope: !753, file: !738, line: 248, type: !757)
!769 = !DILocalVariable(name: "adjusted_nbytes", scope: !753, file: !738, line: 252, type: !757)
!770 = !{!116, !117, !152, !209, !121}
!771 = distinct !DICompileUnit(language: DW_LANG_C11, file: !695, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !772, splitDebugInlining: false, nameTableKind: None)
!772 = !{!693, !696, !698}
!773 = distinct !DICompileUnit(language: DW_LANG_C11, file: !774, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !467, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "lib/basename-lgpl.c", directory: "/src", checksumkind: CSK_MD5, checksum: "0c866bbc0b14fb4f9b15561a581e91dd")
!775 = distinct !DICompileUnit(language: DW_LANG_C11, file: !776, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!776 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!777 = distinct !DICompileUnit(language: DW_LANG_C11, file: !778, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!778 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!779 = distinct !DICompileUnit(language: DW_LANG_C11, file: !780, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!780 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!781 = distinct !DICompileUnit(language: DW_LANG_C11, file: !782, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!782 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!783 = distinct !DICompileUnit(language: DW_LANG_C11, file: !784, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !785, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!785 = !{!152, !121, !117}
!786 = distinct !DICompileUnit(language: DW_LANG_C11, file: !720, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !787, splitDebugInlining: false, nameTableKind: None)
!787 = !{!718, !721}
!788 = distinct !DICompileUnit(language: DW_LANG_C11, file: !789, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!790 = distinct !DICompileUnit(language: DW_LANG_C11, file: !791, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!792 = !{!"Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)"}
!793 = !{i32 7, !"Dwarf Version", i32 5}
!794 = !{i32 2, !"Debug Info Version", i32 3}
!795 = !{i32 1, !"wchar_size", i32 4}
!796 = !{i32 8, !"PIC Level", i32 2}
!797 = !{i32 7, !"PIE Level", i32 2}
!798 = !{i32 7, !"uwtable", i32 2}
!799 = !{i32 7, !"frame-pointer", i32 1}
!800 = distinct !DISubprogram(name: "usage", scope: !2, file: !2, line: 166, type: !801, scopeLine: 167, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !803)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !77}
!803 = !{!804}
!804 = !DILocalVariable(name: "status", arg: 1, scope: !800, file: !2, line: 166, type: !77)
!805 = !DILocation(line: 0, scope: !800)
!806 = !DILocation(line: 168, column: 14, scope: !807)
!807 = distinct !DILexicalBlock(scope: !800, file: !2, line: 168, column: 7)
!808 = !DILocation(line: 168, column: 7, scope: !800)
!809 = !DILocation(line: 169, column: 5, scope: !810)
!810 = distinct !DILexicalBlock(scope: !807, file: !2, line: 169, column: 5)
!811 = !{!812, !812, i64 0}
!812 = !{!"any pointer", !813, i64 0}
!813 = !{!"omnipotent char", !814, i64 0}
!814 = !{!"Simple C/C++ TBAA"}
!815 = !DILocation(line: 172, column: 7, scope: !816)
!816 = distinct !DILexicalBlock(scope: !807, file: !2, line: 171, column: 5)
!817 = !DILocation(line: 173, column: 7, scope: !816)
!818 = !DILocation(line: 177, column: 7, scope: !816)
!819 = !DILocation(line: 181, column: 7, scope: !816)
!820 = !DILocation(line: 186, column: 7, scope: !816)
!821 = !DILocation(line: 190, column: 7, scope: !816)
!822 = !DILocation(line: 191, column: 7, scope: !816)
!823 = !DILocalVariable(name: "program", arg: 1, scope: !824, file: !76, line: 836, type: !122)
!824 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !76, file: !76, line: 836, type: !825, scopeLine: 837, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !827)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !122}
!827 = !{!823, !828, !835, !836, !838, !839}
!828 = !DILocalVariable(name: "infomap", scope: !824, file: !76, line: 838, type: !829)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 896, elements: !270)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !824, file: !76, line: 838, size: 128, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !831, file: !76, line: 838, baseType: !122, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !831, file: !76, line: 838, baseType: !122, size: 64, offset: 64)
!835 = !DILocalVariable(name: "node", scope: !824, file: !76, line: 848, type: !122)
!836 = !DILocalVariable(name: "map_prog", scope: !824, file: !76, line: 849, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!838 = !DILocalVariable(name: "lc_messages", scope: !824, file: !76, line: 861, type: !122)
!839 = !DILocalVariable(name: "url_program", scope: !824, file: !76, line: 874, type: !122)
!840 = !DILocation(line: 0, scope: !824, inlinedAt: !841)
!841 = distinct !DILocation(line: 192, column: 7, scope: !816)
!842 = !DILocation(line: 857, column: 3, scope: !824, inlinedAt: !841)
!843 = !DILocation(line: 861, column: 29, scope: !824, inlinedAt: !841)
!844 = !DILocation(line: 862, column: 7, scope: !845, inlinedAt: !841)
!845 = distinct !DILexicalBlock(scope: !824, file: !76, line: 862, column: 7)
!846 = !DILocation(line: 862, column: 19, scope: !845, inlinedAt: !841)
!847 = !DILocation(line: 862, column: 22, scope: !845, inlinedAt: !841)
!848 = !DILocation(line: 862, column: 7, scope: !824, inlinedAt: !841)
!849 = !DILocation(line: 868, column: 7, scope: !850, inlinedAt: !841)
!850 = distinct !DILexicalBlock(scope: !845, file: !76, line: 863, column: 5)
!851 = !DILocation(line: 870, column: 5, scope: !850, inlinedAt: !841)
!852 = !DILocation(line: 875, column: 3, scope: !824, inlinedAt: !841)
!853 = !DILocation(line: 877, column: 3, scope: !824, inlinedAt: !841)
!854 = !DILocation(line: 194, column: 3, scope: !800)
!855 = !DISubprogram(name: "dcgettext", scope: !856, file: !856, line: 51, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!856 = !DIFile(filename: "/usr/include/libintl.h", directory: "", checksumkind: CSK_MD5, checksum: "0e31399b9c91d643f160b16e3e368c5b")
!857 = !DISubroutineType(types: !858)
!858 = !{!116, !122, !122, !77}
!859 = !{}
!860 = !DISubprogram(name: "__fprintf_chk", scope: !861, file: !861, line: 93, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!861 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdio2.h", directory: "", checksumkind: CSK_MD5, checksum: "86bbab96f1ef93a34d34cc28d8ca9c41")
!862 = !DISubroutineType(types: !863)
!863 = !{!77, !864, !77, !865, null}
!864 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !181)
!865 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !122)
!866 = !DISubprogram(name: "__printf_chk", scope: !861, file: !861, line: 95, type: !867, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!867 = !DISubroutineType(types: !868)
!868 = !{!77, !77, !865, null}
!869 = !DISubprogram(name: "fputs_unlocked", scope: !420, file: !420, line: 691, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!870 = !DISubroutineType(types: !871)
!871 = !{!77, !865, !864}
!872 = !DILocation(line: 0, scope: !159)
!873 = !DILocation(line: 581, column: 7, scope: !167)
!874 = !{!875, !875, i64 0}
!875 = !{!"int", !813, i64 0}
!876 = !DILocation(line: 581, column: 19, scope: !167)
!877 = !DILocation(line: 581, column: 7, scope: !159)
!878 = !DILocation(line: 585, column: 26, scope: !166)
!879 = !DILocation(line: 0, scope: !166)
!880 = !DILocation(line: 586, column: 23, scope: !166)
!881 = !DILocation(line: 586, column: 28, scope: !166)
!882 = !DILocation(line: 586, column: 32, scope: !166)
!883 = !{!813, !813, i64 0}
!884 = !DILocation(line: 586, column: 38, scope: !166)
!885 = !DILocalVariable(name: "__s1", arg: 1, scope: !886, file: !887, line: 1359, type: !122)
!886 = distinct !DISubprogram(name: "streq", scope: !887, file: !887, line: 1359, type: !888, scopeLine: 1360, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !890)
!887 = !DIFile(filename: "./lib/string.h", directory: "/src")
!888 = !DISubroutineType(types: !889)
!889 = !{!152, !122, !122}
!890 = !{!885, !891}
!891 = !DILocalVariable(name: "__s2", arg: 2, scope: !886, file: !887, line: 1359, type: !122)
!892 = !DILocation(line: 0, scope: !886, inlinedAt: !893)
!893 = distinct !DILocation(line: 586, column: 41, scope: !166)
!894 = !DILocation(line: 1361, column: 11, scope: !886, inlinedAt: !893)
!895 = !DILocation(line: 1361, column: 10, scope: !886, inlinedAt: !893)
!896 = !DILocation(line: 586, column: 19, scope: !166)
!897 = !DILocation(line: 587, column: 5, scope: !166)
!898 = !DILocation(line: 588, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !159, file: !76, line: 588, column: 7)
!900 = !DILocation(line: 588, column: 7, scope: !159)
!901 = !DILocation(line: 590, column: 7, scope: !902)
!902 = distinct !DILexicalBlock(scope: !899, file: !76, line: 589, column: 5)
!903 = !DILocation(line: 591, column: 7, scope: !902)
!904 = !DILocation(line: 595, column: 37, scope: !159)
!905 = !DILocation(line: 595, column: 35, scope: !159)
!906 = !DILocation(line: 596, column: 29, scope: !159)
!907 = !DILocation(line: 597, column: 8, scope: !174)
!908 = !DILocation(line: 597, column: 7, scope: !159)
!909 = !DILocation(line: 604, column: 24, scope: !173)
!910 = !DILocation(line: 604, column: 12, scope: !174)
!911 = !DILocation(line: 0, scope: !172)
!912 = !DILocation(line: 610, column: 16, scope: !172)
!913 = !DILocation(line: 610, column: 7, scope: !172)
!914 = !DILocation(line: 611, column: 21, scope: !172)
!915 = !{!916, !916, i64 0}
!916 = !{!"short", !813, i64 0}
!917 = !DILocation(line: 611, column: 19, scope: !172)
!918 = !DILocation(line: 611, column: 16, scope: !172)
!919 = !DILocation(line: 610, column: 30, scope: !172)
!920 = distinct !{!920, !913, !914, !921}
!921 = !{!"llvm.loop.mustprogress"}
!922 = !DILocation(line: 612, column: 18, scope: !923)
!923 = distinct !DILexicalBlock(scope: !172, file: !76, line: 612, column: 11)
!924 = !DILocation(line: 612, column: 11, scope: !172)
!925 = !DILocation(line: 620, column: 23, scope: !159)
!926 = !DILocation(line: 625, column: 39, scope: !159)
!927 = !DILocation(line: 626, column: 3, scope: !159)
!928 = !DILocation(line: 626, column: 10, scope: !159)
!929 = !DILocation(line: 626, column: 21, scope: !159)
!930 = !DILocation(line: 628, column: 44, scope: !931)
!931 = distinct !DILexicalBlock(scope: !932, file: !76, line: 628, column: 11)
!932 = distinct !DILexicalBlock(scope: !159, file: !76, line: 627, column: 5)
!933 = !DILocation(line: 628, column: 32, scope: !931)
!934 = !DILocation(line: 628, column: 49, scope: !931)
!935 = !DILocation(line: 628, column: 11, scope: !932)
!936 = !DILocation(line: 630, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !932, file: !76, line: 630, column: 11)
!938 = !DILocation(line: 630, column: 11, scope: !932)
!939 = !DILocation(line: 632, column: 26, scope: !940)
!940 = distinct !DILexicalBlock(scope: !941, file: !76, line: 632, column: 15)
!941 = distinct !DILexicalBlock(scope: !937, file: !76, line: 631, column: 9)
!942 = !DILocation(line: 632, column: 34, scope: !940)
!943 = !DILocation(line: 632, column: 37, scope: !940)
!944 = !DILocation(line: 632, column: 15, scope: !941)
!945 = !DILocation(line: 640, column: 16, scope: !932)
!946 = distinct !{!946, !927, !947, !921}
!947 = !DILocation(line: 641, column: 5, scope: !159)
!948 = !DILocation(line: 644, column: 3, scope: !159)
!949 = !DILocation(line: 0, scope: !886, inlinedAt: !950)
!950 = distinct !DILocation(line: 648, column: 31, scope: !159)
!951 = !DILocation(line: 0, scope: !886, inlinedAt: !952)
!952 = distinct !DILocation(line: 649, column: 31, scope: !159)
!953 = !DILocation(line: 0, scope: !886, inlinedAt: !954)
!954 = distinct !DILocation(line: 650, column: 31, scope: !159)
!955 = !DILocation(line: 0, scope: !886, inlinedAt: !956)
!956 = distinct !DILocation(line: 651, column: 31, scope: !159)
!957 = !DILocation(line: 0, scope: !886, inlinedAt: !958)
!958 = distinct !DILocation(line: 652, column: 31, scope: !159)
!959 = !DILocation(line: 0, scope: !886, inlinedAt: !960)
!960 = distinct !DILocation(line: 653, column: 31, scope: !159)
!961 = !DILocation(line: 0, scope: !886, inlinedAt: !962)
!962 = distinct !DILocation(line: 654, column: 31, scope: !159)
!963 = !DILocation(line: 0, scope: !886, inlinedAt: !964)
!964 = distinct !DILocation(line: 655, column: 31, scope: !159)
!965 = !DILocation(line: 0, scope: !886, inlinedAt: !966)
!966 = distinct !DILocation(line: 656, column: 31, scope: !159)
!967 = !DILocation(line: 0, scope: !886, inlinedAt: !968)
!968 = distinct !DILocation(line: 657, column: 31, scope: !159)
!969 = !DILocation(line: 663, column: 7, scope: !970)
!970 = distinct !DILexicalBlock(scope: !159, file: !76, line: 663, column: 7)
!971 = !DILocation(line: 664, column: 7, scope: !970)
!972 = !DILocation(line: 664, column: 10, scope: !970)
!973 = !DILocation(line: 663, column: 7, scope: !159)
!974 = !DILocation(line: 669, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !76, line: 665, column: 5)
!976 = !DILocation(line: 671, column: 5, scope: !975)
!977 = !DILocation(line: 676, column: 7, scope: !978)
!978 = distinct !DILexicalBlock(scope: !970, file: !76, line: 673, column: 5)
!979 = !DILocation(line: 679, column: 3, scope: !159)
!980 = !DILocation(line: 683, column: 3, scope: !159)
!981 = !DILocation(line: 686, column: 3, scope: !159)
!982 = !DILocation(line: 688, column: 3, scope: !159)
!983 = !DILocation(line: 691, column: 3, scope: !159)
!984 = !DILocation(line: 695, column: 3, scope: !159)
!985 = !DILocation(line: 696, column: 1, scope: !159)
!986 = !DISubprogram(name: "setlocale", scope: !987, file: !987, line: 122, type: !988, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!987 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "a1d177e0f311dc60a74cb347049d75bc")
!988 = !DISubroutineType(types: !989)
!989 = !{!116, !77, !122}
!990 = !DISubprogram(name: "strncmp", scope: !991, file: !991, line: 159, type: !992, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!991 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!992 = !DISubroutineType(types: !993)
!993 = !{!77, !122, !122, !119}
!994 = !DISubprogram(name: "exit", scope: !995, file: !995, line: 624, type: !801, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !859)
!995 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!996 = !DISubprogram(name: "getenv", scope: !995, file: !995, line: 641, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!997 = !DISubroutineType(types: !998)
!998 = !{!116, !122}
!999 = !DISubprogram(name: "strcmp", scope: !991, file: !991, line: 156, type: !1000, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!77, !122, !122}
!1002 = !DISubprogram(name: "strspn", scope: !991, file: !991, line: 297, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!121, !122, !122}
!1005 = !DISubprogram(name: "strchr", scope: !991, file: !991, line: 246, type: !1006, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!116, !122, !77}
!1008 = !DISubprogram(name: "__ctype_b_loc", scope: !96, file: !96, line: 79, type: !1009, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1011}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!1014 = !DISubprogram(name: "strcspn", scope: !991, file: !991, line: 293, type: !1003, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1015 = !DISubprogram(name: "fwrite_unlocked", scope: !420, file: !420, line: 704, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!119, !1018, !119, !119, !864}
!1018 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1021 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 198, type: !1022, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1025)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!77, !77, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1034, !1037, !1038, !1041, !1079, !1080}
!1026 = !DILocalVariable(name: "argc", arg: 1, scope: !1021, file: !2, line: 198, type: !77)
!1027 = !DILocalVariable(name: "argv", arg: 2, scope: !1021, file: !2, line: 198, type: !1024)
!1028 = !DILocalVariable(name: "optc", scope: !1021, file: !2, line: 208, type: !77)
!1029 = !DILocalVariable(name: "ok", scope: !1021, file: !2, line: 235, type: !152)
!1030 = !DILocalVariable(name: "dir", scope: !1031, file: !2, line: 238, type: !116)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !2, line: 237, column: 5)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !2, line: 236, column: 3)
!1033 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 236, column: 3)
!1034 = !DILocalVariable(name: "rmdir_errno", scope: !1035, file: !2, line: 246, type: !77)
!1035 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 245, column: 9)
!1036 = distinct !DILexicalBlock(scope: !1031, file: !2, line: 244, column: 11)
!1037 = !DILocalVariable(name: "custom_error", scope: !1035, file: !2, line: 255, type: !152)
!1038 = !DILocalVariable(name: "last_unix_slash", scope: !1039, file: !2, line: 258, type: !122)
!1039 = distinct !DILexicalBlock(scope: !1040, file: !2, line: 257, column: 13)
!1040 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 256, column: 15)
!1041 = !DILocalVariable(name: "st", scope: !1042, file: !2, line: 261, type: !1044)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !2, line: 260, column: 17)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !2, line: 259, column: 19)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1045, line: 44, size: 1024, elements: !1046)
!1045 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "", checksumkind: CSK_MD5, checksum: "910289113a4b669f8271729077b0f267")
!1046 = !{!1047, !1049, !1051, !1053, !1055, !1057, !1059, !1060, !1061, !1062, !1064, !1065, !1067, !1075, !1076, !1077}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1044, file: !1045, line: 46, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !208, line: 145, baseType: !121)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1044, file: !1045, line: 47, baseType: !1050, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !208, line: 148, baseType: !121)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1044, file: !1045, line: 48, baseType: !1052, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !208, line: 150, baseType: !72)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1044, file: !1045, line: 49, baseType: !1054, size: 32, offset: 160)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !208, line: 151, baseType: !72)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1044, file: !1045, line: 50, baseType: !1056, size: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !208, line: 146, baseType: !72)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1044, file: !1045, line: 51, baseType: !1058, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !208, line: 147, baseType: !72)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1044, file: !1045, line: 52, baseType: !1048, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1044, file: !1045, line: 53, baseType: !1048, size: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1044, file: !1045, line: 54, baseType: !207, size: 64, offset: 384)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1044, file: !1045, line: 55, baseType: !1063, size: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !208, line: 175, baseType: !77)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1044, file: !1045, line: 56, baseType: !77, size: 32, offset: 480)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1044, file: !1045, line: 57, baseType: !1066, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !208, line: 180, baseType: !209)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1044, file: !1045, line: 65, baseType: !1068, size: 128, offset: 576)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1069, line: 11, size: 128, elements: !1070)
!1069 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "", checksumkind: CSK_MD5, checksum: "55dc154df3f21a5aa944dcafba9b43f6")
!1070 = !{!1071, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1068, file: !1069, line: 16, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !208, line: 160, baseType: !209)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1068, file: !1069, line: 21, baseType: !1074, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !208, line: 197, baseType: !209)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1044, file: !1045, line: 66, baseType: !1068, size: 128, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1044, file: !1045, line: 67, baseType: !1068, size: 128, offset: 832)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1044, file: !1045, line: 79, baseType: !1078, size: 64, offset: 960)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !253)
!1079 = !DILocalVariable(name: "ret", scope: !1042, file: !2, line: 262, type: !77)
!1080 = !DILocalVariable(name: "dir_arg", scope: !1081, file: !2, line: 268, type: !116)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !2, line: 266, column: 21)
!1082 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 264, column: 23)
!1083 = !DILocation(line: 0, scope: !1021)
!1084 = !DILocation(line: 201, column: 21, scope: !1021)
!1085 = !DILocation(line: 201, column: 3, scope: !1021)
!1086 = !DILocation(line: 202, column: 3, scope: !1021)
!1087 = !DILocation(line: 203, column: 3, scope: !1021)
!1088 = !DILocation(line: 204, column: 3, scope: !1021)
!1089 = !DILocation(line: 206, column: 3, scope: !1021)
!1090 = !DILocation(line: 209, column: 3, scope: !1021)
!1091 = !DILocation(line: 209, column: 18, scope: !1021)
!1092 = !DILocation(line: 218, column: 11, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1094, file: !2, line: 212, column: 9)
!1094 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 210, column: 5)
!1095 = !DILocation(line: 221, column: 11, scope: !1093)
!1096 = !DILocation(line: 222, column: 9, scope: !1093)
!1097 = !DILocation(line: 223, column: 9, scope: !1093)
!1098 = !DILocation(line: 225, column: 11, scope: !1093)
!1099 = !DILocation(line: 0, scope: !1093)
!1100 = distinct !{!1100, !1090, !1101, !921}
!1101 = !DILocation(line: 227, column: 5, scope: !1021)
!1102 = !DILocation(line: 229, column: 7, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1021, file: !2, line: 229, column: 7)
!1104 = !DILocation(line: 229, column: 14, scope: !1103)
!1105 = !DILocation(line: 229, column: 7, scope: !1021)
!1106 = !DILocation(line: 236, column: 17, scope: !1032)
!1107 = !DILocation(line: 236, column: 3, scope: !1033)
!1108 = !DILocation(line: 231, column: 7, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1103, file: !2, line: 230, column: 5)
!1110 = !DILocation(line: 232, column: 7, scope: !1109)
!1111 = !DILocation(line: 238, column: 19, scope: !1031)
!1112 = !DILocation(line: 0, scope: !1031)
!1113 = !DILocation(line: 241, column: 11, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1031, file: !2, line: 241, column: 11)
!1115 = !DILocation(line: 241, column: 11, scope: !1031)
!1116 = !DILocation(line: 242, column: 23, scope: !1114)
!1117 = !DILocation(line: 242, column: 31, scope: !1114)
!1118 = !DILocation(line: 242, column: 60, scope: !1114)
!1119 = !DILocation(line: 242, column: 9, scope: !1114)
!1120 = !DILocation(line: 244, column: 11, scope: !1036)
!1121 = !DILocation(line: 244, column: 23, scope: !1036)
!1122 = !DILocation(line: 244, column: 11, scope: !1031)
!1123 = !DILocation(line: 246, column: 29, scope: !1035)
!1124 = !DILocation(line: 0, scope: !1035)
!1125 = !DILocation(line: 247, column: 15, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 247, column: 15)
!1127 = !DILocation(line: 247, column: 15, scope: !1035)
!1128 = !DILocation(line: 256, column: 27, scope: !1040)
!1129 = !DILocation(line: 256, column: 15, scope: !1035)
!1130 = !DILocation(line: 258, column: 45, scope: !1039)
!1131 = !DILocation(line: 0, scope: !1039)
!1132 = !DILocation(line: 259, column: 19, scope: !1043)
!1133 = !DILocation(line: 259, column: 35, scope: !1043)
!1134 = !DILocation(line: 259, column: 57, scope: !1043)
!1135 = !DILocation(line: 259, column: 39, scope: !1043)
!1136 = !DILocation(line: 259, column: 62, scope: !1043)
!1137 = !DILocation(line: 259, column: 19, scope: !1039)
!1138 = !DILocation(line: 261, column: 19, scope: !1042)
!1139 = !DILocation(line: 261, column: 31, scope: !1042)
!1140 = !DILocation(line: 262, column: 29, scope: !1042)
!1141 = !DILocation(line: 0, scope: !1042)
!1142 = !DILocation(line: 264, column: 33, scope: !1082)
!1143 = !DILocation(line: 264, column: 36, scope: !1082)
!1144 = !DILocation(line: 264, column: 42, scope: !1082)
!1145 = !DILocation(line: 265, column: 23, scope: !1082)
!1146 = !DILocation(line: 265, column: 39, scope: !1082)
!1147 = !{!1148, !875, i64 16}
!1148 = !{!"stat", !1149, i64 0, !1149, i64 8, !875, i64 16, !875, i64 20, !875, i64 24, !875, i64 28, !1149, i64 32, !1149, i64 40, !1149, i64 48, !875, i64 56, !875, i64 60, !1149, i64 64, !1150, i64 72, !1150, i64 88, !1150, i64 104, !813, i64 120}
!1149 = !{!"long", !813, i64 0}
!1150 = !{!"timespec", !1149, i64 0, !1149, i64 8}
!1151 = !DILocation(line: 264, column: 23, scope: !1042)
!1152 = !DILocation(line: 268, column: 39, scope: !1081)
!1153 = !DILocation(line: 0, scope: !1081)
!1154 = !DILocation(line: 269, column: 23, scope: !1081)
!1155 = !DILocalVariable(name: "filename", arg: 1, scope: !1156, file: !1157, line: 49, type: !122)
!1156 = distinct !DISubprogram(name: "issymlink", scope: !1157, file: !1157, line: 49, type: !1158, scopeLine: 50, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1160)
!1157 = !DIFile(filename: "./lib/issymlink.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3ed5fe5c76158b7c9a68dd013fb9e151")
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!77, !122}
!1160 = !{!1155, !1161}
!1161 = !DILocalVariable(name: "linkbuf", scope: !1156, file: !1157, line: 51, type: !49)
!1162 = !DILocation(line: 0, scope: !1156, inlinedAt: !1163)
!1163 = distinct !DILocation(line: 270, column: 27, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1081, file: !2, line: 270, column: 27)
!1165 = !DILocation(line: 51, column: 3, scope: !1156, inlinedAt: !1163)
!1166 = !DILocation(line: 51, column: 8, scope: !1156, inlinedAt: !1163)
!1167 = !DILocation(line: 52, column: 7, scope: !1168, inlinedAt: !1163)
!1168 = distinct !DILexicalBlock(scope: !1156, file: !1157, line: 52, column: 7)
!1169 = !DILocation(line: 52, column: 54, scope: !1168, inlinedAt: !1163)
!1170 = !DILocation(line: 58, column: 1, scope: !1156, inlinedAt: !1163)
!1171 = !DILocation(line: 52, column: 7, scope: !1156, inlinedAt: !1163)
!1172 = !DILocation(line: 272, column: 27, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1164, file: !2, line: 271, column: 25)
!1174 = !DILocation(line: 278, column: 23, scope: !1081)
!1175 = !DILocation(line: 280, column: 17, scope: !1043)
!1176 = !DILocation(line: 283, column: 15, scope: !1035)
!1177 = !DILocation(line: 284, column: 13, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1035, file: !2, line: 283, column: 15)
!1179 = !DILocation(line: 288, column: 16, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1036, file: !2, line: 288, column: 16)
!1181 = !DILocation(line: 288, column: 16, scope: !1036)
!1182 = !DILocalVariable(name: "dir", arg: 1, scope: !1183, file: !2, line: 113, type: !116)
!1183 = distinct !DISubprogram(name: "remove_parents", scope: !2, file: !2, line: 113, type: !1184, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !1186)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!152, !116}
!1186 = !{!1182, !1187, !1188, !1190, !1191}
!1187 = !DILocalVariable(name: "ok", scope: !1183, file: !2, line: 115, type: !152)
!1188 = !DILocalVariable(name: "slash", scope: !1189, file: !2, line: 120, type: !116)
!1189 = distinct !DILexicalBlock(scope: !1183, file: !2, line: 119, column: 5)
!1190 = !DILocalVariable(name: "rmdir_errno", scope: !1189, file: !2, line: 134, type: !77)
!1191 = !DILocalVariable(name: "error_msg", scope: !1192, file: !2, line: 145, type: !122)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !2, line: 144, column: 13)
!1193 = distinct !DILexicalBlock(scope: !1194, file: !2, line: 139, column: 15)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !2, line: 137, column: 9)
!1195 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 136, column: 11)
!1196 = !DILocation(line: 0, scope: !1183, inlinedAt: !1197)
!1197 = distinct !DILocation(line: 290, column: 17, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1180, file: !2, line: 289, column: 9)
!1199 = !DILocation(line: 117, column: 3, scope: !1183, inlinedAt: !1197)
!1200 = !DILocation(line: 118, column: 3, scope: !1183, inlinedAt: !1197)
!1201 = !DILocation(line: 120, column: 21, scope: !1189, inlinedAt: !1197)
!1202 = !DILocation(line: 0, scope: !1189, inlinedAt: !1197)
!1203 = !DILocation(line: 121, column: 17, scope: !1204, inlinedAt: !1197)
!1204 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 121, column: 11)
!1205 = !DILocation(line: 121, column: 11, scope: !1189, inlinedAt: !1197)
!1206 = !DILocation(line: 125, column: 20, scope: !1189, inlinedAt: !1197)
!1207 = !DILocation(line: 125, column: 26, scope: !1189, inlinedAt: !1197)
!1208 = !DILocation(line: 125, column: 7, scope: !1189, inlinedAt: !1197)
!1209 = !DILocation(line: 125, column: 29, scope: !1189, inlinedAt: !1197)
!1210 = !DILocation(line: 125, column: 36, scope: !1189, inlinedAt: !1197)
!1211 = !DILocation(line: 126, column: 9, scope: !1189, inlinedAt: !1197)
!1212 = distinct !{!1212, !1208, !1213, !921}
!1213 = !DILocation(line: 126, column: 11, scope: !1189, inlinedAt: !1197)
!1214 = !DILocation(line: 127, column: 7, scope: !1189, inlinedAt: !1197)
!1215 = !DILocation(line: 127, column: 16, scope: !1189, inlinedAt: !1197)
!1216 = !DILocation(line: 130, column: 11, scope: !1217, inlinedAt: !1197)
!1217 = distinct !DILexicalBlock(scope: !1189, file: !2, line: 130, column: 11)
!1218 = !DILocation(line: 130, column: 11, scope: !1189, inlinedAt: !1197)
!1219 = !DILocation(line: 131, column: 23, scope: !1217, inlinedAt: !1197)
!1220 = !DILocation(line: 131, column: 31, scope: !1217, inlinedAt: !1197)
!1221 = !DILocation(line: 131, column: 60, scope: !1217, inlinedAt: !1197)
!1222 = !DILocation(line: 131, column: 9, scope: !1217, inlinedAt: !1197)
!1223 = !DILocation(line: 133, column: 13, scope: !1189, inlinedAt: !1197)
!1224 = !DILocation(line: 133, column: 25, scope: !1189, inlinedAt: !1197)
!1225 = !DILocation(line: 134, column: 25, scope: !1189, inlinedAt: !1197)
!1226 = !DILocation(line: 136, column: 11, scope: !1189, inlinedAt: !1197)
!1227 = !DILocation(line: 139, column: 15, scope: !1193, inlinedAt: !1197)
!1228 = !DILocation(line: 139, column: 15, scope: !1194, inlinedAt: !1197)
!1229 = !DILocation(line: 146, column: 31, scope: !1230, inlinedAt: !1197)
!1230 = distinct !DILexicalBlock(scope: !1192, file: !2, line: 146, column: 19)
!1231 = !DILocation(line: 0, scope: !1192, inlinedAt: !1197)
!1232 = !DILocation(line: 157, column: 15, scope: !1192, inlinedAt: !1197)
!1233 = !DILocation(line: 290, column: 14, scope: !1198)
!1234 = !DILocation(line: 291, column: 9, scope: !1198)
!1235 = !DILocation(line: 236, column: 25, scope: !1032)
!1236 = distinct !{!1236, !1107, !1237, !921}
!1237 = !DILocation(line: 292, column: 5, scope: !1033)
!1238 = !DILocation(line: 294, column: 10, scope: !1021)
!1239 = !DILocation(line: 295, column: 1, scope: !1021)
!1240 = !DISubprogram(name: "bindtextdomain", scope: !856, file: !856, line: 86, type: !1241, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!116, !122, !122}
!1243 = !DISubprogram(name: "textdomain", scope: !856, file: !856, line: 82, type: !997, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1244 = !DISubprogram(name: "atexit", scope: !995, file: !995, line: 602, type: !1245, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!77, !460}
!1247 = !DISubprogram(name: "getopt_long", scope: !371, file: !371, line: 66, type: !1248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!77, !77, !1250, !122, !1252, !376}
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!1253 = !DISubprogram(name: "rmdir", scope: !1254, file: !1254, line: 867, type: !1158, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !859)
!1254 = !DIFile(filename: "/usr/include/unistd.h", directory: "", checksumkind: CSK_MD5, checksum: "ed37c2e6f30ba31a8b41e4d70547c39c")
