; ModuleID = 'src/seq.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.option = type { ptr, i32, ptr, i32 }
%struct.operand = type { fp128, i64, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], ptr, ptr }
%struct.slotvec = type { i64, ptr }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list = type { ptr, ptr, ptr, i32, i32 }
%struct._IO_FILE = type { i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, i64, i16, i8, [1 x i8], ptr, i64, ptr, ptr, ptr, ptr, i64, i32, [20 x i8] }
%struct.char_directives = type { i64, ptr, i64, i64, [7 x %struct.char_directive] }
%struct.char_directive = type { ptr, ptr, i32, ptr, ptr, i64, ptr, ptr, i64, i8, i64 }
%struct.arguments = type { i64, ptr, [7 x %struct.argument] }
%struct.argument = type { i32, %union.anon.10 }
%union.anon.10 = type { fp128 }

@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [104 x i8] c"Usage: %s [OPTION]... LAST\0A  or:  %s [OPTION]... FIRST LAST\0A  or:  %s [OPTION]... FIRST INCREMENT LAST\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [58 x i8] c"Print numbers from FIRST to LAST, in steps of INCREMENT.\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [4 x i8] c"seq\00", align 1, !dbg !17

!161 = distinct !DIGlobalVariable(scope: null, file: !2, line: 596, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 15)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !2, line: 606, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 16)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(scope: null, file: !2, line: 612, type: !172, isLocal: true, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 17)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !2, line: 622, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 552, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 69)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(scope: null, file: !2, line: 627, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 2)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !2, line: 668, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 33)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !2, line: 685, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 6)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !2, line: 688, type: !19, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "equal_width", scope: !64, file: !2, line: 55, type: !111, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(scope: null, file: !67, line: 736, type: !201, isLocal: true, isDefinition: true)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 600, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 75)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "help_no_sgr", scope: !206, file: !67, line: 575, type: !68, isLocal: true, isDefinition: true)
!206 = distinct !DISubprogram(name: "oputs_", scope: !67, file: !67, line: 573, type: !207, scopeLine: 574, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !209)
!207 = !DISubroutineType(cc: DW_CC_nocall, types: !208)
!208 = !{null, !92, !92}
!209 = !{!210, !211, !212, !215, !216, !217, !218, !222, !223, !224, !225, !227, !278, !279, !280, !282, !283}
!210 = !DILocalVariable(name: "program", arg: 1, scope: !206, file: !67, line: 573, type: !92)
!211 = !DILocalVariable(name: "option", arg: 2, scope: !206, file: !67, line: 573, type: !92)
!212 = !DILocalVariable(name: "term", scope: !213, file: !67, line: 585, type: !92)
!213 = distinct !DILexicalBlock(scope: !214, file: !67, line: 582, column: 5)
!214 = distinct !DILexicalBlock(scope: !206, file: !67, line: 581, column: 7)
!215 = !DILocalVariable(name: "double_space", scope: !206, file: !67, line: 594, type: !111)
!216 = !DILocalVariable(name: "first_word", scope: !206, file: !67, line: 595, type: !92)
!217 = !DILocalVariable(name: "option_text", scope: !206, file: !67, line: 596, type: !92)
!218 = !DILocalVariable(name: "s", scope: !219, file: !67, line: 608, type: !92)
!219 = distinct !DILexicalBlock(scope: !220, file: !67, line: 605, column: 5)
!220 = distinct !DILexicalBlock(scope: !221, file: !67, line: 604, column: 12)
!221 = distinct !DILexicalBlock(scope: !206, file: !67, line: 597, column: 7)
!222 = !DILocalVariable(name: "spaces", scope: !219, file: !67, line: 609, type: !137)
!223 = !DILocalVariable(name: "anchor_len", scope: !206, file: !67, line: 620, type: !137)
!224 = !DILocalVariable(name: "desc_text", scope: !206, file: !67, line: 625, type: !92)
!225 = !DILocalVariable(name: "__ptr", scope: !226, file: !67, line: 644, type: !92)
!226 = distinct !DILexicalBlock(scope: !206, file: !67, line: 644, column: 3)
!227 = !DILocalVariable(name: "__stream", scope: !226, file: !67, line: 644, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !230, line: 7, baseType: !231)
!230 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !232, line: 49, size: 1728, elements: !233)
!232 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !249, !251, !252, !253, !255, !256, !258, !259, !262, !264, !267, !270, !271, !272, !273, !274}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !231, file: !232, line: 51, baseType: !68, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !231, file: !232, line: 54, baseType: !114, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !231, file: !232, line: 55, baseType: !114, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !231, file: !232, line: 56, baseType: !114, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !231, file: !232, line: 57, baseType: !114, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !231, file: !232, line: 58, baseType: !114, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !231, file: !232, line: 59, baseType: !114, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !231, file: !232, line: 60, baseType: !114, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !231, file: !232, line: 61, baseType: !114, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !231, file: !232, line: 64, baseType: !114, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !231, file: !232, line: 65, baseType: !114, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !231, file: !232, line: 66, baseType: !114, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !231, file: !232, line: 68, baseType: !247, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !232, line: 36, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !231, file: !232, line: 70, baseType: !250, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !231, file: !232, line: 72, baseType: !68, size: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !231, file: !232, line: 73, baseType: !68, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !231, file: !232, line: 74, baseType: !254, size: 64, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !108)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !231, file: !232, line: 77, baseType: !136, size: 16, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !231, file: !232, line: 78, baseType: !257, size: 8, offset: 1040)
!257 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !231, file: !232, line: 79, baseType: !59, size: 8, offset: 1048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !231, file: !232, line: 81, baseType: !260, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !232, line: 43, baseType: null)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !231, file: !232, line: 89, baseType: !263, size: 64, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !108)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !231, file: !232, line: 91, baseType: !265, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !232, line: 37, flags: DIFlagFwdDecl)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !231, file: !232, line: 92, baseType: !268, size: 64, offset: 1280)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !232, line: 38, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !231, file: !232, line: 93, baseType: !250, size: 64, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !231, file: !232, line: 94, baseType: !135, size: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !231, file: !232, line: 95, baseType: !137, size: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !231, file: !232, line: 96, baseType: !68, size: 32, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !231, file: !232, line: 98, baseType: !275, size: 160, offset: 1568)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 20)
!278 = !DILocalVariable(name: "__cnt", scope: !226, file: !67, line: 644, type: !137)
!279 = !DILocalVariable(name: "url_program", scope: !206, file: !67, line: 648, type: !92)
!280 = !DILocalVariable(name: "__ptr", scope: !281, file: !67, line: 686, type: !92)
!281 = distinct !DILexicalBlock(scope: !206, file: !67, line: 686, column: 3)
!282 = !DILocalVariable(name: "__stream", scope: !281, file: !67, line: 686, type: !228)
!283 = !DILocalVariable(name: "__cnt", scope: !281, file: !67, line: 686, type: !137)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(scope: null, file: !67, line: 585, type: !286, isLocal: true, isDefinition: true)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 5)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !67, line: 586, type: !286, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !67, line: 595, type: !19, isLocal: true, isDefinition: true)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(scope: null, file: !67, line: 620, type: !192, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !182, isLocal: true, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(scope: null, file: !67, line: 648, type: !286, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !19, isLocal: true, isDefinition: true)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(scope: null, file: !67, line: 649, type: !303, isLocal: true, isDefinition: true)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 3)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(scope: null, file: !67, line: 650, type: !286, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !192, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(scope: null, file: !67, line: 651, type: !192, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(scope: null, file: !67, line: 652, type: !152, isLocal: true, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(scope: null, file: !67, line: 653, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 8)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(scope: null, file: !67, line: 654, type: !142, isLocal: true, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(scope: null, file: !67, line: 655, type: !142, isLocal: true, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(scope: null, file: !67, line: 656, type: !142, isLocal: true, isDefinition: true)
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(scope: null, file: !67, line: 657, type: !142, isLocal: true, isDefinition: true)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(scope: null, file: !67, line: 663, type: !152, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !67, line: 664, type: !142, isLocal: true, isDefinition: true)
!331 = !DIGlobalVariableExpression(var: !332, expr: !DIExpression())
!332 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !172, isLocal: true, isDefinition: true)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(scope: null, file: !67, line: 669, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 40)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !162, isLocal: true, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(scope: null, file: !67, line: 676, type: !342, isLocal: true, isDefinition: true)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 488, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 61)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(scope: null, file: !67, line: 679, type: !303, isLocal: true, isDefinition: true)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(scope: null, file: !67, line: 683, type: !286, isLocal: true, isDefinition: true)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(scope: null, file: !67, line: 688, type: !286, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(scope: null, file: !67, line: 691, type: !316, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(scope: null, file: !67, line: 839, type: !167, isLocal: true, isDefinition: true)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(scope: null, file: !67, line: 840, type: !357, isLocal: true, isDefinition: true)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 22)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(scope: null, file: !67, line: 841, type: !162, isLocal: true, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(scope: null, file: !67, line: 862, type: !19, isLocal: true, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(scope: null, file: !67, line: 868, type: !24, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(scope: null, file: !67, line: 875, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 27)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 408, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 51)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !67, line: 877, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 12)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(scope: null, file: !2, line: 66, type: !378, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !152, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(scope: null, file: !2, line: 68, type: !142, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(scope: null, file: !2, line: 69, type: !286, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(scope: null, file: !2, line: 70, type: !316, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "long_options", scope: !64, file: !2, line: 64, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1536, elements: !193)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !396, line: 50, size: 256, elements: !397)
!396 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/getopt_ext.h", directory: "", checksumkind: CSK_MD5, checksum: "b4f86ba96a508c530fa381ae1dafe9eb")
!397 = !{!398, !399, !400, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !395, file: !396, line: 52, baseType: !92, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !395, file: !396, line: 55, baseType: !68, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !395, file: !396, line: 56, baseType: !401, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !395, file: !396, line: 57, baseType: !68, size: 32, offset: 192)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !182, isLocal: true, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "separator", scope: !64, file: !2, line: 58, type: !92, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !2, line: 252, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 30)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(scope: null, file: !2, line: 258, type: !152, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(scope: null, file: !2, line: 259, type: !416, isLocal: true, isDefinition: true)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 11)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !421, isLocal: true, isDefinition: true)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 21)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(scope: null, file: !2, line: 271, type: !426, isLocal: true, isDefinition: true)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 9)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(scope: null, file: !2, line: 272, type: !431, isLocal: true, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 37)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(scope: null, file: !2, line: 278, type: !431, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(scope: null, file: !67, line: 952, type: !378, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "terminator", scope: !64, file: !2, line: 62, type: !440, isLocal: true, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 16, elements: !183)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(scope: null, file: !2, line: 163, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 36)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !147, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 13)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(scope: null, file: !2, line: 188, type: !303, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(scope: null, file: !2, line: 195, type: !303, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "format_buf", scope: !459, file: !2, line: 375, type: !484, isLocal: true, isDefinition: true)
!459 = distinct !DISubprogram(name: "get_default_format", scope: !2, file: !2, line: 373, type: !460, scopeLine: 374, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !64, retainedNodes: !469)
!460 = !DISubroutineType(types: !461)
!461 = !{!92, !462, !462, !462}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "operand", file: !2, line: 143, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "operand", file: !2, line: 128, size: 256, elements: !464)
!464 = !{!465, !467, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !463, file: !2, line: 131, baseType: !466, size: 128)
!466 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !463, file: !2, line: 137, baseType: !137, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !463, file: !2, line: 141, baseType: !68, size: 32, offset: 192)
!469 = !{!470, !471, !472, !473, !474, !479, !480, !481}
!470 = !DILocalVariable(name: "first", arg: 1, scope: !459, file: !2, line: 373, type: !462)
!471 = !DILocalVariable(name: "step", arg: 2, scope: !459, file: !2, line: 373, type: !462)
!472 = !DILocalVariable(name: "last", arg: 3, scope: !459, file: !2, line: 373, type: !462)
!473 = !DILocalVariable(name: "prec", scope: !459, file: !2, line: 377, type: !68)
!474 = !DILocalVariable(name: "first_width", scope: !475, file: !2, line: 384, type: !137)
!475 = distinct !DILexicalBlock(scope: !476, file: !2, line: 382, column: 9)
!476 = distinct !DILexicalBlock(scope: !477, file: !2, line: 381, column: 11)
!477 = distinct !DILexicalBlock(scope: !478, file: !2, line: 380, column: 5)
!478 = distinct !DILexicalBlock(scope: !459, file: !2, line: 379, column: 7)
!479 = !DILocalVariable(name: "last_width", scope: !475, file: !2, line: 386, type: !137)
!480 = !DILocalVariable(name: "width", scope: !475, file: !2, line: 393, type: !137)
!481 = !DILocalVariable(name: "w", scope: !482, file: !2, line: 396, type: !68)
!482 = distinct !DILexicalBlock(scope: !483, file: !2, line: 395, column: 13)
!483 = distinct !DILexicalBlock(scope: !475, file: !2, line: 394, column: 15)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 28)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(scope: null, file: !2, line: 397, type: !416, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(scope: null, file: !2, line: 403, type: !316, isLocal: true, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(scope: null, file: !2, line: 408, type: !19, isLocal: true, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(scope: null, file: !2, line: 334, type: !182, isLocal: true, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(scope: null, file: !498, line: 3, type: !162, isLocal: true, isDefinition: true)
!498 = !DIFile(filename: "src/version.c", directory: "/src", checksumkind: CSK_MD5, checksum: "d20a4a5e52cf858e574186cb6c106973")
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "Version", scope: !501, file: !498, line: 3, type: !92, isLocal: false, isDefinition: true)
!501 = distinct !DICompileUnit(language: DW_LANG_C11, file: !498, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !502, splitDebugInlining: false, nameTableKind: None)
!502 = !{!496, !499}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "file_name", scope: !505, file: !506, line: 45, type: !92, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C11, file: !506, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !507, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "lib/closeout.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9d11e4504d0806a13d7a340600d1e5d6")
!507 = !{!508, !510, !512, !514, !503, !516}
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(scope: null, file: !506, line: 121, type: !152, isLocal: true, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(scope: null, file: !506, line: 121, type: !378, isLocal: true, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(scope: null, file: !506, line: 123, type: !152, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(scope: null, file: !506, line: 126, type: !303, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !505, file: !506, line: 55, type: !111, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "error_print_progname", scope: !520, file: !521, line: 66, type: !569, isLocal: false, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C11, file: !521, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !522, globals: !523, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "lib/error.c", directory: "/src", checksumkind: CSK_MD5, checksum: "a98aca3300963043bd643c77f5041903")
!522 = !{!135, !138}
!523 = !{!524, !526, !551, !553, !555, !557, !518, !559, !561, !563, !565, !567}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(scope: null, file: !521, line: 272, type: !286, isLocal: true, isDefinition: true)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "old_file_name", scope: !528, file: !521, line: 304, type: !92, isLocal: true, isDefinition: true)
!528 = distinct !DISubprogram(name: "verror_at_line", scope: !521, file: !521, line: 298, type: !529, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !520, retainedNodes: !544)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !68, !68, !92, !74, !92, !531}
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !532, line: 52, baseType: !533)
!532 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !534, line: 14, baseType: !535)
!534 = !DIFile(filename: "/usr/lib/llvm-16/lib/clang/16/include/stdarg.h", directory: "", checksumkind: CSK_MD5, checksum: "4c819f80dd915987182e9ab226e27a5a")
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !536, baseType: !537)
!536 = !DIFile(filename: "lib/error.c", directory: "/src")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !538)
!538 = !{!539, !540, !541, !542, !543}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !537, file: !536, baseType: !135, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !537, file: !536, baseType: !135, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !537, file: !536, baseType: !135, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !537, file: !536, baseType: !68, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !537, file: !536, baseType: !68, size: 32, offset: 224)
!544 = !{!545, !546, !547, !548, !549, !550}
!545 = !DILocalVariable(name: "status", arg: 1, scope: !528, file: !521, line: 298, type: !68)
!546 = !DILocalVariable(name: "errnum", arg: 2, scope: !528, file: !521, line: 298, type: !68)
!547 = !DILocalVariable(name: "file_name", arg: 3, scope: !528, file: !521, line: 298, type: !92)
!548 = !DILocalVariable(name: "line_number", arg: 4, scope: !528, file: !521, line: 298, type: !74)
!549 = !DILocalVariable(name: "message", arg: 5, scope: !528, file: !521, line: 298, type: !92)
!550 = !DILocalVariable(name: "args", arg: 6, scope: !528, file: !521, line: 298, type: !531)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "old_line_number", scope: !528, file: !521, line: 305, type: !74, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(scope: null, file: !521, line: 338, type: !19, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(scope: null, file: !521, line: 346, type: !316, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(scope: null, file: !521, line: 346, type: !182, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "error_message_count", scope: !520, file: !521, line: 69, type: !74, isLocal: false, isDefinition: true)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "error_one_per_line", scope: !520, file: !521, line: 295, type: !68, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(scope: null, file: !521, line: 208, type: !152, isLocal: true, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(scope: null, file: !521, line: 208, type: !421, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(scope: null, file: !521, line: 214, type: !286, isLocal: true, isDefinition: true)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "program_name", scope: !574, file: !575, line: 31, type: !92, isLocal: false, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C11, file: !575, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !576, globals: !577, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "lib/progname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6fee3568eaf44ee1737e6b9b9e223c1f")
!576 = !{!114}
!577 = !{!572, !578, !580}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(scope: null, file: !575, line: 46, type: !316, isLocal: true, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(scope: null, file: !575, line: 49, type: !19, isLocal: true, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "utf07FF", scope: !584, file: !585, line: 46, type: !440, isLocal: true, isDefinition: true)
!584 = distinct !DISubprogram(name: "proper_name_lite", scope: !585, file: !585, line: 38, type: !586, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !590)
!585 = !DIFile(filename: "lib/propername-lite.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fb64feb17099edacfac61568eab6c7f1")
!586 = !DISubroutineType(types: !587)
!587 = !{!92, !92, !92}
!588 = distinct !DICompileUnit(language: DW_LANG_C11, file: !585, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !589, splitDebugInlining: false, nameTableKind: None)
!589 = !{!582}
!590 = !{!591, !592, !593, !594, !599}
!591 = !DILocalVariable(name: "name_ascii", arg: 1, scope: !584, file: !585, line: 38, type: !92)
!592 = !DILocalVariable(name: "name_utf8", arg: 2, scope: !584, file: !585, line: 38, type: !92)
!593 = !DILocalVariable(name: "translation", scope: !584, file: !585, line: 40, type: !92)
!594 = !DILocalVariable(name: "w", scope: !584, file: !585, line: 47, type: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "char32_t", file: !596, line: 37, baseType: !597)
!596 = !DIFile(filename: "/usr/include/uchar.h", directory: "", checksumkind: CSK_MD5, checksum: "c926815959f9cfc6276e7d81605ae4e1")
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !97, line: 57, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !97, line: 42, baseType: !74)
!599 = !DILocalVariable(name: "mbs", scope: !584, file: !585, line: 48, type: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !602)
!601 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !604)
!603 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !604, file: !603, line: 15, baseType: !68, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !604, file: !603, line: 20, baseType: !608, size: 32, offset: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !603, line: 16, size: 32, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !608, file: !603, line: 18, baseType: !74, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !608, file: !603, line: 19, baseType: !19, size: 32)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(scope: null, file: !614, line: 78, type: !316, isLocal: true, isDefinition: true)
!614 = !DIFile(filename: "lib/quotearg.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e516a82aa3777cc82e92153587f3c069")
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(scope: null, file: !614, line: 79, type: !192, isLocal: true, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(scope: null, file: !614, line: 80, type: !450, isLocal: true, isDefinition: true)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(scope: null, file: !614, line: 81, type: !450, isLocal: true, isDefinition: true)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(scope: null, file: !614, line: 82, type: !275, isLocal: true, isDefinition: true)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(scope: null, file: !614, line: 83, type: !182, isLocal: true, isDefinition: true)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(scope: null, file: !614, line: 84, type: !316, isLocal: true, isDefinition: true)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(scope: null, file: !614, line: 85, type: !152, isLocal: true, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(scope: null, file: !614, line: 86, type: !152, isLocal: true, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(scope: null, file: !614, line: 87, type: !316, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !635, file: !614, line: 76, type: !721, isLocal: false, isDefinition: true)
!635 = distinct !DICompileUnit(language: DW_LANG_C11, file: !614, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !636, retainedTypes: !656, globals: !657, splitDebugInlining: false, nameTableKind: None)
!636 = !{!637, !651, !72}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !638, line: 42, baseType: !74, size: 32, elements: !639)
!638 = !DIFile(filename: "./lib/quotearg.h", directory: "/src", checksumkind: CSK_MD5, checksum: "3470b31478e8805079addb2b99dd0ada")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!640 = !DIEnumerator(name: "literal_quoting_style", value: 0)
!641 = !DIEnumerator(name: "shell_quoting_style", value: 1)
!642 = !DIEnumerator(name: "shell_always_quoting_style", value: 2)
!643 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3)
!644 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4)
!645 = !DIEnumerator(name: "c_quoting_style", value: 5)
!646 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6)
!647 = !DIEnumerator(name: "escape_quoting_style", value: 7)
!648 = !DIEnumerator(name: "locale_quoting_style", value: 8)
!649 = !DIEnumerator(name: "clocale_quoting_style", value: 9)
!650 = !DIEnumerator(name: "custom_quoting_style", value: 10)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !638, line: 254, baseType: !74, size: 32, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1)
!654 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2)
!655 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4)
!656 = !{!68, !136, !137}
!657 = !{!612, !615, !617, !619, !621, !623, !625, !627, !629, !631, !633, !658, !662, !672, !674, !679, !681, !683, !685, !687, !710, !717, !719}
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !635, file: !614, line: 92, type: !660, isLocal: false, isDefinition: true)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 320, elements: !143)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !635, file: !614, line: 1040, type: !664, isLocal: false, isDefinition: true)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !614, line: 56, size: 448, elements: !665)
!665 = !{!666, !667, !668, !670, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !664, file: !614, line: 59, baseType: !637, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !614, line: 62, baseType: !68, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !664, file: !614, line: 66, baseType: !669, size: 256, offset: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 256, elements: !317)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !664, file: !614, line: 69, baseType: !92, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !664, file: !614, line: 72, baseType: !92, size: 64, offset: 384)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !635, file: !614, line: 107, type: !664, isLocal: true, isDefinition: true)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "slot0", scope: !635, file: !614, line: 831, type: !676, isLocal: true, isDefinition: true)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 256)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(scope: null, file: !614, line: 321, type: !182, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(scope: null, file: !614, line: 357, type: !182, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(scope: null, file: !614, line: 358, type: !182, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(scope: null, file: !614, line: 199, type: !152, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "quote", scope: !689, file: !614, line: 228, type: !708, isLocal: true, isDefinition: true)
!689 = distinct !DISubprogram(name: "gettext_quote", scope: !614, file: !614, line: 197, type: !690, scopeLine: 198, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !635, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!92, !92, !637}
!692 = !{!693, !694, !695, !696, !697}
!693 = !DILocalVariable(name: "msgid", arg: 1, scope: !689, file: !614, line: 197, type: !92)
!694 = !DILocalVariable(name: "s", arg: 2, scope: !689, file: !614, line: 197, type: !637)
!695 = !DILocalVariable(name: "translation", scope: !689, file: !614, line: 199, type: !92)
!696 = !DILocalVariable(name: "w", scope: !689, file: !614, line: 229, type: !595)
!697 = !DILocalVariable(name: "mbs", scope: !689, file: !614, line: 230, type: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !700, file: !603, line: 15, baseType: !68, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !700, file: !603, line: 20, baseType: !704, size: 32, offset: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !603, line: 16, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !704, file: !603, line: 18, baseType: !74, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !704, file: !603, line: 19, baseType: !19, size: 32)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 64, elements: !709)
!709 = !{!184, !21}
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "slotvec", scope: !635, file: !614, line: 834, type: !712, isLocal: true, isDefinition: true)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !614, line: 823, size: 128, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !614, line: 825, baseType: !137, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !713, file: !614, line: 826, baseType: !114, size: 64, offset: 64)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "nslots", scope: !635, file: !614, line: 832, type: !68, isLocal: true, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "slotvec0", scope: !635, file: !614, line: 833, type: !713, isLocal: true, isDefinition: true)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 704, elements: !417)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(scope: null, file: !725, line: 67, type: !378, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "lib/version-etc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "67125e81b6b02afd000c478055b0b6ea")
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(scope: null, file: !725, line: 69, type: !152, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !152, isLocal: true, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(scope: null, file: !725, line: 83, type: !19, isLocal: true, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(scope: null, file: !725, line: 85, type: !182, isLocal: true, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !736, isLocal: true, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1368, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 171)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(scope: null, file: !725, line: 88, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 34)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(scope: null, file: !725, line: 105, type: !167, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(scope: null, file: !725, line: 109, type: !748, isLocal: true, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 23)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(scope: null, file: !725, line: 113, type: !484, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(scope: null, file: !725, line: 120, type: !755, isLocal: true, isDefinition: true)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 32)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(scope: null, file: !725, line: 127, type: !443, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(scope: null, file: !725, line: 134, type: !335, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(scope: null, file: !725, line: 142, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 44)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(scope: null, file: !725, line: 150, type: !769, isLocal: true, isDefinition: true)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 48)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(scope: null, file: !725, line: 159, type: !774, isLocal: true, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 52)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(scope: null, file: !725, line: 170, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 60)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !275, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(scope: null, file: !725, line: 248, type: !357, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !275, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !157, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(scope: null, file: !725, line: 254, type: !335, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !3, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(scope: null, file: !725, line: 259, type: !796, isLocal: true, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 29)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !801, file: !802, line: 26, type: !804, isLocal: false, isDefinition: true)
!801 = distinct !DICompileUnit(language: DW_LANG_C11, file: !802, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !803, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "c182151aedfe34dbff37c8cbe209dca5")
!803 = !{!799}
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 376, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 47)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "exit_failure", scope: !809, file: !810, line: 24, type: !812, isLocal: false, isDefinition: true)
!809 = distinct !DICompileUnit(language: DW_LANG_C11, file: !810, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !811, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "lib/exitfail.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b7a45e7dc7c5d78fd3c2c7e1515d845")
!811 = !{!807}
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !303, isLocal: true, isDefinition: true)
!815 = !DIFile(filename: "lib/xalloc-die.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9cfdc32319831c7c47723ecabcc3e0ec")
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !152, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(scope: null, file: !815, line: 34, type: !172, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "c_locale_cache", scope: !822, file: !848, line: 58, type: !849, isLocal: true, isDefinition: true)
!822 = distinct !DICompileUnit(language: DW_LANG_C11, file: !823, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !824, globals: !845, splitDebugInlining: false, nameTableKind: None)
!823 = !DIFile(filename: "lib/c-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "bdbd9b5f75acb9d17e97f63ab140c6fe")
!824 = !{!114, !825}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "locale_t", file: !826, line: 24, baseType: !827)
!826 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "4752f26e930c42056083e96227ff0057")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !828, line: 41, baseType: !829)
!828 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__locale_t.h", directory: "", checksumkind: CSK_MD5, checksum: "79eea70c97dfcbc51f94cdf9446ea8a8")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_struct", file: !828, line: 27, size: 1856, elements: !831)
!831 = !{!832, !836, !839, !842, !843}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "__locales", scope: !830, file: !828, line: 30, baseType: !833, size: 832)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 832, elements: !451)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_data", file: !828, line: 30, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !830, file: !828, line: 33, baseType: !837, size: 64, offset: 832)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !830, file: !828, line: 34, baseType: !840, size: 64, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !830, file: !828, line: 35, baseType: !840, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__names", scope: !830, file: !828, line: 38, baseType: !844, size: 832, offset: 1024)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 832, elements: !451)
!845 = !{!846, !820}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(scope: null, file: !848, line: 66, type: !182, isLocal: true, isDefinition: true)
!848 = !DIFile(filename: "./lib/c-strtod.c", directory: "/src", checksumkind: CSK_MD5, checksum: "5149e55c3d66a821d48006aa16ce6f10")
!849 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(scope: null, file: !852, line: 108, type: !59, isLocal: true, isDefinition: true)
!852 = !DIFile(filename: "lib/mbrtoc32.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4440d3f9b40993908b2149a520ab0e48")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "internal_state", scope: !855, file: !852, line: 97, type: !858, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C11, file: !852, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !856, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !{!135, !137, !138}
!857 = !{!850, !853}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !601, line: 6, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !603, line: 21, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 13, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !860, file: !603, line: 15, baseType: !68, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !860, file: !603, line: 20, baseType: !864, size: 32, offset: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !603, line: 16, size: 32, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !864, file: !603, line: 18, baseType: !74, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !864, file: !603, line: 19, baseType: !19, size: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(scope: null, file: !870, line: 121, type: !303, isLocal: true, isDefinition: true)
!870 = !DIFile(filename: "lib/xvasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "52fb1fd224f1e06f67bcb38ca55c75a7")
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(scope: null, file: !870, line: 124, type: !873, isLocal: true, isDefinition: true)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 41)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(scope: null, file: !878, line: 35, type: !182, isLocal: true, isDefinition: true)
!878 = !DIFile(filename: "lib/hard-locale.c", directory: "/src", checksumkind: CSK_MD5, checksum: "4c9342299721823d516c8dacfe891291")
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(scope: null, file: !878, line: 35, type: !192, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(scope: null, file: !883, line: 202, type: !152, isLocal: true, isDefinition: true)
!883 = !DIFile(filename: "lib/printf-args.c", directory: "/src", checksumkind: CSK_MD5, checksum: "6c6b1c0351865a9057a8f5cc28906f34")
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "wide_null_string", scope: !886, file: !883, line: 211, type: !1069, isLocal: true, isDefinition: true)
!886 = distinct !DISubprogram(name: "printf_fetchargs", scope: !883, file: !883, line: 42, type: !887, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1060, retainedNodes: !1064)
!887 = !DISubroutineType(types: !888)
!888 = !{!68, !889, !899}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !534, line: 22, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !891, baseType: !892)
!891 = !DIFile(filename: "lib/printf-args.c", directory: "/src")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", size: 256, elements: !893)
!893 = !{!894, !895, !896, !897, !898}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !892, file: !891, baseType: !135, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !892, file: !891, baseType: !135, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !892, file: !891, baseType: !135, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !892, file: !891, baseType: !68, size: 32, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !892, file: !891, baseType: !68, size: 32, offset: 224)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "arguments", file: !901, line: 185, baseType: !902)
!901 = !DIFile(filename: "./lib/printf-args.h", directory: "/src", checksumkind: CSK_MD5, checksum: "d319bcea8f89474aab87631f4815d03e")
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 179, size: 1920, elements: !903)
!903 = !{!904, !905, !1058}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !902, file: !901, line: 181, baseType: !137, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !902, file: !901, line: 182, baseType: !906, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !901, line: 174, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 111, size: 256, elements: !909)
!909 = !{!910, !961}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !901, line: 113, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "arg_type", file: !901, line: 108, baseType: !912)
!912 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !901, line: 47, baseType: !74, size: 32, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960}
!914 = !DIEnumerator(name: "TYPE_NONE", value: 0)
!915 = !DIEnumerator(name: "TYPE_SCHAR", value: 1)
!916 = !DIEnumerator(name: "TYPE_UCHAR", value: 2)
!917 = !DIEnumerator(name: "TYPE_SHORT", value: 3)
!918 = !DIEnumerator(name: "TYPE_USHORT", value: 4)
!919 = !DIEnumerator(name: "TYPE_INT", value: 5)
!920 = !DIEnumerator(name: "TYPE_UINT", value: 6)
!921 = !DIEnumerator(name: "TYPE_LONGINT", value: 7)
!922 = !DIEnumerator(name: "TYPE_ULONGINT", value: 8)
!923 = !DIEnumerator(name: "TYPE_LONGLONGINT", value: 9)
!924 = !DIEnumerator(name: "TYPE_ULONGLONGINT", value: 10)
!925 = !DIEnumerator(name: "TYPE_INT8_T", value: 11)
!926 = !DIEnumerator(name: "TYPE_UINT8_T", value: 12)
!927 = !DIEnumerator(name: "TYPE_INT16_T", value: 13)
!928 = !DIEnumerator(name: "TYPE_UINT16_T", value: 14)
!929 = !DIEnumerator(name: "TYPE_INT32_T", value: 15)
!930 = !DIEnumerator(name: "TYPE_UINT32_T", value: 16)
!931 = !DIEnumerator(name: "TYPE_INT64_T", value: 17)
!932 = !DIEnumerator(name: "TYPE_UINT64_T", value: 18)
!933 = !DIEnumerator(name: "TYPE_INT_FAST8_T", value: 19)
!934 = !DIEnumerator(name: "TYPE_UINT_FAST8_T", value: 20)
!935 = !DIEnumerator(name: "TYPE_INT_FAST16_T", value: 21)
!936 = !DIEnumerator(name: "TYPE_UINT_FAST16_T", value: 22)
!937 = !DIEnumerator(name: "TYPE_INT_FAST32_T", value: 23)
!938 = !DIEnumerator(name: "TYPE_UINT_FAST32_T", value: 24)
!939 = !DIEnumerator(name: "TYPE_INT_FAST64_T", value: 25)
!940 = !DIEnumerator(name: "TYPE_UINT_FAST64_T", value: 26)
!941 = !DIEnumerator(name: "TYPE_DOUBLE", value: 27)
!942 = !DIEnumerator(name: "TYPE_LONGDOUBLE", value: 28)
!943 = !DIEnumerator(name: "TYPE_CHAR", value: 29)
!944 = !DIEnumerator(name: "TYPE_WIDE_CHAR", value: 30)
!945 = !DIEnumerator(name: "TYPE_STRING", value: 31)
!946 = !DIEnumerator(name: "TYPE_WIDE_STRING", value: 32)
!947 = !DIEnumerator(name: "TYPE_POINTER", value: 33)
!948 = !DIEnumerator(name: "TYPE_COUNT_SCHAR_POINTER", value: 34)
!949 = !DIEnumerator(name: "TYPE_COUNT_SHORT_POINTER", value: 35)
!950 = !DIEnumerator(name: "TYPE_COUNT_INT_POINTER", value: 36)
!951 = !DIEnumerator(name: "TYPE_COUNT_LONGINT_POINTER", value: 37)
!952 = !DIEnumerator(name: "TYPE_COUNT_LONGLONGINT_POINTER", value: 38)
!953 = !DIEnumerator(name: "TYPE_COUNT_INT8_T_POINTER", value: 39)
!954 = !DIEnumerator(name: "TYPE_COUNT_INT16_T_POINTER", value: 40)
!955 = !DIEnumerator(name: "TYPE_COUNT_INT32_T_POINTER", value: 41)
!956 = !DIEnumerator(name: "TYPE_COUNT_INT64_T_POINTER", value: 42)
!957 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST8_T_POINTER", value: 43)
!958 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST16_T_POINTER", value: 44)
!959 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST32_T_POINTER", value: 45)
!960 = !DIEnumerator(name: "TYPE_COUNT_INT_FAST64_T_POINTER", value: 46)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !908, file: !901, line: 172, baseType: !962, size: 128, offset: 128)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !908, file: !901, line: 114, size: 128, elements: !963)
!963 = !{!964, !965, !966, !968, !969, !970, !971, !972, !973, !975, !977, !981, !985, !988, !991, !994, !996, !999, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016, !1018, !1020, !1022, !1023, !1024, !1027, !1028, !1032, !1033, !1035, !1037, !1038, !1040, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !962, file: !901, line: 116, baseType: !257, size: 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !962, file: !901, line: 117, baseType: !138, size: 8)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !962, file: !901, line: 118, baseType: !967, size: 16)
!967 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "a_ushort", scope: !962, file: !901, line: 119, baseType: !136, size: 16)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "a_int", scope: !962, file: !901, line: 120, baseType: !68, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint", scope: !962, file: !901, line: 121, baseType: !74, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "a_longint", scope: !962, file: !901, line: 122, baseType: !108, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulongint", scope: !962, file: !901, line: 123, baseType: !98, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "a_longlongint", scope: !962, file: !901, line: 124, baseType: !974, size: 64)
!974 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "a_ulonglongint", scope: !962, file: !901, line: 125, baseType: !976, size: 64)
!976 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "a_int8_t", scope: !962, file: !901, line: 126, baseType: !978, size: 8)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !979, line: 24, baseType: !980)
!979 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !97, line: 37, baseType: !257)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint8_t", scope: !962, file: !901, line: 127, baseType: !982, size: 8)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !983, line: 24, baseType: !984)
!983 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !97, line: 38, baseType: !138)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "a_int16_t", scope: !962, file: !901, line: 128, baseType: !986, size: 16)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !979, line: 25, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !97, line: 39, baseType: !967)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint16_t", scope: !962, file: !901, line: 129, baseType: !989, size: 16)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !983, line: 25, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !97, line: 40, baseType: !136)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_int32_t", scope: !962, file: !901, line: 130, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !979, line: 26, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !97, line: 41, baseType: !68)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint32_t", scope: !962, file: !901, line: 131, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !983, line: 26, baseType: !598)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "a_int64_t", scope: !962, file: !901, line: 132, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !979, line: 27, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !97, line: 44, baseType: !108)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint64_t", scope: !962, file: !901, line: 133, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !983, line: 27, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !97, line: 45, baseType: !98)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast8_t", scope: !962, file: !901, line: 134, baseType: !1003, size: 8)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !95, line: 58, baseType: !257)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast8_t", scope: !962, file: !901, line: 135, baseType: !1005, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !95, line: 71, baseType: !138)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast16_t", scope: !962, file: !901, line: 136, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !95, line: 60, baseType: !108)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast16_t", scope: !962, file: !901, line: 137, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !95, line: 73, baseType: !98)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast32_t", scope: !962, file: !901, line: 138, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !95, line: 61, baseType: !108)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast32_t", scope: !962, file: !901, line: 139, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !95, line: 74, baseType: !98)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "a_int_fast64_t", scope: !962, file: !901, line: 140, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !95, line: 62, baseType: !108)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "a_uint_fast64_t", scope: !962, file: !901, line: 141, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !95, line: 75, baseType: !98)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "a_float", scope: !962, file: !901, line: 142, baseType: !1019, size: 32)
!1019 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "a_double", scope: !962, file: !901, line: 143, baseType: !1021, size: 64)
!1021 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "a_longdouble", scope: !962, file: !901, line: 144, baseType: !466, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "a_char", scope: !962, file: !901, line: 145, baseType: !68, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_char", scope: !962, file: !901, line: 147, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !1026, line: 20, baseType: !74)
!1026 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "a_string", scope: !962, file: !901, line: 149, baseType: !92, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "a_wide_string", scope: !962, file: !901, line: 150, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !107, line: 74, baseType: !74)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "a_pointer", scope: !962, file: !901, line: 151, baseType: !135, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_schar_pointer", scope: !962, file: !901, line: 152, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_short_pointer", scope: !962, file: !901, line: 153, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_pointer", scope: !962, file: !901, line: 154, baseType: !401, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longint_pointer", scope: !962, file: !901, line: 155, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_longlongint_pointer", scope: !962, file: !901, line: 156, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int8_t_pointer", scope: !962, file: !901, line: 157, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int16_t_pointer", scope: !962, file: !901, line: 158, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int32_t_pointer", scope: !962, file: !901, line: 159, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int64_t_pointer", scope: !962, file: !901, line: 160, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast8_t_pointer", scope: !962, file: !901, line: 161, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast16_t_pointer", scope: !962, file: !901, line: 162, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast32_t_pointer", scope: !962, file: !901, line: 163, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "a_count_int_fast64_t_pointer", scope: !962, file: !901, line: 164, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "direct_alloc_arg", scope: !902, file: !901, line: 183, baseType: !1059, size: 1792, offset: 128)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 1792, elements: !153)
!1060 = distinct !DICompileUnit(language: DW_LANG_C11, file: !883, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1062, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!1061 = !{!912}
!1062 = !{!135}
!1063 = !{!881, !884}
!1064 = !{!1065, !1066, !1067, !1068}
!1065 = !DILocalVariable(name: "args", arg: 1, scope: !886, file: !883, line: 42, type: !889)
!1066 = !DILocalVariable(name: "a", arg: 2, scope: !886, file: !883, line: 42, type: !899)
!1067 = !DILocalVariable(name: "i", scope: !886, file: !883, line: 44, type: !137)
!1068 = !DILocalVariable(name: "ap", scope: !886, file: !883, line: 45, type: !906)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 224, elements: !153)
!1070 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1071, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1071 = !DIFile(filename: "lib/cl-strtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "08106583cc121226b1b473993ba401e0")
!1072 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1073, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1073 = !DIFile(filename: "lib/fpurge.c", directory: "/src", checksumkind: CSK_MD5, checksum: "33a2be68f69b8676b8fe51ee5bacb54f")
!1074 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1075, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1076, splitDebugInlining: false, nameTableKind: None)
!1075 = !DIFile(filename: "lib/full-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3e4d1fbb34cc594bb17b421b58eed3ca")
!1076 = !{!92}
!1077 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1078, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1078 = !DIFile(filename: "lib/getprogname.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ee0e4cd46127cb12ad343b66f3cf3e04")
!1079 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1080, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1081, retainedTypes: !1086, splitDebugInlining: false, nameTableKind: None)
!1080 = !DIFile(filename: "lib/safe-write.c", directory: "/src", checksumkind: CSK_MD5, checksum: "868d9fdfbe37109ce7387a63f56e5cc3")
!1081 = !{!1082}
!1082 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1083, line: 36, baseType: !74, size: 32, elements: !1084)
!1083 = !DIFile(filename: "./lib/sys-limits.h", directory: "/src", checksumkind: CSK_MD5, checksum: "6cbf2bea168df2a7bb951ccec5cf6fff")
!1084 = !{!1085}
!1085 = !DIEnumerator(name: "SYS_BUFSIZE_MAX", value: 2146435072)
!1086 = !{!137}
!1087 = distinct !DICompileUnit(language: DW_LANG_C11, file: !725, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1088, retainedTypes: !1062, globals: !1092, splitDebugInlining: false, nameTableKind: None)
!1088 = !{!1089}
!1089 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 40, baseType: !74, size: 32, elements: !1090)
!1090 = !{!1091}
!1091 = !DIEnumerator(name: "COPYRIGHT_YEAR", value: 2026)
!1092 = !{!723, !726, !728, !730, !732, !734, !739, !744, !746, !751, !753, !758, !760, !762, !767, !772, !777, !782, !784, !786, !788, !790, !792, !794}
!1093 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1094, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1095, retainedTypes: !1123, splitDebugInlining: false, nameTableKind: None)
!1094 = !DIFile(filename: "lib/xmalloc.c", directory: "/src", checksumkind: CSK_MD5, checksum: "cc2f9755b54551b4c250069bbba9e774")
!1095 = !{!1096, !1108}
!1096 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1097, file: !1094, line: 188, baseType: !74, size: 32, elements: !1106)
!1097 = distinct !DISubprogram(name: "x2nrealloc", scope: !1094, file: !1094, line: 176, type: !1098, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1093, retainedNodes: !1101)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!135, !135, !1100, !137}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!1101 = !{!1102, !1103, !1104, !1105}
!1102 = !DILocalVariable(name: "p", arg: 1, scope: !1097, file: !1094, line: 176, type: !135)
!1103 = !DILocalVariable(name: "pn", arg: 2, scope: !1097, file: !1094, line: 176, type: !1100)
!1104 = !DILocalVariable(name: "s", arg: 3, scope: !1097, file: !1094, line: 176, type: !137)
!1105 = !DILocalVariable(name: "n", scope: !1097, file: !1094, line: 178, type: !137)
!1106 = !{!1107}
!1107 = !DIEnumerator(name: "DEFAULT_MXFAST", value: 128)
!1108 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1109, file: !1094, line: 228, baseType: !74, size: 32, elements: !1106)
!1109 = distinct !DISubprogram(name: "xpalloc", scope: !1094, file: !1094, line: 223, type: !1110, scopeLine: 224, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1093, retainedNodes: !1113)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!135, !135, !1112, !104, !106, !104}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122}
!1114 = !DILocalVariable(name: "pa", arg: 1, scope: !1109, file: !1094, line: 223, type: !135)
!1115 = !DILocalVariable(name: "pn", arg: 2, scope: !1109, file: !1094, line: 223, type: !1112)
!1116 = !DILocalVariable(name: "n_incr_min", arg: 3, scope: !1109, file: !1094, line: 223, type: !104)
!1117 = !DILocalVariable(name: "n_max", arg: 4, scope: !1109, file: !1094, line: 223, type: !106)
!1118 = !DILocalVariable(name: "s", arg: 5, scope: !1109, file: !1094, line: 223, type: !104)
!1119 = !DILocalVariable(name: "n0", scope: !1109, file: !1094, line: 230, type: !104)
!1120 = !DILocalVariable(name: "n", scope: !1109, file: !1094, line: 237, type: !104)
!1121 = !DILocalVariable(name: "nbytes", scope: !1109, file: !1094, line: 248, type: !104)
!1122 = !DILocalVariable(name: "adjusted_nbytes", scope: !1109, file: !1094, line: 252, type: !104)
!1123 = !{!114, !135, !111, !108, !98}
!1124 = distinct !DICompileUnit(language: DW_LANG_C11, file: !815, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1125, splitDebugInlining: false, nameTableKind: None)
!1125 = !{!813, !816, !818}
!1126 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1127, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1127 = !DIFile(filename: "lib/xstrtold.c", directory: "/src", checksumkind: CSK_MD5, checksum: "9163aa2ba8291d8ce5ef92018250850c")
!1128 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1129, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1129 = !DIFile(filename: "lib/xasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "284d06af3d9f59048744c48dba404142")
!1130 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1131, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1131 = !DIFile(filename: "lib/asprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f6cf1caf6d38b23e08bf76a6bab2ad95")
!1132 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1133, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1133 = !DIFile(filename: "lib/vasprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7a4c54d4c65964ef3a11b7593d1072df")
!1134 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1135, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1135 = !DIFile(filename: "lib/close-stream.c", directory: "/src", checksumkind: CSK_MD5, checksum: "7b802ca64750dec85f7eea1ad50ee78d")
!1136 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1137, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1137 = !DIFile(filename: "lib/fclose.c", directory: "/src", checksumkind: CSK_MD5, checksum: "ad074f61cd3a83174b525a3324caecb3")
!1138 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1139, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1139 = !DIFile(filename: "lib/fflush.c", directory: "/src", checksumkind: CSK_MD5, checksum: "fd92d10557b4b5e20aede7240a4a4773")
!1140 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1141, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1141 = !DIFile(filename: "lib/fseeko.c", directory: "/src", checksumkind: CSK_MD5, checksum: "3ad6c791d3bcb21db86895eea23fc225")
!1142 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1143, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1144, splitDebugInlining: false, nameTableKind: None)
!1143 = !DIFile(filename: "lib/reallocarray.c", directory: "/src", checksumkind: CSK_MD5, checksum: "f0edccd9d295409884b91dcf5eaca49d")
!1144 = !{!111, !98, !135}
!1145 = distinct !DICompileUnit(language: DW_LANG_C11, file: !870, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1146, globals: !1147, splitDebugInlining: false, nameTableKind: None)
!1146 = !{!135, !114}
!1147 = !{!868, !871}
!1148 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1149, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1150, splitDebugInlining: false, nameTableKind: None)
!1149 = !DIFile(filename: "lib/vasnprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "174f03498dcabe9ed191b65e1e15129b")
!1150 = !{!114, !137, !135, !92, !74}
!1151 = distinct !DICompileUnit(language: DW_LANG_C11, file: !878, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1152, splitDebugInlining: false, nameTableKind: None)
!1152 = !{!876, !879}
!1153 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1154, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1154 = !DIFile(filename: "lib/setlocale_null.c", directory: "/src", checksumkind: CSK_MD5, checksum: "78fb5c66611523b6220f70c846d34415")
!1155 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1156, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1156 = !DIFile(filename: "lib/setlocale_null-unlocked.c", directory: "/src", checksumkind: CSK_MD5, checksum: "e99679df43380940890d00903af688de")
!1157 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1158, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1062, splitDebugInlining: false, nameTableKind: None)
!1158 = !DIFile(filename: "lib/vaszprintf.c", directory: "/src", checksumkind: CSK_MD5, checksum: "69851cb8a605f8ae9d51cb31a58ffe0c")
!1159 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1160, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1061, retainedTypes: !1161, splitDebugInlining: false, nameTableKind: None)
!1160 = !DIFile(filename: "lib/printf-parse.c", directory: "/src", checksumkind: CSK_MD5, checksum: "8df94db1db3a2083e3b2e6f52a49af38")
!1161 = !{!137, !1162, !135, !1217}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "argument", file: !901, line: 174, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !901, line: 111, size: 256, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1164, file: !901, line: 113, baseType: !911, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1164, file: !901, line: 172, baseType: !1168, size: 128, offset: 128)
!1168 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1164, file: !901, line: 114, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "a_schar", scope: !1168, file: !901, line: 116, baseType: !257, size: 8)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "a_uchar", scope: !1168, file: !901, line: 117, baseType: !138, size: 8)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "a_short", scope: !1168, file: !901, line: 118, baseType: !967, size: 16)
